{
  "website_summaries": [
    {
      "verdict": "Effective training tips with a focus on positive reinforcement.",
      "pros": [
        "The book outlines weekly lessons that are clear and easy to follow",
        "The author uses anecdotes to effectively back up instructions and advice",
        "Book has a strong focus on positive reinforcement",
        "Back of the book includes space for your personal progress notes"
      ],
      "cons": [
        "Book is very text-heavy, could use more photos"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "An excellent resource for training your dog",
      "text": "An excellent resource for training your dog. At least I think it is... I missed the first chapter since our sweet doggie ate it. I did appreciate her desire to really digest the program and information contained in the book. Perhaps, in the future, you would consider an audio version of the book for the more difficult-to-train dogs?",
      "rating": 4.0,
      "verified": true,
      "author": "Ann Kirchner",
      "helpful_votes": 479,
      "publication_date": 20170311
    },
    {
      "title": "Decent Resource for New Dog Owners",
      "text": "There’s a lot of good advice in here. To be fair, it does say how to train the “best dog ever” and I think I’d be happy with my dog just being moderately well trained. Some of the tips are a little bit tedious, and depending on how involved you are, may seem like overkill. Personally, I’m not going to feed my dog by hand twice a day for weeks. But it generally gave us a good idea of how to get started when we adopted our rescue, and I think it’s important to have an understanding of how your behavior and reactions will establish your dog’s behavior.",
      "rating": 3.0,
      "verified": true,
      "author": "Lindsey W",
      "helpful_votes": 69,
      "publication_date": 20171128
    },
    {
      "title": "Very effective method",
      "text": "I read this book before I got my Shiba Inu puppy. He was 8 weeks old when I got him and immediately started using the techniques from the book. After 4 weeks he has \"sit\", \"down\", \"stay\" perfectly, and walks on a leash with reasonable ease. And he seems to understand what we are doing with this training thing. People are amazed that he can do so much at such a young age. I couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "tony",
      "helpful_votes": 67,
      "publication_date": 20170901
    },
    {
      "title": "Amazing Book!",
      "text": "Amazing book! A really easy read and I love that she also explains why doing certain things are important along with giving an example story. We followed this book religiously from the day we got our pup and he turned out to be the best trained dog I've ever had. I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 44,
      "publication_date": 20170303
    },
    {
      "title": "Useful info but disorganized",
      "text": "I like much of the information. You can skip the beginning - it's just a bunch of pointless name dropping. The problem is organization. It jumps all over and sends you referring to other parts of the book all the time. I couldn't keep organized in my head when to do what. It says it's organized by week, but I'm thinking no. On the other hand, there are lots of useful training tips and explanations. Useful, but a challenge to keep clear.",
      "rating": 3.0,
      "verified": true,
      "author": "Lauren V.",
      "helpful_votes": 8,
      "publication_date": 20181021
    },
    {
      "title": "Great teaining book!",
      "text": "Very good read! Bought this and Cesar's book. This one wins hands down! I referred to it every day while training our dalmatian and lab. Cesar's was more stories, this one told me what to work on and how to do it!",
      "rating": 5.0,
      "verified": true,
      "author": "S Anderson",
      "helpful_votes": 201,
      "publication_date": 20151015
    },
    {
      "title": "Better than many dog-training books",
      "text": "I adopted a rescue dog this year and after multiple conversations with two different long-time dog and adoption owners/personnel, this book provides the best successful core training concepts by providing: 1) Step by step details for different situations and dog issues; 2) training protocols that achieve success or will lead to success with consistent practice; 3) Gives clear tips on how praise and rewards (kindness - not pack mentality) and 4) strategies plus at the back of the book - a place to record progressive notes on how the dog is responding/learning. I feel fortunate to have picked this book to help me with training an older dog. It would especially be helpful for a new puppy.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 5,
      "publication_date": 20181206
    },
    {
      "title": "Misprinted book",
      "text": "Misprint! This book has several chapters printers twice while missing several other chapters. Do not purchase until they fix printing issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Justin Ferraccio",
      "helpful_votes": 8,
      "publication_date": 20191118
    },
    {
      "title": "Good advice but some things just didn't work with my dogs.",
      "text": "I purchased this book and Lucky Dog. These are my first dogs and we rescued two dogs age 1 and 2 years old. I thought they would be housebroken but they weren't. I tried the routine for housebreaking dogs from both books, which suggested using a kennel/playpen. I liked this book's advice about making it a happy place. Positive reinforcement didn't work alone for my dogs. What finally worked was praise when they did well but shaming them (without touching them) when they had \"accidents\". Lucky Dog advice was more helpful there.",
      "rating": 4.0,
      "verified": true,
      "author": "MJM",
      "helpful_votes": 3,
      "publication_date": 20181027
    },
    {
      "title": "Do not recommend this",
      "text": "The book bounces around with no continuity. She is a \"professional\" trainer, most people I know can't devote 24 hours a day to training a dog ... let alone adhere to her suggestion that you tie the dog to your waist ALL day long, hand feed it and use hand signals for commands and weeks late use verbal commands. Her heart is in the right place but this book is so confusing and difficult to follow it isn't worth the paper it is printed on. Shockingly I bought it because it was endorsed by the AKC. Don't get that at all!",
      "rating": 1.0,
      "verified": true,
      "author": "GeorgiaGirl",
      "helpful_votes": 3,
      "publication_date": 20191026
    },
    {
      "title": "Pages missing!",
      "text": "Seems like a great program, but pages are missing/in the wrong places in the paperback version I got! Why is Amazon even selling this book??",
      "rating": 1.0,
      "verified": true,
      "author": "Nancy Bell",
      "helpful_votes": 7,
      "publication_date": 20191116
    },
    {
      "title": "MISSING CHAPTERS!! DON'T BUY!!!",
      "text": "This book has clearly been misprinted for some time now as there are reviews that date back to 2017 that were also missing chapters. It doesn't matter how good/bad this book is if it's not a complete book. And clearly nobody cares to fix the problem. If you've purchased this book with missing chapters as well, leave a review and mark others like this as \"helpful\" so that they will be more visible to potential buyers. It's not worth the $10 to even return this. I'll be using it as tinder for my next fire. Amazon, STOP RECOMMENDING THIS BOOK!",
      "rating": 1.0,
      "verified": true,
      "author": "Alanna",
      "helpful_votes": 4,
      "publication_date": 20191123
    },
    {
      "title": "Bad publication run, missing chapters, don't buy paperback",
      "text": "Someone else wrote the review that remarked that pages were duplicated. I did not pay enough attention to that review. Pages 113-144 are missing. you can't follow the program with crucial chapters missing. This is for the paperback version of the book. However, this book offers what I need regarding puppy training and behavior that I can't tell if other puppy books address, so I'll be trying the Kindle version, hence the 2 stars.",
      "rating": 2.0,
      "verified": true,
      "author": "Logan",
      "helpful_votes": 3,
      "publication_date": 20191108
    },
    {
      "title": "This is a book for Novices",
      "text": "I purchased this book to get another idea how to train my puppy, but I didn’t find it super useful. I felt like I already knew what to do and this book just reafirm it. I also didn’t totally agree with the author on how to deal with assertive dogs. I felt (for me) that the Cesar Milan books were more helpful. This is a great book however for someone that has never owned a puppy before and has no idea on how to train.",
      "rating": 3.0,
      "verified": true,
      "author": "Murdoc",
      "helpful_votes": 4,
      "publication_date": 20180326
    },
    {
      "title": "Good training manual",
      "text": "there is a lot of preachy in here. I wish they ( Ian Dunbar is also guilty of this as well) would realize they are preaching to the converted. I was hoping for more specific - week one spend x amount of time on y, p and q exercises. The note taking he refers to is not user friendly. Needs more room to write. That being said there is a lot of good solid information here. I am on my second reading. I don't have my puppy yet , so may feel better when I have my buddy to practice.",
      "rating": 4.0,
      "verified": true,
      "author": "girorv",
      "helpful_votes": 4,
      "publication_date": 20180118
    },
    {
      "title": "Good information for first time puppy owners",
      "text": "Seems more like a book for new puppy owners than one for training a dog that you've already had, even though the description says can be good for both. Very good information, however a lot of the information is basic skills training such as sit and down. I will be following it as my dog needs to learn how to walk on a leash without pulling, but it is a little basic for a program. Will update after the 5 weeks. Also half the book is about further testing, training, showing dogs, and the author's life instead of training techniques.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "millionth dog, still a good reminder",
      "text": "Been a bit since I got a dog, and she was my first rescue, so a brush up on do's and don't's were a must. I was recommended this by a vet and thought it was GREAT - especially since my husband never had a dog. Great handbook",
      "rating": 4.0,
      "verified": true,
      "author": "Season",
      "helpful_votes": 3,
      "publication_date": 20190315
    },
    {
      "title": "Good Read",
      "text": "Love this book. I have a busy schedule and cant afford a class. This book is organized into weeks of training. I read this book and did the sessions with my dog as if it was a class. It is detailed and offers great advice. My dog had learned a lot and so have I.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelby",
      "helpful_votes": 5,
      "publication_date": 20170917
    },
    {
      "title": "my Puppies for Dummies book a better read for simplistic puppy training for the common person",
      "text": "A bit wordy. The book could be shorter in length and just focus on puppy training basics. But, my Puppies for Dummies book a better read for simplistic puppy training for the common person.",
      "rating": 3.0,
      "verified": true,
      "author": "DA",
      "helpful_votes": 5,
      "publication_date": 20170829
    },
    {
      "title": "Great training book even if you already know how",
      "text": "This book is great. I have been training dogs similarly (using positive reinforcement) for decades and I still learned a lot and got great ideas. It has a wonderful ideas for retraining dogs who have been trained with old school negative or punitive reaction to train and a chapter about problem behaviors. The writing style is easy to read and understand and there are a bunch of how to photos. The first 30 days with your new dog are very important and I definitely recommend getting this book either before getting a new dog or teaching an older pal new tricks.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen D",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "It has good information but seems to be aimed towards puppy training",
      "text": "This book is well written. It has good information but seems to be aimed towards puppy training. I'm not convinced that this is the book/theory is for me and the way I want to train but I'm sure it has its place for the right dog and owner somewhere.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicholas",
      "helpful_votes": 3,
      "publication_date": 20180404
    },
    {
      "title": "Lots of good information.",
      "text": "Pretty good. Doesn't flow as great as I'd like. I was expecting a bit more direction but a lot of the information provided is really really good. Such as the hand feeding immediately and some of the psychology of dogs. Well worth a read for dog owners both new and old.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20170912
    },
    {
      "title": "First Time Dog owners must read",
      "text": "Good information. I just need to follow it consistently. The book is easy to read and understand. The author seems knowledgeable about dog behaviors and training methods.",
      "rating": 5.0,
      "verified": true,
      "author": "ChrisK",
      "helpful_votes": 6,
      "publication_date": 20161202
    },
    {
      "title": "Technique does not work",
      "text": "We all start off with saying “positive reinforcement only” for training but truth is.. you NEED negative reinforcement with a dog or they will run all over you and think they are the leader instead of you. This book is dumb and the techniques do not work. I learned more watching youtube videos from Method K9. Refer to Method K9’s social media for any large breed strong or aggressive dog. I have a German Shorthaired Pointer who is growing stronger each day. The techniques in this book did not work at all",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Smith",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Step by Step Guide",
      "text": "This is one of three puppy training books I found. The others are good but too much is left open to interpretation. I like this one because it has example schedule and detailed steps including if the primary, secondary approaches didn’t work. Perfect amount of detail and well laid out into weekly chapters. I wasn’t overwhelmed reading the entire book and feeling like I had to memorize it. I read the whole book prior to our new puppy and then did refresher chapters in the 5 week increments.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Oppenheimer",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Train with Love for the best dog ever!",
      "text": "Love this book. I send a copy home with every puppy i sell and also with every dog I volunteer train for Pets for Vets! Positive Reinforcement Lessons Homework Train with ❤️",
      "rating": 5.0,
      "verified": true,
      "author": "janet smith",
      "helpful_votes": 3,
      "publication_date": 20181105
    },
    {
      "title": "Buy before getting a puppy or dog",
      "text": "I think there is great info but it would be beat to purchase before getting a dog rather than after. There is info regarding if you are training a dog you have already or already trained but most of the info is best utilized for a new puppy and would work best if read before bringing it home.",
      "rating": 4.0,
      "verified": true,
      "author": "Melissa Robbins",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Great training book",
      "text": "Great training book with lots of common sense hints on training your new dog. I bought this book all also Lucky Dog Brandon McMillan’s training book.",
      "rating": 5.0,
      "verified": true,
      "author": "Noanie",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "We loved this book!",
      "text": "When we got our rescue dog, we purchased 3 dog training books and this was by far the best and most effective one. The methodology worked well for us and our dog, and it was written in a very clear, logical manner. We still reference it often. I read through other reviews that were upset with the author's objections to Cesar Milan's approach, but I think she treats this very fairly and is providing a strong alternative to the 'alpha dog' mentality: positive reinforcement. It keeps us and our pup well-trained and happy! I mean if it works for Bo Obama... I can't think of a better endorsement.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy B",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "waste of time & money",
      "text": "don't get why people highly rate this book......not much helpful info......for example, if you go to \"stop counter surfing\". all they tell you is to not put food near front edge of your counter......duh",
      "rating": 1.0,
      "verified": true,
      "author": "Bob Y.",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Life Saver",
      "text": "I am only into week 2 of training my dog but I can already see a difference it has made. My puppy is a hyper 10 month old fur baby but this book has given me the confidence I need to know that he will made a find addition to our family once he / we are trained.",
      "rating": 5.0,
      "verified": true,
      "author": "EW",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Excellent purchase. This is very informative and covers all ...",
      "text": "Excellent purchase. This is very informative and covers all the right information and training skills. Great tips and guidelines and breakdowns to make it easy to follow and learn. And it comes in big font with diagrams and pictures that are a big help for those of us who need glasses. It is easy to read and follow. It even has worksheets and training checklists for the student to keep track of their progress. Great resourse for all training.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170819
    },
    {
      "title": "The book is full of helpful advice. I wish ...",
      "text": "The book is full of helpful advice. I wish it there were bulleted steps of the training methods, not paragraphs to make reading the steps quicker. But that is more of a reflection of my own preferences regarding instructions.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Adia",
      "helpful_votes": 3,
      "publication_date": 20170608
    },
    {
      "title": "Excellent Technique!",
      "text": "Love the techniques used in this book. Was able to teach my lab her first new command in just a few hours. We still have a lot of work to do with her, but I am very confident that between our lab's high level of intelligence, the positive reinforcement techniques to ward off unwanted behavior and consistency between all members of the family, our lab will reach her full potential! Since purchasing this book, we have put away the correction collar that we were struggling with. Positive reinforcement is definitely the way to go!",
      "rating": 5.0,
      "verified": true,
      "author": "Deb",
      "helpful_votes": 5,
      "publication_date": 20170424
    },
    {
      "title": "Great book, read it before you bring your new puppy home!",
      "text": "I read this book to help train our 10 week old chcolate lab puppy. There are a ton of great tips for training a happy well behaved dog. My only regret is I did not read the book before we got our puppy, so I could have started the training right away. This book is centered on rewarding your dog for the right behavior and ignoring or distracting your puppy away from bad behavior.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Wolfe",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Very effective!",
      "text": "We got a puppy during quarantine. It was the perfect time to really implement all the techniques in this book consistently. I have been working with our puppy, 4 months old, for a week, and she is already progressive to week 4 abilities. If you can follow every technique in the book, your dog will progressive very quickly. It really is amazing! That said, Im sure the same is true with any other training book or program... However, I like the authors approach of positive reinforcement and the layout of the book. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Joliver",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "My favorite of 4 or 5 dog training books",
      "text": "I have several dog training books acquired over many years. I use this one now for my new puppy and I find it more helpful than others and the author's methods are very effective.",
      "rating": 5.0,
      "verified": true,
      "author": "glensynapse",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "All over the place",
      "text": "Had potential, but the author is all over the place. It’s not concise, filled with philosophy and repetitiveness. Worse, once you think you’re on the right track you’re referred to this page, that page. Perhaps the author and publisher will toss this and do a rewrite.",
      "rating": 1.0,
      "verified": true,
      "author": "Martin",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Three Stars",
      "text": "Don't love how the book was written, long read to get to the point.",
      "rating": 3.0,
      "verified": true,
      "author": "Morgan Summers",
      "helpful_votes": 3,
      "publication_date": 20170521
    },
    {
      "title": "Someone recommended me this book",
      "text": "One of the best books recommendations i've ever received. The way the author stablish the dog training concepts and compare them with things such as rising your kids is incredible useful and truth.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesus Toribio",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Good for some not for all.",
      "text": "Everyone's dog is going to be different so it's hard to stay objective about a product like this. So I am just going to review based on my dog and our experience, I found that this book's approach did not entirely work. I borrowed some approaches from this book and others and have a well trained dog now.",
      "rating": 3.0,
      "verified": true,
      "author": "Atticus",
      "helpful_votes": 2,
      "publication_date": 20170616
    },
    {
      "title": "were doing great! might hold off on professional training because she's ...",
      "text": "im on week one with my 8 week old chocolate labradoodle and this book is a god send! were doing great! might hold off on professional training because she's doing so well",
      "rating": 5.0,
      "verified": true,
      "author": "AB",
      "helpful_votes": 2,
      "publication_date": 20171025
    },
    {
      "title": "Humane way to train",
      "text": "Great book great humane way of training, I am re-training a dog that was trained with a collar and he is responding so much better to this type of training. My puppies to pick it up really quickly",
      "rating": 5.0,
      "verified": true,
      "author": "creske",
      "helpful_votes": 11,
      "publication_date": 20170308
    },
    {
      "title": "There are many great reference books out there for dog training",
      "text": "There are many great reference books out there for dog training; count this among them. Personalyl I like to take ideas from multiple sources and adapt the training to fit the needs of my dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "great book",
      "text": "If you have a brand new puppy, or a younger misbehaved doggo, you need this book. walks you through all the steps you need to know from feeding to housebreaking...",
      "rating": 5.0,
      "verified": true,
      "author": "Andrijana",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Great Training Guide",
      "text": "Very clear and helpful directions for dog training. Matches very closely with the local dog training class we attend. So they reinforce each other, while providing additional training hints to try.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Marchlewicz",
      "helpful_votes": 2,
      "publication_date": 20171212
    },
    {
      "title": "well-written, professional, and thorough",
      "text": "Super easy to read through and understand, very clear steps on what to do, as well as when, why, and how. It is well-written, professional, and thorough. I'm so excited to put it into action as soon as I get my puppy, and feel very prepared having read this book. I know I will be referring back to it again and again!",
      "rating": 5.0,
      "verified": true,
      "author": "Claudia Louise",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "A good practical read",
      "text": "I’ve read about ten books about training your dog, to me this one is the best. The authors methods make good sense and, much to my delight, worked quickly. Our family is much happier.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Great advice and information for new dog owners!",
      "text": "It’s been 1 year since I’ve owned this book and been a dog owner for the first time. I remember how much I benefited and enjoyed this book for new dog owners. It helped me tremendously!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Helpful training tool",
      "text": "Great book with helpful training techniques. The positive approach gives insight to remind me that my pup is learning and not doing things to frustrate me. It makes sense.",
      "rating": 5.0,
      "verified": true,
      "author": "DD",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Great book",
      "text": "I have had dogs before but this book taught me a few things!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Son and daughter-in-law and our granddaughters are following the suggestions in the book and I think they have a good handle on a very headstrong puppy",
      "text": "Ideas in the book are producing remarkable results with German Shorthair Pointer puppy. Son and daughter-in-law and our granddaughters are following the suggestions in the book and I think they have a good handle on a very headstrong puppy!",
      "rating": 5.0,
      "verified": true,
      "author": "DREW DANIELS",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Pages and chapters missing from the book",
      "text": "The book was assembled improperly and chapters were out of order and parts of the book are missing altogether- it appears there is some solid advice in this book but it would be nice to own the whole book instead of mixed up parts of it",
      "rating": 3.0,
      "verified": true,
      "author": "C Goldsmith",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "A good read",
      "text": "Many useful tips and instructions. Well written plan to help with your dog training. I know it helped me with our rescue dog training.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Positive Reinforcement?",
      "text": "How can you say you are a \"positive reinforcement\" trainer when you condone shock collars and/or invisible fences?",
      "rating": 1.0,
      "verified": true,
      "author": "K. M.",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Easy 5 week manual",
      "text": "Easy to follow 5 week training book! After reading, almost every dog we come across we can train! I highly suggest reading!",
      "rating": 5.0,
      "verified": true,
      "author": "TES",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "This is a book I HIGHLY recommend! It has worked Great for my dog and ...",
      "text": "This is a book I HIGHLY recommend! It has worked Great for my dog and we only made it to week 3. I am a very busy pet sitter and don't have much time to work with my dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen",
      "helpful_votes": 2,
      "publication_date": 20160605
    },
    {
      "title": "Great book for all dog owners but especially NEW dog owners",
      "text": "Great book. Very informative even for an experienced dog owner. Gave copy to a friend who got their first puppy and they rave about how helpful it is.",
      "rating": 5.0,
      "verified": true,
      "author": "suzagorilla",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "A good buy.",
      "text": "I own a lot of dog training manuals but this is my \"go to\" book. Straight forward and basic. Covers the everything. A good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Rebekka Spaulding",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "New dog? 1-Click this book!",
      "text": "Great Dog OR Puppy training book that takes you through your important first months together. Author is clear, concise & has good schedule ideas for training PUPPY & FAMILY in first year. One you will want to return to for answers to dog behavior problems, later, if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly Brown",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "Good tips for training",
      "text": "Haven’t really gotten too far into it but has good tips & training methods that work when you spend the time to work with the dog.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Step-by-step oriented.",
      "text": "I like that it is more instruction oriented. Most training books are filled with stories that make it hard to find the instruction, and while this book does include its share of stories, it is more clear than most. I appreciate that.",
      "rating": 4.0,
      "verified": true,
      "author": "eb",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "Training the Best Dog ever.",
      "text": "This book is clearly written step by step. It also has check lists in the back to follow when training. It is the best I have seen.",
      "rating": 5.0,
      "verified": true,
      "author": "glady??",
      "helpful_votes": 2,
      "publication_date": 20170410
    },
    {
      "title": "Excellent advice for dog training.",
      "text": "So far I’m finding the book very helpful working with a traumatized dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Áinne Uí Shuíbhne",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Would definitely recommend to anyone!",
      "text": "This book helped me train my 10 week old puppy to sit and lay within two days. I was unable to keep up with the 5 week plan, however I feel the book gave a great base for me to train on. I already purchased the book again as a gift and would definitely recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "jesitaylor",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "A great book that was easy to read with very clear",
      "text": "A great book that was easy to read with very clear, make sence instructions. I will definitely be following the 5 week training program with our new puppy. What I liked best was the use of positive reinforcement philosophy. I highly recommend this book for those training puppies and as a reinforcement of good training techniques.",
      "rating": 5.0,
      "verified": true,
      "author": "WendyK",
      "helpful_votes": 0,
      "publication_date": 20160123
    },
    {
      "title": "One of the best books that I have read",
      "text": "One of the best books that I have read. We have a very headstrong GSD. But making progress, with the diva.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan Cohen",
      "helpful_votes": 4,
      "publication_date": 20150513
    },
    {
      "title": "Helpful Training Material",
      "text": "Love this book. It is all about positive reinforcement and not shaming or screaming at your puppy. Definitely reccomend. It was very helpful for training our excitable goldendoodle.",
      "rating": 5.0,
      "verified": true,
      "author": "Shadaisy",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Great help",
      "text": "This. Is the training I believe in. Positive and informative. Great read. Helped me realize what the dog is experiencing",
      "rating": 5.0,
      "verified": true,
      "author": "Donna G. Aubuchon",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Great book with wonderful training ideas",
      "text": "I am in the process of training my dog and am so impressed. Great book with wonderful training ideas!",
      "rating": 5.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 3,
      "publication_date": 20161116
    },
    {
      "title": "Very clear and prescriptive",
      "text": "Very prescriptive and clear. This book provides a great schedule for training your puppy. YOu probably wont get finished in 5 weeks but it is a very good roadmap.",
      "rating": 5.0,
      "verified": true,
      "author": "Lew Bowers",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Good training book",
      "text": "This is a very good book, and I'm having quite a bit of success training my rambunctious puppy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "No where mam",
      "helpful_votes": 2,
      "publication_date": 20170923
    },
    {
      "title": "Easy to read",
      "text": "Easy to read, easy to follow instructions. Overall, a great book to have in your library if you are committed to training your dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Hc",
      "helpful_votes": 4,
      "publication_date": 20150511
    },
    {
      "title": "Works Great would recommend to anybody.",
      "text": "Very effective. My Lab puppy is much better disciplined because of this book. My only complaint is I feel the author is a bit wordy.",
      "rating": 4.0,
      "verified": true,
      "author": "Stalones",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "If you're having behavior issues with your puppy or dog, get this bood.",
      "text": "This is a good book if you are seeking advice on training your puppy or dog. Especially good for first time dog owners. There are no bad dogs, just uninformed/uneducated dog owners. Highly recommend this book.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20170412
    },
    {
      "title": "Not my first dog training book I have ever owned ...",
      "text": "Not my first dog training book I have ever owned or read. Everything in this book works on our Schnoodle Kacey. Positive reinforcement seems to be a much quicker way for Kacey to learn than correction training.",
      "rating": 5.0,
      "verified": true,
      "author": "Tex Salerno",
      "helpful_votes": 2,
      "publication_date": 20160124
    },
    {
      "title": "11yr old loved this book after adopting 1st puppy!!",
      "text": "Got this as a Christmas present for my 11yr old little sister to read as she just adopted her first puppy. She loves the book and is learning quickly. She says it was easy for her to follow. She finished it in less than a week and is excited to train her new best friend!",
      "rating": 5.0,
      "verified": true,
      "author": "Lacey",
      "helpful_votes": 0,
      "publication_date": 20160113
    },
    {
      "title": "Interesting",
      "text": "Interesting stories and training methods. Haven't had a chance to test any of the methods yet, but I think this book will help.",
      "rating": 5.0,
      "verified": true,
      "author": "PD",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Very good book, my boys are on their way to ...",
      "text": "Very good book, my boys are on their way to becoming we'll manored companions! They are 4 years old, but they are mastering the commands. Without aggressive force!",
      "rating": 5.0,
      "verified": true,
      "author": "Lloyd johnson",
      "helpful_votes": 3,
      "publication_date": 20151028
    },
    {
      "title": "great book for training obedience",
      "text": "This book has been helpful in planning a training program for our recently acquired 3 year old Golden Retriever. I like the approach and detailed progressive schedule for training. Very easy to understand I recommend it for any dog owner, especially for training puppies.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Great book",
      "text": "I'm training my dog with this guide by following the 5 week program.",
      "rating": 5.0,
      "verified": true,
      "author": "Ama-Purchaser",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Love the book",
      "text": "Love this book but have not gotten all the way through it.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Wood",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Dog training.",
      "text": "Love her approach to dog training. Will use this book when I get my new pup in a few months.",
      "rating": 5.0,
      "verified": true,
      "author": "Carla Jilek",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Best dog training book I’ve read",
      "text": "Best dog training book I’ve read, with a nice approach to training, better than some othe approaches I have read.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "Ready for the new family member.",
      "text": "Had new information and ideas for this dog lover. Ready for my Goldendoodle!",
      "rating": 5.0,
      "verified": true,
      "author": "Helen R. Edwards",
      "helpful_votes": 2,
      "publication_date": 20170126
    },
    {
      "title": "Best dog book ever",
      "text": "This book is very well written and gives lots of easy to achieve methods for training your dog. My dog Willow is one year old now and has a growing foundation for learning as we progressed through this book love it! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Okay",
      "text": "A well written book. I wished we would have read it before we had gotten our dog. There should be a chapter on how you change older dogs bad habits.",
      "rating": 4.0,
      "verified": true,
      "author": "Lucy",
      "helpful_votes": 2,
      "publication_date": 20171224
    },
    {
      "title": "Great book",
      "text": "We have a new puppy and this book sure helped ! A puppy MUST be watched since they like to get into everything and chew.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20170330
    },
    {
      "title": "Good for older dogs but a must if youre planning on a new puppy",
      "text": "Good ideas and well outlined. Just keep in mind every dog is different and needs constant reinforcement and practice to get results but with this book you're sure to achieve them.",
      "rating": 4.0,
      "verified": true,
      "author": "Tyler Dean Duncan",
      "helpful_votes": 0,
      "publication_date": 20160307
    },
    {
      "title": "Great advice!",
      "text": "This is a very good book. Very helpful. I highly recommend it. Much better than the $500 dog trainer I hired!",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Brand",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Great book with great tips",
      "text": "Great book with great tips! I loved this book and I feel like a pro trainer now. Our puppy is well behaved and super sweet. I'm glad I made this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria, 27",
      "helpful_votes": 4,
      "publication_date": 20160715
    },
    {
      "title": "One of my favorite books I bought",
      "text": "One of my favorite books I bought. I like that it has what you should do everyday to help your dogs be the best behaved. So far it seems to be working with my 2 puppies. Thanks again for writing it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Lewis",
      "helpful_votes": 0,
      "publication_date": 20160127
    },
    {
      "title": "Wonderful read",
      "text": "Best Dog Ever is perfectly suited to its subject. It is written in a warm, friendly, and patient tone, designed to engage and inspire anyone into being a better friend and owner to his or her dog. I loved this book...and not just for the tricks!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Be good to your dog",
      "text": "The best way to train your pet. With love and kindness.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Strandberg",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Four Stars",
      "text": "My dog responds very well to the tips and training materials.",
      "rating": 4.0,
      "verified": true,
      "author": "Joseph Ellis",
      "helpful_votes": 0,
      "publication_date": 20171119
    },
    {
      "title": "Great dog training book",
      "text": "This book was extremely helpful. I recommend this book if you need help training your dog.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Valdez",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Great book, but I work 40hr a week so ...",
      "text": "Great book, but I work 40hr a week so I didn't think some of the training would work with my schedule.",
      "rating": 5.0,
      "verified": true,
      "author": "Nichole",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "Five Stars",
      "text": "Easy, straightforward and to the point for a quick but effective short term course.",
      "rating": 5.0,
      "verified": true,
      "author": "rrgg",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Have not finished the book yet but very happy with her ideas and the details she gives in ...",
      "text": "Have not finished the book yet but very happy with her ideas and the details she gives in her philosophy and in her training",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay Barstow",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "Informative and Well Written",
      "text": "With a background in behavioral therapy I love positive reinforcement and wanted to learn how to best help my dog. This book was very informative and enjoyable to read, many tricks that have helped my older rescue dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Becky",
      "helpful_votes": 0,
      "publication_date": 20200222
    }
  ],
  "product_meta": {
    "title": "Training the Best Dog Ever: A 5-Week Program Using the Power of Positive Reinforcement",
    "rating": 4.4,
    "specifications": {
      "Item Weight": "1 pounds",
      "Paperback": "304 pages",
      "ISBN-10": "9780761168850",
      "ISBN-13": "978-0761168850",
      "Publisher": "Workman Publishing Company; Reprint Edition (September 25, 2012)",
      "Product Dimensions": "6 x 0.75 x 9.94 inches",
      "Language:": "English",
      "ASIN": "0761168850",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Books",
      "Crafts, Hobbies & Home",
      "Pets & Animal Care"
    ],
    "price": ""
  }
}