{
  "website_summaries": [
    {
      "verdict": "Kids build grammar skills by combining color-coded word cards to create quirky sentences.",
      "pros": [
        "Comes with 124 cards color-coded by nouns, verbs, and adjectives",
        "Designed for up to 4 players",
        "Helps kids learn the parts of speech as well as what makes a complete sentence"
      ],
      "cons": [
        "Limited word options",
        "May appeal more to the lower end of the age range"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Trash product",
      "text": "I purchased a similar sentence building game to play with my 5 year old that was a lot of fun. so I wanted to do silly sentences. purchased this but you can only make the same 2 or 3 silly sentences over and over again. this is a complete waste of money, save your money. 5 boards of the same exact words......come on people....",
      "rating": 1.0,
      "verified": true,
      "author": "ProckMeister",
      "helpful_votes": 4,
      "publication_date": 20200327
    },
    {
      "title": "This game is fun!",
      "text": "I was surprised at how heavy this box was! This game came with so many pieces. I purchased this to use in my son's homeschool, (he's 6, 2nd grade), and it did not disappoint! It was a fun learning experience with lots of laughs! Definitely a new favorite! I liked how the puzzle pieces together, too. You can't place a verb with another verb, and so on. It makes constructing sentences very easy and comprehensive. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi Renee Burnett",
      "helpful_votes": 3,
      "publication_date": 20200420
    },
    {
      "title": "Buy this now!!",
      "text": "Excellent game my sons loved it. Initially my older son didn’t want to play but then he saw how much fun his brother and I were having he decided to join. The game seems pretty sturdy and is holding up very well we’ve had it over a month and play very often. I recommend all parents with little readers purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Aa A",
      "helpful_votes": 4,
      "publication_date": 20190615
    },
    {
      "title": "Love the silly sentences",
      "text": "I bought these silly sentences for our writing center at home. They are so awesome. They are a great addition to our writing station and homeschooling routine. My son loves them and cracks up over the silly sentences he can create. They are a great addition for homeschooling, Public School teachers, and even just to supplement your child's learning at home as well. I am very happy with the product and will be buying from DK games again.",
      "rating": 5.0,
      "verified": true,
      "author": "TLChronicles",
      "helpful_votes": 8,
      "publication_date": 20150807
    },
    {
      "title": "Fun and educational.",
      "text": "My autistic son is learning to read because of this'game'. It makes it fun, and it's hands on. His hands and his brain are busy. The puzzle pieces are sturdy. The pictures are real, not cartoon.",
      "rating": 5.0,
      "verified": true,
      "author": "mshroyer7",
      "helpful_votes": 3,
      "publication_date": 20181127
    },
    {
      "title": "Sneaky Learning",
      "text": "I love games like these where kids are having fun and don't know they're learning. My 5 year old loves laughing over sentences he comes up with, and it's opened the door to talk about parts of speech and to work on reading short sentences. I like that the pieces won't fit unless the sentence makes sense grammatically, and I was impressed that there are so many words included. We've never run out of words to make more sentences. It's been a big hit and a nice addition to homeschool stations.",
      "rating": 5.0,
      "verified": true,
      "author": "LH",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Doesn't have the word \"and\" and words will only fit certain ways together.",
      "text": "These are great for beginners I think, but my kids really wanted to make long sentences and to be creative. We made one of the \"a\" cards into \"and\" but because the puzzle piece ends aren't all the same, it makes the line messy looking. My kids wanted to be able to say \"The crocodile ate the school and house\" and since we added \"and\" it works enough now to satisfy them. Even so, I wish that it had come with conjunctions already.",
      "rating": 3.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Great gift",
      "text": "I bought this for my nephew as a 6th birthday gift. He opened it and I helped him sort the words by type (though he was able to do it himself once we got going as they are color coded) and he started making sentences right away. He enjoyed reading the silly sentences he had made to everyone. I would definitely recommend this for a child who has basic reading skills.",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 3,
      "publication_date": 20181025
    },
    {
      "title": "Just okay.",
      "text": "This game is cute, but not really a game at all. There are a lot of small words that are not included in the game but could make it a lot better. Also when trying to form sentences the words fit together like puzzle pieces and sometimes the pieces don’t fit together even though the words technically do. For the price I think it’s good, but my six-year-old probably will only play with it a few times before she gets bored.",
      "rating": 3.0,
      "verified": true,
      "author": "Justin Sansonetti",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Got it for my classroom and my students love it. I'm a special education teacher and I ...",
      "text": "Got it for my classroom and my students love it. I'm a special education teacher and I like that it helps students who are not able to write sentences independently have a model. I only wish there were more options (sentence structure is limited), but for the price it is great. I also like that it makes it hard to connect puzzle pieces if the sentence does not make sense (word type has to go in a particular order).",
      "rating": 4.0,
      "verified": true,
      "author": "C-Dog",
      "helpful_votes": 6,
      "publication_date": 20150218
    },
    {
      "title": "Very Enjoyable and Effective Learning Game",
      "text": "This is a well thought out game for new readers who are ready to learn very basic grammer. The physical quality is also very high. We are keeping the card residue to create other word groups when our grand daughter masters the basic game. The negative forms are made of sturdy card board so we can keep this going for a very long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 6,
      "publication_date": 20161203
    },
    {
      "title": "Fun and encourages reading",
      "text": "My daughter is a beginner reader and was struggling because she wasn’t really interested in books on their own or some of the other learn to read games. She really enjoys this and likes to spend a solid hour at a time using all the word pieces and creating sentence after sentence with this fun game!",
      "rating": 5.0,
      "verified": true,
      "author": "Holly C",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Total Hit!",
      "text": "Ordered for my 8 yr old grandson for birthday gift. He is just starting to really like board games and I can never resist ordering something educational for the grand kids. He loves this game as he can play either by himself or with sisters/parents/friends. Really keeps all of them laughing at the silly sentences and makes learning fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Grammalammadingdong",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Not bad beginner level",
      "text": "Not bad at all for the price. It’s at about a first or K level? My dyslexic daughter likes it, just realize there are only limited word options. I like how the words fit together as puzzle pieces. I might get the more difficult levels.",
      "rating": 5.0,
      "verified": true,
      "author": "amazoner",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Not silly enough",
      "text": "We have a number of reading games at home and while this one is not a huge favorite, it isn't the worst either. I like the variety of words for my early reader to work on, but you can only make the sentences marginally fun and silly.",
      "rating": 3.0,
      "verified": true,
      "author": "H.A.",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Great product!",
      "text": "I bought this as a homeschool supplement to help my kiddo with forming complete sentences, word recognition, and using descriptive words. This meets those expectations and it's fun to read the silly sentences she comes up with.",
      "rating": 5.0,
      "verified": true,
      "author": "Truth Teller",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "All verbs are past tense",
      "text": "Great idea and liked the graphics. The lack of a variety of verbs limits what you can create. Have thought about adding some verbs of my own. If I hadn't punch out all the items I would most likely return. Will see if I can donate to a school. Might be better used in a classroom center.",
      "rating": 2.0,
      "verified": true,
      "author": "carol",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Fun",
      "text": "Son s as md daughter both love this game. They can’t make sentences that are grammatically incorrect.",
      "rating": 5.0,
      "verified": true,
      "author": "Frijol",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Make your own. It's cheaper and probably more fun.",
      "text": "Very limited choices for making sentences. First grader might find it fun, but second and older are definitely bored with this game.",
      "rating": 2.0,
      "verified": true,
      "author": "TX Florist",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Fun for a day",
      "text": "It’s fun but limited. The shapes of the pieces make it impossible to make funny sentences. I assume it is to teach proper sentence format but when we play we feel limited with our choices.",
      "rating": 3.0,
      "verified": true,
      "author": "K. Aggson",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Fun and versatile!",
      "text": "My kids (10, 7, 3) all LOVE this \"game\". We don't always use it as a game, sometimes it's just for creating funny writing prompts. Really well made and versatile for our homeschooled family.",
      "rating": 5.0,
      "verified": true,
      "author": "Caitlin Chapman",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Fun & helpful for ages 4-7.",
      "text": "Great and fun product to use and play with your youngster. Encourages creativity and a great learning tool for pre-K.",
      "rating": 5.0,
      "verified": true,
      "author": "LALLAW",
      "helpful_votes": 2,
      "publication_date": 20180211
    },
    {
      "title": "Eh",
      "text": "Wish it listed whether the word was a verb or noun etc. Instead of being color coded (with no guide). My kids didn't like it.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "An excellent and fun way to teach sentence structure.",
      "text": "My 3rd grade students have so much fun creating silly sentences. If the sentence isn't done correctly the pieces don't fit so it's self-correcting. It's basically a one-sentence completion. It would be very interesting for older kids to make compound sentences, as well.",
      "rating": 5.0,
      "verified": true,
      "author": " B2",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Game for teaching sentence structure.",
      "text": "Kids like it to make sentences. Storage isn’t easy if the parts of speech are divided and grouped together for easy and quick use.",
      "rating": 4.0,
      "verified": true,
      "author": "G. Markum",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "You have to buy it.",
      "text": "What a great idea! As soon as I opened the box, 4 year old was ready to play. We played for a 1/2 hour straight. Love this game.",
      "rating": 5.0,
      "verified": true,
      "author": "Faye M. Davenport",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "All age groups! Perfect gift!",
      "text": "I start using this with my 3 years old baby. He loves to make sentences and enjoys a lot..... the sentences he make a are really silly and we laugh a lot! Good product. Reading and sentence making is so easy to teach your kid. I recommend this product for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Shahzeb",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Great!",
      "text": "Best game to help kiddos to read! After playing once, my 5 year old is starting to read the sentences all on her own!",
      "rating": 5.0,
      "verified": true,
      "author": "Kylie McKie",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "My kids love using this Silly Sentence game once a week during school!",
      "text": "My kids love using this Silly Sentence game once a week during school! It's an awesome learning game. I would highly recommend buying this to anyone with school aged kids that are currently learning to read and write!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. W",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "5 stars",
      "text": "My autistic sons can’t stop laughing as they match those silly sentences",
      "rating": 5.0,
      "verified": true,
      "author": "designer",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "who's very smart loves to play it with her parents",
      "text": "My 4 year old niece, who's very smart loves to play it with her parents. great gift for a child who has everything!",
      "rating": 5.0,
      "verified": true,
      "author": "Stuie",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Great product!",
      "text": "Such a great product and value. My Kindergarteners love making these silly sentences. My only complaint is that I wish the box had compartments to organize the pieces better. My kids spend a lot of time trying to sift through all the pieces trying to find the word they want, which ends up being a big mess on the table and takes a long time to clean up. I have tried limiting the number of pieces I Iet them use at one time, but they always seem to be looking for the word I didn't put out!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura A. Fisher",
      "helpful_votes": 0,
      "publication_date": 20160401
    },
    {
      "title": "My students love this puzzle",
      "text": "My students love this puzzle. I hear a lot of laughter when they read the silly sentences. I just wish it was sturdier. I use it with first graders. They can be rough on cardboard puzzles. I think it will last one more year. I recommend it even if it might have to be bought again after a few years if it is used in a classroom.",
      "rating": 4.0,
      "verified": true,
      "author": "ASH",
      "helpful_votes": 0,
      "publication_date": 20150816
    },
    {
      "title": "Great product!",
      "text": "My students love using these to make silly sentences during centers.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous ",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "My 5 1/2 yr old granddaughter loves this and I ...",
      "text": "My 5 1/2 yr old granddaughter loves this and I also used in my first grade class as a literacy center.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Floyd",
      "helpful_votes": 2,
      "publication_date": 20170816
    },
    {
      "title": "Great for English Learners",
      "text": "I purchased this product to use with several ESL students that I tutor. So far I have used it with K-5 students, and all have enjoyed it. Even my more advanced English language learners got a kick out of the silly sentences and as a teacher I appreciate that it reinforces parts of speech and articles which are sometimes challenging for these students. My only complaint is that the verbs are limited, but I think my advanced students could make a project out of creating their own puzzle pieces. All in all, a helpful tool for kids new to english.",
      "rating": 4.0,
      "verified": true,
      "author": "Magdar",
      "helpful_votes": 17,
      "publication_date": 20110301
    },
    {
      "title": "Reading Aid",
      "text": "I bought this for my granddaughter and she loves making silly sentences. She's learning and doesn't even realize it.",
      "rating": 5.0,
      "verified": true,
      "author": "ABS",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Fun!",
      "text": "A really fun game. My kids are 6 and 4 and need help making the sentences but they love reading them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Wall",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Just two verbs in the box? Silly=\"ate\"",
      "text": "Very small variety of words- I even went back and checked the card punchouts to see if I accidentally received duplicates (I didn't.) plenty of nouns, but only two verbs and prepositions- not very silly. Kids had fun first time, bored the second.",
      "rating": 2.0,
      "verified": true,
      "author": "Colin J. Sullivan",
      "helpful_votes": 3,
      "publication_date": 20160302
    },
    {
      "title": "Good learning tool. Just a lot of pieces to pick up",
      "text": "Good learning tool. Just a lot of pieces to pick up",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer ",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Silly Sentences--- Excellent Learning Tool, but Somewhat Limited.",
      "text": "I got this for my four year old daughter and she loved it. I gave it a 4 star because it is somewhat limiting. Within minutes of the game she was asking for words like 'and' and 'I' which were not included. A great feature would be to have some blank tiles that you can add other words as your child uses it more. I am going to cut some cardboard pieces to supplement with the words that she needs.",
      "rating": 4.0,
      "verified": true,
      "author": "Shopaholic",
      "helpful_votes": 0,
      "publication_date": 20140301
    },
    {
      "title": "Cute game",
      "text": "It needs more variety, especially with the verbs, but my 1st grader likes making long, crazy sentences with this game. It's a fun way to introduce or reinforce parts of speech. Also, I wish it had commas so those long sentences could be punctuated properly.",
      "rating": 3.0,
      "verified": true,
      "author": "Holly Doherty",
      "helpful_votes": 3,
      "publication_date": 20150522
    },
    {
      "title": "... bought this for my ESL classes and I was disappointed that is does not include is/are (to be verb) ...",
      "text": "I bought this for my ESL classes and I was disappointed that is does not include is/are (to be verb) and for a beginners, its confusing. A good start!",
      "rating": 3.0,
      "verified": true,
      "author": "Wendy R. Cooper",
      "helpful_votes": 0,
      "publication_date": 20170329
    },
    {
      "title": "Good idea, but NEED MORE VERBS and adjectives",
      "text": "My son likes this game- it's pretty good, but could (easily) be so much better. There are a lot of nouns (good), but NEED MORE VERBS and adjectives. For some reason, there are a ton of \"a's\" and \"the's\" and periods- only need a few. There are only 4 verbs, repeated- would be so much better and more engaging with more verbs and adjectives (only 12- get old quick).",
      "rating": 4.0,
      "verified": true,
      "author": "CG",
      "helpful_votes": 0,
      "publication_date": 20140219
    },
    {
      "title": "Educational Puzzle That’s Fun",
      "text": "Nice puzzle that promote reading, aid in speech review and laughter.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Diane",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Great for sight words",
      "text": "Absolutely love this. My almost 5 year old son and I play every night and he's picking up sight words like crazy. I would definitely recommend this to anyone looking for a fun and easy way to get their child interested in reading.",
      "rating": 5.0,
      "verified": true,
      "author": "Brianne",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Good for second grade and above.",
      "text": "This is a good product. The cardboard puzzle pieces are heavy and durable if children keep them out of their mouths or let their dog have them. The color coding makes it easier for younger children to put the sentences together. My students spent a lot of time putting sentences together and stayed engrossed.",
      "rating": 5.0,
      "verified": true,
      "author": "Lucky Charms",
      "helpful_votes": 0,
      "publication_date": 20140604
    },
    {
      "title": "Just what I wanted, Just in time!",
      "text": "That was quick and just in time for my 4 years old grandson's birthday gift. Great for tutoring and sentence writing practice. He loves puzzles, this one will help him practice reading and connecting words to make complete sentences. YES, \"I win! win! win!. \" A gift he and his parent will love and his teachers will appreciate!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "sea",
      "helpful_votes": 0,
      "publication_date": 20140604
    },
    {
      "title": "GOOD GIFT ITEM",
      "text": "GIVEN AS BIRTHDAY PRESENT TO GRANDCHILD WHO PLAYS WITH IT ALL THE TIME",
      "rating": 4.0,
      "verified": true,
      "author": "Sid",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "My niece and I have the same issue. She’s ...",
      "text": "My niece and I have the same issue. She’s 5. The puzzle pieces that connect them make it difficult to make any arrangement of words.",
      "rating": 2.0,
      "verified": true,
      "author": "Cade N.",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Perfect for kiddos who struggle to understand what makes a ...",
      "text": "Perfect for kiddos who struggle to understand what makes a complete sentence. The visuals and color coding is very helpful and can be used to differentiate.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebeca S",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Common Sense",
      "text": "My kid loves this. It is very child and mommy friendly.",
      "rating": 5.0,
      "verified": true,
      "author": "ada",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "This game is fun and educational",
      "text": "This game is fun and educational. bought it for my 7 yr old son who is in first grade. kind of have to change the rules up and get creative my 3rd grader who is on a 5th grade reading level has fun playing around with it, with us, but its to easy for her really. I would say kindergarten to maybe 2nd grade depending on reading level of the child.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelse Widen",
      "helpful_votes": 0,
      "publication_date": 20150204
    },
    {
      "title": "This is a great center for my students",
      "text": "This is a great center for my students. Helps them practice putting sentences together and helping them also learn their parts of speech.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "great piece for play and learning",
      "text": "we love playing with our son and helping him learn how to put sentences together.",
      "rating": 5.0,
      "verified": true,
      "author": "GTprivatebeach",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Makes learning fun",
      "text": "Great product! I wish the puzzle pieces were a bit sturdier, but otherwise excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Larsen",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Six-year-old who is learning to read really enjoys just making ...",
      "text": "Six-year-old who is learning to read really enjoys just making silly sentences on his own.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn H.",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Make your own.",
      "text": "Not enough variety of adjectives or verbs to keep a child interested. Great nouns, and only 4-verbs and maybe 10 adjectives. Become repetitive very quickly. Good for a child learning sentence organization but not advanced enough for a 2nd grade reader.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephanie Strom",
      "helpful_votes": 0,
      "publication_date": 20160521
    },
    {
      "title": "One of my FAVORITE classroom games/centers",
      "text": "I teach special education and LOVE this game for the lower elementary students. It's great for oral language development, sentence structure, increasing vocabulary, and also supports those students who aren't quite reading yet. A fun and silly game, easy to use as a center or a reward game. There are enough pieces for a good 4-5 students to work on this at a time, as long as they each make one sentence and put back those pieces when they are done, and then exchange for new ones.",
      "rating": 5.0,
      "verified": true,
      "author": "AdrienneTop Contributor: Pets",
      "helpful_votes": 5,
      "publication_date": 20160712
    },
    {
      "title": "Fun",
      "text": "My boys liked making funny sentences and it helped to teach them new words",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "DK games: Silly sentences",
      "text": "Lots of fun while learning about sentence structure such as verbs, nouns, etc. which are colored coded. My 5 year old grandson picked it up on his own and started to make silly sentences on his own and laughing as he read them to me. A great way to supplement education in grades K-2 or 3",
      "rating": 5.0,
      "verified": true,
      "author": "luvgrdane",
      "helpful_votes": 0,
      "publication_date": 20140103
    },
    {
      "title": "Disappointed",
      "text": "my little guy enjoys putting the words together but gets frustrated because the puzzle pieces are not made well and do not snap together easily or stay together.",
      "rating": 2.0,
      "verified": true,
      "author": "Sharyn",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "They love making the sentences and illustrating them",
      "text": "This product is a win with my kiddos. They love making the sentences and illustrating them. It will be much better if this product comes with an organizer that will help sorting and choosing the puzzles to make a sentence.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160616
    },
    {
      "title": "Two Stars",
      "text": "Some may enjoy this game, but our family has not.",
      "rating": 2.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Bought this for my son. He loves making silly ...",
      "text": "Bought this for my son. He loves making silly sentences and I notice it helping him a lot on remembing the words A and The and all the other sight words.",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla A",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "... random by drawing and we get a bunch of fun from it",
      "text": "My family makes sentence at random by drawing and we get a bunch of fun from it, wish it had more words and was even more silly",
      "rating": 4.0,
      "verified": true,
      "author": "alexander g tomtschik",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Super helpful",
      "text": "My daughter is learning to read and this is such a big help.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Great for classrooms",
      "text": "My students absolutely love the silly sentences they can make with this activity. Great way to motivate students to write full sentences!",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Carbone",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Worst product ever",
      "text": "It's the worst product I had ever bought for my child. It was a waste of money and also time as I had to spend like 2 hours building the sentences by myself before I play with my daughter. The concept is good but the words included in the whole set are terrible selected. It's my 1st time writing a review as I got really mad wasting my time and money",
      "rating": 1.0,
      "verified": true,
      "author": "S. Zurita",
      "helpful_votes": 3,
      "publication_date": 20150620
    },
    {
      "title": "Terrific game!",
      "text": "This is such fun for kids! They are learning words and learning about sentences in an entertaining way. High quality cardboard and ink.",
      "rating": 5.0,
      "verified": true,
      "author": "SMASH",
      "helpful_votes": 0,
      "publication_date": 20161013
    },
    {
      "title": "Sentence writing made fun!",
      "text": "This is a quality product. I am a special education teacher, and I used this game to teach sentence writing. I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Fleming",
      "helpful_votes": 0,
      "publication_date": 20150114
    },
    {
      "title": "... kindergartner and preschooler often and we all have a great time learning while playing",
      "text": "Play this with my kindergartner and preschooler often and we all have a great time learning while playing. Definitely worth the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "Cards are too small for younger children. Also, ...",
      "text": "Cards are too small for younger children. Also, too many cards. this can be remedied by removing some of the cards and adding them as desired, but the cards are still too small.",
      "rating": 2.0,
      "verified": true,
      "author": "Belle",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "Using in a first grade classroom",
      "text": "I use this in my first grade classroom. Students really enjoy making sentences. They are learning how to make a good complete sentence in the process.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161029
    },
    {
      "title": "Great Center for Teachers or Home",
      "text": "I use this in a center in my first grade class. The kids love making silly sentences and they don't even realize they're learning! I separate the word into parts of speech so it's excellent for teaching that as well.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Adler",
      "helpful_votes": 0,
      "publication_date": 20140728
    },
    {
      "title": "Summer 2018 One will be in first grade next fall ...",
      "text": "Summer 2018 One will be in first grade next fall and another in Kdg. Very appropriate for their ages.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "It's a bit like \"Mad Libs' only with puzzle pieces",
      "text": "My pre-k child really enjoys this game. It's a bit like \"Mad Libs' only with puzzle pieces.",
      "rating": 5.0,
      "verified": true,
      "author": "TH",
      "helpful_votes": 0,
      "publication_date": 20160722
    },
    {
      "title": "Something is missing",
      "text": "Not as fun as I thought it would be. It's pretty difficult for the children and not as fun. But the quality is good, and at least it teaches the correct grammar.",
      "rating": 3.0,
      "verified": true,
      "author": "Michal Bloch",
      "helpful_votes": 0,
      "publication_date": 20150729
    },
    {
      "title": "Love it",
      "text": "I love this game. My 4 year old reads well so its a nice game for her. I like the fact that there is upper case and lower case articles. However there is no \"an\". I would also be happier if there were more verbs and prepositions. We made up more tenses on paper and created more sentences. I guess that could be level 2 for this game. But for early learners, this is an amazing game.",
      "rating": 4.0,
      "verified": true,
      "author": "vandana",
      "helpful_votes": 0,
      "publication_date": 20130811
    },
    {
      "title": "Great teaching tool!",
      "text": "We don't actually play this as a game...we just use this as a tool to help my 5 year old learn about sentence structure and practice making sentences. One day we'll get around to playing this as a game as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Sabrina Penelope",
      "helpful_votes": 0,
      "publication_date": 20140416
    },
    {
      "title": "Great game for kids",
      "text": "I use this game at school with first and second graders. They love it, and it's a great way to get them using descriptive words, capitals and periods. It's also very durable. I've used the same game with 20+ kids for three years.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Kane",
      "helpful_votes": 29,
      "publication_date": 20070819
    },
    {
      "title": "Great Game",
      "text": "This is a very fun, engaging game that will have your child/children making sentences that they'll want to read. I purchased this as a game for my students to help them build fluency. They love it and so do I!",
      "rating": 5.0,
      "verified": true,
      "author": "KST",
      "helpful_votes": 0,
      "publication_date": 20140308
    },
    {
      "title": "Not sure that this is really worth the price. ...",
      "text": "Not sure that this is really worth the price. You can only put together so many sentences and then that is it. Definitely needs more adjectives and verbs.",
      "rating": 3.0,
      "verified": true,
      "author": "Northwest Mom",
      "helpful_votes": 0,
      "publication_date": 20141003
    },
    {
      "title": "There are a lot of pieces to this activity!",
      "text": "I love how easy it was to teach my students to use this activity.",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "I love the concept behind the puzzles",
      "text": "I love the concept behind the puzzles. My 3 year was able to identify the words easily. I just wish more words were inluded such as “is”.",
      "rating": 4.0,
      "verified": true,
      "author": "Bruchell",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "It funny, my son 6 years old love it",
      "text": "It funny, my son 6 years old love it :)",
      "rating": 5.0,
      "verified": true,
      "author": "Mateusz",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "Very good product for teaching children to read and identify  simple words",
      "text": "I love this product. My children love the interaction of putting the word puzzle togather while learning.",
      "rating": 5.0,
      "verified": true,
      "author": "Deressa Williams",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Five Stars",
      "text": "This is a great buy when you are home schooling or teaching your kids to read.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Spikes",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "... at a friend's place with her kids and really loved it. I bought this one was a present ...",
      "text": "First played this game at a friend's place with her kids and really loved it. I bought this one was a present for another little girl and that family too has really enjoyed playing the game. It is a great way to bring everyone in the family together and teach the kids some grammar too!",
      "rating": 5.0,
      "verified": true,
      "author": "Janaky Profile Name",
      "helpful_votes": 0,
      "publication_date": 20141203
    },
    {
      "title": "Fun  game",
      "text": "My six year old grandson had so much fun making silly sentences that his dad who was in another room thought I was tickling him. However, it's not easily transportable because of all the different cards. I'm looking for containers to sort and keep the different card categories. it's a fun game and does encourage reading skills.",
      "rating": 4.0,
      "verified": true,
      "author": "Eileen Mcdermott",
      "helpful_votes": 0,
      "publication_date": 20110329
    },
    {
      "title": "lots of fun.",
      "text": "Can be used to help children learn to build sentences. lots of fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Shaeffer",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "Great puzzle for a classroom!",
      "text": "I use this puzzle in my primary classroom. It is a great reinforcer of sentences and the kids have a lot of fun with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Fun learning game",
      "text": "This is fun. I wish it had more choices for the verbs, but it is still a good buy. It helps kids learn the components of a sentence and makes it fun with pictures.",
      "rating": 4.0,
      "verified": true,
      "author": "Mom's Kitchen",
      "helpful_votes": 0,
      "publication_date": 20140328
    },
    {
      "title": "My kindergarten students that are good readers LOVE these puzzles",
      "text": "My kindergarten students that are good readers LOVE these puzzles! I think I will be able to use them when I become a speech-language pathologist as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Rsteele",
      "helpful_votes": 0,
      "publication_date": 20150201
    },
    {
      "title": "great learning tool",
      "text": "This makes reading and making sentences fun for kids. There a lot of card/puzzle pieces in here.",
      "rating": 5.0,
      "verified": true,
      "author": "kateydid1",
      "helpful_votes": 0,
      "publication_date": 20160407
    },
    {
      "title": "Great gift for a family",
      "text": "Gave this as a birthday gift to my 7 year old niece. She is the oldest of siblings ages 5, 3, 1. They are home-schooled and her mom was just as excited to receive this gift. I'm so glad learning time can be game time, too!",
      "rating": 5.0,
      "verified": true,
      "author": "die komponistin",
      "helpful_votes": 0,
      "publication_date": 20111108
    },
    {
      "title": "Nice idea",
      "text": "I have to admit my son had more fun popping the words out than forming sentences, so far, but we're enjoying it and it's fun to do together. Great idea for a game.",
      "rating": 4.0,
      "verified": true,
      "author": "Ronald R. Smith",
      "helpful_votes": 0,
      "publication_date": 20131226
    },
    {
      "title": "Me and my kindergardener like this game!",
      "text": "My son enjoys making sentences with this game with me. We take turns then he laughs at the silly sentences. I would like to see some small changes with the sentence options. All in all though this is a great supplemental learning tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Bless Yahweh",
      "helpful_votes": 0,
      "publication_date": 20090301
    },
    {
      "title": "Def recommend it",
      "text": "The kids like using it and I think it’s a great addition to their schools",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney Fadel ",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Birthday Gift",
      "text": "Our Godson loved the game and putting silly sentences together. We got together with him at a restaurant for dinner and it kept him entertained during the meal and afterwards as adults talked.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Hughes",
      "helpful_votes": 0,
      "publication_date": 20140104
    }
  ],
  "product_meta": {
    "title": "DK Games: Silly Sentences",
    "rating": 4.5,
    "specifications": {
      "Grade Level": "Preschool - Kindergarten",
      "Misc. Supplies": "12 pages",
      "ISBN-10": "0789454726",
      "ISBN-13": "978-0789454720",
      "Product Dimensions": "7.88 x 1.19 x 10.31 inches",
      "Item Weight": "1.55 pounds",
      "Publisher": "DK Children; 1st Edition (June 1, 2000)",
      "Reading level": "3 - 5 years",
      "Language:": "English",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Books",
      "Education & Reference",
      "Children's Books"
    ],
    "price": ""
  }
}