{
  "website_summaries": [
    {
      "verdict": "The story of the Elf on the Shelf has been a tradition in many families for years, and this is a great set to make it part of your family's Christmas.",
      "pros": [
        "A must-read for families during the holiday season – the classic tale by Aebersold and Bell that keeps kids in anticipation of Santa's arrival",
        "Comes with an Elf on the Shelf figure with choice of colors"
      ],
      "cons": [
        "The elf is a bit flimsy",
        "A few complaints from consumers who received the wrong elf or none at all"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "NOT AS DESCRIBED/PICTURED",
      "text": "This item DOES NOT COME AS ADVERTISED. I was looking forward to surprising our daughter with this magical gift When to my dismay I opened the box and found an extremely poor quality elf in a clear plastic bag. I did not receive the \"elf on the shelf\" box or the book as noted in the description. So disappointed to have spent $30 on this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 252,
      "publication_date": 20161214
    },
    {
      "title": "The sex was a surprise :0",
      "text": "The description clearly states that a baby boy elf was on the way, but the mischievous gremlins at the Amazon warehouse decided I must have needed a baby girl in my life. I thought about calling the stork and returning it, but the elf-making-bank is back-ordered until after the holidays. I hope my hubby likes his girl elf, probably for the best as this is his white elephant gift from me this year. I was always a tom-boy myself, and since I have a feeling I'll be the one creating the elf antics, \"they\" are going to a handful LOL :)",
      "rating": 4.0,
      "verified": true,
      "author": "Island Girl",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "That darn Cousin Eddie",
      "text": "My son absolutely loves his elf!! His elfs name is Cousin Eddie1 so my husband and I get a laugh out of it too. My 6 yr old son is super into it and minds really well when the elf is around. Unfortunately there have been a few days the elf didnt move but I'm assuming it was because he is overworked, exhausted, and just wanted a min to his self when the 6 yr old went to sleep. Anyways, I wished cousin eddie had joints or bendable arms and legs that held a place so he could stay in a place by his self. He is flippy floppy so he will have plastic surgery over his \"off\" summer months.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "With this elf comes great responsibility.",
      "text": "I bought this to replace one that went MIA between seasons. My children adore the elf and the book is a tradition that we enjoy each time it arrives. We did find the original so this one was packed away as a backup. However it is the exact same elf. The original one entered our home 10 years ago and has spent each holiday season performing random hijinks and shenanigans each year without fail. Keep them out of reach and be mindful of staining and such changesof look. Having one that is original is cool until it goes missing. Keep them basic if you catch my drift.",
      "rating": 5.0,
      "verified": true,
      "author": "🙊🙉🙈",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Great for Christmas",
      "text": "I bought this because my son’s classroom at daycare had an elf, and my son didn’t know what it was and kept trying to touch it (we watched Elf the night before). Needless to say he freaked all the other kids out so I bought him his own so he could understand. He loves Larry. He loves the games on the website. Larry got into some trouble with the Ninja Turtles but he got his revenge. This is perfect for kids and really helped me get my son into Christmas, my favorite holiday. I think we read the book every single night. My son still thinks Larry is watching through the security cameras in stores, so that helps too!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mayo",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "An empty box with a low quality elf inside.",
      "text": "I was expecting the box to include both the elf and either some additional supplies or a book of ideas for the game, or a storybook, or something. But I am convinced the box is included so they can justify selling this product for $22. Inside is simply a very low quality elf (who doesn’t have legs) and the rest of the box is empty. This elf likely cost .50 cents to produce and is being sold for $22. I recommend using any other elf product and saving the $21.50.",
      "rating": 5.0,
      "verified": true,
      "author": "Bethanie Barth",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "ORDERED FOR BABY SHOWER GIFT - LOVE EOTS!!!!",
      "text": "Ordered this for a baby shower gift I'll be attending the first of January. That way baby Cameron will have his elf with him from day one. We of course have our own, Zippy, and this little guy is the BEST tool for keeping kids on their best behavior during December and they are just so much fun! I hate that some adults have turned something so wholesome and sweet into something dirty at times, but hey, Santa watches them too. So when they get coal in their stockings, they shouldn't be surprised. Every child needs their own Elf. It's as simple as that. Even a wee baby newborn coming soon.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Kim",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "I love everything about the Elf tradition except that Elf is ...",
      "text": "I love everything about the Elf tradition except that Elf is not posable. You have to insert wire into his arms and legs which is hard to do now that they sew elbow and knee joints in. Without the wire he will just lay there. So be prepared to do a little Elf surgery and have some wire handy, floral wire will work. Once I get mine past the joints I'll let you know how, if I can do it without unstitching.",
      "rating": 3.0,
      "verified": true,
      "author": "Tiffany Jump",
      "helpful_votes": 5,
      "publication_date": 20151210
    },
    {
      "title": "Our new Christmas tradition",
      "text": "Bought this for my 2yo who just recently became obsessed with all things Christmas (it’s now only March 😂). I’ve kept my eye on this for a while but decided to buy it when I saw the price drop on amazon. I’m glad I got this - it’s a really cute Christmas tradition to keep and the hardcover book is great. I can see my son enjoying the tradition for the next couple of years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Cece",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "This is a lot of fun for the entire family",
      "text": "My 8 year wanted Elf on the Shelf so I got this for her. She absolutely loves it! Everyday she would bolt out of bed to look for the elf and even her teenage brother joined in on the search. It was as much fun to hide as it was to find. I would recommend this for families of younger kids. Our elf held up well and we can't wait for next Christmas to see him again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "We love the Elf on the Shelf",
      "text": "I bought this for my nieces and nephews a few years ago and it has become a fun Christmas tradition for my sister and her kids. They love it when the elf shows up after Thanksgiving. Their favorite thing to do each morning is to look around the house and try to find out where he \"landed\" when came back from the North Pole. It is so cute watching their imaginations while making memories that they will always remember.",
      "rating": 5.0,
      "verified": true,
      "author": "ahayden",
      "helpful_votes": 2,
      "publication_date": 20170712
    },
    {
      "title": "What The Elf!",
      "text": "My son who is 7yr old wanted one. The school has been doing the elf in the shelf, and he wanted the original only. The box came in well packaged. Price was more than expected but the quality is good. Comes with a book that we dated and named, it makes for good memories, so that alone is priceless. I wod recommend even at normal price for the original. The case is a good storage box when season is over. Save it.",
      "rating": 5.0,
      "verified": true,
      "author": "EDOZA",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Best elf on the shelf!!",
      "text": "I finally got elf on the shelf because i heard nothing but great things about this. Everything came exacly how it was suppose to and i loved the book and doll. I have no complaints at all. The box comes with the book and the elf. Save the box because its nice to store it back in the box to put away till next thanksgiving when the elf is suppose to come back. Loved this product and would highly recommend others who have kids t get this. I am a happy customer",
      "rating": 5.0,
      "verified": true,
      "author": "Classy Styler",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "AMAZING.",
      "text": "I’m in love with the elf on the shelf. I bought one at kohl’s for my daughter the girl one with brown eyes. She loved it. So my step daughter wanted the boy elf on the shelf blue eyes and I looked in Kohl’s sold out. And I looked on amazon saw mixed reviews on it. And was super scared it was gonna come defected or anything. But I ordered and it came exactly like the elf on the shelf I bought in kohl’s. My step daughter is in love and named him Oliver. The book was amazing also. Nothing wrong with any of them. We even dressed him up.",
      "rating": 5.0,
      "verified": true,
      "author": "Paulina Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Received Books Timely",
      "text": "I got my books which i was surprised after reading others reviews of not getting them. One book appeared to be new the other one the binding was not stiff like a new book would be and you could tell someone used to as a hard service to write on. But glad I did receive them",
      "rating": 3.0,
      "verified": true,
      "author": "Tessie Mae",
      "helpful_votes": 2,
      "publication_date": 20180406
    },
    {
      "title": "Super cute!  Must have!",
      "text": "This is an adorable Christmas tradition! The elf comes with a story book. It is so fun moving him everywhere over night and as soon as my kids wake up the first thing they do is look for the elf. They really are on their best behavior so the elf doesn’t report back to Santa bad behavior for them to be put on the naughty list!",
      "rating": 5.0,
      "verified": true,
      "author": "Kaylee Rowe",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Disappointed, arrived damaged.",
      "text": "A little disappointed. It arrived with a damaged box (that holds the book and the elf). Also the hat fell off almost immediately. For the price, I expected high quality. Also the look on my son's face when his elf's hat fell off broke my heart. He has been asking for this elf for weeks and even saved up his allowance In order to purchase it. I will try to glue the hat back on, but I shouldn't have to even be doing this.",
      "rating": 2.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "The elfwill make your children so happy!",
      "text": "This item has met my expectations, it came packaged well and arrived when I expected. My 3 year old was so excited when we opened it. We named our elf Jingle. To hear my children giggling when “jingle” was doing something silly, it made my heart melt. We will continue to teach our children that Christmas is about the birth of Jesus, but Jingle gives them a little while “extra” Christmas spirit. We love it. I’m so glad it will be a tradition for years to come!",
      "rating": 5.0,
      "verified": true,
      "author": "Katrina Snyder",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Best Purchase I’ve Made",
      "text": "Came with everything as pictured and is beautiful! My sweet child loved the book so much! We named our elf and he helped me clean the dining room table (; I did have to insert a small wire in both arms and legs to make him posable but it was easy. Didn’t like the fact that his hands were sown together but it was an easy fix. Overall I call it a successful purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Everyone keeps saying they don't like the book because it gives the kids the wrong ...",
      "text": "Everyone keeps saying they don't like the book because it gives the kids the wrong idea. This totally gave my daughter an eye opener. She recently started preschool, and it has been extremely hard to wake her up. Ever since Scout (the elf) came to visit us she has been on her best behavior. She even falls asleep on her own at night! Which is something I haven't been able to do for years now! Every morning she wakes up before school all bright eyed and bushy tailed to find out what Scout did over night. This is a HIGHLY recommended product!! My daughter loves Scout!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20151205
    },
    {
      "title": "Cute",
      "text": "I bought this for my 5 year old grandson and his mom starting Dec 1st the hiding of the elf and reading the story. He loves it. My daughter said the only thing she is disappointed in is that the legs are just free and loose. They do not have like wire inside so you can form his sitting and bending at the knees. It helps in where you put him. Other than that it is something you use only 1 month out of a year and it is keeping the little guy being good because he knows that elf is going back every day telling Santa if he has been naughty or nice..lol",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Where's the elf?!?",
      "text": "We have been doing the elf thing for 2 years. I keep it simple. Our elf only does pinterest-worthy things on the day he shows up, mid-visit and the day he leaves. I'm thinking \"Ralphie\" may really be at the North Pole because I cannot find that little b**tard. Happy to have purchased Ralphie 2.0.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Check if it's a boy or girl!",
      "text": "I was sad that I didnt check and i wanted the girls but these where only boys :( anyways it was a good purchase, and I put some earings on o e of them so it is now a girl lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Anaid_Gtz",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Great gift",
      "text": "The elf was purchased for my 5 year old niece. The elf was moved every night to a different location. Every morning my niece would look for it. She enjoyed her elf on the shelf. I would recommend purchasing elf on shelf and on Dec 1, every night move the elf to a different location for your child to find.",
      "rating": 5.0,
      "verified": true,
      "author": "snrldy",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Pricey",
      "text": "We finally gave in and got one of these. Fun idea, but can be a lot of work 🤣. Seems pretty spendy for what it is. Our boys definitely enjoy it though!",
      "rating": 3.0,
      "verified": true,
      "author": "SarahMc",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Used",
      "text": "The product came and was clearly used. There was also missing paint in his hair touched up with different paint or marker. He is suitable but wish I'd purchased in store to make sure I purchased a 'new' product. Buyer beware.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Just as described for an Elf.",
      "text": "It came in timely manner and nicely packaged. There wasn't any damage whatsoever. The product is very nice and just as described. \"Timbo,\" as my niece has so nicely named the mysterious Elf-on-a-mission-to-rat-her-out-to-Santa; came nicely sitting behind a plastic windowed box with a book tucked away in a slot to the side. The fabric and overall design of \"Timbo\" is nice and not cheaply made. Definitely glad with my purchase and recommend to others if they are looking for some new and exciting transitions for their Christmas season.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "First timer",
      "text": "This is our first year doing elf on a shelf. Our daughter is absolutely loving waking up each morning and seeing where the elf is and what the elf has done that night. My only complaint is that the elf down now wipe off easily if anything gets on it. I tried to use just a damp cloth and it changed the texture of the material of its suit.",
      "rating": 4.0,
      "verified": true,
      "author": "akl",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Cute and fun.",
      "text": "This is a cute little elf though it is fimsy. But since it is not made to play with I'm sure it will last a long time. My 3yr old granddaughter just loves it. She junks out of bed each morning to run and find it. Definately worth the money if just in the happiness it brings us each morning.",
      "rating": 5.0,
      "verified": true,
      "author": "hrv",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Great tradition, great idea, why is elf not more flexable?",
      "text": "Kids are loving this tradition but with so many tutorials out there explaining how to put wire in your elf's arms and legs so it bends, and Velcro on it's hands so it can do more, why haven't they come out with a newer version that does not require people to jerry rig their elf so it does these things?",
      "rating": 3.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 2,
      "publication_date": 20161215
    },
    {
      "title": "Best Christmas tradition so far",
      "text": "Best Purchase EVER. My son woke up every morning without a fight because he wanted to see where his elf was. It was so much fun! With a few velcro squares, some tape, string, and other random supplies you can make this thing stick anywhere. Get creative! The kids love the crazy poses.",
      "rating": 5.0,
      "verified": true,
      "author": "Whit",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Felt does melt!",
      "text": "I loved this guy, we named him Rudy, but Rudy is no longer with us due to santa wanting to put him on the chandelier and while the kids were home they left the light on and well lets just say we caught it right before we had a fire in the house. sad day. but now we have a replacement after running to target stressed out while Rudy lays melted on the table.",
      "rating": 5.0,
      "verified": true,
      "author": "Cassandra",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Great purchase",
      "text": "So glad I finally got one. My son is 6 so I wasn’t sure if it was too late. I ordered it after Christmas so I had to come up with a creative way to introduce him, which was very successful. My son loved the book and wanted to read it every night and also was so infatuated with our elf. Might ya e one more year with it, but that’s okay. Totally worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "My profile",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Not as described",
      "text": "This was going to replace our previous elf which was lost in a move. The description was for a \"blue-eyed boy scout elf\", but we received a brown eyed, black haired, elf with darker skin. Its adorable, but not what we were purchasing. I had to run around shopping malls to find what I was looking for, exactly what I was hoping to avoid.",
      "rating": 1.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Cute idea, a lot of work but totally worth it to see kids faces",
      "text": "My boys LOVE this thing! My 9, 7 and 2 and a half year old sons love seeing what our elf has been up to while they are in bed or at school, (the older ones.). This last December was our second Christmas with \"peanut\" and they can't get enough of his antics. I think it was a good purchase even if he is a lot of work. My family is happy with our elf on a shelf.",
      "rating": 5.0,
      "verified": true,
      "author": "Mommac83",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "Be prepared to be fully committed!",
      "text": "OMG! I knew a little about elf on the shelf. Move him around, make a funny sign or pose. Was not prepared for how much my kids really believed! They came home every day wondering where he was and what he was doing. If he didn't move they worried about him! It was fun but it takes some time and creativity. And it was worth it for the kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Bret Brewer",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Fun and creative tradition to bond with kids!",
      "text": "My husband and I started the Elf on the Shelf tradition this year for our four year old son & so far it’s been a lot of fun. We’ve enjoyed coming up with new ideas for “Elfie’s” placement each night and then seeing our 4 year old literally jump out of bed with excitement to find out where his elf has moved to. Elf on the Shelf is a fun and silly way to bond with your kids during Christmas time. I hope to keep this tradition going for several more years while the magic of Christmas is still alive for my 4 year old.",
      "rating": 5.0,
      "verified": true,
      "author": "Mica D.",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Awesome",
      "text": "Arrived on time. The packaging is awesome. I say that because it's made to reuse at the end of Christmas each year till the Elf comes back the next year. The book goes back in easily and he goes right back in his place. Being in retail for years, I was impressed with it. Love the way the story is told. This is our first time buying one and no disappointments at all. I may make him more bendable, but he is really perfect just as is. A tradition I can't wait to start !",
      "rating": 5.0,
      "verified": true,
      "author": "nana5xs",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Item description did not match item received",
      "text": "The item’s appearance did not come as the item description. The description said blue eyes, light skin. I bought it through this company to save me a trip to the store. Now, I had to make 2 trips...one to return, the other to buy it in store. Very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Kati",
      "helpful_votes": 4,
      "publication_date": 20181112
    },
    {
      "title": "Magical little elf spreads all the joys!",
      "text": "The elf popped up rather quickly! He sit perfectly on the mantle (but sometimes in the tree as well) this was a wonderful surprise for my family and the excitement was magical when we received him",
      "rating": 5.0,
      "verified": true,
      "author": "April M",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Of course it’s awesome!",
      "text": "I bought this for my two youngest kids after they sat down with Santa and told him they wanted one. It came in the mail from “Santa” they named him Jasper. It’s been fun figuring out what mischief he has been getting into. It also helps with keeping them in line knowing that he will tell Santa how they have been acting. I’m glad I finally broke down and bought one.",
      "rating": 5.0,
      "verified": true,
      "author": "kristyn007",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Our little Dunkin Elf :)",
      "text": "My little Elf came today! Been wanting to do it for a few years but the $30 price tag was a bit of a turn off. So decided to purchase it before the Christmas season got started and I saved $10. This was definitely a great year to start. Right before the magic of Christmas leaves my oldest two children and the start of the tradition for my youngest. Planning on introducing our new family friend after Thanksgiving via a North Pole breakfast. I have a feeling our little guy will get into all sorts of mischief this holiday season. Cant wait 😍😍😍 thank you for a speedy delivery. He is perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "A New Christmas Tradition",
      "text": "It would be difficult to say anything negative about this product. My son loves everything about it. Having your child name the elf is a brilliant idea, well done. I think this is our modern version of the advent calendar, as children get to find him someplace new each day. How creative you get with the staging is up to you, but the sky is the limit.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Cepparulo",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Nice elf!",
      "text": "Yep... It’s your standard elf on the shelf. Purchased it to use in my classroom but the kids were so interested to see where the elf moved every day, it caused more of a commotion than it was worth. Not sure if Mr. Elf will be coming back or not next year...",
      "rating": 5.0,
      "verified": true,
      "author": "M. Wheeler",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "one more thing to add to my nightly to-do list seemed like a bad idea",
      "text": "I was hesitant to purchase this item because as a single mother, one more thing to add to my nightly to-do list seemed like a bad idea. But I finally broke down and bought it after my 6-year-old begged for a week straight. I'm so happy I added it to our holiday traditions! He was soooo excited to get it and keeps talking to in the morning. Not only does it keep him behaving the best he can, but he actually jumps out of bed excited to wake up in the morning (something very unusual for him) because he wants to see where the elf moved to. I highly recommend this product if you have little ones in the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "Go for it!",
      "text": "I was hesitant to purchase this. $30 seems like a lot for a small toy that doesn't really get played with along with a book that you read one time per year. My five-year-old found this completely magical and was very excited to find the elf every single day. He is already looking forward to the elf coming out again this year. I had my reservations, but I would highly recommend purchasing this as it can be a treasure for years to come!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Oh so cute!",
      "text": "My 7 yr old grandson wanted an elf on the shelf after his friends at school we’re sharing stories of their own elfs. We picked one that was similar in looks to my grandson, blue eyed boy, etc. It came in a keepsake/storage box with a nice story book which introduces your family to the elf, their purpose and explains the “rules”. The elf, he named Zeke, was a lot of fun for us this year and I suspect will be from now on, as we have a new family tradition. The elf is well made and oh so cute. I would recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Annie V",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Fun",
      "text": "Very cute and clever idea for the little ones. The book that comes with the elf explains an easy way how to start the tradition. The fun part is to find accessories for the elf and creative ways to set up the scenarios. Thank god for amazon needed to buy on last minute and came super fast 1-2 days.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexander Murray",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Great Idea!",
      "text": "I bought this for my classroom and the students loved it! The only thing is I unstitched the hands (because they come sewn together) because I thought you’re supposed to, but I don’t think you are. Haha so just a warning, don’t unstitch the hands!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Shafran",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Good buy",
      "text": "Got this for my son and he loves looking for it. He's constantly trying to figure out where the little elf will show up next. It definitely has brought a little more fun to the xmas season. I just have to remember to hide the elf every night.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Stuffed body. Insert wire to pose",
      "text": "I totally thought this was posable. Bendable not posable. It’s like a stuffed animal body. I stuck wire through arms and legs to make things a bit more interactive. For the price I hoped to have a posable wire body. Just get some cheap wire lol",
      "rating": 4.0,
      "verified": true,
      "author": "Walker Family",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Always a great gift to give a child!",
      "text": "This was a gift, the child wanted a boy version, I bought this out of season but it was worth very penny. The kids loved it and is a good add to the collect of “magical elf’s!” Of course the doll head is plastic and the rest of the body a light red cloth.",
      "rating": 5.0,
      "verified": true,
      "author": "KV",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "My kids absolutely love this! It is truly a fun thing to ...",
      "text": "My kids absolutely love this! It is truly a fun thing to do with the family during the Christmas month. I will admit that I think you could actually do this with any elf you purchase, as there are enough ideas online to get started! The doll itself is nicely constructed, but nothing fancy. It seems like it will last for the duration of my children's (5 and 3) belief in \"Santa.\" Because they cannot touch it, I suspect it will last much much longer! We love it! One thing...I do wish skin tone options were more easily available and did not cost more money!",
      "rating": 4.0,
      "verified": true,
      "author": "andrea",
      "helpful_votes": 0,
      "publication_date": 20151219
    },
    {
      "title": "Its a girl, NOT a boy...",
      "text": "In the description, it says this is a boy elf. When I opened the box it says on the front its a girl elf. Not a huge deal, but when you specifically search and then purchase an item because it says its one thing and then receive another, its a bit of a let down. All of the pictures and descriptions for the product say boy...",
      "rating": 4.0,
      "verified": true,
      "author": "Michelle Wegner",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Cute Christmas tradition",
      "text": "Bought one for my newest grandson who is blonde and blue-eyed. Since I couldn't find a blonde elf, I purchased this one and painted the \"hair\" yellow. It took a few coats to cover the brown but in the end it was adorable. And now he will be able to start the Christmas tradition next year.....",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "My 7 year old son loves it!!!",
      "text": "This is our first Christmas doing \"The Elf on the Shelf\". Our 7 year old son loved the book when we read it to him the first night!! And he loves waking up every morning and looking for the elf all over the house!! This is so much fun and we love coming up with new ideas every night. I suggested this to my sister and she is also doing it with my 2 nephews. Lots of fun to do during the holidays and a cute Christmas tradition :) Other reviews said it was \"creepy\". I dont find it creepy or scary at all. The elf has the cutest, mischievous smile!! What's not to love??",
      "rating": 5.0,
      "verified": true,
      "author": "AnileyR",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "Good family tradition",
      "text": "I bought this for my 4.5 year old grandson. I haven’t ever done this before but had so much fin with our naughty elf I can’t wait till next year. Wish they were a bit cheaper but know this one will last for many years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Lbatch",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Great for kids!",
      "text": "Bought this for my daughter (10 years old) and she's loves it! I wish the arms were bendable and strong enough to hang the elf on things but it's still really cool! There are tons of different things you can do with it and your child will love it!",
      "rating": 5.0,
      "verified": true,
      "author": "A Bauer",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "NOT at all as described...",
      "text": "Ordered this elf because the description specifically stated that it would be a blue eyed boy elf, just like the picture. Received a dark skinned, gender neutral, brown eyed elf. Normally, I wouldn't care, but I am trying to replace our last elf so uh... looks are important in this case. Either update your description and photos, or send things as described. Now I get to deal with the hassle of a return and finding another elf. Not cool.",
      "rating": 1.0,
      "verified": true,
      "author": "MissMaddie",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Cool for younger kids and not dogs",
      "text": "Pretty cool, if you re into traditions. My kids are teenagers so they thought it was cool for like a minute. Typical. Gave it to my dog and let him tear th little guy into pieces and all of a sudden the kid wanted him back. Too late. This tradition is history and it made a great 2 minute chew toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Keon",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Ordered a Boy..... got a ...",
      "text": "Ordered a Boy.....got a Girl. These are not the same quality as many years ago. They no longer have the wire inside their arms and legs. The hands are sewn together. After spending so much money on this floppy felt toy its up to you to customize it with velcro or whatever you need to set it up anywhere. I got suckered. =(",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "It was great fun for my son and me too",
      "text": "I give a 5 star because I got more than I expected. My son is 12 so I thought he is too old for it, but still bought because some of his friends had it. But I was wrong. It was great fun for my son and me too. It feel its a great way to have an activity at home with your child. I felt the \"Elf of the shelf\" brought me so close to my son this holidays because we have something in between the both of us that we did for a period of 3 weeks. This is the longest activity I have done with my son, lately. So yes I very much recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Devika Sharma",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Fun for Adults too!  Teeheee!",
      "text": "My husband hates this thing. I absolutely LOVE IT! Especially when I can scare him in places where he least expects it. Have you seen a flying shoe because a grown man was scared that something was in it? It's great. I was hoping to pass along to our child, but found out we can't so, that's fine. We'll keep between ourselves. I came home from work one time and he had little bottles of liquor all around him....Elf of the Shelf had a rough day, where he was found with Tylenol the next morning. :) See it's fun even among adults!",
      "rating": 5.0,
      "verified": true,
      "author": "C. Haacke",
      "helpful_votes": 2,
      "publication_date": 20151002
    },
    {
      "title": "Fun tradition",
      "text": "I didn't really get the appeal of Elf On A Shelf. Bought one for our son, anyway. After reading the book that comes with the Elf I get it! This was fun and our son loved it. Looking forward to pulling out the Elf next year!",
      "rating": 5.0,
      "verified": true,
      "author": "Jen K",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "We started it in 2016 and he absolutely loved it. He was sad to see his Elf ...",
      "text": "My son loves this! We started it in 2016 and he absolutely loved it. He was sad to see his Elf go, but is excited for him to come back. My husband and I love coming up with new ideas to set the Elf up, works out nice because we also get to spend time together.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "Lazy Creepy Elf",
      "text": "The Elf does what the elf is supposed to do, but apparently that is nothing. Turns out, I have to move this lazy dude EVERY night! Plus, he's creepy. I feel like he's watching me, always. Even as I write this... there he is, watching me. But, the kids are happy about him, so I'll just deal with the creepiness of this little guy for the next...oh God...18 years..",
      "rating": 4.0,
      "verified": true,
      "author": "RP Carney",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "Kids love it",
      "text": "Love the idea. It comes with the elf and the book which explains the background and story of the elf for adults and children alike. The elf’s hands are sewn together so he can hang from stuff. You get to pick the elf’s name and there are links to print up a letter from Santa and a Certificate.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlotte",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "A Real Christmas Tradition.",
      "text": "This has been so much fun for our family over the years. The kids really get a kick out of seeing the elf do all sorts of mischief throughout the house. What a wonderful tradition to bring back every year.",
      "rating": 5.0,
      "verified": true,
      "author": "MDKarpowicz",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "At first I was skeptical, with all the hype ...",
      "text": "At first I was skeptical, with all the hype surrounding \"the elf\" wa any child really going to buy into the magic of it all?? Well she did!! She loves the story, we've read it several times already, and she can not wait to see what Elfie is doing the next morning. If you're at all hesitant about introducing this little guy for the holidays, do it!!",
      "rating": 5.0,
      "verified": true,
      "author": "R Carmody",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "we had the best of fun with this elf",
      "text": "we had the best of fun with this elf. We just never knew what to expect from him. He made his way into the fridge, sneaked into a bag of corn puffs, took a picture of his rear end in the copy machine amongst other non mischievous adventures . He was a busy busy elf.",
      "rating": 5.0,
      "verified": true,
      "author": "kat",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "It's an Elf that sits on a Shelf....or anywhere else",
      "text": "Not too much to say here. It's the classic Elf on a Shelf. Arrived quickly, great quality...no issues. I would recommend buying the accessory pack this has a climbing hook, candy cane hook, boots, a chair, and many other accessories to make posing the Elf easier.",
      "rating": 5.0,
      "verified": true,
      "author": "TLL",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Not in good condition",
      "text": "The box is falling apart and whoever taped it did a TERRIBLE JOB. I wanted to gift it to my daughter for Christmas but it was in bad shape. I ended up throwing away the case and just putting the elf & book in a gift box.",
      "rating": 3.0,
      "verified": true,
      "author": "Elissa Davis",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "This is my new favorite Christmas activity!",
      "text": "Love this set!!!!! The book included is fun and I love that it tells the kids not to touch the elf, (or they would have destroyed him in days) The elf has a wire frame that allows you to bend and pose him in fun ways. I'm sure most of us have seen the hilarious photos online. Of this little guy getting into trouble. Such a fun and wonderful tradition and I'm so excited to start it with my three boys!!! I can't wait until they go to bed so our elf, now named Johnny Jingle, starts his adventure and explores our house when we are sound asleep!",
      "rating": 5.0,
      "verified": true,
      "author": "Mamaa4444",
      "helpful_votes": 0,
      "publication_date": 20151201
    },
    {
      "title": "Not the original Elf In A Shelf as pictured!",
      "text": "What was received is not the elf in the picture. I am looking to replace the original El On A Shelf as ours has been misplaced a my kids are anxiously awaiting him. The original elf is pictured but what I received is the new one. 😭 Will sadly return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Bonham",
      "helpful_votes": 4,
      "publication_date": 20151202
    },
    {
      "title": "Super cute new CHRISTMAS tradition",
      "text": "This story book and elf are a great new Christmas tradition for our family. We have three little boys (age 5,3, and 1) they loved the story and have loved waking up each morning to the elf getting into more shenanigans!",
      "rating": 5.0,
      "verified": true,
      "author": "Erica Montoya",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "The highlight of Christmas",
      "text": "When my 7 year old son first saw the elf waiting for him, he said with the purist sincerity, \"My dreams came true!\" I didn't realize what an emotional impact this would create on him, or how much of a believer he still is. This is now definitely going to be an annual tradition.",
      "rating": 5.0,
      "verified": true,
      "author": "DZ",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Nice book and silly elf",
      "text": "I caved and bought one. Happy with the product and value. It’s authentic. Now I’m stuck hiding this silly elf around the house every night. I shove wire in his limbs so I can make it do cooler things. I think the elf will wear out after a few seasons.",
      "rating": 5.0,
      "verified": true,
      "author": "RegularGuy",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Wonderful Christmas tradition!",
      "text": "Such a wonderful Christmas tradition to start! We kept our blue eyed boy close to our tree! Also comes in blue eyed girl. Hispanic brown eyed boy. Hispanic brown eyed girl! Check them out!",
      "rating": 5.0,
      "verified": true,
      "author": "Tanya C.",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Great addition to Christmas traditions",
      "text": "Elf on the shelf brought so much extra joy and fun to Christmas. My son loved waking up every morning to find his new spot. We read the book every night too. If you’re considering getting this for next year, just do it. You won’t regret it. We also got the St Bernard dog, and almost a month after Christmas, he’s still cuddling him every night. The animals are great because the kids can hold and touch them, unlike elf.",
      "rating": 5.0,
      "verified": true,
      "author": "victori_ahhh",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Dash",
      "text": "Who doesn’t love elf on the shelf?! It’s so cute and decent quality. We started the tradition last Christmas with our 5yr old son and he ended up giving him the name Dash! How fitting.",
      "rating": 5.0,
      "verified": true,
      "author": "MrsDiMatteo",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Finally got one",
      "text": "I finally broke down and purchased an elf on the shelf. I’ve been telling my 4 year old son that Santa was sending someone to keep an eye on him. I’m hoping this will help him to listen better and behave since he knows Santa will be watching him. Can’t wait to start the Elf movements.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "BEST purchase I've ever made!!!",
      "text": "This started so many wonderful, memorable traditions in our household. I can't wait to see the joy in my son's face every year when it's time for our elf to come visit for the month of December. He looks forward to it and talks about it all year. Absolutely one of the BEST purchases I've ever made. There are sooo many ideas of how, where, when to hide your elf on Pinterest. You'll never run out of ideas. If you're contemplating purchasing one of these for your child, DO IT!!! You will not regret it. Just the excitement on your child's face makes this elf priceless.",
      "rating": 5.0,
      "verified": true,
      "author": "Misty Elam",
      "helpful_votes": 0,
      "publication_date": 20141210
    },
    {
      "title": "it's an elf",
      "text": "my daughter's friends all had elves, so we gave in and made sure one showed up for her this year, and the book is a nice way to explain it. But there is a serious amount of excess packaging involved. Since your kid isn't supposed to know the elf came in a box, having a giant box to secretly dispose of was unnecessary.",
      "rating": 4.0,
      "verified": true,
      "author": "S Cooper",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "After he went pee in the potty he went and told Nino what a good boy he was",
      "text": "We just got our little elf and my two year old named him Nino despite my husbands request to name him TPain. He loves to look for Nino! After he went pee in the potty he went and told Nino what a good boy he was :) I recommend letting your kid pick the name no matter what. Our son is only two but he knows that he chose his name and it makes him super happy! I thought he was maybe too young to start this, but seeing him pick his name, I just ask him where Nino is and he absolutely loves to look around and find him! Highly recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "MJ Grant",
      "helpful_votes": 0,
      "publication_date": 20141205
    },
    {
      "title": "The search becomes addictive for your child",
      "text": "My 7 year old granddaughter has become obsessed with this thing. First thing every morning she searches for it and won't quit until she finds the hiding place. My wife of course then has to hide it again so when she gets home from school, it's search time again. For it to be worth while, you (the adult??) has to be dedicated to hiding it as many times as possible and putting it in amusing positions. Don't underestimate your child. Hide it where it is visible but make it challenging. I really believe these kids today are much sharper than we were and they love the exitement of the search.",
      "rating": 5.0,
      "verified": true,
      "author": "JoeJoe56",
      "helpful_votes": 0,
      "publication_date": 20141215
    },
    {
      "title": "Elf on the shelf!",
      "text": "I loved this Elf and so did my 3 year old. I liked how it came with the book and the box/ case to store the elf in until next year. It was really fun doing silly things with the elf and my son looked forward to see what the elf would be doing each day. It was a really fun tradition to start for our family.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "I caved",
      "text": "My son has been begging me for years for one. I finally caved and said ok. Santa brought him this one, and he is beyond excited. It comes with a book and everything.",
      "rating": 5.0,
      "verified": true,
      "author": "LindseyE117",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Three Stars",
      "text": "do not get the elf on the shelf unless you have dedication and self-discipline.",
      "rating": 3.0,
      "verified": true,
      "author": "k",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Made me a believer",
      "text": "My favorite little Buddy absolutely loves this. He was so excited. And although at first I was skeptical of the whole idea, watching my little Buddy believe, made me glad I made the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Warburton",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "This made every day exciting during the holidays.",
      "text": "I wish this would have been around when I was little. I have the first Addition and the third edition. They have definitely changed the facial features of the elf and the hat stays on a lot better than it used to but the book is still a holiday treasure for my family.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. P",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Exactly what he wanted",
      "text": "Wanted an Elf on the Shelf for my grandson and hard to locate in the stores...couldn't get a brown eyed boy but at least I got the boy and it came right on time and for the right price. Very pleased",
      "rating": 5.0,
      "verified": true,
      "author": "M Vardi",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Elf not Included!",
      "text": "This package was delayed about 4 or 5 days. When I finally received the product. It was just the book and no Elf. Product description clearly states Elf included. My daughter was so disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Cesar Serrano",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "I’m pretty excited to start this tradition",
      "text": "I’m pretty excited to start this tradition. I’m not sure what happened but my book box is a little damaged. I know it shouldn’t be a big deal, but I’ll be saving it for hopefully the next decade and it stinks that it will not be perfect to start. The amazon box was not damaged so it makes me believe it didn’t happen during shipping.",
      "rating": 2.0,
      "verified": true,
      "author": "Lauren Francis",
      "helpful_votes": 2,
      "publication_date": 20171124
    },
    {
      "title": "Every home needs an elf",
      "text": "Who doesn't love this guy? My daughter's elf disappeared (elfin magic) when he needed to appear this year (a promotion?) and I promised her a replacement (we contend you have to be referred by a current elf family). It arrived quickly and jumped into action. There is a lot of competition among family elves. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenrus",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "SO cute!",
      "text": "I purchased for my niece, and she loved it! Every morning she would wake up looking for \"Tito\". It is such a great gift. It is very flimsy, but... I think that should be expected. I would recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Marissa",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Fun family tradition",
      "text": "This product came quickly and packaged beautifully! Our 3 year old twins were old enough to try out this Christmas tradition. Our little guys named him Ce-Ce and love searching for him every morning. Very well made and sturdy! I highly suggest this if you would like to add some more Christmas magic to your home!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "THE MAGIC OF THE ELF ON THE SHELF!",
      "text": "The Elf on the Shelf Tradition Continues! We have always heard about the Elf on The Shelf and the magic he brings to Christmas. Well, we finally decided to get this little guy from the North Pole to help carry the tradition on with our two grandson's. What a great way to stimulate the spirit of Christmas. The Elf on The Shelf is always watching out for how well our grandson's are behaving and reporting back to Santa at the North Pole. You never know where our Elf is going to be found from day to day. If you don't have one of these little guys I would suggest you get one and experience what Christmas is all about.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles L. Tompkins",
      "helpful_votes": 0,
      "publication_date": 20131202
    },
    {
      "title": "I love our elf",
      "text": "I love our elf. We got it for our son as a Christmas present. I’m not into the whole “elf is watching you” thing, so I decided that the elf is going to help our family with Christmas traditions such as bringing us Christmas books every night, delivering special Christmas snacks, and helping us deliver our letter to Santa.",
      "rating": 5.0,
      "verified": true,
      "author": "AliCo",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Fun to everyone!",
      "text": "Bought this last year for grandkids. They loved it. Their parents had even more fun moving the elf every night to see their little one’s eyes light up each morning to discover that the elf had come back after reporting to Santa at the North Pole. Had to order for my next grandchild turning 3.",
      "rating": 5.0,
      "verified": true,
      "author": "gardengal",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "Expecting fun things",
      "text": "Have not used this yet. Bought it for my twin sons this christmas. My nephew had this in years past and absolutely loved it. I guess its all dependant on the person who its catered too. Comes with a book so thats an added bonus. Look foward to placing the elf in various precarious positions every night so my boys have sonething to look foward to in the morning",
      "rating": 5.0,
      "verified": true,
      "author": "joseph m miller",
      "helpful_votes": 0,
      "publication_date": 20161108
    }
  ],
  "product_meta": {
    "title": "The Elf on the Shelf: A Christmas Tradition",
    "description": "The Elf on the Shelf: A Christmas Tradition THE ELF ON THE SHELF: A CHRISTMAS TRADITION (INCLUDES BLUE-EYED, LIGHT SKIN TONE BOY SCOUT ELF) \n\n\nBring the Christmas magic home to your family this year! The original Elf on the Shelf set includes a magical scout elf from the North Pole and a beautiful children’s story book, all in a keepsake gift box. When you adopt this special elf and name him, he receives his Christmas magic and can fly to the North Pole—but only when all girls and boys are sound asleep. At the start of each holiday season, the elf returns to his family’s house to be Santa’s eyes and ears, and every night he travels back to the North Pole to report in. Families can register their elf online to receive an official adoption certificate and a special letter from Santa. Set includes boy elf with light skin tone. \n\n \n *  A timeless Christmas tradition that the whole family can enjoy\n *  The Elf on the Shelf comes in light skin tone and dark skin tone boy and girl scout elves\n *  Bestseller with over 4 million copies sold\n *  A Scout Elf Game Day Jersey is available, sold separately\n\nThe Elf on the Shelf: A Christmas Tradition Keepsake Box Gift Set HAVE YOU EVER WANDERED HOW SANTA WOULD KNOW WHO IS NAUGHTY OR NICE?\n\n\nThe Elf on the Shelf: A Christmas Tradition is the very special tool that helps Santa know who to put on the Naughty and Nice list. This interactive holiday hide-and-seek tradition is perfect for children and families of all ages. The tradition begins when Santa sends his scout elves out to Elf Adoption Centers. Waiting for their families to bring them home, these patient elves hibernate until their family reads The Elf on the Shelf, gives their elf a very special name, and registers their adoption online. Once named, each scout elf will receive its Christmas magic and becomes part of the family's Christmas each and every year.\n\n\n\n\n\nThe Elf on the Shelf: A Christmas Tradition SCOUT ELVES ARE EYES AND EARS OF SANTA CLAUS\n\n\nAlthough they cannot be touched, or else they may lose their magic, the elf will always listen and relay messages back to Santa. Taking in all the day-to-day activities around the house, no good deed goes unnoticed; these scout elves take their job seriously.\n\n\n\nBefore the family awakes each morning, their special scout elf will fly back to their home from the North Pole. However, since these elves like to play games, don't expect to find them in the same spot! While some like to hide in the freezer (probably because it reminds them of the North Pole) and others prefer to sit on the fireplace mantle or hang from the chandelier, these elves love to play hide-and-seek with their families.\n\n\n\nFROM THE MANUFACTURER\nYear after year, children and adults alike are baffled by the mystery of how Santa really knows who’s been naughty or nice. After much urging by the elves and Mrs. Claus, Santa has allowed his biggest secret to be revealed in The Elf on the Shelf: A Christmas Tradition. At the start of each Christmas season, the elf appears to serve as Santa's eyes and ears, traveling back to the North Pole each and every night to make a detailed report of the day’s activities. This keepsake gift set includes a light skin, blue eyed boy North Pole pixie scout elf and a hardbound watercolor picture book. Children can register their elf online to receive an official adoption certificate and a special letter from Santa.\n\nREVIEW\nA Publishers Weekly bestseller!\n\n\"A great holiday activity for the whole family!\"--Kansas City Star\n\n\"Tip of the day: get an Elf on the Shelf.\"--Orange County Register\n\nSee more",
    "rating": 4.8,
    "feature_bullets": [
      "PART OF THE FAMILY: Add a new member to the family this Holiday with this Scout Elf from the Elf on the Shelf. This scout Elf reports to Santa Claus each night to let him know who has been naughty or nice.",
      "HIDE AND SEEK - One of the best parts of getting an elf is waking up each morning and trying to spy where they’re hanging out for the day. Maybe they’re sitting on the fridge or hanging from the light. Maybe they got into some mischief during the night!",
      "SANTA’S LITTLE HELPER - Every night this Scout Elf will return to the North Pole to say whether your family has been naughty or nice. Santa takes that information every night and decides if you’re getting presents or coal this year.",
      "AWARD WINNING ELF: The Elf on the shelf is one of the biggest holiday hits. It won the Best Toy Award by Learning Express, Book of the Year Award from Creative Child Awards, and National Best Books Award sponsored by USA Book News.",
      "PRODUCT SPECIFICATIONS: Package Contains (1) The Elf on the Shelf: Blue Eyed Boy Scout Elf with Illustrated Storybook."
    ],
    "specifications": {
      "Product Dimensions": "11.02 x 2.76 x 10.63 inches",
      "Item Weight": "1.85 pounds",
      "ASIN": "0976990709",
      "Item model number": "EOTBOYL",
      "Manufacturer recommended age": "3 years and up",
      "Best Sellers Rank": "#6,225 in Toys & Games",
      "Customer Reviews": "4.8 out of 5 stars9,906 ratings4.8 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Language:": "English",
      "Mfg Recommended age": "36 months - 99 years",
      "Manufacturer": "CCA and B, LLC"
    },
    "categories": [
      "Dress Up & Pretend Play",
      "Pretend Play",
      "Toys & Games"
    ],
    "price": ""
  }
}