{
  "website_summaries": [
    {
      "verdict": "A useful complement to the GMAC questions, but the review materials aren't as detailed as those of the Manhattan Prep.",
      "pros": [
        "The Kaplan study materials are the gold standard",
        "they give you just what you need for the exam, while excluding concepts that may be potential distractions"
      ],
      "cons": [
        "A handful of students pointed out a few small typos within the practice test explanations, but they were not anything more than a minor distraction"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Missing answers choices",
      "text": "It's a good resource and it's been helping me but for some of the practice sections there's entire sections where answer choices are just completely missing, so you can't practice that section. I'm not sure if it's just my book or it this is wide spread but it's very frustrating.",
      "rating": 3.0,
      "verified": true,
      "author": "T. E. Jones",
      "helpful_votes": 14,
      "publication_date": 20190602
    },
    {
      "title": "Similar content/questions to older editions",
      "text": "Good as a starter book if you're just at the beginning of your gmat prep. But I already took my first gmat with the help of older editions, and I bought the 2019 prep plus to review for my upcoming test retake. Was hoping to get a whole new set of questions and practice tests. But a lot of the questions in the online course practice tests were exactly the same as those in older editions.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20181121
    },
    {
      "title": "Such a WONDERFUL GMAT study course",
      "text": "It has been said that the most effective way to study for the GMAT is using one study course and KAPLAN's study course is the best. I have increased by score by so much by reading this book. Comes with not only the book but free online practice tests in the true GMAT format. So much quality for so cheap!! Definitely recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Megan Tronick",
      "helpful_votes": 6,
      "publication_date": 20190309
    },
    {
      "title": "Great study guide. Some flaws.",
      "text": "This book has been so helpful in helping me study for the Gmat. Regarding the missing answer choices posted by another reviewer: the questions are data sufficiency questions. The answer choices are always the same for these types of problems. You would need to actually read the book to know that there is a method of solving these problems without needing to look at the answer choices. There are some examples/practice problems where the answers are completely off due to typos in the calculated work. I have posted a picture that shows a wrong answer because the book asked for the diameter but the radius was selected as the proper answer. I recommend the book despite its flaws. Four stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Aly",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Very Helpful",
      "text": "I think this guide does an excellent job of explaining what you need to know for the exam. The answer explanations are always clear and coherent, something that can't always be said for the official guide (for the quant section, at least). I would recommend supplementing with another book for more quant practice questions though, as there aren't enough. Plus I think Kaplan's quant questions are slightly easier than the actual exam. The verbal section is very thorough and informative though, and helped me greatly improve my verbal score.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Buckholt",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Good Study Book",
      "text": "It’s a solid book- very big and time consuming but then again so is the GMAT. It gets 4 stars because it’s making my life a nightmare at the moment. I also wish it explained a few things more directly in the book instead of eluding to definitions.",
      "rating": 4.0,
      "verified": true,
      "author": "PKL266",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Book re-uses questions in online material",
      "text": "The books online practice tests re-use the questions from themselves and from the practice questions laid out in the book. This means you will see your scores going up in the practice tests not from understanding the subject matter but just from knowing some of the questions ahead of time.",
      "rating": 2.0,
      "verified": true,
      "author": "Bryce",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Received book damaged",
      "text": "Book came in the package with bottom corner badly folded. Would expect to receive my product in new condition like I paid for",
      "rating": 3.0,
      "verified": true,
      "author": "greg medrano",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "I feel the practice tests are too easy",
      "text": "I planned to take the GMAT so I got a few prep books. This Kaplan guide doesn't give a whole lot of really useful strategies, but the worst part is I felt the practice tests seemed easier than the official practice test. It made studying with the book less confident than one should feel.",
      "rating": 3.0,
      "verified": false,
      "author": "For Real",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Great prep tool",
      "text": "Fantastic for prep, timing, and to prepare you for what to expect. There's a ton of content to go through. I particularly enjoyed being able to understand and prepare for how they frame certain questions. It does get repetitive but I'm not so sure that's a bad thing. The reality is that Kaplan makes the \"real\" GMAT, so you're getting prepped with actual content that's catered to the actual test.",
      "rating": 5.0,
      "verified": false,
      "author": "Jeff Kimble",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Helpful",
      "text": "If you 've never taken the GMAT before this is a decent place to start. the tips are valid and there is plenty of opportunities to practice. The online component is helpful though some of the questions are the same. That being said this is a helpful tool, especially for the strategy.",
      "rating": 4.0,
      "verified": false,
      "author": "Antigone Walsh",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Great detail",
      "text": "This is a well written and very thorough study tool. It covers so much material as well as tons of tips and tricks for taking the exam",
      "rating": 5.0,
      "verified": false,
      "author": "LOL",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Did not follow instructions.",
      "text": "I wrote a gift note and my partner never received the note. Don’t count on that happening. Very disappointed",
      "rating": 1.0,
      "verified": false,
      "author": "nick",
      "helpful_votes": 0,
      "publication_date": 20180919
    }
  ],
  "product_meta": {
    "title": "GMAT Prep Plus 2019: 6 Practice Tests + Proven Strategies + Online + Mobile (Kaplan Test Prep)",
    "rating": 4.2,
    "specifications": {
      "Item Weight": "4.47 pounds",
      "ISBN-10": "1506234895",
      "Paperback": "1188 pages",
      "ISBN-13": "978-1506234892",
      "Product Dimensions": "8.38 x 1.7 x 10.88 inches",
      "Publisher": "Kaplan Publishing (June 5, 2018)",
      "Language:": "English",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Books",
      "Business & Finance",
      "New, Used & Rental Textbooks"
    ],
    "price": ""
  }
}