{
  "website_summaries": [
    {
      "verdict": "This inexpensive guide covers more than 730 species and features a quick reference guide to help you more easily narrow down an unknown tree.",
      "pros": [
        "Covers both native and introduced trees",
        "Over 730 species and 160 range maps",
        "Size is compact, but type is still easy to read",
        "Has a quick reference guide",
        "280 pages",
        "Specific species' text, maps, and illustrations are all together for ease of use",
        "Affordable"
      ],
      "cons": [
        "Illustrations are small and hard to see",
        "Some feel that the information provided for each tree type is too simple"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "MAN, talk about detailed explanations. The way this ...",
      "text": "MAN, talk about detailed explanations. The way this book is layed out, there is no way you will fail to identify a tree. Even has \"shaded areas of growth\" on the parts of the continent it is predominate in. Just about the most valuable book in my pack!",
      "rating": 5.0,
      "verified": true,
      "author": "T-Wolfe",
      "helpful_votes": 13,
      "publication_date": 20170905
    },
    {
      "title": "Small, Brief - exactly what you would expect in a small big on a big subject.",
      "text": "For what it is - a small book on trees in North American, it's ok. Shows leaf patterns and brief descriptions - can't really expect much more from a book this size. If you're looking for more information or details, this isn't the book for you.",
      "rating": 3.0,
      "verified": true,
      "author": "MaryB",
      "helpful_votes": 6,
      "publication_date": 20180728
    },
    {
      "title": "Not a good field identification guide.",
      "text": "All illustrations are hand drawn, no photographs. Descriptions are minimal and difficult to distinguish between two similar trees - which is a main reason I purchased this book. Field identification is next to impossible because of how it’s organized. There is no quick way to reference without extensive knowledge about tree groupings and classification. So if you’re a beginner like me you don’t have enough knowledge to make that a simple task.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Useful as a backup source, at best",
      "text": "The introductory \"How to use this Book\" actually is not very useful at all. There is not a clear way to start from an unknown tree and finding its identity. There is an opening section describing families of trees, but this list of 71 families spans 8 pages, so a newbie at tree ID hasn't a chance. The description of each species is detailed and helpful, once you get there, but that is the problem.",
      "rating": 3.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Could use more detail",
      "text": "This is a great book doesnt have much on bark identifying but will give you the basics",
      "rating": 3.0,
      "verified": true,
      "author": "William Roberts",
      "helpful_votes": 4,
      "publication_date": 20180427
    },
    {
      "title": "All about trees.",
      "text": "I enjoy reading this book because of the vast information about the trees as well as the pictures of the branches with the seeds and the specific locations of them. Great book. Thank you Kindle!",
      "rating": 4.0,
      "verified": true,
      "author": "Darryl D. Badong",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "An excellent resource!",
      "text": "The Golden Field Guide book \"Trees Of North America\" is an excellent resource. This reference work shows all classes and species native to North America. This work shows families of trees and their common characteristics. Each individual species has excellent illustrations of bark, leaves, nuts/fruit and a map of its native range. Each species has a concise text decription with distribution information, reproduction details, heights and life expectancy. This book meets the high standard for Golden Field Guide books and I recommend it to those interested in the giants of our land - the trees, both the largest and longest-lived life forms on our planet. Five Stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Stone Dog",
      "helpful_votes": 6,
      "publication_date": 20120617
    },
    {
      "title": "Check out those trees",
      "text": "We are studying trees as part of our Bible/nature class for the next couple of months. The kids like being able to identify trees in the yard. The book is pretty simple to use. Will update after we've used it a while longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Kourtney",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "for the love of trees",
      "text": "Fascinating and fun guide to trees. I used this as research for a character in two of my novels, 'Every Time I Think of You' and its sequel 'Message of Love.' The young narrator knows a lot more about trees, plus having lived in California for decades, I'd forgotten which trees grow on the East Coast!",
      "rating": 4.0,
      "verified": true,
      "author": "Jim Provenzano",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "A childhood favborite in excellent condition!",
      "text": "I first got a hardcover copy of this book at like age 6, I think, and it quickly became my favorite book at that age. the copy I received was as described, near-perfect condition, and it's too bad my father is not still alive to see my latest copy. Thanks so much!",
      "rating": 5.0,
      "verified": true,
      "author": "jmd123",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Has the info I want.",
      "text": "Got a BS in Biological Sciences 50 years ago, wanted a quick Tree ID book to refresh my fading memory, this one is OK, not a Peterson style index but works for my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "DGF",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Excellent guide.",
      "text": "I found this an excellent field guide to the trees in my locale. The descriptions and illustrations were exactly what was needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuckinv",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Bought for my grandkids",
      "text": "While I was buying the bird book and insect book I thought I would buy this one too for my grandkids.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "A Great Field Guide",
      "text": "This is a fine field guide, which I will mainly use at home to identify trees seen in photographs, etc.(although I'll likely be buying another copy for actual field use). I have always liked this series of reference works, and this continues the tradition of being clear and comprehensive it its treatment of the subject. As a former Naturalist with the National Park Service, I have a lot of experience with field guides, and I am very happy with my purchase. I would recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Puzzler4879",
      "helpful_votes": 5,
      "publication_date": 20110514
    },
    {
      "title": "Great",
      "text": "AMAZING, even provides where in the us the trees are located to help find the right tree faster",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica ",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "A lot of info in a small package",
      "text": "Price and size are what makes this guide so great. It provides a good overview of the trees of North America in a very portable format. The small size, however, means that the illustrations are not as large or detailed as we would prefer. It also limits the amount of specific information that can be included. We recently relocated to the Pacific Northwest and have found region-specific books (particularly from Lone Pine Publishers) to be superb. I recommend this as a great resource at a very good price.",
      "rating": 4.0,
      "verified": true,
      "author": "GJS",
      "helpful_votes": 9,
      "publication_date": 20070629
    },
    {
      "title": "Kindle version very disappointing",
      "text": "I bought the Kindle version of this book expecting to use it during my walks in the woods, but it is useless for that. The illustrations are very small and many of the ones I viewed, particularly range maps, were useless even after zooming in on them. I also expected the book to have some sort of identification process to lead the reader to pertinent illustrations so the reader could differentiate what he is seeing in front of him from among candidate species in the book. No such luck. On the other hand, if the reader already knows what he's looking for, he can easily find it. I returned my copy for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Avid Book Consumer",
      "helpful_votes": 7,
      "publication_date": 20150603
    },
    {
      "title": "Perfect field guide",
      "text": "Finally a field guide that illustrates trees by leaf, blossom, and fruit, with accompanying drawings of what the entire tree looks like. Organized by family, with similar leaves on the same page, it enabled me to quickly identify a few trees whose identification had stumped me.",
      "rating": 5.0,
      "verified": true,
      "author": "Summer",
      "helpful_votes": 0,
      "publication_date": 20140918
    },
    {
      "title": "Solving our questions",
      "text": "We recently moved to a new state and did not recognize many of the local trees. This book helps us to be sleuths and to be able to identify many of these trees that are new to us. We indeed like the book.",
      "rating": 4.0,
      "verified": true,
      "author": "Jerry Wibberly",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "Waste",
      "text": "Has minimal information has no real system for how trees are ordered waste of money for me",
      "rating": 2.0,
      "verified": true,
      "author": "Christopher Duecy",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Want to ID Trees, than this is the book for you!",
      "text": "What's not to like about trees, good descriptors and helped me out with my Dendrology class.",
      "rating": 5.0,
      "verified": true,
      "author": "NatPat",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "A field guide you can take with you",
      "text": "This is an excellent field guide that is small enough to actually take in the woods with you. Well-organized by family group and includes enough detail for an amateur naturalist to make a lot of identifications.",
      "rating": 5.0,
      "verified": true,
      "author": "SCBuzz",
      "helpful_votes": 0,
      "publication_date": 20160616
    },
    {
      "title": "One of the better guides",
      "text": "Detailed color illustrations including multiple leaves in context of branches, as well as berries, buds and blossoms makes this one of the better identification guides I've found. I'm still looking for the perfect guide, though. One that has this much detail along with actual color photographs.",
      "rating": 4.0,
      "verified": true,
      "author": "Greybear's mom",
      "helpful_votes": 0,
      "publication_date": 20130721
    },
    {
      "title": "Very informative",
      "text": "Just what I needed, plenty of good info and semi pocket sized for easy carry.",
      "rating": 5.0,
      "verified": true,
      "author": "The Dude",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "tree books",
      "text": "I tried using this book as a pocket reference and being a novice it didn't work well, unless I was trying to find off the record trees. I ended up using a phone app that worked better. Why don't tree books have more specific pictures of leaves?",
      "rating": 3.0,
      "verified": true,
      "author": "Mary Jo",
      "helpful_votes": 3,
      "publication_date": 20130716
    },
    {
      "title": "Great pocket-sized reference",
      "text": "If you love trees and want to learn more about them, this is a perfect book to keep in your back pocket. Trees are all around us, and this book will help you quickly locate more in-depth information about the leafy friends we walk past every day. Learn how to identify your favorite trees and find out about new and interesting ones. This is a great beginner's guide to learning about trees. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "david c mcdonald",
      "helpful_votes": 0,
      "publication_date": 20130623
    },
    {
      "title": "Funny really",
      "text": "The story is I ordered this little guide to help identify this tree in my backyard (novice at identifying trees) it was bugging me for some reason so I ordered this book. I found the name of it! Praise God! This book has really great info along with great pictures to help. If you need help at identifying trees or just want general info. This is your go-to-guide.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin KJV",
      "helpful_votes": 4,
      "publication_date": 20180814
    },
    {
      "title": "sucks",
      "text": "Book is too small and doesn't have real pics. Most of the color drawings of leaves and trees look the same 2 me.",
      "rating": 2.0,
      "verified": true,
      "author": "Carloshud",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Four Stars",
      "text": "Pretty neat buy actual photos instead of artist sketches would be nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Kentucky evans",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "great book",
      "text": "This book is a revised edition of a book my grandmother gave my parents back in the '70s, and they liked it so much they wanted to give it as a gift to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn I",
      "helpful_votes": 3,
      "publication_date": 20121202
    },
    {
      "title": "Nice Little pocket book",
      "text": "This is a nice little pocket book that can be taken just about anywhere. Though not as complete as some of the larger books, it really does help to identify most trees. The color photos help with the identification and it is well worth the price to throw in your backpack or on your bike when in the woods.",
      "rating": 4.0,
      "verified": true,
      "author": "T. M.",
      "helpful_votes": 0,
      "publication_date": 20070515
    },
    {
      "title": "Helpful for identifying",
      "text": "Very useful as part of my arsenal for identifying the all the natural forest trees around me. Beautifully illustrated.",
      "rating": 5.0,
      "verified": true,
      "author": "French Roast",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "Perfect resource for my painting classes",
      "text": "Perfect resource for my painting classes! Now when a student worries that their tree does not look like the one everyone else is painting, I can show them their tree in the book; that it actually is out their in the world.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy Stubb",
      "helpful_votes": 0,
      "publication_date": 20150623
    },
    {
      "title": "Well organized, informative, easy to use.",
      "text": "Photos in this book show leaves accurately and make tree identification easy. Photos of berries, bark, the full-size tree and common locations for the species augment this very effective tree identification book",
      "rating": 5.0,
      "verified": true,
      "author": "B. Murray",
      "helpful_votes": 0,
      "publication_date": 20130802
    },
    {
      "title": "Trees of North American",
      "text": "A great guide book. I found many of the trees where I live are not native to my area and are damaging the native plants etc. Great source of information.",
      "rating": 5.0,
      "verified": true,
      "author": "Caroline Connor",
      "helpful_votes": 0,
      "publication_date": 20140203
    },
    {
      "title": "Great Book when Hiking",
      "text": "This book is small enough to carry with you. The picturers and definitions are consise and well written. I am extremely pleased with this purchase through Amazon and I would recommend it to others. Ellen P.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellen M. Peacock",
      "helpful_votes": 0,
      "publication_date": 20121120
    },
    {
      "title": "Thorough and helpful tree guide",
      "text": "When I was growing up, my parents had a copy of this book which I used often. Now that I am married and have a home of my own, I found myself missing it and wanted a copy for my own family. I am using it to help identify trees on our 10 acre property and to assist in planning further landscaping around our property. I also work with Boy Scouts and have found this book helpful in teaching them to identify trees indigenous to our area and teaching them to identify edible plants, etc. I find it thorough and easy to use. The illustrations are excellent and very helpful. I highly recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "buyerbob",
      "helpful_votes": 0,
      "publication_date": 20100716
    },
    {
      "title": "Great help!",
      "text": "Very helpful as I am out walking my property. We have 20 acres and find so many different trees.",
      "rating": 4.0,
      "verified": true,
      "author": "Teri ",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "It's OK",
      "text": "Drawings leave something to be desired. Descriptions are often vague and leave a lot to be desired. That said, for a book it's size it has been of some assistance.",
      "rating": 3.0,
      "verified": true,
      "author": "WSmith",
      "helpful_votes": 2,
      "publication_date": 20130624
    },
    {
      "title": "Easy to use",
      "text": "Simple to use. Makes identifying trees easy and enjoyable. I take it with me on all of my outings.",
      "rating": 5.0,
      "verified": true,
      "author": "Camper2",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Handy, answers all my questions",
      "text": "Handy guide to North American trees. I mostly use it in my timber harvest and firewood operations.",
      "rating": 5.0,
      "verified": true,
      "author": "Jere39",
      "helpful_votes": 0,
      "publication_date": 20150423
    },
    {
      "title": "trees",
      "text": "very useful book for identifying trees in my back yard and neighborhood. Easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "J. N. Childs",
      "helpful_votes": 0,
      "publication_date": 20151019
    },
    {
      "title": "Do you know what tree lives near you?",
      "text": "Invaluable handbook for those who want to know what kind of trees live about them.",
      "rating": 5.0,
      "verified": true,
      "author": "Mare",
      "helpful_votes": 0,
      "publication_date": 20151123
    },
    {
      "title": "perfect for trying to find species of trees",
      "text": "I bought this book to research the trees on my prorperty. It is laid out well with enough tools to help you identify your tree. Gives you some other tools and insight into each species",
      "rating": 4.0,
      "verified": true,
      "author": "eric mays",
      "helpful_votes": 0,
      "publication_date": 20130107
    },
    {
      "title": "Perfect!",
      "text": "The product was exactly what I was looking for and what was listed.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake W.",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Trees of North America: A Guide to Field Identification",
      "text": "Got this to give as a gift and my friend loved it. It has great descriptions and drawings to help make tree identification easy.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Ward",
      "helpful_votes": 0,
      "publication_date": 20130514
    },
    {
      "title": "NA Trees",
      "text": "Perfect for what I needed. Good price, good size and easy to research what I needed. Glad I purchased the book and advise others with this need to go for this one.",
      "rating": 4.0,
      "verified": true,
      "author": "Fran Iddings",
      "helpful_votes": 0,
      "publication_date": 20130123
    },
    {
      "title": "Great descriptions and pictures to identify the plants",
      "text": "Bought it as a Christmas gift for my boyfriend and he loves it. Great descriptions and pictures to identify the plants.",
      "rating": 5.0,
      "verified": true,
      "author": "lily zeng",
      "helpful_votes": 0,
      "publication_date": 20150622
    },
    {
      "title": "Best book on tree identification I've read",
      "text": "Great info, great pics, just a great book all around. I watched a youtube video where a guy was recommending this book and I agree with him that it's invaluable.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20130611
    },
    {
      "title": "Good Reference book",
      "text": "I have a new place with lots of trees on the property, need to identify the ones I need to keep.",
      "rating": 4.0,
      "verified": true,
      "author": "hoseverdie",
      "helpful_votes": 0,
      "publication_date": 20131120
    },
    {
      "title": "Good tree book",
      "text": "I wanted a book to help me identify trees. This is a good resource for that. It has pictures and detailed descriptions.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy Goodman",
      "helpful_votes": 0,
      "publication_date": 20140223
    },
    {
      "title": "Five Stars",
      "text": "Very nice book, exactly what I wanted, perfect transaction! Fast delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "jstein53@yahoo.com",
      "helpful_votes": 0,
      "publication_date": 20150111
    },
    {
      "title": "worth the buy and i love IT would",
      "text": "worth the buy and i love IT would worth the buy and i love IT would worth the buy and i love IT would",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela Jones",
      "helpful_votes": 0,
      "publication_date": 20130926
    },
    {
      "title": "Trees",
      "text": "This was bought as a gift. The book was everything I was looking for as a gift for someone who observes trees and collects cones. It was very well received.",
      "rating": 5.0,
      "verified": true,
      "author": "lmott",
      "helpful_votes": 0,
      "publication_date": 20110129
    },
    {
      "title": "Excellent field guide",
      "text": "This book is excellent for just carrying around as a field guide, probably one of the best there is. Good artwork and descriptions, kept short and simple, with all general identification features included. Large list of native trees with some exotic species as well, it doesn't leave any important ones out.",
      "rating": 5.0,
      "verified": true,
      "author": "Holstein",
      "helpful_votes": 9,
      "publication_date": 20060825
    },
    {
      "title": "After all these years, this is still the book ...",
      "text": "After all these years, this is still the book that I would buy, if I could only buy one book about the trees of North America.",
      "rating": 5.0,
      "verified": true,
      "author": "David Bruggers",
      "helpful_votes": 3,
      "publication_date": 20140924
    },
    {
      "title": "Makes identification easy!",
      "text": "This has been my husbands \"go to\" book for years when referencing trees and now we purchased two more for son and son-in-law. Valuable for landscape design.",
      "rating": 5.0,
      "verified": true,
      "author": "monica honroth",
      "helpful_votes": 0,
      "publication_date": 20140818
    },
    {
      "title": "Where are fall colors?",
      "text": "Hoped to get a book that would also show leaves in fall colors. That's ideally when the differentiation is at PEAKE. Not in this book.",
      "rating": 4.0,
      "verified": true,
      "author": "Gwen L Fullen",
      "helpful_votes": 0,
      "publication_date": 20121103
    },
    {
      "title": "Not photos - vague tiny illustrations",
      "text": "Pictures are TINY, very few illustrations of bark, and some types of trees are not even listed SUCH AS PEAR TREES!",
      "rating": 1.0,
      "verified": true,
      "author": "LG Ripdmeov",
      "helpful_votes": 4,
      "publication_date": 20180505
    },
    {
      "title": "Golden Guides Are Famous",
      "text": "The Golden Field Guides have always been a favorite of mine. This is no exception! The images are very easy to look at and text is right to the point. Map locators very clear.",
      "rating": 4.0,
      "verified": true,
      "author": "Dennis Abdalla",
      "helpful_votes": 0,
      "publication_date": 20131107
    },
    {
      "title": "Just like the original from decades ago.",
      "text": "This appears to be a copy of the original, which is exactly what I wanted. My old copy just wore out from use.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob In Beacon",
      "helpful_votes": 0,
      "publication_date": 20130410
    },
    {
      "title": "Very Handy Tree Book",
      "text": "More complete than other tree books that I have. Easy to use. I've finally been able to identify some of the less common trees that I have on my property.",
      "rating": 5.0,
      "verified": true,
      "author": "SojuTX",
      "helpful_votes": 0,
      "publication_date": 20090613
    },
    {
      "title": "Still The Best",
      "text": "Golden Books nature guides are as good now as I remembered them from my childhood. The illustrations are well drawn and easily help the amatuer naturalist enjoy the world around them.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Gaus",
      "helpful_votes": 0,
      "publication_date": 20121203
    },
    {
      "title": "i wish it had actual pictures instead of drawings....",
      "text": "i wish this actually had pictures of the actual leaves and trees instead of hand drawn renderings. so i was a bit disappointed with this book. i am definitely going to get one with actual photographs next time,",
      "rating": 2.0,
      "verified": true,
      "author": "C. McClure",
      "helpful_votes": 11,
      "publication_date": 20130117
    },
    {
      "title": "Best Tree ID Book",
      "text": "I needed this for one of my Wood classes and the instructor recommended this. It is literally THE best tree ID book.",
      "rating": 5.0,
      "verified": true,
      "author": "Chase",
      "helpful_votes": 0,
      "publication_date": 20140414
    },
    {
      "title": "Awesome A-1 guide!",
      "text": "Really cool book/ feild guide. I t came in less than just over 24hrs. Couldn't believe how responsive sell (ers) were. Shipping was so fast it made my head spin!!! Almost bought the hardback version but am glad I didn't. It's also a bit smaller than what I thought it would be but for me, that was a plus! Fits nearly right in your pocket! Lettering is very nice and easy to read with slightly enlarged lettering! Very descriptive and the drawings are clear, nicely colored and very crisp thereby giving amazing details for identification!!! VERY HAPPY... Both book and seller are highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Manic Mechanic",
      "helpful_votes": 0,
      "publication_date": 20151005
    },
    {
      "title": "Ordered the book new, it arrived in new condition.  I have an old edition, this one is better (with revisions). Thanx",
      "text": "The old book I had got soaked lying out in a rainstorm. The new book is at least the same as the one i lost to natural causes, but it also has new information due to revisions. Thank you very much, and the price was right.",
      "rating": 4.0,
      "verified": true,
      "author": "Laurence Slagle",
      "helpful_votes": 0,
      "publication_date": 20130906
    },
    {
      "title": "Decent",
      "text": "Kind of clumsily arranged but I'll get used to it. But it has loads of information and will be used a lot!",
      "rating": 3.0,
      "verified": true,
      "author": "Kodiak7",
      "helpful_votes": 0,
      "publication_date": 20131130
    },
    {
      "title": "Wonderful",
      "text": "This book is exactly what I was looking for, I love to know what I am talking about.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelley A. Porta",
      "helpful_votes": 0,
      "publication_date": 20100217
    },
    {
      "title": "Great book.",
      "text": "I'm not a tree specialist but with this book I can identify the tree on my property. Very good for a homeowner.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Martus",
      "helpful_votes": 0,
      "publication_date": 20140114
    },
    {
      "title": "Tress of North America",
      "text": "What I don't like abou this book is that it doesn't really show the shape of the foilage of various trees not does it give adequate descriptions of flowers, bark and identifying marks. Consequently, it does not give me the help I wante in identifying trees. I would not reccommend this book to others. JMM",
      "rating": 2.0,
      "verified": true,
      "author": "JMM",
      "helpful_votes": 5,
      "publication_date": 20121006
    },
    {
      "title": "very good guide",
      "text": "Very clear color pictures of leaves, bark and buds, it is a great guide for identifying native plants and trees.",
      "rating": 5.0,
      "verified": true,
      "author": "Lester W Riley",
      "helpful_votes": 0,
      "publication_date": 20131020
    },
    {
      "title": "Trees of North America: A Guide to Field Identification by C. Frank Brockman [Kindle Edition]",
      "text": "Trees of North America: A Guide to Field Identification, Revised and Updated (Golden Field Guide from St. Martin's Press) [Kindle Edition] is a nice guide to help you identify the trees in your area. It is a complete a guide as needed and contains detailed drawings of each property identifier of the tree for identification, areas of the country where each tree can be found and bark identifiers for trees. The Digital format of Trees of North America: A Guide to Field Identification, as a Kindle Edition can be taken on you Digital Reading Device into the field or used at home on your PC with the Amazon Kindle PC Reader app. I love my trees.",
      "rating": 5.0,
      "verified": true,
      "author": "CDP's Onceagain habit of purchasingTop Contributor: Guitars",
      "helpful_votes": 6,
      "publication_date": 20140201
    },
    {
      "title": "Still A Very Good Book",
      "text": "Have this nearly exact book from 40 years ago. About time to replace it. Best arrangement and depiction I know of.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob E.",
      "helpful_votes": 3,
      "publication_date": 20171005
    },
    {
      "title": "Trees of America book review",
      "text": "Wonderful book. I had this same book back inthe 1980's and had it for many years. Somehow it got away from me. I'll watch this copy more closely.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Johnson",
      "helpful_votes": 0,
      "publication_date": 20130415
    },
    {
      "title": "too complex for me",
      "text": "a good book but more info than I wanted - just wanted something for walks in the woods - not a scholarly edition like this one - nothing wrong with it - just wrong for me",
      "rating": 4.0,
      "verified": true,
      "author": "bwz911",
      "helpful_votes": 2,
      "publication_date": 20170909
    },
    {
      "title": "TREES OF NORTH AMERICA",
      "text": "The book was like new and easy to use. It was exactly what we needed to identify local trees and was very informative.",
      "rating": 5.0,
      "verified": true,
      "author": "Janne M Crew",
      "helpful_votes": 0,
      "publication_date": 20131028
    },
    {
      "title": "learn& live",
      "text": "An in-depth easy to understand , comprehensive read for those who appreciate naturea and would like to say more then: \"hey, that's a pretty tree\".",
      "rating": 4.0,
      "verified": true,
      "author": "noraa",
      "helpful_votes": 0,
      "publication_date": 20120910
    },
    {
      "title": "Great Guide",
      "text": "This is the best compact, but complete tree guide for North America there is as far as I am concerned.",
      "rating": 5.0,
      "verified": true,
      "author": "Menelio Medina",
      "helpful_votes": 0,
      "publication_date": 20130609
    },
    {
      "title": "Worth buying again",
      "text": "Bought it as a second copy when my other was ruined by accident. A great visual guide for determing subspecies.",
      "rating": 5.0,
      "verified": true,
      "author": "BAS",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "What is that Tree anyway?",
      "text": "I bought this for a friend who is a Master Gardener and couldn't put it down before I wrapped it! Simple illustrations show differents types of trees (and I'm always saying, what is that tree anyway?).",
      "rating": 5.0,
      "verified": true,
      "author": "T. Cassingham",
      "helpful_votes": 2,
      "publication_date": 20070722
    },
    {
      "title": "Great identification tools and easy to master",
      "text": "Golden Field Guide, I carry several, Trees, Birds, Butterflies,Tracks and Reptiles. Great identification tools and easy to master. You can carry several due to size in you day pack. Reasonably priced for quick knowledge.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "Information in text is good.",
      "text": "It is okay but the illustrations are way too small to see details of cones and needles on my Kindle Fire. Cone details are important for identifying conifers. Range map is extremely small and hard to read. Information in text is good.",
      "rating": 3.0,
      "verified": true,
      "author": "William G. Ypsilantis",
      "helpful_votes": 0,
      "publication_date": 20141225
    },
    {
      "title": "It's trees and leaves....",
      "text": "My 4 year old is obsessed with trees and leaves. She's gonna be amazed when I show it to her.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Fetterly",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "Very helpful guide",
      "text": "I do a lot work with trees and shrubs so it is very important for me to know what species I'm looking at. This book makes it so much easier for me to identify the trees that i,m treating. Most of the stuff in this book is more for beginners in the tree world but it still worth having in my collection.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 0,
      "publication_date": 20131227
    },
    {
      "title": "NO Good.",
      "text": "I was disappointed in this book. I'll start with the good, though. It had a nice explanation of the tree traits and what to look for when you are identifying trees. It's also small and easy to carry. There's the good. The bad is that all the pictures were drawn. Now, before you buy the book, it does state that the book does not have a complete list of all the trees found in the USA. That said, the three trees in my hood that I wanted to identify, were not in there. I'm going to buy a more complete guide to find these trees.",
      "rating": 2.0,
      "verified": true,
      "author": "Rafael C. Vega",
      "helpful_votes": 13,
      "publication_date": 20070716
    },
    {
      "title": "the book is perfect as a first guide for an eleven year old ...",
      "text": "Actually, the book is perfect as a first guide for an eleven year old boy.",
      "rating": 4.0,
      "verified": true,
      "author": "Jane L Anderson",
      "helpful_votes": 0,
      "publication_date": 20140703
    },
    {
      "title": "No mention whatsoever of Poison Ivy. Not a tree ...",
      "text": "No mention whatsoever of Poison Ivy. Not a tree, true. But there are several non-trees mentioned and described in this book. I would think Poison Ivy would be one of the very first plants anyone spending time in the outdoors would want to learn to identify.",
      "rating": 3.0,
      "verified": true,
      "author": "Bubba",
      "helpful_votes": 2,
      "publication_date": 20150612
    },
    {
      "title": "The Great Book Trees of North America",
      "text": "Hello to Amazon ,Book Trees of North America Arrived in Exellent Shape at 12:04 Pm on 4/11/2019 ,Scott Just started to explore the First section of this Great Book and Is amazed at the In Depth look of types of trees in this part of the Country. It is worth a the Having a Copy of this Book and will Enjoy it For Years to come ,Enjoy From Scott J .",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Joyce",
      "helpful_votes": 2,
      "publication_date": 20190417
    },
    {
      "title": "As easy as it gets",
      "text": "Lots of color pictures to help you identify with ease. The fruit/cones/leaves/bark are shown which help make certain you've got the right one. The beginning even has an introduction to trees so that you get the hang of the jargon.",
      "rating": 5.0,
      "verified": true,
      "author": "Devin Lattimore",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Filled with details",
      "text": "This was a great book to read and it was full of details and descriptions. Not necessarily an easy reading level, but easy enough to interpret. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Abby",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Fairly good pictures and descriptions",
      "text": "I seem to always be loosing my books on trees. So it was good to get another one that is pretty simple and informative. Looking forward to reading it more.",
      "rating": 4.0,
      "verified": true,
      "author": "Renney",
      "helpful_votes": 0,
      "publication_date": 20140220
    },
    {
      "title": "Had to have, my pup destroyed my old copy ...",
      "text": "Had to have, my pup destroyed my old copy sniffing out the dried selected leaves I had placed from trees I haD INSIDE FRPM M,Y PRO[PERTY",
      "rating": 5.0,
      "verified": true,
      "author": "Allen J Fine",
      "helpful_votes": 0,
      "publication_date": 20171217
    }
  ],
  "product_meta": {
    "title": "Trees of North America: A Guide to Field Identification, Revised and Updated (Golden Field Guide from St. Martin's Press)",
    "rating": 4.6,
    "specifications": {
      "Item Weight": "10.1 ounces",
      "Paperback": "280 pages",
      "ISBN-10": "1582380929",
      "ISBN-13": "978-1582380926",
      "Product Dimensions": "4.51 x 0.5 x 7.55 inches",
      "Publisher": "Golden Guides from St. Martin's Press; Revised, Updated Edition (April 14, 2001)",
      "Language:": "English",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Biological Sciences",
      "Books",
      "Science & Math"
    ],
    "price": ""
  }
}