{
  "website_summaries": [
    {
      "verdict": "Well-designed layout is best for quick reference on a variety of training topics.",
      "pros": [
        "Layout is designed for quick and easy reference",
        "Covers a range of topics, from grooming to socializing to correcting bad behaviors",
        "There are a number of helpful YouTube videos designed to accompany the book as well",
        "All suggested training techniques are positive and humane"
      ],
      "cons": [
        "Book provides mostly helpful tips but lacks fully detailed instructions"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good but title misleading",
      "text": "I loved his videos and as this had \"training\" in the title I thought it was a book on training. The problem is that much of the book is how to pick a dog, how to introduce a dog to the family, etc. Lots of stuff like feeding, etc vet, etc. So the portion of the book that's useful to me is relatively small. Even the training focuses heavily on house training. Still valuable and his videos are terrific. I had just hoped that the leash, jumping.etc. things addressed in the videos would be in more depth in the book.",
      "rating": 3.0,
      "verified": true,
      "author": "annie",
      "helpful_votes": 323,
      "publication_date": 20170528
    },
    {
      "title": "Best book for first time owners or experienced owners",
      "text": "This is the first book I would recommend to someone thinking about getting a dog! It covers all of the territory - sort of a \"What to Expect When You're Expecting\" but for your new puppy or dog. I wish I had it when I got our dog...and then our cat!",
      "rating": 5.0,
      "verified": true,
      "author": "carolyn north",
      "helpful_votes": 49,
      "publication_date": 20160608
    },
    {
      "title": "YOU MUST GET THIS BOOK!",
      "text": "I've come across a lot of dog training books, but this one is the best one I've ever read! It's so comprehensive...it really covers everything you need to know, even health issues and socialization and grooming and tricks and traveling. It is also so clear and easy to follow...lots of bullet points and Q&As. Zak George is one of a kind, and this book includes all the best from his videos. I HIGHLY recommend this book to anyone with a dog. It's really an excellent guide. I can't say enough good things about it! Just order it...you won't be disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "Rocket Jones",
      "helpful_votes": 70,
      "publication_date": 20160607
    },
    {
      "title": "Most-have for dog owners",
      "text": "I really like Zak George and his methods. When I was preparing for my first ever puppy (and first dog at all in 15 years) I watched every video of his and Simpawtico's on YouTube, and read this book from cover to cover. Zak also has a free 30-day perfect pup class on Pupford that I followed. My puppy is so happy and well behaved and listens so well, she's making such good progress and I can tell she's going to be an amazing, well adjusted dog. Everyone looking to improve their dog's behavior or prepare for puppy should read this book. It will make a big different in your and your dog's life.",
      "rating": 5.0,
      "verified": true,
      "author": "Eden",
      "helpful_votes": 5,
      "publication_date": 20181225
    },
    {
      "title": "Good book, but if you follow him on youtube, the book is kind of pointless.",
      "text": "Zak George's youtube channel is excellent. I really feel like he kinda defeats the purpose for this book by making his channel so good though. Most of the pages in this book follow a pretty standard formula. \"Hey, here's the thing you're trying to teach your dog. Here are a few tips, and I go into a bit of detail, and if you want some more information on the topic, go to my youtube channel and watch the video titled X\" Don't get me wrong, this isn't a bad training book by any means, but as someone that started as a fan of the author's youtube channel, the book just feels sort of redundant.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Schultz",
      "helpful_votes": 6,
      "publication_date": 20180326
    },
    {
      "title": "Nice but lean on instruction.",
      "text": "This is a nice book written by a kind person. There are tips in here, but nothing really fantastically instructive that I could point to as definitive instructions for teaching your dog. Heavy on the philosophy, lean on the instruction for your dog.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicoletta",
      "helpful_votes": 9,
      "publication_date": 20170812
    },
    {
      "title": "not the best book on the market.",
      "text": "Though his ideas on new puppies and dogs of a perfect world are sound it does not deal with the problem dogs . I agree abuse is never the answer but neither is rewards your way to success. Dogs have to know who the alpha is without that they will not respect the owner. There are much better books out there.",
      "rating": 2.0,
      "verified": true,
      "author": "Chet",
      "helpful_votes": 3,
      "publication_date": 20191031
    },
    {
      "title": "This is a fine guide to positive reinforcement training for dogs of any ...",
      "text": "This is a fine guide to positive reinforcement training for dogs of any age. Zak George is clear and encouraging in his explanations and directions. Couple this book with his Youtube video demos and you have a personal training experience that is extremely helpful! I heartily recommend this book as it helped me with training my two rescue dogs, both about 2 years old when adopted.",
      "rating": 5.0,
      "verified": true,
      "author": "sdjam",
      "helpful_votes": 7,
      "publication_date": 20160806
    },
    {
      "title": "A great book for the impatient reader like me!",
      "text": "I really appreciate how this book is written! I sometimes become impatient with non-fiction books written with the purpose of teaching something, because I feel like the author can get to the point much more quickly than they do. That’s not the case with this book! It’s simple and to-the-point, organized in bite-sized chunks with a brief heading summarizing the subject of each paragraph or chapter. You can skip around easily if you have a question about something very specific. The vocabulary is also perfect for all ages, my 12-year-old reads it too. I’m 100% satisfied with my purchase and feel ready to train my new puppy.",
      "rating": 5.0,
      "verified": true,
      "author": "Trevor Marron",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Not for me",
      "text": "Waste of time, no real lessons for training your dog. Every page is the same... dog does this, give her a treat.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 8,
      "publication_date": 20180717
    },
    {
      "title": "Thanks for nothing.",
      "text": "I've had dogs my whole life. I purchased this book to expand our knowledge about dog training. Most of the things covered I could have wrote a book about. Complete rubbish..",
      "rating": 1.0,
      "verified": true,
      "author": "Skoalbandit",
      "helpful_votes": 3,
      "publication_date": 20191223
    },
    {
      "title": "Fantastic",
      "text": "We already have a dog (a rescue pit) who was a year old and house trained when we got him, but upon getting a companion pup, we REALLY appreciated how the book is segmented so we could skip some of the stuff we already knew to focus on the areas like socializing that are new to us. In hindsight, I really wish I’d had this book for our first dog. We would have made different decisions with socializing him with our cat, discipline, etc. Overall, this book is really fantastic and I would recommend it to both first time dog parents and for those who already own dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "Betty",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Zak George is Fantastic!",
      "text": "Please check out this book! I have been working with my fearful/reactive doxi mix for sometime now and his methods really work and have improved our connection tremendously. It will take consistency and patience but is totally worth it. The best thing I have learned is that the skills we are working on will take months to perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Kitcat",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Yes redundant with the videos, but still good to have!",
      "text": "I’ve been watching his YouTube videos and decided to get the book. As many reviewers have said, the book is redundant with his videos with the exception of a few factoids and research references. That said, I still think it’s useful to have a physical copy if you don’t mind spending the few bucks this costs. it’s great to reference as a guide on hand (that’s why I opted for the physical copy). Overall, happy to have come across his YouTube!",
      "rating": 4.0,
      "verified": true,
      "author": "jojo",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Good Reference",
      "text": "This is a good supplement book to reference when you have a puppy. My primary source of information is our puppy trainer and she is great but I don't want to call her for every small thing. This book helps to calm my nerves and it has prepared me for future behavioral issues. I would highly recommend a book like this which uses the same incentive/no spanking approach as our AKC certified trainer.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyahn",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Wonderful! Evidence based training methods, videos to support the book, easy to implement!",
      "text": "Love this book! I love how organized it is and how it covers topics from before you even pick out your dog to raising and training it. It's great that there are videos to compliment various topics. I love all of Zak George's videos as well. It's wonderful that he uses evidence based techniques instead of just using traditional techniques without any science backing them up. So far everything is going great with my puppy! Controlling the environment means nothing has been chewed up that wasn't hers, and she hasn't had any accidents in the house. She's learning commands quickly, and best of all, we've developed a wonderful bond!",
      "rating": 5.0,
      "verified": true,
      "author": "Katy Alexis",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Do yourself a favor and buy it.",
      "text": "Great book. If your new to dog ownership or just want to train your dog correctly this will help. I tell everyone it's worth it. He is a great trainer and explains well how to get lasting results. Really explains how to properly train without old negative views. I never understood why people would do things that make their dogs not trust them. It may have been a little quicker but you get a lasting trust and reliable results when you don't shock or yell at your dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve D",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Badly organized material, but great trainer",
      "text": "I bought the book because I loved Zak's videos. The book is really hard to use, not well organized, not easy to find things. You have to read it front-to-back, then you can't find specific parts that you need for problems you're having now after reading it. We've found it easier to go to the videos. It's great information, truly good training methods, just not helpful in book format unless you have a lot of time to flip through after reading later to find what you need.",
      "rating": 3.0,
      "verified": true,
      "author": "F.Faulkner",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Three Stars",
      "text": "You can get the same information on his YouTube channel with visualization",
      "rating": 3.0,
      "verified": true,
      "author": "Shop2Udrop",
      "helpful_votes": 13,
      "publication_date": 20160913
    },
    {
      "title": "Not much value.",
      "text": "Everything in this book is covered by his free YouTube videos. I bought the book hoping he would go more in depth about certain topics but there isn’t any more substance in the book vs his free YouTube channel.",
      "rating": 2.0,
      "verified": true,
      "author": "AQ",
      "helpful_votes": 4,
      "publication_date": 20180701
    },
    {
      "title": "I recommend this! Great dog training book",
      "text": "This dog training book is superior to the other ones I've read. This one is by far the best. I've tried other well-known training books but this one is solid. It is very logical, with points 1,2,3 and logic and how a method would work. Practical, FULL OF INFORMATION I ACTUALLY NEED, I recommend this book for anyone looking to read on dog training! I also love how Zak makes the relation of how, why and what to feel when the dog behaves negatively, very useful and influential in my dog training methods and attitude.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Great for training a puppy without being harsh",
      "text": "Very easy to read and follow. I have used many of his tips for training my puppy. He responds to the commands and catches on quickly. I believe its because Zak George explains explicitly how you should teach a trick. If you are still struggling with a trick or command go to his YouTube page and it is wonderful. I have watched several hours of his videos.",
      "rating": 5.0,
      "verified": true,
      "author": "Teri",
      "helpful_votes": 2,
      "publication_date": 20161122
    },
    {
      "title": "The Ultimate Puppy Owner's Manual",
      "text": "All around great book for new dog owners, whether or not they are experienced. I am a dog trainer and this book provides A LOT of great info for me to share with my clients (as well as copies of the book)! I love that I can go to and recommend Zac George's YouTube channel to reinforce the ideas in this book! His philosophy of dog training and mine are completely aligned!",
      "rating": 5.0,
      "verified": true,
      "author": "Alli",
      "helpful_votes": 0,
      "publication_date": 20170806
    },
    {
      "title": "Without Zak, I'd still be clueless on how to properly train my dog!",
      "text": "I was hesitant to purchase a training book for my new puppy, more so because I thought I needed a professional trainer to train my puppy (if I really wanted him to learn and listen), but Zak's guide completely changed my perspective. Using Zak's positive training methods, I was able to teach my puppy simple skills like, shake, bark, and quiet in only a few minutes; most skills have coinciding video lessons available on his website. For someone completely clueless to the dog training world, this book helped me develop a positive and trusting relationship with my puppy, and I highly recommend it for beginners.",
      "rating": 5.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Dog Training Not But A Things You Should Really Know",
      "text": "Don't get me wrong the book is good if you've never had a dog/puppy. However I was looking for something a little more advanced (more technical) training. He has his philosophy of the world and thats really what this book is about. Its a bit misleading to call the book Dog Training though. I hope he writes more in depth books his videos are great!",
      "rating": 3.0,
      "verified": true,
      "author": "PDJ",
      "helpful_votes": 11,
      "publication_date": 20170515
    },
    {
      "title": "This trainer is great. I had subscribed to his YouTube channel",
      "text": "This trainer is great. I had subscribed to his YouTube channel, and when he announced that this book was coming out I preordered. Not disppointed. His training techniques are how I like to train and this book takes you through with a lot of insights from his extensive experience. Perfect for someone who is just starting to train, or an experienced trainer. Also, I recommend that you get prior to getting your puppy. He takes you through picking the right pup as well so that you start off prepared to train your perfect pet.",
      "rating": 5.0,
      "verified": true,
      "author": "mel",
      "helpful_votes": 4,
      "publication_date": 20160812
    },
    {
      "title": "good book",
      "text": "It's good for the very basics, if you want a really good heal, not so much. this will get you and your dog on a \"loose leash\" walk. The videos on youtube help as our read the book. overall a positive learning experience.",
      "rating": 4.0,
      "verified": true,
      "author": "Tucsonian",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "A Must-Have for New Puppy Parents!",
      "text": "Great advice and training style! All of his recommended trainings have worked really well with our 7 month old border collie/lab mix. It's great to have his videos, too, for when you need to see exactly how he does something. We are all about positive reinforcement training and it really does work! Now, to only find more hours in the day to get all our training time in! This book and his videos have truly been a life-saver for us first-time puppy parents!",
      "rating": 5.0,
      "verified": true,
      "author": "merryd23",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Simply the best dog training book",
      "text": "It gives you step by step instructions on how to teach your dog things and fix some bad behaviors. A refreshing break from dog books that are all theory and stories. Zak's advice is easy to implement quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake Dermer",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "I love that he is all about positive reinforcement",
      "text": "Less than one week with this book and our 12 week old chihuahua is already sitting, staying and starting to learn to roll over. The hardest part was teaching him to read first. Just kidding. Really though, this guys really knows dogs. I love that he is all about positive reinforcement, not yelling or physical punishment. The book is enjoyable, easy to read and has AWESOME accompanying videos. Cannot reccomend enough!!",
      "rating": 5.0,
      "verified": true,
      "author": "Joey",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "The best training for owners AND doggies!",
      "text": "In preparation of getting a new puppy, I was devouring information I found online... But some of the information seemed outdated and I didn't really agree with all of it -- especially in regards to dominating your dog, or disciplining him/her. I found Zak on YouTube, and in one session I had watched at least 10 of his videos! This book covers all questions I had as a first-time dog owner, and Zak's approach is gentle yet effective. I felt prepared to welcome my puppy into the home, and although I've had him for less than a week he's already learning good behaviors! I think this book (and Zak's YouTube channel) should be required for all new doggy owners.",
      "rating": 5.0,
      "verified": true,
      "author": "JL1231",
      "helpful_votes": 0,
      "publication_date": 20170401
    },
    {
      "title": "Zak George knows his stuff!",
      "text": "Amazing training tips that helped us train our boxer puppy. Positive reinforcement works! 🥰🥰🥰 We follow Zak George on all his social media platforms also. He knows his stuff! We can't express enough how helpful having access to his training knowledge has been for us. I highly recommend this book.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott E. Nurczyk",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Excellent Resource For Any Dog Parent",
      "text": "Just received the book last week and have already learned so much! My puppy has as well. There were a few things I didn't realize I was doing wrong, but have corrected and my dog seems happier, which makes me happier too. The author also writes the book well - isn't boring to read and he bolds the headers and important info. The back of the book also has an index for quick reference, which has come in handy. Buy this book; the author truly knows what he's talking about!",
      "rating": 5.0,
      "verified": true,
      "author": "Mazzle32",
      "helpful_votes": 2,
      "publication_date": 20161126
    },
    {
      "title": "Might As Well Just Watch YouTube",
      "text": "Bought this book to support Zak after the countless YouTube videos of his that I watched in preparation for a new puppy. However, most of this book just tells you to watch his YouTube videos, while his YouTube videos tell you to read the book. I found more information in the videos, though, plus he demonstrates what he's talking about. I felt a little let down by the lack of extra information in the book.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Great positive reinforcement training guide",
      "text": "The lessons in this book are short and easy to follow. It is so helpful in supplement to the YouTube videos. My Aussie puppy is taking to the training tips well. She is 8 weeks and we have had her for 6 days. She voluntarily goes into her kennel and sleeps in it every night, she knows sit, down, and is getting the hang of drop it and leave it. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Sierra117",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Zak George is a genius",
      "text": "This book is incredible. I brought home my 7 week old puppy a few weeks ago and prior to buying this book felt COMPLETELY unprepared. This book helped me make sure that I had everything I needed to be able to take care of her right away. It also helped me set expectations for myself and for my dog, as well as figure out appropriate ways and timelines to train specific behaviors like potty training and leash walking. A must-buy book for first time dog and veteran owners alike.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellie",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "A Must Read!",
      "text": "Over the past thirty years, I must have read over a dozen books on dog training by all the “experts.” But Zak George turns conventional dog training on its ear, dispels long-held myths, and teaches dog behavior and training in a modern, easy to read, easy to apply manner. If there is only one book you read about dog training, this should be it!",
      "rating": 5.0,
      "verified": true,
      "author": "The Novelist's Corner",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Worst Dog Training Book EVER!",
      "text": "Made no sense. Not sure why it's so highly rated. Caesar Milan's audio book is way better. This is everything NOT to do with your dog.",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan Strader",
      "helpful_votes": 5,
      "publication_date": 20190220
    },
    {
      "title": "This is the only way to train your dog!",
      "text": "I can’t believe how easy Zak makes training! Within a few weeks of having my new puppy follow commands, she sits, speaks, plays dead, rolls over, crawls, comes, “dances” lays down, and it was easier than I though! Zak’s instructions are so clear and the videos make it a no brainer!! With a little bit of orients, rewards, and this book, you’ll have a performing pup in no time!!",
      "rating": 5.0,
      "verified": true,
      "author": "Annie L.",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "This is the book to buy!",
      "text": "Easy to read, engaging. I bought this as well as the Cesar Milan book, How to Raise The Perfect Dog. I definitely like Zak George's book more, as it really emphasized the relationship with your dog and how you communicate with one another. While I think a learn a bit from both books, Zak George has a more down to earth, practical, and loving style.",
      "rating": 5.0,
      "verified": true,
      "author": "PediatricianMom",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Great book - my go-to reference",
      "text": "Amazing book! Answers most of the common questions new pet parents would have. This book has been my go-to reference to get our puppy trained and I cannot thank Zak enough for writing this book and his Youtube videos which have been greatly helpful. Even if you are considering getting a dog/puppy but are not sure if it the right decision for you, this book would be a great place to start just to understand all that is involved in the process and helps you prepare in the best way possible for getting a dog/puppy.",
      "rating": 5.0,
      "verified": true,
      "author": "zed",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Good information for the first time pet owner",
      "text": "Good information for the first time pet owner. Information was well thought out and presented equally as well. The author produces high quality content on You Tube basically covering the book, making it an effective and entertaining training package.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "This Guy KNOWS Dogs!",
      "text": "We found Zak on YouTube and are SO glad we did. After watching more than a dozen of his videos I purchased this book, as we are adopting a puppy. Like many people who have reviewed this book stated (or wished if they hadn't done so) we got the book \"pre-puppy\" and it has some very valuable advise. I'd highly recommend this book. Zak seems to understand the best way to lovingly train a dog!",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy B.",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "You need to know this if you own a dog.",
      "text": "Many people do not realize how the attitude of how to train animals has changed over the last fifty years. Almost all of the training methods I grew up with in the 50's-60's are detrimental to your relationship with your pet. Luckily you can \"teach an old dog new tricks\" and the current understanding of pet abilities and training will create a better bond between you and your pet.",
      "rating": 5.0,
      "verified": true,
      "author": "Rapid Transit",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "The Best Dog Book!",
      "text": "I'm getting a puppy in a few weeks, and this book was so helpful!! Totally recomend this book! I like that he has a YouTube channel also. I've started watching his videos, and they'rereally good too! :D",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Reader",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Good clear advice, buy this book!",
      "text": "This is a very enjoyable book to read. I also watch Zak's videos on UTube. As a first time dog owner, I am soaking up all the knowledge, methods & advice. Rocky, our two year old Rotti/Lab mix was a rescue dog. I feel blessed every day, that he came into our lives just two months ago. As an avid reader minus a dog, the \"alpha\" wolf concept, etc. never really made sense. Zak's little book is chock full of sensible & clear advice. I certainly feel smarter after using some of the methodology with my brilliant Rocky who is a very receptive & clever boy. Buy this book, well worth the reasonable price!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelela",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "SMALL PRINT",
      "text": "The print is extremely small and quality is bad. I’m sure the content is great but I cannot see it.",
      "rating": 1.0,
      "verified": true,
      "author": "VMOSKWA",
      "helpful_votes": 3,
      "publication_date": 20190321
    },
    {
      "title": "Zak George delivers simple, thoughtful, effective advice on training",
      "text": "What I like most about Zak George's approach to training dogs is that he trains the dog trainer too. I went from a novice with no experience handling a new puppy, convinced I was going to confuse the heck out of my mini-Aussie, to a confident trainer and pet parent. Better still, because I've embraced his positive rewards based training, my 10-month old puppy loves our training sessions, and members of our local dog club comment repeatedly on how happy and well-behaved she is.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Gallagher",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "He gets to the point",
      "text": "Honesty, caring, and truly it was a pleasure to not only read but, he clears up so many myths, I love that, many times you hope the person giving you information is correct. He is. I truly believe dogs and children are the most misunderstood . I would recommend his book to everyone. We have a 4month old golden retriever. He is benefiting as well.",
      "rating": 5.0,
      "verified": true,
      "author": "a mom",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Like everything else there is a spectrum when it comes ...",
      "text": "Like everything else there is a spectrum when it comes to dog training ideology. On one end there is treat only training while on the other end there is punishment only training. I think the answer is somewhere in the middle. Occasional treating interspersed with body language, firm but not angry tone and boundaries but without any pain based punishment. So this book is very useful in how to achieve the treat portion of that but I would recommend looking into other concepts as well taking from them only the pieces that make sense for you and your dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Cypress",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "AMAZING book",
      "text": "I don't often review things, but I really liked this book and even though it only teaches basics that my dog knows, and it's mostly for puppies. It really helped me understand how to train my dog and how to be patient and how to be understanding of a dog. So even if your dog is an older dog I think reading this book will help you understand not only your dog better but how to train him/her better. I haven't read his second book but I've already ordered it so I'll also review that one! 100/10 would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidy",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Best Dog Training Manual",
      "text": "We love this book! When I ordered it we only had our 1.5-year-old Pit mix, Jasper. We adopted him about 10 months ago and have been working on his training with help from Zak's videos on YouTube. Right after the book arrived and I'd begun reading about introducing a new dog to the mix, we adopted our 9-month-old Pit mix, Ruby. What we've learned has been so helpful! House training, introduction to the family, basic commands - they've learned it all easily and I'm positive it's because we understood it so clearly from this book.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 6,
      "publication_date": 20160716
    },
    {
      "title": "Dog TrainingRevolution",
      "text": "Book is excellent but print is so small it is illegible without a magnifying glass , at least for my old eyes, so was forced to spend another $15 & order kindle edition. Can't carry it with me but love the larger type, can read it and now give the book 5 stars. Love the ability to look at on-line companion videos.",
      "rating": 4.0,
      "verified": true,
      "author": "Captain Nemo",
      "helpful_votes": 3,
      "publication_date": 20160729
    },
    {
      "title": "Saw Zak George's helpful videos and decided I needed quick and easy help to get started",
      "text": "Just got my first puppy. Saw Zak George's helpful videos and decided I needed quick and easy help to get started. Sadly, I got some out-of-date books from the library, that were based on domination and \"dogs are like wolves\" theories. Zak George is up to date and his theories are actually fun for me and my dog. The Dog Training Revolution is based on that dogs are bred to be smart and domesticated. I am reading his book nightly to keep up with my 4-month-old rescue who is super smart and high energy. So glad I bought this book for a better start for our life together.",
      "rating": 5.0,
      "verified": true,
      "author": "TBK3000",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Great training book!",
      "text": "This book has a lot of great tips that I would have thought of! I thought I did a pretty good job training my previous dog. There are few tools and ideas in this book I wish I had don’t with her to make training easier. She crossed the rainbow bridge and I will be getting a new puppy soon. This book has given me great suggestions to help train the perfect pup!",
      "rating": 5.0,
      "verified": true,
      "author": "Janine Maggiolino",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Best Dog Training Guide: Become the best friend your dog needs!",
      "text": "Zak is clear and gives very complete guides for us humans to make the best relationship with our dogs. I watched his videos on YouTube for awhile first, then got this book as a guide to have on-hand and it does not disappoint! If you own a dog, or are about to own a dog or puppy, DO NOT PASS UP THIS BOOK.",
      "rating": 5.0,
      "verified": true,
      "author": "LMH",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Not a lot to do with training",
      "text": "I’m returning it. As previous reviewers stated it only has about 10 pages that are training related. The rest is about choosing the right puppy, how to prepare etc. it’s not worth the $10 to me",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20180409
    },
    {
      "title": "Training Becomes Fun",
      "text": "I found the book to be a thorough explanation on the responsible ownership of a dog. My prior \"training\" experiences were years ago, offered by the local parks and recreation, and based on choke collars. I always loved dogs but disliked behavior modification, conditioning, through intimidation. George's training methods were an eye opener. Training becomes fun and once you understand the fundamentals straightforward.",
      "rating": 5.0,
      "verified": true,
      "author": "Bert Kleinkauf",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "J",
      "text": "This trainer is spot on. He explains his training in a very simple to understand process. My dog has responded very positively to the few commands I have been training him on. I will update my review in a few weeks.",
      "rating": 5.0,
      "verified": true,
      "author": "webvidman",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Defective book",
      "text": "I received the book today and was so excited to dive in and start reading it! As I was fanning through the pages, it stopped on page 175-178 because they pages were torn and folded up. I unfolded the pages and the pages were longer then the others. They stuck out past the rest of the book! So I can only give it 3 ⭐️‘S",
      "rating": 3.0,
      "verified": true,
      "author": "Suz",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Great information on training puppy with love",
      "text": "I have raised 4 dogs but wanted a refresher course for working with my new puppy. I wish I had this book for my other dogs. They were all wonderful but they were Zak's methods are gentler and more effective. The book is a great companion to his wonderful You Tube videos",
      "rating": 5.0,
      "verified": true,
      "author": "dragmorian mom",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Helpful guidance",
      "text": "We’ve raised 3 dogs in the past. They were all adult rescues. But this time around we opted to get a puppy. I feel as though this book has good, practical advice on the use of positive reinforcement training methods. I hope that I will be able to say in 1 year that even 50% of the advice was sound.",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Easy to follow, great positive training lessons",
      "text": "Great book. Answers so many common questions and was very easy to follow. Absolutely love that it links together with his online youtube videos and the positive attitude he puts into everything really helps with training and also keeping a positive outlook myself on even the toughest puppy training moments.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Kane",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Only Buy if you have never owned a dog in your life",
      "text": "Disappointed. Zak George’s show is great! I really like him but this book is soooooooo basic! Common sense dummed down. Im shocked he even wrote it. If you have never owned a dog as a kid, or at all, and do t feel equipped in the common sense dept, this is your book.",
      "rating": 1.0,
      "verified": true,
      "author": "Xavions Mum",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Great concise book, very helpful!",
      "text": "I really liked the format of this book. It’s easily digestible, no too long winded. The video links are also helpful. I highly recommend this book and ZG’s videos. My puppy has responded so well to positive reinforcement training. I got this as a review to my previous work with trainers and to help get my daughter and sitter get on the same page!",
      "rating": 5.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "I highly recommend this book and his videos",
      "text": "I love to read fiction, but always struggle with non-fiction. Not the case with Zak's book. It is an easy, very informative read that I can't put down. I am getting a new puppy and stumbled across Zak's YouTube channel when looking for training tips. He posts a ton of videos for free. I love his gentle approach to dog training, and his guidance to establish a bond, not dominance, with your dog. Because of his videos, I purchased his book and it is wonderful. There is so much to learn, and he covers it all. I highly recommend his book and seeking out his videos on YouTube!",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Great book for new dog owners!",
      "text": "Loved this book! Includes lots of great tips and information for new dog owners! I loved it, and recommend it to anyone who’s getting a dog for the first time! Even if you’ve had a dog before, it can be helpful - but this book is definitely intended for those who’re new to raising dogs. Plus, the YouTube videos are incredibly helpful to watch along with each chapter!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Great help understanding dogs and how to train certain types",
      "text": "I loved this guys approach to training in his YouTube videos. Utilizing his methods I have been able to train many shelter dogs in the basics, improving their chances of adoption. The methods in his videos and this book translated in training therapy and service dogs which I do for hero dogs. Using their methods in conjunction with the methods in this book have gotten great, fast and lasting results.",
      "rating": 5.0,
      "verified": true,
      "author": "Pitt Enterprises",
      "helpful_votes": 3,
      "publication_date": 20160622
    },
    {
      "title": "The program has worked well for our puppy.",
      "text": "You get the same info from watching his videos. The program has worked well for our puppy.",
      "rating": 4.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 2,
      "publication_date": 20170829
    },
    {
      "title": "Great!",
      "text": "I read this before getting my puppy and felt so much more prepared. His positive approach to training made me much more comfortable than the \"alpha\" methods and I'm looking forward to implementing everything I learned!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "I watch a lot of his YouTube videos and read ...",
      "text": "I watch a lot of his YouTube videos and read reviews saying this goes into more detail and covers more than videos. Should’ve just stuck with the free videos... the book doesn’t add any value.",
      "rating": 2.0,
      "verified": true,
      "author": "Stacey B.",
      "helpful_votes": 3,
      "publication_date": 20180905
    },
    {
      "title": "Informative, easy read.",
      "text": "Working to train our 8 month-old rescue puppy and needed some advise. This book gives you ways to positively train without using NO all the time. Plus there are links to his YouTube channel to know when there is a video that will help go along with the book. Includes a section on common problems and solutions.",
      "rating": 5.0,
      "verified": true,
      "author": "Tasha",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Excellent positive training book!",
      "text": "Excellent book and excellent videos! It is so good to see positive trainers getting more attention. I am ashamed to say I only used choke chains or metal/plastic prong collars on my previous dogs. I have gotten rid of those and now walk my giant breed Leonbergers using the PetSafe Easy Walk harness and the Rok Srap leash. Zak's book is very foundational, so after you finish it, then read When Pigs Fly by Jane Killion, for a more in-depth understanding of positive training.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamie",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Great way to enjoy your dog and train them",
      "text": "I really love this trainer and his methods. He does teach how to correct and stop some bad behavior. But his overall method is very fun loving and for you to bond with your furry baby. This book has lots of details and is great for any dog owner. This book has videos to help you visually learn and he has a YouTube all sharing the full puppy experience with inertia.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Buchanan",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Zak is a great guy. His book is very",
      "text": "Zak is a great guy. His book is very, very good. But training a dog is hard! Be patient when training your dog. If you are looking for getting a dog, this book will guide you on the process. It tells you everything you need to know about dogs, their necessities and what to expect from them.",
      "rating": 5.0,
      "verified": true,
      "author": "Federico",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "This is just plain fantastic. We get SOOOOO many compliments on our pitbulls ...",
      "text": "This is just plain fantastic. We get SOOOOO many compliments on our pitbulls behavior. She is only 6 months old. We were armed with Zak's book before we bought our pup and his teaching is sound and productive! Get the book...you won't be sorry. It's all you need for training.",
      "rating": 5.0,
      "verified": true,
      "author": "liareitz",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Knew we would be getting a (big dog) puppy but ...",
      "text": "Knew we would be getting a (big dog) puppy but he came a little sooner than we anticipated. Zac George’s training techniques helped us not only survivor, but thrive, with our new puppy. We have used the book, along with his YouTube videos. We have had many compliments on how well he behaves as a 4 month old puppy.",
      "rating": 5.0,
      "verified": true,
      "author": "Fish Review",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "This book is very helpful.",
      "text": "I am looking at getting a dog and thought I should read up on training and tricks before getting one. This book is very helpful. It helps you decide if your even ready for a dog. Also all the training tips and how too's are symple and easy to do. It also talks about health and welness for your dog. If your thinking of getting a dog or just need a refresh on some training options, this book is for you!",
      "rating": 5.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Wish there was more",
      "text": "This book was great, but I felt that it didn't go nearly into the depth that I was hoping. Only a few basic tricks were mentioned, and I thought there were not enough specifics for dealing with problem behaviors. That said, I think Zak George is a great dog trainer, and this book will almost certainly come in handy as I raise my new puppy.",
      "rating": 4.0,
      "verified": true,
      "author": "Meredith",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "This man knows what he’s talking about!",
      "text": "Extremely helpful guide with easy to understand techniques and very useful tips to get you prepped before you pick your perfect pup and walk you through the rest of the path. This book has been a life saver for me and I so deeply wish I had discovered it with my first pup. Though I love and miss her TERRIBLY and she was a wonderful dog, the first puppy year was absolutely awful because I wasn’t prepped or educated. This book has made this experience a million times easier and actually enjoyable. This man knows what he’s talking about!",
      "rating": 5.0,
      "verified": true,
      "author": "Kaleigh",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "A must have book for dog owners",
      "text": "I have (2) German Shepherd puppies and this book has so many answers. My GSD puppies just finished Basic Obedience Training and learned all the commands in German. I have taught my dogs even more after reading this book and instill use German. Of course, it does hurt that GSD are very intelligent and quick to learn. A must have book if you own dog(s). Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "GSD LOVER",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "Yes! Get this book.",
      "text": "I recommend this book if you really want to engage with your dog and teach him or her to be a well-behaved dog. Zak's approach is down-to-earth and common sense. I love this book so much I ordered one of his other books, \"Guide to a Well-Behaved Dog,\" as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanne Melanson - Animal Bliss",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "He also has great videos on YouTube",
      "text": "Zack uses new science of dog behavior to help you understand dog training. He lets you know what realistic expectations you should consider in selection and training your new dog. He also has great videos on YouTube, check them out! (I am not affiliated in any way to Zack George, just a loyal fan of his work.) Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Reynolds",
      "helpful_votes": 0,
      "publication_date": 20170730
    },
    {
      "title": "A must if you want a happy and trained dog",
      "text": "I read the book before getting our puppy and it set us up to do this right from the get go. And now we have a house trained puppy after only 5 days, he knows how to sit, stay, let go... The book and his you tube videos are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia Jackson",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Not really focused on training",
      "text": "Not so impressed. 80 pages of unnecessary stuff...... this is not my first puppy nor did or do I need help in choosing a puppy. Just wanted to know how to make sit, stand, beg, etc. Good info in book if you are looking for that. I simply wanted to train my puppy.",
      "rating": 3.0,
      "verified": true,
      "author": "louis",
      "helpful_votes": 10,
      "publication_date": 20171002
    },
    {
      "title": "Puppy love",
      "text": "Just recently purchased a new puppy, so I was looking for a good book to teach me everything I needed to know about the little guy (Australian Shepherd) and how to train him. Picked up this book on a recommendation from a friend and am glad I did! Very detailed of what to do and not to do. Now I recommend it to you.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard G. Knobloch II",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "A great guide to have for new or existing Dog owners.",
      "text": "I am getting a new puppy in a few days, and I started watching training videos months ago. I stumbled upon Zak's videos on YouTube. He is very knowledgable and clearly loves dogs. I thought the book would be a great reference to have with a new dog. The book is easy to understand and he debunks the myths that have plagued dog owners/lovers for years. I would highly recommend this book.",
      "rating": 5.0,
      "verified": true,
      "author": "Donato",
      "helpful_votes": 0,
      "publication_date": 20170214
    },
    {
      "title": "Following on You Tube",
      "text": "I am getting a new puppy in a couple of weeks and I thought it would be fun to follow Zack on video and use the book in conjunction. I have always enjoyed his video lessons. He is very upbeat and good with his own puppy.",
      "rating": 5.0,
      "verified": true,
      "author": "S. King",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Nice to have on top of his YouTube channel",
      "text": "We just got a puppy and read Zac's book right before, along with watching hours of his YouTube videos. His method is pretty simple and seems to work. After a week our 8wks old puppy is already responding consistently to basic commands.",
      "rating": 5.0,
      "verified": true,
      "author": "Mathieu Thouvenin",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Love this book",
      "text": "Love this book! We are getting a new puppy and as someone who has never had a dog in my life I am very nervous and pretty clueless. This book walked through everything, was very easy to understand, follow and read and I feel much better about being prepared. I know I will be refrencing this book often. I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "APierce",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Great Trainer",
      "text": "The book coupled with the online videos make dog training much easier. Zac George gives the necessary information on how to train your dog without intimidation. Makes for a much better relationship between the dog and the owner!",
      "rating": 5.0,
      "verified": true,
      "author": "Tami O",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Scribbled inside",
      "text": "A book full of scribble inside! Thank you no thank you :(",
      "rating": 1.0,
      "verified": true,
      "author": "laelly",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Essential Book for Puppy",
      "text": "I clearly need this book because my puppy already started eating it! It can only improve from there! Lots of great advice. Time for me to put it to use!",
      "rating": 5.0,
      "verified": true,
      "author": "KLS1987",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Great book!",
      "text": "This is a great book! It is well-organized & covers everything! It reads like a good novel. You hate to put it down. I’m going thru it for the 2nd time. It & Zak’s vidéos are all you need!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sjoukje #2",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Easy, fun and relevant training ideas!",
      "text": "I love all the tips and tricks that Zak writes about in his book. Everything is easy to follow and can be implemented by any level of dog owner. My favourite part is that he also has accompanying youtube videos. Great book for new and seasoned dog owners.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Corn",
      "helpful_votes": 0,
      "publication_date": 20160923
    },
    {
      "title": "It is inexpensive and useful.",
      "text": "I'm still working on training. The method used may be great but having one hand and being in a wheelchair really changed the training game as I cannot get as close as I would like, and the one hand should be obvious.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Girard",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Great reading",
      "text": "Enjoyed reading this book. Easy read. I've been using the training principles on our 6m old puppy and he is doing well picking things up.",
      "rating": 5.0,
      "verified": true,
      "author": "Woreo",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Informative Book for New Puppy Owners",
      "text": "Zak is great, I have watched most of his videos on You Tube and put into practice what he teaches. I also bought the book and refer to it often. Zak makes it look so easy (not so easy for me) but I like his methods and my Pomeranian puppy has learned a lot from him :).",
      "rating": 4.0,
      "verified": true,
      "author": "Carolyn A. Natale",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Feel prepared.",
      "text": "Ive watched countless videos on YouTube of ZakGeorge and have always found him easy to understand and informative. I am bringing home a baby girl named Sadie next week, she is mixed breed, Australian Shepherd and poodle. I anticipate her to be a high energy lady and reading this book makes me feel much more prepared to welcome her home and how to develop good communication with her and keep her a content member of the family.",
      "rating": 5.0,
      "verified": true,
      "author": "Candice",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "Great for understanding training",
      "text": "This is the most helpful dog book I have read. It provides easy-to-understand instructions, and also explains the theory behind those instructions. As a result, you're left knowing what to do, and also understanding why you're doing it. Reading this book has given me more confidence in my dog training and that has led to more success. I can't promise that it'll be the same for you, but it's been great for us!",
      "rating": 5.0,
      "verified": true,
      "author": "Samsonian",
      "helpful_votes": 0,
      "publication_date": 20180316
    }
  ],
  "product_meta": {
    "title": "Zak George's Dog Training Revolution: The Complete Guide to Raising the Perfect Pet with Love",
    "rating": 4.6,
    "specifications": {
      "Item Weight": "12 ounces",
      "Paperback": "240 pages",
      "ISBN-10": "1607748916",
      "ISBN-13": "978-1607748915",
      "Product Dimensions": "5.46 x 0.57 x 8.21 inches",
      "Publisher": "Ten Speed Press; 1st Edition (June 7, 2016)",
      "Language:": "English",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Books",
      "Crafts, Hobbies & Home",
      "Pets & Animal Care"
    ],
    "price": ""
  }
}