{
  "website_summaries": [
    {
      "verdict": "A revised edition of a cookbook that has a fan-base of dedicated vegetarians who love the distinctive flavors and wide variety of the recipes inside.",
      "pros": [
        "This popular vegetarian cookbook has been updated and includes new recipes and vegan dishes along with classic favorites",
        "Teaches techniques that bring out exceptional flavors in a variety of recipes, including vegetarian desserts",
        "Comes in a hardcover edition plus is available on Kindle"
      ],
      "cons": [
        "Quite a few of the recipes call for eggs, which won't appeal to strict vegetarians or vegans",
        "If you have the original edition, you may find some of the contents repetitive"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great for the guy who needs more vegetables.",
      "text": "I'm an advanced cook. I know a good cookbook when I peruse one. This is clearly written, requires only a modicum of pantry additions, and results in clean, very good tasting meals. It's also an idea book. Recipes are flexible and don't require strict adherence in order to achieve an outstanding dish. You'll learn new techniques and combinations. I'm not a vegan, I'm simply trying to decrease the amount of red meat I eat and become more versatile with that veggie box that gets delivered every week. Good stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "E. Hayner",
      "helpful_votes": 17,
      "publication_date": 20160225
    },
    {
      "title": "A Great Cookbook AND a Nicely-Done Kindle E-book",
      "text": "I've used this cookbook for a few years in hardback and it is definitely on my list of desert island cookbooks (assuming said island has good kitchen facilities and a variety of produce). I was concerned however that the Kindle version would be tough to use. No worries. There's both a list at the front of the ebook with all the recipes in page sequence, hotlinked to the recipes, and a complete index, hotlinked to the indexed item in the body of the ebook. Nice job. And the lack of illustration is fine... the book is a fairly compact size.",
      "rating": 5.0,
      "verified": true,
      "author": "M. McKay",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Best ever!",
      "text": "Awesome and easy, this really is the best vegetarian cookbook I've ever found! The recipes are clear and generally don't call for exotic ingredients. The best part is that every dish I've made is flavorful, tasty, yummy! The suggestions for side dishes and adjustments to the recipes are great too. I rely on this cookbook regularly since every recipe has been a winner with my family!",
      "rating": 5.0,
      "verified": true,
      "author": "M. J. Casey",
      "helpful_votes": 5,
      "publication_date": 20170615
    },
    {
      "title": "No pictures! So not great for gifting.",
      "text": "This is encyclopedia/dictionary ish, without a single photo in the entire book....and that is why I'm returning it. A cookbook without pictures is not worth publishing.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Talbott",
      "helpful_votes": 2,
      "publication_date": 20191220
    },
    {
      "title": "Great, tasty recipes without any guilt",
      "text": "Great, tasty recipes without any guilt. This has become one of my go-to cookbooks, along with classics like *The Joy of Cooking* and Bittman's *How to Cook Everything.* My family and I use meat sparingly and this book helps me emphasize healthy foods. A big plus: the food is not trendy or fussy, but down-to-earth, real, and satisfying.",
      "rating": 5.0,
      "verified": true,
      "author": "Always Reading",
      "helpful_votes": 7,
      "publication_date": 20160911
    },
    {
      "title": "Binge The Veggies",
      "text": "When middle age forces you to set the ribeyes and head cheese aside (sigh) you can pick up your cookeries and dig into some of the finest vegetarian stylings that will ever dance across your tongue!",
      "rating": 4.0,
      "verified": true,
      "author": "Legamin",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Three Stars",
      "text": "I was hoping for recipes that were a little more common ingredients in my kitchen....not so much.",
      "rating": 3.0,
      "verified": true,
      "author": "Darwin",
      "helpful_votes": 3,
      "publication_date": 20180702
    },
    {
      "title": "Great for a vegetarian who needs to consider how to feed vegans and carnivores as well",
      "text": "I first checked this out at the library but I liked it so much and it had such great stuff I decided too order pretty quickly. I’ve been vegetarian since I was 11, and been cooking for ages my mom (who happens to be vegan) having taught me since I was little. I think what cinched it for me was it’s organization.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "I have the original but I like this newer version since it labels each recipe as ...",
      "text": "I have the original but I like this newer version since it labels each recipe as vegan (or not!). Recipes are excellent but like all Deborah Madison books, not every recipe is outstanding. You have to really test drive a recipe to see if you like it.",
      "rating": 4.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 4,
      "publication_date": 20170915
    },
    {
      "title": "Happy Eating",
      "text": "I bought this book because I was bored with traditional recipes. This book has great recipes that my entire family are enjoying.",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine Graham",
      "helpful_votes": 4,
      "publication_date": 20160923
    },
    {
      "title": "type too small",
      "text": "Very large and hard to hold book. Print on the book is very, very small....goes into too much detail. I wanted meals for breakfast, lunch and dinner for diabetics. not the book for me",
      "rating": 3.0,
      "verified": true,
      "author": "iloveny",
      "helpful_votes": 2,
      "publication_date": 20190326
    },
    {
      "title": "I bought it twice!",
      "text": "I have the original hardcover version. This updated one is better and it's great because I can read it on my fire. My Kindle Fire has become my \"cookbook\" lately. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Kat L",
      "helpful_votes": 2,
      "publication_date": 20170310
    },
    {
      "title": "There is some really good, useful information in this book",
      "text": "I received this as a Christmas gift. There is some really good, useful information in this book. It's fairly comprehensive, but the recipes themselves aren't very inspiring.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180112
    },
    {
      "title": "Incredible value. Highly recommended for anyone.",
      "text": "If you're sick of feeling lethargic after lunch and dinner, or are sick of bland, mediocre salads, get this book. I've only done a handful of recipes so far, but I can tell I will be using this book for a very long time. There are just so many cool recipes in here that everyone will learn more than a few things. I'm not a vegetarian, I just enjoy the health benefits of eating more vegetable-based meals and dishes.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric T. Fricke",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "A go-to in my kitchen and an heirloom quality gift.",
      "text": "I've cooked from the original cookbook for years and recently ordered this as a gift for a young woman moving into her first apartment, to commemorate the months she spent in my kitchen learning to cook and the recipes she loved so much from my cookbook. This is that sort of cookbook...the kind that passes between generations and used consistently. It may not be packed with images, but the writing is terrific and the recipes deliver delicious results for home cooks of every level of skill.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "A valuable vegetarian resource!",
      "text": "This cookbook has an amazing array of vegetarian recipes and is extremely well organized. I am so impressed with it. I'm glad I purchased it.",
      "rating": 5.0,
      "verified": true,
      "author": "Avid Reader",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Top of the Line Vegetarian Cooking",
      "text": "This is a very gourmet, top of the line, classical French influenced, vegetarian cook book. Every recipe I have used is a five star. Deborah Madison is definitely the Julia Child of vegetarian cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "Penny",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Veggie Nice!",
      "text": "An amazing catalogue of every possible vegetarian dish you can dream up. And when you are stuck on what to make you can discover something new to try. Easy to understand and follow instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah J. McCulloch",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "A goto source",
      "text": "Some of the recipes require the user to figure out what she means, but she is a pro and learned from the best here in the BAY Area and created her own landmark restaurants. She has packed a lot of knowledge into this volume.",
      "rating": 5.0,
      "verified": true,
      "author": "Thought Dancer",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Awesome. My new favorite cookbook and I have a ...",
      "text": "Awesome. My new favorite cookbook and I have a lot. Her style and methods are approachable and has helped me progress from cooking by the recipe to understanding the building blocks and ratios of what works in the kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz Russell",
      "helpful_votes": 4,
      "publication_date": 20151005
    },
    {
      "title": "This is an amazing book. If I could only have one vegetarian ...",
      "text": "Wow. This is an amazing book. If I could only have one vegetarian cookbook, I would pick this one. Her advice to pick one type of food you love and master it has been extremely helpful to me, a rather poor cook. Her teaching background shines through. This book has made me a better cook!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 4,
      "publication_date": 20160419
    },
    {
      "title": "Four Stars",
      "text": "I do like this cookbook a lot. Sadly, no pictures.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer Miller",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Nice, but I returned",
      "text": "Nice book, lovely pictures and concept. many many recipes. I did however return it because the vegetables were mostly common sense old fashioned handed down recipes. I could do them without a book.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne Joe",
      "helpful_votes": 3,
      "publication_date": 20150630
    },
    {
      "title": "A fantastic update to a classic",
      "text": "Only one member of our family is a true vegetarian, but the original edition of Madison's book is arguably my most prized cookbook, and the one that gets the most use in our house. This update is wonderful. Madison has added quite a bit to the original. I have yet to try most of the new recipes, but I will do my best to cook my way through them. I have given this book to many people over the years as a gift, and I will continue to do so. Bravo, Deborah Madison, and thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Regina",
      "helpful_votes": 38,
      "publication_date": 20140422
    },
    {
      "title": "Excellent",
      "text": "Excellent. I also got one as a gift for one of my kids.",
      "rating": 5.0,
      "verified": true,
      "author": "A. L. Vernon",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "A must have for vegetarians!!!",
      "text": "I love the 'whys and because' in the introduction of each section of the book. The organisation of the book makes it easy to arrange ingredients. The recipes are a good mix of comfort food and trying something new. I was worried the lack of pictures would make the book hard to get through but I was wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss A Soivimon",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "beautifully done",
      "text": "Beautiful book. The recipes sometimes call for all sorts of ingredients that you might not have but improvising still provides good results. No matter what veggie you found at the farmer's market this book will tell you how to prepare it.",
      "rating": 4.0,
      "verified": true,
      "author": "Banjo",
      "helpful_votes": 4,
      "publication_date": 20140904
    },
    {
      "title": "As good as all the other reviews",
      "text": "Outstanding. As good as all the other reviews. Already tried two recipes and they were simple, clear and delicious!",
      "rating": 5.0,
      "verified": true,
      "author": "ShopperGirl",
      "helpful_votes": 2,
      "publication_date": 20170206
    },
    {
      "title": "Amazing amount of information for anyone interested in simple and good meal planning.",
      "text": "Packed with detail and easy to follow. Not just for vegans but a great basic recipes to add to your meal planning.",
      "rating": 5.0,
      "verified": true,
      "author": "Youngie",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Good cookbook",
      "text": "Bought to try and eat healthier. It's a big book with lots of info and recipes.",
      "rating": 5.0,
      "verified": true,
      "author": "Z",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Dairy is included in way too many recipes for the book to qualify as vegetarian.",
      "text": "I ordered the book because I thought it would be strictly vegetarian. As it turns out, many of the recipes call for dairy. Highly disappointing.",
      "rating": 3.0,
      "verified": true,
      "author": "Roseanna",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "She loved it and uses it all the time",
      "text": "Gave it as a gift. She loved it and uses it all the time!",
      "rating": 5.0,
      "verified": true,
      "author": "Rose Schloe",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Every recipe is delish",
      "text": "any Thing I make from this book gets enthusiastically devoured by vegetarians and meat eaters.",
      "rating": 5.0,
      "verified": true,
      "author": "Devon Keane",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "better than the first edition",
      "text": "even better than the first edition. good even for an omnivore like me who is trying to more healthy food.",
      "rating": 5.0,
      "verified": true,
      "author": "bigmama",
      "helpful_votes": 2,
      "publication_date": 20150714
    },
    {
      "title": "Love it",
      "text": "I love how Deborah Madison writes with such passion for food. I own many of her books.",
      "rating": 5.0,
      "verified": true,
      "author": "Nova Dawn",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "I love it.  The best from my favorite chef!",
      "text": "My original Vegetarian Cooking for Everyone was totally dog eared and food stained. This new edition is amazing... all my favorites and so much more.",
      "rating": 5.0,
      "verified": true,
      "author": "S, de Korte",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "The best in Vegetarian cooking",
      "text": "Since Greens Resturant I have followed her wonderful recipes and books . She has opened a whole new area in vegetarian cooking .",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Sult",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Cover torn",
      "text": "Book is fine but giving it as a gift and the cover was ripped ! How embarrassing to give a book with a taped cover. I will have to buy another",
      "rating": 2.0,
      "verified": true,
      "author": "CMB",
      "helpful_votes": 3,
      "publication_date": 20180726
    },
    {
      "title": "Love how this book breaks down the different vegetables and ...",
      "text": "Love how this book breaks down the different vegetables and gives the best way to use each one. I am not a vegetarian but really enjoy using this book when I see a new vegetable at the farmers market that I want to try.",
      "rating": 4.0,
      "verified": true,
      "author": "ACP",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "Five Stars",
      "text": "Recipes you love to learn, use, and reuse. Madison is a legend :)",
      "rating": 5.0,
      "verified": true,
      "author": "LeChef",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Not just for Vegans; excellent recipes for vegetarians and other cusines.",
      "text": "I purchased this for a gift. Our daughter loved it and welcomed the varied recipes. Beautiful book with detailed instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "Helen Hopp",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Great book but partly qualifies as an update.",
      "text": "I had the original book and had hoped for many updated recipes and procedures. For this reason I was pretty disappointed However, if you don't own the original I highly recommended it.",
      "rating": 3.0,
      "verified": true,
      "author": "Grizelda",
      "helpful_votes": 7,
      "publication_date": 20161117
    },
    {
      "title": "We aren't vegetarians but this book was super useful.",
      "text": "I wanted new ideas on how to cook veggies. We aren't vegetarians but this book was super useful.",
      "rating": 5.0,
      "verified": true,
      "author": "cboyken1",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "A favorite cookbook.  Delicious recipes for people who love to cook.",
      "text": "This is my all time favorite cookbook, next to Sally Schneider's \"The New Way to Cook\". A cookbook I'd be hard pressed to live without. Deborah Madison's orange dressing is a holiday favorite at our Thanksgiving table.",
      "rating": 5.0,
      "verified": true,
      "author": "Busygizmo",
      "helpful_votes": 0,
      "publication_date": 20160209
    },
    {
      "title": "Cheap Paper",
      "text": "Contents seem excellent, but this hardback edition is unfortunately printed on cheap pulpy paper that will suffer from every splash and stain. In a bookstore, I would have put it back on the shelf.",
      "rating": 4.0,
      "verified": true,
      "author": "macuaig",
      "helpful_votes": 11,
      "publication_date": 20150313
    },
    {
      "title": "Perfect1",
      "text": "Every recipe I've tried has been wonderful. I am exceedingly happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurel M",
      "helpful_votes": 2,
      "publication_date": 20150831
    },
    {
      "title": "My favorite cookbook got even better",
      "text": "Deborah Madison's previous version was the most used cook book I own, in fact I wore it out so I decided to replace it with the new edition. The improvements in the new edition make this an even better book.",
      "rating": 5.0,
      "verified": true,
      "author": "mgildea",
      "helpful_votes": 2,
      "publication_date": 20150227
    },
    {
      "title": "Five Stars",
      "text": "Great resource for the person who wants to have more vegetables in the diet.",
      "rating": 5.0,
      "verified": true,
      "author": "Gardenlily",
      "helpful_votes": 0,
      "publication_date": 20150815
    },
    {
      "title": "A Perfect Gift for a Vegetarian!",
      "text": "Despite having some shipping issues as this was a gift. My recipient loved it and started making notes of recipes she wanted to try as soon as she got this.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathaniel",
      "helpful_votes": 0,
      "publication_date": 20170623
    },
    {
      "title": "Will Convert Your Non-Vegetarian Friends if Only for a Meal",
      "text": "Gift for a vegetarian friend, but my non-vegetarian husband loves it as well and will tolerate meatless meals with some of these recipes.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce",
      "helpful_votes": 0,
      "publication_date": 20150522
    },
    {
      "title": "This classic has it all! Walnut bread, made ...",
      "text": "This classic has it all! Walnut bread, made today for a function, was yummy! If I could only have one cookbook, this would be it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jan Ferris  Koltun",
      "helpful_votes": 0,
      "publication_date": 20151108
    },
    {
      "title": "But a great effort by Madison",
      "text": "Almost too comprehensive. Who can read all this! But a great effort by Madison, nonetheless.",
      "rating": 4.0,
      "verified": true,
      "author": "DaleC",
      "helpful_votes": 0,
      "publication_date": 20150406
    },
    {
      "title": "Five Stars",
      "text": "Probably the best cook book I've purchase. The details and description are excellent so is the food.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer W.",
      "helpful_votes": 0,
      "publication_date": 20160112
    },
    {
      "title": "A beautiful and thoroughly useful vegetarian cookbook",
      "text": "The was a great gift to give someone who had the original version. The updates are really great and the new cover is gorgeous!",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Bennett",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "Dare I say this is the best vegetarian cookbook in my extensive cookbook collection?!!",
      "text": "Deborah Madison has done it again! Actually she's exceeded my expectations with this revised and updated edition of Vegetarian Cooking for Everyone. She takes vegetarian cooking to a new level, using creativity and leveraging inventive sauces to create recipes that will please vegetarians and vegans, while satisfying omnivores as well. I have many vegetarian cookbooks in my extensive cookbook collection and I think this may be the best. I'm a former vegetarian and current omnivore and Chef. Some Chefs scoff at vegetarian cuisine, but I think it's truly telling when a Chef is able to elevate vegetarian cuisine to make it appeal to the masses. You will not be disappointed with this cookbook, vegan, vegetarian, or omnivore.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Peterson",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "I like the way it separates the veggies and provides hints ...",
      "text": "I like the way it separates the veggies and provides hints to get the most from each. There are several vegetables that I am very familiar with but I can now look at them in a bold new way. I was bored with green beans cooked until they were so soft you didn't have to chew but I also didn't like them crunchy as in heated then shocked in cold water, seemed like they were still raw. Now I can add flavors and enjoy my once \"raw\" beans.",
      "rating": 5.0,
      "verified": true,
      "author": "Louis Burnette",
      "helpful_votes": 2,
      "publication_date": 20160814
    },
    {
      "title": "Perfect first vegetarian cookbook!",
      "text": "Wow, just arrived. Its so nice! and will be given as first cookbook to \"beginner vegetarians\".",
      "rating": 5.0,
      "verified": true,
      "author": "melanie qualls",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Five Stars",
      "text": "Has lots of good recipes and other information about vegetarian cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170805
    },
    {
      "title": "Easy and creative",
      "text": "This is a really \"user friendly\" book. The recipes are straightforward, easy and interesting to read, and the results so far have been very good. The roasted cauliflower is delicious as are the whole wheat and rye rolls. The use of organic vegetables and garnishes enhances the flavors.",
      "rating": 5.0,
      "verified": true,
      "author": "Mac",
      "helpful_votes": 0,
      "publication_date": 20140418
    },
    {
      "title": "just love healthy & delicious food",
      "text": "Im not a vegetarian, just love healthy & delicious food. So many great recipes. It’s given me ideas and I enjoy using these recipes as a jumping off point, and then adding my own touches. Highly recommend. Especially if you’re tired of the ways you prepare veggies. Most of the recipes are very simple, but she gives tips and provides interesting twists that I’d never have thought of.",
      "rating": 5.0,
      "verified": true,
      "author": "J&S",
      "helpful_votes": 2,
      "publication_date": 20140815
    },
    {
      "title": "Very informative, interesting recipes.",
      "text": "Well written, interesting book. Great addition to any cookbook library.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth B. White",
      "helpful_votes": 0,
      "publication_date": 20160313
    },
    {
      "title": "If there's an ingredient that you don't like (for me it's peppers in any form)",
      "text": "Encyclopedic and delightful. The Inclusion of aromatics in nearly every recipe gives real depth to vegetable dishes, making them \"main-dish\" appropriate. If there's an ingredient that you don't like (for me it's peppers in any form), just leave it out. Other ingredients in these deeply-flavored dishes will fill in for whatever you exclude.",
      "rating": 5.0,
      "verified": true,
      "author": "Abigail Padgett",
      "helpful_votes": 3,
      "publication_date": 20150618
    },
    {
      "title": "This is a great fund-read book even if you don't do any of ...",
      "text": "This is a great fund-read book even if you don't do any of the recipes. The \"why\" and \"wherefores\" of ingredients are discussed clearly and informatively. The cooking tips are terrific as they help you learn why certain ingredients and cooking methods work. A great sequel to Madison's earlier work.",
      "rating": 5.0,
      "verified": true,
      "author": "SIROCCO",
      "helpful_votes": 2,
      "publication_date": 20150306
    },
    {
      "title": "Terrific resource for cooking vegetables",
      "text": "A wonderful resource on cooking vegetables in a healthy and delicious way- not just for vegetarians. One of the best overall resources on cooking I own.",
      "rating": 5.0,
      "verified": true,
      "author": "Anon",
      "helpful_votes": 0,
      "publication_date": 20140713
    },
    {
      "title": "The new \"bible\" for vegetarian cooking",
      "text": "Obviously, this IS the new bible for vegetarian cooking! As I begin to harvest many of the fruits and vegetables of this summer, this is my go-to cookbook for new ideas. I have not been disappointed yet. (And, so far, the carnivorous teenagers in my family have not been inclined to complain either). Very, very worthwhile investment.",
      "rating": 5.0,
      "verified": true,
      "author": "CalamityJane",
      "helpful_votes": 3,
      "publication_date": 20140829
    },
    {
      "title": "Five Stars",
      "text": "It's a good book, but the original is still my foundation for vegetarian cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "Martha A Holland",
      "helpful_votes": 0,
      "publication_date": 20150111
    },
    {
      "title": "Wonderful Cookbook for Vegetarians and Non-vegetarians",
      "text": "Found a wonderful easy to make red pasta sauce recipe. Look forward to trying more of this great variety of recipes.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 2,
      "publication_date": 20160922
    },
    {
      "title": "A Must-have Cookbook",
      "text": "I am not a vegetarian and I still love this book. There are some adventurous recipes in here but also tons of simple, inventive and delicious stuff to make even the most dedicated carnivore's mouth water. This book should be sitting on everyone's kitchen shelf.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 2,
      "publication_date": 20160412
    },
    {
      "title": "One of my favorite cookbooks, and the first one I check for ...",
      "text": "Deborah Madison's recipes always have an interesting twist that makes them out of the ordinary. This is to go-to book when I can't decide how to cook a vegetable. I'm not a vegetarian, but her vegetable recipes sell the book. One of my favorite cookbooks, and the first one I check for recipes.",
      "rating": 5.0,
      "verified": true,
      "author": "Buyer4321",
      "helpful_votes": 0,
      "publication_date": 20140705
    },
    {
      "title": "This is the best cookbook I've seen.",
      "text": "Only complaint is the book is too heavy! Great ideas about how to use various foods. I don't follow receipes but like suggestions as to how to go about using various ingredients and combining them.",
      "rating": 5.0,
      "verified": true,
      "author": "Laine H. Massey",
      "helpful_votes": 0,
      "publication_date": 20140820
    },
    {
      "title": "Great cook book with lots of interesting recipes and information ...",
      "text": "Great cook book with lots of interesting recipes and information to learn for new and longtime vegetarian cooks. Happy to have found this book.",
      "rating": 5.0,
      "verified": true,
      "author": "a holl",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "which I would have liked to have",
      "text": "Bought this for my niece who loves to bake. There are absolutely no pictures, which I would have liked to have.",
      "rating": 4.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 2,
      "publication_date": 20151205
    },
    {
      "title": "Best",
      "text": "Covers everything! Great recipes! Love this book, and a great gift! Even for non vegetarians a great book! Get one for you and a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula",
      "helpful_votes": 2,
      "publication_date": 20140611
    },
    {
      "title": "Great gift for a food enthusiast",
      "text": "We bought it for a friend who used to be a professional baker and has the enthusiasm for a skills related to delicious food you'd expect. She reports that everything she's made from it has been great.",
      "rating": 5.0,
      "verified": true,
      "author": "Zach",
      "helpful_votes": 0,
      "publication_date": 20140413
    },
    {
      "title": "The book explains a lot of things regarding vegetarian. ...",
      "text": "The book explains a lot of things regarding vegetarian.But egg is not always considered as vegetarian.Most of the recipes contain egg.So if you are an eggless vegetarian, this book is not for you.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeyabalan Murugesan",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Five Stars",
      "text": "Great book. I'm sure it will sell a million copies It is more of a how to cook book",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20151015
    },
    {
      "title": "Nice update",
      "text": "Here's the update with newer ways of doing things and its' always good to stretch our thinking and make ourselves better.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia Johnson",
      "helpful_votes": 0,
      "publication_date": 20150423
    },
    {
      "title": "Get it even if you're a meat lover",
      "text": "Every thing I've tried tastes great and the background information is interesting and entertaining.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald G. Bailey",
      "helpful_votes": 0,
      "publication_date": 20141113
    },
    {
      "title": "Five Stars",
      "text": "Huge resourceful book. Purchased it based on other customers reviews of its value. They were right!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine T.",
      "helpful_votes": 0,
      "publication_date": 20141106
    },
    {
      "title": "Five Stars",
      "text": "Madison hits the mark most if not every time. Roasted tomato sauce recipe worth the price of the book",
      "rating": 5.0,
      "verified": true,
      "author": "Ami e. Beatty",
      "helpful_votes": 0,
      "publication_date": 20160123
    },
    {
      "title": "Five Stars",
      "text": "Awesome book withe some great recipies! Good addition to my knowledge, ability to inspire for new ideas!",
      "rating": 5.0,
      "verified": true,
      "author": "Mathias Reinhardt",
      "helpful_votes": 0,
      "publication_date": 20150107
    },
    {
      "title": "fantastic cookbook!",
      "text": "the book arrived very quickly and in perfect condition and the recipes are fantastic! I've only had it a short time and have loved everything I've cooked.",
      "rating": 5.0,
      "verified": true,
      "author": "JWH",
      "helpful_votes": 0,
      "publication_date": 20140422
    },
    {
      "title": "Five Stars",
      "text": "Bought this for my daughter for christmad. She loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20150103
    },
    {
      "title": "Thanks for a really filling and savory dishes. I ...",
      "text": "Thanks for a really filling and savory dishes. I bought both for my son and his wife. I also lentit out to one of my patients who was sent for counseling to lose weight. He loves it. Mary",
      "rating": 5.0,
      "verified": true,
      "author": "mary spencer",
      "helpful_votes": 0,
      "publication_date": 20140821
    },
    {
      "title": "Great addition to the kitchen!",
      "text": "Superb cookbook all around. Well written, easy to follow, wide range of recipes. Highly recommended for novices to advanced cooks.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane Smith",
      "helpful_votes": 2,
      "publication_date": 20140603
    },
    {
      "title": "She has made some great meals from it",
      "text": "Birthday present for my wife. She has made some great meals from it. It was a hit!",
      "rating": 5.0,
      "verified": true,
      "author": "SLG in Michigan",
      "helpful_votes": 0,
      "publication_date": 20140829
    },
    {
      "title": "Filled with Typos",
      "text": "This dull book is repetitive and RIDDLED with typos, both within the recipes and throughout the index. This coupled with small font and pale printing make for a very aggravating experience when trying to produce a dish or meal.",
      "rating": 2.0,
      "verified": true,
      "author": "Susanna",
      "helpful_votes": 6,
      "publication_date": 20171124
    },
    {
      "title": "Silly, Silly Me",
      "text": "The recipes are great but honestly I have no idea what I was thinking ordering a cook book for my kindle. That platform is just not suitable for cook books. How am I going to flip through this to find what I want to cook? No idea. Clearly didn't think this the whole way through. If you are going to buy this, and the recipes are certainly worth it, buy the actual book.",
      "rating": 3.0,
      "verified": true,
      "author": "Atomic",
      "helpful_votes": 8,
      "publication_date": 20160915
    },
    {
      "title": "The Best",
      "text": "This woman knows how to cook-unlike some cookbook cooks. Great ideas-most of her ideas are doable. She also gives simple ways to prepare the vegetables.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ellen Rock",
      "helpful_votes": 2,
      "publication_date": 20140518
    },
    {
      "title": "No pictures, but...",
      "text": "I was upset that there was no pictures, but it had A TON of amazing recipes.",
      "rating": 4.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 4,
      "publication_date": 20150128
    },
    {
      "title": "Another Choice",
      "text": "I bought it for my grandson. It weighs more than any other recipe book I've used. There are hundreds of recipes to try before one could reasonably critique the authors cooking skill. However, after skimming the content I also ordered Mark Bittman's latest cookbook for vegans and I think my grandson will find it more useful. The graphics are more appealing for one and Mr. Bittman makes everything he does more interesting. ​",
      "rating": 3.0,
      "verified": true,
      "author": "W. K. Macallister",
      "helpful_votes": 4,
      "publication_date": 20150611
    },
    {
      "title": "Great Cookbook!",
      "text": "I wanted one vegetarian cookbook that would cover the gamet of meatless cooking. This was the one. Just like Julia Child and her Mastering French cookbooks, this one will now be my go to vegetarian book.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Stillwell",
      "helpful_votes": 27,
      "publication_date": 20140318
    },
    {
      "title": "This One Was for My Husband",
      "text": "Haha, when my vegetarian husband retired last year and expressed an interest in cooking, I eagerly bought this book for him, hoping it would engage his interest. However, he has taken on a full-time involvement with music (guitar, singing, tuba) so the book lies unopened on the table in the family room. I skimmed through it and it looks wonderful and I hope that one of these days he'll notice it again and start using it. I'm done with cooking in this lifetime, but if I still enjoyed it, it would be my go-to cookbook, even though I'm not a vegetarian.",
      "rating": 5.0,
      "verified": true,
      "author": "Giselle",
      "helpful_votes": 0,
      "publication_date": 20140817
    },
    {
      "title": "Deborah Madison has a permanent place on my bookshelf, and this is her best.",
      "text": "I'm not yet used to this version of a wonderful cooking guide. Purchased for a lovely young friend recently married.",
      "rating": 5.0,
      "verified": true,
      "author": "JJ Johnson",
      "helpful_votes": 0,
      "publication_date": 20140828
    },
    {
      "title": "Complete Guide",
      "text": "This is a comprehensive guide to everything vegetarian. I now use it as my go-to for every type of vegetable and spices and accompaniments to vegetables. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael A. Hurd",
      "helpful_votes": 0,
      "publication_date": 20140515
    },
    {
      "title": "Five Stars",
      "text": "I am happy with the cookbook. It has many recipes, and uses a great variety of vegetables.",
      "rating": 5.0,
      "verified": true,
      "author": "Cabela's Visa",
      "helpful_votes": 2,
      "publication_date": 20140924
    },
    {
      "title": "love this!",
      "text": "great book! tons of recipes. simple to complex. a great way to use the veggies in your CSA box! would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Monique",
      "helpful_votes": 0,
      "publication_date": 20140424
    },
    {
      "title": "Gift for a friend",
      "text": "Since this was a gift for a friend, I have no personal experience with the book. Our friend however, has used several recipes from the book and said they were very good. He is very happy with the book.",
      "rating": 4.0,
      "verified": true,
      "author": "Arlene Truex",
      "helpful_votes": 3,
      "publication_date": 20140601
    },
    {
      "title": "Beans and more beans",
      "text": "Disappointed in the range of recipes. Expected more creativity, less bean-centric recipes",
      "rating": 2.0,
      "verified": true,
      "author": "ed strauss",
      "helpful_votes": 6,
      "publication_date": 20160111
    },
    {
      "title": "I bought this for my vegan son",
      "text": "He says he likes it. I have no idea what else I might possibly say other than I first read about it in The New Yorker magazine and I thought it sounded like a great idea as a gift for him. Apparently I was correct.",
      "rating": 5.0,
      "verified": true,
      "author": "Nickolas Trubov",
      "helpful_votes": 2,
      "publication_date": 20140426
    }
  ],
  "product_meta": {
    "title": "The New Vegetarian Cooking for Everyone: [A Cookbook]",
    "rating": 4.5,
    "specifications": {
      "Item Weight": "3.49 pounds",
      "Hardcover": "672 pages",
      "ISBN-10": "1607745534",
      "ISBN-13": "978-1607745532",
      "Product Dimensions": "8.31 x 2 x 10.25 inches",
      "Publisher": "Ten Speed Press; Revised Edition (March 11, 2014)",
      "Language:": "English",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Books",
      "Cooking by Ingredient",
      "Cookbooks, Food & Wine"
    ],
    "price": ""
  }
}