{
  "website_summaries": [
    {
      "verdict": "A good book for beginners in graphic design that explains the primary principles of design.",
      "pros": [
        "Uses visual examples and easy-to-understand text to explain scale, point, line, hierarchy, layers, typography, and designing with color",
        "Ideal for beginners looking for an introduction to these concepts"
      ],
      "cons": [
        "Some topics could be discussed in more detail",
        "This is not a book meant for experienced designers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "A reference manual, not a tutorial.",
      "text": "This book is not a tutorial on learning graphic design. It is more like a reference book for someone who has been trained in graphic design. One more note about this book, is the elements that are shared in it, can be learned from composition for drawing or paiting. However, I have not read the entire book yet, but have gotten through 25% of it. What I was looking for was a tutorial, a book to train me in graphic design. What I found was a reference manual. As a reference manual, it is very good with excellent picture examples.",
      "rating": 3.0,
      "verified": true,
      "author": "C. W. J",
      "helpful_votes": 31,
      "publication_date": 20170917
    },
    {
      "title": "Great for beginners!",
      "text": "I bought this book because other reviews said it was required for a college class and I wanted to get a taste for what formal instruction of graphic design entails. This book did exactly that, breaking design down into separate aspects of art and showing lots of examples of it. It helps with getting comfortable with design \"lingo\" too. A great introduction for people who don't want to spend thousands on college courses.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Markle",
      "helpful_votes": 29,
      "publication_date": 20170501
    },
    {
      "title": "Great book",
      "text": "Truth is I don't like to read. I used to study graphic design during my communication studies -and it was just plain text books. I never understood how I was supposed to understand design from plain text books. This book is visually enthusing and it was a pleasure going trough it. They have some really great pointers in the book. And they really designed the book very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristine",
      "helpful_votes": 17,
      "publication_date": 20160813
    },
    {
      "title": "Pretty, not substantial",
      "text": "Really just a picture book, no instruction or process explanation. Pretty sure the basics listed have always been the basics, so not sure why called \"New Basics.\" If you want a pretty coffee table book, buy it. If you wanted graphic design guidance, buy something else.",
      "rating": 3.0,
      "verified": true,
      "author": "Melissa G",
      "helpful_votes": 15,
      "publication_date": 20161217
    },
    {
      "title": "Trite",
      "text": "This isn’t even a reference book for design it reads more as a brief introduction to contemporary art. Meaning lots of uninteresting deadpan photos and very little actual knowledge of design is shared. Oh be had this book for a day and read it entirely within an hour. There is no reason to keep this book now since I already own enough reference books with far more inspiring and less obtuse work.",
      "rating": 1.0,
      "verified": true,
      "author": "Justin Miller",
      "helpful_votes": 5,
      "publication_date": 20190523
    },
    {
      "title": "Good introduction to the basic concepts of contemporary design",
      "text": "This is a very good introduction to many of the basic concepts of contemporary design. Each section (be it texture, hierarchy, color, rhythm and balance,...) is a relatively short overview of the concept, followed by many diverse and well crafted examples to compare and contrast. If you're looking for an general design book to start with, this one is pretty solid. From this you can figure out what topics you want to launch into more in depth. Maybe Gestalt principles are inspiring you. Or possibly the Grid.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Morris",
      "helpful_votes": 9,
      "publication_date": 20160530
    },
    {
      "title": "An effective introduction to the essential elements of graphic design",
      "text": "Graphic Design The New Basics by Ellen Lupton and Jennifer Cole Phillips is an effective introduction to the essential elements of graphic design. Each chapter is dedicated to one of these elements, such as rhythm and balance, color, scale, hierarchy, and the like. Their explanations are easy to understand but the strength of the book lies in the numerous examples they provide. Explaining the concepts is one thing but having vivid and various examples certainly reinforces the ideas.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom Ipri",
      "helpful_votes": 5,
      "publication_date": 20161127
    },
    {
      "title": "Best intro book ever.",
      "text": "This book is wonderful. I use it as a guide to teach my students the foundations of design. There are many wonderful projects and visual inspirations included. It is a great balance of text an image and makes for light reading that is impactful and to the point, and provides a range of projects, concepts, and visuals related to each topic. An absolute must for the bookshelf of a young designer and just as wonderful as refreshing inspiration for a seasoned vet!",
      "rating": 5.0,
      "verified": true,
      "author": "Casey Kelly",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Picture Book, Behance",
      "text": "This book doesn't offer any helpful instruction on the basics of design. This is my second book by the same author and Ellen just seems more interested in impressing the reader with complex vocabulary and a confusing mastery of design. Very little content, and you can find more helpful/inspiring design on Behance. This book feels like a cash grab by just printing others work and throwing in some nonsensical text along with it. It gets two stars for presentation, but that's it.",
      "rating": 2.0,
      "verified": true,
      "author": "Bobby S. ",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Love this book",
      "text": "If you need to learn the basics of Two-Dimensional Design theory and see it applied in the world. This is the bomb.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Garner",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Great service",
      "text": "The book was the one I needed for a class and the shipping was fast. I give this a big thumbs up!",
      "rating": 5.0,
      "verified": true,
      "author": "OM",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "A pleasure to read",
      "text": "This book helps to grasp design concepts by distributing terminology and ideas into manageble chunks that anyone can pick up immediately.",
      "rating": 4.0,
      "verified": true,
      "author": "Ivan",
      "helpful_votes": 2,
      "publication_date": 20170418
    },
    {
      "title": "The cover fell off as soon as I opened it.",
      "text": "I just opened this book for the first time and the cover came off. This is not a review of the quality of the content. Unfortunately there is no option for just the quality of the materials.",
      "rating": 1.0,
      "verified": true,
      "author": "sean",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Beginner's Guide",
      "text": "This book is as basic as it gets. Good for complete art and design beginners. It is also quite geared for the computer based, beginning graphic designers as it incorporates a lot tech jargon and tips.",
      "rating": 3.0,
      "verified": true,
      "author": "Helen Lee",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Great to get started",
      "text": "Excellent for foundational skills and inspiration! A must-read if you’re getting started with graphic design.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "If you are new to design this is a great book to get the basic principals",
      "text": "This is a very comprehensive book on design. If you are new to design this is a great book to get the basic principals. If you are a seasoned designer this give great new insights into the principals you use everyday. I found it enlighten get and struggling at the same time. It help me remember some princpaIs I had forgotten. Great book.",
      "rating": 5.0,
      "verified": true,
      "author": "Oleooo",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "Eh",
      "text": "it was alright, much of what youtube can teach tbh",
      "rating": 3.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Five Stars",
      "text": "I actually bought this for a graphic design class, very helpful if youre new to graphic design",
      "rating": 5.0,
      "verified": true,
      "author": "Ana Mena",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "I enjoyed looking through the book",
      "text": "I enjoyed looking through the book, but I agree that this book leans a bit harder on being a reference manual rather than a guide for implementing graphic design principles.",
      "rating": 4.0,
      "verified": true,
      "author": "John Cole",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Good reference",
      "text": "Not really what I was looking for but its pretty good.",
      "rating": 4.0,
      "verified": true,
      "author": "O",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Great basic design textbook!",
      "text": "This book is a cohesive introduction to graphic design. I am considering using it to teach my intro design classes in college. I highly recommend it to anyone interested in designing or teaching design. The only thing I would change is to add assignment ideas.",
      "rating": 5.0,
      "verified": true,
      "author": "Angie",
      "helpful_votes": 0,
      "publication_date": 20160501
    },
    {
      "title": "It's ok.",
      "text": "It is just okay for my design sensibilities. It was not that helpful to me and my work personally.",
      "rating": 3.0,
      "verified": true,
      "author": "Noodle's mom",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Great book",
      "text": "Had to pick this book up for class. Very accessible and informative. Definitely a good starting point for any aspiring graphic designer.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruzzel",
      "helpful_votes": 0,
      "publication_date": 20160326
    },
    {
      "title": "Basics",
      "text": "I got this book for my into to design class. Kindle version. Decent book.",
      "rating": 5.0,
      "verified": true,
      "author": "Soles_Toes",
      "helpful_votes": 0,
      "publication_date": 20170202
    },
    {
      "title": "Four Stars",
      "text": "Really good book, I've post four stars because the delivery wasn't fine at all.",
      "rating": 4.0,
      "verified": true,
      "author": "Adriana Perez",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "Very Informative",
      "text": "I thought at first it's was the wrong version but found out it was right. Overall it's very informative compared to the pink covered version.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "A must for designers",
      "text": "Love this book. The information in the book is very well detailed. The book came right on time and was in perfect condition. I cannot wait to learn more about graphic design from this book.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracey DeSoto",
      "helpful_votes": 0,
      "publication_date": 20160212
    },
    {
      "title": "Two Stars",
      "text": "Upon opening the package, the corners were torn and binding was scratched.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Perfect!!!",
      "text": "Like I expected and not even a scratch on it!! More than satisfied",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Trilla",
      "helpful_votes": 0,
      "publication_date": 20160226
    },
    {
      "title": "Good for a novice.",
      "text": "Contrary to the title...nothing new in this one. The content is for a novice or a self-taught designer who wants common terms. Visually the book is superb, the student examples are beautiful. Stars would have been higher if the title was Graphic Design: The Basics.",
      "rating": 3.0,
      "verified": true,
      "author": "GoodLuckTina",
      "helpful_votes": 4,
      "publication_date": 20151030
    },
    {
      "title": "Excellent book!",
      "text": "What a fantastic book Great introduction to key design concepts Visuals and examples are beautiful It's definitely a book I'd come back to again and again To peruse",
      "rating": 5.0,
      "verified": false,
      "author": "DizzyPony",
      "helpful_votes": 0,
      "publication_date": 20170502
    }
  ],
  "product_meta": {
    "title": "Graphic Design: The New Basics",
    "rating": 4.4,
    "specifications": {
      "Item Weight": "1.72 pounds",
      "Paperback": "264 pages",
      "ISBN-10": "9781616893323",
      "ISBN-13": "978-1616893323",
      "Product Dimensions": "8.25 x 0.75 x 9 inches",
      "Publisher": "Princeton Architectural Press; 2nd Edition (July 14, 2015)",
      "Language:": "English",
      "ASIN": "161689332X",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Graphic Design",
      "Books",
      "Arts & Photography"
    ],
    "price": ""
  }
}