{
  "website_summaries": [
    {
      "verdict": "This comprehensive cookbook includes 99 recipes for all meals of the day, along with a list of suggested DASH-friendly foods and tips on navigating the grocery to help with shopping.",
      "pros": [
        "Fully comprehensive DASH diet lifestyle change book",
        "99 recipes for all meals",
        "Suggested DASH-friendly foods",
        "Includes a 28-day workout plan and menu planner",
        "Chock full of good information"
      ],
      "cons": [
        "Recipes lack nutritional breakdown",
        "Some feel recipes are too high in sodium for DASH"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It's backwards!",
      "text": "I purchased this book several years ago along with several others about the DASH diet. (What can I say. I'm a bookaholic.). I didn't open it until tonight and imagine my surprise that it pages backwards! It's useless, of course, but anyone purchasing it should check it out when it's downloaded. From what I could tell it looks to be informative based on the ToC. Just not easy to read. It would be wonderful to have a corrected copy.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "Excellent, thorough book!",
      "text": "I searched for a book on diets for people with heart disease and high blood pressure so I could share it with my mom. The DASH diet popped up and I decided to read it. Overall, I really loved that the book explains all the health benefits of the diet, specifically how it quickly lowers blood pressure. The 10 tips the book provides to prepare for this diet are very useful, for any dieter. I also loved the shopping lists and sample recipes! This is an excellent resource for any dieter, and I'm very excited to tell others about it!",
      "rating": 5.0,
      "verified": true,
      "author": "April M",
      "helpful_votes": 2,
      "publication_date": 20140522
    },
    {
      "title": "On first reading",
      "text": "Well written and sympathetic to the dieter' s common roadblocks with suggestions for overcoming them. Recipes are unique and sound surprisingly tasty. My only criticism is that almost all of the recipes are for 4 servings. It is too easy for a single person to eat more than the recommended portion when one is hungry. As well, the menu is for 2000 calories a day and you are left to figure out how to reduce the calories for your needs.",
      "rating": 4.0,
      "verified": true,
      "author": "Lorraine C. Williams",
      "helpful_votes": 4,
      "publication_date": 20140627
    },
    {
      "title": "Try this Health Risk Reducer Plan of the Dash diet",
      "text": "This book serves as an introduction, indicates many positive aspects of the diet, and states that primary purpose of the diet is to help measurably reduce health risks like high blood pressure, heart disease, Diabetes, other metabolic diseases, and Stroke. The diet gives you multiple version of the diet, is customizable, can include a fitness plan, and helps with simple calculations that will help you get started. All of the above steps will lead to weight loss and help you maintain your weight once the ideal weight has been achieved. Worth it to me!",
      "rating": 5.0,
      "verified": true,
      "author": "Doc A",
      "helpful_votes": 0,
      "publication_date": 20150603
    },
    {
      "title": "The DASH Diet Health Plan Review",
      "text": "Finally a diet that is not just created for the sole purpose of losing weight, and that is a good thing. Although when looking for a diet plan losing weight might be a goal, but being healthy is just as important. This Dash Diet has so many other great benefits for a healthier life. It is a weight loss and health plan combined that also gives tips on eating well in order to lower blood pressure. Within the pages of the book, there are recipes the reader can use as a guide to learn to eat better and improve their overall health. This is definitely a book work checking out for your diet needs.",
      "rating": 4.0,
      "verified": true,
      "author": "Judy",
      "helpful_votes": 0,
      "publication_date": 20131108
    },
    {
      "title": "DASH Diet Book - A Must Read",
      "text": "The DASH Diet Health Plan by Rockridge Press explains what the DASH plan is all about - it's a low-sodium, high fiber plan intended to help those who are hypertensive or pre-hypertensive. The calculations for BMI, BMR and total caloric intake needed were very helpful as were the tips to stick to a new diet and fitness plan. The book includes mouth-watering recipes that include lean proteins, low-fat dairy, whole grains, fruits, veggies, nuts and seeds as well as a fitness plan that is easy to follow. I recommend this book highly and plan to integrate the DASH plan into my life.",
      "rating": 5.0,
      "verified": true,
      "author": "Deanna Couras Goodson",
      "helpful_votes": 0,
      "publication_date": 20131111
    },
    {
      "title": "Uneccesary",
      "text": "It's not a bad book but don't waste your money. There's more than adequate information and Dash Diet recipes available online.",
      "rating": 2.0,
      "verified": true,
      "author": "Robert A. Grossman",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "I Hope That It Works!",
      "text": "My significant other has heart problems, & I hope that this diet helps him!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Z",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Delicious Dash Diet",
      "text": "With both diabetes and high blood pressure being a common health concern in my family, I have been looking for healthy changes I can make to my diet. What makes this book great is that it has healthy and delicious meals--and a wide variety of sweet treats too! While the book is packed with great recipes, it also explains how to plan your meals, even when not using recipes in the book which helps me when dining out and cooking without a recipe.",
      "rating": 4.0,
      "verified": true,
      "author": "Joanne S",
      "helpful_votes": 0,
      "publication_date": 20131111
    },
    {
      "title": "A definite \"must read\" for those with hypertension/cholesterol issues as well as weight issues",
      "text": "I appreciate the clear and precise guidelines contained in the Dash Diet Health Plan. Focused on low sodium food choices, this book gives the reader a wide choice of menus, and the reasons are very clear for providing these particular offerings, as opposed to others. Menus items include stuffed mushrooms, garlic basil shrimp, artichoke chicken, avocado cheese melts .. one is definitely not \"deprived\" of flavor and \"fun\" in this diet plan. For those attempting to make and follow a life choice of staying healthy and observing a solid \"diet\" which can extend over years, I would highly recommend the Dash Diet Health Plan.",
      "rating": 5.0,
      "verified": true,
      "author": "LibertyC",
      "helpful_votes": 0,
      "publication_date": 20140608
    },
    {
      "title": "It works!",
      "text": "I've done so many diets and failed, but this works! (of course, you have to follow it religiously) An easily presented plan with sample menus and several recipes to get you started on losing weight, lowering your blood pressure and cholesterol. I'd highly recommend it to anyone with any of the above health problems.",
      "rating": 5.0,
      "verified": true,
      "author": "C. J. Clark",
      "helpful_votes": 0,
      "publication_date": 20140828
    },
    {
      "title": "The Dash Diet",
      "text": "The Dash Diet is more than just a cookbook; it’s a guide for eating and living healthy for the rest of your life. It explains the science behind the diet and the studies done to support it. It then provides a long list of delicious and nutritious recipes. The dash diet is perfect for anyone suffering from high blood pressure, or who may be at risk for developing hypertension. It’s also a great way to lose weight and keep the pounds off. This book even walks you through developing your own personalized calorie requirements based on BMI and body measurements. It concludes with wonderful recipes that will have you happily sticking to this plan for life.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaila",
      "helpful_votes": 0,
      "publication_date": 20140115
    },
    {
      "title": "Good plan",
      "text": "I am so happy to see this plan and book. I used it years ago when it was just a piece of paper my doctor handed to me. It was a great life style change. And then poof I fell off the plan. Not sure why as it was easy to follow and I felt better too. Ah well, such is life. Now I get to start fresh. The book is easy to follow and the recipes sound delicious.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150306
    },
    {
      "title": "All of us should be following this!",
      "text": "The DASH Diet (Dietary Approaches to Stop Hypertension) was developed to reduce high blood pressure and to prevent heart disease, diabetes, and stroke. It's also a safe and effective weight loss plan--reducing fat around the abdomen. Health agencies and medical institutions like the American Medical Association endorse it as \"heart-healthy diet\" for all Americans. The diet is straight forward and easy to follow offering plenty of flexibility regarding overall caloric intake. It is heavy on fiber and light on saturated fat, sugars and salt. The instructions for calculating your body mass index and individual caloric needs were well written and easy to understand. The recipes and work out plans were worth the price of the book!",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20131113
    },
    {
      "title": "A low-sodium diet with a little wiggle room",
      "text": "The DASH Diet is more concerned with lowering high blood pressure, and treats weights loss only as a result of that, rather than the primary goal. Something that's refreshing in a culture that often conflates weight loss with health. The book is very comprehensive, with recipes that are very easy to understand, and besides a few cooking tools, doesn't require an in-depth understanding of cooking. There are fourteen days worth of menu plans to help ease into the diet. It's based on a 2,000 calorie diet, with 1,500 mg of sodium each day, but only as a starting point. The diet allows for adjustment if 2,000 calories a day isn't right for you, or for taste preferences.",
      "rating": 4.0,
      "verified": true,
      "author": "Taylor Anady",
      "helpful_votes": 0,
      "publication_date": 20131125
    },
    {
      "title": "Not the full book",
      "text": "Disappointed. Book hops around to hints and shortcuts. I wanted all the meal plans. Would not recommend now. Will review further.",
      "rating": 1.0,
      "verified": true,
      "author": "Avid Crafter",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Brought it for my hubby",
      "text": "I was aware of the DASH Diet for high blood pressure and thought it would be good to get the book for my husband. I looked through it needed something that would work asap. My hubby's blood pressure was very high at the time. It was a little different than what I expected but I am glad I made the purchased still. It has recipes not quite quick fixes that I needed at the time.",
      "rating": 3.0,
      "verified": true,
      "author": "Marsha J",
      "helpful_votes": 0,
      "publication_date": 20140421
    },
    {
      "title": "It's okay.",
      "text": "It gives quite a large amount of information and some recipes. The recipes seem okay, nothing really great. There is nothing really impressive about this book at all.",
      "rating": 3.0,
      "verified": true,
      "author": "Betsy Smith",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "I like the cookbook",
      "text": "I like the cookbook. Has good recipes, but they do not list salaries per portion. I have to calculate them all. Not fun",
      "rating": 4.0,
      "verified": true,
      "author": "Rebecca Kleinhans",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Indulgent desserts",
      "text": "This is a great diet book. It is a comprehensive cookbook and diet plan. The 14-day diet menu and the 28-day fitness plan make it even easier and more possible to ease yourself into his new diet. Full menu for the whole day including snacks and desserts looks like it will satisfy any craving. Indulgent dessert menu is always a plus! You won't feel like you are missing out on anything when you are on this DASH diet because you are still getting all the fancy desserts as custard, cookies and cake!",
      "rating": 4.0,
      "verified": true,
      "author": "phuong d nguyen",
      "helpful_votes": 0,
      "publication_date": 20140524
    },
    {
      "title": "Great Comprehensive Overview",
      "text": "The Dash Diet Health Plan book provides a comprehensive overview of the DASH diet, a plan that has been scientifically vetted and is touted by nationwide health organizations. The book outlines the structure of the diet along with the associated benefits such as lower blood pressure, heart disease prevention, and weight loss. I especially like the section that provides helpful tips on how to ease into the diet rather than making a bold transition all at once. Food guidelines are clearly outlined and daily meal plans are provided. There’s even a section on exercise to incorporate. This book really makes it easy to adapt the DASH diet into your own lifestyle.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelli Schneider",
      "helpful_votes": 0,
      "publication_date": 20131114
    },
    {
      "title": "alright",
      "text": "not what i was expecting. Wish it gave better insight on the nutrition values of the foods recommended in the recipes.",
      "rating": 3.0,
      "verified": true,
      "author": "Felisha Robinson",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "Dash Diet Promotes Life Style Change, Good Health",
      "text": "The DASH Diet Health Plan provides recipes backed by medically sound research that allows one to enjoy tasty meals while ingesting food that's healthy. As a bonus, you can keep the pounds off, too, although the anonymous author says the diet was created to \"reduce high blood pressure, which in turn helps prevent heart disease and stroke.\" The introduction pulls you in right away, enticing you with chocolate cake, French dip sandwiches, etc., and promising good health. You are warned that the DASH Diet is \"not a quick fix\" but a new way of living that requires a commitment. It's easy reading, well organized and provides both background and planning.",
      "rating": 5.0,
      "verified": true,
      "author": "Milton McGriff",
      "helpful_votes": 0,
      "publication_date": 20131111
    },
    {
      "title": "Okay",
      "text": "While practical advise, this is not a lifestyle for me; I need something a little more flexible",
      "rating": 3.0,
      "verified": true,
      "author": "Roseanne/STEVE",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "An informative and concise look at the Dash Diet",
      "text": "I Just finished \"The Dash Diet Health Plan\" and I've been getting to work following some of its guidelines and trying out some of its recipes. I recommend this book for people who have to deal with high-blood pressure or deal with (or knows someone who deals with) diabetes. The majority of the low-sodium recipes sound delicious although the suggested portions are very small. The book does a good job balancing scientific information with tips and suggestions for how to live a healthier life. I've tried two of the recipe suggestions in the back (the stuffed mushrooms and the pumpkin pie) and they were both quite good.",
      "rating": 4.0,
      "verified": true,
      "author": "Marcus",
      "helpful_votes": 0,
      "publication_date": 20131112
    },
    {
      "title": "ONE OF THE BEST DIET BOOKS I'VE READ!",
      "text": "The diet proposed by Dash Diet is different from all other diets. This diet doesn't focus as much on losing weight--which you will (they help you on how to measure your \"body mass index\" (BMI) as well as your \"basal metabolic rate\" (BMR)), but it focuses on combating high blood pressure and even helps reduce the risk of diabetes 2. This book helps you plan as well as make the transition to the Dash Diet easily and provides you with recipes that are fairly easy to make and they taste good, plus and may I suggest the Loaded Turkey Sandwich.",
      "rating": 5.0,
      "verified": true,
      "author": "eric s.",
      "helpful_votes": 0,
      "publication_date": 20131111
    },
    {
      "title": "Just Do It",
      "text": "Created to reduce high blood pressure, the DASH Diet can improve your overall health. It's not a fad diet. It's medically proven to be good for you. If you think the diet is going to be bland and boring, you may want to rethink it. Sure, you are going to have to eliminate a lot of processed foods, and high-sodium condiments. And, it's recommended that you take the saltshaker off the table. The key to the diet is planning in advance. The 28-day DASH to fitness workout plan really works. All you have to do is do it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jamie McGillian",
      "helpful_votes": 0,
      "publication_date": 20131107
    },
    {
      "title": "Five Stars",
      "text": "An easy to do diet that is affordable and tasty",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Great dieting book",
      "text": "This book is great for anyone who has high blood pressure and is wishing to bring it down. The DASH diet has been scientifically proven to lower blood pressure due to the lower amounts of sodium and trans fats, as well as higher amounts of fiber in one's diet. There are no repercussions from using this diet, so as a fact anyone can follow it. The book contains information about how to follow the diet as well as delicious recipes that are allowed within the diet. So if you're looking to lower blood pressure but want to still eat delicious food, look no further.",
      "rating": 4.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 0,
      "publication_date": 20131111
    },
    {
      "title": "Getting your life in order.",
      "text": "I really like this book it is excellent! I do need to loss weight, and lower my sodium intake, and watch my blood pressure. I took the book to my doctor and he said he thought that I picked the perfect book. I gave this book a 5 star rating because it got everything in it so you won't go wrong. I have no dislikes of the book at all. Already I tried a meal and it taste great. Getting myself back in order the way the body is suppose to work; is good for me. I would recommend this book to anybody, it is good for your health.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn Muriel Daniels",
      "helpful_votes": 0,
      "publication_date": 20140105
    },
    {
      "title": "Very straight-forward health plan.",
      "text": "The Dash Diet Health Plan is a great read for anyone looking to switch to a healthier and easy to follow diet. Unlike most diet plans which focus on losing weight, the dash diet health plan focuses on providing the reader with ways to lower blood pressure and cut the risk of getting Diabetes type 2. These tips include simple and easy to follow rules such as substituting salt or drinking more water. This book is great for the typical busy American who is not terribly overweight or unhealthy but wants to eat healthier and does not want to follow a very restrictive diet plan.",
      "rating": 5.0,
      "verified": true,
      "author": "Tulan",
      "helpful_votes": 0,
      "publication_date": 20131120
    },
    {
      "title": "Best diet out there",
      "text": "Great diet advice based on research. Good for lowering blood pressure but also general health or weight loss. More plant based recipes would be nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelley Wilson",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "More DASH",
      "text": "The book has the really guts of the DASH diet. The diet is so healthy and so sensible. If you need to lower your blood pressure and cholesterol and want to lose some weight on the way, this is the way to go!!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara B.",
      "helpful_votes": 0,
      "publication_date": 20130331
    },
    {
      "title": "Taught me the Plan - Which is working!",
      "text": "This book filled in all the details around the DASH Diet, and the diet works. It answered the \"why\" does it work question, and made sense. The Recipes were also very good. I bought the book for my Kindle, and then decided to get the hard copy too for the recipes.",
      "rating": 4.0,
      "verified": true,
      "author": "VSJ",
      "helpful_votes": 4,
      "publication_date": 20130328
    },
    {
      "title": "Best Diet for anyone",
      "text": "I am trying to lose weight, get off my blood pressure medicine and this book is helping me. Sensible eating and affordable. I have not been hungry since starting this plan and I have much more energy. Week 2 of following the plans.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah K. Clem",
      "helpful_votes": 0,
      "publication_date": 20130120
    },
    {
      "title": "Easy simpering recipes included",
      "text": "Fits all the things my doctor has been suggesting. This appears to be an eating guide that I can follow a lifetime and enjoy. I love fnuts, ruits and vegetables that are abundant in the DASH diet, it even allows the dark chocolate that I am addicted to. The recipes are simple and easy to follow.",
      "rating": 5.0,
      "verified": true,
      "author": "Betty Hagan",
      "helpful_votes": 0,
      "publication_date": 20130209
    },
    {
      "title": "No nutritional info",
      "text": "Good information & recipes. But no nutritional information is included. A major component of the DASH diet is restricting salt so it would be helpful to know the amount of sodium in the recipes given.",
      "rating": 3.0,
      "verified": true,
      "author": "JoGersh",
      "helpful_votes": 4,
      "publication_date": 20160121
    },
    {
      "title": "The DASH Diet Health Plan",
      "text": "Needing to drop my sodium levels I thought that this would be the best book for me. You will still get a lot of flavor without the added sodium and learn to use other spices to add a kick to your food.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia L. Wilhelm",
      "helpful_votes": 0,
      "publication_date": 20130209
    },
    {
      "title": "Awesome",
      "text": "Lots of great info. Highly recommend for a healthy lifestyle.",
      "rating": 5.0,
      "verified": true,
      "author": "Pen name",
      "helpful_votes": 0,
      "publication_date": 20170924
    },
    {
      "title": "take a look",
      "text": "This gives you a review of what to look for when lowering your sodium intake. Some of the recipes are not to my likings (don't like fish) but others I tried are tasty",
      "rating": 4.0,
      "verified": true,
      "author": "MsOrlando",
      "helpful_votes": 0,
      "publication_date": 20131205
    },
    {
      "title": "Great Book",
      "text": "I love most of the recipes that are in this book. I don't feel like I'm being deprived of food.",
      "rating": 4.0,
      "verified": true,
      "author": "Apple Annie",
      "helpful_votes": 0,
      "publication_date": 20150113
    },
    {
      "title": "will work if followed.",
      "text": "Received book, and read it almost thru the first setting. It will take some work but am looking forward to loosing weight.",
      "rating": 4.0,
      "verified": true,
      "author": "gene-o",
      "helpful_votes": 0,
      "publication_date": 20131007
    },
    {
      "title": "Healthy Eating Part 2",
      "text": "This book, along with the DASH cookbook make a perfect pair. You can really see a difference in your health and it is not hard or rigid to follow.",
      "rating": 5.0,
      "verified": true,
      "author": "Onlythebest",
      "helpful_votes": 0,
      "publication_date": 20130319
    },
    {
      "title": "The Dash Diet Health Plan: Low-Sodium, Low-Fat Recipes to Promot Weight Loss",
      "text": "Simple and easy recipes to prepare. This is helpful in a safe weight loss experience. I appreciate the low-sodium recipes",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20140217
    },
    {
      "title": "Great",
      "text": "Arrived quickly. A great book for someone who was just placed on a low sodium, low cholesterol, low fat diet.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary A. Ronzino",
      "helpful_votes": 0,
      "publication_date": 20150407
    },
    {
      "title": "great book",
      "text": "Recipes look and sound delicious and easy. Very interesting reading. Lots of foods on allowed list. Love fruits and vegetables so easy to look forward to eating.",
      "rating": 5.0,
      "verified": true,
      "author": "dirttraveler",
      "helpful_votes": 0,
      "publication_date": 20150304
    },
    {
      "title": "Very Informative !",
      "text": "A lot of information on the diet. Suggestions on what to eat and not to eat healthy foods that will help you with your blood pressure and more. There are a lot of meal suggestions and how to prepare them. Very informative great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Lady Molly",
      "helpful_votes": 0,
      "publication_date": 20140623
    },
    {
      "title": "Too \"good\" to be true???",
      "text": "If I had to describe “The DASH Diet Health Plan” in three words, it would be “hard to believe”! Incredibly delicious recipes, a common sense 28 day fitness plan and sample menus are only a few of the benefits squeezed into this well written, easy to read goldmine! No wonder US News & World Report chooses it as its #1 choice as “Best Diets Overall”, “Best Diet for Healthy Eating” and “Best Diabetes Diet”! My wife and I are excited as we embark and experience this medical researched and supported adventure.",
      "rating": 5.0,
      "verified": true,
      "author": "Just Bob",
      "helpful_votes": 0,
      "publication_date": 20140526
    },
    {
      "title": "great recipes, tasty, healthy too!",
      "text": "lowered my cholesterol by 40 points, prompted us to eat better and exercise plays a big part! I would recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "karenruth",
      "helpful_votes": 0,
      "publication_date": 20130322
    },
    {
      "title": "Amazing book on the Dash Diet",
      "text": "I couldn't put this one down until I finished. Packed with very easy to follow steps to be successful. Awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Dvalarie Taylor",
      "helpful_votes": 0,
      "publication_date": 20130808
    },
    {
      "title": "Dash diet",
      "text": "Most comprehensive book I have read, filled with all the information you need to get back on track to a healthy, fit, lifestyle!",
      "rating": 5.0,
      "verified": true,
      "author": "Latte Girl",
      "helpful_votes": 0,
      "publication_date": 20121126
    },
    {
      "title": "Lower blood pressure achieved",
      "text": "Very helpful, no weight loss, however I have reduced my hypertension tablets from two to one a day. Any reduction be it weight or tablets must be a bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Hair",
      "helpful_votes": 0,
      "publication_date": 20130725
    },
    {
      "title": "Pretty Good",
      "text": "This was very helpful in helping me to maintain a healthy level for the blood pressure and cholesterol levels as reported by the lab..",
      "rating": 5.0,
      "verified": true,
      "author": "LENA  PAGE",
      "helpful_votes": 0,
      "publication_date": 20140419
    },
    {
      "title": "Very Good Book Very Helpful",
      "text": "I like it very much . The book is full of valuable information. I found it very useful and easy to read and understand.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130218
    },
    {
      "title": "DASH diet",
      "text": "This book has amazing recipes and information, a must read to promote weight loss, reduce sodium intake and lower blood pressure.",
      "rating": 4.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20150311
    },
    {
      "title": "Very informative book, full of great recipes",
      "text": "I liked this book a lot, especially because it takes a uniqe approach to health and fitness. It includes references from numerous reputable medical research institutions, lending a good deal of credibility to the claims being made. The Dash diet focuses on lowering blood pressure, mostly through the reduction of sodium. However, it also specifically tells you which foods are good and which are bad. It helps you understand the glycemic index, fiber, and fats. Plus, you get a ton of delicious recipes. I recommend this book.",
      "rating": 4.0,
      "verified": true,
      "author": "BC5",
      "helpful_votes": 0,
      "publication_date": 20140522
    },
    {
      "title": "Just OK",
      "text": "This book is OK if you are just starting with the healthier lifestyle. I am not a big health/fitness nut, but I found that the recommendations that they were giving were things that I had already been doing for some time.",
      "rating": 3.0,
      "verified": true,
      "author": "Brian P.Ludden",
      "helpful_votes": 2,
      "publication_date": 20140617
    },
    {
      "title": "great tasting easy recipes",
      "text": "Easy recipes with common ingredients. We tried many recipes and they all turned out delicious. This is a very easy lifestyle change with little to no sacrifice.",
      "rating": 5.0,
      "verified": true,
      "author": "Ricky R",
      "helpful_votes": 0,
      "publication_date": 20140101
    },
    {
      "title": "Great overview with recipes.",
      "text": "Great overview: concise without sacrificing crucial information. The recipes look good, although I haven't tried any yet. Apparently concise reviews are not appreciated, as in required to include 20 more words, including those in this sentence.",
      "rating": 4.0,
      "verified": true,
      "author": "Sandra L. Etemad",
      "helpful_votes": 0,
      "publication_date": 20160726
    },
    {
      "title": "uninformative",
      "text": "Very vague. Not enough information. Did not feel I came away with learning anything that would make me want to start this diet.",
      "rating": 3.0,
      "verified": true,
      "author": "Susan Rogowski",
      "helpful_votes": 0,
      "publication_date": 20131203
    },
    {
      "title": "no nutritional information for the recipes",
      "text": "This book is about the DASH-diet, a low-sodium, low-fat diet that many persons follow in order to reduce blood pressure and other health problems. Wouldn't it make sense for a low-sodium, low-fat recipe book to show for each recipe the nutritional information? At the very least, it should show the sodium content. Without this information, the recipes are pretty useless - unless you trust the author's word that the recipes are low-sodium.",
      "rating": 1.0,
      "verified": true,
      "author": "Fede Walliczek",
      "helpful_votes": 41,
      "publication_date": 20130617
    },
    {
      "title": "DASH",
      "text": "The Dash is a nice book. It is easy to read and follow. It did not tell me anything new.",
      "rating": 3.0,
      "verified": true,
      "author": "Janiel",
      "helpful_votes": 0,
      "publication_date": 20140305
    },
    {
      "title": "Like most diet books",
      "text": "It came a day early, and it's interesting. Like most diet books, though, it doesn't have many recipes that are really low sodium.",
      "rating": 5.0,
      "verified": true,
      "author": "kajngranny",
      "helpful_votes": 0,
      "publication_date": 20151114
    },
    {
      "title": "Great book!",
      "text": "Great book. Lays out the diet in a simple read.",
      "rating": 5.0,
      "verified": true,
      "author": "MT",
      "helpful_votes": 0,
      "publication_date": 20150213
    },
    {
      "title": "Healthier choices for better heart (and lowered blood pressure) health",
      "text": "Healthier choices for better heart (and lowered blood pressure) health. Bought this a while back, using it now with intermittent fasting and the Leslie Sansone videos to get back into shape. Really trying to get off of blood pressure medication.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Ortiz",
      "helpful_votes": 0,
      "publication_date": 20160228
    },
    {
      "title": "Three Stars",
      "text": "I haven't been on it long enough to give an honest opinion, ask me again in a year.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150508
    },
    {
      "title": "Diet Plan is too restricted",
      "text": "This diet menu plans require too much variety and of course this requires spending too much on the food choices. Not a good idea in this economy!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Jenny  Quist",
      "helpful_votes": 6,
      "publication_date": 20130320
    },
    {
      "title": "One Star",
      "text": "Again did not do much for weight loss. Lyn Maire",
      "rating": 1.0,
      "verified": true,
      "author": "Lyn Marie",
      "helpful_votes": 3,
      "publication_date": 20141106
    },
    {
      "title": "So far 30 pages read",
      "text": "So far...only read about 30 pages or so! So...why don't you ask again in about 8 - 10 weeks... I'm reading about 5 books right now and have a couple of book reports to write as I complete each one.... Thanks!",
      "rating": 3.0,
      "verified": true,
      "author": "ssands1",
      "helpful_votes": 0,
      "publication_date": 20140902
    }
  ],
  "product_meta": {
    "title": "The Dash Diet Health Plan: Low-Sodium, Low-Fat Recipes to Promote Weight Loss, Lower Blood Pressure, and Help Prevent Diabetes",
    "rating": 4.2,
    "specifications": {
      "Item Weight": "10.4 ounces",
      "Paperback": "216 pages",
      "ISBN-10": "1623150248",
      "ISBN-13": "978-1623150242",
      "Product Dimensions": "6 x 0.49 x 9 inches",
      "Publisher": "Rockridge Press; Gld Edition (September 18, 2012)",
      "Language:": "English",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Books",
      "Diets & Weight Loss",
      "Health, Fitness & Dieting"
    ],
    "price": ""
  }
}