{
  "website_summaries": [
    {
      "verdict": "You’ll never have to worry about choking on harsh fumes or mold regrowth again, as it kills mold at the root while eliminating musty fungus smells.",
      "pros": [
        "Bleach-free formula",
        "No toxic fumes",
        "Quickly kills mold and mildew",
        "Removes musty mold smell",
        "Odorless",
        "Excellent for a huge range of surfaces",
        "Prevents future mold growth"
      ],
      "cons": [
        "The best mold killer available is one of the priciest"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "No Mold Regrowth",
      "text": "I used it extensively (albeit gently) on a big collection of used hardback books that came from the mainland to live in Hawaii. After a month or so in this humidity (no A/C) mold visibly exploded all over the books (hundreds of them). After treatment and careful drying, the books looked much better and, best of all, no new mold growth. This stuff really works if you have the right application for it. I suspect some people disappointed with this product confuse mold with mildew/\"black mold\". Not sure how it would handle that or if anything even can.",
      "rating": 5.0,
      "verified": true,
      "author": "dominic esteban",
      "helpful_votes": 33,
      "publication_date": 20160828
    },
    {
      "title": "So far so good",
      "text": "My shower was a mold and mildew fiesta. I got this spray based on reviews. So far I have sprayed it evenly all over every surface, scrubbed all the tiles, grout and every nook s nd cranny. Directions say let it dry and it should help prevent future growth. 1. It doesn't smell like anything. Literally. No fumes. Big plus. 2. Mold and mildew come off easily after just a few seconds to few minutes of sitting with this stuff on. 3. As it dries I haven't noticed any film, residue, or stickiness. I'll update this review after I have a chance to see how well it prevents future mold & mildew.",
      "rating": 5.0,
      "verified": true,
      "author": "AJ in DC",
      "helpful_votes": 48,
      "publication_date": 20140802
    },
    {
      "title": "THE MOLD IS GONE, ALONG WITH THE MUSTY ODOR !",
      "text": "Sprayed this stuff on mold that was growing in my crawl space after I had deployed a Mold Fogger Bomb, and the mold literally fell off where I had sprayed. I have had a musty odor in that crawl space for over 20 years, and after using this stuff, as well as the mold fogger, both the mold and the musty odor are gone. I would not hesitate to purchase this product again, if I'm ever confronted with the same problem again. I'm not an expert on mold by any means, all I know, is that I'm very satisfied with the results that I got from using this stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Myers",
      "helpful_votes": 27,
      "publication_date": 20150716
    },
    {
      "title": "Waste of money",
      "text": "A product that I can’t use without purchasing another bottle is worthless to me. The pictures show how it came out of the box. I don’t know if freezing changes the chemical composition, but if you live in a cold climate you may want to research that first. The liquid inside came frozen solid. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "JeM",
      "helpful_votes": 7,
      "publication_date": 20190109
    },
    {
      "title": "Product doesn't work!",
      "text": "This product was very disappointing. I was under the impression that it would be capable of removing black mold on walls in the bathroom. After applying 3 separate applications, there was no visible improvement whatsoever. Don't waste your money!",
      "rating": 1.0,
      "verified": true,
      "author": "mochtou",
      "helpful_votes": 12,
      "publication_date": 20171203
    },
    {
      "title": "Useless",
      "text": "Was having trouble with a few items hanging in our basement. Suitcases, etc. Followed direction and maybe 10% of the mold was gone. THen bought Armour mold. A light spray and mold disappeared. Haven't seen any reappearing mold in 2 months.",
      "rating": 1.0,
      "verified": true,
      "author": "betsy williams",
      "helpful_votes": 8,
      "publication_date": 20181019
    },
    {
      "title": "Awesome stuff! Works great!",
      "text": "Sunroof started leaking water into our car when it rained and caused some mold/mildew in our car. Used so many diff things to help esp w the smell, but nothing seemed to work, or would just temporarily last a few days before the mildew smell came back and had to start all over again. Came across this and after the first use there was no more mold/mildew smell. It’s been a little over a month and it still hasn’t returned. Very happy w this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180704
    },
    {
      "title": "Mold be gone",
      "text": "Yes I love this product. My house is like a mold magnet. I have one closet that’s had mold growing in it for quite sometime. I was finally able to clear it out to clean. I bought this and it works great. I had to do several coats for cleaning because it was black mold. Unfortunately, the mold has stained my walls so I’ll have to repaint come spring but it looks 10x better than what it did. I’ll be using this product again for all my mold growth in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaimie",
      "helpful_votes": 2,
      "publication_date": 20191207
    },
    {
      "title": "Siamons International 025/036 Concrobium Mold Inhibitor Spray",
      "text": "OMG this really works! I targeted some small areas that had mold and it destroyed them in a week. Those areas the mold returned in tiny spots but after more sprays, stopped them cold. Trying it on my friend's walls. Adaptable spray head-long spray or spurts. RECOMMEND: one bottle covers four walls, approximately 8feet long and 10feet high. Use it twice a week (let it air dry). Siamons will email you as soon as your order is processed with suggestions for use. Very good customer support.",
      "rating": 5.0,
      "verified": true,
      "author": "Allen NakagawaTop Contributor: Camping",
      "helpful_votes": 7,
      "publication_date": 20170730
    },
    {
      "title": "Does it's job!!",
      "text": "I lost power for a month in my mobile home. Alot of rain during that month too and the mold started growing on the window sills. I used bleach which didn't work day after day. Found this on Amazon and started spraying the window sliders. Worked just like most of the reviewers wrote. Spray it and let it dry. Get a quip and take out the mold easily. I'm going to purchase another one today. I have mold on my concrete too. Never noticed any smells with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Karmajane ",
      "helpful_votes": 2,
      "publication_date": 20190319
    },
    {
      "title": "I think it's going to work.",
      "text": "Our bathtub caulking was totally covered with black mold. This was a last-ditch effort to avoid replacing the caulk. I've been spraying the caulk 2x/day most days for a month. Although the mold may never disappear completely, the tub looks 100% better and I plan to keep using the product and see if it will entirely kill the mold. I haven't found anything else that would even begin to remove the mold.",
      "rating": 4.0,
      "verified": true,
      "author": "Staci",
      "helpful_votes": 2,
      "publication_date": 20190623
    },
    {
      "title": "Wonderful product!",
      "text": "If you have mold somewhere, buy this product! It is easy to use, quickly stops the growth and actually puts a protective layer to help prevent future growth. My son used it in his garden apartment after a heavy rain on the dry wall and baseboards as well as the floor, it put a nice protective layer and no mold growth. I used it in my house when I discovered our shower had been leaking and the subfloor had mold. It killed the mold after the first application! Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "LSC",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "I had some bad mildew that formed on my seat cushions of my ...",
      "text": "I had some bad mildew that formed on my seat cushions of my boat over the winter. I have used other products in the past, but I will say this one has worked the best. I got about 95% of the mildew removed. I had to do 2-3 times on some trouble spots. Majority of the mildew was removed by simply spraying on and wiping off after a few seconds. The more trouble spots I let sit for 10+ seconds and do a little heavier wiping. Overall great product, I am hoping that I can clean the seats with this in the fall to prevent the mildew buildup from happening in the first place.",
      "rating": 5.0,
      "verified": true,
      "author": "sagmanaur",
      "helpful_votes": 3,
      "publication_date": 20180605
    },
    {
      "title": "Eliminated odor in classic car interior!",
      "text": "I recently bought a 1951 Pontiac Chieftain that had been sitting in a garage since 1969. The interior is in good condition but had an extremely overpowering mold/mildew smell. I found Concrobium after searching for mold/mildew removal methods that wouldn’t damage the upholstery. I spritzed some on the carpet, seats, headliner, and door panels and left to let it dry. When I came back an hour or two later, THE SMELL WAS GONE! I still can’t believe it! Yes, I still have to thoroughly clean the interior, but I thought that smell would never come out. I’ve never been so thoroughly satisfied by a product!",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle Robert Kruszewski",
      "helpful_votes": 2,
      "publication_date": 20180902
    },
    {
      "title": "Spotty, did not get most of the mold on my back door.",
      "text": "I had black mold covering my back door. I saw this product on a Youtube video and thought I would give it a try instead of using bleach. I tried it three times over a couple of weeks when the door was dry I soaked the portion with the mold in this product. In some spots the mold was completely killed. 12% of the door. The rest of the door still had the black mold. I used dish soap and a wash cloth that worked much better. I'm probably going to coat the door in bleach next.",
      "rating": 2.0,
      "verified": true,
      "author": "Excelsior",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Mold remover",
      "text": "I had mold all over the bottom half of my wall in a closet and this product completely removed it and it is very safe to use. I respray at about every couple months and it is never developed mold and mildew again. I would highly recommend it to anyone",
      "rating": 5.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "It Works.",
      "text": "purchased this product to use on our mini- split A/C. the amount of mold growing on the blower motor was unreal. we used this product to spray the cooling coil down and the round fan blade. after spraying we used hair dryer to dry the product where we sprayed. checked the next day the mold was gone. works by crushing the mold spores. active ingredient sodium carbonate. same product used under the house. CARL.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl G. Scarbrough",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "This stuff is great!",
      "text": "Have a headliner in a Cessna airplane that had gotten moldy over 40 plus years. Obviously with it being that old and plastic, I was concerned that it would work and save that very expensive part. It did a fantastic job with out hurting the older plastic and it did not require hard pressure or a large amount of work. HIGHLY RECOMMENDED.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "I wasted our money",
      "text": "Sounded too good,too be true, gave it a try. Didn't work. Had to buy bleach. Note: possibly I used wrong. Followed directions best I could.",
      "rating": 1.0,
      "verified": true,
      "author": "The Burlesons",
      "helpful_votes": 4,
      "publication_date": 20190102
    },
    {
      "title": "Used this to control mold prior to removal",
      "text": "I used this to remove mold damaged drywall, I sprayed it down with this first before removing the damaged drywall. It worked great, no complaints.",
      "rating": 4.0,
      "verified": true,
      "author": "Big Dawgs Fam",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "NO GOOD for mild",
      "text": "DO NOT GET FOR MOLD! I used this product as directed on my trailer. Mold did not go away. Just use diluted bleach I works and is cheaper. The spray nodal did not work after two uses. So has to dump out on a sponge. REALLY?",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Works well on mold",
      "text": "I have been using this product for a few years now. It removes visible mold instantly with no bad odor. It does not irritate skin but rubber gloves are recommended when using it. I've used it indoors and outdoors as well. It's my \"go to\" product when I spot mold. It does not seem to discolor paint.",
      "rating": 5.0,
      "verified": true,
      "author": "Joed",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Definitely works!",
      "text": "If you suspect mold, see visible mold, or suspect mold illness, this is what you need. I'm severely allergic to mold & this stuff helps me BIG TIME. & I've tried many products.",
      "rating": 5.0,
      "verified": true,
      "author": "Hollywood",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Amazing",
      "text": "This product is very amazing. I have been having a problem with mold growing on my wall every time that it rained. I had been using bleach because the media teaches you that bleach will kill mold. Every week with no fail the mold would regrow. So far with one session of the spray. I sprayed it on the mold and watched the mold just slide off the wall, no elbow grease needed. I wiped the newly de-molded wall down and sprayed the area once more for good measure. A week later no mold regrowth.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Le",
      "helpful_votes": 9,
      "publication_date": 20140317
    },
    {
      "title": "Might as well use hot water and soap.",
      "text": "Might as well be water in a bottle. Tried using it in two occassions to fight mold and nothing happened. Doesn't penetrate deep, probably only fights easy/weak mold. I'd recommend getting the RMR-86 on Amazon, it works much better but costs a lot more..",
      "rating": 1.0,
      "verified": true,
      "author": "Taz",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Arrived leaking",
      "text": "This product arrived leaking in the package. Decided to keep bcs returning would involve sending a liquid in a paper box and didn’t seem like worth the hassle. Products did take the mold out, but wish the packaging was done better.",
      "rating": 1.0,
      "verified": true,
      "author": "KK",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Leaking and no directions on back",
      "text": "This came to me leaking with no instructions or label on the back of the product like normal when I’ve bought it at the big box hardware store. Makes me think it maybe isn’t new. Won’t buy this online again.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Hansen",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "I battled mold around my windows caused by excess condensation ...",
      "text": "I battled mold around my windows caused by excess condensation all winter. I used bleach not knowing I was adding to the problem instead of getting rid of it. This stuff did the job!! It worked so well that I turned my property management on to this product.",
      "rating": 5.0,
      "verified": true,
      "author": "A P",
      "helpful_votes": 12,
      "publication_date": 20150511
    },
    {
      "title": "Concrobium is by far the only thing that stops black mold!",
      "text": "Works great! I didn't have a tremendous amount of black mold....I used this plus this brand's mold stain remover. Together they worked amazing. After watching numerous YouTube video's on what is the best product to remove mold and hands down Concrobium it the product to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy D",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Nontoxic, no scent, and it works",
      "text": "I used this product to clean mold and prevent new mold inside our 25-ft. boat that had been in storage for 2 years. There is no odor, while using or afterwards, the product is nontoxic, and it's effective. I looked up the active ingredient, and it's the same as used in water softeners, just formulated to be in a fine spray. Nontoxic was important in the small confines of sleeping berth and galley in a boat cabin. Got rid of the moldy smell too, and didn't leave any new odor from the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Val R.",
      "helpful_votes": 2,
      "publication_date": 20180909
    },
    {
      "title": "Just Spray Mold Away",
      "text": "My shower has tiny tile and the grout turns black with mold. I just sprayed this product on all of the black surfaces, let is stand for 20 minutes. When I came back, the grout was bright white all over, and no mold was present. I rinsed it down and had no unpleasant odor after a half hour The best mold product I have ever used.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Holuta",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Applies easy",
      "text": "Arrived quickly good price time will tell if problem comes back",
      "rating": 5.0,
      "verified": true,
      "author": "ANDY K",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "remember to gear up",
      "text": "Removes mold with ease. Haven't tried with black mold. Put on some gloves, mask and protective eye wear, get some paper towels. Mold wipes off like it's nothing with this sprayed on. But like every other reviews says, some mold spots will have stains.",
      "rating": 5.0,
      "verified": true,
      "author": "Keenan",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "A waste of my money.",
      "text": "Does not work. I still have the bottle sitting down on my bathroom floor. The only thing I see work for mild is bleach, so I am back to bleach.",
      "rating": 1.0,
      "verified": true,
      "author": "Shereen",
      "helpful_votes": 3,
      "publication_date": 20190320
    },
    {
      "title": "Great product:  Update",
      "text": "I love this product. Mildew has been a perennial problemin storage areas in our home (in the woods, in the steamy South). I've used it for several years, and it is effective and safe. UPDATE: I still love it. Many reviewers misunderstand the product. It does not claim to remove the stains; it actually kills the mold! Some products such as chlorine bleach may remove the stain, but the mold keeps working so returns more quickly. I may get some of the aerosol form because it can get very difficult to continue to pump for older arthritic hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Caro",
      "helpful_votes": 0,
      "publication_date": 20160805
    },
    {
      "title": "It works. I do recommend.",
      "text": "I used on pontoon seats and it seems to remove the mold and get rid of the smell to. I use it in the spring after uncovering the boat then again in the fall before covering the boat and I think keeps the mold from returning through winter months.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "have already tried natural things like peroxide and vinegar",
      "text": "If you are looking to remove the sight of mold in bathtub/showers including caulk and walls/ ceiling, this is not the product. Still on the search... have already tried natural things like peroxide and vinegar, with no luck. Might get Vital Oxide.",
      "rating": 2.0,
      "verified": true,
      "author": "Cherry Blossom",
      "helpful_votes": 7,
      "publication_date": 20150912
    },
    {
      "title": "So disappointed",
      "text": "So disappointed. I have tried this product 3 times on the same moldy/mildest spot. No improvement whatsoever.",
      "rating": 1.0,
      "verified": true,
      "author": "Nana",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "The best for mold",
      "text": "After three floods in my basement as I have no drainage..We use the bottle of the spray to prevent mold It was amazing how nothing ever got moldy! I cannot be without this for my basement",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon White/Smith",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Didn't work as expected",
      "text": "We are dealing with mold growth around our shower. After deep cleaning and applying this product on the molded areas, it still continues to grow. I am not sure if this product works at all, to be truthful.",
      "rating": 1.0,
      "verified": true,
      "author": "Yadee",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Effective",
      "text": "I recently moved and my wallpapered bathroom had a lot of mold especially in the tub and shower. I had a mold expert come out and he told me to save my money and to get this instead. It works pretty great! Most of the mold is gone. It’s a temporary solution to a problem we need to address in the near future.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Worked perfectly.",
      "text": "Had mold growing on vinyl siding. Sprayed concrobium on the siding, let dry for 24 hours and washed off with garden hose with nozel on high with minor wiping with soft rag. Perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "RMT",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Quality Mold Remover.",
      "text": "A friend and long time FL resident recommended this and I recommend it to you. Just immediately kills the mold. Wipes off easily. Simple, straightforward, quality product that does exactly what it’s supposed to do.",
      "rating": 5.0,
      "verified": true,
      "author": "Brades",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Nothing works better than this mold spray!",
      "text": "Love this MAGIC mold spray! It gets rid of mold easily and has no odor! Besides, it can easily remove old paint, or other kinds of stains off the tub, glass door, and what have you.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann  X",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Didn’t work",
      "text": "This didn’t really work for mold under the carpet in my car. Masked the musty smell for a while, but didn’t kill the mold even after using almost the entire bottle over the course of a week. Also left white stains on the fabric it was sprayed on. I was able to remove them but definitely leaves a residue where it is sprayed",
      "rating": 3.0,
      "verified": true,
      "author": "Rachael",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Chose over other brands",
      "text": "It had good reviews, so I hope it works that well",
      "rating": 5.0,
      "verified": true,
      "author": "Dianne Whiteheart",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Not for mold removal",
      "text": "I got it based on several reviews here and the high rating of this product at Environmental Working Group (EWG) cleanliness guide. Per EWG, this is one of the best mold control with no harmful chemicals, allergens, and carcinogens. However, it was a complete failure on bath tub and tiles, where the probability of mold is always the highest. This is certainly not a mold removal product but maybe suited more for wooden surfaces to spray before the mold can create a havoc there.",
      "rating": 2.0,
      "verified": true,
      "author": "Kanishk",
      "helpful_votes": 4,
      "publication_date": 20140621
    },
    {
      "title": "Effective mold solution",
      "text": "We had lots of nasty black mold on our shower grout when we moved in and the Concrobium nearly eliminated it all! I definitely recommend scrubbing with a Concrobium soaked brush after spraying the grout. The smell was not overpowering, despite the deep cleaning ability. I was surprised to find out that I needed to spray it on a dry surface and wait for it to dry again before scrubbing. This made the cleaning project take a longer time than expected, but it was well worth it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer B.",
      "helpful_votes": 0,
      "publication_date": 20151010
    },
    {
      "title": "Works well, easy to use.",
      "text": "Used for killing the mold on my boat cushions and and belowdecks. It didn't remove mold stains, nor is it supposed to. I followed up with their Mold Eraser, which did take care of almost all of them without scrubbing, then re-applied Mold Control. It's non toxic and less harsh than chlorine-based products, nice when you have to worry about contact with fabrics., or yourself.",
      "rating": 5.0,
      "verified": true,
      "author": "E.G.",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Great product to stop mold.",
      "text": "This product is amazing. Just follow the directions on the bottle and remove all visible mold before applying this product. I have used it in our shower, on our trex deck and on white PVC fencing. I can not tolerate the smell of bleach or other strong chemicals and this is fine for me to use. It really stops mold from coming back when used as directed.",
      "rating": 4.0,
      "verified": true,
      "author": "judith",
      "helpful_votes": 9,
      "publication_date": 20140220
    },
    {
      "title": "Its okay",
      "text": "Easy to use and cleans mold or mildew off the bathroom walls but the mildew/mold comes right back in the same spots. It doesnt completly get rid of it.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Caution:  It will stain fabric",
      "text": "I bought this to remove some mildew from a cushion that I had laid a wet sweater. I thought it may remove the black mildew. Instead it stained the ivory canvas seat fabric where I sprayed it. Maybe it works better on hard surfaces, but do not spray in on fabric or upholstery unless you want a tea colored stain ring when it dries.",
      "rating": 3.0,
      "verified": true,
      "author": "Dman",
      "helpful_votes": 3,
      "publication_date": 20160116
    },
    {
      "title": "Don’t waste your money!",
      "text": "This did absolutely nothing on my tiles! Did not get rid of the mold or mildew what a waste of money. I seen it on the Sunday morning channel 9 news and they recommended it. I found it was not worth my time.",
      "rating": 1.0,
      "verified": true,
      "author": "Tony Garcia",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Not too sure",
      "text": "I'm not too sure about this product. I used it and didn't really notice a difference. Will try again and make an updated review.",
      "rating": 1.0,
      "verified": true,
      "author": "Leah",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Tap water works better than this.",
      "text": "I want to know how I can get reimbursed for my time it took to write this review. A product that never should have been.",
      "rating": 1.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "great combination with the mold eraser....",
      "text": "I gave this four stars only because it is maximized when used in combination with the Mold Eraser. I used this on canvas panels for my hybrid camper. I followed the directions and saturated the areas with mold and let it sit and dry. While it didn't touch any of the stains, IT WORKED GREAT IN CONJUNCTION WITH THE MOLD ERASER THE NEXT DAY. The combination of the two products has left my canvas looking like new. This is great product!",
      "rating": 4.0,
      "verified": true,
      "author": "Michael M.",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Still satisfied a year later",
      "text": "We found a large patch of mold behind our bed and treated it with this spray over a year ago. It has not grown back. It is by far better than any other product we tried. I'm back to buy another bottle for a different area of the house where we found more mold. The key is to follow the instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "SarahLiz",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "It's a great alternative to using Clorox .",
      "text": "I'm using this for cleaning mold off outdoor furniture and door. I found that pouring some into a bowl and using a small scrub sponge works well and without as much waste as when just spraying!",
      "rating": 5.0,
      "verified": true,
      "author": "Anne Lise Buch",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "It does a decent job.",
      "text": "Firstly, the shipping speed is terrific! I got this in like 10 hours. It helped with the mold but still some are remaining. You can apply more after the first apply and it should work pretty good for your bathroom.",
      "rating": 4.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Works great",
      "text": "Works fantastic. I had mildew in my Jeep and this product removed it and the odors with no chemical smell left behind. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Crabbs",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Worst purchase ever",
      "text": "This product seems like I’m spraying tap water to the molds. Not only it doesn’t stop the mold from growing, I notice the mold grows back after a few days. Also it doesn’t act as a deodorant since the smell is still there. Absolutely useless, and a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "lem0nade",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Awesome product.",
      "text": "This stuff is awesome. I have an older home without central air, and have the occasional mold issue. This stuff stops it in its tracks. It doesn't make it dissappear, but it definitely keeps it from spreading. I have been using it for years after a contractor told me about it. They really should advertise it.",
      "rating": 5.0,
      "verified": true,
      "author": "C W",
      "helpful_votes": 2,
      "publication_date": 20160518
    },
    {
      "title": "It works fine with mold but not the oddor",
      "text": "It works fine and definitely can contain the growth of mold but there’s not scent and it does not eliminate the mold odor whatsoever. I will have to buy other products for the oddor",
      "rating": 3.0,
      "verified": true,
      "author": "Elgis Q.",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "It seems to work.",
      "text": "Along with other things such as a new filter on the furnace in combination with the Mold Spray and bleach we are no longer sick It seems our house was contaminated.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn Iverson",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Mold control spray",
      "text": "I think this product may be good to control mold, but not sure. A home inspection person told to buy it to get rid of some mold that was in the basement of my house I just bought . It does not kill it if the mold is already there.",
      "rating": 3.0,
      "verified": true,
      "author": "dsdrdh",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "Works well",
      "text": "Really got the grass and dirt stains from my deck steps",
      "rating": 5.0,
      "verified": true,
      "author": "Barb H.",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Works Great, Finally Mold Gone!!",
      "text": "I have had some stubborn black mold on my concrete wall and I have tried many products and power washed etc to remove. This stuff works great. I had to apply it a few times in some really bad areas that have been there for years but that;s OK as long as it kills the roots of the mold which it appears to do.",
      "rating": 5.0,
      "verified": true,
      "author": "LUVNROSE",
      "helpful_votes": 2,
      "publication_date": 20160316
    },
    {
      "title": "Good for fabrics",
      "text": "This works well. Used it on fabrics, let it dry washed and fabrics came out with all mold gone.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Doesn't work in my bathtub",
      "text": "I used it for a while it doesn't kill mold well, sometimes at all. It doesn't have any odor. But other products with chlorine kill mold fast but they have mild chlorine odor.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 2,
      "publication_date": 20180809
    },
    {
      "title": "Temporarily removes mold",
      "text": "Does not prevent mold or remove mold stains. Will temporarily remove mold. Does not deliver as promised.",
      "rating": 2.0,
      "verified": true,
      "author": "earleville1",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Does not get rid of Mold/Mildew",
      "text": "This product is not bad but does not get rid of mold like it says it does. Yes, it will go away but comes back and you have to use it often .",
      "rating": 3.0,
      "verified": true,
      "author": "J REVIEW",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Not bad",
      "text": "Trying to remove mold from bathroom ceiling. Still have to try again. It removed some, but not all. Glad there’s no fragrance. Took long to receive it.",
      "rating": 4.0,
      "verified": true,
      "author": "Cory",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Does not work",
      "text": "Might as well spray water on the mildew because that's all this does is wet the mildew it's still there",
      "rating": 1.0,
      "verified": true,
      "author": "Earl F.",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "A good product without too much smell.",
      "text": "This product works well but does require a lot of elbow grease to get it going. A double washing however did the trick for my basement wall where the window leaked. Painted over it after it had completely dried with a paint designed for mold and or mildew, and so far so good. I will keep this product on hand for use at cottages as well. I felt safe using it with pets in the house.",
      "rating": 5.0,
      "verified": true,
      "author": "King Reader",
      "helpful_votes": 3,
      "publication_date": 20140624
    },
    {
      "title": "Works as advertised. Amazing!",
      "text": "Worked better than anything else I tried (including a pressure cleaner and several other cleaners) for removing heavy mold from the siding and plastic gutters of a Florida house.",
      "rating": 5.0,
      "verified": true,
      "author": "JustDave1",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Average cleaner",
      "text": "I purchased this because it came highly recommended. I don’t think it was any better than any other cleaner. I wouldn’t buy again.",
      "rating": 3.0,
      "verified": true,
      "author": "Frenchie P",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Awesome for Musty/Moldy smells.",
      "text": "This stuff is awesome.. Had a popup camper which sat for quite awile. The musty smell and obvious mold was terrible.. Two bottles of this stuff on the fabric and drapes and all was great. Would buy this again and will recommend!",
      "rating": 4.0,
      "verified": true,
      "author": "Brett",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Works as advertised",
      "text": "I got this to spray on my knee brace after tennis so it wouldn't smell so quickly and spare the number of times I'd need to wash it. It works. Instead of an unbearable smell after just a couple of matches, I use 3-5 spritz on the brace and can easily go a dozen matches without needing to wash it. My best guess is this does as it says and kills the bacteria.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremiah",
      "helpful_votes": 0,
      "publication_date": 20151114
    },
    {
      "title": "Dont really know if it works",
      "text": "I was recommended this product through a youtube... Can someone tell me how long will this kick in after i spread on ???? I dont see the diff.",
      "rating": 3.0,
      "verified": true,
      "author": "Joyanne",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Appears to work",
      "text": "Appears to have stopped the mold from spreading. Did not seem to have bad fumes.",
      "rating": 4.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Product works well on wet carpet",
      "text": "I used this on a patch of carpet that became wet after a big spill. No mildew or mold!",
      "rating": 5.0,
      "verified": true,
      "author": "Colleen Marie",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "poor product",
      "text": "Very disappointing. Ultimately, could not use this for eh intended purpose. Big hassle and big mess.",
      "rating": 1.0,
      "verified": true,
      "author": "DavidG",
      "helpful_votes": 2,
      "publication_date": 20190221
    },
    {
      "title": "Follow directions, does what it claims.",
      "text": "Redwood panel siding with green mold/mildew, followed directions with 3 applications and it's gone. Couldn't ask for a better product.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis G",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Item arrived in bad/previously opened condition!",
      "text": "Item came in broken/taped condition! I did not bother to use it!",
      "rating": 1.0,
      "verified": true,
      "author": "DN",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Worked ok took a while",
      "text": "Wish it worked better but I used it on a cellar corner . Only after I got a gallon did mold die",
      "rating": 3.0,
      "verified": true,
      "author": "Tina P",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Tore out the bad drywall- sprayed with the Concrobium and put a fan ...",
      "text": "Zapped the mold that formed after a drain downspout poured an entire spring season of rain next to the exterior wall of our house and it resulted i a large mold problem. Tore out the bad drywall- sprayed with the Concrobium and put a fan on it for a week to finish drying-nearly a year now and all is good. No recurrence of any mold.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah A. Banas",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "it may be good at preventing but i needed it to remove mold ...",
      "text": "this was ok. it didn't kill the mold that it was supposed to. guess nothing really kills mold unless it has bleach. this doesn't have bleach. it may be good at preventing but i needed it to remove mold without scrubbing. maybe i needed to scrub. i was just used to using something with bleach with no scrubbing.",
      "rating": 4.0,
      "verified": true,
      "author": "Ulnek",
      "helpful_votes": 0,
      "publication_date": 20160210
    },
    {
      "title": "Works fast",
      "text": "We had some wood furniture being stored in our garage, bad idea for our humid weather, but this got all of the mold right off of it, including the backing to the dressers.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy D",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "I'm a loyal Amazon customer",
      "text": "This did the job I was very impressed with it.",
      "rating": 5.0,
      "verified": true,
      "author": "I'm who I am.",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Worthless!",
      "text": "I tried this spray on 2 different types of mold. Specifically, tub mildew and air conditioner mold. Nothing. Had to clean them out with bleach as this spray did NOTHING.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Worked Well as a Cleaner",
      "text": "I finally tried this yesterday, and I was quite impressed. It doesn't smell at all. I used it as a cleaner and sprayed on my rag and wiped the mold, and it cleaned away the mold nicely off my wall paper and painted surfaces. I will give an update later to let you all know if this product helped prevent regrowth of mold.",
      "rating": 5.0,
      "verified": true,
      "author": "P Gee",
      "helpful_votes": 2,
      "publication_date": 20160125
    },
    {
      "title": "good product",
      "text": "applies easily, will revisit if it kills the mold, just began using it 11/14/2019",
      "rating": 3.0,
      "verified": true,
      "author": "Xman",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Highly Recommended",
      "text": "I use this twice a year to prevent mold growth in my shower and it works great. Just sprayed on, let it sit overnight, then with a very lightly moistened sponge go over the job to get rid of all the residue drips and spotting marks. Love this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Lovemonger1",
      "helpful_votes": 2,
      "publication_date": 20160303
    },
    {
      "title": "Very disappointed.",
      "text": "Did not remove the mold from my shower floor. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "cathrak",
      "helpful_votes": 3,
      "publication_date": 20180618
    },
    {
      "title": "SALT AIR AND HUMIDITY",
      "text": "I just used this week ens @ beach house. very damp and humid..if works will buy by case!!!!",
      "rating": 4.0,
      "verified": true,
      "author": "varchia",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Don't waste your money",
      "text": "Did not work. Used regular tilex and destroyed the mold. Should mot have wasted my money.",
      "rating": 1.0,
      "verified": true,
      "author": "Brent E.",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Good mold remover.",
      "text": "Discovered mold on tile shower ceiling. This stuff eliminated it perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Gregory",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Makes my life easier.  Love this stuff.",
      "text": "Use on my bathroom walls to prevent orange gooey stuff from showing up for a long time. Also spray shower once a week and never have to clean it.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "It doesn’t work.",
      "text": "It didn’t seem to do anything. I would not purchase this again.😐",
      "rating": 2.0,
      "verified": true,
      "author": "Mickie Jennings",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Effective Product",
      "text": "This is a great product. I would purchase again without hesitation because it is effective. Doesn’t just mask mold odor but really seems to kill it off with easy application.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly J. Huebner",
      "helpful_votes": 0,
      "publication_date": 20181113
    }
  ],
  "product_meta": {
    "title": "Concrobium 25326 Mold Control Spray, 32 oz",
    "description": "Concrobium mold control effectively eliminates existing mold, prevents mold re-growth and eliminates musty odors with no harmful chemicals. Ideal for homes, buildings, boats and cars. Works on drywall, wood, composite wood, plastic, concrete, shakes, metal, brick, stone, tile, grout, fabric, furniture and many more surfaces. Invisible shield prevents new mold growth. The unique technology is used by homeowners, professional remodelers, contractors and remediates. Concrobium works as it dries by crushing the mold spores at the roots and leaving behind an invisible antimicrobial barrier to prevent future mold growth. Apply Concrobium Mold Control in a thin, even layer over the affected surface. Allow to dry completely. with a Concrobium dampened cloth or brush, scrub the surface to clean away any remaining mold stains and residue. To protect against future mold growth, reapply Concrobium mold control on vulnerable surfaces. No bleach, ammonia or volatile organic compounds. Comes in 32-ounce trigger spray which covers up to 100-square feet.\n\nFROM THE MANUFACTURER\nConcrobium mold control effectively eliminates existing mold, prevents mold re-growth and eliminates musty odors with no harmful chemicals. Ideal for homes, buildings, boats and cars. Works on drywall, wood, composite wood, plastic, concrete, shakes, metal, brick, stone, tile, grout, fabric, furniture and many more surfaces. Invisible shield prevents new mold growth. The unique technology is used by homeowners, professional remodelers, contractors and remediates. Concrobium works as it dries by crushing the mold spores at the roots and leaving behind an invisible antimicrobial barrier to prevent future mold growth. Apply Concrobium Mold Control in a thin, even layer over the affected surface. Allow to dry completely. with a Concrobium dampened cloth or brush, scrub the surface to clean away any remaining mold stains and residue. To protect against future mold growth, reapply Concrobium mold control on vulnerable surfaces. No bleach, ammonia or volatile organic compounds. Comes in 32-ounce trigger spray which covers up to 100-square feet.",
    "rating": 4.1,
    "feature_bullets": [
      "Use to eliminate mold, mildew, musty odors and prevent regrowth",
      "Odorless solution cleans between 80-110 sq. ft. per 32 oz. bottle",
      "Unique mold spray contains no bleach or harsh chemicals, safe for use on a wide range of surfaces",
      "Simply spray onto effected area and allow to dry - no scrubbing or rising required",
      "Concrobium mold control effectively eliminates existing mold, prevents mold re-growth and eliminates musty odors with no harmful chemicals",
      "Ideal for homes, buildings, boats and cars",
      "Works on drywall, wood, composite wood, plastic, concrete, shakes, metal, brick, stone, tile, grout, fabric, furniture and many more surfaces",
      "Invisible shield prevents new mold growth; no bleach, ammonia or volatile organic compounds",
      "Comes in 32-ounce trigger spray which covers up to 100-square feet",
      "EPA-registered formula crushes mold spores as it dries and leaves an invisible, barrier"
    ],
    "specifications": {
      "Manufacturer": "CONCROBIUM",
      "Part Number": "25326",
      "Item Weight": "2.4 pounds",
      "Product Dimensions": "2.6 x 4.6 x 10.7 inches",
      "Item model number": "25326",
      "Is Discontinued By Manufacturer": "No",
      "Size": "32 oz",
      "Color": "_",
      "Material": "Wood",
      "Voltage": "0.01 Millivolts",
      "Item Package Quantity": "1",
      "Water Consumption": "0.1 Gallons per Hour",
      "Number of Handles": "1",
      "Coverage": "80-110 sq. ft. per bottle",
      "Usage": "Inside; Amateur, Inside; Professional",
      "Included Components": "Mold Cleaner Spray",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "Manufacturer Warranty",
      "ASIN": "B000UVGHQK",
      "Customer Reviews": "4.1 out of 5 stars1,050 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#6,276 in Health & Household",
      "Date First Available": "January 16, 2007"
    },
    "categories": [
      "Household Supplies",
      "Mold & Mildew Removers",
      "Tools & Home Improvement",
      "Health & Household",
      "Household Cleaning",
      "Bathroom Cleaners"
    ],
    "price": 9.98
  }
}