{
  "website_summaries": [
    {
      "verdict": "A good option for younger aspiring timbale players or as an additional drum.",
      "pros": [
        "Small 10\" diameter creates a higher pitch percussive sound that stands out from a normal timbale set",
        "Smaller profile is easier to handle for younger students",
        "A great addition to any drum kit"
      ],
      "cons": [
        "Drum head lacks any type of included mounting hardware or stand"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "A surprisingly excellent value.",
      "text": "I wanted to add a 10\" piccolo tom to my kit. I was ready to purchase one made by DW at more than twice the price of this mini timbale. So I came across this little gem on Amazon. At less than 50 bucks, I thought it was too good to be true. Man, I couldn't have been more wrong. This thing is made out of good quality materials with an excellent fit and finish. I replaced the original head with another I had laying around. And I could not be more pleased. Now I'm considering an 8\" to go with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul S.",
      "helpful_votes": 4,
      "publication_date": 20200319
    },
    {
      "title": "You’re going to like it!!",
      "text": "Great addition to your set without spending a lot of dinero.... Nice look Nicely made by PACIFIC/DW 10 inch perfect size AWESOME sound... Adds a lot to your sound... Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Mario ",
      "helpful_votes": 3,
      "publication_date": 20191107
    },
    {
      "title": "Crazily well made for the price",
      "text": "PDP really makes some amazing quality drums for the money. I was so impressed with this little drum, I'd consider buying a full kit of theirs one day. This little 4x10 drum is absolutely real steel because it weighs a ton for being so small. The sound is excellent, and really works great as an add-on tom.",
      "rating": 5.0,
      "verified": true,
      "author": "JuRo",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "LOVE IT!",
      "text": "I have had many timbales. Also some snares hybrid style. I play reggae and like.to have a timbale to the left of my hihat for quick fills. This is the first time i tried a clamp on style because i didn't have room in my current set up for another snare stand with timbale. I expected it to be ok. It is actually amazing! I cranked it up super high and can just pop it anytime. Its my favorite part of my new.drumset. LOVE IT",
      "rating": 5.0,
      "verified": true,
      "author": "Jahred Namaste",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Nice!",
      "text": "This thing sounds pretty good, I was surprised. It has an authentic timbale sound except a bit higher pitched because it is 10\" diameter as opposed to 14\" or so for a normal timbale. For $50 I wasn't expecting a whole lot but I was pleasantly surprised. This is a great addition to any drum kit. The head might be a little on the cheap side and can be dented more easily than most, but even so I am happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Norenthalda",
      "helpful_votes": 3,
      "publication_date": 20170621
    },
    {
      "title": "Great add on drum",
      "text": "Good tom tom sound. Easy to mount to cymbal stand.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer gary",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Small but powerful",
      "text": "Awesome deal. Nice tight punch. A great add on to any drum kit!",
      "rating": 5.0,
      "verified": true,
      "author": "Cortes",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Received product in excellent condition at my doorstep in an extremely timely manner",
      "text": "Received product in excellent condition at my doorstep in an extremely timely manner. They were everything I expected and then some. Mounted on drum kit within minutes of opening package. Very easy to tune and was up and running in no time at all. Less then 5 minutes. Nice product very pleased. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Schooley",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Great Buy",
      "text": "For the price, this is an excellent add-on for versatility; well made, and sounds great. use the Gibraltar SC-LRAC L-Rod Adjust Clamp 9.5Mm for an easy addition to your kit with an awesome timbale sound Well worth the purchase price",
      "rating": 5.0,
      "verified": true,
      "author": "RegularJoe",
      "helpful_votes": 2,
      "publication_date": 20131213
    },
    {
      "title": "Pacific Drums by DW Mini Timbale, Chrome Plated Steel, 4X10",
      "text": "I wanted to have some Latin flavour on my drums and this Timbale has been a pleasing addition to my Mapex drum kit. It sets up comfortably with the rest of the kit and gives that Latin flavour to it. In my opinion it is fairly priced, very good quality and looks. You can have a look and its sounds at [...] under MrLatinDrums. Thanks for Amazon to keep Global Trade alive and kicking!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Carlo",
      "helpful_votes": 2,
      "publication_date": 20120714
    },
    {
      "title": "Good sound for an affordable",
      "text": "Good sound for an affordable, auxiliary piece, although not quite the same as a real timbale. Great for a drummer on a budget, especially when used mainly for accents in reggae, rock, etc.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160915
    },
    {
      "title": "Five Stars",
      "text": "Just as advertised and a great sound for a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward C.",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "Happy Drummer",
      "text": "Gave this as a Christmas gift to my son-in-law who plays in a band. He said it complemented his other druns and is very satisfied with the sound",
      "rating": 4.0,
      "verified": true,
      "author": "teddy",
      "helpful_votes": 0,
      "publication_date": 20160311
    },
    {
      "title": "Pacific Drums by DW Mini Timbale, Chrome Plated Steel, 4X10",
      "text": "Great addition to my set up very well made for the price. Comfortably fits in a limited spot on my rig and gives off that Timbale sound that adds flavor to it. Got to my house quicker than expected. Thanks Amozon. George Materia Rustika Orlando Florida",
      "rating": 5.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 0,
      "publication_date": 20101031
    },
    {
      "title": "great product",
      "text": "it is an excellent addition to our drum set for some of the different rithyms we play with our band",
      "rating": 5.0,
      "verified": true,
      "author": "Jose alfredo jimenez",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Five Stars",
      "text": "These mini timbals are very good, adapt easily to my set of drums and have good sound",
      "rating": 5.0,
      "verified": true,
      "author": "renriqueh",
      "helpful_votes": 0,
      "publication_date": 20141201
    },
    {
      "title": "Five Stars",
      "text": "Great sound, easy to tune. Mounting bracket was too small for my tom tom rack.",
      "rating": 5.0,
      "verified": true,
      "author": "BigIsl.Trading808",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "sounds great!",
      "text": "This Tom came in a very short time and in very good condition for what I paid. With some tuning it sounds awesome. Highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Dan flanker",
      "helpful_votes": 0,
      "publication_date": 20150124
    },
    {
      "title": "Great!",
      "text": "Great sounding little bale. My only complaint is that the mount doesn't fit DW, Yamaha sized Tom mounts. You need to put it on a cymbal stand. Otherwise, great drum, great price.",
      "rating": 4.0,
      "verified": true,
      "author": "Joshua Sutton",
      "helpful_votes": 0,
      "publication_date": 20130409
    },
    {
      "title": "Great buy",
      "text": "Very nice product, seems to be made with good quality. Good price too.",
      "rating": 5.0,
      "verified": true,
      "author": "Monny",
      "helpful_votes": 0,
      "publication_date": 20140713
    },
    {
      "title": "Sounds beautiful, great price, holds up well.",
      "text": "I use it instead of a top rack tom. It adds a special quality of bright singing tone, and clear attack, that really spices up my sound. It's a great investment and the price is very reasonable. It holds up well to extended beatings.",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart W.",
      "helpful_votes": 2,
      "publication_date": 20150630
    },
    {
      "title": "Great addition to my traps",
      "text": "This mini timbale really is the focal point of the trap set of my kit. Very good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Talbot",
      "helpful_votes": 0,
      "publication_date": 20150218
    },
    {
      "title": "Timbale taste",
      "text": "The Pacific Mini Timbale adds a taste of latin to the drum set in a limited space. It mounts easily and its 10 inch diameter produces the sound that adds a salsa feel. You get the Latin flavor rim shot and open tone that will give your beat an authentic feel at a great Amazon price. Highly recommended.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve Drum",
      "helpful_votes": 3,
      "publication_date": 20100131
    },
    {
      "title": "Great Addition to Drum kit",
      "text": "I have this attached to my hi hat stand with a pdp clamp its so great adds versatility to my kit. looking into buying the 8 inch",
      "rating": 5.0,
      "verified": true,
      "author": "DrumLover2013",
      "helpful_votes": 0,
      "publication_date": 20130627
    },
    {
      "title": "Excellent fit and finish",
      "text": "Very well made with that distinctive timbale sound! Very nice addition to my set up! It has the DW quality at reasonable investment",
      "rating": 5.0,
      "verified": true,
      "author": "Richard D. Keesee",
      "helpful_votes": 0,
      "publication_date": 20140527
    },
    {
      "title": "Little Add-On, Great Purchase",
      "text": "I wanted to add some high-end to my toms (I play a PDP 805 kit), and this mini-timbale is the perfect add-on! Great sound for a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Rich1380",
      "helpful_votes": 0,
      "publication_date": 20140129
    },
    {
      "title": "Great Timbale by PDP",
      "text": "Really stellar deal on this timbale. Sounds awesome! I have to say that at half the price I definitely have a great addition to my drum kit!",
      "rating": 5.0,
      "verified": true,
      "author": "MBS",
      "helpful_votes": 0,
      "publication_date": 20110505
    },
    {
      "title": "Solid, at a great price!",
      "text": "Great little timbale for my parade set up. The best price, compared to similiar offerings from other brands. Sturdy shell construct. Timely delivery All good! 😎🎶",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180818
    },
    {
      "title": "Excellent quality and sound.",
      "text": "Highly recommended. Honest seller and great product for the price. Many thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "mel wilson",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Roots Rock Reggae!!",
      "text": "Had to dangerously tighten the skin to get the roots reggae sound I wanted, but I got it. Customized a bracket for it to hang on my electric drum set...wonderful addition! Jag Bless!!",
      "rating": 5.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 0,
      "publication_date": 20201213
    },
    {
      "title": "Tom-bale",
      "text": "Great attack and nice tone out of a \"cheap\" drum. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Savage Henry",
      "helpful_votes": 0,
      "publication_date": 20201209
    }
  ],
  "product_meta": {
    "title": "Pacific Drums by DW Mini Timbale, Chrome Plated Steel, 4X10",
    "description": "Pacific Drums by DW Mini Timbale(Chrome 10 Inches)",
    "rating": 4.6,
    "feature_bullets": [
      "Perfect for incorporating into a drum set, the PDP Mini Timbale provides authentic Latin percussion in a compact configuration.",
      "10 inch size",
      "Country of Origin: China"
    ],
    "specifications": {
      "Item Weight": "5 pounds",
      "Product Dimensions": "12 x 12 x 5 inches",
      "ASIN": "B000GGV2DM",
      "Item model number": "PDMT410",
      "Customer Reviews": "4.6 out of 5 stars72 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#34,574 in Musical Instruments",
      "Date First Available": "July 16, 2004",
      "Hardware Platform": "Nintendo ds"
    },
    "categories": [
      "Drums & Percussion",
      "Timbales",
      "Musical Instruments",
      "Folk & World Hand Drums"
    ],
    "price": ""
  }
}