{
  "website_summaries": [
    {
      "verdict": "The Pelican 1050 is big enough to hold your cell phone along with other valuables.",
      "pros": [
        "Comes with a carabiner clip",
        "Clear lid lets you see what is inside easily",
        "Floats",
        "Has a good seal",
        "Sturdy plastic",
        "Withstands rough usage",
        "Good for boating, canoeing or kayaking",
        "Nice size to fit several items like keys, cell phone or a camera",
        "Latch works well"
      ],
      "cons": [
        "Tested to one meter of water and may not stay dry in deeper waters"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Poor Quality Control",
      "text": "I have used Pelican products for many years, while in the military and also on the civilian side. I've always had great success with the durability of Pelican's products. Until now. Shortly after receiving my new case, I loaded it up for an upcoming kayaking trip. When I opened up the case I noticed \"something\" shoot off. I didn't give much thought to it at first...but then I saw the back of the case, the hinges appeared to be cracking. There are cracks running through portions of the hinges. The \"something\" I noticed from the corner of my eye is a large chunk of the hinge. I am HIGHLY disappointed in this quality of this case.",
      "rating": 1.0,
      "verified": true,
      "author": "The dread pirate Roberts",
      "helpful_votes": 20,
      "publication_date": 20191003
    },
    {
      "title": "Thought this case would stand up to being strapped in ...",
      "text": "Thought this case would stand up to being strapped in the canoe in case of flipping. Of course we did flip and in the five minutes it took us to upright the boat and get back on land this case leaked and ruined a phone",
      "rating": 2.0,
      "verified": true,
      "author": "Rick Hirche",
      "helpful_votes": 101,
      "publication_date": 20160612
    },
    {
      "title": "I used this for when I went SCUBA diving to ...",
      "text": "I used this for when I went SCUBA diving to keep my money and other personal belongings safe, dry, and all in one place. My only complaint is the edge of the plastic latch is sharp, so I cut my thumb. I learned to open the package from the center of the edge not the end to avoid cutting myself.",
      "rating": 4.0,
      "verified": true,
      "author": "young professional",
      "helpful_votes": 9,
      "publication_date": 20170926
    },
    {
      "title": "Perfect little case for life on the road!",
      "text": "I bought 3 of these just over a year ago to hold sets of IEMs while out on tour. I have my regular set in my bass case, then backups in my cord bag and gig bag. They're fantastic, you can stand on the damn thing and it won't flinch. keeps things safe and secure and is easy to open close. The bigger problem is my band-mates stealin' them for their use. I'm about to purchase another slightly larger one that will hold a compliment of emergency backup vacuum tubes...I have no doubt they'll remain secure and safe no matter how poorly the case is treated.",
      "rating": 5.0,
      "verified": true,
      "author": "Burning Skies",
      "helpful_votes": 3,
      "publication_date": 20181009
    },
    {
      "title": "Cusioned and waterproof.",
      "text": "I got my case for keeping my phone, wallet, etc., dry while kayaking. When I first relieved it I submerged it in hot water for 45 mins and cold water for 45 mins. There was zero leakage. The only comaint I have is the caribener broke withing half a day. It is more convenient to tie or strap it secure though. The lid has never popped open from harsh impacts either.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelley Moore",
      "helpful_votes": 4,
      "publication_date": 20190514
    },
    {
      "title": "Great Little Waterproof Case",
      "text": "Perfect size for storing electronics in my boat. I like to put my phone in the case to keep it dry and protected while fishing. So many other possible uses as well. Well made item that will handle some drops and impacts. I do wish you could use a small lock on it. But, it does what it is intended fto do very well. I have always found Pelican products to be of high quality. I have now bought several and intend to use those for hunting and ice fishing items.",
      "rating": 5.0,
      "verified": true,
      "author": "David Jobe",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Excellent water repellent box",
      "text": "Excellent water repellent box. Well made and seemingly indestructible. I am certain that the dimensions listed are for the *exterior* of of the box. However the *inside* dimensions are smaller than I expected. The inside of the box with the included rubber liner measures roughly 6.25 inches (long) x 3.50 inches (wide) x 2.75 inches tall. Of course *without* the rubber liner, the box is about the size mentioned in the listing. I know this is nitpicking, but the box was slightly smaller than my expectations. The box is of superb quality in every way and I have no doubt I will be ordering more of them.",
      "rating": 4.0,
      "verified": true,
      "author": "bvision",
      "helpful_votes": 2,
      "publication_date": 20170910
    },
    {
      "title": "Size measurements are misleading",
      "text": "I ordered this for kayaking based off measurements of my phone and the measurements provided of the box, claiming 6.5 inches in length of interior space. However, the liner takes up a portion of that space, and the box is tapered, giving exactly 6 inches at the bottom without the liner and even less with the liner. My phone fits diagonally with the liner and exactly lays on the bottom with it removed, but I would suggest going up a size in this case for what you would want it to hold.",
      "rating": 4.0,
      "verified": true,
      "author": "Brianne",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "GREAT Case",
      "text": "I have seen video and picture of people abusing these cases, so I am confident of its durability. If it can take a shotgun blast and being kicked around into rocks, its more than adequate for my needs. What I needed this case for was to hold my collection of 18650 batteries in my bugout bag. This case fits a good fistful of 18650 batteries perfectly. They do not rattle around and they arent crammed inside either. Holds 10 batteries give or take. Even my protected Panasonics fit. Beyond happy these even exist, most 18650 cases are flimsy, and not water proof.",
      "rating": 5.0,
      "verified": true,
      "author": "zombird",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Inaccurate dimensions listed in description",
      "text": "Unfortunately, I trusted the listed interior dimensions, which are without the included padding. But if you take the rubber padding out, you lose your rubber seal, or you have to cut up the padding/seal, which isn't convenient or easy to do. So be aware, the actual interior dimensions with the padding in place are smaller, 2 1/2\"x4\"x1 5/8\". Nice little case, if it fits.",
      "rating": 3.0,
      "verified": true,
      "author": "isiton?",
      "helpful_votes": 2,
      "publication_date": 20180904
    },
    {
      "title": "mine was not waterproof",
      "text": "NOT waterproof Used this to protect my phone and key fob on a kayaking trip, wound up rolling the kayak and put this box to the test, when opened after going into the water there was about a tablespoon of water in the case.",
      "rating": 3.0,
      "verified": true,
      "author": "bstew",
      "helpful_votes": 3,
      "publication_date": 20180928
    },
    {
      "title": "Great cigar box",
      "text": "Great cigar box for approx 8-10 coronas, a lighter, and a cutter. Or, fits a galaxy S9 plus somewhat thin wallet and keys. The colored rubber is removable if need be. Wish the latch felt more secure as can be easily opened with a very light come hither. Have used tubing down river latched to my tube with carribeaner. Not clear if its truly waterproof... I wouldn't trust it, but haven't fully tested it yet.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr. Big",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "LID IS NOT CLEAR! Only the latch is clear.",
      "text": "I ordered one of these cases expecting the bottom to be black and the lid transparent as the photo indicates. However, I received a model that is completely black except for the latch which is clear. Amazon was great in sending me a replacement case, however the replacement was also completely black with a transparent latch. I really wanted this with a clear lid so I can identify the contents without having to open the case. Three stars because it's still a nice case and it will do what I need it to do, but it simply is not as advertised.",
      "rating": 3.0,
      "verified": true,
      "author": "Randall",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "Product Quality Issue",
      "text": "I have had this product 5 months with limited use and the latches are already cracking as well as cracks through the hinge pin holes. I'm trying to file a Warranty claim with Pelican but their Web-sight is very difficult to use. I think it will cost more to return it that the thing is worth.",
      "rating": 1.0,
      "verified": true,
      "author": "Randy Harkins",
      "helpful_votes": 2,
      "publication_date": 20180930
    },
    {
      "title": "Good product that has an awful chemical smell when new.",
      "text": "I've bought a bunch of these in various sizes over the year. I have two of them in my jet skis to keep paper and some emergency cash, and I have another one that I use to store my in ear monitors. Over all I think that these cases are good and keep my stuff well protected, but whenever I get a new one the inside always has a really noxious chemical smell that I find really unpleasant. The smell does eventually go away, but it takes a long time for that to happen, almost two weeks of the product sitting out in the open. I really wish that that weren't the case.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 3,
      "publication_date": 20160302
    },
    {
      "title": "Holds eighteen 10ml bottles of essential oils.",
      "text": "Overall I like Pelican products. I need a place to safely store these bottles away from light. Cutting some plastic strips so they hook together was all I needed to do. It is probably overkill and maybe I'll eventually pick up a lightweight case specifically for them. Until then we'll see how it goes.",
      "rating": 5.0,
      "verified": true,
      "author": "Fish",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Is a great buy!!!",
      "text": "It fit a simple set of house and car keys, my IPhone S6 (was the exact size in depth and length inside), go pro, and Wallet. I went river rafting and was getting tossed around quit a bit. At first I had it in the tube with me completely in water. Then hung it on the side of my tube so it got dunked in water quite a bit more. The latch never opened nor did water get into it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nåní Jean",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Perfect to store Bluetooth earbuds",
      "text": "Bought this to store my new power beats3 Bluetooth earbuds I just got. If I’m gonna spend that much on earbuds I want something durable to keep them in. After looking at the reviews I figured this is as big as I would need, and I was correct. They fit in fine with room to spare so I’m thinking the charge cord and a power block will fit in with them no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "darksideemt",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Perfect Size for Phone/Wallet combo!",
      "text": "Bought this for my Can-Am Outlander for when I go trail/creek riding, and its the perfect size for my iPhone 11 Pro Max with wallet and keys in it. Love that its padded too to add a little extra protection. My family are already asking me to order a few for them! I will purchase again!",
      "rating": 5.0,
      "verified": true,
      "author": "Nathaniel E",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "More room than you think!",
      "text": "I bought this to bring hiking and on boat trips. I am able to carry an iphone XR with case, wallets, keys, pen, and gerber multitool. Awesome to be able to see my phone through the clear lid and keep everything dry. The rubber cushion inside helps things from banging around. Great price. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "HoumaGuy",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Worth the price!",
      "text": "I love this case. When I need a durable case, I buy Pelican cases. I also LOVE this color. I bought this case for my EDI meter for ghost hunting as this is an expensive piece of equipment. I have not submerged it in water so I didn’t rate it for water resistance but I have used similar Pelican boxes for cell phone, etc. on dive excursions and they have always kept my valuables dry.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimmie",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Dry box",
      "text": "I got this as a dry box for my daughters kayak. first time I got this amazon sent me a wine bottle tiki kit. like what the heck. that's not Pelicans fault but when I finally did get it, it worked for my daughters phone or whatever she takes with her.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnnie Win-Win",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "A quality sealed case, if that's what you need",
      "text": "You can't really go wrong with a Pelican case. You just need to pick the size you need, pick a color, and find a good deal. This fit all the above and ended being a very good solution for my needs. While this is the smallest version I've purchased, I have other Pelican cases up to suitcase size, have been quite happy with the performance and longevity of each, and would not hesitate in purchasing another for the next time I need something like this. As a side comment, when I can't find a Pelican that is the size I want, I'll also consider Nanuk cases, which are of comparable quality.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Wendler",
      "helpful_votes": 0,
      "publication_date": 20160215
    },
    {
      "title": "Carabiner broke on first use",
      "text": "Scared to say much yet. Carabiner broke first time I tried to clip it in. Pelican used to make top of the line dry boxes..... this one has me nervous. Good size though. Holds iPhone 11pro, cigarettes lighter and keys.",
      "rating": 3.0,
      "verified": true,
      "author": "Amch",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Awesome product",
      "text": "Really nice quality & exactly what I was looking for! I haven’t tested the water durability but I’m not looking to jump in a pool with it so from what I can see if it gets a little wet it will be just fine! Perfect for my camera gear, I might get a bigger size but overall great product! They also include a extra large piece of foam which is nice if you want to play around cutting for different items!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "If you are familiar with Pelican cases, this is not what you are expecting.",
      "text": "It is a Pelican case, but it doesn't have the O-ring and beefy latches you are expecting. It seems sturdy enough but I don't have much faith in the seal, definitely not like the other Pelican cases I have. The tag attached to it says, \"Water Resistant - Dust Proof\". In its defense, it was only fifteen bills.",
      "rating": 3.0,
      "verified": true,
      "author": "NuclearRoy",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Very nice for the price",
      "text": "Bought these for some IEMs. Very sturdy case. Plenty of room for more than one pair of earbuds if you wanted to put in more than just one in a case. Pelican quality. Wouldn't worry about anything you put in there unless you live by a volcano or something. Or run it over with a tank.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Works great!",
      "text": "Works great! We use it to have a cell phone with us as we go tubing down the river so we can communicate if there is an emergency. Other phones have gotten ruined / wet from other systems like bags & pouches but the pelican case is always dry!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bronco6699",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Great small case",
      "text": "I use this to keep all my little electronics i would normally lose track of in. it fits 3 Samsung galaxy S5 phones with thick cases perfectly. I bought this simply to keep expensive little things in and i am impressed with how sturdy it is. if there was one thing bad about it i guess it would be the latches. it requires moderate finger strength to open them, or just pressure on the lid before opening it. I would love to see either a normal pelican case latch like most of their large cases or even a twist latch, but i guess that is harder to do with such a small case.",
      "rating": 5.0,
      "verified": true,
      "author": "Vitreous humor",
      "helpful_votes": 2,
      "publication_date": 20150312
    },
    {
      "title": "ENDLESS  USES !!!!!!",
      "text": "AFTER I Brought ONE of This ....... I ORDER 2 MORE :o)) THEY'RE ALMOST 100% CRUSHPROOF ( NONE of HAVE ) !!!!!! I PROTECT My GLASSES - CELL PHONE - KEYS & FOB AND Much MORE !!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "sgtusa",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Waterproof",
      "text": "I placed it fully underwater for a couple minutes with a napkin inside and it stayed dried. I have an iPhone 8 Plus and it fits only without the case barley because of the length. Fits an IPhone Xr with case perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Mendoza",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Great box for kayaking",
      "text": "Great case I use it when I’m kayaking The carabiner is great to secure the box to my kayak just in case of a flip over. This box fits my iPhone 11 and my keys plus a small portable battery charger.",
      "rating": 4.0,
      "verified": true,
      "author": "RDS",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Good, sturdy case",
      "text": "I bought this to keep a pair of IEMs in. It (despite being \"micro\") is way too big for that, honestly. But I can keep 2 or 3 pairs with a dongle and a USB DAC in it, so it's fine. As for the product itself, it's a good, sturdy case. Maybe a bit bulky, but you can tell that by looking at the picture, so not really a con. I'll probably order one of the larger ones for random electronics or my phone while camping.",
      "rating": 4.0,
      "verified": true,
      "author": "Steven Mooney",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Totally dry and just big enough",
      "text": "Has kept phone, wallet and keys completely dry for several kayak trips now. It's only barely big enough for an Essential PH-1. I doubt a Pixel XL would fit. But it's working great for what I need.",
      "rating": 5.0,
      "verified": true,
      "author": "T.W. Cook",
      "helpful_votes": 2,
      "publication_date": 20180626
    },
    {
      "title": "Small and not sure it floats",
      "text": "Not sure if it floats, which seems like it should be standard, and should be in the description. We will test out this summer I guess. If it doesn’t, then it will have been a complete waste of money. If it’s a boating lock box that sinks to the bottom of the lake, then it’s just a piece of plastic. It’s also extremely small, which I should have noticed. Maybe two cell phones will fit, but that’s it.",
      "rating": 2.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "great case to protect items",
      "text": "great case, liner easily removable giving more space. Closes tightly, not too bulky",
      "rating": 5.0,
      "verified": true,
      "author": "dmitry",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Should have paid more attention to demensions. This fits ...",
      "text": "Should have paid more attention to demensions. This fits an iPhone 6 and a small wallet but I wish it was deeper. Latch is very tight so that's frustrating, but the product works well so I really can't complain.",
      "rating": 5.0,
      "verified": true,
      "author": "Alanna Baugher",
      "helpful_votes": 3,
      "publication_date": 20170823
    },
    {
      "title": "Good Deal and Nice Size",
      "text": "It does all I want it to do, and best part the size since shopping online is not in store like to compare sizes etc. Being in the Fire Service and EMS field I wanted this like all medics have for narcotic control. Thomas packs drug cases are yellow and stat packs are red or yellow. I wanted as a EMT a container to hold my narcan, ASA, glucose, and epi. It able to lock and all drugs are in one case. No issues its great and does its intended job.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert V.",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "... I needed but I kept it because it is super sturdy, closes securely and makes an excellent holder ...",
      "text": "I ended up not using this for my travel because it is too bulky for what I needed but I kept it because it is super sturdy, closes securely and makes an excellent holder for anything that I want to keep secure and enclosed. It does pack neatly but watch the size you choose because it does take up space. I really needed a smaller size and in the end that was the one that I used. I did not test its \"waterproof\" claim but I can attest to the fact that it is very secure and sturdy. I think it could very well live up to its claim of waterproofing.",
      "rating": 3.0,
      "verified": true,
      "author": "Marguerit A. Schwartz",
      "helpful_votes": 0,
      "publication_date": 20151112
    },
    {
      "title": "Rolex Of Cases",
      "text": "Got this cases to protect my in ear monitors (High end earbuds) as well as a set of replacement tips and a stand alone lossless mp3 player. I thought the case that I might be receiving would be too small but I had no problem fitting all that I needed to in the case. The case is built incredibly and manages to still look quite attractive . The Pelican 1010 Micro Case is truly a beast and it being water resistant is just a plus! Would highly recommend if you want to protect small expensive belongings from water, dust and major impacts, just as long as you don't mind the extra bulk of the case.",
      "rating": 5.0,
      "verified": true,
      "author": "Manny Addey",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "waterproof",
      "text": "took this on a kayaking trip. never dunked it in the water directly, but it did get wet and everything stayed dry. used it for a phone, and money. worked great",
      "rating": 5.0,
      "verified": true,
      "author": "susan reeves",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Great price for a great case.",
      "text": "I love it! It keeps my monitors, 2 different cords, my fiio music player and its all safe in there, looking good and protected. Grear price for a great case.",
      "rating": 5.0,
      "verified": true,
      "author": "jorge",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "A great place to store thermometer and other medical instruments.",
      "text": "I bought this case to hold my touchless thermometer and oximeter. They both fit comfortably in it, and are protected from water and other harm.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Great case. Past all test and fits what I need",
      "text": "Love this micro case. I have a bug out bag that goes everywhere with me, I need a small case to keep different medications and bandages with me. I work in a harsh environment and needed something to keep everything dry no matter the situation. This case is small enough to fit in my small bag but big enough for everything I needed it to do. I was able to leave the rubber floor molding in it even after fitting everything I needed. Worth every penny. It's pelican so you know it's going to last. I dunk tested the case for five minuets under water with an antacid tablet just to make sure. Great case.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20140730
    },
    {
      "title": "Very effective, if slightly smaller than expected.",
      "text": "While this isn't fully waterproof, it has done a very nice job of protecting my keys and phone while kayaking, and after a few big waves hitting the box, everything was perfectly dry inside. The clasp on the side seems sturdy, but I haven't put it through the ringer, so I cannot attest to its quality specifically. Overall I would recommend this box. It's a little smaller than I expected, so I might go one size bigger next time.",
      "rating": 5.0,
      "verified": true,
      "author": "ph301",
      "helpful_votes": 2,
      "publication_date": 20150718
    },
    {
      "title": "Great solution for outdoor tv remotes",
      "text": "Fits Roku remote perfectly. We use this case to house our remotes for our outdoor tv and it’s perfect size to fit multiple roku sized remotes.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Dependable, durable, indispensable.",
      "text": "I love me some Pelican cases. I've gotten my whole family using, buying, collecting Pelican cases. From the smallest to some of the largest, they are amazing. They work...always.",
      "rating": 5.0,
      "verified": true,
      "author": "jay watkins",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Perfect to keep cigar lighters dry.",
      "text": "On my deck where I sit to enjoy cigars, while covered, it still gets wet from blowing rain, etc. This case is the perfect size for my notch cutter, lighters and scissor cutter. It stays completely dry regardless of how much rain I get on the deck.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas M. Schaefer",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "GoPro Hero5 black protection for the fashionable adventurer",
      "text": "Pelican cases are always great, but I'm happy that the gopro hero 5 (or go pro hero5, or whatever) fits inside *in the frame* very snugly and safely, lid closing and all. It squashes the side ribs of the padding, but they're hollow, so it's fine - it doesn't require force. Comes with carabiner, looks fancy and professional.",
      "rating": 5.0,
      "verified": true,
      "author": "Mina138",
      "helpful_votes": 0,
      "publication_date": 20170521
    },
    {
      "title": "Great little box",
      "text": "perfect for holding my motorcycle registration in my saddlebags. Always been afraid of them getting wet.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason B.",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Very nice quality",
      "text": "I Love this. I put my passport and written small address book it it. Now I want to get one that holds the size of a notebook for my legal papers. You can grab this in an emergency and clip it to yourself. High quality product at a reasonable price. Just a conscience that I love yellow.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Floats & waterproof!",
      "text": "Floated on the river for 3 hours and everything stayed dry. The case is very sturdy and I imagine will last a long time...however, the carabiner broke, so I will have to replace that. Otherwise, worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer ATX",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "This case is amazing and works exactly as desired",
      "text": "This case is amazing and works exactly as desired. I have the Oticon hearing aids and wanted a case to hold the Oticon case my hearing aids came in, The Oticon case i have fit right in, snug and tight but easily removed. With the Pelican case closed my $7500 aids are protected from damage due to water, dropping, etc and travels well in my carry on bags. The Pelican 1010 case is heavy duty, easily snaps together and has a clip to put it on a back pack if someone desired. I wholeheartedly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "dunck",
      "helpful_votes": 0,
      "publication_date": 20150128
    },
    {
      "title": "very hard to open/close- very loud and brittle feeling",
      "text": "The case may be waterproof/resistant but is just too hard to open and close, it makes a very loud creaking/cracking noise that feels like it's breaking. Seems brittle. I returned it and will use a dry bag instead. much more quiet and easier to use.",
      "rating": 2.0,
      "verified": true,
      "author": "CL",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Perfect size!",
      "text": "We liked it so much to carry registration and insurance card for the Sea Doo so much we purchased one for the other Sea Doo too. A cell phone will also fit inside. Plenty of room!",
      "rating": 5.0,
      "verified": true,
      "author": "C. H.",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Great product!",
      "text": "Can't say enough good things about these cases, I own several sizes and they are durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Romero",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Great for active kayaker",
      "text": "This case is good for someone like me that kayaks and needs to bring especially my phone. It feels lightweight which is good.",
      "rating": 4.0,
      "verified": true,
      "author": "Jill Loomis",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "... and a little iPod nano 6) and it works amazing! Throw this in a bag without worry",
      "text": "I use this to store small electronics (mainly headphones and a little iPod nano 6) and it works amazing! Throw this in a bag without worry, it's great! Recommend getting one of the Pelican 1012 Foam Sets to go with it (two tends to be a bit too thick unless you have something very small and delicate)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "Perfect for a pair of earbuds and some small accessories ...",
      "text": "really well built. Perfect for a pair of earbuds and some small accessories like a splitter or a couple memory cards. To visualize the size, it'll just about hold a pack of cigarettes, not much more. That being said, its going to protect small items really well.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Underhill",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Small",
      "text": "This thing is so small you can only put a small wallet and maybe a set of keys. Not big enough for nothing. May be waterproof, not sure. Wasn't big enough to use.",
      "rating": 2.0,
      "verified": true,
      "author": "Sassykat",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "The camera fit perfect within the case",
      "text": "Purchased this product for my Canon Power Shot S110 prior to going to Hawaii. The camera fit perfect within the case. It was so great to have the camera so well protected while at the beach from sand and rain. The inner section (black) is rubber so it can absorb the shock if dropped. This is no whippy hard case! It is very tough and nice to know that when I cramming as much stuff into my suitcase, I know that the case will withstand the pressure of heavy packing. With S&H this case was well under $20.00 and worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark D.",
      "helpful_votes": 0,
      "publication_date": 20140810
    },
    {
      "title": "Solid case but weak carabiner.",
      "text": "This will be the fourth pelican case I have purchased. Used my others to build fire kits for my other backpacks. Going to use this one to build emergency light kit for my pelican 2210 photo luminescent light and spare batteries etc. solid case but I will change out their carabiner (a Little weak and easily breaks) with a niteize or similar. Next purchase will be the pelican wallet.",
      "rating": 5.0,
      "verified": true,
      "author": "William C.",
      "helpful_votes": 0,
      "publication_date": 20160910
    },
    {
      "title": "Worth it",
      "text": "Product is very compact, and very easy to store on your ATV. I bought this is similar comparison to the more expensive ones, but this one does great. Very satisfied with the product, the coloring, and the amount it can for for being so small. I can fit a cellphone, cigarettes, and my car keys. Worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "Mika",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Great case for Sony RX100 mk 3",
      "text": "Bought this to house my Sony RX100 mk 3 when taking it to concerts mostly. This case fits perfectly and offers great protection. I can fit in the back pocket of most of my jeans, though it is a tight squeeze. Security rarely pats the but directly, and it looks like a wallet. Small cameras are allowed at the shows, but I prefer avoiding the conversation altogether when possible.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Living it in our JetSki",
      "text": "Love it just like our prior one we've had for 12 years except in the larger size, not quite sure why the blue was so much cheaper than yellow, but it's okay save the money. Anybody that says they should glue it in that would be an issue if it actually gets wet and water gets trapped underneath it, that's the reason they probably don't glue it in and also it offers a bigger space if you take it out.",
      "rating": 5.0,
      "verified": true,
      "author": "Deagleonvalium",
      "helpful_votes": 0,
      "publication_date": 20160817
    },
    {
      "title": "Yup",
      "text": "Great little case. I use it to carry some extracurriculars and it’s discrete smell-wise. Exactly what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Saldonius Creekbottom",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Pelican rocks! Good for kayaking/boating.",
      "text": "Use it to keep wallet and cell phone and keys in while on the kayak. Pelican rocks and keeps the price point on all their products fair.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Just what I needed!",
      "text": "This box is perfect for what I want it for: safe cell phone and key storage while kayaking. My iPhone 6 fits perfectly in it and my husband's Samsung S5 does as well. Pelican is a great brand that stands behind their products as well, so it's good to always have that backup. Would certainly buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "SuperGirl33",
      "helpful_votes": 3,
      "publication_date": 20150727
    },
    {
      "title": "Great Protection",
      "text": "It's Pelican so you expect the best. We do field research in swampy areas and rely on cases like this to protect expensive equipment. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Lucille C.",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "I love this box",
      "text": "I bought this as a dry box for holding our essentials while tubing the river. I love this box! big enough to hold keys, camera, id's, money, aspirin & my husbands cigarettes. Completely waterproof & easy to open/close while clipped to our cooler. We never tube without it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 2,
      "publication_date": 20160506
    },
    {
      "title": "Its Pelican, what else to say",
      "text": "Its Pelican. What else needs to be said.... I use it to keep my IEM stored while not being worn. Perfect size and includes a small caribiner which makes it great to hang from a belt loop in/out of gigs.",
      "rating": 5.0,
      "verified": true,
      "author": "aneatrea j bender",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Great for anyone that enjoys water sports.",
      "text": "These are great for anyone that is into water sports. We have several of them and keep them on our boat and jet skis and use them when kayaking as well. I purchased this one as a gift for my Dad and he loves it as well. It's a great case to keep your cell phone in and wallet so it doesn't get wet should it get in contact with water. This size is perfect for a cell phone and small wallet. They have cases in all sizes so I'm sure you can find one to fit your needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20151209
    },
    {
      "title": "Small waterproof box",
      "text": "Just the right size for my oxygen meter. Protects and keeps it dry.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Campbell",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "My fifth, but certainly not last, Pelican case.",
      "text": "I purchased this case to use it as a deck box for a Commander sized deck of Magic: The Gathering cards. By trimming the gasket off of the rubber liner, I was able to maintain the water resistance while using the pick and pluck foam to create a cavity large enough to hold 110 double sleeved cards and the commander in a top loader. This fits quite well, and although it's more bulky than purpose built deck boxes, it provides a level of protection to a deck full of foreign foils that I could not find elsewhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe C.",
      "helpful_votes": 0,
      "publication_date": 20150320
    },
    {
      "title": "Good Quality Product",
      "text": "Have bought this item before. Outstanding place to keep moisture sensitive items.",
      "rating": 5.0,
      "verified": true,
      "author": "SDG",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Tiny Pelican. That means it's good",
      "text": "Nothing really to say. Pelican cases are fantastic and always get the job done. This case does just that. Small, see-through lid, padded inside. Perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "PlungerBaby",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Great Addition to a Drybag while Kayaking",
      "text": "Pelican always makes a really good quality product and this is no exception. I bought this (and the 1020) to keep small items in while kayaking and they are perfect for that role. I don't know how this would perform completely submerged since the description says it is intended for that purpose, but holding valuables, in a drybag, it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160529
    },
    {
      "title": "Too small for G7x",
      "text": "I read some reviews and thought this would fit perfect for my canon g7x, however turns out this is too small, I am not able to close the case and I don’t want to push so hard which might damage the camera. And find out this too late so I can’t return it. Mine is still brand new, can I exchange with a bigger size one?",
      "rating": 1.0,
      "verified": true,
      "author": "kevin cao",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Good for earphone, IEMs",
      "text": "Bought this for my earphone. Good thing is I dont' have to squeeze my earphone into the box just like what I did previously since my older box was too small. Down side is this box is pretty big, better out it in the backpack not the pocket. Anyway as a case it did a very good job, I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Pelican Micro Case : A strong case,  but not 100% waterproof.",
      "text": "Pelican Micro Case : A strong case that I can stand on, but not 100% waterproof. Hinges are strong and reliable.",
      "rating": 4.0,
      "verified": true,
      "author": "JKN",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Very protective and well made. Little difficult to open",
      "text": "This a great little case that I use for my lav microphones. Pleasantly surprised by the rubber interior as I was expecting hard plastic. These things are real sturdy, downside is that they are REAL difficult to pop open at first.",
      "rating": 4.0,
      "verified": true,
      "author": "Taylor S Mefford",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "First Pelican case",
      "text": "Looking for a polycarb case, found the Pelican brand. Liked what I saw and purchased. When it arrived, I was not disappointed. Very nice case. Nice and tight and precisely put together. Well worth the money. If I'm ever looking for another, theirs will be my first pick.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170507
    },
    {
      "title": "Disappointed",
      "text": "Our box leaked we took it canoeing last weekend and our canoe flipped Turn the box back over and it had 1 inch of water in it",
      "rating": 2.0,
      "verified": true,
      "author": "Rho",
      "helpful_votes": 3,
      "publication_date": 20170813
    },
    {
      "title": "Impressed. Will stick with Pelican...",
      "text": "These are really great products! This one is pretty small though. Not much room for anything other than your phone and keys.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Great size. Ditch the carabiner.",
      "text": "The 1050 is a great size. Clear lid is awesome. Clever attachment points. Must have for life outside especially on the river. Highly recommended removing the silly carabiner. It's almost worthless and could snap the case if weged hard. Attach a cord or webbing instead. The 1050 fits neatly inside the 1150 btw. In case you have need of an insane amount of protection!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott M. Toland",
      "helpful_votes": 0,
      "publication_date": 20141015
    },
    {
      "title": "A lot of room",
      "text": "This is the secon Pelican box I have and it is great for my scuba diving trips. It holds my iphone X, wallet, room keys and my action camera on its waterproof housing (very compact)",
      "rating": 5.0,
      "verified": true,
      "author": "Rafael C",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Effective for kayaking",
      "text": "I bought this to store my keys,phone, and sunglasses when I am Kayaking. It fits all three (I have a Galaxy S5) with little issue. I should also mention I have over 10 keys on my key ring as well. The clip feels cheap and I wish it were larger, but the case is really nice and durable. Its very easy to clean the salt water off.",
      "rating": 4.0,
      "verified": true,
      "author": "Emrad",
      "helpful_votes": 0,
      "publication_date": 20150713
    },
    {
      "title": "Fits great in RZR",
      "text": "Use min in a RZR. Fits great in open compartment up front. Happy with the product. It is self-explanatory so I'm not going to write a huge review. It is a box. It is waterproof. It has a clear lid. It is yellow. It takes a decent amount of impact.",
      "rating": 5.0,
      "verified": true,
      "author": "ATX Rooster",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Excellent quality box",
      "text": "These small cases are exceptionally well made and tuff. Now have several in different sizes.",
      "rating": 5.0,
      "verified": true,
      "author": "C.A. O.",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "FRIED MY PHONE",
      "text": "went kayaking and in 10 minutes my phone overheated and it literally fried my $800 iphone!!!! WORST PRODUCT!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Love it",
      "text": "Looking forward to using this on the lake next summer. Recently bought as a gift because a friend has one. It's a great size for several items (phone, wallet, keys, etc).",
      "rating": 5.0,
      "verified": true,
      "author": "Charlotte L Johnson",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Love it!",
      "text": "Love using this with my SUP! Holds 2 iPhone 7 Plus. Very water resistant.",
      "rating": 5.0,
      "verified": true,
      "author": "Shauni",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Good buy",
      "text": "The instructions said not totally water proof but I tested it submerged in the bath tub and everything inside stayed perfectly dry. Definitely a good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "apolla101",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Difficult to open, but similarly difficult for water to ...",
      "text": "Difficult to open, but similarly difficult for water to get in so I guess that's a win! My iphone 8+ fit with a Speck fitted case, but I had to angle it awkwardly and ended up trading in the box for a more convenient bag from sea to Summit since I didn't anticipate needing the hard shell protection of the Pelican.",
      "rating": 4.0,
      "verified": true,
      "author": "H. Branch",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Perfect size Pelican box",
      "text": "Perfect for phones and small items you want to keep dry. I love Pelican boxes I have several",
      "rating": 5.0,
      "verified": true,
      "author": "Joey McCombs",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Excellent Small Storage Case!",
      "text": "Received item as described in a timely manner. Works for me!",
      "rating": 5.0,
      "verified": true,
      "author": "JQS",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Product as described",
      "text": "Use for phone and bulky car keys during boating; is truly waterproof.",
      "rating": 5.0,
      "verified": true,
      "author": "RAM",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Semi-pro Protection",
      "text": "A nice little $10 case that helps protect my DAP & iems. There are beefier cases available but this is nice for its level of (semi-professional) protection. If it saves my DAP after a bad incident I will revisit my review and say five-stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Rocky Mtns",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Keeps my things dry even when I get wet",
      "text": "This holds my camera and memory cards nicely and they stay waterproof when I am shooting videos of moms at this car wash I use as a studio. Great value!",
      "rating": 5.0,
      "verified": true,
      "author": "Lana Del Mar - Electronics & Lifestyle Influencer!",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "Too small for iPhone 7 Plus",
      "text": "Did not test the case in terms of durability and water resistance as pretty much all pelican products are good for this. The gripe I had with this was that this was not large enough to hold my iPhone 7 Plus in its protective case which is why I ended up returning it.",
      "rating": 3.0,
      "verified": true,
      "author": "M. Mena",
      "helpful_votes": 0,
      "publication_date": 20190117
    }
  ],
  "product_meta": {
    "title": "Pelican 1050 Micro Case - for iPhone, GoPro, Camera, and more (Yellow/Clear)",
    "description": "Color:Yellow/Clear| Style:Micro CaseThis water-resistant, crushproof case is ideal for rugged activities. It will keep your expensive GPS, cell phones and other electronics and documents safe and secure.\n\nFROM THE MANUFACTURER\n\n\nANATOMY OF A PELICAN MICRO CASE\n ULTIMATE EQUIPMENT PROTECTION\n For over 30 years Pelican has built a reputation for manufacturing the toughest cases in the world. As a matter of fact, we invented the category. Over these years we've seen our cases used for some fairly crazy activities...and important ones too.\n\n Pelican Micro Cases are created for your smaller items. Micro Cases look and function in the same way as the larger Pelican Cases, but are designed to protect your cell phone, iPod, camera, and other small items. Many of the cases are water resistant and crushproof, or impact resistant to provide maximum protection for your valuables. These cases will get your gear from point A to point B in the condition it's meant to be in: intact and functional.\n\nSTRONGER BY DESIGN\n Pelican Cases are made with a proprietary combination of homo and co-polymers, using an open cell core and solid wall construction, which is stronger and lighter than a solid core wall. Stainless steel pins are used in hinges and handles.\n\nWATERTIGHT\n The secret is the tongue and groove fit with a polymer O-ring acting as a waterproof seal. Some models come with the Automatic Pressure Equalization Valve which balances interior pressure, keeping water out while making the case easy to open.\n\n LINER FOR EXTRA PROTECTION\n Your valuables should be protected on the inside as well as the outside. Pelican Micro Cases contain a shock absorbent liner to minimize damage to contents in tough situations.\n\nMICRO CASE COMPARISON\nModelExterior Dimensions (Inches)Interior Dimensions (Inches)CertificatesAutomatic Pressure Equalization Valve10105.88 x 4.06 x 2.124.37 x 2.87 x 1.68IP67Yes10156.68 x 3.88 x 1.865.14 x 2.64 x 1.37 Yes10206.82 x 4.75 x 2.125.31 x 3.56 x 1.68IP67Yes10307.50 x 3.87 x 2.436.37 x 2.62 x 2.06IP67Yes10407.50 x 5.06 x 2.126.50 x 3.87 x 1.75IP67Yes10507.50 x 5.06 x 3.126.31 x 3.68 x 2.75IP67Yes10609.37 x 5.56 x 2.628.25 x 4.25 x 2.25IP67YesCertificate IP67 (1 meter submersion for 30 minutes)\n\nMICRO ICASE COMPARISON\nFull Use of Your Electronics: i1010 and i1015 Micro Cases feature a specially designed external jack allows you to listen to music on your device while providing full protection from the elements.\n\niModelExterior Dimensions (Inches)Interior Dimensions (Inches)Compatible Phone/Electronics ModelsSpecial Featuresi10105.88 x 4.06 x 2.124.37 x 2.87 x 1.681st or 2nd generation Apple iPod, Nano, and Shuffle * Lid organizer stores earphones\n *  Active sport double-end tie down strap features safety stripes\n * Easy open latch\n\ni10156.68 x 3.88 x 1.865.14 x 2.64 x 1.37 * Apple: iPhone, iPhone 4, iPod touch\n * Blackberry: Bold/Curve/Storm/Pearl\n * Nokia: 5800/5530/E63/E71/E71x/E75/N97 Mini/N79/N78\n * Motorola: Droid/Cliq\n * T-Mobile: MyTouch 3G, G1\n\n * Built-in cable manager\n * Active sport carabiner secures i1015 to backpack or belt loop\n * Easy open latch",
    "rating": 4.7,
    "feature_bullets": [
      "Water resistant, crushproof and dustproof",
      "Rubber liner for extra protection, doubles as o-ring seal",
      "Stainless steel hardware",
      "Clear polycarbonate lid to easily identify items in the box",
      "Interior Dimensions (inches): 6.31 x 3.68 x 2.75",
      "Great for rugged sports¿not for swimming or submerging",
      "Water-resistant, crush-proof and dust-proof",
      "Rubber liner for extra protection doubles as O-Ring seal",
      "Automatic pressure equalization valve",
      "Stainless steel hardware"
    ],
    "specifications": {
      "Product Dimensions": "7.5 x 3.12 x 5.06 inches",
      "Item Weight": "13 ounces",
      "ASIN": "B000VZQ396",
      "Item model number": "1050-027-100",
      "Customer Reviews": "4.7 out of 5 stars1,120 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#9 in Camera Cases",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 29, 2017",
      "Department": "Unisex-Adult",
      "Manufacturer": "Pelican"
    },
    "categories": [
      "Electronics",
      "Camera & Photo",
      "Camera Cases",
      "Bags & Cases"
    ],
    "price": 19.99
  }
}