{
  "website_summaries": [
    {
      "verdict": "Don't think twice about getting SystemWorks if you're migrating to Windows XP, but if you already have 2001, pass on 2002.",
      "pros": [
        "Compatible with Windows XP",
        "solid repair and maintenance tools",
        "includes GoBack, a first-rate system restoration utility"
      ],
      "cons": [
        "Doesn't work on Windows 95",
        "runs slowly unless your PC has loads of memory or a fast processor",
        "not enough new features to tempt 2001 owners to upgrade"
      ],
      "aspects": {},
      "publication_date": 20021010,
      "rating": 8.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Prepare for a nightmare and have hours at your disposal",
      "text": "MAJOR BUGS!!!! This software requires you to delete all prior Norton Utilities (including FAX) and Systemworks. When it refused to load, I was required to attempt a manual uninstall including going into registry and making changes. Still won't load. Nor will it let you reload your old software. If you have questions about the nightmares you will encounter--check the Symantec site under technical service for this software. ... I am now left without any virus protection or FAX access. I have been a loyal customer for many years but this is insane. If you purchase this software before they have a fix, don't say you weren't warned.",
      "rating": 1.0,
      "verified": true,
      "author": "PHirsc",
      "helpful_votes": 13,
      "publication_date": 20010928
    },
    {
      "title": "Am very happy on my XP Compaq",
      "text": "I recently committed two dreadful sins: I upgraded to Windows XP and installed SystemWorks at the same time. Systemworks runs flawlessly, handles my drive optimization, quickly repairs trouble spots, and cleans up programs, internet caches, and unneeded files. Symantec is doing an outstanding job keeping Norton Anti-Virus up to date. Very frequently, I am being prompted to update my anit-virus software to guard against the latest predator. With Live Update it is simple and fast. I have found, that since upgrading my RAM, everything runs much faster and SystemWorks performs even better. I only had 64MB and now am running at 256MB on my 633MHZ Compaq so, it figures. 5 Stars for Symantec on this product!",
      "rating": 5.0,
      "verified": false,
      "author": "Jeffrey E Ellis",
      "helpful_votes": 2,
      "publication_date": 20020722
    },
    {
      "title": "JUST SET IT & FORGET IT !",
      "text": "I apologise to Ron Popeil and his cooker, but this system is really that easy! By far the easiest to install and use among Norton's and MacAfee products. I have been running it with XP for a few months now. I first used it as a Beta release with my XP RC 2 copy, then installed SystemWorks 2002 after I installed the XP final product. It has caught several viruses so far, handled them perfectly and automatically. Upates are downloaded and installed automatically in the background while you are online. What more could a person want? If you have an old clunker, you can disable the background updates. Buy this product and you won't have to worry.",
      "rating": 5.0,
      "verified": false,
      "author": "TReno",
      "helpful_votes": 2,
      "publication_date": 20011218
    },
    {
      "title": "Dissapointment",
      "text": "I'm a loyal SystemWorks customer. I really enjoyed NSW2001PRO with my Windows 98 laptop. After I upgraded to an IBM T30 with XP Pro, I decided to upgrade my NSW since many apps were not compatible. To my surprise, NSW2002 did not have many of the apps I found so useful in the previous version. This almost seems like a downgrade, specially in the CleanSweap software. There's really nothing \"PRO\" about this suite. The antivirus is still tops, but there is really no reason to upgrade from 2001. I finally decided to uninstall the thing (a hassle), re-install it without CleanSweap 2002, and then install Cleansweap 2001, which integrated with the Suite.",
      "rating": 3.0,
      "verified": false,
      "author": "Peitron",
      "helpful_votes": 6,
      "publication_date": 20020823
    },
    {
      "title": "There is nothing better than Norton Utilities",
      "text": "Peter Norton knows what he is doing, with regards to PC utilities. I have been with NU since DOS versions - way back before we knew how valuable running preventative maintenance on a PC was. I just upgraded to this latest masterpiece by Mr. Norton and his team. Beware - others running this on operating systems other than Windows 2000/XP have had some troubles. If you're still on Windows 9x or NT4, you may just want to go with an earlier version of Norton System Works. Bring IT to Daddy.",
      "rating": 5.0,
      "verified": false,
      "author": "Dave",
      "helpful_votes": 10,
      "publication_date": 20011205
    },
    {
      "title": "No problems here!",
      "text": "It was with some trepidation I ordered the upgrade after reading all the horror stories by other reviewers. I was tempted just to get another year's virus definitions for my running copy of 2001 (with which I was very satisfied.) Well I'm pleased to report the old version uninstalled just find using the products uninstall option, new version loaded up fine and I'm back to being a satisfied user. About the only annoyance is that, with the uninstall, you loose all your settings and have to configure again. Win2000 pro on an old p200 system.",
      "rating": 5.0,
      "verified": false,
      "author": "Dale C. Cook",
      "helpful_votes": 0,
      "publication_date": 20020606
    },
    {
      "title": "Fine.....If it's your 1st time!",
      "text": "I've tried for a month; 'discussion groups', personal contact, etc. and Symantec WILL NOT tell you where the imbedded files are that prevent you from installing a newer version! Double talk? Plenty! The answer? Forget it! Personally I think the attorney general should be investigating fraud! Msconfig, registry, uninstall, add/delete programs, search. Try them all! Maybe Bill Gates has the answer, but Norton WILL NOT devulge the secret! ...",
      "rating": 1.0,
      "verified": false,
      "author": "Steve Silverman",
      "helpful_votes": 2,
      "publication_date": 20020721
    },
    {
      "title": "Ontrack System Suite 4 is far better for Win XP",
      "text": "I have both Systemworks 2002 and Ontrack System Suite 4. The latter has many more tools that cleanup, stabilize, and optimize Windows XP. The only Norton programs I find superior are Antivirus and Speed Disk. The rest of the programs are outmatched by the comparable Ontrack programs. The Ontrack registry fixer is amazing, and the cleanup programs are, in my opinion, superior to Norton's Cleansweep. I only purchased Ontrack after discovering that Systemworks 2002 does not have some of the utilities that I liked (e.g, Disk Doctor, Optimize) when running under Windows XP. Ontrack has done a better job of developing a utility suite for XP.",
      "rating": 2.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20020723
    },
    {
      "title": "Installation Problems Don't Outweigh Benifits",
      "text": "As has been noted in these reviews already, there can be some installation issues. The easiest way to avoid these problems is to copy the entire CD to your hard drive, and then install from that copied directory. From what I've seen, this works flawlessly. System Works is one of the few programs that I will trust a computer that I've built for an inexperienced user to. By setting up the schedules for everything that needs to be done before turning the system over, it ensures that things will be running well for a long time.",
      "rating": 4.0,
      "verified": false,
      "author": "Andy",
      "helpful_votes": 3,
      "publication_date": 20020805
    },
    {
      "title": "Now obsolete! Don't waste your money!",
      "text": "I just tried to renew my Norton Systemworks 2002, and the Symantec website said that the virus definitions, program updates, and so forth, for the 2002 version are now discontinued, and that I need to upgrade to another version.",
      "rating": 1.0,
      "verified": false,
      "author": "Kathleen A Klucsik",
      "helpful_votes": 0,
      "publication_date": 20051222
    },
    {
      "title": "Additions to SystemWorks 2.0 (upgrade) from 1.0",
      "text": "The SystemWorks package works well for Os 9.x or lower but it caused many problems for me once I changed my operating system to OS X. After reading many forums from disgruntled users of Systemwork's performance, I knew it was not just me complaining. The 2.0 version includes Alsoft's Disk Warrior 2.1, which I also own. Its sole purpose is to rebuild damaged directories. Why did Symantec's 2.0 version include a product from another software competitor? That is not a difficult question to answer...",
      "rating": 2.0,
      "verified": false,
      "author": "Bruce West",
      "helpful_votes": 3,
      "publication_date": 20020609
    },
    {
      "title": "AAAARRRRGGGGHHHHHH!!!!!",
      "text": "Installing SystemWorks on XP seems okay. Then try installing \"Go Back\" which is an included program. I'd sooner slit my wrists than spend another evening trying to fix the ensuing disasters!",
      "rating": 1.0,
      "verified": false,
      "author": "TJ",
      "helpful_votes": 14,
      "publication_date": 20020507
    },
    {
      "title": "Get it now !!",
      "text": "I bought the origional Norton Systemworks. I was going to reinstall it on my new hard drive, but found out that Norton no longer supports it. So, I went out and bought Systemworks 2002. I just use the different products by themselves. If I ran System Doctor all the time, it'd probably crash my system, as I only have 64kb memory. But, from what I have found using this product, it is a very good product, and worth the price. Joe & Monty Hansen Cat rule. Dogs drool....",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20020103
    },
    {
      "title": "Stinks",
      "text": "I have owned this product for over 6 months. I have tried to update the virus scan 10's of times. After downloading 4645 MB each time, this nitwit software comes up with an error code of 1821 which equates to \"tried to write update to a file that was in use\". I even SHUT DOWN every file on my computer, except, AOL and Explorer which is minimum to run. It still comes back after downloading that enormous amount of MB (4645mb) with the same nitwit message, file in use can't download the update. Who ever heard of such poor software, it is unbelieveable.",
      "rating": 1.0,
      "verified": false,
      "author": "H. Thomas Robichaux",
      "helpful_votes": 0,
      "publication_date": 20021028
    },
    {
      "title": "Sometimes New Isn't Always Good",
      "text": "This version still has alot of bugs in it. The Anti virus works Great! Its the other applications that seem to work when they want to. When running Norton WinDoc...there is always an error that never seem to \"fix\" themselves.",
      "rating": 3.0,
      "verified": false,
      "author": "Jose L. Velez",
      "helpful_votes": 3,
      "publication_date": 20020305
    },
    {
      "title": "Windoctor Crashes in XP",
      "text": "DO NOT BUY THIS VERSION. Unless you want to become a Symantec Beta Tester and pay for the privilege, steer clear of 2002 until the next version is released. I got a refund on my software.",
      "rating": 3.0,
      "verified": false,
      "author": "sneaker",
      "helpful_votes": 4,
      "publication_date": 20011124
    },
    {
      "title": "The best",
      "text": "I think the Norton Sistem Works is the best deal for the price. It works and fix problems in the computer to make it work flawless and fast.",
      "rating": 5.0,
      "verified": false,
      "author": "Henry Roman",
      "helpful_votes": 0,
      "publication_date": 20011109
    },
    {
      "title": "System Works 2002",
      "text": "A good product it installed without a glitch, I currently am running Windows XP RC1 on a NEC P-3 450 and it performed speed disk, virus scan, and clean sweep without any problems.",
      "rating": 5.0,
      "verified": false,
      "author": "J. R. Holdeman",
      "helpful_votes": 6,
      "publication_date": 20010929
    },
    {
      "title": "Continuing the tradition",
      "text": "Since day 1, the best \"computer helper\" there is.Has helped me with more than one rescue,it also has the most up-to-date anti-virus updates,as well as the best program problem finder/fixer out there.",
      "rating": 5.0,
      "verified": false,
      "author": "Chris L.",
      "helpful_votes": 3,
      "publication_date": 20020427
    },
    {
      "title": "norton 2001",
      "text": "Norton 2001 has saved me two or three times already. Have told lots of friends about this product. they plan to purchase it. It is easy to install and use. Very good product.",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20020115
    },
    {
      "title": "Norton Systemworks 2002",
      "text": "Found after using this product although not this version. That my Internet has not been protected . Here I ran the normal,testing . Told me that I was protected. Very direct wording. Giving ways to correct the problem. With the Sept.11th tragedy . First thought is being protected in anyway. Anyway meaning in a very honest to be way. What I can Not understand with all warnings from Norton. Warning of No protection was never brought to my attention. Rating at 3 is probably too high.",
      "rating": 3.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20011026
    },
    {
      "title": "All star review",
      "text": "The 2001 system works was great; with all the additional features, especially the GoBack3 feature, there is no way I will ever be without Norton System Works 2002!",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20010926
    }
  ],
  "product_meta": {
    "title": "Norton SystemWorks 2002",
    "rating": 3.3,
    "categories": [
      "PC Maintenance",
      "Utilities",
      "Software"
    ],
    "price": 35.58,
    "specifications": {}
  }
}