{
  "website_summaries": [
    {
      "verdict": "A sturdy and really attractive addition to any kitchen. It assembles easily, although you may find a second pair of hands come in handy.",
      "pros": [
        "Curved dome is a great look",
        "Assembly is easy, with all parts labeled",
        "Wine and spice racks can be omitted if you don’t plan to use them"
      ],
      "cons": [
        "Assembly works better with two people",
        "Pre-drilled holes on parts may not line up perfectly"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Surprised, in a good way!",
      "text": "This product did not knock my socks off, but for the price it is nice. It's was easy to put together. I managed to do it while my 6 month old napped and my 3 year old watched a TV show. It is a good size for my kitchen, but smaller than most bakers racks. I wanted this for storage, so I purchased these boxes to go underneath.",
      "rating": 4.0,
      "verified": true,
      "author": "Rae",
      "helpful_votes": 30,
      "publication_date": 20160808
    },
    {
      "title": "Fit my needs exactly!",
      "text": "This fit my needs exactly. I wanted to clear up counter and cabinet space, plus find one deep enough to fit my 16.5\" microwave. I have only had it a few days so i can not attest to its longevity, but it feels very sturdy so i am hopeful. I took the advice of others and omitted the wine rack, since I didn't need it. That allowed me to put taller appliances on that shelf. You will probably need two people to put it together, it gets kind of tricky getting it flipped around at times.",
      "rating": 5.0,
      "verified": true,
      "author": "M. WalkerTop Contributor: Pets",
      "helpful_votes": 19,
      "publication_date": 20170330
    },
    {
      "title": "Well built",
      "text": "Very sturdy rack. It was easy to put together and is a nice addition in my kitchen. The wine rack under the main shelf is a great little extra. The adjustable bins are large enough to accommodate a small lamp! I highly recommend this bakers rack to anyone wanting to add something special to their kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Neal Harper",
      "helpful_votes": 15,
      "publication_date": 20170521
    },
    {
      "title": "Not just for kitchen gear",
      "text": "I'm using this for a novel purpose: To hold the day-to-day camera, lenses and accessories for my small, home-based photography business. I looked at many utility racks and photographer-specific products, but chose this for its footprint and apparent versatility. I found it as advertised, easy to assemble, and the flexibility of the hanging baskets and hooks is a big plus. The rack fits neatly in front of an unused connecting door. I suspect it would work equally well as an indoor rack/potting bench for gardeners.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat Kight",
      "helpful_votes": 9,
      "publication_date": 20170121
    },
    {
      "title": "Just what I needed",
      "text": "This is perfect!! I have limited space in my apartment and needed something to store items and small appliances on to free up much needed counter space. This is a nice rack, very sturdy, and looks pretty in my kitchen. It took me about 1 hour to put it together and everything was included for assembly except a Philips head screwdriver. It's not wobbly at all, definitely a good purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "JMnewyork88",
      "helpful_votes": 13,
      "publication_date": 20160413
    },
    {
      "title": "Good, but not super sturdy and some manufacturing errors",
      "text": "I like this and use it almost daily, but there are a few problems. It's not as sturdy as I was led to believe. I got it as extra prep space and while it works, it still rocks and shakes some. I might have to reinforce it myself later. And when I was building it, either a metal piece got bent or a wooden piece had the pilot hole for the screw in the wrong place, or both, because it was not going together correctly at all when I was putting the wood top onto the stand. I had to kind of force it and make a new pilot hole. Overall, very middle of the road.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie M",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Get what you pay for.",
      "text": "Product looks nice once assembled even though there are some alignment issues. When putting on the wood top, the pre-drilled holes did not line up with metal frame. Nothing a power drill couldn't fix but now one side of the top sticks out further than the other. I did try loosing other parts of the thing to try and get the holes to line up but it just wasn't happening. Also, when screwing in some screws, it felt like the holes were already stripped because no matter what the screws would not go in smoothly. Definitely feels cheap (like it is).",
      "rating": 3.0,
      "verified": true,
      "author": "Dualnames",
      "helpful_votes": 2,
      "publication_date": 20170531
    },
    {
      "title": "... looked all over at stores to find a rack like this and could not find one we liked and ...",
      "text": "We had looked all over at stores to find a rack like this and could not find one we liked and was sturdy enough to satisfy us. My wife found this and we ordered it and could not be happier with it. It is constructed very well and very solid. The assembly was fairly easy. best with 2 sets of hands. The only hiccup was 2 of the screws that hold the wood shelf did not line up so a cordless drill and a tiny bit was all that was needed. We are very pleased and would buy it again if we needed another.",
      "rating": 5.0,
      "verified": true,
      "author": "Robertwaynearnold",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "Okay for the price....",
      "text": "For the price it is okay. Had several problems with wine rack installing too sides holes were off a bit. The wooden board shocked me when I saw the color. Lucky I had this orange color in my rug. The hooks that are supplied too me are a joke not using them. This item should have had adjustable legs too keep it from wobbling.",
      "rating": 3.0,
      "verified": true,
      "author": "MRMoore",
      "helpful_votes": 3,
      "publication_date": 20170731
    },
    {
      "title": "This is just perfect!",
      "text": "This rack is amazing! It came packaged nicely and putting it together was super easy with clear instructions. The only tool I needed was a Phillips screw driver and the set came with an L wrench. It took about an hour to set it up myself. It's sturdy and it was just as tall as I am (5'7\") when completely put together. This a great rack of you have a small kitchen. I would definitely recommend this product to anyone. I'm actually going to turn it into a bar set up for entertaining in my apt.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryo Zsun",
      "helpful_votes": 7,
      "publication_date": 20170223
    },
    {
      "title": "BEAUTIFUL BAKERS RACK",
      "text": "This bakers rack is too beautiful! I'm so glad I purchased it. It's very sturdy, good quality for the price. EASY ASSEMBLE. Perfect for my wine and grapes theme for dining area.",
      "rating": 5.0,
      "verified": true,
      "author": "Jasmine W.",
      "helpful_votes": 14,
      "publication_date": 20160410
    },
    {
      "title": "Easy to put together",
      "text": "Easy to put together, sturdy, and it looks nice. I have an impossible kitchen and this helps. Arrived safely, only needed a Philips screwdriver and the allen wrench (provided) to get this assembled. One holds cookbooks under the wine rack, with the baskets used as a mail sorter and a stand on which I can place my purse when I get home from work. I bought two. The other holds large appliances like a stand mixer, food processor, and a few items that hang near enough to reach easily, but NOT on my counter space (of which there is very little). Nice enough to move on to other functions in the home if I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Rutherford",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "sturdy, easy assembly, useless hooks, needs screwdriver, read directions carefully",
      "text": "Was really impressed by how sturdily this thing is held together. I put it together in about 20 minutes and that includes the time it took to reverse the direction of the top part because I had put it on the wrong was (was unable to hang the baskets from it). It's a good size and holds things great! Few Heads up: The shelves underneath are too short to store standard alcohol bottles. The instructions don't warn you that you need a screwdriver, and what direction the top part has to go. Provides 6 hooks, but not a lot of room (the way I have it set up) to use those hooks to hang anything.",
      "rating": 5.0,
      "verified": true,
      "author": "Epigee",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Perfect in my kitchen",
      "text": "Looks great and has plenty of storage options. The metal frames were slightly bent, so standing alone it wasn't the sturdiest thing in the world. Once placing items on the bottom shelves, it helped stabilize.",
      "rating": 4.0,
      "verified": true,
      "author": "KDubs322",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "I can get a shorter screw but we all expect things perfect when mail ordered since we can't just drive up ...",
      "text": "I would have given 5 stars but one of the screws did not fit. I double checked, it's the little quarter circle that fit in the middle towards the back above the cutting board. I can get a shorter screw but we all expect things perfect when mail ordered since we can't just drive up to the store and get a quick fix. :) It's really pretty and I use it a lot, I would recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "Janice",
      "helpful_votes": 0,
      "publication_date": 20170603
    },
    {
      "title": "Very nice and exactly as described",
      "text": "Very nice and exactly as described. I haven't found a use for the hooks yet, so I put them aside for now, and may use them in the future. No problem assembling. One tiny part was missing, it was from one of the feet that protects it from scratching the floor. I called Southern Enterprises customer service and got right through to the area that could help me. The women I talked to was very nice and efficient, she promised the piece would be delivered within a week. Sure enough, it arrived in less than a week. To me good customer service is as important as the quality of a product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jersey girl",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Nothing special price reflects it, get what you pay ...",
      "text": "Nothing special price reflects it, get what you pay for I purchased it to go outside (in Wisconsin) for my gardening tools and to add a little something to look at don't care that it is flimsy or that the wood made it for a couple of month before fading and peeling in the sun. Its not a show piece but does serve a purpose for me.",
      "rating": 4.0,
      "verified": true,
      "author": "zena",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Pleasantly Surprised",
      "text": "It is so hard to purchase furniture online because you can't see or feel the quality. I was pleasantly surprised to find the quality of this piece far surpassed my expectations especially for the price. Each piece was labeled with a letter, nicely packaged and went together in about 30 minutes. When it was originally ordered the delivery date changed to about a week later than predicted, but arrived a day earlier than original date.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Quality piece",
      "text": "This is an awesome value and great furniture piece! They offer this at big box furniture stores for wayyy more than you'll pay here. I'm a housewife and I set this up all by myself with no problems. It looks great in my kitchen and I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "ltimes",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Tad small but works great",
      "text": "Great storage, easy to assemble and beautiful. Just not as tall as expected but still works wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "Alyssa smull",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Using it as a beverage station",
      "text": "I am using this as a beverage station in our dining room. I have a Keurig and a 12-cup coffee pot sitting on it, and I can store coffee/tea/kcups on the shelves. I also use the racks for things like sugar, filters, and travel mugs. I was really impressed with the quality. It's very sturdy. I don't use the hooks, so I can't speak to those, but it works well for our purposes.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Bosky",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "Parts not cut right",
      "text": "None of the parts are cut right, the whole thing is uneven. The metal and wood are nice and solid materials but the metal isn’t cut right so one side of the stand is taller than the other and there are gaps between the parts. Would be a great piece oif the workmanship hadn’t been lazy.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180203
    },
    {
      "title": "We put the 2 little shelves side by side on the top bar and it looks just fine. You can assemble it without the wine bottle ...",
      "text": "I would have given it 5 stars, but the middle shelf is not tall enough for my kitchenaid mixer to sit down there (didn't attach the wine bottle holder). It is the one that has the tilt head on it. I have our toaster oven sitting on the top shelf perfectly with room to spare. We put the 2 little shelves side by side on the top bar and it looks just fine. You can assemble it without the wine bottle holder. Doesn't compromise the integrity. You can not add it later unless you take the item completely apart, so make sure you don't want it attached.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20160527
    },
    {
      "title": "Nice bakers rack",
      "text": "Looks just as nice as the pictures. Pretty easy to assemble. No special tools required. Nice addition to my dining room - gives me a decorative storage place for commonly used items, such a trivets, place mats and serving baskets. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "PAC",
      "helpful_votes": 2,
      "publication_date": 20161106
    },
    {
      "title": "Beautiful and very useful",
      "text": "This rack is as beautiful as it is useful. It's very easy to put together (just make sure you don't fully tighten any screws until the very end) and it fits perfectly in the space we saved for it in our kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard A. Dugan",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": ") The baker's rack looks beautiful and I had absolutely NO issues with the assembly",
      "text": "I purchased this baker's rack to give me more counter space in the kitchen. Although it was supposed to arrive on Wednesday, it did not come in until Friday. But I can give them that it was a holiday week...delay forgiven. I was a little worried about the assembly, and I was going to have my husband do it BUT when I started to put it all together, the instructions were very straight forward and I was able to do it myself!! :) The baker's rack looks beautiful and I had absolutely NO issues with the assembly, I would totally order something else from the SEI if I needed anything.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Bakers rake",
      "text": "The second shelf measurements are obscured. Y the wine rake. But love how it added to my room and has become a center piece. The material is sturdy and the cute top shelves are handy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackel0714",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Great bakers rack.",
      "text": "Great bakers rack. I don't have a whole lot of room in my kitchen but this was on a smaller side. I like the hooks as well as the two shelves. I am not much of a wine drinker but having space for a fes bottles is nice. If I remember right though there was a screw or two that didn't want to quite fit so I just went to my local hardware store got a little longer and it worked out. The item came in with no damage and I set it up myself. Took me aprox 30 mins or so.",
      "rating": 5.0,
      "verified": true,
      "author": "reddraco",
      "helpful_votes": 0,
      "publication_date": 20160420
    },
    {
      "title": "Very well constructed!  Much better than I had hoped!",
      "text": "I'm using this Bakers Rack to display my Coated Cast Iron cookware so was really hoping it would be strong. It exceeds my expectations. Can't believe the detail they went to in making this easy to assemble. Everything fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Catterberry",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Great little piece of furniture.",
      "text": "I bought this for my kitchen and had it put together within an hour and a half. The pieces are not super straight but for the price you can't really beat what you get. This works perfectly for our microwave and other misc. items. Also all of the pieces and instructions were well labeled and easy to understand. Everything needed to assemble was included except for a medium sized Philips head screw driver.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle O.",
      "helpful_votes": 0,
      "publication_date": 20170704
    },
    {
      "title": "Love this rack",
      "text": "Love this rack. It is even better than I had hoped. I’ve made it into a ‘coffee bar’ in my kitchen! Not my original intention. But I’ve extremely happy with the end result. Finally have all my coffee and tea stuff all together in one small space! Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "katherine Schuch",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Perfect piece!",
      "text": "Sturdy and stylish. Description is accurate and piece is easy to put together even though it came with one bad bolt. I did cut and paint a small piece of particle board to fit in the hanging shelf so it would hold smaller items without them tipping over.",
      "rating": 5.0,
      "verified": true,
      "author": "jennifer wignall",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "missing parts",
      "text": "item arrived missing 2key parts that would attach top to base also no instructions we're included",
      "rating": 1.0,
      "verified": true,
      "author": "stephen schiller",
      "helpful_votes": 3,
      "publication_date": 20180804
    },
    {
      "title": "Sturdy Microwave Rack",
      "text": "I have a large microwave and nothing I was buying looked right. After reading some reviews I decided to give this a try it looks great and is very sturdy. Thinking of getting another for toaster oven. Worth the money spent.",
      "rating": 5.0,
      "verified": true,
      "author": "NCSC",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Great buy! As described.",
      "text": "I was able to put this together by myself in about 45 minutes. The instructions are very clear! I love this, it cleared off my kitchen countertops and is perfect for storage in a small kitchen!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Great addition",
      "text": "Needed a hutch for the kitchen window nd something to put pots n' pans, etc. on. Fits the bill perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "noreen richard",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Great, worked well as promised",
      "text": "Absolutely love this bakers rack. I have a smaller kitchen now and now have a place to store my extra pots and kettles. You can also hang bunches of bananas on the hooks and store wine underneath the board. I use the board as a counter top when cutting vegetables and etc.",
      "rating": 5.0,
      "verified": true,
      "author": "EuriPovsky",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "So much storage and looks great!",
      "text": "Sturdy, not flimsy at all. We store mason jars with bulk staples on bottom shelves. Our microwave fits on wood shelf. lol - I've been known to store rounds of rice cakes in the wine racks when we're out of wine - why not! Fun fixture to own. Oh, you can place a wood or bamboo cutting board on one of the lower shelves to set an appliance such as rice cooker or crockpot on.",
      "rating": 5.0,
      "verified": true,
      "author": "AZ Happy Camper",
      "helpful_votes": 0,
      "publication_date": 20150702
    },
    {
      "title": "Love it!  Very sturdy and attractive bakers rack.",
      "text": "Beautiful bakers rack. Super-simple for one person to put together. I got it for my home-brew setup for kombucha and all my brew gear fits in it. It's really very sturdy and does not wobble. I put felt pads on the bottoms of the legs so as not to scratch my wood floors but probably didn't need to.",
      "rating": 5.0,
      "verified": true,
      "author": "Yikes!She'sCrazy",
      "helpful_votes": 0,
      "publication_date": 20160820
    },
    {
      "title": "I really like this baker's rack",
      "text": "I think this rack is pretty, well made, and easy to put together. My guy and I put it together in less than an hour and it's now sitting in our kitchen as my coffee station. I think it's pretty sturdy and it'll probably sit in our kitchen for years to come. The only thing I don't like are the pot hooks, they don't seem to be very stable. Other than that, I really like this baker's rack.",
      "rating": 4.0,
      "verified": true,
      "author": "Willow Prescott",
      "helpful_votes": 7,
      "publication_date": 20130222
    },
    {
      "title": "Very useful.",
      "text": "Used for 22\" TV , wine rack, 2nd shelf holds 4 brushed nickel 5x7\" picture frames, 3rd shelf a black radio.",
      "rating": 5.0,
      "verified": true,
      "author": "Spott",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Looks good, sturdy product",
      "text": "I bought this because I have no cupboard space in our current rental. It holds my large bowls, crockpot, pots, etc. I don't drink wine so I use the wine rack for parchment paper/tin foils rolls, works perfectly. The hooks I use for measuring cups/spoon, pot holders, etc. It is a lot of extra space. My husband put it together pretty easily and quickly, it looks good, and appears to be sturdy. I imagine this will last for a while.",
      "rating": 4.0,
      "verified": true,
      "author": "happychef",
      "helpful_votes": 0,
      "publication_date": 20130612
    },
    {
      "title": "I love this!",
      "text": "I bought this for my microwave along with some pots and pans. I only use one of the little baskets (for storing my tea) I didn't have room for the other. This stand adds beauty to my kitchen. I love the metal and wood look it has. I also do not have much cabinet or counter space so I need something to store things out of my way. This works perfectly for me. I'm also thinking of buying another or maybe an island. I am very happy with this purchase. I would definitely recommend this!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jorge Flores",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "but it does the job for a good price. If assembling alone",
      "text": "We're not talking about a piece of precision-made furniture here (or precision-built, if I'm honest ...), but it does the job for a good price. If assembling alone, it's probably easiest to have the base on its side or back before attaching the back piece. Seems somehow small.",
      "rating": 4.0,
      "verified": true,
      "author": "Fiona Hart",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "This was super easy to put together",
      "text": "I bought this for my wife and she loves it. Shipped very fast. It does come shipped in a big box and packaged very well. It's sorta heavy so older folks or ladies may need some help. This was super easy to put together, took me about 20 mins total. Only thing you will need is a Phillip screw driver. Looks very nice in the kitchen",
      "rating": 5.0,
      "verified": true,
      "author": "chris Bowman",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "Adds storage without alot os space and looks great. Very efficient.",
      "text": "Considering size this is just about perfect... Could have used some laterals for pot lids but that's minor. All in all, unless I designed for my specific needs (and kitchen) this is fabulous addition.",
      "rating": 4.0,
      "verified": true,
      "author": "LOUISE",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Perfect fit",
      "text": "Purchased this rack to be used as a place to relocate our microwave. Took me just about 20-30 mins to put together. Arrived early earlier than expected, which was nice. Wooden shelf is perfect for the microwave we have and the wife is happy she can store 5 bottles of wine below. Nice addition to the kitchen are and a great price as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Chance",
      "helpful_votes": 0,
      "publication_date": 20151207
    },
    {
      "title": "Quick put together and sturdy",
      "text": "Goes together pretty quickly and it's sturdy, worth of money and I would buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "lnu238",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Good but a little hard to assemble",
      "text": "It's good for my dorm room next to the mini-fridge as I don't have much space for a full countertop. I would have been nicer if the wine rack was a drawer for silverware but that's okay. I would have given it 5 stars if it was a tad easier to put together but that might be because I was tightening the bolts in as I went along making it harder to put in the next shelf. Maybe the instructions should tell you not to tighten the bolts until all shelves are in.",
      "rating": 4.0,
      "verified": true,
      "author": "cocofan",
      "helpful_votes": 0,
      "publication_date": 20131113
    },
    {
      "title": "Good, sturdy rack",
      "text": "Good, sturdy rack. The wood top is solid. Mine came with some damage on the wood, which was very disappointing. It’s tough to get the parts together after putting the first shelf in. I scratched the metal while trying to place the second shelf.",
      "rating": 3.0,
      "verified": true,
      "author": "Carla S",
      "helpful_votes": 2,
      "publication_date": 20180608
    },
    {
      "title": "Went together easily.",
      "text": "Needed a rack for the TV in my kitchen and assorted other items. This was inexpensive and seems very well built and designed. Went together easily.",
      "rating": 5.0,
      "verified": true,
      "author": "John P.",
      "helpful_votes": 0,
      "publication_date": 20170623
    },
    {
      "title": "Great Item",
      "text": "I absolutely love this product. It fit perfectly in the space I needed it to. I bought to put my microwave on however after it arrived I decided to use it differently. I have stored baking dishes on the bottom 2 shelves and other smaller applicances on the microwave shelf. I use the wine rack to hold my boxes of foil and saran wrap. Love this item so worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Tricia Patmore",
      "helpful_votes": 0,
      "publication_date": 20160826
    },
    {
      "title": "Unlevel",
      "text": "I think the rack is a good deal. My PROBLEM is I can't get it level to floor one leg off ground. I have tried loosening all bolts on lower half and repositioning and retighten, but still same problem. Any help ?? Thank you.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "The assembly was somewhat easy, however the company that sold this product did ...",
      "text": "The assembly was somewhat easy, however the company that sold this product did not inspect their own pieces and unfortunately after I had it all assembled, I realized the arch part was noticeably dented. The four legs that touched the ground were also not level and I had to buy some pads to apply on the bottom feet to keep it from wobbling. Overall it is nice and fits my needs and is functional.",
      "rating": 4.0,
      "verified": true,
      "author": "Carrie Wheeler",
      "helpful_votes": 0,
      "publication_date": 20161023
    },
    {
      "title": "Two Stars",
      "text": "Pieces didn’t fit together well. Using outside half assembled as a potting bench because top holes weren’t drilled properly",
      "rating": 2.0,
      "verified": true,
      "author": "PololvrTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Beautiful!",
      "text": "Sturdy and perfect for a small kitchen corner. However, make sure you have extra space to accommodate. I am a stickler for measuring so I measured the space that I was going to put this in more than once and purchased it because it'd be a perfect fit. However, once assembled the unit was slightly wider than the measurements posted. Aside from that, the rack is beautiful and the extra storage space that it provides is perfect for my tiny kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunshyne4all",
      "helpful_votes": 0,
      "publication_date": 20130914
    },
    {
      "title": "Easy to set up",
      "text": "Easy to set up, but very compact I thought it a bit bigger than how it is. Still so far it's lightweight and good for small kitchens.",
      "rating": 4.0,
      "verified": true,
      "author": "DeeDee",
      "helpful_votes": 0,
      "publication_date": 20160916
    },
    {
      "title": "Great Baker's Rack for a small space.",
      "text": "I bought this for my daughter for Christmas. It was delivered promptly and packaged well. We put it together using only the included hexagonal wrench. One decorative bracket's drill hole was not completely open and we requested a new one which arrived free of charge about 5 days later. It is sturdy, the hanging hooks and baskets can be moved about to suit what is being displayed and it doesn't take up too much room. She was very pleased, and it was significantly cheaper on Amazon than any where else on the web. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "katw",
      "helpful_votes": 0,
      "publication_date": 20111227
    },
    {
      "title": "It's okay",
      "text": "Serves the purpose I purchased it for - using it to shelve a micro fridge. Rust on product - it did come off for the most part. okay sturdiness - I wouldn't weight this one down, not heavy duty. It's in my office, if it were in my home I would probably return it.",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah E",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "Well worth the money",
      "text": "Perfect for decorating & storage. Beautifully made & quite sturdy! Accents the home nicely",
      "rating": 5.0,
      "verified": true,
      "author": "Tami Connors",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Love this rack.....",
      "text": "It's really nice. It's very sturdy. I'm 60 years old and a woman and I put it together by myself. I have gotten a lot of nice comments on it. Great unit for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Deb04",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Just the baker's rack I was looking for!",
      "text": "I was looking for a fairly narrow rack to fill a spot in the kitchen. I found this one and it was pretty easy to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer M. Wilhorn",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Great item for the price...",
      "text": "Quality build at a reasonable price. I have a smaller kitchen with limited counter space and was looking for something to provide a little extra storage. The rack was extremely easy to put together (took less than half an hour by myself). In addition, as other reviews have mentioned this product is surprisingly VERY sturdy. I currently have a few 24-36 packs of water stored on the shelves and they aren't budging.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Danser",
      "helpful_votes": 17,
      "publication_date": 20150723
    },
    {
      "title": "Great as a potting bench",
      "text": "I've had this rack on my deck for the past 10 years and used it as a potting bench and plant rack. it's held up amazingly well being outside year-round and just bought another for the same purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "Beautiful Rack",
      "text": "Although delivered at the wrong address that was my fault recently had a change of address)but Amazon wasn't notified. I was able to get the Baker's Rack and I love...love. It arrived with everything as was promised. I put it together myself, very easy all parts directions were easy to follow. My husband was out of town and when he return he was very impressed with the Bakers' Rack and how well I put it together. I had to \"toot my horn\" on that one and he had to have something to say as \"it should be closer to the wall\".",
      "rating": 5.0,
      "verified": true,
      "author": "bmccullough",
      "helpful_votes": 0,
      "publication_date": 20120601
    },
    {
      "title": "Perfect for a small kitchen!",
      "text": "My favorite thing in my kitchen. I use it as a coffee stand. The two baskets hold k-cups and ground coffee and a French press, my keurig goes on the main shelf along with a sugar bowl, spoon rest, banana hook, and small fruit bowl. It holds the wine bottles very securely, and underneath I can fit my rice maker, crock pot, hand mixer, vases for flowers, cookbooks, and I still have room. I LOVE it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Caroline Howden",
      "helpful_votes": 0,
      "publication_date": 20160314
    },
    {
      "title": "Eh could be more sturdy.",
      "text": "Even after tightening multihull times it's still very shaky and wobbly. I had to fix it to the with a bracket. But other than that it's a huge space saver.",
      "rating": 3.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 3,
      "publication_date": 20160223
    },
    {
      "title": "Great buy!",
      "text": "What a great choice I made with this baker's rack! Besides being pretty....it is functional. Perfect for my kitchen and my microwave. Actually it would look nice in any room. My brother put it together and everything fit well.",
      "rating": 5.0,
      "verified": true,
      "author": "gcar",
      "helpful_votes": 0,
      "publication_date": 20160120
    },
    {
      "title": "GREAT MICROWAVE RACK FOR THE KITCHEN LOOKS GOOD GOOD FUNCTION",
      "text": "Really surprised by the quality of this rack. It made a great Microwave Oven Stand and Bread and Food Storage in the Kitchen. We put some Plants in the small racks on top and it works out nicely I surely recommend this Rack",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick L.",
      "helpful_votes": 0,
      "publication_date": 20150313
    },
    {
      "title": "Baker's Rack bring a whole new look to the kitchen.",
      "text": "I got this Baker's rack to help clear up clutter in the kitchen. Fabulous! Not only is it stylish but it is highly functional and sturdily built. I love the wine bottle rack and everyone who has come in the kitchen loves the look. Delivered as promised and easy to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "Perfect Temptation Station",
      "text": "This baker’s rack was a perfect fit for my kitchen. Love, love, love it. Easy to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "LisaT",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Helps free-up counter space.",
      "text": "I have my microwave on it and several small appliances on the bottom two shelves. Now I have more space on my counter for food preparation.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Pa",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Small but perfect for what we were looking for",
      "text": "Took the wine rack off and there was room for the microwave underneath. We use it as our coffee station. Plenty of room for our mugs to hang. Small but perfect for what we were looking for.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Patton",
      "helpful_votes": 0,
      "publication_date": 20160610
    },
    {
      "title": "Perfect for my needs!",
      "text": "Purchased this after reading the rave reviews. This product did not disappoint. It did arrive with a small gouge in the wooden shelf, but the shelf was quickly replaced by the rack's maker. Very easy to put together. Living in a condo, we are always looking for ways to add a little space to our kitchen. This was perfect! We have baskets on the shelves which hold different odds and ends and keeps clutter out of our cabinets and away from the eye. We have a cookie jar on the wooden shelf, along with our toaster, and our potholders and dishtowels hang from the hooks. Pretty and functional - what more could I ask for?!",
      "rating": 5.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20121002
    },
    {
      "title": "Nice baker's rack",
      "text": "Nice baker's rack, sturdy enough for my pots and pans. One hole on the quarter circle pieces wasn't drilled quite enough, so I can't get the screw in, otherwise would have been 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "Perfect all around!",
      "text": "Perfect! This piece is very well constructed and therefor a great value at the price. Feels sturdy within multiple appliances, wine, pots, pans, and extras on it. Assembly was clear. As far as looks, it's also perfect for me. Great design without being overly intricate, or too plain. Great accent, quality, and value. Definitely recomend!",
      "rating": 5.0,
      "verified": true,
      "author": "bobak ghadery",
      "helpful_votes": 0,
      "publication_date": 20160403
    },
    {
      "title": "cute",
      "text": "Using it as a coffee bar. Very sturdy. Really cute too! We keep getting compliments. Bought a bunch of glass jars to organize and cutesy -up.",
      "rating": 5.0,
      "verified": true,
      "author": "Cura DeGroat",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Using as coffee bar",
      "text": "This rack works beautifully for our coffee bar. The assembly was easy and fast. The price was perfect, too.",
      "rating": 5.0,
      "verified": true,
      "author": "izronhim",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "Great",
      "text": "Our kitchen is smaller and this is the home of a large oven, giving us counter space. Looks great, very happy with this rack.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie L",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Super easy to put together",
      "text": "Super easy to put together, it took maybe 15-20 minutes. The rack seems very sturdy and beautiful.I'd recommend this to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt N",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "Awesome",
      "text": "Awesome. Just like you hope it would be! My husband put it together by himself in 45 minutes and said the instructions were very clear.",
      "rating": 5.0,
      "verified": true,
      "author": "keifernavey",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Timeless design.",
      "text": "So easy to put together! I just love it to decorate for every holiday!",
      "rating": 5.0,
      "verified": true,
      "author": "Lpad",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Excellent product",
      "text": "Love this item!!! Perfect size for my kitchen. Well made. Great price and easy assembly.",
      "rating": 5.0,
      "verified": true,
      "author": "brakoqweenreview",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Fantastic!",
      "text": "This is beautiful and so easy to put together! My 11 year old daughter and I had it together in about 30 minutes tops. I love that it comes with baskets and hooks!",
      "rating": 5.0,
      "verified": true,
      "author": "Lmnop48",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "Great Kitchen Addition",
      "text": "Love my baker's rack. It only took about half an hour to assemble. It's very sturdy. I use the bottom two shelves to hold all my cookbooks and have a 22\" TV on the top shelf with remotes safely nestled in one of the baskets. The domed style and black color look great in my country kitchen. Would highly recommend this to anyone in the market for extra shelves in their kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Mathis",
      "helpful_votes": 0,
      "publication_date": 20121105
    },
    {
      "title": "very easily put together - less than 30 minutes and fit ...",
      "text": "First of all, it showed up quick; very easily put together - less than 30 minutes and fit perfectly into the space. (It helped to premeasure the width of course).",
      "rating": 5.0,
      "verified": true,
      "author": "Kara Johnson",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "Multi-functional bakers rack for all types of people.",
      "text": "Solid design and fully functional. Can hold multiple bottles of wine, plants (hooks), knick knacks, and more. I store some electronics such as routers and smart home links.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Brown",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "Exactly what I was hoping to find!",
      "text": "I needed a bakers rack to put my Foodi on and this works perfectly. Bonus - it matches the cast iron pot/pan holder that is hanging from our ceiling. Really happy with it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Cirillo",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Five Stars",
      "text": "I love this Soooo much! I bought it to use as a coffee sation for my new apartment.",
      "rating": 5.0,
      "verified": true,
      "author": "MaraTop Contributor: Makeup",
      "helpful_votes": 2,
      "publication_date": 20170529
    },
    {
      "title": "It’s nice",
      "text": "It’s nice, a little wobbly, but better than the last shelf I had for my microwave",
      "rating": 4.0,
      "verified": true,
      "author": "Elisabeth Allen",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "The mini bar",
      "text": "I used it for a bar and my cookbooks that in the baskets below. I love it. It was easy to put together and it’s sturdy.",
      "rating": 4.0,
      "verified": true,
      "author": "KW",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Assemble is quick; finished product looks great!",
      "text": "This is a wonderful piece. I am currently using it as a home bar. There is plenty of room for glasses, decanters, bar kit, and bottles. It was relatively easy to assemble. I did it alone and have got little experience assembling things and it took me under an hour. I think it is a great piece for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "Great Space Saver",
      "text": "Bought this for one of my rentals, looks good and gives more space for tenants.",
      "rating": 5.0,
      "verified": true,
      "author": "Red Benz",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Nice Bakers Rack",
      "text": "Looks great and just right for what we needed. Very easy to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "Derek Jones",
      "helpful_votes": 2,
      "publication_date": 20170529
    },
    {
      "title": "Good value!",
      "text": "Lovely! Assembly was okay, except for getting the shelves in easily.",
      "rating": 5.0,
      "verified": true,
      "author": "TJHill",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "HANDY BAKERS RACK",
      "text": "I LIKE THIS BAKERS RACK... IT HOLDS A LOT OF THINGS AND MORE.. I HAD THIS CARDBOARD ONE AT FIRST AND IT RIPPED APART.. BUT AMAZON THEY STAND BEHIND THERE PRODUCTS AND TOOK IT BACK BUT THIS ONE IS GREAT MADE OUT OF IRON AND REAL WOOD... IS A GREAT ITEM TO HAVE IN THE KITCHEN",
      "rating": 4.0,
      "verified": true,
      "author": "CYNTHIA",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "Damaged goods",
      "text": "Package is damaged and some rods are bent. Looks like it was previously opened and returned",
      "rating": 1.0,
      "verified": true,
      "author": "Variable ",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Beautiful Bakers Rack",
      "text": "We love our new bakers rack. It was relatively easy to assemble, 30 minutes at most. It looks absolutely beautiful in our kitchen. It's both artistic and serviceable at the same time.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce Ann, Florida",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "Easy to put together. Other reviewer's said there's arrived damaged mine was perfect!",
      "text": "Absolutely love this baker's rack. Arrived on time. Super simple to put together. It brings my kitchen to new level. Love it !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Perfect for small spot needed \"something\"",
      "text": "Need extra shelves and storage for frequently used appliances, tools and wine bottles? This rack was EASY to put together and very strong. I have a microwave on it, with pots and pans, spice bottles and - of course - several bottles of wine. Good value, very pretty and functional.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20130501
    }
  ],
  "product_meta": {
    "title": "Dome Bakers Rack w/ Wine Bottle Storage - Adjustable Nesting Baskets - Metal Tube Frame",
    "description": "This substantial and beautiful accent piece adds functional storage and display space. Get creative and arrange plants or spices in the two stylish adjustable basket shelves. Six utility hooks can be moved around and used for anything that you can imagine. Constructed of solid metal tube in a durable black finish, this contemporary baker's rack is as durable as it is versatile. The light cherry workspace creates a stained wood accent with the appearance of a solid butcher-block countertop. A rack for 5 bottles of wine and two full size wire shelves create ample storage for plates, bowls, and jars. Also offers 2 adjustable nesting baskets and versatile accessory hanging with 6 utility hooks. Expand your storage options by adding this creative baker's rack to your kitchen today. Dimensions include: Overall: 25.75\" W x 17\" D x 68\" H; Countertop: 23.75\" W x 15.75\" D x 30.75\" H (to floor); Shelves: 23\" W x 16.25\" D x 10.5\" H; Baskets (demilune): 11.5\" W x 4.75\" D x 2.5\" H ; Clearance: 23.75\" W x 14.5\" D x 2.75\" H; This one-of-a-kind item weighs approximately 41 pounds and can support up to 40 pounds (countertop), 20 pounds (per shelf), 15 pounds (per nesting basket). Only quality materials and manufacturing will do. Product materials include: metal tube, MDF. Assembly required. Made in China.",
    "rating": 4.7,
    "feature_bullets": [
      "Accommodates 5 wine bottles; Features 2 adjustable nesting baskets and 2 fixed shelves",
      "Painted black finish and light cherry stained countertop",
      "Materials: metal tube, MDF; Supports up to: 40 lb. (countertop), 20 lb. (per shelf), 15 lb. (per nesting basket); Approx. weight: 41 lb.",
      "Offers versatile accessory hanging with 6 utility hooks"
    ],
    "specifications": {
      "Item Weight": "1 pounds",
      "Product Dimensions": "17 x 26 x 68 inches",
      "Item model number": "BE4650",
      "Is Discontinued By Manufacturer": "No",
      "Assembled Height": "68 inches",
      "Assembled Width": "26 inches",
      "Assembled Length": "17 inches",
      "Weight": "43 Pounds",
      "ASIN": "B000X0BUDI",
      "Customer Reviews": "4.7 out of 5 stars419 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#729,881 in Home & Kitchen",
      "Date First Available": "April 15, 2004"
    },
    "categories": [
      "Baker's Racks",
      "Furniture",
      "Home & Kitchen",
      "Kitchen & Dining Room Furniture",
      "Standing Baker's Racks"
    ],
    "price": ""
  }
}