{
  "website_summaries": [
    {
      "verdict": "These organic gummies are great for the more health-conscious, and a steal for a 5 lb. bag.",
      "pros": [
        "Not only are Black Forest gummy worms made from real fruit juice, but they're also dyed with natural colors",
        "Useful for anyone with any artificial food dye allergies"
      ],
      "cons": [
        "Coloring isn't very bright, so not suitable for decoration"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Worst gummy worms ever!!!",
      "text": "Way late on this review! But these were absolutely horrible. They looked nothing like the picture on amazon. They must have been incredibly old!! The entire bag of worms look like the picture I provided and taste absolutely disgusting!! I would never ever purchase these again and wouldn’t recommend anybody goes near them. Buy them in stores!",
      "rating": 1.0,
      "verified": true,
      "author": "chanz",
      "helpful_votes": 37,
      "publication_date": 20190412
    },
    {
      "title": "Update!!..",
      "text": "Hummm.....after putting the Black Forest gummie worms in the freezer over night as some reviewers suggested, I do think they taste much better. Not sure why, but they taste much fruitier, and much more flavorful. I like them now, I can taste the fruit juice!. Grateful for the suggestion, and to be fair, I’m updating my review....their tasty!!....😀",
      "rating": 4.0,
      "verified": true,
      "author": "Leila",
      "helpful_votes": 14,
      "publication_date": 20190328
    },
    {
      "title": "THE ORIGINAL BLACK FOREST",
      "text": "My cryptonite is GUMMY WORMS. BLACK FOREST GUMMY WORMS ACCEPT NO SUBSTITUTES. THEY DON'T COME IN INDIVIDUAL SERVINGS SO YOU'LL NEED A LARGE CANDY JAR WITH A COVER OR ZIPLOCK SANDWICH BAGS WHICH IS WHAT I USE. THEY WERE VERY FRESH, VERY GUMMY & BURSTING WITH FLAVOR. AS FAR AS GUMMYS GO, BLACK FOREST ARE THE BEST & THE ORIGINAL ONES. GUMMY BEARS WERE THE FIRST FIGURES & THEY ALL ORIGINATED IN GERMANY. ENJOY!!!",
      "rating": 5.0,
      "verified": true,
      "author": "DENISE JOHARIE HOLDER",
      "helpful_votes": 9,
      "publication_date": 20181208
    },
    {
      "title": "The value is great!",
      "text": "There's a few things about the gummy worms I like, and a few things I'm not that fond of. The Good: -Came sealed correctly. -The packaging had the correct corresponding flavors listed. -Super soft and chewy at first. -Flavors were pretty powerful. Each section of the gummy worm tastes like the flavor it's supposed to. Cons -They aren't very brightly colors, but not really enough to cause alarm. -They lose that fresh softness pretty fast, about 4 days or so. -The variety could be more. Ultimately they are a good buy, I even got them on sale. But I wouldn't be mad at paying 12 dollars for 5 pounds of gummy worms any day really.",
      "rating": 4.0,
      "verified": true,
      "author": "Tyson",
      "helpful_votes": 4,
      "publication_date": 20190426
    },
    {
      "title": "DO NOT BUY THESE!!!",
      "text": "These gummy worms were good at first until we saw that one of then had something black and terrifying in it! Shared them with 5 people and got sick! They all were vomiting and getting stomach aches from them!!Looked sketchy at first but we don't think anything of it. NEVER BUYING AGAIN!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Calen Otto",
      "helpful_votes": 5,
      "publication_date": 20200101
    },
    {
      "title": "Gummy Lovers Add This",
      "text": "What can I say the picture describes it all. This 5lb bag is perfect for any gummy lover. Has plenty to last at least a couple of months 😂 the flavor of the Black Forest gummies is the best around and the big bag maintained the same freshness of the individual servings which was a huge plus. The bag is also resealable which makes it perfect for long term enjoyment.",
      "rating": 5.0,
      "verified": true,
      "author": "Isa Gutierrez",
      "helpful_votes": 5,
      "publication_date": 20200204
    },
    {
      "title": "Good taste, texture, value. Love the smell for some reason",
      "text": "After demolishing a small bag of these worms from the grocery store, I had to order more. I am pregnant and find the taste to be be perfect. I’m also happy with how soft they are. The smell—oh the smell— might be my favorite part. Is that weird? The smell is absolutely intoxicating. I kinda can’t get enough. I like all the flavors equally, I think. I like the worms better than their bears.",
      "rating": 5.0,
      "verified": true,
      "author": "Keely",
      "helpful_votes": 5,
      "publication_date": 20180503
    },
    {
      "title": "Flagrant",
      "text": "We only got one flavor. We opened the bag and it was all one flavor. What happened to variety pack ?",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa Georges",
      "helpful_votes": 6,
      "publication_date": 20190219
    },
    {
      "title": "Its fine if you only like one flavor.",
      "text": "I had no problems with these gummy worms except it only had one flavor in the entire 5lb bag. Weird right? I didn't see on the packaging that it was one flavor and it even shows the other flavors on the back. I emptied out the bag to see if I could find a single green one and could not. They tasted fine and I am now 4.9lbs heavier (I shared some with my kid) so I guess I am happy but I think a better mix of flavors would be better.",
      "rating": 3.0,
      "verified": true,
      "author": "ShaneLucPicard",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "If you love gummy candy, this is not the product for you!",
      "text": "The value and presentation of this product was just like any other bulk candy product, with one exception. The package shows that there are different bi-colored gummy worms for example, red/yellow, yellow/green, and red/green. This, however is very misleading. I’ve purchased two bags of these and both were disappointing. Both bags only consisted of the same color/flavor gummy worm. 5lbs(10lbs total) of gummy worms that looked and tasted the same. As for the taste of this product, well I wasn’t too keen on that either. Couldn’t quite tell what fruit Black Forest was using with this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard Tanner 3rd",
      "helpful_votes": 3,
      "publication_date": 20190704
    },
    {
      "title": "Yeah, no....",
      "text": "Product was open all inside the box it came in. Says non returnable. I had to throw them all awa . Don't trust it not even the ones in the bag. I ordered some from a different place and those came in just fine, no issues. The bag I got from here only had two kind i noticed as I was sadly tossing them in the trash. White and red and the orange and yellow. No green and red ones at all. I use them as a reward for my kid when they help out and for other stuff. They like the gummy bears so I figured I give this a try. Ordered here first then found them cheaper elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Nye",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "FLAVOR Is WAY OFF!",
      "text": "Something has happened to the Gummy Worms! This 5 pound bag has all turned purple w/clear bands and the flavor is nothing like before and is not good at all to me! I have been eating these for over a year and have never seen or tasted a batch like this They were multiple colors but now all purple and Bad Flavor. Has the company just changed them with no warning? I cant stand the new flavor! It is nothing like what they were. Did I just get a bad 5 pound bad?",
      "rating": 1.0,
      "verified": true,
      "author": "CJK",
      "helpful_votes": 3,
      "publication_date": 20190610
    },
    {
      "title": "Only two flavors in the bag",
      "text": "Well, I thought I would try a big bag of gummy worms, since for whatever reason, they are hard to find in our area. This was kind of a disappointment. The worms tasted fresh enough, but the bag only had two flavors, not three. There were only orange & yellow worms, and clear&reddish pink ones. There were no green & red worms in the bag at all. Seems odd. Maybe these are \"oops\" bags. I'm okay with that, but would have liked to know that upfront. I probably won't buy these again.",
      "rating": 3.0,
      "verified": true,
      "author": "KatyKatMidwestTop Contributor: Baking",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Disappointed",
      "text": "These taste horrible. I was very disappointed with these gummy worms. There are flavor varieties so they taste the same which is horrible. If I could send them back I would. I feel guilty putting them in the trash and I will get this \"look\" from my husband if I do. So what do I do with a 5lb bag of bad tasting gummy worms?",
      "rating": 1.0,
      "verified": true,
      "author": "Kathy Van Clapdurp",
      "helpful_votes": 3,
      "publication_date": 20180919
    },
    {
      "title": "Aren't as good as you want them to be",
      "text": "So I have gotten the black forest gummy bears from Sam's in the 5 pound bag and they are very vivid in color and have a great taste. They don't have the gummy worms so I thought I'd give them a try on here. I was disappointed the color doesn't seem as vivid and the flavor isn't as good. Talk about buyers remorse!! OH!!! and there is supposed to be 3 flavors but the bag is missing the cherry apple flavor!!! Did they get a bunch of reject bags that they couldn't sell in stores and just sold them on Amazon?",
      "rating": 2.0,
      "verified": true,
      "author": "Nicholas Carr",
      "helpful_votes": 2,
      "publication_date": 20200514
    },
    {
      "title": "I love these so much",
      "text": "It’s my second time ordering these and it honestly is a great buy. I bought it for my mom this time, she was very excited like it was Christmas lol. I’m gonna order more next week so I can have with my sister at work. Probably going to get about 4 this time because my mom is fixing for a trip in a couple of months and it will be a great snack for my family back in Ghana. Definitely fixes a sweet tooth. It will get tough on you if you don’t reseal the bag so definitely don’t be lazy and reseal it after you’re done indulging. 5lbs worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "KorSoAnimated",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Definitely not the same As the CVS one",
      "text": "I just received it in the package, i then opened it, and was really excited to try one. I ate one and i definitely could tell it was not the same as the one from CVS or the organic packaged ones in stores. These were so bland and the length of the worms were definitely not normal, i think it was like the length of my index finger. I honestly was not too pleased, i only wanted to buy it online because i really liked black forest gummy and the value of an 80oz bag was enticing.. Definitely not worth it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190508
    },
    {
      "title": "Weak flavor",
      "text": "I've been addicted to these gummy words, but I was buying them in the smaller bags. The 5lb bags came in and the presentation was awesome. A giant bag! So exciting. But when I started to eat them, I was underwhelmed. They lacked the flavor as the ones in the smaller bags. Some were more potent than others, but most definitely had a weak flavor to them. These don't taste as juicy. Maybe these are old... a little disappointing.",
      "rating": 3.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "mediocre gummies in 2 flavors",
      "text": "I didn't like the texture and flavor as much as Albanese gummy worms. I only got 2 of the 3 flavor combos listed on the bag. I usually crush a bag of gummy worms in way less time than I'd planned, but these just don't tempt me as much.",
      "rating": 3.0,
      "verified": true,
      "author": "George Billions",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Overwhelmingly wormy. Did not finish.",
      "text": "Eating this whole bag of worms by yourself before they get stale is an achievement. I bought this because my friend had a 5lb bag that 4 of us killed about a 1/4 of after a smoke sesh - good times. I thought I could take on the bag by myself, since these are probably the softest gummy worms I've ever had (I dont mess around with those chewy Trolli boys) and I am not watching my weight. But this was TOO MUCH WORM for me, fellas. They turned stale on me after about a month of me not wanting to eat handfuls of worms every day :( Eat the worms before the worms eat you.",
      "rating": 4.0,
      "verified": true,
      "author": "Kam",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "5 lbs of yum!",
      "text": "I love these gummy worms, and between me and my husband the small bags from King Soopers don’t last long. This bag has a freshness seal. So once your done, you just press it closed. Which is really handy when it comes to 5lbs of gummy worms. To touch base on older reviews... These flavors are exactly like the flavors of Black Forest Gummy Worms you can purchase locally. And they are delicious!",
      "rating": 5.0,
      "verified": true,
      "author": "M-Anne",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Good deal if you need a lot of gummy worms",
      "text": "Completely fresh and the bag is resealable which is the BEST! The price fluctuates but when you get it for $9-10 it's the same price as the grocery stores - IF you can even find them in the stores. Around here it seems I can find the gummy bears but not the worms and not this brand. Very happy with the purchase and have actually purchased a second bag that I gave as a gift. Both were perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Indy Snow",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Gummies are very fresh",
      "text": "I was pleasantly surprised at how soft these worms were. I was disappointed due to the fact that this is supposed to have three flavors & there was only two. It is listed as having lemon-orange, cherry-pineapple & apple-cherry. The flavor that is preferred by my daughter is the apple-cherry & there was not one worm of that flavor in the bag. Very disappointing!! Won't buy this brand again.",
      "rating": 1.0,
      "verified": true,
      "author": "Mercer1105",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "All one flavor",
      "text": "I'm pretty sure the bag I got has all the one flavor in it but they are still delicious and soft so I shouldn't complain too much. The bag and seal are pretty sturdy so it's lasted me a long time while keeping the contents soft and chewy. All in all, if you're obsessed with gummy candy and have dreams about it this is a great deal.",
      "rating": 3.0,
      "verified": true,
      "author": "Nichole Moncada",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Pricey, Not Much Flavor, Meh...",
      "text": "Not impressed with these. I thought they would be more like their gummy bears in taste, but the flavors all ran together into one. Not my cup of tea, will stick to their gummy bears...",
      "rating": 3.0,
      "verified": true,
      "author": "Jeff Dreyfous",
      "helpful_votes": 2,
      "publication_date": 20190714
    },
    {
      "title": "A lot of gummi worms!",
      "text": "My dog and I will be working on this 5 lb. bag for a long time to come. I'm no gummi connoisseur, but these are some yummy, tasty worms. The color is just a tad less bright than depicted in the worm photo. That's okay by me when the price is fantastic at 9.99, although I notice the price changed since I purchased mine. Can't beat it. They are very fresh too.",
      "rating": 5.0,
      "verified": true,
      "author": "DEHM",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Very Subtle Flavors... Just Ok",
      "text": "I wasn't impressed with these. I didn't hate them or love them. The flavors are very subtle. These carry a firmer chew than their gummy bears. The Lemon/Orange worm was really good but everything else was forgettable. I'd honestly choose generic 99 cent checkout aisle worms over these flavor wise.",
      "rating": 3.0,
      "verified": true,
      "author": "Yusuf",
      "helpful_votes": 3,
      "publication_date": 20180130
    },
    {
      "title": "Yummy and child approved",
      "text": "Repeat customer! I don’t give my son dyes and this will last our whole family for a good while when we want a quick sweet fix. He even made his own online gummy order the other day at 4.5, because he saw them on our amazon history and knew we were out😁 Will continue to purchase as they are not hard, taste is great, and doesn’t feel like you are eating synthetic dye filled junk. Thanks for making these affordable!",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew D.",
      "helpful_votes": 2,
      "publication_date": 20180720
    },
    {
      "title": "Only one flavor/color... The flavor of BLAH!!!",
      "text": "They weren’t completely awful but just like other reviewers said, they were all one flavor! But not any specific flavor. I don’t get it. It was like somebody messed up the whole batch and all flavors and colors mixed to become a strange blah flavor. Really disappointing. We love the Black Forest Gummy Bears and thought these would be good too but i regret buying them.",
      "rating": 2.0,
      "verified": true,
      "author": "Mom of 2",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Umm, I didn't like it",
      "text": "So, its one color which is red. I thought it was multi color with the green, yellow, etc. The taste wasn't fresh. I can't even give it away cause it COVID time so Im gonna have to throw it away. I didn't realize I could go wrong buying a 5lb gummy worm bag. I wasn't thinking it could be unfresh or be one color. Shaking my head.",
      "rating": 2.0,
      "verified": true,
      "author": "Gaby",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "I actually don't like these.",
      "text": "Let me start by saying, I LOVE Black Forest gummy bears. These... taste different. They all taste the same almost, and there's something about them, can't really describe it, but they just are not good.",
      "rating": 2.0,
      "verified": true,
      "author": "Colin",
      "helpful_votes": 2,
      "publication_date": 20190329
    },
    {
      "title": "Good flavor but missing a flavor combo.",
      "text": "Bought these twice from 2 different sellers and both times I have some how gotten a bag that's missing a gummy worms flavor mix (same one both times that also happens to be my favorite flavor). Not sure what's going on but it looks like other users are having the same issue where one or more worm type is missing, when looking at the 3.5lb. bag at a grocery store it has all 3 flavor combos so not sure why this bag is missing one. Otherwise the worms themselves are good as long as you eat them fast enough that they don't start to go stale.",
      "rating": 2.0,
      "verified": true,
      "author": "james hinzman",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Black Forest Gummy Worms",
      "text": "The Black Forest Gummy Worms I thought was the real deal on Amazon turned out to be fake! The gummy worms that arrived to my home were much more thicker and not as fruity or juicy as the actual Black Forest Gummy Worms I am use to buying at the store. Amazon defiinitely ripped me off with this one. As far as the taste, they were okay, but not was I was hoping for.",
      "rating": 2.0,
      "verified": true,
      "author": "Sabrina M.",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "great value for the price!",
      "text": "you want 5 pounds of gummy worms, you will get them! the bag is resealable which is awesome, and these are by far the best gummy worms out there. they are softer which is great, and the flavors are awesome. can never eat haribo again, black forest is the best!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessie P",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Arrived ripped open!",
      "text": "I bought this product for a party I’m throwing for my students and I just received it ripped open, with a gaping hole. I would be concerned about the sanitation even if it was just for myself, but I’m not giving my kids possibly tainted food items. What a waste and a disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Hunter C. Loving",
      "helpful_votes": 4,
      "publication_date": 20180917
    },
    {
      "title": "Not worth it !!",
      "text": "I’m kinda disappointed in this purchase. I use to buy this product at Costco all the time before Costco discontinued it, and they were amazing. Juicy, colorful, and full of flavor. The ones I purchased on here were the complete opposite as they were deflated, dull in color, and lacked really any flavor. It’s a no for me DAWG!",
      "rating": 2.0,
      "verified": true,
      "author": "PrimeRickyy",
      "helpful_votes": 2,
      "publication_date": 20190424
    },
    {
      "title": "Incredible taste purefreshness it came in 1 piece I highly recommend this product candy lovers!!!",
      "text": "My favorite gummy worms here on out soon as you take a bite you taste all the real fruit juice and explosion of pure goodness at the same time came in one day with 4 other packages 25lb worth all around remarkable experience 10/10 all day everyday hands down know questions asked don’t think about this one get it today if your thinking about it I’m telling you worth every penny take care!!",
      "rating": 5.0,
      "verified": true,
      "author": "TuNeS-JR",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Good, if you want fruit snacks",
      "text": "the taste just like fruit snacks. if i wanted fruit snacks, i would have ordered fruit snacks. the color was dull and muddy looking. nothing like what the color on the packaging",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 3,
      "publication_date": 20190305
    },
    {
      "title": "Only 2 flavors in bag! Missing red/green!",
      "text": "WHAT A WASTE. I got 5 lbs of gummy worms and NO red/green ones! Those are my favorite and they are the main reason I ordered the bag in the first place. I was going to eat them and give the rest away. They were extremely fresh and the flavors on the other 2 were ok but I really wanted this to be a good purchase. And it wasn't.",
      "rating": 1.0,
      "verified": true,
      "author": "amy",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Not As Pictured",
      "text": "Something doesn’t seem right with these. And there are supposed to be 3 different colored worms and there are only 2. We’ve dumped the entire bag into a bowl and the green/red apple-cherry worms do not exist anywhere in this package, however the packaging shows all three types. I won’t buy these again from Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Brodie B.",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Great Tasting Gummy Worms",
      "text": "These gummy worms are fresh and delicious. Packaged properly. I have purchased them several times. Will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan Coberly",
      "helpful_votes": 2,
      "publication_date": 20190816
    },
    {
      "title": "Yummy as expected.",
      "text": "Always delicious, but a little disappointed that out of a 5lb bag there were only 2 flavors (red/clear and yellow/orange)...where did all the green/red ones go lol",
      "rating": 4.0,
      "verified": true,
      "author": "Autumn",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Even my children wouldn't eat them",
      "text": "All the worms were the same color and had a nasty flavor. They went in the trash can and I will never order them again.",
      "rating": 1.0,
      "verified": true,
      "author": "sumnergrandma",
      "helpful_votes": 2,
      "publication_date": 20190720
    },
    {
      "title": "This batch is stale and flavorless.",
      "text": "I ordered these a year ago as a snack for my son's birthday party and they were amazing! Juicy, flavorful and so soft. Just reordered them to use as a snack for my son's birthday party this year and was so disappointed! They had no flavor, were not soft (not hard as a rock but definitely stale) and were like chewing on bland, sugar gelatin. I think this bag must have still been from last year's supply.",
      "rating": 1.0,
      "verified": true,
      "author": "Toereese",
      "helpful_votes": 2,
      "publication_date": 20190612
    },
    {
      "title": "Yum!!!",
      "text": "I love these gummy worms! I’m easily a consistent buyer now😅 I even got a random bag that had a few gummy worms that were only red and were a little smaller! That was cool!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190527
    },
    {
      "title": "Best Snack for my Sensory Kid",
      "text": "My Child has Sensory Processing Disorder. We use the Black Forest Gummy snakes and bears to help her calm down. They taste good and the organic and natural ingredients is a huge plus. Thanks for making a snack not only healthy and yummy, but a great tool for my SPD kid.",
      "rating": 5.0,
      "verified": true,
      "author": "Joy Spencer-Ellis",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Fresh!!!",
      "text": "Super fresh huge heavy bag! Heavenly. No one does gummy worms as good as Black Forest. I am always a bit scared to order these online because I have gotten some weird colored ones and stale ones before in past from other sellers, but these are super fresh. I recommend taking out a handful and sealing the bag back quickly to keep them fresh.",
      "rating": 5.0,
      "verified": true,
      "author": "Lucian Dark",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Only two flavors",
      "text": "False advertisement. Orange and lemon, no other flavors. I won't buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian g",
      "helpful_votes": 3,
      "publication_date": 20190129
    },
    {
      "title": "Great gifts!",
      "text": "I bought 2 bags of these for the niece and nephew as part of their Christmas presents. They were immediately opened, and even my sister and brother in law were sticking their hands in. Lol! I’ll have to buy more. Birthdays are coming up, so definitely repurchasing. The whole family moved them!",
      "rating": 5.0,
      "verified": true,
      "author": "Adrian",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Yummy and no dyes!!",
      "text": "I just love this company and the products they put out. No dyes or funny stuff. My kids love them. I love them and feel good letting them have them. Wish they weren’t so expensive though so I could buy them more often.",
      "rating": 5.0,
      "verified": true,
      "author": "CarlS",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Yummie!",
      "text": "Very Happy with my purchase. Love the flavor and yes they are ll the same--I do not like the individual flavors (especially green and yellow). These taste great, cherry like flavor, my favorite .",
      "rating": 5.0,
      "verified": true,
      "author": "Connie",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Highly recommend sticking these suckers in the freezer",
      "text": "Look, if you're here and looking for a lot of gummy worms, you're going to get what you're after. We like sticking them in the freezer, not for longevity, but for additional chew-factor. They are a little soft if that isn't your jam and the freezer trick really works wonders.",
      "rating": 5.0,
      "verified": true,
      "author": "Dallas",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "gummy worms a comforting thing in a world gone mad",
      "text": "Their gummy words they perceived in the world as gummy worms they have no crisis about being gummy worms they've accepted the world as it is and the world has accepted them as gummy worms",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Swiger",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Perfect to Save Fred!",
      "text": "As a teacher I have used this product when having my students conduct the experiment, \"Saving Fred\". More than enough to conduct the experiment and offer students some to eat. Taste great, addicting! For a fun experiment, google \"Saving Fred\". Really cute, my third graders had so much fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Not good!!",
      "text": "These have a weird coating on them that leave a film in your mouth and on your hands. They also made me super sick to my stomach after eating them. I thought it was just me, so I gave them to my brother and he said the exact same thing. Sickness and all!",
      "rating": 1.0,
      "verified": true,
      "author": "Rainfly13",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Buyer beware",
      "text": "Received the bag a few days ago and the one i got was looking like it was starting to go bad, the pineapple flavour had already turned yellow and had a chemical taste, and only the orange and lemon ones are edible not buying this again!",
      "rating": 2.0,
      "verified": true,
      "author": "William F.",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "seems like \"factory reject\" quality",
      "text": "had no flavor......at all. really seems like factory rejects from Black Forest being sold online at a discount on amazon - threw them out .",
      "rating": 1.0,
      "verified": true,
      "author": "jonny c",
      "helpful_votes": 2,
      "publication_date": 20190120
    },
    {
      "title": "Taste is horrible.",
      "text": "These tasted horrible, they do not taste good at all, had to send back. Never order this brand again. I guess they were fresh, soft and smelled good but did not taste good, I am a Haribo Gold bears type of guy, but Amazon was out so I though I would try this brand, bad move.",
      "rating": 1.0,
      "verified": true,
      "author": "Juan",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Only One Flavor",
      "text": "I have been wanting gummy worms, with this pandemic this was the way to get them. They taste really good and fresh. I am however disappointed because there is only one flavor in the bag when there are supposed to be 3 different flavors. I want a refund and I'd call and ask for one, but Amazon doesn't have any of their reps working from home.",
      "rating": 3.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "perfect",
      "text": "omg=these are my passion- i tell everyone i get them for my grand daughter- but in reality-i buy her little packs of bears. i eat 2 5lbs bags a month-yes thats 10 pounds a month-all for me. i love them so much. i havent put on any pounds and i dont have side effects from eating them.",
      "rating": 5.0,
      "verified": true,
      "author": "michelle shoaf",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "More gummy then one person should consume. Invite friends!",
      "text": "Took forever to eat! They where good and addictive. Just maybe better suited for a group or party. To much for a solo person to eat before they get stale or dry out some. Next time will get smaller pack unless friends are coming!",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy L.",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "5 lbs may as well be a ton!",
      "text": "5 pounds is more than the average human needs in a month- also, all one flavor, only the negative part :) it took a birthday party and graduation party to even eat half of these!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine Raver",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Buy the product, but in a smaller quantity!",
      "text": "I’m gonna be honest, this is more of a me-problem than the product itself but I wouldn’t suggest buying 6lbs of this. I’ve loved Black Forest my whole life, but after eating this entire bag, I’ve lost a bit of my affinity for gummies in general.",
      "rating": 4.0,
      "verified": true,
      "author": "Maureen",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Yummy!",
      "text": "Happy customer here... I will definitely order us another bag. I've read some comments about the candy melting but we didn't have that problem (it's winter time), so no complaints there. The colors look like I remember, and it tastes good.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronnielynn",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Gummy worms matching expectations of aficionados",
      "text": "Product delivers what you expect, delivered in a timely fashion probably at a very good price, seemingly one of the two major brands in the market - i must say they lack a bit of luster perhaps but overall you get what is listed",
      "rating": 5.0,
      "verified": true,
      "author": "Synthesis",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Excellent!",
      "text": "Super fresh and really tasty! I can see why some said they got al one color in the bag, because the colors are not super artificially vibrant, but if you look closely you can see the difference between flavors. Definitely will purchase again!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Koehn",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Mmmmm",
      "text": "Only two things really matter here: Are they good? They sure are! They’re juicy, just sweet enough, and look like worms. Are they a good value? Nah! I would say they are a great value! The bag is quite large, and seemingly never ending!",
      "rating": 5.0,
      "verified": true,
      "author": "JohnW",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "The Hubby's Favourite!",
      "text": "The hubby has declared these to be his favourite gummy worms so we get them all the time now. They stay soft and have delicious natural flavor. The big bag is a good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Judecat",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Addicting",
      "text": "These arrived fresh with an expiration date in 2021. There was no off color in the gummy worms as some people have reported and the flavors were intact for the different 'worms'. These were so good I purchased another package and sent it to a friend. We all need a yummy treat during this Covid-19 lock down.",
      "rating": 5.0,
      "verified": true,
      "author": "hiker",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "kid approved and enough for a long time",
      "text": "Sent this package of Gummi worms to my niece. She was thrilled. They were packed well, very fresh and full of flavor. Inexpensive way to make the day of a kiddo obsessed with gummi's ♡",
      "rating": 5.0,
      "verified": true,
      "author": "Kristens_on_vacation",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Old product",
      "text": "These are the worst gummy worms ever. They are hard and not soft and chewy. They had to of been old. I guess some people might say that $16.88 is a good price for 5 lbs but not if their so hard to chew. Waste of money since I can't enjoy them.",
      "rating": 1.0,
      "verified": true,
      "author": "johanna thornton",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Put em in the Freezer or Fridge!",
      "text": "A giant bag of gummy worms? Hell Yeah Son!! These gummies taste great and they're even better when tossed into the fridge and allowed to get cold. Pop a few in your mouth and let them slowly melt away. It's made with real fruit juice and you can taste it. Definitely an awesome purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Wyman",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Soooooo yummy!",
      "text": "These are great! I ate the whole bag (don't tell my husband!). I even bought them for my husband but I ended up eating them all. Not in one setting though, hehe.",
      "rating": 5.0,
      "verified": true,
      "author": "Mama Lokey",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "I have no regrets",
      "text": "I am an adult, and this purchase is the epitome of \"I get to decide what that means.\" 10 pounds of gummy worms? Am I insane? Do you know how many worms that is? I do. Because I got them, and I ate so, so many. So many. I won friends and colleagues with the great taste of these worms. They are delicious, and the value can't be beat. Self control and moderation not included.",
      "rating": 5.0,
      "verified": true,
      "author": "Tomigami",
      "helpful_votes": 7,
      "publication_date": 20160222
    },
    {
      "title": "Soap taste",
      "text": "I've bought these before and they're great. This time my bag had a weird soap taste and after making sure I wasn't crazy and giving one to someone else (and rinsing one) it's clear that some cleaning solution from the factory must have gotten in the batch. Luckily Amazon has a great return policy and I'm getting a replacement without needing to argue or wait forever. Just wish I could donate them somewhere instead of letting them go to waste.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Hi my name is T and I have a gummy animal problem",
      "text": "I don't know why there's so many 1 star reviews but maybe I got lucky with a good bag. I'm happy with the flavor and freshness and I've just reordered more to feed my addiction. Best value gummy on Amazon right now.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Chow",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Buy yet the best brand",
      "text": "I love Gummi Worms & this very brand of them. They never dissatisfied me. They won't u as well. The only dislike is they don't fill the bag to the very top (yes I know im fat)",
      "rating": 5.0,
      "verified": true,
      "author": "Mz.Brown",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Different recipe from small packs",
      "text": "I bought these for my boyfriend’s birthday because he is constantly buying the smaller packages of Black Forest from the store. These gummy worms are okay, but are definitely a different recipe from the smaller packages. These are larger and are not as soft. Not bad, but I will probably stick to the small packs from now on.",
      "rating": 3.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 3,
      "publication_date": 20180217
    },
    {
      "title": "Only got one flavor",
      "text": "I love these, but I’m not happy that I got 5 lbs of only one flavor.... and my least favorite flavor at that. I thought this was supposed to be a variety of all three flavors.",
      "rating": 4.0,
      "verified": true,
      "author": "Dyreka Klaus",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Delicious!",
      "text": "These are soft, fruity and delicious. The best Gummys. Real fruit juices & vegetable colors. The only problem is 3 equal 100 calories. They're so delicious I can eat 30 - one after another.",
      "rating": 5.0,
      "verified": true,
      "author": "Magda Dream",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Will definitely order again!",
      "text": "I ordered these for a kids' party game and didn't use nearly as many as I'd anticipated. Two months later, they are still as fresh and delicious as when I opened the bag. They are a favorite among the kids at our church. (It's funny this review option just popped up. I was just getting ready to order a second bag. 😉)",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Franklin",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Taste great but too t",
      "text": "They are huge! What were they thinking? When you buy a bulk bag or gummie bears they aren't bigger than normal; why are these gummie worms 3 times the thickness or the regular gummies. They taste great, but it's like eating a fishing lure!",
      "rating": 3.0,
      "verified": true,
      "author": "Anita J. Stafford",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Good",
      "text": "The value for the money is great. And they were soft and fresh. The flavors were ok, could’ve been a little stronger. The only main issue was that the colors all looked alike and you couldn’t tell which one you were getting.",
      "rating": 4.0,
      "verified": true,
      "author": "cnkd5",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Fresh after two months",
      "text": "I didn’t realize this wasn’t organic til I got it. I bought it as a Christmas present for someone who asked for organic gummy worms. When I went to return it, Amazon said to keep it, so I’ve been eating them for the past two months. Hard to tell the difference between the flavors just by looking at them, and the flavors taste only slightly different, but that doesn’t matter to me. The recloseable bag means they’re still fresh.",
      "rating": 5.0,
      "verified": true,
      "author": "Tabitha Lewis",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "2 Flavors, disappointing",
      "text": "There were only 2 flavors in the bag: red & yellow worms and orange & yellow. They were very soft & fresh but not the variety they were supposed to be.",
      "rating": 3.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "They taste weird/greasy",
      "text": "This is a great deal if you don't have discerning taste when it comes to Gummy Bears/ Gummy candy. They went in the trash after 2. Might be a warning from someone above that I should not be eating them! Plus they are 240 cals for 3!!!",
      "rating": 3.0,
      "verified": true,
      "author": "lizzz",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "So flavorful",
      "text": "These are probably the freshest and tastiest gummy worms ever. They are soft and full of flavor. I do recommend portioning them out in to individual bags or you’ll eat 2 pounds in one sitting.",
      "rating": 5.0,
      "verified": true,
      "author": "Trevor Southworth",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Yummy",
      "text": "These things are yummy, but also evil. This big pack is pretty cheap and they’re oh so packed with sugar.",
      "rating": 4.0,
      "verified": true,
      "author": "AdamPA",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "PERFECT LAXATIVE.",
      "text": "Very good. I ate waaaay too many of them and had to poo so bad. These are a great laxative.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Taste was good.",
      "text": "Sent this product to a 10 year old boy and it went over big. His Mom said the flavors were good and the freshness was like they made them the day they were delivered.",
      "rating": 5.0,
      "verified": true,
      "author": "Dale E. Billeb",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "If you need to order 10lbs of candy this is a good route to go!",
      "text": "As far as gummy worms go these are the best and, at $3/lb the most affordable. My mom's family has a bit of addiction to these; after forgetting to buy them before my flight to visit I was able to order these and have them prime-shipped to her house from the airport. It was great for me, and them, but do keep in mind that, at 10 lbs total, these bags weight more than a newborn.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 2,
      "publication_date": 20160412
    },
    {
      "title": "Not all flavors included",
      "text": "Nice and soft gummy with resealable bag to keep them soft is a winner. The bag I received didn't come with any of the green worms. Not really sure how or why. The other two flavors are very good though. Very flavorful",
      "rating": 3.0,
      "verified": true,
      "author": "FREECONEHEAD",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Definitely a great buy and freshness",
      "text": "I was really pleased to find these for my son. Definitely will keep buying. He’s very happy he can still have candy as long as there’s no red dye or gluten.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachael Smith",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "The part is most important is that it tastes really good.",
      "text": "There is absolutely nothing that I dislike about this item, but what I really do like about this item is that it tastes really good and reminds of only being a child.",
      "rating": 5.0,
      "verified": true,
      "author": "Dale",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Delicious!",
      "text": "I love gummy candies, and Black Forest are among the best. You can't go wrong with them. Heavy bag that reseals too, so they stay fresh.",
      "rating": 5.0,
      "verified": true,
      "author": "High-Tech Redneck",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "The best gummies!",
      "text": "These are so good in any form! We especially love the gummy bears, but these were on sale for a great price so I scooped them up.",
      "rating": 5.0,
      "verified": true,
      "author": "joe",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Worth Diabeetus",
      "text": "They are the best gummy candies I have had in nearly 40 years. People binge watch Netflix and they don't have a problem. I binge eat 2 bags of black forest and all the sudden I'm the weirdo?",
      "rating": 5.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Only two flavors and taste a bit weird",
      "text": "Opened the bag and it only has two flavors, not a single green apple/cherry worm in the bunch. Also taste a wee bit odd. I'll probably still eat them because DIABETUS, but definitely wouldn't buy them again here.",
      "rating": 2.0,
      "verified": true,
      "author": "jsMalleus",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Super fresh!",
      "text": "Definitely ordering these again! I used to get them at my local store where they are just not soft and fresh anymore. These were delivered easily and are the Freshest I have had in YEARS!!",
      "rating": 5.0,
      "verified": true,
      "author": "Diane G.",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Gummy worms were all one color",
      "text": "The flavor in the gummy worms were so good everything was perfect except that all the gummy worms were all the same color (white and red). It wouldn't have mattered to me if it was for personal use but I use these as an item in my business, so it was disappointing. I would still repurchase but I hope the next purchase is filled with all the colors of gummy worms just like the picture on the packaging has.",
      "rating": 3.0,
      "verified": true,
      "author": "Maria Zarazua",
      "helpful_votes": 0,
      "publication_date": 20200915
    }
  ],
  "product_meta": {
    "title": "Black Forest Gummy Worms Candy, 5 Pound, Pack of 1",
    "description": "Size:5 Pound (Pack of 1)Black Forest thinks you deserve the best of everything. That’s why we make mouthwatering candy using only the most thoughtful, premium ingredients, a ton of passion and a touch of love. As passionate lovers of premium candy, we envisioned batched made sweets that could delight the palate, mind and soul. We believe in a small batch process, that delivers big flavor at a sensible price. The results of our candy love can now be found in each and every pack of Black Forest candy. Hard work never tasted so good.",
    "rating": 4.6,
    "feature_bullets": [
      "SO JUICY. SO GOOD: No need to get squirmy, Black Forest Gummy Worms are made with real fruit juice. Dirt not included. Fat-free & gluten-free, each wiggly gummy worm is as delicious as the last.",
      "BLACK FOREST GUMMY WORMS: Our gummy worms will squirm their way to the top of your snack list faster then you can eat them. Made with real fruit juice, these juicy earth worms are even sweeter shared.",
      "GET YOUR GUMMY ON: From gummy bears to gummy worms, fruit snacks to sour heads, Black Forest candy is the perfect sweet snack to add flavor to your day. Real fruit flavors, naturally juicy.",
      "TASTE THE DIFFERENCE: What makes Black Forest gummies, fruit chews, & fruit snacks so good? Our classic & organic snacks have real fruit juice, so each gummy bear, chew, or fruit snack is soft, chewy, & fruity.",
      "SO JUICY, JA. You'll love the juicy goodness of Black Forest gummies and fruit snacks. Add a moment of fun to your day with Black Forest candy, whether you treat yourself or share with others."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "10.08 x 9.13 x 1.89 inches; 4.8 Pounds",
      "Item model number": "74542",
      "UPC": "041420745102",
      "Manufacturer": "Black Forest",
      "ASIN": "B000UWIIQ6",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item is not eligible for international shipping.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Gummy Candy",
      "Grocery & Gourmet Food",
      "Candy & Chocolate",
      "Jelly Beans & Gummy Candy"
    ],
    "price": 10.99
  }
}