{
  "website_summaries": [
    {
      "verdict": "A personal coffee maker that quickly brews basic black coffee into the included travel mug.",
      "pros": [
        "Excellent for people who like to grab and go in the morning",
        "Permanent mesh filter reduces waste and works with both grounds and soft pods",
        "Compact and durable"
      ],
      "cons": [
        "Some users say the coffee this machine brews isn't as flavorful as they'd like"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "A short but productive life span.",
      "text": "\"Hate\" is too strong a word -- I am extremely disappointed. It was a 5 Star until it wasn't as after 9 months it was kaput (you have to stand next to it and manually depress the turn on switch by keeping your finger on it for the brewing cycle.) From the comments section it looks like you have a 10% chance of being extremely disappointed (this is a guess since most people don't write reviews). Think of it as a rental -- about $2.20 a month for a nifty coffee brewer -- and you have a 90% chance you won't end up thinking about it as a 1 star.",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas Riggins",
      "helpful_votes": 42,
      "publication_date": 20180217
    },
    {
      "title": "Not one touch operation, must hit switch several times to brew a cup!",
      "text": "I liked the coffee maker, have used this kind for years, but over the years the quality has plummeted! My husband is a creature of habit and doesn't like to try new things, so since the Black and Decker has a low price I have humored him and continue to purchase a few a year. But, The last few I have bought have only lasted a month or so, before the switch started to fail. The last 2 only lasted a week. Time to find another coffee maker.",
      "rating": 1.0,
      "verified": true,
      "author": "A LaBelle",
      "helpful_votes": 18,
      "publication_date": 20180702
    },
    {
      "title": "Worst designed coffee maker in the world",
      "text": "This is probably the worst designed coffee maker in the world. The coffee spills in and even out when the drops fall. The mug it's supposed to be for \"Brew 'n Go\" but the cap has a hole you can't close and you spill your coffee all the way to work. I don't want to be unfair as this is my first coffee maker and cost me only $11.92 dollars but please...",
      "rating": 3.0,
      "verified": true,
      "author": "Rosa S.",
      "helpful_votes": 17,
      "publication_date": 20171027
    },
    {
      "title": "Coffee powder overflows",
      "text": "I have two of the same model which I liked very much and still keep using. However, this new version made the permanent filter very small, covering only less than half of the coffee powder cup. As a result, coffee powder soaked with hot water overflows and make mess, putting coffee powder into the cup. Black & Decker seriously replace this coffee basket with the previous version with full coverage of permanent filter.",
      "rating": 1.0,
      "verified": true,
      "author": "T. Hiroi",
      "helpful_votes": 3,
      "publication_date": 20200103
    },
    {
      "title": "Nice coffee mini coffeepot for price",
      "text": "This is a replacement for the same item I purchased about 8 years ago. It was used daily and only after many years did it finally stop working. I don't use the travel cup except to measure the water, because my favorite mug fits perfectly and I usually don't travel with my coffee. It is super easy to use and I like that I can use regular grind coffee and don't need to fiddle with pods/etc. It has a reusable filter, but for ease of cleanup I insert a #1 filter.",
      "rating": 5.0,
      "verified": true,
      "author": "AMG",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Very versatile.",
      "text": "Perfect size for a single person who doesn't want to waste a whole pot of coffee in the morning. Much better than other single cup coffee makers that use those plastic pods. This is much better for the environment and the coffee is cheaper! The coffee maker has a reusable filter for convenience, but small Gourmet Unbleached Coffee Filters, Size Number-1 are also a perfect fit if you're looking to throw out those used grounds without the cleanup. The insulated mug that comes with the pot is great. And other coffee cups around your home also can be used with this coffee maker. 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Broke right away",
      "text": "Used twice and the reusable filter didn't really work, there was a ton of grounds in the coffee. There aren't going to be paper filters that fit that size. Then the thing just stopped working all together.",
      "rating": 1.0,
      "verified": true,
      "author": "AzonRev",
      "helpful_votes": 2,
      "publication_date": 20200724
    },
    {
      "title": "Small, convenient and delicious drip coffee again!",
      "text": "I have had a Keurig (three in fact) for the past several years. It is bulky and takes up a lot of space. The cups are not environment friendly. Besides, I prefer old fashioned drip coffee. This little Black and Decker coffeemaker is a honey! It gives me slowly brewed drip coffee that squeezes every bit of delicious taste out of every coffee ground. It fits neatly into a corner and gives me lots more counter space in my tiny little kitchen. I am really enjoying it. Granted it isn't as fast as the Keurig, but good things come to those who wait!",
      "rating": 5.0,
      "verified": true,
      "author": "Babs",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Not as good as a Bella.",
      "text": "I've used Bella coffeemakers for years (~$20). They last about 1.5-2 years, then just die. So I tried this Black and Decker which costs a few bucks less thinking it would be better quality and more reliable. So, One: when you put coffee grounds in the basket - even a teaspoon full - it will overflow and leaves grounds on the hot water dispenser, over the rim of the basket, and some grounds in your coffee. And Two: to put water in the reservoir, you need to be left-handed, as you cannot see what you're pouring if right-handed. Back to Bella.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael A Lopes",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Cheap and compact, but excellent product.",
      "text": "I was pleasently suprised that it was pretty cheap but works and looks a high end product. It is very compact that it only takes up small portion of my kitchen counter. It brews rather quickly and very hot. With my thermal mug, it keeps hot for a long time. My only gripe is that since it’s a compact size, when I pour water I have very careful not to spill water. Otherwise it’s very excellent deal.",
      "rating": 5.0,
      "verified": true,
      "author": "kyung m. kim",
      "helpful_votes": 2,
      "publication_date": 20200901
    },
    {
      "title": "Reviewing, after my 4th cup of disappointment",
      "text": "I love how compact it is, and how easy it is to use and clean. I like how the switch automatically shots off at the last drip, and the cup is pretty great too. It isn't the best though. Ya need 2tbs to brew a regular strength cop o joe...but the water dispenses too fast for 2Tbs of grounds, so there's always overflow = gritty coffee. Less than 2Tbs = weak coffee. This product isn't the worst, it's just not great. It's like drinking a cup of disappointment 😟",
      "rating": 2.0,
      "verified": true,
      "author": "Jeho36",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Fire hazard!",
      "text": "Fire hazard! It begins to brew as soon as I put the water in. I’ve NEVER actually pressed the start button. Then I came back hours later and the back of it was warm. It was turned off. Even once it turns itself “off” it continues to brew making a mess because the cup is no longer there. Idk if this one just has a defect or what. The other reviews were good which is why I purchased. I am returning this one. All I can think of is this thing is a fire hazard. It has its own mind. Besides the electrical concerns.. it’s easy to clean, brews quickly and I love not having to worry about a filter.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "I like to make 1 cup at a time but hate ...",
      "text": "My previous Brew 'n Go finally bit the dust after almost 10 years. I ordered this one and it seems equally fabulous. I like to make 1 cup at a time but hate the wasted plastic of Kcups and the hassle of using the refillable Kcups. I had a Keurig briefly and went back to my Brew 'n Grow because it makes exactly the right amount of coffee for whichever mug I'm using. PS: I am not a coffee snob and don't notice a difference in the taste of the coffee between this unit and a Keurig which brews hotter. Someone else might be able to tell the difference.",
      "rating": 5.0,
      "verified": true,
      "author": "lcvincent",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "Great product I own many",
      "text": "This is my third or fourth black and decker single cup coffee maker over about the last 10 years. I have one at home and one at work and this is my work version. I got to say I really like the small travel mug that came with it and I’ve been using it every day when I make my coffee at work. This coffee maker is always easy to use easy to clean and just makes getting a fresh cup of coffee whenever I want really easy. I’ve had really good experiences with black and decker single cup coffee maker so I recommend this one to you.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike S.",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "don't",
      "text": "i was about to return it and noticed return date is past lousy product you have to pour the water from left side and it is not easy and the water comes thru before you even push the button the coffee does not stay hot and it does not make a good cup of coffee looking for another product and this one sucks i thought with the name it would be descent but dont be fooled and the same coffee in my other one cup maker was way better this is bland not strong and not worth the trouble",
      "rating": 1.0,
      "verified": true,
      "author": "Life Explorer",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Lasted a Year",
      "text": "Did what I needed it to do, gives a convenient single cup when I didn't feel like dealing with a full pot. It may have lasted longer but it ended up getting extensive use with everyone stuck at home this year. For what I paid, I got decent value and and I'm thinking of buying another. I definitely had to microwave the coffee for another 20 seconds to get it hot enough.",
      "rating": 3.0,
      "verified": true,
      "author": "Christopher Carroll",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Love the single cup size and speed of a fresh ...",
      "text": "I purchased one of these, my second one less than a year ago. The first developed a problem with filling the cup completely requiring you to stand and press the start button a number of times. I would say not a \" Brew and Go\" trait. The second one failed in the same way as the first. Love the single cup size and speed of a fresh cup of coffee but two breaking in the same way in less than a year is a design or construction flaw. In addition the water tank is on the left side not handy for right handed people to fill. Nice idea, find a more reliable alternative.",
      "rating": 1.0,
      "verified": true,
      "author": "William T. Graham",
      "helpful_votes": 5,
      "publication_date": 20161126
    },
    {
      "title": "It's Fast, Convenient,  Makes Hot Coffee!",
      "text": "This makes Hot coffee Fast! I just empty a K-cup into the filter-it's the perfect amount or use any ground coffee. The downsides: finding additional travel mugs; the size-you can't fit a cup taller than 5.5\"; and it tends to keep dripping after shutoff. All in all, so far, it's been worth it for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "LizY.",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Environmentally friendly delicious coffee!",
      "text": "Nothing worse than an environmental hypocrite throwing out tiny plastic cups. I have used these coffee makers since they came out. Smashed my last one on the floor accidentally and replaced. The only thing I would change is adding a catch-all for the final drips as I can't wait that long to drink my coffee. Therefore I just put an empty mug underneath.",
      "rating": 5.0,
      "verified": true,
      "author": "Winniesworld",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Love this coffee/tea maker!",
      "text": "I love this little maker!! I've had a few of them. It took me until my third one to realize it didn't actually stop working like I thought it did! Inside the water reservoir is a small plug-like piece in the bottom that, if you pour water into it too fast, will come dislodged. I just used a long, skinny, pair of tongs to plug it back in and it works like new again! I don't use it as a coffee maker. I use it as a tea maker, instead. There's nothing like a good cup of tea and it doesn't take much room on the counter, nor does it take more than a few minutes to brew!",
      "rating": 5.0,
      "verified": true,
      "author": "Frugal Mom",
      "helpful_votes": 0,
      "publication_date": 20170312
    },
    {
      "title": "Works ok",
      "text": "The permanent filter allows grounds to go through. I solved this by purchasing one cup coffee filters. Works fine now but don't think u can get away with not using unless you like that last sip to have grounds in it. I've been using pour through and wanted to try this. Not fantastic but works well enough. I was using a pour thru method before a porcelain top and of course a paper filter. That does make very tasty coffee.",
      "rating": 3.0,
      "verified": true,
      "author": "Violetwrites Leftow",
      "helpful_votes": 2,
      "publication_date": 20170606
    },
    {
      "title": "Don't buy this coffee pot",
      "text": "I did have it very long not even a year and the switch I want turn on and morning in black one ladies review she had to stand there and push it down and until it finished during mind just wouldn't do anything. Then the warranty that's a joke you have to pay $7.50 for them to send a new one that's under warranty, Cut the cord is get the number on the plug tapered to a piece of paper with all you told them about why you're sending a back then you still have to pay postage then you still then you have to wait 2 -3 weeks. OI don't think so I got ripped off",
      "rating": 2.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Good coffee pot except for a design flaw",
      "text": "I had the same model for over 10 yrs when it finally died. The new model works well except for a design flaw. When you open the lid, any condensation drips down the back onto the counter top. This results in the pot sitting in a puddle of water. I had to tape a cloth on the back to soak up the drips before they reached the counter top. Not a good design.",
      "rating": 3.0,
      "verified": true,
      "author": "R. Thomas",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "don't buy if you like 15 oz cups of coffee",
      "text": "Got the coffee maker yesterday. Tried it out this morning, oh boy what a disappointment. If you use the full capacity of the machine, 15 oz., you are in trouble. The water will splash on the grounds and they will be splashed all over on the inside of the coffee maker, including the water tank. If you use 10 oz., surprise it will do the same. Then came the very hard job to clean that mess. I don't recommend this one for anybody. Didn't even bothered to send back, just went straight in to the garbage can.",
      "rating": 1.0,
      "verified": true,
      "author": "frederic gassmann",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Leaky coffee maker.",
      "text": "I loved it the first week, now a short month later it leaks all the time. It brews the one cup of coffee and then shuts off. I take the cup and go. Everyday I come home and there's water on the counter. I've even waited a few minutes after it shuts off to catch the last bit of water but inevitably the counter is always wet under this coffee maker. (I have nothing else on this counter and it's not near the sink)",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20170417
    },
    {
      "title": "Poor travel mug",
      "text": "So far so good on the operation. Durability is an unknown. The included travel mug is only good for receiving the initial brew and then transferring to a real travel mug. The metal exterior of the mug is hot to the touch which means little or no insulation. For the price I guess this can be an acceptable trade-off. I use paper filters to reduce cleanup time. Filters I already have just need cutting or folding to make them fit.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve M",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "You have to hold down the switch to turnon",
      "text": "I do not think this is a good design as you cannot just depress the 'On \" switch, but have to stand there holding it down while coffee brews had I know, as I bought it for my daughter in laws visit, and she did not tell me and I just now went to make a cup nd discovered this design flaw. Update I would NOT purchase this unit for that reason alone. Company replaced as it was a malfunction Good Cust. Service",
      "rating": 3.0,
      "verified": true,
      "author": "MLG",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Unit is a bad design where a LOT of coffee splatter goes right ...",
      "text": "Unit is a bad design where a LOT of coffee splatter goes right up into the shower head part where the water goes into the grounds. You cannot clean this properly and water overflows from where the coffee goes in into the reservoir. Basically you have to rinse the whole unit out each time. Also when you think its done and the light goes off you pull your cup out from under the unit, but the coffee water still drains out from the drain hole where the coffee is. This just runs off and onto the counter. So its really a big mess to use. Very disappointed with this design.",
      "rating": 1.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20161011
    },
    {
      "title": "Great product, especially for the price.",
      "text": "Love it! Makes good coffee. Faster than my Mainstay single serve. Hotter coffee too. I wish it had a marked filter like my Mainstay so I don't have to measure out my water. I reuse my coffee cup so I don't use it to dump the water into the resivour. I would also like if it came with a drip tray. I leave a cup to catch the drips. I would but one again.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruby",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Now dead, after a few weeks, won't switch on.",
      "text": "This unit had a broken cover out of the box, but it was wrapped as new. I still had the old one (about 5 years old when it died). Switched covers, all good. After a month, it won't switch on. I've bought these before and had great longevity with them. The one now at work has been there 5 1/2 years, (started life in my house, many years before that), so I'm guessing, AT LEAST eight years old (daily use at home and after I moved it to work). I'll try another, but I'm leery after this experience.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Still working",
      "text": "I bought this for my husband 2 years ago for Christmas. It started acting up, so I ordered him a new one. A great value for the price. After I ordered the new one the original one started working again, so new one is still in the box. He uses it 3-4 times a day. He loves it. He can make his coffee as strong as he wants and only takes a few minutes to make is that. Definitely get your money's worth from it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "The coffee maker just stopped working! Then the customer service is not available!!",
      "text": "This is a very Bad product! This coffee maker just stopped working!!! I was trying to call the customer support 2 weeks ago, but line just kept ringing for 30 mins!!! It's ridiculous!!!!! It's so disappointing!!! I don't recommend this coffee maker!! Not worth a money!! Not even worth the time!! What a wastes of time calling the customer service!!!",
      "rating": 1.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Works Great!",
      "text": "I love this thing! As the only coffee drinker in the house, it's perfect. I don't have to worry about wasting coffee on making a 1/4 of a pot for myself! It's nice that there is a built-in filter, which eliminates more paper waste. I would suggest opening the top a little after the coffee has finished brewing, just to let the inside air out. I clean the filter and holder after every use and wipe it down nicely on a regular basis. Keeps it nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "First leaked and second BROKE after 3 months!!!!",
      "text": "This is a terrible product. The first one I received leaked all over my counter. I contacted Amzn and they did replace it for free very quickly. The second one was ok. Not great. But ok. But after 3 months it completely stopped working. It just wouldn't turn on. I don't understand the high ratings for this item which was the whole reason why I bought it. Perhaps it use to be good but not anymore. Buyer beware.",
      "rating": 1.0,
      "verified": true,
      "author": "JayCee",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "The inside of the cup  wasn't as expected.",
      "text": "I really like this coffee maker. It makes the coffee quickly and the cup is a nice size. The one drawback is that it does not keep the coffee hot like you would expect from a stainless steel cup. That is because it is only stainless steel on the outside. The inside is that hard black plastic you see around the lip and the handle of the cup. I like that the coffee is made directly into the cup instead of into a small pot. Also, the filter is reusable. If you want the cup for on the go, not the best choice.",
      "rating": 3.0,
      "verified": true,
      "author": "Sally Mallard",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "LIKE IT A lot!!!!",
      "text": "Just what I wanted. A one cup coffee maker. Works great. easy to clean, and can make 2 cups back to back if needed (if I have company) . Did leave a few drips on counter...not sure if it is because it is hard to fill water with cup provided... until I get used to how much water to use to fill cup. Only used half a dozen times so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Mills",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Replaced a big Keurig",
      "text": "My big Keurig bit the dust, and thought I would try this little bargain coffee maker or awhile. I have had it about a week now, and am pleasantly surprised. It is a little lightweight, but does the job, and makes two cups of good coffee almost as quickly as the Keurig did. I find my leftover K cups hold just the right amount of coffee, so am using them up. Just dump the contents into the basket. When I have used them all, it will be nice to get away from that expense and go back to a big can of Folgers again. All in all, I am very pleased with the change.",
      "rating": 5.0,
      "verified": true,
      "author": "mizjean",
      "helpful_votes": 3,
      "publication_date": 20150808
    },
    {
      "title": "Bad tasting coffee",
      "text": "It doesn’t make good coffee. The same coffee brewed in my coffee maker at home tastes great but tastes weird when I brew it in this. It also overflows the cup if you put too much water in the reservoir. They really should put a line showing the amount of water to put in for an average 12oz coffee mug. I walked away from my desk once while it was brewing and came back to a desk covered in coffee.",
      "rating": 1.0,
      "verified": true,
      "author": "JW",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Cheap but makes the coffee",
      "text": "I'm a no fuss kinda person, who just needs something to heat water and run it through coffee grounds. This one cup size is smaller on my counter top than regular sized coffeemakers, which is wonderful - and does the job exactly the way it's supposed to.",
      "rating": 5.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Back to simplicity!",
      "text": "Got rid of my fancy pod coffee maker and went back to basics with this nice single cupper. What about those pods? Well open them up and pour it into this machine. Works just fine. Seriously, time to ditch those expensive pods. Easier to make coffee to your taste. Fast brewing too! Takes up 1/4 of the counter space the pod maker did.",
      "rating": 5.0,
      "verified": true,
      "author": "djhack",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "This one is 5-Stars all the way!!!",
      "text": "Brews amazingly delicious coffee, quickly and piping hot. Small but sturdy machine, good quality reusable filter, no grounds pass thru filter, approx 15oz capacity, no glass to break, quick rinse the filter and basket and you're set. Perfect for small kitchens, dorms, travel trailers, the office, anyone wanting to simplify or downsize their coffee routine. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "EMM",
      "helpful_votes": 2,
      "publication_date": 20170223
    },
    {
      "title": "Nice, compact coffee pot",
      "text": "Overall construction seems good. Too soon to rate the life expectancy. The included coffee mug is an added bonus. It seems to be well constructed and is comfortable to hold. But the main purpose of the purchase was for a simple to use, convenient coffee maker for one or two cups of coffee a day. All parts are easy to dissemble, clean and reassemble. This is far better than using the Keurig with its expensive K cup system.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Does not last, messy",
      "text": "After some use, the \"on\" switch will not trip and stay on, you have to hold down the switch and not let go for the whole cycle. Additionally it becomes quite messy. It does not seal well when closed and the grounds often get stuck all over the top and overflow into the water reservoir. This is not due to overfilling, but perhaps a flow rate/not draining fast enough issue as the filter chamber fills up and overflows grounds internally. This one went straight to the trash can.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "A definite go - to item",
      "text": "I've used this model for years. I also have a Nespresso for espresso which is superb. The Black and Decker makes my daily coffee,, once cup at at time, simply , cleanly , and just as i want it. They dont last forever, sometimes the one switch on it, starts to fail ,, sometimes it starts to make only half a cup, leaving the rest of the water in the reservoir. But for the price i think its a great value , though not 'investment grade', LOL. Its simple, it works, its small.",
      "rating": 5.0,
      "verified": true,
      "author": "b",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Perfect size.",
      "text": "My orig. Brew & Go finally quit. This was my replacement. Smaller cup actually works better for me. If I were to order again (and I might), I'd opt for the white cup so I could re-heat in the microwave...I didn't think about that when I ordered the stainless steel one. Love it, great price too.",
      "rating": 5.0,
      "verified": true,
      "author": "sheila",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Practical product that is easy and inexpensive to use.",
      "text": "This is so much less expensive to use than the cartridge type of single cup coffee maker. t is simple, convenient and fast to make a cup of coffee! The cup is 5 1/4\" high and I only say that because you will probably want to replace it with your own cup and anything taller than 5 1/4\" won't fit. This cup is black plastic inside and I replaced it with one that is stainless inside and out, which I consider to be a healthier choice. I use #1 Melita cone filters which I buy on Amazon in 12 packs. I do enjoy using this coffee maker. It isn't fancy, but it is practical!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Reader",
      "helpful_votes": 2,
      "publication_date": 20150608
    },
    {
      "title": "Another Chinese product that smells like a toxic substance.",
      "text": "I just got my coffee-maker, and have been trying to remove the incredibly noxious odor coming from the interior of the machine. Multiple passes with filtered water and a vinegar-water rinse have made no difference. The water ends up smelling very strongly of the same chemical. Calling the company for a remedy -- if there is one.",
      "rating": 1.0,
      "verified": true,
      "author": "BLH",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Great little coffee maker!",
      "text": "This is a great single serve coffee maker. I had a big fancy Keurig, which didn't last long and took up a lot of space on my counter. This little coffee maker makes delicious coffee. I grind my own coffee beans and use three or four tablespoons. It's fast and easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Rita",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Works great for a week then fails!",
      "text": "Will most likely send back. Worked great for a week or so. Now it splatters coffee grounds all throughout the inside, and I even use less that what it calls for!! Extremely upset.",
      "rating": 1.0,
      "verified": true,
      "author": "fifrox",
      "helpful_votes": 60,
      "publication_date": 20160310
    },
    {
      "title": "Great buy",
      "text": "It is just as advertised and works perfectly. The only thing I don't like is that it is difficult to gauge how much coffee to use with the over-sized cup. Otherwise a great buy. I have now used this coffee maker for 12 months and I must replace it. It no longer delivers a full cup and makes terrible noises while it is brewing. I guess I will return to Mr Coffee which has always lasted 3-4 yrs. It was great while it lasted.",
      "rating": 3.0,
      "verified": true,
      "author": "Frankie L. Winchester",
      "helpful_votes": 3,
      "publication_date": 20160918
    },
    {
      "title": "Had it about a month and it's broken",
      "text": "The only reason this is getting one star is because it comes with a really good coffee mug and I'm keeping the coffee mug. I purchased the thing in April 2016. We're at the end of May and it's already not working properly. I expected so much more quality from Black & Decker. The filter stopped draining and I have to use a regular coffee filter. Also, the inside cover to the plastic filter snapped off. The machine has been cleaned/washed, so I don't want the seller to reply back with any of that nonsense. I will just go buy another one of a different brand at Target or Walmart.",
      "rating": 1.0,
      "verified": true,
      "author": "Erin A. Alexander",
      "helpful_votes": 3,
      "publication_date": 20160522
    },
    {
      "title": "Brew Button Doesn't Work So It's Useless",
      "text": "This is my second Brew 'n Go. The first one lasted a couple of years and then the button you push down to make the coffee brew stopped working. On the second one, the same button stopped working almost immediately. It would work for a few days and then stop working. Most recently I've had to hold the button down during the entire brew process. I will now look for and purchase a different brand. If Black and Decker would fix the persistent problem with the power button, this would be a nice little coffee maker. But for now, it's a useless waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy A.",
      "helpful_votes": 2,
      "publication_date": 20160810
    },
    {
      "title": "Design change NOT an improvement.",
      "text": "Owned several B&D brew&go's over the years, worked great. Design changed not for the better. Lid of brewer is strange shape, does not open completely so one can not pour water into brewer without spills. Also there is always a puddle under the cup after brewing. Bad design.",
      "rating": 2.0,
      "verified": true,
      "author": "KitKat",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Doesn't heat the water  temperature  high enough for a flavorable brew",
      "text": "I bought this to replace my Kitchen Selectives one cup coffee maker. The KS was a great coffeemaker used it for years (see my other review on it) however it did not have an automatic shutoff. Tried this coffee maker for about 6 weeks. The taste of the brew was below expectations. I drink one cup of coffee a day (doctor's orders) I need it to taste good. I tried several brands of ground coffee and they all tasted the same-flat and unflavorable. The problem is the water does not reach the right temperature to bring out the flavor of the coffee. Couldn't take it anymore, so I packed it up for Goodwill. I hope someone will enjoy it.",
      "rating": 2.0,
      "verified": true,
      "author": "Tomatozoup",
      "helpful_votes": 0,
      "publication_date": 20160924
    },
    {
      "title": "This is a great little one-cup maker -- BUT -- I've purchased a ...",
      "text": "This is a great little one-cup maker -- BUT -- I've purchased a total of 3 of these. The first one seemed to work well and I gave it to my son when he was away at college. So then of course, I had to get another one for myself, so I ordered one but the switch on the thing gave out/quit after just a month or two. Just recently I decided I wanted another one, hoping I wouldn't get another dud. The 3rd one only lasted through 3 cups before that switch went out. Disappointed. I returned the coffee maker then and promptly got my refund.",
      "rating": 4.0,
      "verified": true,
      "author": "Babe",
      "helpful_votes": 3,
      "publication_date": 20151205
    },
    {
      "title": "Outstanding desktop coffee maker",
      "text": "A great little machine for the price. I bought it to replace a different brand that broke down because this uses the same Melitta #1 cone filters. It makes a decent cup quickly, no mess as long as I leave the cup underneath the extra 30 seconds to finish dripping or place another under it (I use 12oz Styrofoam at work) . I wish it were taller so I could use my other cups and I would have liked visible water level graduations but at this price I can't much quibble.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr and Mrs Williams",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "Makes a steaming cup in a matter of moments",
      "text": "I have now had this appliance for three days. In that time I have made four cups of coffee and two cups of tea. I love it. It makes a steaming cup in a matter of moments.",
      "rating": 5.0,
      "verified": true,
      "author": "ASBelle",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Save your $",
      "text": "I gave it 2 stars because it makes coffee. it also leaks, dumps grounds in the cup, is a nightmare to clean and the light shuts off while it's still brewing. Don't bother.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael LaCroix",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Perfect One cup coffee pot",
      "text": "This is our second one. The first one lasted well over 10 years... with daily use making about 5 cups a day!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve3129",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "They made a good one here.",
      "text": "This is my second one because I left my first one with my parents and my dad really likes using it so he kept it. The first one was purchased over 4 years ago and still works well. I hope this new one last just as long. The mug could be better made but at its price range, you can't go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "Dino",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Especially like the handle on the insulated mug",
      "text": "My old single coffee pot finally bit the dust, so I was happy to find this one to replace it. I especially like the handle on the insulated mug. It is well balanced and helps to prevent spills on my work in my office. It brews quickly and is easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Richardson",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Great!",
      "text": "I am on my second one. It only lasted a year but for the price it is worth it. Who needs an expensive pod machine when this does a great job making one cup of coffee using grounds. I would recommend it to everyone!",
      "rating": 5.0,
      "verified": true,
      "author": "pamela rogers",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Makes good coffee, and doesn't cost a fortune.",
      "text": "Makes good coffee. I like that I can control how strong or weak I make the coffee by adjusting the amount of water I add. I can't find cone filters to fit at my grocery store, but have discovered that paper towels work great as a filter. Also I can't fit my Contigo travel mug under it and I am not wild about the travel mug that comes with it",
      "rating": 4.0,
      "verified": true,
      "author": "Lora Lee",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Great little coffee pot!",
      "text": "Great little coffee pot. Brews fast and very convenient with the built in filter. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Schneiderman",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Perfect for on the go single person!",
      "text": "This is the perfect coffee maker for someone who loves a big cup of coffee without waste. The mug that came with it is big and convenient. Very easy to clean and because of the basket filter, you can make whatever strength you like. Just fill basket with grounds, add water, and push button. Coffee goes directlty in mug and it shuts off automatically. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sylvia Davis",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "If I could give this appliance zero stars I would ...",
      "text": "If I could give this appliance zero stars I would. We bought this coffee maker to take on the road with us. When we first got it, we ran through a cycle with just water to clean it, but didn't try it again until our first morning away from home. After filling the reservoir with water, and the basket with coffee, we hit the on switch and nothing happened. We tried jiggling it on and off and still nothing happened. We even switched outlets thinking that might have been the problem. Wishful thinking.The machine had died before it had actually brewed one cup of coffee. I have lost all faith in the Black and Decker name at this point.",
      "rating": 1.0,
      "verified": true,
      "author": "Alec Hovagim",
      "helpful_votes": 2,
      "publication_date": 20160710
    },
    {
      "title": "Works as expected",
      "text": "I saw many reviews say that this coffee maker does not keep you coffee hot. The fact is that as soon as the coffee finishes brewing, the machine immediately cuts itself off. It does not keep the coffee hot, but if you pour it in a thermo, immediately after it brews, it will stay very hot.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Great for a single cup",
      "text": "Compact and works well in my office. It is easy to clean. The coffee comes out super hot. I have to let if sit for a bit before I could drink it. I'm still trying to get the right ration of coffee grinds. I like that it turns off automatically.",
      "rating": 4.0,
      "verified": true,
      "author": "DMB",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Great coffee maker and great price!",
      "text": "Love this single cup coffee maker. This is my third one: my first one was used multiple times a day for 11 years before it just started to get old and the reusable filter really started to stain etc. I just bought 2 more—one to replace the old one and one more to bring to work since my coffee club disbanded, lol. GREAT product for a GREAT price!",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "I am very disappointed in this coffeemaker",
      "text": "I am very disappointed in this coffeemaker. I purchased it toward the end of our camping season last year - used only a couple of times. Used it once this year and then it died. I know it wasn't expensive, but I did expect it to work more than 3 times. I would not recommend this unit.",
      "rating": 1.0,
      "verified": true,
      "author": "T. Stanley",
      "helpful_votes": 2,
      "publication_date": 20170422
    },
    {
      "title": "Don't buy if you like mellow coffee",
      "text": "Coffee tasted good for the first week. I cleaned it with vinegar and water as recommended but the coffee began to taste bitter. I changed coffee brands, changed the grind and cleaned it again, but the coffee tasted terrible and rather bitter. I then examined it carefully and discovered that one cannot actually clean all the coffee debris from it. So I think it is old coffee deposits that are responspible for the bad taste. The cup is nice.",
      "rating": 1.0,
      "verified": true,
      "author": "DDvey",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "broke after four months",
      "text": "It worked fine for about three and a half months. Then it would turn on only intermittently Now after a little over four months, it won't turn on at all. I expected better from Black and Decker.",
      "rating": 1.0,
      "verified": true,
      "author": "Eddie201",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Perfect for brewing that single cup of coffee in the morning.",
      "text": "I love this product. I drink one morning cup of coffee at home and do the rest of my coffee-drinking at work. It's inexpensive enough that when my AirBNB host said there was no coffee pot in a Manhattan apartment, I took one of these and left it behind for future guests. Also, I like that I don't have to buy (more expensive) pods for my single brews and can adjust coffee strength to my liking.",
      "rating": 5.0,
      "verified": true,
      "author": "tvgaz",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Perfect for the one cup of HOT coffee...",
      "text": "Works good for me...I get a hot cup of coffee and I don't have to throw away a half of a pot full...only it does not shut off. Yet, that is good it makes me get my lazy self up away from the desk and stand for a few minutes. Great little machine, you can always count on Black and Decker.",
      "rating": 5.0,
      "verified": true,
      "author": "Sand D",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Love my coffeemaker",
      "text": "Love love this coffeemaker single serve, we have 2, no need for filters, just add cold water, one scoop of coffee grounds and some creamer inside the mug, done, coffee comes out steamy hot, first one I bought at a local store, bought another at the same store for my brother, then bought this one here, we love that our coffee is in our mug good to go!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra Y. Morales",
      "helpful_votes": 0,
      "publication_date": 20170510
    },
    {
      "title": "... on whether or not I think this was a good purchase. on one hand",
      "text": "I've been waiting a while to write this review because I'm honestly torn on whether or not I think this was a good purchase. on one hand, it was $15 and came with a mug, so what can I really expect? On the other hand, it just barely works well enough for me to keep using it and not buy something else. It won't utilize all the water i put in the reservoir, making me have to run the cycle twice, more often than not, to fill up my cup. Overall, I would only recommend buying this if you are on an extreme budget. I'm sure there are better coffee makers out there, if you do your research.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric B",
      "helpful_votes": 0,
      "publication_date": 20160220
    },
    {
      "title": "Grounds platter everywhere.",
      "text": "Easily the worst thing I could have purchased. It makes a huge mess every time I try to brew a cup. Grounds splatter all over the entire inside, into the water tank, and even into my cup of coffee. Even if I use less grounds than it suggests. This is bad news for anyone that likes a strong cup of coffee. Awful awful product. Don't cheap out and buy this one.",
      "rating": 1.0,
      "verified": true,
      "author": "TheJoneses",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Great for the price, but cup has plastic inside and not stainless, not ideal health-wise",
      "text": "For the moment I only had 5 cups done in the machine, and so far works great. Bummed that the cup is stainless on the outside only (Pointless?) but has plastic inside.. Don't think it's the healthiest thing to pour hot coffee in plastic. Other than that, it seem good. The filter seams sturdy enough to be gently cleaned without perching it, but I'll be looking to replace it with a stainless steel permanent filter instead of this plastic. Hasn't leaked on me for the time being.",
      "rating": 4.0,
      "verified": true,
      "author": "MB",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Buy something cheaper, this is a pass.",
      "text": "Worst drip coffee maker I ever had, and i used cheaper and less brand name ones. What's going on there during brewing that makes coffee grounds spray all over the machine? I have to wipe showerhead every time after use because its covered with coffee grinds. I NEVER had this happen in any type of coffee machine. And it's not too much coffee or water since water leaks thru and I get half a cup of coffee regardless of how much water I pour in. The WORST!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Masha",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "perfect one cuppa",
      "text": "This maker is perfect for the urge for one cup of java. If you're like me and want to keep counters clear of appliances, this one tucks nicely into a cabinet when you're finished with it. Just turn it over so the water reservoir dries out better and voila...ready to hide.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "It works, and it's messy, and there is a fix.",
      "text": "Pros: it works. quick and hot coffee in minutes. Cons: It is messy as other reviews said. Solution: I bought #1 filters from amazon. Use 1.5 filters every time: 1 for holding the coffee like they are supposed to, and 0.5 to cover the top. Wet the filters before using, otherwise you notice significantly less coffee than water you put in. It keeps the brewer clean, no messiness at all. and no washing needed - pick up the filters and dump them. Although I do try to wash it every week.",
      "rating": 4.0,
      "verified": true,
      "author": "Joy",
      "helpful_votes": 0,
      "publication_date": 20160626
    },
    {
      "title": "Amazing for one cup- easy to clean",
      "text": "I love this little guy. I can’t handle much caffeine, so this is perfect for me. The only negative I have to say is when it’s brewing, it sounds like a mouth breather when they sleep. I’ve nicknamed the brewer Lil Wheezy.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Sanders",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Not for everyone",
      "text": "I was excited to try this product. After a few uses I realized that this wasn’t for me. I had issues with coffee grounds in the coffee, cleaning it was more challenging then I thought and the water to coffee ratio was a bit confusing. I also missed the pause and sip function. This works well if you have short mugs, or always use the same mugs. The coffee is nice and hot and does t take long to brew.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon User20",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Good product, hot coffee, cup not as great.",
      "text": "The little coffee maker is great - I'm the only person in our household who has coffee at home each morning. Using the big coffee pot just wasted coffee and time, with cleaning it so often. This serves my needs perfectly, and the coffee is hotter than all 3 regular pots I've had over the last 10 years. However, my cup is breaking. It's just out of the return period, and there is no way I can see to contact Amazon or B&D to take care of the problem. (The rubber licorice like piece that seals the lip of the cup between the plastic and metal is pulling out.)",
      "rating": 4.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "I love how it brews the coffee and it tastes great ...",
      "text": "I just purchased this item and started using it on June 26, 2017. Exactly what is explained in the other reviews is happening. The coffee grinds get over everything. I've tried using less grounds but it doesn't seem to help. Basically I believe the drop hole is too small and can't keep up with the water in the filter thus making the grinds float up and get everywhere. I love how it brews the coffee and it tastes great but it's a lot of cleaning.",
      "rating": 2.0,
      "verified": true,
      "author": "Dina schutt",
      "helpful_votes": 2,
      "publication_date": 20170629
    },
    {
      "title": "just stopped working",
      "text": "This one shot coffee maker was just the right size and was working perfectly for a little over 2 1/2 months. Then it just stopped working all together. Would not recommend this product",
      "rating": 1.0,
      "verified": true,
      "author": "Freedom Rider",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Love it!",
      "text": "This is perfect for me at the office!! I had a standard Mr. Coffee but it was a hassle with filters, making too much/little, cleaning it, worrying about leaving it on by mistake overnight. I wanted something simpler but I didn't want a Keurig for cost reasons. Meanwhile, there's no heating element with this one and it shuts off automatically after filling the cup. It comes with a filtered basket, but I prefer to use a paper one (that cleaning thing again). And I mostly only have one cup anyway, and this is a nice-sized cupful, i.e. more than 8 oz. I'm a happy camper!",
      "rating": 5.0,
      "verified": true,
      "author": "Cherie",
      "helpful_votes": 0,
      "publication_date": 20160201
    },
    {
      "title": "Fantastically average; terrifically standard!",
      "text": "This is a great coffee maker for the money. I have displayed it prominently in my cubical where is makes afternoons less unbearable. It is not fancy and has no special features but makes a decent cup of coffee. Brew time is about 4 minutes but leave the cup there for a few extra minutes as there is no way to stop the dripping. I must complain about the inside of the \"stainless steel\" mug being plastic. This is not a huge issue but was disappointing. The cord is also very short (~24inches) meaning that I needed an extension cord to reach the power outlet directly beneath the coffee maker. However, as a cheap coffee maker, this thing is great!",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20150720
    },
    {
      "title": "Simplicity at its finest",
      "text": "This is by far the simplest, brainless, no-frills coffee maker ever. Just what I need first thing in the morning. My wife and I don’t always drink the same flavor coffee or wake up at the same time, so this is perfect for us. Because it’s so lightweight and low wattage, I bring it on assignment with me around the world. I don’t use the travel mug because the handle is awkward and flimsy.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula Johnson",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Not even worth $20",
      "text": "So.... I just received this on May 6th 2020, and as of today May 26th 2020, this device has died. I decided to clean this coffee maker because oil residue I believe from my coffee, was grossing me out. I followed the directions with the vinegar cleanse. At the 4th rinse go around, it died! Hit the button to brew, and nothing. The light doesn't come on...nothing. I guess you get what you pay for. 😒",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Makes great coffee but",
      "text": "Makes great coffee but, I bought 3 and 2 of three have failed.It starts making coffee and switch trips before coffee is finished brewing. I need to get in touch with someone to get this new one replaced again. I'm not sure what the problem is, thermostats or sumpin is wrong. I'm just learninghow to spell. Thank you-Don This review was written prior to non return date but I have not as of this date 3-14-16 heard from amazon. I have received 4 of these units and 2 of the four have failed and now they say I can't return second bad one. I realize its not an expensive unit but 50% failure is not a good average.",
      "rating": 3.0,
      "verified": true,
      "author": "donald tuten",
      "helpful_votes": 0,
      "publication_date": 20160306
    },
    {
      "title": "I love it, put my Krups 12-cup away, & use it everyday!",
      "text": "Love the insulated cup, permanent filter - although I recommend paper #2 - and the ability to brew from ground coffee or cups. Wish I could program to Alexa...think I've figured that even that's possible.",
      "rating": 4.0,
      "verified": true,
      "author": "lilliansbest",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "I love this brew and go",
      "text": "I love this brew and go. I've bought it because I've became pregnant and well you're not supposed to be drinking too much coffee meanwhile, so this is perfect for what I needed! I make my decaf here and the rest of the house gets the whole pot of regular coffee lol fast and easy. One small suggestion would be finding a way to keep your coffee hot If you don't grab it right away :)",
      "rating": 5.0,
      "verified": true,
      "author": "Gi Lawlor",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Good for Black & Decker",
      "text": "I had one quit working after a month or so but others have kept going. Great for one person! Don't like the taste of Keurig or the coffee \"cups\" as they upset my stomach and create too much plastic in the landfills!!",
      "rating": 4.0,
      "verified": true,
      "author": "BOCAGIRL",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "PERFECT!.....brews great, small, compact and durable",
      "text": "I love, love, love this little Black and Decker! - I scoured Amazon for just the right coffeemaker and this is it for me! - I make one cup in the morning, then the cleanup of the filter is so easy - and if I want another cup, again it is so easy - I have had alot of coffee makers cheap and very expensive, and this little guy is my favorite - i recommend buying this",
      "rating": 5.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Basket does not drain fast enough.",
      "text": "I had a B&D single cup maker for many (over 14) years and loved it. The basket finally wore out so I bought this one. But the basket on the newer model is not the same. It does not have near enough straining area. It causes coffee grounds to be forced into the coffee. This did not happen with the old style filter. Plus, the pore area is smaller which makes it easy to spill water outside the reservoir. And, the lid is such that when you open it, condensed water runs out onto the counter. The old model was so much better.",
      "rating": 3.0,
      "verified": true,
      "author": "Sandy Goulding",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Works like a charm",
      "text": "I have another older unit of this machine, which I've had for yeeaarrss, but decided I'd like to have one of these upstairs as well. Still a great lil machine. It gives me a great cup of hot water for tea or a cup of coffee within minutes and hasn't given me any problems. The only difference between my old machine and this one is that the cord is now a little short. Works perfectly on a kitchen counter but a plug in more than about 14-15 inches away, nope! The older unit has about a 3 ft cord, so I don't know why the change.",
      "rating": 5.0,
      "verified": true,
      "author": "AVT",
      "helpful_votes": 0,
      "publication_date": 20160212
    },
    {
      "title": "Great while it lasted about 2 mos after one a day use",
      "text": "This is my second one I bought and purchased two separate for friends. My first one lasted over a year and then started leaving half the water in the reservoir. I tried to clean it used vinegar to flush it finally gave up and bought a new one. This one lasted about 2 months now nothing past the time to return. Red light does not come on, nada. Still loved it while it worked will not buy again not very dependable. Reading the reviews I see I am not the only one I am too cheap to buy a keurig plus I read how they sometimes explode will keep looking for an alternative.",
      "rating": 5.0,
      "verified": true,
      "author": "Double A",
      "helpful_votes": 0,
      "publication_date": 20150919
    },
    {
      "title": "Stopped working in one day",
      "text": "It was nice for the one day that it worked. I went to make coffee this morning and it wouldn't turn on. The light doesn't come on, and it doesn't brew. YAAR (yet another Amazon refund).",
      "rating": 1.0,
      "verified": true,
      "author": "William B. Bertram",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Great coffee maker!!",
      "text": "This is a great little coffee maker for the price. It’s still going strong after 4 1/2 years. One thing we do is pour out any excess water after using it every time. This seems to cut down on the need for frequent vinegar cleaning due to our hard well water.",
      "rating": 5.0,
      "verified": true,
      "author": "Dimwit",
      "helpful_votes": 0,
      "publication_date": 20191028
    }
  ],
  "product_meta": {
    "title": "BLACK+DECKER Coffeemaker, 1, Black/Stainless Steel",
    "description": "The BLACK+DECKER Brew 'n Go Personal Coffeemaker is ideal for an active, on-the-go lifestyle! Your coffee brews directly into a 15-oz. stainless steel thermal mug that fits most car cup holders. The permanent grounds filter is compatible with coffee grounds and pre-packaged soft pods, and it's easy to rinse clean in the sink. One-touch operation quickly delivers the morning coffee you need, with a compact design that's perfect for small kitchens, apartments, and dorm rooms.\n\nBlack+Decker and the Black+Decker logo are trademarks of The Black & Decker Corporation and are used under license. \n*Cup equals approximately 5 oz. (varies by brewing technique)\n\n\n\nAMAZON.COM\nGreat for commuters, office professionals, and one-coffee-drinker households, this personal coffeemaker brews 15 ounces of coffee directly into a stainless-steel travel mug. The mug has a rubber handle for a safe grip and a lid to keep coffee hot. It's tapered to a 2-1/2-inch-diameter bottom, so it fits most vehicle cup holders. The coffeemaker itself is designed for an on-the-go coffee drinker. It has a permanent filter--no messy disposable paper filters required--and shuts off automatically after brewing. The mug, filter, filter basket, and mug lid are dishwasher-safe, and the coffeemaker can also be used to heat water for tea, hot chocolate, and instant foods like oatmeal and soup. Made of gleaming black plastic, it measures 9-3/4 inches high, 7 inches wide, and 6 inches deep, and carries a one-year warranty against defects. --Fred Brack Troubleshooting Steps: Brewing Coffee – 1.) Lift the one-piece cover. Pour one full mug of cold water into the water reservoir. 2.) Place the permanent filter into the filter basket. Add ground coffee, (we recommend approximately 2 ½ tablespoons). Close the cover. 3.) Remove the lid from the travel mug and add sweetener, cream or milk to the mug before brewing; replace the lid. Place the mug on the mug rest directly under the filter basket opening. 4.) Press the power switch and the power indicator light will illuminate. The coffeemaker and power indicator light turn off automatically when brewing is done. Allow the coffee to finish dripping from the unit before removing your travel mug. Note: There will be slightly less coffee in your travel mug than the amount of water added, as the grounds absorb some of the liquid.",
    "rating": 4.2,
    "feature_bullets": [
      "Personal Coffeemaker - This single-serve coffeemaker brews directly into the included travel mug",
      "Permanent Grounds Filter - No need to buy wasteful paper filters",
      "Automatic Shutoff - The coffeemaker turns off immediately after brewing",
      "15-oz. Travel Mug Included",
      "Space-Saving Design - small kitchens, apartments, and dorm rooms",
      "Note: Cup equals approximately 5 oz. (varies by brewing technique). Volts:120V/60Hz. Included Components: (1) Coffee Maker, (1) Travel Mug",
      "Please follow the Use & Care manual for proper and successful use of the Black+Decker DCM18S Coffeemaker"
    ],
    "specifications": {
      "Product Dimensions": "10.2 x 7 x 6.9 inches",
      "Item Weight": "1.4 pounds",
      "Department": "Kitchen and Dining",
      "Manufacturer": "WINQ9",
      "ASIN": "B00005MF9C",
      "Item model number": "DCM18S",
      "Customer Reviews": "4.2 out of 5 stars7,218 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#11,393 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 2, 2003"
    },
    "categories": [
      "Travel & To-Go Drinkware",
      "Home & Kitchen",
      "Travel Mugs & Tumblers",
      "Kitchen & Dining"
    ],
    "price": 24.99
  }
}