{
  "website_summaries": [
    {
      "verdict": "Vudu sets itself apart from similar Internet video-on-demand boxes such as Apple and Netflix by delivering movies at better quality--up to full 1080p HD resolution and 5.1 surround sound.",
      "pros": [
        "Set-top box that plays Internet-delivered video content at resolutions up to full 1080p HD",
        "solid selection of movies and TV shows, as well as adult content, for sale and rental",
        "no monthly fees",
        "standard-definition and some HD selections start immediately",
        "excellent onscreen interface and scroll-wheel remote",
        "simple setup and configuration"
      ],
      "cons": [
        "Best-quality HD content requires download queuing before viewing",
        "can't stream media from networked PCs",
        "can't transfer movies to portable devices for on-the-go viewing",
        "no built-in Wi-Fi",
        "rentals limited to 24-hour viewing period",
        "impressive selection of titles still pales in comparison with the tens of thousands available from Netflix and Blockbuster",
        "compatibility with universal remotes requires add-on dongle",
        "box is worthless if company ever goes under"
      ],
      "aspects": {
        "Design": 9.0,
        "Features": 7.0,
        "Performance": 7.0
      },
      "publication_date": 20070905,
      "rating": 7.7,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Vudu was exactly as promised",
      "text": "I just picked up a Vudu box a few weeks ago and could not be happier, I have bought two more since then as gifts. It was VERY easy to setup and has a ton of movies. It is very easy to use, quick, and even looks cool. The only complaint I would have is that not all new releases are available right now, but from what I have read, their catalog is increasing rapidly. I can't believe that more people don't know about the Vudu, but their marketing is lousy.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike C",
      "helpful_votes": 3,
      "publication_date": 20081123
    },
    {
      "title": "However I'm glad to have my VUDU movies",
      "text": "Not quite what I was expecting seemed to be an older model. However I'm glad to have my VUDU movies. My previous unit by samsung quit working.",
      "rating": 3.0,
      "verified": true,
      "author": "RHampton",
      "helpful_votes": 0,
      "publication_date": 20150126
    },
    {
      "title": "Wireless devices like this are great and Vudu usually has really great ...",
      "text": "Wireless devices like this are great and Vudu usually has really great deals as far as video quality people need to keep in mind if you have a lot of devices connected to wifi that can effect your signal may make video or games run slower if you have many things going on at once",
      "rating": 5.0,
      "verified": false,
      "author": "jdorr",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Price dropping for Box, wow.",
      "text": "I got my Vudu for $399, a few weeks later it was $295. Smart move for Vudu, since Apple TV is trying to crowd them out of the market. Vudu is far better than Apple TV, it has more movies and a better platform for delivering them. I'll stick with the new kid on the block. The new price makes Vudu the better buy (more movies, more storage space, brighter horizon). I noticed that Vudu also dropped some vudu dollars in my account, maybe to compensate current owners for the price reduction in the box. Smart marketing. The other big plus is that netflix and blockbuster are in my past!!!",
      "rating": 4.0,
      "verified": false,
      "author": "Poseidon",
      "helpful_votes": 6,
      "publication_date": 20080124
    },
    {
      "title": "fun and cheap",
      "text": "not too much to say other than this is a fun way to get high def (or standard if you roll that way) for way less than a blu ray, not to mention way less cluttered. I would also add that this thing is so much easier to use than any other solution- the controller has 5 buttons and a wheel! my girlfriend and my mom have no problem using this. i'm sure even my grandma would get it!",
      "rating": 5.0,
      "verified": false,
      "author": "Hawaiiensis",
      "helpful_votes": 0,
      "publication_date": 20080928
    },
    {
      "title": "Vudu Rocks!",
      "text": "Vudu changed our movie viewing experience. Who's in the mood for what? With over 5000 titles to choose from, and an easy to search feature, it is easy to find something that all want to watch. Can't remember the title but know who was in it. Easy to find! Many different search functions; title, genre, actor, director, etc. Very simple, logical and intuitive. This small box makes movie nights even more enjoyable. And with HD around the corner, I no longer need to join the format war, either.",
      "rating": 5.0,
      "verified": false,
      "author": "Lauwereins",
      "helpful_votes": 10,
      "publication_date": 20071106
    },
    {
      "title": "Value Doesn't Meet Market Needs - No WiFi is a killer.",
      "text": "I'm stunned that anyone thinks this box is a good value. The cost of the movies is outrageous & only confirms that the people who think its a great deal must also think that the economy is in great shape. Maybe they need to use a debit card so they see the direct effect on their budget instead of the visa that they're always last paying, & has a $10,000 balance. Lastly, without WiFi the functionally is cut in half for most people.",
      "rating": 1.0,
      "verified": false,
      "author": "Lance J. Miller",
      "helpful_votes": 0,
      "publication_date": 20101210
    },
    {
      "title": "Vudu, The Future is here now!",
      "text": "There are so many good things to say here. As a Movie lover and collector, I currently own about 450 DVD's and running out of space to put them. Those shelves sure fill up fast. With the Vudu I can stop buying physical media and just purchase digital media and store it on the Vudu. with Over 5000 titles available and all in a nice little box my problem is solved. And with HD content @ full 1080p I don't have to worry about the format war that is ridiculous and just go with the Vudu. I had this unit for a month now and I love it. Instant watching, no waiting for downloads, nice!!! Great Job Vudu!!",
      "rating": 5.0,
      "verified": false,
      "author": "Carlos Munguia",
      "helpful_votes": 12,
      "publication_date": 20071106
    },
    {
      "title": "Very Satisfied",
      "text": "I've owned my Vudu box for about a month now and love it! Very easy to set up and the video quality is terrific! After seeing the build construction of this box I really understand why they used to sell it for $300, very high quality.",
      "rating": 5.0,
      "verified": false,
      "author": "LoThom",
      "helpful_votes": 2,
      "publication_date": 20090309
    },
    {
      "title": "WOW WOW BETTERN THEN XBOXLIVE OR APPLE TV !!!",
      "text": "I have tried akimbo, apple tv, xbox live moviebeam I almost gave up but VUDU is the best !!! instant play and they have the largest selection of movies, more then some video rental stores !!!!",
      "rating": 5.0,
      "verified": false,
      "author": "rl",
      "helpful_votes": 0,
      "publication_date": 20080423
    },
    {
      "title": "Great Product but do shop around",
      "text": "Love the product - was about to purchase but did decide to shop around. Best Buy has same product for $149 - Saved $50 plus shipping. Used to be buy everything from Amazon - but watch these outside vendors - not always a good buy for online shoppers.",
      "rating": 3.0,
      "verified": false,
      "author": "J. Brancato",
      "helpful_votes": 4,
      "publication_date": 20091212
    },
    {
      "title": "One Star",
      "text": "Customer service is non-existant. I will never purchase anything having to do with VUDU.",
      "rating": 1.0,
      "verified": false,
      "author": "michelle",
      "helpful_votes": 0,
      "publication_date": 20151216
    },
    {
      "title": "Forget paying per movie, use Netflix Roku/Amazon Player",
      "text": "The Netflix Roku/Amazon Player is a Vudu killer. For $99 box you get unlimited free viewings of thousands of (mostly older) movies, plus get instant access to new movies via Amazon. Of course, you need to subscribe to Netflix, but millions already do...",
      "rating": 3.0,
      "verified": false,
      "author": "Bic",
      "helpful_votes": 6,
      "publication_date": 20090221
    },
    {
      "title": "I was the first to buy this BOX!!!!!!",
      "text": "I live next to Santa Clara werer the company was founded and belive in the vision of this product.I been using it for almost a year and WOW you will get that market.",
      "rating": 5.0,
      "verified": false,
      "author": "Francisco D. Zaragoza Jr.",
      "helpful_votes": 2,
      "publication_date": 20071122
    },
    {
      "title": "Rip off",
      "text": "The amount you have to pay for movies is OUTRAGEOUS!! Why would I pay $4.99 to rent a movie when I could get a Netflix supscription and get as many movies as I want? Totally not worth it.",
      "rating": 1.0,
      "verified": false,
      "author": "Music is my Fav.",
      "helpful_votes": 6,
      "publication_date": 20091208
    }
  ],
  "product_meta": {
    "title": "VUDU Set Top Box for Movies On Demand",
    "description": "Movie Fans... Welcome to Digital Heaven Having VUDU in your home means never having to go to the video store again. Movies On-Demand — Access over a vast library of movies and TV titles from all Hollywood studios and leading independent distributors directly from your HDTV. New Movies Weekly — Watch newly released movies the same day the DVD becomes available. No worrying about it being in-stock at the video store, or having to queue it up online. Even watch the trailer before you decide to rent or buy. HDX Movies — Only VUDU offers the highest quality internet-delivered format, HDX, featuring true 1080p HD, Dolby Digital Plus 5.1 surround sound. World's Largest HD Library — With over 2000 HD titles VUDU has the largest collection available anywhere, physical media included. VUDU Labs — Access millions of free videos and photos from popular Internet sites like YouTube, Flickr and Picasa, free On-demand television and games, plus free Internet radio from Pandora. Instant Convenience — Having VUDU means that you don't need to plan anymore. With a large catalog of new releases and library titles available instantly you will never need to drive or wait for the mail again. No Subscription — VUDU is available without a monthly subscription or contract. Rent or buy high definition and standard definition movies whenever you like — only pay for what you watch.",
    "rating": 3,
    "feature_bullets": [
      "Instant access - choose your movie and watch it immediately on your TV. With cable or premium DSL speed, a standard definition movie starts in 2 seconds.",
      "No computer required - VUDU uses a high-speed broadband Internet connection to deliver movies directly to your television. We recommend a bandwidth of 2.0 Mbps (usually advertised by ISPs as 3.0 Mbps.)",
      "No subscription or activation fees, no long-term contract. Just pay per movie rental or purchase.",
      "Thousands of movies - VUDU offers approximately 6,000 films from every major studio and numerous independent distributors. New titles are added ever week, so you'll always have new movies to watch.",
      "High-quality audio and video - VUDU's proprietary encoding, decoding, and up-converting technologies enable HDTVs to display their best capabilities. While it's HD ready, VUDU is compatible with most TVs."
    ],
    "specifications": {
      "Product Dimensions": "17.3 x 12.6 x 5 inches",
      "Item Weight": "1 pounds",
      "ASIN": "B000VEMJFY",
      "Item model number": "BX100",
      "Customer Reviews": "3.0 out of 5 stars27 ratings3.0 out of 5 stars",
      "Best Sellers Rank": "#535,358 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 30, 2007",
      "Manufacturer": "VuDu"
    },
    "categories": [
      "Television & Video",
      "Electronics",
      "Streaming Media Players"
    ],
    "price": 249.0
  }
}