{
  "website_summaries": [
    {
      "verdict": "A fantastic option for customers needing a sleeping bag to handle below-freezing temperatures.",
      "pros": [
        "Keeps campers comfortable in temperatures down to 0°F",
        "Hugging mummy-design able to fit users 6'2\" or below",
        "Tightening hood keeps head warm"
      ],
      "cons": [
        "Bag is heavier than many customers appreciated, but quite compressible nevertheless"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "An affordable cold-weather sleeping bag with a sculpted top to help keep your head warm.",
      "pros": [
        "Can handle temperatures as low as 0ºF",
        "Sculpted hood helps keep your head warm",
        "Insulated footbox",
        "Rugged, quilted construction",
        "5-year warranty",
        "Compression sack included"
      ],
      "cons": [
        "This bag may be too small for you if you're over 6 feet 2 inches tall"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "An extremely comfortable product from a trustworthy manufacturer. Designed for casual, three-season use.",
      "pros": [
        "Reputable manufacturer",
        "Known for loft and comfort",
        "Mummy style with extra wiggle room for the feet",
        "Use in temperatures as low as 0 degrees Fahrenheit"
      ],
      "cons": [
        "Not completely waterproof",
        "May require supplemental warming materials",
        "No compression sack"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Some Reviews a Bit Harsh- Quality Bag for the Buck",
      "text": "People's reviews are like: \"I decided to test my new sleeping bag out by sleeping naked three quarters of the way up Mt. Everest in the winter. I felt slightly colder than I would have if I had been at home. Two stars.\" I love my new sleeping bag, and it seems like with a good compression sack I'll be rockin and rollin with warmth and comfort on the trail.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 471,
      "publication_date": 20160102
    },
    {
      "title": "Amazing! Must buy!",
      "text": "This sleeping bag is so warm! Perfect for snow camping. Very good brand and my dog loves it too!",
      "rating": 5.0,
      "verified": true,
      "author": "Love",
      "helpful_votes": 82,
      "publication_date": 20170208
    },
    {
      "title": "Not for advertised low temps.",
      "text": "NOT A 0 DEGREE SLEEPING BAG, DON'T BE FOOLED. I use it camping and the overnight low was 12 deg F and I froze my arse off. I had to cancel my camping trip early because this sleeping bag did not live up to to its advertised performance or other reviews. I would not recommend this.",
      "rating": 1.0,
      "verified": true,
      "author": "Toni D",
      "helpful_votes": 17,
      "publication_date": 20191014
    },
    {
      "title": "Extremely frustrating to pack and transport",
      "text": "Expected quality of sleeping bag, but the provided storage bags are incapable of containing them. I’m an Eagle Scout who has owned more than a few sleeping bags. The ability to pack and transport them is just as important as their function. My storage bags actually ripped from the strain. I would give this at least 2 stars for the warmth of the bag, but the frustration caused by this design flaw has stolen that one too.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott N.",
      "helpful_votes": 21,
      "publication_date": 20180728
    },
    {
      "title": "DO NOT BUY IF OVER 5'6\" or BIGGER BUILD",
      "text": "For me its perfect. I'm 5'6\" with medium build. WARNING: IF YOU ARE ANY BIGGER DO NOT BUY. In all honesty it should be labeled youth. I dont think the sleeping bag is even 6 feet long total to tell the truth. I'm giving it 5 star for me but if you are taller or overweight at all you will be very very disappointed. Im going to be using it in a week camping and its supposed to be chilly at night. I will let you know how it does from there.",
      "rating": 5.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 9,
      "publication_date": 20180405
    },
    {
      "title": "Great to have this bag on a frigid night.",
      "text": "I love this sleeping bag with some limitations. Since it is synthetic, it is a bit bulky and weighs in just under 4 lbs so it is a bit heavy. In a hammock, it also needs help to prevent cold spots on arms and shoulders. But once I’m in the bag and it is zipped, it is toasty warm. The perfect system is to put this bag inside a hammock with underquilt or cocoon - I think I could go to -20 with that set up. I’ve gone down to 23 degrees and was very warm all night long.",
      "rating": 4.0,
      "verified": true,
      "author": "Donald G. Kemp",
      "helpful_votes": 12,
      "publication_date": 20171217
    },
    {
      "title": "DO NOT BUY",
      "text": "Horrible quality. DO NOT BUY! I opened this and took it hunting. It malfunctioned the first night and the zipper came apart not allowing me zip it up. It was snowing and 30 degrees. I was absolutely miserable. DONT WASTE YOUR MONEY",
      "rating": 1.0,
      "verified": true,
      "author": "Josh and Meagan",
      "helpful_votes": 11,
      "publication_date": 20181006
    },
    {
      "title": "Open package from Amazon is a great deal! Don’t be afraid!",
      "text": "Great sleeping bag. Super warm, and very user friendly as far as the zippers go. I’m a tall girl just under six feet, 170lbs I ordered the big and tall size cause I travel with a 10lb dog this sleeping bag provides plenty of room for the two of us and is very easy to clean. I bought this at a discounted price from amazon because it was opened clearly someone returned it. There was literally nothing wrong with it, and it was a great price. Came from Canada so it did take some time to get to me in Rhode Island. It was well worth the wait!",
      "rating": 5.0,
      "verified": true,
      "author": "jessie",
      "helpful_votes": 4,
      "publication_date": 20190808
    },
    {
      "title": "Not for winter camping",
      "text": "Bought 2 of these sleeping bag for winter camping with the Cub Scouts. My son and I both were still cold in the middle of the night in 25 degree temps. These were suppose to be 0 degree bags, so comfortable at about 20 degrees, but that was not the case. Both of us still had to put on 2 layers of clothings, 2 layers of socks, down feather jackets, hats, and gloves with hand and foot heat packs. Do not recommend for winter camping, maybe fall.",
      "rating": 3.0,
      "verified": true,
      "author": "Loong",
      "helpful_votes": 6,
      "publication_date": 20190126
    },
    {
      "title": "Cheap - don't buy, you'll regret",
      "text": "Slept in a total of 6 nights of indoor sleeping and stitching is unraveling in multiple areas, very cheaply made. Return window has passed by a week or so, now we are stuck with this crappy sleeping bag.",
      "rating": 1.0,
      "verified": true,
      "author": "Howell",
      "helpful_votes": 51,
      "publication_date": 20170602
    },
    {
      "title": "Solid bag so far",
      "text": "After reading sleeping bag reviews on 0 degree bags for days I decided to try this one out. She is kind of bulky, but that’s to be expected with a 0 degree bag in this price range. I tried her out the other night and temps dropped and I was comfy. I do a lot of winter camping in 20 degree or below weather and I’m trying to bring less sleeping gear. I hope this bag continues to be my one and only. Forgot to mention she’s a great color and I love the little cell phone pocket on the inside.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20180910
    },
    {
      "title": "This is a great sleeping bag to stay warm at 25-30 degrees",
      "text": "This is a great sleeping bag to stay warm at 25-30 degrees. I used it with the klymit static V sleeping pad. HOWEVER, I would not recommend this for backpacking. Please, please, please, listen to me and the other reviews, do not take this backpacking with you. It was incredible bulky and took up so much space. I just came back from backpacking San Gorgonio, the highest peak in southern California and yes it was warm enough, but it was too heavy and bulky. I still was comfortable and able to move for the most part. 5'9'' 185lb. Great for its intended use. I probably would not recommend this at 0 degrees.",
      "rating": 4.0,
      "verified": true,
      "author": "Adrian C.",
      "helpful_votes": 5,
      "publication_date": 20171214
    },
    {
      "title": "Awesome bag if looking for something warm on a budget and car camping.",
      "text": "Purchased last second for a winter trip. Very thick, comfortable. This bag worked well on a 19 degree night. It probably has the best zipper out of our 3 bags (the other two being more expensive brands). It also has a pillow pocket at the top which is a cool feature. The only drawback I would say is this isn't a lightweight down bag. It has thick filling and does not roll up small. I wasn't able to get it back in the included stuff sack. Bottom line, awesome bag if looking for something warm on a budget and car camping.",
      "rating": 4.0,
      "verified": true,
      "author": "Ted P",
      "helpful_votes": 2,
      "publication_date": 20191110
    },
    {
      "title": "Perfect",
      "text": "I do desert camping once a year and finally decided to upgrade my sleeping bag. I wasn't sure if 0degree was going to be overkill but I am THANKFUL I did it! It got into the low 40s and all of my campmates were complaining that they were freezing, (some even went into their cars!) and I slept through the whole night. Would absolutely purchase again and would recommend to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Ash",
      "helpful_votes": 2,
      "publication_date": 20200926
    },
    {
      "title": "Great bag, great price.",
      "text": "Great bag for the price. I'm 6'4\" and weigh ~220lbs so the little guys talking about not being able to fit must be confusing this bag with something else. This bag for sure will not fit back in the bag it came in without serious work so I suggest buying a bag that is a little larger. I've used it camping a couple times now. Just got back from another trip yesterday and we were camping on mt hood in 20 degree weather and I slept VERY comfortably. I would recommend buying this because you won't find a better deal on a sleeping bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Collin",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Great value, very warm",
      "text": "I have bought three of these bags, for me and my two brothers. Most of my other camping gear is of the 'ultralight' variety and fairly expensive, but I think this bag is one of the best things I own. It's super warm and you can't beat the value. I just used it this past weekend (1/06/18) in the 'bombcyclone' on the east coast and it kept me warm in sub zero temps. I was wearing several layers in the bag, but I was nice and toasty. I definitely recmoment this product.",
      "rating": 5.0,
      "verified": true,
      "author": "John Fields",
      "helpful_votes": 6,
      "publication_date": 20180108
    },
    {
      "title": "GREAT FOR WINTER! -Horrible for a lightweight backpacker.",
      "text": "I bought this for backpacking/survival situations, and I would only recommend it for the latter. This sleeping bag is an AMAZING quality and choice for cold weather, but if you’re into year round backpacking or camping, I’d buy a “Summer sleeping bag” too. It’s not at all heavy, just packs reeeeeeaaaaaalllllyyyyyyyyy large. And the stuff sack it came with BARELY contains it, -I’d buy a compression back for this thing because the bag it comes with takes WRESTLING to get back in. This is not a bad review! I’m simply not recommending it to backpackers even though the weight it great, it’s just too big.",
      "rating": 4.0,
      "verified": true,
      "author": "Kat Thurau",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Stuffing coming out after first use",
      "text": "Bought this a month ago and only just used it over the weekend. It kept me very warm throughout the night in 30 degree temperatures, but the stitching has already started to come undone and the stuffing has started to come out. I tried to return it but the return window closed literally yesterday. I have serious concerns that this sleeping bag will last very long.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeremy S",
      "helpful_votes": 9,
      "publication_date": 20180603
    },
    {
      "title": "For VERY cold conditions.",
      "text": "This sleeping bag has proven itself worthy of cold temp camping. Seriously, if you can feel your fingers without gloves on..... this will be too warm to be comfortable. Very, very warm sleeping bag. I ended up unzipping this and using it as a blanket. My bare back was on a sleeping pad, and the ambient temps were in the mid 30's. Still too hot.... This is for VERY cold conditions. Furthmore, not expected to be, but this sleeping back is not very light.",
      "rating": 4.0,
      "verified": true,
      "author": "john schmerling",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Great sleeping bag for low 30s temp",
      "text": "I just got back from camping at Pismo Beach this past weekend and I'm so happy I had this to keep me warm. Average day temperature was high 50s then dropped down to mid 30s at night. I wore a tech shirt and yoga pants and socks to sleep and this kept me fairly warm. My feet was a bit cold but that is my fault. Instead of trying to roll it back in, I stuffed the sleeping bag starting from the foot .I'm 5'3 and there was a lot of room still for me to sleep on my side. The only con to this is that it's very bulky. Wouldn't be suitable for backpacking. Definitely recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Cleph",
      "helpful_votes": 2,
      "publication_date": 20180402
    },
    {
      "title": "Really good for the price",
      "text": "The bag is overall very comfortable and roomy. The zipper is smooth and rarely hangs. I did get some cold spots at the compression points on a 36 degree night in my hammock, so I threw a warm weather sleeping bag under it and things warmed right up. You will want some type of underquilting or reflective pad in really cold weather. The uncompressed parts of the bag stayed super warm, I even had it unzipped a foot or so all night. It's fluffy enough to be OK without a pillow for folks like me that dont use thick pillows. The downside for this thing is it is huge and doesn't come with a compression sack.",
      "rating": 4.0,
      "verified": true,
      "author": "IT Guy",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Absolutely not a 0F degree bag",
      "text": "i just came back from Joshuwa tree today, i was freezing to death last night, I had to wear my down to sleep to keep myself a bit warmer, Joshuwa tree lastnight was big windy around 35 degree F, I thought I WOULD BE FINE! unfortunately, i wasnt. the manufuactuer should give correct rating to avoid misleading people. This bag was fine for car camping over 40 degree F, i used many times for past year. it was fine! i was so disappointed last nigtht due to freezing.",
      "rating": 2.0,
      "verified": true,
      "author": "sheena",
      "helpful_votes": 2,
      "publication_date": 20190210
    },
    {
      "title": "I'm no expert camper but this bag seems pretty good to me",
      "text": "I'm no expert camper but this bag seems pretty good to me. The various drawstrings enabled me to close off the 40 degree cold with only my mouth and nose exposed. Definitely a mummy--you won't be able to turn sideways in the bag or anything. I think you're better off wearing just one layer of clothes and a hat than trying to have layers on in the bag... better for heat flow to your toes? It's not very compact stuffed into the carry sack, and if the drawstring loosens, the sleeping bag kind of explodes out of the sack",
      "rating": 4.0,
      "verified": true,
      "author": "SmartShopper",
      "helpful_votes": 2,
      "publication_date": 20180402
    },
    {
      "title": "Slept in my car with this thing in San Francisco winter",
      "text": "Definitely keeps you warm in 0 degree F weather. Your face and breath stay cold though so I'm not a fan of that and really no sleeping bag can fix that. I slept in my car before all of the tech employees started doing it and this did the trick, saved me a bunch of money not paying rent while making a lot of money as a tech employee. Now I've moved onto better things and keep this for the incredibly infrequent times that I go camping. Still a solid purchase though and my only complaint is that its bulky and a hassle to pack back into it's container.",
      "rating": 4.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Incredible value for the price!",
      "text": "Great sleeping bag. Incredible quality for the price! I used it regularly for about 2 months when it was about 39 degrees/low 40s. I slept warm the whole night, and it hasn't ripped. Don't expect to use this with short sleeves. You definitely need long sleeves and long pants to create extra warmth and trap it in the sleeping bag. It has enough room for legs. I'm 5'3\" about 125 pounds. 4 stars instead of 5 because once I opened it to use it as a blanket, and realigning the zipper took patience...",
      "rating": 4.0,
      "verified": true,
      "author": "Minnie",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Seems to Do the Job",
      "text": "I purchased this for my partner as a Christmas gift and he just tried it out a camping trip. I believe the temperature was around 30 degrees during the night and he was very pleased with it though I personally am skeptical about it holding up against 0 degree cold as described. I zipped myself up in it before he left and, inside of a 68 degree house, I was quickly burning up and scrambling to get out but struggled to do so because the zipper is a little bit wonky (which is why I knocked a star off my rating).",
      "rating": 4.0,
      "verified": true,
      "author": "DeAnna",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Good value",
      "text": "Good for the price. A little optimistic on the temperature rating.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert A. Johnson",
      "helpful_votes": 7,
      "publication_date": 20170113
    },
    {
      "title": "It is good for cold weather, but to 20 or below is pretty cold in the toe box",
      "text": "Used it on a weekend trip to climb Blanca Peak in Colorado. Stayed at Lake Como in November of 2019. It stayed in the low twenties to the teens at night every night but the bag kept everything but my feet pretty toasty warm, although I was wearing under armor and a hoodie but it was still nice. Very plush comfortable interior with plenty of room. It does take up a ton of room in a pack so make sure its going to get cold but this kept me very comfy even as low as 20 to 25 degrees till it hits the feet first.",
      "rating": 4.0,
      "verified": true,
      "author": "Starcoons",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Bad build quality, didn't hold up to cold - used for 5 nights.",
      "text": "I bought this to hike in 25-35 degree weather. I shook and shivered every night. On the third night the drawstring around the face broke and I lost what insulation there was around my head.",
      "rating": 1.0,
      "verified": true,
      "author": "John Shpati",
      "helpful_votes": 3,
      "publication_date": 20191113
    },
    {
      "title": "Great bag, HARD to get back into the stuffing sack",
      "text": "So, as a sleeping bag, great product! Warm as heck and comfortable material. It's a little tight (I'm 6 feet tall, 200 pounds), but doable. Zipper seems pretty quality, so not sure how people are breaking it. I expect this to last many camping trips. HOWEVER, getting this thing back into the bag is sooooo hard lol. My tip is to start folding/wrapping it up from the head side first. Wrap it as tightly as possible and have someone help you get the bag back on. It's doable, but really hard. That's my main complaint. It's also pretty bulky so not good for backpacking.",
      "rating": 4.0,
      "verified": true,
      "author": "Justin B",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "NOT for big, only tall.",
      "text": "I wear a 50\" suit jacket and have broad shoulders. I could not get this to zip around my shoulders unless I had one arm out of the bag. I've never had that problem with any other sleeping bag. The dimensions listed are the same dimensions as sleeping bags that actually fit me, so that seems off. This thing is warm and would be fine to 0'F as advertised. It is also long enough for my 6'2\" height. It just isn't big enough around for a big guy. And if you're using big as code for fat, forget about even trying to get in this sleeping bag.",
      "rating": 3.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "\"BIG AND TALL\"? NOT!",
      "text": "The whole reason I purchased this bag other than the 0 degree rating is that it is advertised as \"big and tall\". I'm 5' 9\" tall and 240 lbs. The bag is so small I had to have my girlfriend zip me up to close it and I was like a sausage in a pig casing and my feet were smashing the bottom. There are a few YT videos on this bag, one guy even saying that he could squeeze his small dog in with him and I have to call BS on that. I ended up getting the Coleman Big Basin 15.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark T.",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Been using this thing for nearly a year straight",
      "text": "Alright so, I live on a boat in the northeast and it gets cold as f*** in my boat during cold snaps. 30 degrees or below cold. I've been sleeping in this thing for a yearr straight now whenever it gets cold and it's held up and kept me warm as hell when it drops to 20F. I don't know if I'd actually try this in 0 degree weather but, it's a really warm bag, it's cheap, and it's held up to a total of 10 months of straight use every night so, I have absolutely no complaints. The only complaint I would have is the footbox isn't as insulated as I would probably like it to be.",
      "rating": 5.0,
      "verified": true,
      "author": "Hanley",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Warm and comfortable, not big and tall",
      "text": "This bag kept me warm all night but it wasn’t very cold, about 50. However I was freezing in my old bag so this was much better. For a big and tall bag it’s not very big. Rated up to 6’2”. My husband is 6’4” which I realize is bigger than the rating but he wasn’t even close to fitting inside. His shoulders and arms were completely out so I doubt a 6’2” individual would fit either. Very nice for a smaller or average height person though. I’m 5’4” and got them for my kids as well.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Hobbs",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Very Good Bag!!",
      "text": "My son loves this bag. It's by no means a backpacking bag. It stuffs into a sack that's way too big for a backpack. It's twice as large as his Kelty however on tent camping trips with the BSA and cabin camping it's a great sleeping bag. The first night in tent it got down to 7 degrees and he said he didn't even notice.",
      "rating": 5.0,
      "verified": true,
      "author": "Deathdeelr",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Great price, very warm",
      "text": "This sleeping bag is very affordable and works just as good as more expensive bags. It’s difficult to get back into travel bag but not impossible. I’m 6’-1” and 250 lbs which is max height for this bag but I do fit and can roll on my side with some wiggling. I would recommend this bag to anyone for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "BZ",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Nice Sleeping Bag For Cold Nights",
      "text": "I just used this sleeping bag 3-nights in a row on my converted school bus, without any assistance from any other heat source. Temps dropped into the high 30's and I slept with the sleeping bag slightly cracked open for fresh air. The only thing I didn't enjoy so much about this design was how slippery the material is and you often wake up upside down in the sleeping bag's head area. I did forget to use the chest strap the it has across the top of the sleeping bag, so perhaps that will prevent rolling around in the bag as much...",
      "rating": 4.0,
      "verified": true,
      "author": "Paul Brooke",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Warm and comfortable",
      "text": "I bought two of these a couple years ago on Amazon for $28 each. For the price, I couldn't be happier. I don't use them frequently, but they've held up well and are extremely comfortable. I was comfortable down to 35 degrees and think they'd be fine much lower, especially with a ground layer. I'm 5'10\" and a bit over 200 lbs and I've got plenty of room. The zippers seem to be high quality and I really can't find any fault with them. It's a good quality mummy bag for a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Wohlrab",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Well made but bulky",
      "text": "To get a lighter more packable bag you would have to pay 3-4 times the price. But I am not a winter climber any more. My bag rides in my cargo box on top of my car! I am sure it will work out well in practice. Plenty of room as I am not as flexible as I was 50 years ago - I still have that bag too but it is way too tight now! I have ordered a M-Tac compression stuff bag as the one supplied is a bit small and not a compression bag.",
      "rating": 4.0,
      "verified": true,
      "author": "Patrick D.",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Cheap Insurance",
      "text": "Having survived many, many Minnesota winters, and having had the pleasure of spending a few nights without the benefit of heat, I got this to replace an old army down bag I keep in the car. With this and one of the thicker \"space\" blankets, some extra socks and some snow bibs, you might just survive a night at 20 below with all your toes. Yes, cell phones are a great help, but when it's bad you might still need 2 or 3 hours to get help, if they haven't closed the road. With just your normal street clothes that could be very unpleasant, or worse. I may never need it, but I'm glad to have it.",
      "rating": 4.0,
      "verified": true,
      "author": "Curt Wuollet",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "its really warm",
      "text": "it's what I've been looking for. I had a good one I looked forward to using it during deer season. I like to turn the heat down low and crawl in, zip up and feel the warmth move up from my feet to my neck. that one is gone somewhere so I had to get a new one. I read reviews by the pages narrowed it down to two and I picked the coleman. it's been good liked I had hoped. A great bag . feels good to sleep in like my old one.",
      "rating": 5.0,
      "verified": true,
      "author": "DOC Wayne",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Super warm, quality",
      "text": "We love these bags and purchased them for the whole family. They even kept the kids warm during a camping trip cold front last year. They are well made and I expect that they will last a very long time. I just wish the stuff sack were a little bigger. You can zip two together, put the zippers in the middle so the hoods are to the side. However this does create quite an air gap at the top so it is not as toasty.",
      "rating": 5.0,
      "verified": true,
      "author": "R.E.S.",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Great bag, shorter than expected",
      "text": "For the price this bag appears very well made. Taking off one star because the chest baffle is situated lower than expected. Only a shorter person could fit inside with the baffle across the top of the chest where it makes sense. I am 5'10 and my son 5'11 and a half. The chest baffle runs across my lower ribs. I don't think a 6'2 person could fit comfortably as advertised without the chest baffle closer to their waist.",
      "rating": 4.0,
      "verified": true,
      "author": "moviefan2011",
      "helpful_votes": 3,
      "publication_date": 20171025
    },
    {
      "title": "Warm and roomy!",
      "text": "I have taken this bag on a few camping trips so far where the temperature got below freezing. Everytime I slept warm and comfortable in my hammock and tent. It's a little bigger and heavier than those expensive down sleeping bags, but it is great for car camping and short hike in sites. Warmest sleeping bag I have ever owned and the price is a great deal. I'm 5'10 and have plenty of room to move around in. I love this bag!",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas Austin",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "awesome value",
      "text": "I am surprised how good this bag is for the money. I picked up a \"warehouse\" one that was new but in beat up box for just over $30. I am a vandweller so I have protection from wind/rain but not cold. I didn't need a \"lightweight\" bag because I am not carrying it backpacking. Gimme some fluff! My previous bag was was ok down to about freezing if I was wearing long johns. Last night I slept in the bag at 34F in my skivvies with the bag unzipped to my ankles. I love this thing. I don't predict weather below about 15F but I do believe this is a 0F bag.",
      "rating": 4.0,
      "verified": true,
      "author": "FraterMus",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "It really works",
      "text": "Tested this out in weather in the 20s F. It did a great job of keeping me warm, even my feet didn't get cold. For extra comfort you could use a low wattage DC electric warming blanket and put it on top of you while in the sleeping bag, hooking the blanket up to a battery bank that has a DC outlet (they sell the DC low wattage electric blankets for cars). This sleeping bag is really big and thick. Its going to keep you warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonn Costumerr",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "very comfy and warm sleeping bag",
      "text": "I really like this sleeping bag, I normally camp in my hammock, and the last few trips I have been somewhat chilly. However when I got this new sleeping bag I could tell right away by how thick it was, that I was going to be warm that night. Didn't need a blanket over it, woke up very toasty. It has a drawstring inside the bag around the shoulders which pulls the bag tight around you which doesn't release any of the warm air, it also has one around the hood. Definitely would recommend this to anyone looking to upgrade from a plain old bag",
      "rating": 5.0,
      "verified": true,
      "author": "Vadim",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Bang 4 da buck",
      "text": "I use this to go texas hog hunting during the winter when there is no vegetaion for them to hide and no bugs (ticks/chiggers) and snake to worry about. I'm camping out in the woods in well below freezing temperatures (single digits to teens). i stay pretty warm throughout the night. There's just enough room to move/turn around in, but tight enough to keep the cold out. I do recommend using a beanie or scarf to keep your face warm though. The hoodie does tighten down, but you'll still get a slight draft.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous ",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Kept me toasty warm at 25F.",
      "text": "It was 25F in my tent, I wore thermal underwear and thick wool socks. I did not feel the slightest bit cold, except for the small area around my nose and mouth which was exposed. I have no doubt this would keep me reasonably warm down to the low teens, maybe down to 0F. I am 5'10\", 220 lbs, and it fit me just right around the torso, with some extra space at my feet. Not much extra room to move around, but if you're trying to stay warm in freezing temperatures you do not want extra space in your sleeping bag, so I consider the close fit as a positive.",
      "rating": 5.0,
      "verified": true,
      "author": "jfmeredith",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Measurements are important",
      "text": "A word of advice, measure around your arms and chest to see how big of a bag you need. I am rather broad chested and didn’t think about measuring before ordering. I can get in the bag and zip it up but there is no room to move my arms, I guess I will keep it as a spare for someone who doesn’t have a bag. That being said the bag is very warm and snuggly soft on cold nights. I like the color of the bag also it matches everything else I have.",
      "rating": 4.0,
      "verified": true,
      "author": "James N",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "I even had to unzip it to cool down. I love it",
      "text": "I just used this bag on a hunting trip in N Az, it was cold but on only 1 night did I need to keep it completely closed. I even had to unzip it to cool down. I love it. If I have a complaint, which I do not, it would be how difficult I found it to get it back in its carry bag. I eventually gave up and put it into a garbage bag. do not let this minor inconvenience dissuade you.",
      "rating": 5.0,
      "verified": true,
      "author": "Aisling C.",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Quality. Wow, nice. Zipper strong. Everything very good with this bag.",
      "text": "This is a very good quality sleeping bag. Zipper is strong and the bag has lots insulation and proper baffling to keep cold air out. It is rated to 0 degrees F but the coldest I could find was our back yard lounge chair and 32 degrees. Fun testing it. I ended up unzipping it a bit because it was getting a little too warm. Really happy with this one. Now that I see the quality I will be getting a couple more to add to family camping gear. Delivery was really fast too. All around pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Russell",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Snug and cozy!",
      "text": "Good and less good. Good first. We camped in high 20's weather and I was sweating....so .....warm. lol. I'm 6'-4\" hovering at around 260Lbs and it fit me. A bit snug around the shoulders...but I could zip it up. Now the less good. A little weighty, but I expected that. Also, I don't see anyone being able to get this back in the bag it comes with, out in the field, in freezing temps. I bought a compression sack to take care of that issue. Love this bag!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Humes III",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "it was heavy, big and thick, folded every time like a war, and absorbing moisture.",
      "text": "For a Coleman loyalist (I used Coleman in my tent and stove and was very happy with it), I tried it three times and finally gave it up. In order to choose the right sleeping bags for myself and my family, I consulted customer reviews and bought four different brands of sleeping bags. From the first use, we were most dissatisfied with the bag: it was heavy, big and thick, folded every time like a war, and absorbing moisture. Hopefully it will improve and be worth buying like the other Coleman products.",
      "rating": 2.0,
      "verified": true,
      "author": "Jason Liu",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Superb Value!",
      "text": "This sleeping bag is a superb value. The quality is MUCH better than you would imagine at this price. Some points about the sleeping bag that may be helpful to you: 1. Easily long enough if you are 6' 2. Heavy in feel 3. Best as a bag for base camp - as it is a bit large for packing 4. Quite warm with exterior and interior draw strings to close to tightly 5. This is a fairly narrow mummy bag (not in a bad way, but you are pretty well wrapped up) No negatives that I've noticed. At the price here on Amazon, I don't think you can go wrong with this choice! Hope that's helpful...",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Fish",
      "helpful_votes": 2,
      "publication_date": 20161221
    },
    {
      "title": "Great for the price!",
      "text": "I needed a heavier sleeping bag for colder weather camping and got this guy on sale. I tested it a few times before going out and it worked rather well, when I went camping with it the first time I didn't have a ground mat and was a bit chilly (so I slept in this bag on top of my clothes and a lighter sleeping bag) and was fine. When I went hammock camping (low of 38degF) it was more than adequate, down to 0 I definitely would have been cold, so some long johns or a fleece bag liner woul probably be needed (but par for the course of hammock camping). Overall, I'd definitely recommend it, especially on sale.",
      "rating": 5.0,
      "verified": true,
      "author": "Harrison",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Bummer",
      "text": "I was really bummed by these sleeping bags and we purchased two. I realize they're not made for light weight camping, but these are just heavy and not comfortable. It's shaped like a triangle and really does not provide for a lot of room from the hips down. By the first night we unzipped the bags and used them as blankets. This caused for a long uncomfortably cold night.",
      "rating": 2.0,
      "verified": true,
      "author": "Liz frostenson",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "A must buy",
      "text": "We purchased these to give to the homeless and they're amazing. We tested them out on a very cold winter night here in Chicago, and we were warm! I highly recommend these for any use you see fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Joycerenea",
      "helpful_votes": 17,
      "publication_date": 20170207
    },
    {
      "title": "Beware the shoulders....",
      "text": "So all in all this is a solid cheap bag. I used it on a couple of day hikes with some camping. I though that when I got it and zipped it up it was snug on my shoulders (I wear a 58-60 sport coat in the shoulders). I would say 50% of the negative size reviews have the problem I did. I just wanted it to work more than what it was. If your not a chunk like me this is a pretty good bag for the cash.",
      "rating": 4.0,
      "verified": true,
      "author": "Hammer",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Bang for your buck, good in cold temps",
      "text": "Bought this sleeping bag for a month long cross country camping trip experiencing night time lows anywhere from the 60s to the teens. The coldest we experienced was 18 and I was quite warm still. Most of our nights were in the mid 20s to 40s and I slept as comfortably as I do in my bed. Obviously I was a little warm in the 60s but if I slept with the bag unzipped I was comfortable. Would recommend to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas Devine",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Too small",
      "text": "I am 5’10” and 180 lbs. this sleeping bag was too short for me and felt very narrow. It says it accommodates up to 6’2” but I maxed out the height in this bag. In addition the bag does not fit back in the bag. It took both my wife and I a lot of effort together the cram this bag back into its sack. Lastly. The zipper is terrible. We bought two of these and once unzipped we could not re-zip them. I wanted to like this bag. It looks great and the price and warranty are amazing. But it’s too small, won’t re pack back into its bag and the zippers don’t work.",
      "rating": 2.0,
      "verified": true,
      "author": "jason",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Camping in Yosemite 20F and cozy",
      "text": "I just came from car camping in Yosemite (winter January 2019) and It was pretty cold out there 20F. My husband bought those sleeping bags so I wouldn't complain about the cold. Soon as he saw me researching for sleeping bags and saw the expensive prices he took over the mission and bought those. They are great for car camping. Definitely not for backpacking. I was cozy, warm and happy sleeping inside those. Folding them back into the bag is a little tricky but I'm a pro folding camping stuff and it fits. The only problem is that after folding and packing the sleeping bag inside the bag the tie doesn't hold the bag closed. Not a big deal.",
      "rating": 4.0,
      "verified": true,
      "author": "Tam2you",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "This bag worked great for me",
      "text": "This bag worked great for me. I was in about 5° F weather and I was comfy using thermal underwear and a sweatshirt. The only downside is that it doesn't pack down nearly as small as my friends down bag. But it also didn't cost several hundred dollars. So it's a trade off but it is a great bag for the price",
      "rating": 5.0,
      "verified": true,
      "author": "MADISON D.",
      "helpful_votes": 4,
      "publication_date": 20170111
    },
    {
      "title": "Why didn't I get this years ago?",
      "text": "I enjoy everything about camping except the sleeping. I bought this before a trip to Goblin Valley (Utah) that was 27 degrees Fahrenheit at night. It did a great job keeping me warm - I actually slept in a bit, when I'm usually up at 5am shivering. (I also filled a water bottle with boiling water and put it in my bag - kept me extra warm until about 4am.)",
      "rating": 5.0,
      "verified": true,
      "author": "J. Hill",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Great for the price",
      "text": "I used them for camping for three days. This thing is really warm. Had to open it a little to cool off. Can't go wrong for the price. Only issue is that it states for big and tall. Not so sure. Im 509 and it fits fine but not a lot of move around room. I typically don't like mummy bags for that reason but i figured if it was for big and tall i would have lots of extra room.",
      "rating": 5.0,
      "verified": true,
      "author": "shek",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Great cold weather bag .",
      "text": "I've used this Coleman north rim adult mummy sleeping bag a few nights just at home to test it out and have found it to be very warm and Comfortable . Something I didn't thing about when purchasing though is how narrow it is at the shoulders . Im only 5'9\" tall so plenty of leg room but at 265lbs im very wide at the shoulders and its a little tight . its ok with me im still happy with the purchase but I would say if you're a 4x or 5x shirt look for something larger ..",
      "rating": 4.0,
      "verified": true,
      "author": "Z. Patterson",
      "helpful_votes": 2,
      "publication_date": 20161217
    },
    {
      "title": "Uhmmm 0 Degrees?",
      "text": "Went camping in mid Feb. and wanted to get something that may keep me warm. Instead my wife used it and she was freezing. Temp was around 20Degrees.. I don't think that its rated for the temp that it says. She said It was comfortable. But she was still freezing, even with another blanket on her.",
      "rating": 3.0,
      "verified": true,
      "author": "Jimmy",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Reasonable sleeping bag",
      "text": "The bag kept me warm into the high 30's at 6,000 feet elevation. Once the sleeping bag comes out of the box, it will never be so compact again ever. I purchased a $20 REI sack to store the sleeping bag going forward. The best part of the sleeping bag is the zipper system. The zipper unzips and retracks easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob916Stick",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Great in extreme cold",
      "text": "My best friend and I each purchased one of these for an overnight camping trip in the Blue Ridge Mountains. The temperature at the summit of our mountain dropped to 20 degrees Fahrenheit and at no point did I even notice the cold outside my bag. I am curious to see how it fairs in warmer weather this coming April",
      "rating": 5.0,
      "verified": true,
      "author": "CyL",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "I like it so far",
      "text": "I think this is a great bag especially for the money. It's a little heavier and more bulky than some of the more expensive versions out there, but I was willing to make that trade off. If you're car-camping or not covering a lot of miles with this in your pack, and you need coverage down to single digit temps, this is a good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "superbeau",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "You won't be sorry.",
      "text": "This sleeping bag is amazing. The best for the price. This is not a backpacking bag, it is a car camping bag. Unless the size doesn't bother you, you probably don't want to hump this up a mountain. This sleeping bag is so warm, it could easily handle 0* weather. But I would obviously not recommend using this in the summer unless you want to steam yourself. This is a great bag and could not recommend it more.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Thompson",
      "helpful_votes": 3,
      "publication_date": 20161010
    },
    {
      "title": "Snuggly",
      "text": "Having the coffin shape sleeping bag is the first for me. I like that it keeps me warm, but for anyone that doesn't like the claustrophobic feeling then don't get this sleeping bag. I like my feet to be free and it's a little hard to get used to not having the freedom to move my legs around. They are like grounded in their place. Aside from that, I like this sleeping bag and I have gotten sweaty because it holds in the heat well.",
      "rating": 4.0,
      "verified": true,
      "author": "Wolverine",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Toasty",
      "text": "I'm building a tiny home and I don't have my insulation up yet, so I bought this sleeping bag to get me through the harsh Michigan winter. It worked like a champ. Once you're all zipped up and, preferable covered by another blanket, this will keep you warm down to about 15° F as long as you're protected from the wind. Anything lower than that and I had to sleep in my insulated Carhartt overalls with two pairs of socks, but I was never too cold to get a good night's sleep. Great purchase for cold weather camping or dry cabins.",
      "rating": 5.0,
      "verified": true,
      "author": "John R Loser Jr",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Super heavy, super bulky but a great winter bag",
      "text": "This is great for car camping, BUT not backpacking. It's huge and weights 5+ lbs. I could barely fit it in a 40L backpack with little space for anything else. I'll keep it. Notwithstanding; Had to open zipper at 30F. Excellent warmth capabilities. Loft is at least 4\" Super comfy cold winter bag",
      "rating": 5.0,
      "verified": true,
      "author": "Pedro Yarahuan ",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "I'll try this bag during hunting season this year",
      "text": "After reading some of the reviews I bought this sleep bag. I hope it keeps me warm, and I think it will because I'm using a 3\" thick mattress pad, a sleeping bag liner and a 25 year-old NF sleeping bag cover (that has never failed me), on an ALPS Mountaineering cot and a small backpacking pillow.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "For this price are you kidding me!?",
      "text": "Pro's: Stupid comfortable . Very warm. Bag looks amazing and feels very high quality. Lots of room in it. Cons Imo needs a slightly larger stuff sack. No way I couldn't give this 5 stars for this price. It is a ridiculous good bag. It is not tiny or super light by any means but I have a big liking for this. I have 5 bags all are far more expensive but you can't go wrong having one of these around.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Would buy again.",
      "text": "Great sleeping bag. Kept me warm while I slept in 20 degree weather in a tent during pheasant season this year. Worst part was getting out of it to put my chilly clothes on. Was enough room for a a little couch blanket. I'm 6'1\" 235 broad shouldered. It reminded me of the sleep sack we used in the army. If I had a gotten a gortex shell I probably could of handled a bit colder in that sack. Only con: it is not going back in that bag it comes in. I just rolled it up and tied it together with a couple strands of 550 cord.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric H",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Cool bag",
      "text": "I'm 6'3 and 320 pounds. Its tall enough but just a tad to narrow to where I cant zip it up. It's pretty well built and seems super warm. I can unzip it and use it as a blanket and I'm sure it would keep me warm into the 40s. It's a great bag for the money if you're not a big dude like myself.",
      "rating": 4.0,
      "verified": true,
      "author": "Corey Hightower",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "This is the perfect camping or car sleeping bag",
      "text": "I could not be more impressed with this sleeping bag. It is not for hikers. It is for people who want to sleep outdoors in freezing cold weather and stay warm. It is fluffy, soft and thick. For hot nights you could lay right on top and sink in. Zipper works great. Inside is a cord I didn't expect to draw in above shoulders to keep cold air out. Quailty top of line feel. This bag is made for comfort and warmth. It's absolutely perfect and my favorite bag ever. It actually goes back in carry bag easily. The top of bag can be rolled under neck and used as a pillow. Love love love",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Great bag! Suuuuper warm!",
      "text": "I live in Maine and it can get unreasonably cold at night/early morning on even the hottest of months. This bag has been amazing! I really like the antiseize zipper which prevents you from zipping up the bag material when trying to close the bag. Great forethought from Coleman's R&D team. While its a mummy bag, i have been able to fit both myself and my 45lb basenji in the bag one night this june when the temp dipped into the 20s and woke up to him whining and shaking from the cold. Fitting 2 people (not that you would want to in a mummy bag) is not possible.",
      "rating": 5.0,
      "verified": true,
      "author": "KG",
      "helpful_votes": 2,
      "publication_date": 20160921
    },
    {
      "title": "Very Warm",
      "text": "Tried it out on recent camping trip in 20 degree weather. Daughter had another sleeping bag (purportedly rated for temps below the Coleman). I was toasty warm, but that ended when I had to give my daughter the Coleman bag in the middle of the night because she was cold. I spent the rest of the night shivering while using her sleeping bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "WARM!!",
      "text": "WOW, i have to say, for the price the product is SUPER warm and it is HUGE. I am 5'4 - 112 lbs and this is PERFECT. I was looking for a simple sleeping bag for camping and oh boy does this keep you warm! I sleep in this thing unzipped, perfect for camping or for your guests when they're sleeping over at your place and you don't have an extra mattress. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Lise Lo",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Zipper broke",
      "text": "First time using it and the zipper busted. Could not reattach zipper on the track because the guide and zipper teeth separated. Seems warm but couldnt really tell because bag was open the whole time due to broken zipper. Didnt like that its left side zip and that the zipper was designed to detach",
      "rating": 3.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Item as Described, therefore I am ordering a 2nd sleeping bag for my kid",
      "text": "LIKES The sleeping bag kept me warm all night in 38°F weather. Dislikes Once you zip yourself in, it's a really snug fit. That's why I was warm all night while camping in the 38°F woods. Maybe that's a compliment as opposed to a dislike, but it still was a snug fit.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Mugambi",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Great cold weather bag at a great price!",
      "text": "Bought this right before a fall camping trip to Yosemite . It worked great! Warm and seems well built. This is not a backpacking 0 degree sleeping bag for those concerned about weight and size. For cold weather camping that you can drive to, this is perfect. Cant beat the price",
      "rating": 4.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Perfect for camping in the snow, even on accident",
      "text": "Went camping and woke up to a snowstorm in southern California. The fact that I was able to sleep through the night with no issues is a real testament to this bag. Overall comfortable and snug. Can be difficult to unsubscribe from the inside, but this is a small amount for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Anon",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Excellent value",
      "text": "Bought this Coleman bag on a price point. I’m 5’9” and 245lbs. Zipped it easily up to the top. I read review where the buyer couldn’t get it back in the stuff sack. Started head first and it was all put away in about 60 seconds. Thanks Coleman another quality product!",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Morini",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Just what I wanted",
      "text": "So, after suffering during a miserably cold camping trip, I decided to replace my lost mummy bag with this Coleman. In short, it's incredible and well-made. Its zippers and other features are top quality and it's incredibly warm. You won't want to use it for weather above the low 50s. It has one job-keep you warm when it's not outside. It does it well.",
      "rating": 5.0,
      "verified": true,
      "author": "UltraB",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Stands up to cold weather.-still",
      "text": "My son is 15 and stands 5’10”. I bought this sleeping bag for his first camping trip in Connecticut. He stayed in Salisbury and the air temperature was 16 with windchill at 7. He stayed in a tent and was “toasty warm to the point I did not want to get out”. Definitely worth the money. Update 2/7/2020. My son has used this sleeping bad on four different trips now. The last three had single digit temps at night while rent camping. My son has stayed warm and comfortable each night. He is now 6’ tall, weighs 154lbs and has no problem fitting in the sleeping bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich Harris",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Coleman meets Michael Scott",
      "text": "I watched TV in this the other day. Why? Because I'm an adult. I'm a 6'4\", 240lb, adult. Its meant for 0 degrees allegedly. As such, its bug and heavy. Hasn't seen any real world use with me, but if my Office time with it taught me anything, its that it is warm and it fits me. No zipper issues, overall quality construction for the price. I would recommend to anyone intending to camp or even RV in a cooler climate. Probably too large for any serious hiking crew.",
      "rating": 4.0,
      "verified": true,
      "author": "D.Hickory",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Too small for big guys...",
      "text": "Sizing is way off on this bag. The leg room is very tight and the upper part of the bag wouldn't zip up at all. It's a shame because otherwise the bag is well made and I could easily see it working down to 10-15 degrees F. They really need to work on better sizing and description.",
      "rating": 2.0,
      "verified": true,
      "author": "Jon Conley",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Not made for big and tall",
      "text": "I’m a 6’2”, 230 lbs male and I had to return this because it barely fit me. I could hardly zip up the zipper, and had no room to move at all once it was zipped. It was cozy but definitely too tight for me. I bought one for my gf too and she loves hers so she kept it. She’s 5’3” and petite so of course she had plenty of room.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Best One Out There!",
      "text": "VERY WARM! Much bigger than I thought it was going to be! Doesn't make me feel claustrophobic which I thought might be a problem, but isn't at all! Very thick, probably wouldn't recommend it to hikers, or anyone else traveling with it because it is very heavy and thick and kind of tough to roll up. Other than those things, which doesn't matter too much, I LOVE IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Savannah Greer",
      "helpful_votes": 3,
      "publication_date": 20161210
    },
    {
      "title": "Coleman quality at Amazon prices",
      "text": "I bought it because of Coleman's reputation, and I was going on a camping trip with my son's youth group in January. Since this was an oddly warm January, I can only say I worked great in 40 degree nights in a hammock. The quality is what I expected from Coleman, and the price was unbelievable. Thanks for selling a quality product for a decent price. Amazon made all my necessary camping purchases affordable.",
      "rating": 5.0,
      "verified": true,
      "author": "CNG",
      "helpful_votes": 2,
      "publication_date": 20170302
    },
    {
      "title": "Colman 0 degree sleeping bag",
      "text": "I bought 2 of these to replace the ones I bought last year that were rated for 40 degree wether (that my 9 year old and I froze in while using them up in the mountains on a Boy Scout camping trip). Nicly packaged. Eager to try out. I'll update this review after I've used them in a few months. Just because a sleeping bag is rated for 40 degree weather, doesn't mean it will keep you warm- we learned the hard way! 10/18 Update- my son and I used these twice for tent camping in 25-32 degree cold weather. Frost on the ground, but we were warm and toasty! These do the job!",
      "rating": 5.0,
      "verified": true,
      "author": "Tamera",
      "helpful_votes": 0,
      "publication_date": 20170714
    },
    {
      "title": "Excellent quality!",
      "text": "Excellent bag. Best quality for the price of an mummy style bag I’ve used. It’s definitely zero degree rated, zippers are high quality, and it’s an all around great conofortable bag. No complaints. Recommend to anyone looking for a durable cold weather bag. Due to the thickness, this time isn’t the bag for you if you need a lightweight compressable bag for backpacking. For cold weather camping, etc. it’s perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Felton",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "great deal for this temperature rating",
      "text": "make sure you only need down to 0 degrees F. Otherwise it is one of the leat expensive ones at this rating. Not sure about whether having bright neon orange is a good thing other than not too many bags are made in this color.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Coomber",
      "helpful_votes": 2,
      "publication_date": 20180208
    },
    {
      "title": "GREAT sleeping bag",
      "text": "This sleeping bag is fantastic! I used it camping in Utah. It was so comfortable and warm... I was really worried I was going to freeze at night and have terrible regret camping in early spring, but it was perfect. It was so great that I look forward to using it even at home so I am cozy watching a movie on my living room floor! It's that great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "It holds up to it's Zero degree rating",
      "text": "Camping in very cold, and very windy conditions, temps hit single digits and the winds hit 25+ but with a nice pair of Merino wool socks, I actually had to zip the bag down a bit as I was completely toasty. This is not a sleeping bag that one would want to take backpacking as it is a little on the heavier and bulkier side. It's perfect for a campsite in your car or tent. I fully recommend this for cold weather camping.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan H",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Great sleeping bag",
      "text": "Bought this for a daughter before a weekend camping trip. The weather turned pretty bad during her trip and she had some fairly cold nights (mid 20's) up in the mountains. She said she slept very warm every night and was thrilled with her new sleeping bag. I plan on buying a 2nd one of these very soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Clark",
      "helpful_votes": 0,
      "publication_date": 20190605
    }
  ],
  "product_meta": {
    "title": "Coleman 0°F Mummy Sleeping Bag for Big and Tall Adults | North Rim Cold-Weather Sleeping Bag",
    "rating": 4.5,
    "feature_bullets": [
      "Mummy-style adult sleeping bag for camping in temperatures as low as 0 degrees Fahrenheit",
      "Can accommodate most people up to 6 feet 2 inches in height",
      "Semi-sculpted hood tightens with a drawstring to seal in heat; Unzip the bottom for extra ventilation on warmer nights",
      "Quilting construction, insulated footbox, and Thermolock draft tube for warmth and heat retention",
      "ZipPlow system plows away fabric to prevent snagging during zipping"
    ],
    "specifications": {
      "Date First Available": "August 3, 2018",
      "Manufacturer": "Coleman",
      "ASIN": "B07G5GPWXZ",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Sleeping Bags",
      "Sports & Outdoors",
      "Sleeping Bags & Camp Bedding",
      "Camping & Hiking"
    ],
    "price": 37.09
  }
}