{
  "website_summaries": [
    {
      "verdict": "This is your best value on a cheaper glove. A comfortable trainer that works well with punching bags, heavy bags, and sparring.",
      "pros": [
        "Affordable",
        "Made of synthetic leather that holds up well",
        "Antibacterial design fights odor"
      ],
      "cons": [
        "Will wear out under heavy use more quickly than some competitors"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not very durable or very good",
      "text": "I bought these gloves as a replacement for some cheap $20 bulk generic made-in-China gloves my boxing gym has available. Because they are Everlast, I thought they would be good. I've been very disappointed. These gloves offer almost no wrist support, and I had to start using wraps to protect my wrists. After about 4 weeks of medium-duty use, the vinyl is peeling and the stitching is falling apart. The only good thing I can say about them is that they don't smell as bad as other gloves I've used, so they do seem to resist odor as advertised.",
      "rating": 2.0,
      "verified": true,
      "author": "Todd B.",
      "helpful_votes": 0,
      "publication_date": 20110822
    },
    {
      "title": "I had hoped to return them or exchange for gloves that would hold up better, but the site says they are no longer ...",
      "text": "I bought these gloves in July 2015 for Muay Thai and they started falling apart (velcro coming apart at the seams from the elastic at the wrists) this week, less than 9 months later. When they were new, they had a very strong petroleum-like smell that never really went away, and they were very \"boxy,' not at all form-fitting to my hands. As the gloves are falling apart, I had hoped to return them or exchange for gloves that would hold up better, but the site says they are no longer eligible for return or exchange.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160412
    },
    {
      "title": "NO PADDING",
      "text": "its a joke, just for watching , not for using. I got recently two pairs of 14 oz and tried just once and thinking to return or just give away. THERE IS NO PADDING. 14 oz gloves should have padding, you manufacture morons. This gloves hurts when you punch. Where is your brain?",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Great gloves 5/5",
      "text": "These gloves stink a bit like gasoline, but it fades after about 5 times of decent use. I got the black 160z gloves and they fit perfectly. I have big hands, and I'm 6'0 175 pounds. They seem to get the job done on the heavy bag, and for 30 bucks you can't go wrong. They're really durable and I can't see breaking them even after a few years use. Got free shipping and they took a good week to get here, but worth the wait =)",
      "rating": 5.0,
      "verified": true,
      "author": "J L.",
      "helpful_votes": 0,
      "publication_date": 20120714
    },
    {
      "title": "Best gloves for the price",
      "text": "These are the perfect gloves for new boxers or boxing enthusiasts. They don't break the bank like other gloves but still offer a lot of protection and support. (If you're interested in knowing more check out my review blog for a complete breakdown of what makes these gloves great",
      "rating": 5.0,
      "verified": true,
      "author": "Gear and Wear",
      "helpful_votes": 0,
      "publication_date": 20150721
    },
    {
      "title": "Low quality or QC (quality control) issues",
      "text": "The stitching at the thumb started pulling apart after only 4 uses of these gloves - about 30 minutes of usage each time across the span of 2 weeks at a boxing fitness class. Even though these are inexpensive gloves, that doesn't mean they should be expected to fall apart after only 4 uses. Either I got a defective pair of gloves, or all of the gloves are just low quality / durability. I think you're better off buying other comparable gloves if possible.",
      "rating": 2.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20110817
    },
    {
      "title": "Good at first but now starting to fall apart",
      "text": "I got these gloves to use with the heavy bag. I'm just hitting for fitness. Not serious boxing. At first these gloves proved to be good. Combined with hand wraps, my hands didn't hurt after punching. Now after about 2 months of use, once a week, I noticed the right glove seams are coming apart. They're coming apart at the at the outside of the wrist. I'm still using them though. I just wish they didn't start to fall apart so soon.",
      "rating": 2.0,
      "verified": true,
      "author": "Benny",
      "helpful_votes": 0,
      "publication_date": 20090623
    },
    {
      "title": "Nice gloves!",
      "text": "I grew out of my 8 oz. gloves so I purchased the red 12 oz. gloves. They're perfect! I can also fit my hand wraps in them because I wasn't able to fit my hand wraps in my last pair (which is bad). The gloves have mesh material on the inside so they can breath easier after training but I still suggest using glove dogs after your workout. I'm very concerned about the smell though. They smell kind of like moth balls. So I also suggest washing your hands afterwards (in case it's anything bad). I hate the smell but other than that, I think these will work! I can't wait to start boxing in September!",
      "rating": 4.0,
      "verified": true,
      "author": "Carrie H",
      "helpful_votes": 0,
      "publication_date": 20130728
    },
    {
      "title": "Only good for a few months. Terrible Velcro",
      "text": "I rate them pretty poor because the Velcro gives way after about 5 months of regular use. The Velcro on my gloves isn't dirty and looks like it's still in great shape but it just won't hold while I'm using them. It's terribe. I'd stay away from this glove.",
      "rating": 2.0,
      "verified": true,
      "author": "Mike M",
      "helpful_votes": 0,
      "publication_date": 20170319
    },
    {
      "title": "Good gloves",
      "text": "I use these for a kickboxing class I go to once a week. I'm not a professional in any way. The 12 ounce are fine for me. I can put on hand wraps and then put these on. There's still some room but I like it that way because it lets the air flow through and I can easily put them off and take them off by myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Travelbug006",
      "helpful_votes": 0,
      "publication_date": 20151211
    },
    {
      "title": "I love the way they feel when hitting the heavy bag",
      "text": "I'm giving these gloves a 4 rating because of the \"Horrible chemical smell\", as one person put it. The quality is very good, but the smell is awful and I don't think an American company would have let them ship like that (made in China). Don't know if it will ever go away as I've had them for 3 months and airing them daily makes little difference.",
      "rating": 4.0,
      "verified": true,
      "author": "bay driver",
      "helpful_votes": 0,
      "publication_date": 20130223
    },
    {
      "title": "Used for the bag",
      "text": "Been using these for a month now and am ready to provide a review. The gloves (16oz) are very well made. I hit a 100lb heavy bag for about 3 hours a week and there no issues. They fit well even if you double wrap your hands. The everfresh feature keeps them smelling new. The protection is perfect for bag training and the price can't be beat.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Ratel",
      "helpful_votes": 0,
      "publication_date": 20120922
    },
    {
      "title": "DO NOT BUY. Toxic smell.",
      "text": "THEY SMELL HORRIBLE. The box smelled like gasoline, the gloves smell like gasoline, the whole house now smells like gasoline. Even after putting them outside for a few days, no luck in decreasing the smell. Had to return them. This must be toxic.",
      "rating": 1.0,
      "verified": true,
      "author": "kmac",
      "helpful_votes": 0,
      "publication_date": 20150630
    },
    {
      "title": "terrible",
      "text": "I got these when I started and I have bought much better gloves since. Pros -Cheap -Breathable palm Cons - hand compartment is very loose. this is dangerous! - Knuckle padding is insufficient - Padding is at a weird angle so there's a gap between the glove and your hand. - wrist support is terrible; handwraps cannot make up for this completely. - fake leather is very thin especially on the palm side - stitching is falling apart If you plan to use these for more than aerobics, you will hurt your hands and wrists. If you get serious at all, you will probably upgrade within a month or two. Just save your $25 towards better gloves now.",
      "rating": 1.0,
      "verified": true,
      "author": "IndoorOutdoorCook",
      "helpful_votes": 2,
      "publication_date": 20120207
    },
    {
      "title": "Alright",
      "text": "These gloves are good quality and good for sparing.. but if you use them for hard training session your knuckles start to hurt from doing hooks and power punches. If really looking to get into boxing and training, recommend different gloves",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150909
    },
    {
      "title": "Nice gloves for a novice",
      "text": "I like these gloves. There's plenty of padding, I use 108 wraps underneath and my hands don't hurt at all after beating hard on the bag for an hour. I got the 14oz pair. I don't have very big hands and they fit a lot better than most of the other gloves I've tried. The wrist strap isn't the most secure, but these are good gloves for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Ellis",
      "helpful_votes": 0,
      "publication_date": 20110420
    },
    {
      "title": "Research is knowledge",
      "text": "I just started kick boxing so these gloves are fine. However, I didn't realize gloves have different strap lengths. The gloves I received have very short straps. It's hard to fasten the 1st glove and almost impossible to fasten the 2nd glove. Oh well, will research better next time.",
      "rating": 4.0,
      "verified": true,
      "author": "Sholden7 ",
      "helpful_votes": 0,
      "publication_date": 20110224
    },
    {
      "title": "They stink, literally",
      "text": "They may be find for sparring and general training use but I refuse to use them. They have an intense tar smell that truly reeks. They taint my hands with their odor that will not leave after multiple washings. I can't even keep them in the house their odor is so obnoxious. I'll be returning them.",
      "rating": 1.0,
      "verified": true,
      "author": "David R. Cline",
      "helpful_votes": 0,
      "publication_date": 20131230
    },
    {
      "title": "Great Glove for the price",
      "text": "I'm currently on deployment and ordered these gloves even with the extra 4-5 stops they arrived in less than a month. Faster than the packages from home get here. Extremely cheap, I wish i'd purchased two pair. The guys love them and they are in almost constant use. We've had them here for a couple weeks and they don't show any signs of wear yet. As far as smell we cut the top and bottom off of two gatorade bottles and stuff them inside overnight to help air them out, so far they don't stink (to bad). For double the price you can get some nice ones but I haven't found a better pair for the cost than these.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20120521
    },
    {
      "title": "Toxicity overules.  Unhealthy gloves",
      "text": "They gave me a headache right off. They use some extremely toxic chemicals in production. Not sure if it is phthalates or something else but it cannot be good if it gives me a headache. Consider me the canary in the coal mine.",
      "rating": 1.0,
      "verified": true,
      "author": "UknowNo Me",
      "helpful_votes": 0,
      "publication_date": 20150809
    },
    {
      "title": "Nice gloves",
      "text": "I bought these gloves to use on my heavy bag. I looked around at local sports stores, sears, etc. They were all similarly priced at $29.99 You can get the red ones for $18 which is almost 1/2 price. I bought two pairs of the 12oz gloves - 1 blue for me and 1 pink for my wife. I've beat my bag to death in the past week with these gloves and I love them. They fit very well and in my opinion are definitely professional quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin J. Edwards",
      "helpful_votes": 0,
      "publication_date": 20100601
    },
    {
      "title": "Garbage quality and Horrible chemical smell",
      "text": "DO not buy these gloves. They aren't worth the little money you spend on them. They are extremely cheap and flimsy and give off a STRONG chemical smell. Do not underestimate how strong these gloves smell. Its nauseating and it doesnt go away. Regret every penny spent on this trash. If your serious about training, and want a quality product, invest in some reyes gloves. They are $100+ but real leather and they last you. I dont even want to give these gloves away they are so bad. The garbage seems like the final destination for this crap. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Black Beard",
      "helpful_votes": 0,
      "publication_date": 20120219
    },
    {
      "title": "Works For Me...",
      "text": "A little tight-fitting to start with (I think that will change with use), but just the ticket for the fitness kick-boxing classes I'm taking at LA Boxing. Not so big and bulky as the 14/16 oz. gloves that most folks seem to wind up with.",
      "rating": 4.0,
      "verified": true,
      "author": "C. H. 'Harry' Jones",
      "helpful_votes": 0,
      "publication_date": 20100912
    },
    {
      "title": "Why I box.",
      "text": "I box for fun, sport, to lose weight and for fun. Also I box because I love to use these gloves. If you want something that'll you'll love to put on and be excited to use every time then buy these gloves! I want to stop writing now and go train! If you have any questions about size or fitting just make sure you choose carefully. 3 sizes fits most. And it's a great fit. You can't go wrong otherwise.",
      "rating": 5.0,
      "verified": true,
      "author": "Ethan L Swift",
      "helpful_votes": 0,
      "publication_date": 20140502
    },
    {
      "title": "Everlast Pro Style Gloves",
      "text": "The velcro straps started to tear quickly for me and I do a heavy bag workout 3x a week they also don't hold well either. I think they are cheap because the lining on the inside also tore. They say these gloves are for bag work, pad work, and sparring but from my experience they would be best used for pad work only because they are fairly ventilated.",
      "rating": 2.0,
      "verified": true,
      "author": "Theland216",
      "helpful_votes": 0,
      "publication_date": 20140315
    },
    {
      "title": "Everlast Pro Style Training Gloves (black, 14oz.)",
      "text": "Received these yesterday and I must say, they are well put together. I actually used this website;  to buy the appropriate size. I would definitely recommend this product to anyone interested in Boxing, Kickboxing or Muay Thai.",
      "rating": 5.0,
      "verified": true,
      "author": "Gage",
      "helpful_votes": 2,
      "publication_date": 20130625
    },
    {
      "title": "Quality not so good, wrist wrap velcro ripped after about a month of use",
      "text": "Wrist wrap velcro ripped after about a month or so of usage.....waiting for it to totally rip, throw them away, and buy a new pair.",
      "rating": 2.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20141113
    },
    {
      "title": "Good gloves for the price",
      "text": "Great for hitting a bag. Solidly made. Padding is spread out a bit so you can really feel the punches, I'd probably look for something a bit more padded for sparring though.",
      "rating": 4.0,
      "verified": true,
      "author": "The Foo",
      "helpful_votes": 0,
      "publication_date": 20110626
    },
    {
      "title": "Not durable",
      "text": "Velcro started falling apart after 30 days, you get what you pay for.",
      "rating": 2.0,
      "verified": true,
      "author": "Carlos DeOliveira",
      "helpful_votes": 0,
      "publication_date": 20160103
    },
    {
      "title": "bought this, then went to the store to try out protex gels",
      "text": "the product is ok for beginners or someone messing around. as fair as its breathable mesh, not really.. it wasn't long before my hands started sweating. i wouldn't want to spar with these, because there isn't enough cushion and the straps could cut someone. shipped on time (2 days for prime). all in all, if you have money, the protex gel is the way to go. go out to the local sports store and try them on. you will see the difference. big time. so much more comfortable.",
      "rating": 2.0,
      "verified": true,
      "author": "dt",
      "helpful_votes": 0,
      "publication_date": 20110509
    },
    {
      "title": "Great Gloves",
      "text": "They fit well and are easy to take on and off. Highly recommended. They are durable and look great. I would recommend a standard weight gloves.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy F",
      "helpful_votes": 0,
      "publication_date": 20120112
    },
    {
      "title": "Unusable due to horrid smell. How are these gloves not considered toxic?",
      "text": "Unusable!!! These gloves smell so horribly bad that they made me feel queasy throughout the workout. Had to return... I don't know how these things are not actually toxic as they smell like they were soaked in gasoline. Again, it's usually the workout that makes me want to hurl.... but these gloves did the trick right up front. What I don't understand is that my friends have the same exact pair they got at a store, and they smell fine. Not sure if these are \"the real thing\".",
      "rating": 1.0,
      "verified": true,
      "author": "E. Schienke",
      "helpful_votes": 3,
      "publication_date": 20160214
    },
    {
      "title": "Good For Bag And Sparring",
      "text": "These are a huge improvement over my old gloves. They seem to provide good protection. I have used them for both sparring and heavy bag work and they are holding up well. They fit snugly when wearing 180\" wraps and my large hands but it's not that bad. I would recomend them to anyone starting boxing especially for the price. (The same exact thing was $80 at a large retail chain)",
      "rating": 5.0,
      "verified": true,
      "author": "C. Owen",
      "helpful_votes": 2,
      "publication_date": 20070919
    },
    {
      "title": "Everlast- My A$$",
      "text": "The name really is ironic. I've only had these for about 9 months, and barely have used them. Nothing too high impact, and I don't see how I could have used them incorrectly. Simply put- they're garbage. See attached.",
      "rating": 1.0,
      "verified": true,
      "author": "Lex",
      "helpful_votes": 6,
      "publication_date": 20160905
    },
    {
      "title": "Poor quality.",
      "text": "The velcro on these gloves stopped working with in 3 months of use. Poor quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Justin M. Walsh",
      "helpful_votes": 0,
      "publication_date": 20171225
    },
    {
      "title": "Smell terrible",
      "text": "Showed up a week ago. They look and felt great then I noticed the smell. They reak of mothballs so bad it actually transfers to my hands and cloths when I wear them. I've tried washing then but they still stink.",
      "rating": 1.0,
      "verified": true,
      "author": "John Lopes",
      "helpful_votes": 0,
      "publication_date": 20150122
    },
    {
      "title": "Choose a different pair",
      "text": "These gloves are a big disappointment. I have been training with these for just over four months and the left glove will not stay fastened without tape. I train 3x/week, so really, that's only about 72 or so hours of real use. I expected a longer lasting pair of gloves. I bought the black 16 oz-ers.",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa Bartlett",
      "helpful_votes": 0,
      "publication_date": 20130831
    },
    {
      "title": "Great for sparring",
      "text": "First of all everyone complaining about the smell shut up. It's not even that bad. Ur not using these to go on a date your boxing. Good padding, a little roomy inside (wraps solve tht) doesn't hurt at all when sparring (16 oz) overall great for 30$.",
      "rating": 5.0,
      "verified": true,
      "author": "Spitta Andretti",
      "helpful_votes": 0,
      "publication_date": 20140523
    },
    {
      "title": "you get less then you pay for with these toxic gloves...",
      "text": "toxic... warning on label that says that chemicals used to make them cause birth defects, etc... they stink of chemical and that is why...",
      "rating": 1.0,
      "verified": true,
      "author": "joshua m harris",
      "helpful_votes": 0,
      "publication_date": 20150331
    },
    {
      "title": "Nice gloves for  training",
      "text": "Nice price for such gloves. However,the wrist part of this glove is not very strong. If you want to use this pair of gloves, you must wear hand warps for more protection.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonas",
      "helpful_votes": 0,
      "publication_date": 20110927
    },
    {
      "title": "Good for beginners",
      "text": "I bought these gloves (12-oz) 9 months back and after using them for boxing (punching the bag), they have torn from multiple places.",
      "rating": 3.0,
      "verified": true,
      "author": "A S",
      "helpful_votes": 0,
      "publication_date": 20170118
    },
    {
      "title": "Five Stars",
      "text": "These gloves are amazing!! Would not recommend anything else for training!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170621
    },
    {
      "title": "Awesome worth getting",
      "text": "this is some very good boxing gloves it fits me perfectly and keeps odors away from it and still smells fresh i recommend anybody that spars alot to get these. these are perfect for sparring and are very comfortable and i recommend for people who are just buying it to get black black is great for starters worth the buy",
      "rating": 5.0,
      "verified": true,
      "author": "Batatua",
      "helpful_votes": 0,
      "publication_date": 20120727
    },
    {
      "title": "Used to be better",
      "text": "I bought a pair of the 14 oz a couple years ago and they lasted for like two and a half years. Then the lining started ripping and they were hopelessly stinky so I bought a new pair last week. The new pair stank like chemicals *way* worse than the other pair, the wrist is much floppier and offers no support, and the velcro is harder to fasten.",
      "rating": 3.0,
      "verified": true,
      "author": "h copperman",
      "helpful_votes": 0,
      "publication_date": 20120425
    },
    {
      "title": "Lasted about 5 months...",
      "text": "These gloves may be good for aerobics, but they only lasted my first 5 months of heavy bag training and some light sparring before the seams started falling apart. The gloves are fine to try to see if you like boxing, but for long term use look for a higher end glove, especially if you hit harder than a 60 year old woman.",
      "rating": 2.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20120523
    },
    {
      "title": "Less than 4 weeks and the lining is torn",
      "text": "The inside of the right glove began to shred within a matter of weeks. Unfortunately it was past the return policy of the seller. Needless to say I'm very displeased. ------------------------------------------------------------------------- Also don't order from MMA ONE STOP SHOP they are not a licensed dealer so if the product is defective the manufacturer will not do anything about it. Their customer service is useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Azriel Abyss",
      "helpful_votes": 12,
      "publication_date": 20120223
    },
    {
      "title": "Love these gloves",
      "text": "We love these gloves. My whole family uses them to box each other. We've had them a year and they are still in great shape.",
      "rating": 5.0,
      "verified": true,
      "author": "terilee",
      "helpful_votes": 0,
      "publication_date": 20111215
    },
    {
      "title": "Great Bag Gloves",
      "text": "These gloves are really great for hitting the bag or training. They do run a little tight, I have the 12oz gloves and have pretty small hands for a guy and they feel a bit tight. I still have to break them in so Im sure the gloves will fit perfect once I do. But If you like your gloves to fit a little loose get the 14oz.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20090608
    },
    {
      "title": "Avoid if you can",
      "text": "Within a month, the velco rips off of the spandex. The padding for the knuckles give no support for anybody with decent punching power. Pros: Inexpensive Cons: Poor quality",
      "rating": 1.0,
      "verified": true,
      "author": "Adrienne Rae S. Garcia",
      "helpful_votes": 0,
      "publication_date": 20150218
    },
    {
      "title": "Split seam after minimal use.",
      "text": "Seam split after less than an hour of use. Otherwise they were fine, though the velcro didn't get as tight on the wrists as I would have liked. I'm returning them and looking elsewhere.",
      "rating": 2.0,
      "verified": true,
      "author": "farmer ellis",
      "helpful_votes": 0,
      "publication_date": 20140328
    },
    {
      "title": "Not good if you hit heavy bags",
      "text": "These may be decent gloves for beginners but if you are a decent amateur fighter, train semi seriously, or throw heavy punches on the bag, pick another glove. I used these gloves for about 3 weeks and the middle knuckle on my left hand is starting to hurt from throwing a lot of jabs. I think I'm just going to have to bite the bullet and buy a more expensive more serious hook and loop glove as these just dont do the job.",
      "rating": 2.0,
      "verified": true,
      "author": "N. Watkins",
      "helpful_votes": 0,
      "publication_date": 20110502
    },
    {
      "title": "Arrived right on time and should work great for just sparring with friends",
      "text": "Arrived right on time and should work great for just sparring with friends, fit fine and are good quality for what you pay for.",
      "rating": 5.0,
      "verified": true,
      "author": "catervt",
      "helpful_votes": 0,
      "publication_date": 20150319
    },
    {
      "title": "Terrible, terrible smell",
      "text": "Terrible, terrible smell. Can't use them because of that. Can anyone advice how to get rid of the smell?? please.",
      "rating": 2.0,
      "verified": true,
      "author": "J.V.",
      "helpful_votes": 0,
      "publication_date": 20140915
    },
    {
      "title": "Pretty Good",
      "text": "Bought these gloves. I am 5'11\" with medium sized hands. When I first put them on they were so incredibly tight that I was considering returning them. They have stretched and fit perfect even with wraps underneath. Good buy",
      "rating": 4.0,
      "verified": true,
      "author": "Twin Momma 713",
      "helpful_votes": 2,
      "publication_date": 20080808
    },
    {
      "title": "Two Stars",
      "text": "The wrist wraps on both gloves fell apart within 2 months. I would not buy these gloves again.",
      "rating": 2.0,
      "verified": true,
      "author": "jacob brodie",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "Good Protection",
      "text": "First pair of boxing gloves, just wanted them to hit a heavy bag. They work great, good wrist support and padding for hitting the bag. Also easy to put on for just one person thanks to the velcro. Good purchase, product is well made.",
      "rating": 5.0,
      "verified": true,
      "author": "DK",
      "helpful_votes": 9,
      "publication_date": 20071022
    },
    {
      "title": "Three Stars",
      "text": "Good gloves, but the odor is unbearable and it does not fade away.",
      "rating": 3.0,
      "verified": true,
      "author": "Rich B",
      "helpful_votes": 0,
      "publication_date": 20150901
    },
    {
      "title": "there ok",
      "text": "these gloves are ok but however when i punch the bag alot with wrap on i start to feel my knuckles hurt.",
      "rating": 2.0,
      "verified": true,
      "author": "rod",
      "helpful_votes": 0,
      "publication_date": 20120625
    },
    {
      "title": "Awesome!",
      "text": "Wonderful product! Great quality! Good Shipping is a must have product ! No damage to the product. Great for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "The Best",
      "helpful_votes": 0,
      "publication_date": 20130930
    },
    {
      "title": "Decent boxing gloves",
      "text": "I bought these gloves for my Krav Maga class. They are very durable and comfortable. They hold up well during long drills as well as combat sparring.",
      "rating": 3.0,
      "verified": true,
      "author": "eric",
      "helpful_votes": 0,
      "publication_date": 20120618
    },
    {
      "title": "These gloves fit okay and were reasonably priced. But ...",
      "text": "These gloves fit okay and were reasonably priced. But... the smell has overwhelmed our entire house. We have been forced to put the gloves in another room and shut the door. I would be highly surprised if I found out that these gloves did not cause cancer. Highly, highly surprised.",
      "rating": 2.0,
      "verified": true,
      "author": "Alan",
      "helpful_votes": 0,
      "publication_date": 20140815
    },
    {
      "title": "pos",
      "text": "The right of my glove set puts the punches' force into the second set of knuckles, not first set. So the glove ends up hurting the fingers.",
      "rating": 1.0,
      "verified": true,
      "author": "d",
      "helpful_votes": 0,
      "publication_date": 20160131
    },
    {
      "title": "I looked into the smell and found tht they are made with \"Chemicals known by the state of california to cause birth defects\" (no",
      "text": "These glove look very attractive and fit really well but the smell was too much. The smell was nauseating and strong enough to be smelled in the next room. I looked into the smell and found tht they are made with \"Chemicals known by the state of california to cause birth defects\" (not surethat they cause the smell but it was just another reason to retun them) so this wasnt something I was comfortable wearing and sweating in 5 hours a week. I returned them with no problem.",
      "rating": 2.0,
      "verified": true,
      "author": "patrick cador",
      "helpful_votes": 0,
      "publication_date": 20150222
    },
    {
      "title": "Nice gloves for heavy bags training",
      "text": "Very nice protection for heavy bags training. Nice grip also. There is one thing I have to say though - these gloves tend to run small, I mean, my hands are medium amongst Americans and I had to squeeze them into these gloves every time. I don't know what would happen to those who have bigger hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Doctor Yoda",
      "helpful_votes": 45,
      "publication_date": 20070202
    }
  ],
  "product_meta": {
    "title": "Everlast Pro Style Training Gloves",
    "description": "Pro style gloves designed for optimum training. Our gloves promote proper punching technique because they are conformed to the natural shape of your fist. Dense, innovative two-layer foam provides better shock absorbency and full padding on the front, back and wrist to promote proper punching technique. These gloves also utilize our exclusive ThumbLok feature for added safety. Choose from traditional laceup or hook-and-loop wrist strap for quick on and off. Made of durable synthetic leather.\n\nWarranty:\n\nEverlast warrants its products to be free from defects in materials and workmanship for a period of 120 days from date of purchase, provided they have not been subjected to obvious abuse, neglect or misuse. Everlast's sole liability is limited to repairing or replacing products that are returned within this 120-day period, unless specific product literature specifies otherwise.\n\nPlease contact customer service for full details, and for replacement assistance at 1-800-821-7930.\n\n\n\nAMAZON.COM\nIf you want to fight like a pro, you have to train like a pro. Enter the Everlast Pro Style training gloves, which help you train properly every time you step up to the bag. Made of synthetic leather, the Pro Style gloves are built to promote proper punching technique, with full padding on the front and back of the wrist that conforms to the natural shape of your fist. As a result, the gloves not only teach your hands how to punch correctly, but they also prevent injury. This dense two-layer foam sandwich also protects your wrists, as does the exclusive ThumbLok feature, which keeps your thumb and fist positioned correctly. Perhaps best of all, the gloves are designed using EverFresh materials. Available in 12-, 14, and 16-ounce sizes, the gloves offer the choice of a traditional lace-up design or a hook-and-loop Velcro strap for quick on and off. \n\n About Everlast\nAlthough the name Everlast is synonymous with boxing, the company actually started out as a swimwear manufacturer in the Bronx in 1910. The son of a tailor and an avid swimmer, 17-year-old Jacob Golomb grew dissatisfied with the flimsy swimsuits of the time, which barely lasted a season. In response, he began making suits that he guaranteed would last for a full year. He proudly gave them the name \"Everlast,\" and although the swimsuits did not last throughout history, the name did. In subsequent years, Golomb transformed his company into a small retail store that carried a full line of sports equipment. In 1917, a young fighter named Jack Dempsey introduced boxing to Golomb and Everlast. Dempsey asked Golomb to construct protective headgear that would last more that 15 rounds of intensive boxing training. In 1919, Dempsey won the world heavyweight championship wearing boxing gloves made for him by Golomb, and shortly afterward, Everlast became the boxing equipment headquarters throughout the world. Dedicated to leveraging the unique qualities represented by the Everlast brand--strength, dedication, individuality, and authenticity--the Everlast brand is now present in more than 101 countries and has 88 licenses worldwide.",
    "rating": 2.7,
    "feature_bullets": [
      "Full padding on the front and back of the wrist promotes proper technique",
      "ThumbLok feature keeps thumb and fist positioned correctly to prevent injury",
      "Pairs available in 12, 14 and 16-ounce sizes in multiple colors"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "11.7 x 5.1 x 1 inches; 10.88 Ounces",
      "Department": "Unisex-adult",
      "Date First Available": "July 5, 2005",
      "Manufacturer": "Everlast",
      "ASIN": "B000JF4M8C",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Other Sports",
      "Boxing",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Boxing Gloves"
    ],
    "price": ""
  }
}