{
  "website_summaries": [
    {
      "verdict": "It’s pricier than some others, but its build quality helps to justify the cost.",
      "pros": [
        "Contains all of the items you need to replace the filter and related components",
        "High quality gasket helps to prevent leaks",
        "Matches up nicely with quite a few different vehicle makes and models for a perfect fit"
      ],
      "cons": [
        "Adjusting the torque to avoid leaks can be tricky during installation"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Works well with the 45RFE, 545RFE and the 65RFE 4WD pan or the newer trucks with the common pan.",
      "text": "I had an 04 Ram 1500 Hemi with the 545RFE 2WD. This filter set (sump filter) won't fit but this fits the newer version 65RFE transmission with the deeper common pan. My current truck is a 2015 Ram 1500 Hemi with the 65 RFE. The gasket is a rubber type of gasket that holds the 8mm pan bolts nicely for easy installation. Be sure to use a Torx T-25 on the sump (plate) filter. The plate filter comes with a small round seal that you can press in with a 3/4 socket with extension tapping it in place with a hammer. Can't go wrong with a Wix filter.",
      "rating": 5.0,
      "verified": true,
      "author": "American",
      "helpful_votes": 3,
      "publication_date": 20190506
    },
    {
      "title": "Complete kit",
      "text": "Contains everything you need to complete the filter change. For my 2010 Ram with 545RFE, the spin on filter takes 84 in/lb of torque. Make sure you torque it as required by OEM. There have been occurrences of the spin on filter coming of. The main filter is easy to change, just make sure to remove the small O-ring seal from the old filter from the case.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 10,
      "publication_date": 20170131
    },
    {
      "title": "Works as it should!",
      "text": "Bought this for my 06 Jeep Commander Limited Hemi. So far so good! Gasket works great, with no leaks, and it's much less of a hassle to deal with than rtv, especially since it's a pain to get the pan back on the commander (very little wiggle room). Filters seems to be doing their job just fine too. Do yourself a favor and buy the Dorman replacement pan for $35 that has a drain plug to make future drains a lot less messy. Overall I highly recommend these filter and gasket kit!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 4,
      "publication_date": 20180813
    },
    {
      "title": "Fits 2005 Durango 5.7L 4WD 545RFE",
      "text": "This kit fit my 2005 Durango perfectly. Note this kit is for the 4WD transmission \"deep pan\". For the 2WD version you'll need the \"shallow pan\". The kit has everything you need - the main filter, spin on return filter, and a new gasket. I installed this kit a couple of years ago and it has been great. Ordering a new one now to change the filters while the pan is dropped to change the solenoid pack.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 8,
      "publication_date": 20160513
    },
    {
      "title": "Very good product, excellent price",
      "text": "This filter set was purchased to service the automatic transmission, 545RFE, of a 2004 Jeep Grand Cherokee, 4.7 liter. The filters and the attachments are very good fits, EXACTLY LIKE ORIGINAL PARTS, all made like you expected for a not real simple job. This type of service should be made by experienced mechanics, fitment and proper installation are critical and failure to do so will result in transmission damage!",
      "rating": 5.0,
      "verified": true,
      "author": "Bobby Feldman",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Great filters, wrong gasket",
      "text": "I ordered these filters for my 2011 Ram 1500. I needed to drop the valve body and so I replaced the filters too. Long story short, the filters were correct but the pan gasket was completely wrong. Luckily I had some rtv to use.",
      "rating": 2.0,
      "verified": true,
      "author": "Joe D",
      "helpful_votes": 5,
      "publication_date": 20180422
    },
    {
      "title": "Works great on an 02 4x4 Durango",
      "text": "This worked great on my 02 4x4 Durango. The quality of the parts appeared to be just as good as the OEM filter in place and the fitment was exactly the same. I bought the truck used. We drove it for about 3 weeks before I could get the parts and time lined up to do the trans fluid change. Right before I could get to it we got a check engine light for low or burned trans fluid, and it could have been worse. I changed out the fluid that was well overdue and the light went out and we haven't had any problems. I'm happy with this kit and will use it again.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Bryan",
      "helpful_votes": 4,
      "publication_date": 20141218
    },
    {
      "title": "Exact fit and replacement for factory filters.",
      "text": "Installed these on my 2007 Dodge 2500 with the 6.7 liter Cummins Diesel. Everything fit perfectly but as my transmission oil pan was factory sealed with RTV silicone I elected to use that again and not the supplied gasket. Just because.",
      "rating": 5.0,
      "verified": true,
      "author": "MichaelJT",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Was not the correct filter.",
      "text": "I didn’t receive the correct filter. I was told this product fit my vehicle. Shipping was fast however when I received my package the filter was for a 4x4 and my vehicle is a 2x4. So I had to run to advance auto and get the correct filter.",
      "rating": 2.0,
      "verified": true,
      "author": "michael m.",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Works Well in the 65RFE",
      "text": "I installed this in a 2012 Ram 1500 with the 65RFE transmission. I have put about 700 miles on it so far without a problem. I will mention that I did not use the included gasket, instead I went with the manufacturer-recommended oil-resistant RTV. Everything seems to be working as it should, so I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy92",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Works for 03 Ram 2500 5.7l",
      "text": "I looked for a filter for my trans on Parts geek and the product number for this kit came up. Bought it through Amazon because it was cheaper and everything works just fine. Gasket was nice quality and fit perfect too.",
      "rating": 5.0,
      "verified": true,
      "author": "Colten G.",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Fluid change",
      "text": "I bought the Mopar fluid and the Wix filter kit and had a local independent shop do the install for $170. Worth it to have someone else get messy and ensure it does not leak. They used 7.9 quarts of fluid in my 2011 Ram 1500 4x4.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Gibbons",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Two of three parts was not good enough.",
      "text": "Wrong pancake filter. The rest was correct. I live out In the country and just can’t run to the auto parts store real quick. Once I got the vehicle in the air and the pan removed, fluid drained out and was doing the reinstalls I found out the pancake filter was not the right one. WIX Quality Control messed this up. Amazon Is making it better but it was a huge PITA caused by WIX.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeanette Mayle",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "DO NOT BUY!!!!!!",
      "text": "DO NOT BUY!!!!!!!! This is not a Wix filter quality is horrible I think the item I received was counterfeit item china knockoff I returned had to get one from auto parts store in town also filter has a hole at top that wasn’t on OEM or auto parts store one",
      "rating": 1.0,
      "verified": true,
      "author": "Adam P.",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "good quality",
      "text": "The kit looks to be good quality although I have not installed it yet but I'm sure everything will go smooth. I bought for a 2007 Dodge Durango 4.7 fex fuel.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew L",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "For my 2004 Durango 5.7",
      "text": "I purchased this and installed it on my 2004 Dodge Durango SLT 5.7 Hemi, kit is complete, all need is ATF-4 trans fluid, I used Valvoline fluid, 6.5 quarts.",
      "rating": 5.0,
      "verified": true,
      "author": "ABC",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Best filters made.",
      "text": "Wix has always been my choice for automotive filters. There was a product comparison on-line that proved what I have always known. Wix makes the best filters!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael central Wisconsin",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Has the pan gasket and filters",
      "text": "The filters fit and this comes with a pan gasket so don't have to mess w factory rtv gasket again - fluid extractor is a help to install this as lots of fluid in trans - 2008 jeep hemi - wix always high quality like their oil filters",
      "rating": 5.0,
      "verified": true,
      "author": "No1Dad",
      "helpful_votes": 2,
      "publication_date": 20160829
    },
    {
      "title": "Seems to work well.",
      "text": "Installed as directed. Put over 1000 miles since and it seems to be working as it should.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry H. Morton",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "So far so good",
      "text": "Install was easy but messy seems to be working fine after 5k miles.",
      "rating": 5.0,
      "verified": true,
      "author": "matt",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Good set except you have to push up on the ...",
      "text": "Good set except you have to push up on the filter material at the oil pan inlet or it will clog the entry way. MADE IN CHINA.. It has a good rubber gasket so you don't need sealant, just 105 inch pounds torque on pan.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "Wix filter fits, if you do your homework",
      "text": "arrived on time, fit just fine. You have to read description carefully and properly identify your transmission to get the right kit.",
      "rating": 5.0,
      "verified": true,
      "author": "David Wahl",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Works fine, but one filter was made in Mexico and ...",
      "text": "Works fine, but one filter was made in Mexico and one in China. I did not use the gasket (used RTV instead). Both of my old Chrysler filters were made in USA. I will spend a little bit extra to buy American next time.",
      "rating": 3.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "not all parts included",
      "text": "this product does not come with both filters as pictured only the main not the canister filter. Hopefully this helps keep someone out of situation i was put in",
      "rating": 2.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 2,
      "publication_date": 20170821
    },
    {
      "title": "Perfect replacement and matched what I took off the truck",
      "text": "I purchased this to perform a well overdue filter/tranny fluid swap out. Parts fit perfect. Truck shifts much better.",
      "rating": 5.0,
      "verified": true,
      "author": "John Herron",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Five Stars",
      "text": "Worked as required and fit my 2012 Ram 3500 4WD perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170924
    },
    {
      "title": "68RFE needs filtered often if you tow",
      "text": "Everything I needed to do the job right. I did replace the plastic nipple that comes in the spin on filter with a billet one that I purchased from an aftermarket transmission vendor. Stock Plastic nipples are prone to crack and break.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Right Filters - Wrong Gasket",
      "text": "The filters were identical to the original ones and fit perfectly. The transmission pan gasket did not fit, and was for a much smaller pan.",
      "rating": 3.0,
      "verified": true,
      "author": "Randolph D. Maddox",
      "helpful_votes": 0,
      "publication_date": 20171007
    },
    {
      "title": "Fits perfect, must follow instructions especially with seal install. Gasket is thick and soft, holds oil perfectly, no leaks.",
      "text": "Fits perfect, must follow instructions especially with seal install. Gasket is thick and soft, holds oil perfectly, no leaks.",
      "rating": 5.0,
      "verified": true,
      "author": "Vlad and Anita",
      "helpful_votes": 0,
      "publication_date": 20170813
    },
    {
      "title": "Five Stars",
      "text": "Parts were correct and fit perfect. 2003 Dodge Ram 1500, 5.7L 4x4. 545RFE trans.",
      "rating": 5.0,
      "verified": true,
      "author": "Noah",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Perfect fut",
      "text": "Worked great and easy to put on. Fit my 00 Dodge Durango",
      "rating": 5.0,
      "verified": true,
      "author": "shawna r spellman",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "This is the 4x4 Filter",
      "text": "This does not fit the 2WD Shallow pan trannys. It has a longer sump pickup that will not allow you to install the pan. The 4x4 pan has a deep area to allow for this filter.",
      "rating": 3.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Missing parts",
      "text": "Ordered two for two vehicles. One kit was missing the screw on filter the other was missing the gasket. All WIX has to do is tape the box.",
      "rating": 1.0,
      "verified": true,
      "author": "R. Clemmons",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Worked well for my Jeep Liberty 2002 transmission. This ...",
      "text": "Worked well for my Jeep Liberty 2002 transmission. This was a lot of work at the time and messy. But I got it done all on my own. Transmission running smoother than ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20150211
    },
    {
      "title": "Damaged filter in box",
      "text": "One of the filters came damaged, shipping box wasn't damaged",
      "rating": 1.0,
      "verified": true,
      "author": "Sergiy Kuzin",
      "helpful_votes": 2,
      "publication_date": 20190204
    },
    {
      "title": "Kit does the job right and saved my trany!",
      "text": "Worth it! Nice kit with good gasket and both filters get changed at once!",
      "rating": 5.0,
      "verified": true,
      "author": "J. J. Watkins",
      "helpful_votes": 0,
      "publication_date": 20161115
    },
    {
      "title": "Wix 58843 Filter Kit",
      "text": "I love to use WIX filters on my Jeep. They're relatively cheap and one of the best (scientifically proven) filter companies out there, consistently beating out the more expensive filter companies (I'm looking at you FRAM). The kit comes with everything you need for a transmission fluid swap, at least on the filter, gaskets, and seals end of it. Just to clarify for those who may be wondering, the difference between this and the 58846 kit is that this, the 58843 kit is for 4WD models, while the 58846 is for 2WD models. I have a 99 Grand Cherokee 4.7 with the 545RFE.",
      "rating": 5.0,
      "verified": true,
      "author": "mycreativename",
      "helpful_votes": 29,
      "publication_date": 20120108
    },
    {
      "title": "Great product",
      "text": "Just like OEM. Very happy with the products. Gasket was very well made. Worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Works great! Absolutely no leaking from the gasket",
      "text": "Installed on my 2005 Jeep Grand Cherokee Limited, 5.7 Hemi. Works great! Absolutely no leaking from the gasket.",
      "rating": 5.0,
      "verified": true,
      "author": "Rex W. Buchanan",
      "helpful_votes": 0,
      "publication_date": 20160830
    },
    {
      "title": "high quality replacement filters",
      "text": "Filters fit fine. I did not use the pan gasket, just Permatex transmission gasket sealer. be careful with the seal.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Haskin",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "Bad thread on return filter",
      "text": "Gasket worked well. Sump filter worked well. Spin-on return filter had a damaged thread right out of the packaging - had to go to AAP to replace it, since I needed the car back on the road.",
      "rating": 3.0,
      "verified": true,
      "author": "ctmick",
      "helpful_votes": 0,
      "publication_date": 20160712
    },
    {
      "title": "Five Stars",
      "text": "These seemed to improve shifting in my 2007 Ram 1500 with 171,000 miles",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Worked great to fix our Jeep",
      "text": "Worked great to fix our Jeep. Got a little too carried away and jumped our jeep.... and the filter fell off when we landed. It wasn't the first time we jumped....poor little filter hung on as long as it could!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Johns",
      "helpful_votes": 0,
      "publication_date": 20141209
    },
    {
      "title": "Doesn't fit Jeep Liberty 2007",
      "text": "Ended up as a waste of money. Doesn't fit my Liberty 2007. Be careful when buying it for your car.",
      "rating": 1.0,
      "verified": true,
      "author": "Ihor K.",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Fits",
      "text": "I thought wix was from USA. Product says on it otherwise.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Works Great",
      "text": "Same/better quality than the oem Mopar from the stealership, but much cheaper. I like WIX filters and use them wherever I can. Used this kit during my recent transmission service on my diesel CRD Jeep Liberty 4x4, with the 545RFE transmission.",
      "rating": 5.0,
      "verified": true,
      "author": "diesel KJ",
      "helpful_votes": 7,
      "publication_date": 20120214
    },
    {
      "title": "Fast shipping and excellent quality.",
      "text": "Fit pretty good at 2005 Ram 4.7L 4WD(5-45RFE Transmision), after 3weeks not pressure or temp problem, so far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Javier D.",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Five Stars",
      "text": "Fit perfectly on my 48 RFE tranny in an 08 Dodge diesel 4x4",
      "rating": 5.0,
      "verified": true,
      "author": "Paul R. Haller",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "... a while back when they had engines with names like elephant! Hemi",
      "text": "former light duty line mechanic a while back when they had engines with names like elephant ! Hemi, Rat ! Some en had carburetor a",
      "rating": 5.0,
      "verified": true,
      "author": "Shooter 60",
      "helpful_votes": 0,
      "publication_date": 20160528
    },
    {
      "title": "Great Product, Right Price",
      "text": "This is a great generic transmission filter kit and much more affordable than the OEM kit. It works great and has all of the parts necessary for a filter kit change.",
      "rating": 5.0,
      "verified": true,
      "author": "FunCouple",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "Five Stars",
      "text": "Every thing fit properly and the new gasket made reassembly much easier than using RTV",
      "rating": 5.0,
      "verified": true,
      "author": "Guy Isakson",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Wix Filters Just Do It Right.",
      "text": "Everything fit well no leaks, transmission works like it should. I am pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Himmelberger",
      "helpful_votes": 0,
      "publication_date": 20160930
    },
    {
      "title": "Does not fit 2004 Jeep liberty sport with 42RLE transmission as Amazon suggested.",
      "text": "Does not fit 2004 Jeep liberty sport 4x4 with 42RLE transmission as Amazon suggested. Gasket and filter do not fit.",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph Harris",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Great filter kit",
      "text": "Great filter kit. I didn't use their seal though, I used another brand that wasn't as flimsy (plus I already had it).",
      "rating": 5.0,
      "verified": true,
      "author": "LGray",
      "helpful_votes": 0,
      "publication_date": 20160216
    },
    {
      "title": "either been dropped or trying to get rid of damaged inventory as the packaging was excellent and prompt delivery",
      "text": "Fits well. Tho the canister filter arrived dented; either been dropped or trying to get rid of damaged inventory as the packaging was excellent and prompt delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "Armand",
      "helpful_votes": 0,
      "publication_date": 20150925
    },
    {
      "title": "Item did not arrive as advertised.",
      "text": "The cylindrical filter was not included in the delivery, only the flat filter and the seal.",
      "rating": 1.0,
      "verified": true,
      "author": "Raymond",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Didn't work... not sure if it was ...",
      "text": "Didn't work ... not sure if it was the short or tall filter.",
      "rating": 2.0,
      "verified": true,
      "author": "photog_64",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "like for like",
      "text": "Everything worked out - size was right for the job. Direct replacement, like for like.",
      "rating": 4.0,
      "verified": true,
      "author": "P Family",
      "helpful_votes": 0,
      "publication_date": 20150402
    },
    {
      "title": "Five Stars",
      "text": "04 Grand Cherokee, 4x4 with 545 rfe. Works as advertised. Both filters, gasket and seal included.",
      "rating": 5.0,
      "verified": true,
      "author": "Dizzle",
      "helpful_votes": 0,
      "publication_date": 20141018
    },
    {
      "title": "but it works and the rubber seal is great. NO LEAKS",
      "text": "It may be different than OEM, but it works and the rubber seal is great. NO LEAKS!",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Miller",
      "helpful_votes": 0,
      "publication_date": 20151110
    },
    {
      "title": "The filters are good but the gasket is garbage",
      "text": "The filters are good but the gasket is garbage. Do yourself a favor and order some RTV and do the job right.",
      "rating": 4.0,
      "verified": true,
      "author": "JLar",
      "helpful_votes": 0,
      "publication_date": 20150307
    },
    {
      "title": "Fit great",
      "text": "Worked great on my 2013 Ram 1500 4x4. Trans gasket was a nice touch and sealed perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "John B",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Good filter with everything you need",
      "text": "Everything you need minus fluid to do a professional filter change on a Chrysler RFE",
      "rating": 5.0,
      "verified": true,
      "author": "Reece",
      "helpful_votes": 0,
      "publication_date": 20151114
    },
    {
      "title": "Five Stars",
      "text": "Parts are of good quality and a very good price!",
      "rating": 5.0,
      "verified": true,
      "author": "Mikey",
      "helpful_votes": 0,
      "publication_date": 20150314
    },
    {
      "title": "05 dodge RAM 2500 4x4 hemi 545rfe",
      "text": "quality made wix filter set. looks almost identical to mopar. filters were made in different countries. will buy again. I didn't use the pan gasket, get some mopar rtv-atf its really good stuff. install the sump filter seal with a socket and hammer to tap into place. I also installed a jegs brand drain plug kit for much easier servicing in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake - Eagle Point, OR",
      "helpful_votes": 2,
      "publication_date": 20130331
    },
    {
      "title": "Five Stars",
      "text": "Perfect fit fo 05 Ram Hemi 4x4 QC. Nothing else to say. Works great!",
      "rating": 5.0,
      "verified": true,
      "author": "JP78",
      "helpful_votes": 0,
      "publication_date": 20150811
    },
    {
      "title": "Worked fine",
      "text": "Screw on filter says made in usa sump filter says china, but it all worked good. This kit saved me $15 from auto store",
      "rating": 4.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 0,
      "publication_date": 20130709
    },
    {
      "title": "Good kit, good fit",
      "text": "Good kit, good fit, no problems during install. Wish all the pieces were US made like they should have been. Hard to go wrong with WIX brand!",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Dawes",
      "helpful_votes": 0,
      "publication_date": 20150504
    },
    {
      "title": "Verify Your Gasket Size",
      "text": "I wish I would have verified my gasket before I pulled off my pan. The gasket supplied was half the size of the pan which meant I had to make a run into my local hardware store and buy another gasket for $20 when I had already purchased this for $45. Not very happy the gasket didn't fit. The filters seem to work but I won't be ordering this kit again.",
      "rating": 3.0,
      "verified": true,
      "author": "Mr. Anderson",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Quality product, Gasket did not leak,  I would buy again.",
      "text": "Quality product, Gasket did not leak. Eric O from South Main Auto Repair has an excellent Youtube video on how to install it called \"Dodge Dakota - Transmission Service - 45RFE & 545RFE\" I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris D",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "I would replace this seal with the new filters as the old one looked like it was no sealing well",
      "text": "The filters work so far. The seal that comes with the main filter is a pain to remove from the valve body. Had to cut the old seal out as there is little room. I would replace this seal with the new filters as the old one looked like it was no sealing well.",
      "rating": 5.0,
      "verified": true,
      "author": "Andréa B.",
      "helpful_votes": 0,
      "publication_date": 20160621
    },
    {
      "title": "great",
      "text": "great buy for the money much less than Amsoils same filter would buy again for sure easy to place order",
      "rating": 5.0,
      "verified": true,
      "author": "artschuerg",
      "helpful_votes": 0,
      "publication_date": 20121203
    },
    {
      "title": "Works with my '08 Ram 4X4 just fine. Not sure the quality via couldn't fine any ...",
      "text": "Works with my '08 Ram 4X4 just fine. Not sure the quality via couldn't fine any studies rating tranny filters.",
      "rating": 3.0,
      "verified": true,
      "author": "B19000",
      "helpful_votes": 0,
      "publication_date": 20151126
    },
    {
      "title": "Wix 58843 Transmission filter kit",
      "text": "I ordered this kit for my 04 Jeep Grand Cherokee and it was an excellent kit both filters went in smooth & easy and so far is working great.",
      "rating": 5.0,
      "verified": true,
      "author": "SG",
      "helpful_votes": 0,
      "publication_date": 20130401
    },
    {
      "title": "I wish the filters have been made in the USA",
      "text": "I wish the filters have been made in the USA",
      "rating": 3.0,
      "verified": true,
      "author": "Cindy J. Mobley",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "Rusted filter!",
      "text": "My filter just arrived and when I opened the package the spin on filter is completely covered in rust! I will be returning this product as I refuse to put rusty material inside my transmission. VERY Disappointed as WIX filters were always recommended to me in such high regard from the people that use them. Should've just went with the Mopar filters for a little more money.",
      "rating": 1.0,
      "verified": true,
      "author": "Frank A",
      "helpful_votes": 8,
      "publication_date": 20151022
    },
    {
      "title": "China Junk with WIX name!",
      "text": "Disappointed! Made in China! Should have bought O'Reilly's house brand tranny filter, it's Made in USA.",
      "rating": 2.0,
      "verified": true,
      "author": "Rooster Coggburn",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "Make sure you install the gasket oring onto the filter ...",
      "text": "Make sure you install the gasket oring onto the filter prior to installing into the valve body. Or else no bueno!",
      "rating": 5.0,
      "verified": true,
      "author": "Meglzach",
      "helpful_votes": 0,
      "publication_date": 20150923
    },
    {
      "title": "does not fit",
      "text": "this does not fit a 2006 ram 2500 with the 5.9 diesel like it says it will they need to",
      "rating": 1.0,
      "verified": true,
      "author": "jedidiah johnson",
      "helpful_votes": 2,
      "publication_date": 20130613
    },
    {
      "title": "One Star",
      "text": "Be careful and double check if item is correct. it said it would fit my husbands truck, but didnt.",
      "rating": 1.0,
      "verified": true,
      "author": "Miss Urista",
      "helpful_votes": 0,
      "publication_date": 20160811
    },
    {
      "title": "OEM vs This WIX = OEM Victory",
      "text": "Made in China in Mexico looks cheap. Normally I am a fan of Wix but this simply did not look like quality. I went to dealer and bought OEM and they look so much different. The OEM is made in USA which I prefer too. Sorry WIX I cannot force you to make a quality American part but I can choose a part that is. Personal preference but this part I suggest OEM.",
      "rating": 2.0,
      "verified": true,
      "author": "$miley",
      "helpful_votes": 4,
      "publication_date": 20140510
    },
    {
      "title": "cornholio",
      "text": "arrived on time and not damaged. sad to Made In Taiwan on Wix products as was the case for bit filters in this kit. Clearly the just a rebox. You can buy Taiwan made filters for less, with the WIX packaging or markup. Factory MOPAR next time.",
      "rating": 3.0,
      "verified": true,
      "author": "cornholio",
      "helpful_votes": 2,
      "publication_date": 20120706
    },
    {
      "title": "4X4 only, not 2WD part.",
      "text": "Wrong part for 2007 Dodge Ram Sport 2WD. This is for 4x4 only.",
      "rating": 1.0,
      "verified": true,
      "author": "Dano",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "I was tricked to believe that this could work with ...",
      "text": "I was tricked to believe that this could work with my 2005 Jeep Liberty. Unfortunately it did not work. I will never patronize the seller again.",
      "rating": 1.0,
      "verified": true,
      "author": "Sunday Opadijo",
      "helpful_votes": 0,
      "publication_date": 20150713
    },
    {
      "title": "One Star",
      "text": "Parts were an exact match and installed without any problems.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161120
    }
  ],
  "product_meta": {
    "title": "WIX Filters - 58843 Automatic Transmission Filter, Pack of 1",
    "description": "Automatic Transmission Filter",
    "rating": 4.5,
    "feature_bullets": [
      "Capacity(grams) (g) : 0.00",
      "Class : A",
      "Duty Type : LD",
      "FlowRate (GPM) : 8-10 GPM",
      "Height (in) : 4.010"
    ],
    "specifications": {
      "Manufacturer": "Wix",
      "Brand": "Wix",
      "Item Weight": "1.35 pounds",
      "Product Dimensions": "11.82 x 8.13 x 5.28 inches",
      "Item model number": "58843",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "58843",
      "OEM Part Number": "58843",
      "Position": "Left",
      "ASIN": "B000CLV3QW",
      "Customer Reviews": "4.5 out of 5 stars283 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#21,863 in Automotive",
      "Date First Available": "October 10, 2007"
    },
    "categories": [
      "Replacement Parts",
      "Transmission Filters & Accessories",
      "Filters",
      "Transmission Filters",
      "Automotive Parts & Accessories",
      "Automotive"
    ],
    "price": 28.58
  }
}