{
  "website_summaries": [
    {
      "verdict": "Innovative alternative to traditional crutches, but users should be in good overall condition. Those who want to return to normal routines during recovery would benefit most from this support device.",
      "pros": [
        "Provides a \"hands-free\" experience for users",
        "Ideal for lower leg or ankle injuries",
        "More stable on uneven ground than traditional crutches"
      ],
      "cons": [
        "Minimal cushion on knee pad and strapping",
        "Steep learning curve",
        "Not suitable for injuries at or above the knee"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Was hoping this would work. Did not work for me :(",
      "text": "Did not work for me. Gave it the dedicated time, but not for me! Made to look easy to walk in watching the video. Felt like I would fall and injure more than my injured leg. It puts a lot of strain in multiple places on the uninsured leg. Pushing a buggy, grocery cart, stroller etc. would be okay because you can stabilize yourself. I found it hard to walk around my home and we have clear space with hardwood floors. Hard to bend and pick things up. Hard to do laundry. Took a lot of energy just to do basic things. Crutches are not great. Maybe if this product were not so bulky it would possibly work.",
      "rating": 1.0,
      "verified": true,
      "author": "Heather P.",
      "helpful_votes": 47,
      "publication_date": 20150411
    },
    {
      "title": "Not useful for right after surgery.",
      "text": "Not at all the great solution it was touted to be. From the literature, I thought I'd be able to use this right after surgery to get around. Not so much. If your break is in any way related to a leg bone (even if it's right at the ankle joint), this device will put pressure on your break, and it will hurt. It might be a solution once the bone has knitted back together? I'm not sure. But it won't work right after the break or right after surgery.",
      "rating": 1.0,
      "verified": true,
      "author": "Crystal Cooper",
      "helpful_votes": 21,
      "publication_date": 20170228
    },
    {
      "title": "Terrifying",
      "text": "I followed ALL of their online videos and practiced walking with it inside the house for about 2 hours. But walking outside and trying navigate around cars,children, dogs, and even adults who are glued to their phones, i was absolutely unstable almost fell over about six times and even had a grandma with a walker moving faster then me. Now I still have my injuries but now I'm out quite a lot of money and I'm too terrified of falling to use this product. Not a happy customer.",
      "rating": 1.0,
      "verified": true,
      "author": "Gam3Gurl",
      "helpful_votes": 2,
      "publication_date": 20200909
    },
    {
      "title": "Better than traditional crutches. NOT FOR LOWER LEG INJURIES. However helpful for bk amputees.",
      "text": "Immediately upon receiving this i had to drill the rivets out and put bigger longer rivets in on the foot, it was about to fall off. I highly recommend the additional knee pad. This is my second Iwalk due to complications from an amputation. The vibram sole isnt even. It pushes your knee/hip inward, which is by design for some reason. It makes walking more uncomfortable when waking on hard surfaces. I would not recommend for lower leg injuries, the initial reason i bought it, as your injury will hang off the edge and get jarred around.",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin Wesson",
      "helpful_votes": 2,
      "publication_date": 20191205
    },
    {
      "title": "Works Okay - Beats Crutches or Knee Scooter - Not the Best Quality",
      "text": "It took a day or two for me to get used to maneuver on it but once I did, it worked great. But after a couple of weeks of use, the threads that lock the top thigh braces in place stripped. Now I can no longer keep the crutch aligned with my leg. The treads are made of plastic and are fine enough that they will easily strip if the thumb screws are not kept really tight. Overall, for $150 I expected better. My original review gave this 4 stars but I'm downgrading to 2 stars due to the thigh brackets.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael W. Curtis",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Excellent product!! Hands free!!",
      "text": "Bought this for my husband who had ankle surgery with no weight for 6 weeks. Between this and a knee scooter he is pretty self sufficient. Definitely have to take it slow and not rush, but the extra pad for cushioning and use the hand grip to help make sure it doesn’t drag. My husband was pretty fit before surgery which I think helped him pick it up quick. I would suggest practicing if you can before you need it to get the hang of it. He fell a few times when he first tried it because he was going to fast and reaching too far. Highly recommend this!!!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Moyer",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Life Changing",
      "text": "This thing saved my life. I am a bartender and when I broke my leg I had no idea how I would continue making money. Within 2 weeks after approval from my doctor I was back up and running. Slight learning curve at first. Highly advise making adjustments to the different straps and heights and finding the one that works best for you. Also putting something under the knee helps prop it up and your cast will not rub into the shin keeping you comfortable. I can not praise this device enough. Unlike a scooter you have use of your hands! Plus your friends will have endless pirate jokes for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Devin",
      "helpful_votes": 2,
      "publication_date": 20191113
    },
    {
      "title": "Close but comes with a couple of flaws.",
      "text": "Overall a good product. Couple of flaws. I haven't done an extensive walk on it yet so keep that in mind. Does free up your hands watch the videos. After initial setup you want to adjust it up one notch. Also if you are wearing a cam boot with an air valve it will cause a pressure point. I alleviated problem buy buying a second pad and cutting a hole where the air valve is. Not sure if I would use it for extensive walks but definitely give you freedom to do your normal stuff around the house.",
      "rating": 4.0,
      "verified": true,
      "author": "Joseph C.",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Want another surgery ? Buy this ! :(",
      "text": "I’m having surgery soon so I bought this ahead of time so I can practice with it and get used to it. As a result I have fallen three times and probably hurt myself more. When you fell trying to get used to this you will inevitably injure your knee very badly because you’re strapped in and can’t control your fall. I can’t imagine using this right after surgery the damage that I might cause would be devastating. I don’t understand all these good reviews because it’s quite honestly the most terrible thing I’ve ever purchased here at Amazon yet.",
      "rating": 1.0,
      "verified": true,
      "author": "GiGi",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "GREAT IDEA!!",
      "text": "I purchased this device 1 month prior to my ankle surgery. There are great instructional and Youtube videos available online. Assembly was easy. However, I was never completely confident that the iWalk was at the correct settings. I kept adjusting the platform height. It would have been nice to purchase at a local store, where there were trained personnel to instruct you in the proper assembly and usage. My gait felt and appeared awkward at times. I highly recommend practicing frequently prior to undergoing your surgery. After my surgery, it made getting around easier allowing the freedom to use my hands. It does take a lot of coordination in the beginning. This device is not for everyone.",
      "rating": 4.0,
      "verified": true,
      "author": "T. B. Koch",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Great for below knee injuries and amputees waiting on prosthetic leg",
      "text": "It's not a permanent solution but I've been screwed around on waiting on insurance approval after needing to have my leg amputated below my left knee. They are fighting a word or two over justification if a prosthetic limb is medically necessary SERIOUSLY GUYS. My last surgery was OVER 4 months ago. I feel like I'm closer to walking after changing to another prosthetic provider. Still jumping hoops for insurance while I'm on short term disability about to go long term disability and finish my education plan in March. Not sure how long PT will take and its difficult to sit and wait for medical release to return to my job or start my new IT career. TOUGH TIMES defined.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray Stanfield",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Great for houses with stairs.",
      "text": "I am not a klutz, but I broke my foot. I am athletic but I about killed myself on my 3 story house staircases with crutches. Then I became a pirate and stopped hating my life. Lol. I could carry an object up stairs and still hold the hand rail. Easy on and off so I actually was less frustrated. I'm long and thin and just added some padding to the shin underneath the one on it and it all worked out well. I was so glad. I hope I never have to use it again but it saved my sanity.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Returning-Awkward",
      "text": "The idea may be good in concept, and had hopes it would solve a mobility issue after surgery and allow me to return to work. However I had a difficult time with fit, stability and maneuvering safely. I met all the criteria for use, yet I just couldn't make it work satisfactorily even after watching the videos multiple times. I can't take a chance of a fall, and felt necessary to return. I think the foot needs to be larger, and the knee rest needs memory foam type of support.",
      "rating": 1.0,
      "verified": true,
      "author": "B-TX",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "This thing works and it’s amazing!!!",
      "text": "Wow!!! This thing is nothing short of remarkable. I was able to clean my house and not rely on my son to get me a glass of water. Got the hang of it in less than 1 minute. It has literally changed my life and it’s only day 2. I can take it off while sitting in the driver seat of my car, and put it right on the passenger side without any trouble. After you get used to the straps, it goes on and comes off very quickly (about as quick as it takes my son to put on his seatbelt, ha) beats crutches by 1000x. Thank you so much. Amazing product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "AJay",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Great product for moving around independently",
      "text": "I have been barely getting around with a boot on my right foot after surgery. Faced with 3 more weeks of mostly being sedentary, I ordered this and I am incredibly happy with it. I did not realize until I was moving around again what a difference it can make. Even if you are going to be unable to walk for a few weeks, this device is worth the cost to be able to do things for yourself. I took a photo in the same pose as the product ad, because I was feeling that excited about it.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Friesen",
      "helpful_votes": 4,
      "publication_date": 20180117
    },
    {
      "title": "Be sure your leg will go all the way up on the platform without rocking in a cast.",
      "text": "I would have loved it if my cast wasn’t all the way up to my knee and not level, therefore it wouldn’t lay flat in the cradle/platform. It would have worked great with a short boot cast so that my leg could go all the way up to the front and the straps would keep it tight. It is really a bummer that for 4 more weeks I have to use this knee walker, which is great but tough to get in and out of cars, up and down steps, right quarters etc etc.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Forrest",
      "helpful_votes": 2,
      "publication_date": 20191021
    },
    {
      "title": "Nightclub Worthy, definitely worth it",
      "text": "I can write a long review of how awesome this product is and how much it increased my mobility while I had a fractured ankle, or I can just show you this video of me dancing my ass off for about 3 hours at a nightclub wearing the iWalk",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos Guzman",
      "helpful_votes": 8,
      "publication_date": 20170409
    },
    {
      "title": "Excellent alternative to scooter for athletic user",
      "text": "Wife's bunion surgery. Actually didn't need it very long. Crutches would have worked OK, but they are annoying. If she had needed for several weeks, the learning curve would have been worth it. If you're comparing to the traditional \"scooter,\" this is 100% better. But, it needs good balance, hip strength, coordination and some athletic ability to take full advantage. For the generally active person, this would be way more useful than a scooter, for a prolonged period of non-weight-bearing. A little expensive, for all that. A little risky on stairs, cobbles, etc., but those would be non-negotiable with a scooter. Heavier than crutches. Straps are slightly tricky to adjust, but instructions and support are terrific.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael V.",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Disappointed, but hopeful...",
      "text": "I order this prior to going on a road trip with high hopes, regardless of the negative reviews, and was very disappointed. Some of the parts did not lined up properly so I was not able to put it together. Additionally the main component that is used to adjust the height was stuck in place and I was unable to move it. I am returning it to Amazon and I asked for a replacement in an effort to be fair and give it a second chance. If my replacement works well and delivers I’ll update my review, but right now it’s a one start.",
      "rating": 1.0,
      "verified": true,
      "author": "Ruth",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Vastly superior to traditional crutches",
      "text": "After injuring my leg, I first tried traditional crutches. They were painful, hard to use, and a nightmare for stairs. I had seen people using the iWalk before, so I decided to give it a go. This is a high quality product that has allowed me to keep living my life with my injury. The iWalk itself is very well put together. It is sturdy, and was surprisingly easy to set up. Both the printed instructions, and the instructional videos, are very detailed and well done. It does take a bit to learn how to use it, but once you do, you can walk pretty much normally.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew W Malicki",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Best Crutch EVER!!",
      "text": "Compared to crutches this contraption/peg leg ;) is AMAZING!!!! I broke my ankle 2 days ago and then nearly killed myself on standard crutches. My husband and i assembled it while arguing for 30 minutes and walahhh I’m walking again! I am barely 5’1 and didn’t see the height requirements but thank god the thing fits! It is a damn godsend to have my hands free. I can pick up my 2 year old and chase my little punk all over the house like usual! Sooooo grateful i purchased this!! MUST HAVE if you have a lower leg injury!!!",
      "rating": 5.0,
      "verified": true,
      "author": "MamaKay",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Not a miracle but much better than crutches",
      "text": "You won't be walking miles in this if you are in a cast because the pressure shoves your cast into your shin. But it works well to keep you independent. helpful in getting around the house and fixing dinner or going up stairs. You won't be kick boxing in it unless your getting paid. I would buy it again but it's not perfect. The knee strap is very important but also very uncomfortable and painful. On long outings I use the scooter, which is not perfect, but around the house and to get the mail and such this crutch is a great help.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Item is horrible,",
      "text": "I never write reviews but this product is so terrible so I fig I write one. I’ll make short. Don’t buy this product. It’s crap! Waste of money and time. You can’t walk with it unless holding on to it bc the straps suck. You can’t walk short or long distances. It’s not about balance just poor design and plastic and steel parts. Left foot is in a cast. I’ll stick to my knee scooter and crutches. Someone should come out with another style and cheaper. By all means, don’t even try it. If I can give negative stars I would. Returning as soon as possible.",
      "rating": 1.0,
      "verified": true,
      "author": "John P.",
      "helpful_votes": 2,
      "publication_date": 20200226
    },
    {
      "title": "Worth Every Penny!",
      "text": "The skinny... Takes about 20 minutes to get use to. Descending stairs / hills / declines can be pretty challenging. Instantly gave me my life back. I walked graduation, went to a wedding, go shopping etc. with this thing on and its great. Draw backs. Your knee starts to hurt after a while. Make sure to take breaks. Its not just the padding, its because your weight is now bearing on a joint never intended to sustain wait in that way. The riveted pin that holds the foot onto the shaft, after 2 weeks, has began to have play. I believe that this rivet should have been reinforced with self locking nuts. Otherwise it works like a charm!",
      "rating": 4.0,
      "verified": true,
      "author": "Laurie I. Shenkman",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Coordination",
      "text": "I purchased this device for my wife, who recently fractured her foot and had been having difficulty using crutches. The iWalk is actually a very good device; however, it is only as good as the user. After fitting the device to my wife's leg, we quickly realized that a certain amount of coordination is required in order to safely and effectively use it. She had difficulty maintaining her balance when using the device and as a result, we decided not to run the risk of another injury. It is a very good product but older patients may experience difficulty if they are challenged with balance issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Duane",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Kills your knee",
      "text": "I waited to write a review for this product just so I could give it a chance. I wouldn't recommend it. The first day of using it was great! BUT, everyday after that my knee hurt like crazy because there isn't enough padding. It hurt more than my broken foot! Plus, the drilled holes where you can adjust are very sharp as it cut me pretty bad. I'd recommend a scooter instead.",
      "rating": 1.0,
      "verified": true,
      "author": "brit25us",
      "helpful_votes": 3,
      "publication_date": 20180417
    },
    {
      "title": "Great alternative to traditional crutches",
      "text": "This will give you freedom to use your hands again. I hated the traditional crutches hurting my hands and arms and then the crutches falling all over the place. I have only used this once outside the home and felt a bit uneasy because I wasn't used to it. It's amazing for home use though! If you meet the parameters, I would say try it out and see if it works for you. There is some time needed to get the right adjustments and to get the hang of it but it's worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sabrina K",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Great alternative to crutches",
      "text": "I got this for my boyfriend when he broke his heel. He was on crutches but found he was too restricted and it was hard to carry anything. With the “peg leg” as we called it, he was able to help carry in groceries, had a lot more flexibility in where he could go. The only issue he ran into was pain on his knee because of the pressure of “walking” on it. There was no good way to pad it without it feeling unstable. But overall, it was great for him. He stopped using crutches altogether once he got this.",
      "rating": 5.0,
      "verified": true,
      "author": "Angie",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "This is very helpful but you still need to be careful",
      "text": "I am currently using this product while in recovery from foot surgery. You definitely need to purchase the foam knee pad! That being said, it is great for trips away from the house as well as things like cooking, where the handlebars and basket of a knee scooter get in the way. I would not use it for long distances, or if your dog tends to pull on the leash, as it is easy to get knocked off balance. I use it to go up stairs but not down. Practice for a few days if you have the opportunity as it makes the transition easier. Definitely recommend - it has helped me tremendously!",
      "rating": 4.0,
      "verified": true,
      "author": "TM",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "gave me my Mobility back how long while recovering from surgery",
      "text": "Amazing device True Life Saver I hate crutches and I could never use a scooter this is allowed me to walk again while I was recovering from my surgery. Quick word of caution the padding they have is not good enough so you may need to put a towel underneath where your needs are at does bang up your knees a little bit as you walked and I do recommend you walk slowly because the tread on the bottom can skid a little and that's not a good feeling sometimes also be careful when you're walking down stairs",
      "rating": 5.0,
      "verified": true,
      "author": "daniel kozhebrodsky",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "We are HUGE fans of the iWALKFree!",
      "text": "Our daughter used the original iWalkFree for almost 3 years while struggling with RSD / CRPS in her left foot. The iWalkFree restored her independence during her critical high school years. No terrain could stop her - stairs, escalators, grass, hiking trails, even the National Mall in Washington, DC! We just ordered version 2.0 for my husband's 10-week non-weightbearing recovery from First MTP Joint Fusion surgery. His balance isn't so great and he struggled with the original model. HOWEVER, this updated 2.0 model he took to like a fish to water! See for yourself...",
      "rating": 5.0,
      "verified": true,
      "author": "TheNewDaysDawn",
      "helpful_votes": 17,
      "publication_date": 20150417
    },
    {
      "title": "Hands free, walk free in few minutes!",
      "text": "Easy to assemble, easy to use. I was able to walk and move around the house without crutches. It’s a tad weight though, I hope you could come up with a lighter invention. Straps are secure place however, going in and out of the car and bathroom might be a challenge to unbuckle the straps. Otherwise, I am happy I invested on investing money in buying this product, I was able to walk in matter of minutes without using uncomfortable crutches that bruised my armpits.",
      "rating": 4.0,
      "verified": true,
      "author": "Nikki Firefly ",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "GAME CHANGER",
      "text": "Absolutely incredible. A complete game changer!!! I have 2 young kids, and using crutches with my broken foot made me useless. I could not even bring them a plate of food without crawling everywhere (which starts getting depressing quick) I finally purchased this 2 weeks in to my healing journey. Give yourself a week to learn how to adjust because your balance will be off. But after that he thing is awesome. Brilliant invention! GET IT!",
      "rating": 5.0,
      "verified": true,
      "author": "justin",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Gamechanger",
      "text": "This crutch has been a life saver! I feel like I got my life back because normal crutches and the scooter were not long term helpful solutions (I have an injury that is 6 weeks non weight bearing for recovery). We took the time to make sure it was fitted properly, which everyone needs to do. I’m mostly very stable and am able to carry things and take part in normal activities like fixing myself a cup of coffee. I’m still slow moving and need help with uneven terrains, but it gets easier to use every single day. Definitely go down stairs backwards!",
      "rating": 5.0,
      "verified": true,
      "author": "SLT",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Amazing!",
      "text": "I am four weeks post op for bunion surgery, with many more weeks non weight bearing ahead of me, and this device is a recovery game changer for me. I live in a small tri-level home where I need to do the stairs several times a day, and this device has made them much easier to navigate than crutches. It also gives me freedom to care for myself hands free in a way that crutches will not allow. I've gotten so good at this, that I'm in it in about 20 seconds, and out in 10. The inventor of this device is pure genius.",
      "rating": 5.0,
      "verified": true,
      "author": "Greyhound",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "It works, but step carefully.",
      "text": "Straps are a bit cumbersome, but necessary. I love that it leaves my hands free. The only issue I've had is there occasionally the \"toe\" of the foot pad will get caught on the walking surface. Very nearly fallen several times. You have to consciously lift the device when stepping forward with it.",
      "rating": 5.0,
      "verified": true,
      "author": "y westy",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "I’m am 100% satisfied and highly recommend the iwalk2",
      "text": "I’m am 100% satisfied and highly recommend the iwalk2.0. We had a trip planned to Hawaii 2 and 1/2 weeks after I broke my leg and I was only able to go because of the iwalk. I could go anywhere my group went including stairs, slopes, hills and even onto the beach! We also live on a farm and I can do chores and yard work. I wouldn’t have been able to do or enjoy any of this on crutches.",
      "rating": 5.0,
      "verified": true,
      "author": "CG",
      "helpful_votes": 3,
      "publication_date": 20180326
    },
    {
      "title": "Appears to be great",
      "text": "This seems like an outstanding alternative to crutches but I didn’t even try it because I read the warnings about balance and I didn’t think I would be able to use it successfully. So this is not a true review, but an endorsement based on other reviews and testimonials. It did seem a bit complicated to fit and as I live alone, I wasn’t sure I could manage getting it on properly without help. That said, I’m stuck in a non weight bearing short leg cast for another five weeks and if I think my good leg is strong enough in the near future, I’ll give these a shot, and update these comments.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Kaplan",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Not appropriate for anyone in which a fall could cause further injury.",
      "text": "Very unsteady and very difficult to balance. Rocking action goes side to side as well as front to back. I have very good coordination and did not feel safe at all with this device.",
      "rating": 1.0,
      "verified": true,
      "author": "Paula Campbell",
      "helpful_votes": 2,
      "publication_date": 20200611
    },
    {
      "title": "Just needed some BLING and a bit of padding",
      "text": "It was black, but that wasn’t extra enough for me, so I bedazzled it. Took some trial and error to get the fit right, but this thing is a life saver and totally worth it! I was able to return to work two weeks early and do my job as a nurse without difficulty. The back-of-knee strap needs to be TIGHT in order to walk on comfortably for any length of time, but the provided padding is not appropriate for this, as it causes significant chaffing. I solved this problem by replacing it with a child’s seatbelt pillow (2nd pic) and had no issues after that!",
      "rating": 5.0,
      "verified": true,
      "author": "Nurse CW",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Love the idea, hate the product",
      "text": "This thing is so uncomfortable. Makes your shins sore and bruised up if you don’t add your own layers of padding. Shock absorption is virtually non-existent and It makes my hip hurt from the awkward weight. My knee felt like it was going to divorce me from the discomfort. I see this as a last resort if other options don’t work. Highly DO NOT recommend it and I’m definitely asking for a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "Kez",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Would not recommend, for safety reasons.",
      "text": "This hands-free crutch \"catches\" on rugs, also would not be NOT safe on stairs in my opinion. I purchased this well before a scheduled therapy. Physically and mentally fit, I wanted to become comfortable using this product. The upper leg strap is too thin, therefore does not help to stabilize the upper thigh, the \"foot\" of the crutch was too small to provide a solid and stable foundation. I thought the concept was good, but I fell several times practicing. Unfortunately, as I ordered this in advance, the time period to return it had elapsed, and so I was unable to return the item.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20160514
    },
    {
      "title": "Difficult to use.  Safer to use a walking boot.",
      "text": "I tried it a few times but found it difficult to use so I returned to using the walking boot. Can't return it or sell it so it was a waste of $150.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Brockway",
      "helpful_votes": 2,
      "publication_date": 20200212
    },
    {
      "title": "Hands free!",
      "text": "Love the fact I can use my hands while walking. You need to be careful and lift before taking a step. Regardless, these beats crutches hands down (no pun intended). [Update 6/15] A week into using it daily, the knee padding is starting to deform. If you wear shorts you will notice the pad gets wet due to sweating. You may want to place a small towel to mitigate it. [Update 7/15] product held up pretty well considering I'm 200 lbs. Two complains: 1) squeaky noise from the \"shoe\" pad is annoying and 2) the height setting need another notch for finer adjustment.",
      "rating": 5.0,
      "verified": true,
      "author": "Vito",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Fell flat on my face!",
      "text": "This device did not work for me. I followed all the tests that were suggested prior to purchasing, and I thought I would be a good candidate. I was highly motivated to regain my mobility! However, when I first tried it on, it proved to be so unstable I fell flat on my face. Fortunately, I did not break my shoulders as I attempted to brake my fall using my arms and hands. Would not recommend to seniors. It may give you more problems than solve them. I eventually returned it.",
      "rating": 2.0,
      "verified": true,
      "author": "Madam X",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Challenging to use at my age!",
      "text": "I liked the option to have a portable device to work in small places & use when out & about. However, I could not easily put the device on when I arrived at a business after struggling at home to get it on to practice. I finally gave up after struggling at home & out & about with balance issues & difficulties putting it on. Great concept but just not for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Happy Consumer",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Amazingly easy to assemble and learned to iWalk in 3 minutes",
      "text": "Amazingly easy to assemble and learned to iWalk in 3 minutes. You need to make slight adjustments as you go for maximum performance and comfort. I added a layer of soft kitchen towel on the padding for extra comfort. No more crutches as I ditched the thing as soon as I got out of the hospital. I can cook, do my house chores, walk down to the local market(people were praising the iWalk as I shopped) and play with my cats in the backyard :) One afternoon I was walking out of my parking lot a kid said, \"That is sooo cool!\" Thank you iWalk! Talk of the town :)",
      "rating": 5.0,
      "verified": true,
      "author": "Tadashi K.",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Great Buy",
      "text": "This was for a friend and it was easy to adjust to fit her and easy to learn how to use it. If you have a broken foot or BK amputation, this would be so much better than crutches or a wheelchair. For videos on how to use it, go to YouTube and enter 'i walk 2.0' in the search bar. You'll find several good tutorials on set-up and use.",
      "rating": 5.0,
      "verified": true,
      "author": "Frankie1429",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "The BEST alternative for a farmer or homesteader!!!",
      "text": "I just received mine today at work. Used one crutch for stability for about 200 or so steps. After that and several tweaks (my leg bows below the knee), it was PERFECT! Still getting used to it because I just have a foot/ankle injury and am not used to walking on a 'stilt' or prosthetic type device. I will definitely say it's PERFECT for tiny/small house configurations and the only time I slipped was on pine straw. I even had a chestnut husk stuck on the bottom for a few minutes and only noticed a minor difference in stability. Steps without rails or high grasses are tricky unless you really trust it. Overall, thumbs and toes up!",
      "rating": 5.0,
      "verified": true,
      "author": "pfamily",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Have to use additionion padding for knee pressure while in a full cast or full boot.",
      "text": "Straps started to come loose off the Walker after several weeks. This has been a great piece for mobility especially around the house. It's great.",
      "rating": 5.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 2,
      "publication_date": 20191121
    },
    {
      "title": "Hard to adjust",
      "text": "This just did not work for me. I fit the requirements so it's not the fault of the device but I couldn't not adjust it to my weird R leg (kind of throws to the right from the hip). When I got it to where it would fit my thigh, the outside of my knee jutted into the bar which I had to wrap with fleece. Plus I just kept tripping and couldn't maintain an even gait. I can truly see the potential for many people and I tried several times over 2 weeks and couldn't make it work for me.",
      "rating": 3.0,
      "verified": true,
      "author": "karen",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Great for Independence",
      "text": "I broke my heel bone and cannot put any weight on my foot during this heeling process. Crutches are very uncomfortable and a knee scooters does help but can be a pain to transport when wanting to leave the house. The Iwalk is great when a person wants to keep their Independence while trying to recover. You still have the use of boths hands and can continue with every day life. Like going to the store or still interacting with your kids. The Iwalk can be uncomfortable at time but it just takes some adjusting and getting use to. I've been using the Iwalk for about 2 months now and still have a few weeks to go.",
      "rating": 5.0,
      "verified": true,
      "author": "klarissa",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Cushioning not so great. But totally worth getting!",
      "text": "Broke my ankle in several places. Unfortunately surgery can't be done until the swelling goes down. Got this to help me get through a very busy physical schedule. It's wonderful! Took about ten minutes to put together. Took another 10 minutes to get the hang of it. My kitchen is on the lower level of my home so I was thrilled to be able to go down the stairs, and cook my family dinner for the first time in a week. Only complaint, the cushion simply isn't enough. Bruised my shin pretty good. Other than the cushioning.... This is a game changer for sure! Love it!",
      "rating": 4.0,
      "verified": true,
      "author": "Renee Davis",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Absolute life saver!",
      "text": "Love this. So much better than crutches or knee scooter. Can go up and down stairs and keeps your hands free. Knee strap could have a better pad behind the knee. Straps tend to get loose over time so you need to readjust periodically. If you have a hard cast that stops below the knee, I suggest sliding a knee pad onto your knee to account for the gap. My cast dug into my knee and created a sore. Still a great product. I get compliments all the time even from doctors and physical therapists. Takes a little time to get used to walking in it, but not bad.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Was not for me",
      "text": "I tried this crutch to see if I would use it. I have an Aircast on my right foot for a fractured metatarsal. I tried it enough to learn to walk in it. I ultimately decided that for the limited walking, I could hobble in my Aircast boot well enough to get around. I also worried that a trip or fall could damage my foot. The iWalk knee crutch may be a good solution for someone with a different injury than mine. I keep it in the car in case I have an emergency and need to walk a long distance.",
      "rating": 3.0,
      "verified": true,
      "author": "iamscotticus",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Get rid of that crutch!",
      "text": "After severing my Achilles I was on my hands and knees and then crutches. Crutches seem so archaic and unsafe after you have used the iwalk2 for a week. The iwalk allowed me to walk my dog, go to the store, mow my yard, go up escalators and everything else I could only imitate with crutches. Be careful while learning to go up or down stairs, I recommend you use stairs with hand rails. I improved on the basic iwalk by adding a Husky gel stabilizer knee pad. The iwalk held up to several months of use and is in my attic. It seems part of me and I can't let it go.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Porter",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Hands free but careful with your knee.",
      "text": "I like that you are hands free and can get much more done than with crutches. I wish that the area where your knee goes, was more padded because I started to develop a pressure sore from my knee rubbing against the device. But overall I love “I Walk” because without it I could not have been as mobile as I am. I’m glad I ordered “I walk”. I have to use a knee pad when I use device to lessen the pressure and irritation to my knee.",
      "rating": 4.0,
      "verified": true,
      "author": "Sherlove82",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Use with Caution",
      "text": "I bought one, tried it out and sent it back. I had ankle surgery and desperately wanted to remain as able-bodied as possible while recovering so I did my research and bought one of these prior to my surgery. My wife helped me put it on, saw me try to walk in and told me to send it back. After she went in the other room I tried it again; certain I could do it. I almost fell and instantly knew how bad that could've been if I already had my surgery. I sent it back and caution anyone considering one of these.",
      "rating": 2.0,
      "verified": true,
      "author": "Gene Bates",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Easy enough to wear to a party on my first day wearing it.",
      "text": "Disclaimer: I’m lightweight, and did yoga before I was hurt. That said, I found this very easy to use. I was able to go to an outdoor park event on my first day wearing it, walking a couple hundred yards on pavement, also through muddy grass, and even brick paths. In the house it has been equally suitable. I have spiral staircases and it is possible to go up by shorting the foot. Though to go down I just take it off. It was also easy to assemble and fit to my size following the instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Miklovic",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "I can't use it - but I love it! The instructions were great (watch the video)",
      "text": "I can't use it - but I love it! The instructions were great (watch the video). I passed the quiz (over 5'x, under 6'x, less than x pounds, equal to \"questionable age\", able to take steps without use of handrail - however, I just wasn't coordinated(?) enough or strong enough (?). Not sure what it was exactly but I just didn't feel safe. Why the 5 stars? Because they did their due diligence to make sure it would work for me, if I were just a little younger/more in shape, it probably would have been a God send! Don't let my failure prevent you from trying.",
      "rating": 5.0,
      "verified": true,
      "author": "Imladyred",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Staying mobile during my recovery was paramount. Only the iWalk2.0 can give you that.",
      "text": "What an awesome alternative to traditional crutches. Easy to assemble and adjust to your height. I’m 6’4” and it easily meets my parameters. It took about 5-10 minutes to get the hang of walking with my “peg leg” but now it’s second nature. The vibram sole works great in the wet and snow in Montana. Word to the wise and traverse down stairs backwards I found that to be the safest so you aren’t over extending your steps and keeps your balance centered.",
      "rating": 5.0,
      "verified": true,
      "author": "Zulu Wookie",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Nice but has drawbacks.",
      "text": "I love the concept and it has worked for me except for the fact that it does not do real well on carpet unless you are super slow and don’t let the rubber foot get caught on it. I’ve fallen on my foot three times due to being off balance. It doesn’t do well if you are sitting and need to get up quickly because it takes so long to strap on and tighten. It’s good for steps and gives you some independence. My legs get tired quickly. Would not be a good option for an elderly person.",
      "rating": 4.0,
      "verified": true,
      "author": "Carol Ward",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "This is a great product!",
      "text": "I have a broken 5th metetarsal and am non weight baring for 6 weeks.. Crutches were very limiting for me and caused lots of pain in my hands and arms. I do use a knee scooter but this too is clunky and limiting. I tried the iwalk and was very impressed from the beginning. It took me several days get use to it but now I am really enjoying the freedom that It has provided me. I can. walk my dog, mow the lawn and get around much better then when I was limited to crutches. I would recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Hark",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Being solo this allowed me to shop independently",
      "text": "Loved having hands free allowed me to use stairs, go to the store. My first partial cast was very uncomfortable with this as the pressure from this on my shin was unbareable. Subsequent complete casts worked well. Only warning is be prepared to go downstairs backward if you dont have railings on both sides of stairs. Using at 60+ yrs old.",
      "rating": 4.0,
      "verified": true,
      "author": "lrs",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "A must-have for foot injuries!",
      "text": "I broke my ankle and couldn't put weight on it for 6 weeks. The iWALK2.0 brought me from barely mobile to being able to walk around the house, even cook. Being hands-free allowed me a range of mobility I didn't think possible. This should be standard-issue for foot injuries. It's easy-on, easy-off, and the \"foot\" tread seems incapable of slipping, so much so that you have to make sure to lift it fully when walking so it doesn't trip you by not sliding forward as you might with your foot. Stairs are doable, if not necessarily easy. The iWALK2.0 is a life-changer, and made the 6 weeks bearable.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Helm",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "It works OK but is very overpriced",
      "text": "The biggest complaint I have about this device is the price. It does serve as a useful crutch for one legged lower leg injuries, but it is vastly overpriced. Wearing it more than two or three hours a day will produce bruising on the shin and knee without proper padding. On the positive side, it does function as advertised.",
      "rating": 4.0,
      "verified": true,
      "author": "Doug Wilson",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Pain discomfort bruising and loss of skin",
      "text": "I like the hands free aspect of the device as it allowed me to walk my dog and hold my child as advertised. I’m not enjoying the pain and discomfort due to lack of padding on the knee. After a few hours of use following the instructions making sure the fit was correct I noticed the area below my knee cap (patella tendon) had become bruised and I lost a significant amount of hair and skin. I feel that this is an easy fix perhaps a gel layer or something soft. Otherwise a solid five star. Will update when I’m done using the device in a few months. (Fractured toe)",
      "rating": 3.0,
      "verified": true,
      "author": "Benjamin Zamora",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Game Changer",
      "text": "When I broke my ankle this was a game changer for getting around - especially up and down stairs. I was having issues using crutches as they hurt my armpits, but with this baby I was cruisin' Highly recommend if needed. Do your research on it and see if it's right for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremiah Wessling",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Iwalk 2.0, The best purchase of my life",
      "text": "I love the freedom I gained when I got the iwalk. This is the best alternative to crutches (which did not work for me) or a scooter, that can't go everywhere. I worried that I would not be able to have the correct balance to safely use it, but it only took 2 days of watching videos and practice, I was then free to leave the house, independently get in and out of my vehicle and return to a more normal life. I am 54 yes and 150 lbs I highly recommend the iwalk for lower leg and foot injuries",
      "rating": 5.0,
      "verified": true,
      "author": "Crazy Dave",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Good product.",
      "text": "Worked as expected. A little tactile is all it takes. No sitting really once it is strapped on. Your leg can’t straighten at all from the knee down because it is sticking behind you. Sitting sideways on a bench might be possible. If you fall, it is impossible to get u without unstrapping, which is difficult once you have fallen.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn I.",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Take your time to learn how to use this -wonderful- thing!",
      "text": "This is a life-saver! Although, the very first time I used it, I almost broke my good ankle. I thought -when I read the reviews- how hard can it be to use this thing? But, I was definitely being over-confident. It does take some time getting used to and learning how to use this thing, without killing yourself in the process. I'm certain when I was younger, I would have learned how to sprint with this thing attached to my leg...not at my age, sadly. Just be patient, be cautious, and once you get the hang of it, you'll be cooking, doing laundry, going to work, grocery shopping, etc., without a problem! Good luck!",
      "rating": 5.0,
      "verified": true,
      "author": "ACHA",
      "helpful_votes": 0,
      "publication_date": 20170201
    },
    {
      "title": "I could not make it work for me",
      "text": "Foot surgery, cast on right leg. I have pretty good balance and met all the criteria, but could not easily manage it even once prior to my surgery. My sister used one after getting T-boned by someone running a redlight and breaking her leg and arm. If you can't use crutches and practice with it, it might be a good solution. Otherwise, good quality. I am returning the unused product and hopefully will not experience any issues with the return. They claim to have no hassle returns.",
      "rating": 4.0,
      "verified": true,
      "author": "DrNATx",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Great product but not for everyone",
      "text": "This is probably the only 5 star review I will be returning. The product works as advertised and I highly recommend it. I have had 7 knee surgeries. This is very hard on my knee and will not work long term 'for me', but I can see where this will work for people that meet the requirements! Watch the video and pay attention to the instructions before you buy. This is a top quality product in all areas, but it just didn't work for me.",
      "rating": 5.0,
      "verified": true,
      "author": "DB",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Good in theory",
      "text": "Even after a good amount of practice with the iWalk it caused fatigue pretty quickly. It grips so well that it caused me to stumble and almost fall a bunch of times while walking on pavement. It is good for when you’re just standing and you can use the crutch to lean in with your hands. And although I had it strapped on firmly it still managed to move around enough to give me a huge blister that is now a scar.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Great product if you're on long term crutches.",
      "text": "I'm very surprised with this product. Didn't believe it would take over the crutches, but it performs so well that crutches don't get used as much. It is not the best for stairs without railings or stepping over things, but for getting around the house or just plain standing, it's amazing. Removes most of the foot fatigue that I was getting balancing on one foot. A definite recommendation!",
      "rating": 5.0,
      "verified": true,
      "author": "mouscacha",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Up and going in no time!",
      "text": "My husband broke his foot and had to keep weight off of it for 6 weeks. Unfortunately, even with me working 2 jobs, we couldn’t afford to go that long with him being out of work that long. He is a bread vendor and needs his hands to push bread racks through the store. He was able to go back to work with no problems and was able learn to walk on it within 5 mins. After reading advice from other reviews, he put a sock around the strap around the back of the knee to avoid blistering. All in all, he loves it. And he can take the trash out again so I love it too!",
      "rating": 5.0,
      "verified": true,
      "author": "kelli etler",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Life Saver",
      "text": "Crutches tore me up! I was praying and searching for an answer. In comes the iWalk! Love this thing! There's still some pain in my knee and shin from using it, but it's so much better than crutches!!!! It takes a few days to get used to walking in it, but once you do your world opens back up! Can't recommend this product more highly to add some mobility to your recovery!",
      "rating": 5.0,
      "verified": true,
      "author": "bought it",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Life saver!",
      "text": "Overall, engineering of this product is solid and materials are sturdy. Very easy to assemble out of the box. ONE improvement I would make is the strap latches. Currently require you to extend beyond maximum tension, which makes it difficult to get in and out of. Would be nice if it had a quick release/lock system (like seatbelts). Otherwise, wonderful product. So much better than regular crutches.",
      "rating": 4.0,
      "verified": true,
      "author": "Erik Szabo",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Absolutley Necessary for Stairs",
      "text": "I had foot surgery with zero weight on my left leg for six weeks. This device is the only one that allowed me to make it up and downstairs. The reason it's not a 5 stars is that I never felt stable with it on. My physical therapist suggested using it with a walker, and that worked. The point is that I couldn't use it like on the videos, but it did work and was the only way to go up and down stairs. PS. I did have someone with me when attempting the stairs for stability and to make sure I didn't fall. Highly recommend if you have to navigate stairs.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Best single way to get around with a lower leg injury",
      "text": "I was unable to out weight on my foot for 5 weeks because of an Achilles rupture. The iwalk helped a lot in getting around from just doing things around the house to walking a bit more distance once I got comfortable. I also have a knee scooter that was lent to me, but relied on the iwalk most of the time. It does take a little time to get used to walking longer distances. I am a pretty athletic person so may have adapted faster than some others would.",
      "rating": 5.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Looks like you'll be able to do everything it says with a little practice",
      "text": "This product loolks like it could do everything it says it could.Was a little difficult putting together even with the video but was done. I had to return it because it turned out that I really wasn't going to need it.That my foot was healing better and faster and stronger than thought. If I end up needing it I will definitely buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Unstable in use",
      "text": "I was unable to obtain a stable stationary position or a gait that didn't scare me if I was not in reach of a surface to cling to. It's also very awkward to sit without removing the crutch. I would recommend a major redesign of the product. I am in the process of returning the item I ordered.",
      "rating": 3.0,
      "verified": true,
      "author": "DR Dan",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Life changer",
      "text": "I absolutely loved it compared to crutches or a scooter. It's best to get a week or two a head of surgery just so you are used to it. If I could make one add on I would add a collapsible leg underneath just for balance support when putting on. I was able to go up and down stairs hills and bumpy areas no problem. My advice watch YouTube videos for helpful tips.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond Macgregor",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Game Changer for anyone who is in a boot!",
      "text": "It took my husband some time to get used it to it but once he got the hang of it, look out world. He was back at his gardening and golfing. This iWalk 2.0 was easy to setup. There are only a few cons, the padding wore down quickly so we bought knee scooter pad as suggested by another user and modified it and fit it over the existing pad. Which added another expense. And if not tighten in the right spot around your leg, the straps can dig into your leg. Other than that this was a game changer in my husbands mobility!",
      "rating": 5.0,
      "verified": true,
      "author": "JPCap",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Just buy it.9",
      "text": "Made being no weight bearing on my foot for 10 weeks with children to take care of almost bearable. I don’t think I could have done it with out this device. It does give you a bit of a peg leg walk, which kind of makes your back need some tlc too. If you are going to be off your leg/ foot/ ankle for an extended time this is what you need.",
      "rating": 4.0,
      "verified": true,
      "author": "LAM",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Amazing freedom!",
      "text": "Vital that you follow ALL directions and understand it is very tight especially around the knee. But this is alot better than pain from crutches! Most of all, hands free walking! I am mobile again! This was vital for me as I'm non weight bearing for 10 weeks minimum following surgery. The carts wouldnt work because of stairs and crutches hurt and bruise my armpits. The iwalk is the answer! I just wish my insurance would pay for it! I absolutely love this! It has changed my life during recovery!",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Better than crutches",
      "text": "It is nice for getting around, and being able to use your hands! Huge improvement over standard crutches. However, even with two pads, my knee still tends to hurt, and I have to tighten the straps to an uncomfortable point to keep it from slipping while trying to move around. The bottom pod, while fairly big, could be improved also, perhaps even something more shoe-like, or that would allow a shoe to be fitted on it. Still, a good purchase that I recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Slone",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Bionic Leg",
      "text": "This is a cool idea. I purchased this before my achilles surgery to test it out. I was able to walk in it fine, seemed sturdy enough. I felt like the straps dug into my leg and could tell it would not be comfortable for anything more than puttering around the house or store. Im returning it because in the end it seems like having to strap in and out of this thing whenever i wanted to stand or sit would be annoying. If I need to be on my feet all day with my hands free, id probably consider keeping, its less obtrusive than a scooter.",
      "rating": 3.0,
      "verified": true,
      "author": "robbie",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Awesome",
      "text": "It is a bit tricky to use, but once you get the hang of it, it's great. I do recommend using a cane until you are comfortable walking to avoid falling. But I live the freedom I get and wl have for the next 3 months. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "kim duchac",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Nice product, but",
      "text": "My wife is under 100 lb. and just tall enough to fit in the size specs. However, a balance issue from a previous injury -- minor and unnoticeable in day-to-day movement -- was magnified enough while using the product (and wearing a heavy post-surgical boot) that she couldn't use it with confidence. That said, the sturdy, thoughtful design of this product in impressive and we're sorry she couldn't use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Some Customer",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Get a scooter instead!!",
      "text": "Honestly, don’t waste your money. I bought a scooter from kneerover.com, and it’s been a savior (broken tibia that’s been surgically repaired ORIF). While I had high hopes for this, it’s very awkward. I’m pretty athletic and even after reading the instructions, when trying to walk normal it would catch (and almost throw me on my face!). I’ve stuck to the kneerover and hoping on one foot when necessary. I regret the purchase and wouldn’t do it again. Appreciate the effort tho. Thanks",
      "rating": 3.0,
      "verified": true,
      "author": "CANDICE R. BOOTHE",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Better than crutches, for sure",
      "text": "I wasn't sure how great this was until, a week after my surgery, I decided to try some crutches. This is so much better! It's especially good for steps and stairs which are treacherous with crutches and impossible with a knee scooter. There are only two drawbacks for me: It takes a moment to \"buckle up,\" so a knee scooter is much better for quick trips around the house to the fridge, bathroom, wherever. The shelf definitely needs more padding. I have a few abrasions after a week from the flatness & hardenss of the pad. I put a folded up, black bar towel under my knee and it's fine again. Tip: You can't strap this on too tightly!",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20160618
    },
    {
      "title": "Not for me.",
      "text": "I tried very hard for a week to use this product and could not get used to it. I felt it was very unstable and I almost fell several times. I used the company's help service which was very good to make sure that I had it fitted properly, but I still could not see myself going anywhere with it. I was very concerned that I would injure myself further. As they say in their ad, it'snot for everyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim Fraser",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "EXCELLENT product!",
      "text": "Wouldn't trade this product for the world. I broke my ankle over the holidays (2016), then had a plate/screws installed . Following surgery I was able to start using this in a couple of days. My orthopedic surgeon actually recommended it as he had been on one a few weeks prior. We bought it even before I had surgery. Maybe I'm smarter than the average bear, but it only took me about 10 minutes to assemble and fit. I'm 5' 9\" & about 155# so your mileage may vary... I would've been driven insane had I not been able to get up, move around and do things.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Mason",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "Instant Mobility. Highly Recommend!",
      "text": "I ruptured my Achilles on 7/22, had surgery on 7/27 and had my iWalk by 7/28. This device is amazing. I have crutches, a wheel chair, a knee scooter and this device and it's easily my favorite mode of transportation. If you are reasonably athletic, the balancing takes 2-3 mins to learn and then you're off. You can't run or walk super fast without fear of falling but you get instant mobility. I'm able to do dishes, help with some yard work, and general tasks around the house. The price point is a little high considering half the device is plastic but overall, I highly recommend to anyone who can't bear weight on a bum ankle.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160801
    },
    {
      "title": "Not for someone like me.",
      "text": "I have some balance issues and they are dramatically increased with the use of the iWalk. Honestly, the problem is not with the product itself. It is well built and supports my weight well. I fell several times in the first few attempts and my balance only improved a little bit. I added the use of a cane for my opposite hand and held on to the handle of the iWalk with the hand on the side of the crutch. At least I quit falling but hands-free it was not.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Works great when mastered but you can't dance with it!",
      "text": "My wife has been using the iWalk for two months. She was skeptical as first but after mastering the iWalk, she uses it solely to go up and down stairs and while standing to put on make up. Much better than crutches...but you have to pay attention to how you go up and down the stairs. There's a process and it works. As far as dancing or walking the dog, I can't see anyone walking with this with any confidence to dance or walk the dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Miguel B.",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "I can be mobile again",
      "text": "Makes getting around easier when you are in tight spaces. It does take a bit to get use to. Lighter than I expected. If you need to be mobile in tight spaces it’s much easier than crutches or a scooter. More work than a scooter but let effort than crutches. Great buy if you have an injury below the knee. Add a pad to the iWalk 2.0 because the one it comes with is small and will hurt after a time.",
      "rating": 5.0,
      "verified": true,
      "author": "A.Castillo",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "GAME CHANGER",
      "text": "Omg! This was a GAME CHANGER!!! I would have had to hire in home care if I hadn’t found this miracle contraption. I had surgery on a ruptured Achilles’ tendon so for 6 weeks this was my saving grace. I was nervous and wobbly at first but i was out and about in NO time!! Everyone who saw it thought it was the greatest invention ever. I have to agree. It made getting to work do-able as well as getting up and down the stairs in my home. If you’re deciding between this and a scooter, get an iwalk- no brained.",
      "rating": 5.0,
      "verified": true,
      "author": "Bekah",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Best crutch ever",
      "text": "This is the best crutch ever. The ability to use your hands while ambling around is taken for granted...until you're using traditional crutches. Within a day of using my crutches my palms were sore. iWalk to the rescue. Out of the box to my knee in about 10 minutes and walking immediately after. Had a couple of overconfident moments when the sticky Vibram sole caught on the hardwood but other than that, it's great. 4 stars only because the padding, as others have said, appears insufficient for prolonged use. Am shopping for some gel foam or something to stick under my knee.",
      "rating": 4.0,
      "verified": true,
      "author": "Jen Fang",
      "helpful_votes": 0,
      "publication_date": 20170331
    }
  ],
  "product_meta": {
    "title": "iWALK2.0 Hands Free Knee Crutch - Alternative for Crutches and Knee Scooters - by iWALKFree",
    "rating": 3.9,
    "feature_bullets": [
      "CAN YOU USE IWALK2.0? – Let’s find out! BEFORE YOU BUY, scroll down to the PRODUCT DESCRIPTION section and read ALL QUALIFICATIONS of our hands free crutch.",
      "WILL IT FIT? AGE LIMITS? PLUS SIZE? - Read the PRODUCT DESCRIPTION section for all knee crutch requirements BEFORE you buy.",
      "BETTER THAN CRUTCHES OR KNEE SCOOTERS – Safe, stable, hands free / pain free mobility. Why use crutches for walking when you can iWALK instead?",
      "READ THE ENTIRE LISTING – iWALK2.0 works for most healthy adults and children between 4’10” and 6’6”. See ALL requirements in the PRODUCT DESCRIPTION section below.",
      "SO MANY BENEFITS – Scroll down to PRODUCT INFORMATION section to see all the BENEFITS of iWALK2.0 hands free crutches."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "16.3 x 5.5 x 8 inches; 4.5 Pounds",
      "Item model number": "iWALK2.0",
      "Date First Available": "May 2, 2004",
      "Manufacturer": "iWALKFree, Inc.",
      "ASIN": "B00092RB06",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Canes, Crutches & Accessories",
      "Medical Supplies & Equipment",
      "Mobility & Daily Living Aids",
      "Crutches",
      "Mobility Aids & Equipment",
      "Health & Household",
      "Health, Household & Baby Care"
    ],
    "price": 149.0
  }
}