{
  "website_summaries": [
    {
      "verdict": "Nice price for incredibly tough boots that cover the ankle.",
      "pros": [
        "Stretchable materials in the upper portion of the boots ensure a comfortable fit",
        "Keep feet dry in all conditions and all types of weather",
        "Reinforced materials in toe and heel to provide long-lasting performance"
      ],
      "cons": [
        "Made for more than just protection from rain, so they cost a bit more"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Very breathable and easily wearable to work if that's why you got them ...",
      "text": "There wasn't a picture of the boots actually on someone so with the boots including rubber heel, it's about a foot long from bottom of boot to the top. Very breathable and easily wearable to work if that's why you got them like me.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah Adams",
      "helpful_votes": 27,
      "publication_date": 20171027
    },
    {
      "title": "Love these boots. Second purchase to replace the first that had 15 years of good service",
      "text": "I had a pair of these for 15 years and they finally fell apart, one of them that is. I was very tough on these. Left them outdoors on a porch so they always were going through all kinds of weather. I used them for barn chores, cutting up dead trees and our land is quite mucking. I bought a pair for the wife and she loves them as well. They are tough as nails and soft as a babies blanket. Now I have a second pair and fell in love with them all over again. You will be happy with them.",
      "rating": 5.0,
      "verified": true,
      "author": "J. frost",
      "helpful_votes": 2,
      "publication_date": 20180214
    },
    {
      "title": "Great Pair of Boots That's Worth the Price",
      "text": "I've had many pairs of cheap \"muck\" boots that slap you in the shins while walking and are too stiff to walk comfortably. These Muck Boots are soft, flexible, easy to get on and off, and well-insulated against the cold. I bought a pair that's a bit big for my feet, thinking they might be tight, so I think I'll buy a size down next time, Good thing my son is a growing boy and can already fit them! They are definitely comfy and roomy!",
      "rating": 5.0,
      "verified": true,
      "author": "Marqueta",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "My last pair lasted three years with daily wear.",
      "text": "There is a wide range of prices for basically the same mid-calf Muck Boot. This is a unisex version and is a generous sizing. This is ok with me because I wear it for function not style. This pair replaces some that are several years old and worn every day . I’ve been pleased with them enough to re-order. The mid-calf height is easier to stuff my jeans into than a higher boot.",
      "rating": 5.0,
      "verified": true,
      "author": "slowreader",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Excellent Chore Boots",
      "text": "Wore out my old ones so it was time for new! I wear these every morning in the winter as I do my outdoor chores. Wouldn't want to be without them. Love the tread on the bottom. Rugged enough to keep my feet from slipping. And I like how I can just step into them and get them off of my feet without the use of my hands, which are usually carrying something.",
      "rating": 5.0,
      "verified": true,
      "author": "Loves good books",
      "helpful_votes": 4,
      "publication_date": 20170802
    },
    {
      "title": "SUPER---BUY MUCK",
      "text": "You ain't got a boot until you BUY MUCK.... OMG I am IN LOVE!! Well winter is ending and I am sorry to waive good by to my MUCK's. THEY ARE SO SO Comfortable, the step is awesome, the insulation NO MANUFACTURER COMPARES----I would wear them in the house to keep my feet warm they are that WARM, LIGHT, Great for WALKS... STYLISH way COOL... LOVE YOU MUCK",
      "rating": 5.0,
      "verified": true,
      "author": "AKS",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "These are good old fashioned MuckBoots",
      "text": "These are good old fashioned MuckBoots. There isn't a whole lot more to say on this really, they do the job, keep your feet dry. I like wearing mine with a heavy hiking / boot type sock and they are uber comfortable for all day wear. Keep in mind in warmer weather your feet may get a bit hot, but nothing too extreme.",
      "rating": 5.0,
      "verified": true,
      "author": "Crookedsky",
      "helpful_votes": 3,
      "publication_date": 20170914
    },
    {
      "title": "Keeps your feet warm and dry",
      "text": "I ordered this pair to replace the ones I lost on the way to deer camp last fall. Pair these boots up with a thick pair of wool socks and your feet will not get cold. I wish I'd had these boots when I was an infantryman serving during winter months in places like Colorado, Germany and Kosovo. Also these boots are decent for short hikes and fit well on people with short, fat legs like me.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Epps",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "9 months of light use and now they leak",
      "text": "I didn't even get a full year of use out of these. My second pair to leak on me. There are better brands out there.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20190121
    },
    {
      "title": "Quality doesnt seem sufficent- returned",
      "text": "Boots fit well and are comfortable, only issue I have had it the quality doesn't seem to be there as my first pair leaked water. I was sent a replacement pair but these also have a small pin hole somewhere and my sock gets damp. The trademark labels are falling off an the neoprene upper seems to be defective as a small piece let go. I've only used these a hand full of times with the intent to keep my feet dry and these failed the test twice. Maybe I just have bad luck but I really wanted to like these boots.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Best waterproof I’ve ever had",
      "text": "I put my custom arch supports in them and put them on, they felt great. Went outside to do some weed eating in my ditch where grass was about 18 inches high and ground was real muddy because of rain, they , the boots performed awesomely and they were super comfortable, I couldn’t ask for a more comfortable or a better performing waterproof boot. Thanks a million Muck.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Davenport",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "3rd Pair",
      "text": "Third pair, wore others out. I wear a full size larger so my orthotics fit inside. I have large calves and this (not tall) style fits with room. Good boot, a little stiff for tractor or SBS/UTV pedals when new. My only gripe is not enough heel stub or groove to easily remove using the other boot.",
      "rating": 4.0,
      "verified": true,
      "author": "OZ",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Husband loves these boots!",
      "text": "Husband loves these boots! Fits true to size. Perfect for working in the yard and even kept his feet warm during a recent snowstorm when he walked a mile to the grocery store in over 8\" of snow. The interior is really soft and supportive. Super easy to clean; hose off and they're good as new. A little pricey, but well worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 3,
      "publication_date": 20170124
    },
    {
      "title": "Great boot",
      "text": "They are a little big but comfortable. These seem to be more in line with a guys foot than a woman’s but I still find them a good fit. I have a pair of women’s mucks that come high on the calf but they fit my leg too tightly. These have a much looser fit through the calf and don’t come up the leg as far which is why I bought them. Great tread on them, better for walking in the mud and snow than my other mucks. Only drawback about these boots is they are a little heavy.",
      "rating": 4.0,
      "verified": true,
      "author": "acowger",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Very comfortable and waterproof",
      "text": "Tried on a 10 and it was a little loose so I ordered a 9. Fits good once on. A little tight getting them on. Taking them off is a little bit of a task. I have only worn them 3 times so maybe they will become easier on and off once they are broken in",
      "rating": 5.0,
      "verified": true,
      "author": "DAVID A.",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "didn't think it all the way through",
      "text": "These boots were for my son and they fit marvelously; however, his use is for in a commercial kitchen where a non-slip sole is critically necessary. So I sent them back and went with a different manufacturer. But my mom also owns a pair of Mucks that she praises highly, so it wasn't the product we were unsatisfied with, it was the performance on wet surfaces.",
      "rating": 2.0,
      "verified": true,
      "author": "Laura in Texas",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "There is a lot of extra room in the front of the boots but a good pair of inserts help take care of that problem",
      "text": "I wear a 10.5 inch shoe and got the size 11 pair. There is a lot of extra room in the front of the boots but a good pair of inserts help take care of that problem. Other than the sizing issue, these have been perfect. They are extremely comfortable and are easy to take care of and maintain for what I need them for. If I ever bought another pair though, I'd try to find a style that has half-sizes or just cram into a smaller size.",
      "rating": 4.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20170320
    },
    {
      "title": "Fit true to size, all day comfort",
      "text": "Im pleasantly surprised at the fit and quality of these boots. A lot of reviews have talked about the sizing of MuckBoots being too big. I did not find that to be the case. I normally wear a size 11 shoe and had to choose between 10 and 11 since there was no half size available. I went with the 11 and it fits just like I expected. I live in a generally warm climate and did not want the heavy insulation in some of the boots from MuckBoots and these fit the bill. Good, all day comfort, good size and good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Green",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Knock off",
      "text": "To me, this is probably a knock off brand. I've been wearing muck boots for years, and it usually last a year or so. But this one maybe 1 month. I work on the farm, and I wear these boots every day for 6 hours each day. This one started to leak, the emblem came off. I've bought 3 sets and all 3 of them having the issue. Next time I'll buy it from Muck boot site, not from here, even it cost a little more.",
      "rating": 2.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "I'd buy these again any day. They are my FAVORITE boot.",
      "text": "I was hoping to be able to write a review because I LOVE these boots. They are sturdy and big and make me feel confident no matter what. The second day I wore them it was DOWNPOURING and I was sent to pick a paddock so we're talking soggy horse poop, hay and mud EVERYWHERE. But these boots performed perfectly. My feet stayed warm and dry. The height is ideal because you can move in them quite easily. They are a little heavy but not bad, personally I like the weight. They come off easily and fit with socks and without socks. I usually wear an 8-8.5 so I purchased a size 9 after reading other reviews. No regrets.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz Shafer",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "good but not super great",
      "text": "The bottom & sole of the boot are great. the height of the boot is way too high. OK, if outside for hours doing work, probably great. Way too high up the leg for short walk with dog. would be better if it had same sole, but shorter length and didn't go up leg so high. very well constructed.",
      "rating": 3.0,
      "verified": true,
      "author": "Boston suburban dweller",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Happy feet",
      "text": "I love these boots! I’ve been eyeing them sitting in my cart for over a year. Was skeptical because of the high price tag but finally bit the bullet after repairing my rubber boots for the umpteenth time. Boy am I glad I did. Again, I love these boots",
      "rating": 5.0,
      "verified": true,
      "author": "steve miner",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "I had to return the item and could not get an exchange for the correct size and it would have been a great deal if I was able to",
      "text": "Boots ran too large. Had I known in advance I would have purchased the smaller size so I would be able to take advantage of the sale price. I had to return the item and could not get an exchange for the correct size and it would have been a great deal if I was able to get the right size.",
      "rating": 1.0,
      "verified": true,
      "author": "Big John",
      "helpful_votes": 3,
      "publication_date": 20170706
    },
    {
      "title": "Great tread",
      "text": "My wife uses these boots at our horse barn. Her other pair of muck boots, and her other boots, have nearly smooth bottoms, probably so that they won't get clogged with muck. However, we live on a hillside, this is West Virginia after all, and it can be quite slippery when wet or frozen. Six weeks ago, she slipped, fell, and broke her ankle, and I have been saddled with horse care since then (only two more weeks to go). Anyway, we purchased these boots with deep tread in the hopes of avoiding a repeat of her misadventure. They are great. Sure, they get stuff in the cleats, but they provide the needed traction in snow on mud.",
      "rating": 5.0,
      "verified": true,
      "author": "Gus",
      "helpful_votes": 0,
      "publication_date": 20131226
    },
    {
      "title": "Excellent Blend of a Traditional Work Boot and a Muck Boot",
      "text": "Great mix of a traditional Muck Boot and a work boot. The sole has fantastic traction and the boot offers excellent water proof capability. A little shorter than my Field Blazer IIs but perfect for wearing at work on rainy days.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Save your money",
      "text": "Junk they started leaking after one month of wear to feed animals.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura Weldon",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Great Boots for work!",
      "text": "Love these boots! I can wear wool socks and they don’t feel to tight and I can wear regular socks and they don’t feel to big. Great fit and great boots for wearing in mud",
      "rating": 5.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Good boots, not a great fit",
      "text": "Good boots, not a great fit. Muck has whole-size sizing. The last pair I had the size bigger, and my heel moved around enough to ruin them in a couple years (no favors to my heel). The size smaller, I have now, Feel like they're too short. If you're wearing heavy socks, go big.",
      "rating": 4.0,
      "verified": true,
      "author": "Simon S",
      "helpful_votes": 2,
      "publication_date": 20170613
    },
    {
      "title": "Top of boots is too small.",
      "text": "The shoe part of the boot fits well but the top of the boots is too small for my calf. It is cutting into my legs. I’m going to have to cut the top of the boots to loosen them up because I threw away the box to send them back. My first pair of muck boots were good fitting but the soles did not last long. So I got the work boot style and they are too small",
      "rating": 1.0,
      "verified": true,
      "author": "Robert Jackson",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Wish they would last longer",
      "text": "I like Muckboots but I seem to fall between sizes so they are a bit big. My biggest gripe is that they only last me one year and then split in the crease on top of the toes that is formed when I walk. I have been through several pair in the last 8 years and it happens every year even though they are kept inside the house of out sun and cold.",
      "rating": 3.0,
      "verified": true,
      "author": "Pisgah Allen",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "The insoles are substandard and label not properly affixed.",
      "text": "I have purchased Muck brand boots in the past and was very pleased. This boot is not typical of their levels of quality. The insole slips from the first use. It is flimsy and super thin. You will definitely need to purchase an aftermarket insole to wear these boots. Additionally, one of the Muck labels has come halfway off. I would be ok if I thought I could get it all the way off without damaging the boot. It disappoints me every time I put them on. I wish I had chosen another Muck boot. I am considering switching to a different brand for future needs.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Comfortable Boot",
      "text": "Most comfortable rubber boats I’ve ever had, had them a couple weeks and no leaks I’ve detected although I’m mainly just mud on a construction site. The elastic type upper makes them quick and easy to slip on as I switch to my regular work boots when I get to the truck, I would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "therealdeal",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "... vacation to Yellowstone in the winter and they were comfortable with anywhere from 1 to 3 layers of socks",
      "text": "I took these on vacation to Yellowstone in the winter and they were comfortable with anywhere from 1 to 3 layers of socks. I hiked in the snow and in small puddles of water - no leaks and they kept my feet very warm and were very comfortable to walk in for hours at a time.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Worth every penny",
      "text": "My husband is a big and tall guy and always had problems finding mud boots that would fit over his calf. We have a mini-farm in rural Western Washington and so far he has just lived these! They fit well, are super comfortable and hold up to our cold and rainy fall weather.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika Jackson",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Comfortable and dependable boots",
      "text": "Just bought 2nd pair of these chore boots. The first pair lasted five years of farming. These are go-to boots for wet winter weather. Very comfortable and easy to get on without socks. If wearing socks use a boot horn and they go on fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Miss P",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Comfortable enough to wear all day.",
      "text": "These boots are great if you have to work anywhere your feet may get wet. Sure you could spend a fraction of the price on rubber boots at walmart but these are comfortable enough to wear all day! My wife had a pair for years and always raved about them and after wearing mine a few times now I can see why! Should have bought them a long time ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel P.",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Nice boots, low quality decal on boots??",
      "text": "Nice boots, but not impressed that after first use the decal on the sides \"muck\" came off! Seems cheap. Why would it come off??",
      "rating": 4.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Fit great! Can wear all day",
      "text": "These boots fit very well. I put my Superfeet insoles in and I can wear all day comfortably. These are my second pair of Muck Chores.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellen",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Comfortable",
      "text": "Great wear. We have two styles, the ankle boots and calf high. However, they are not resistant to a rooster. One peck and put a whole through it on side of foot. Just wanted to make sure you put in description that they are not animal resistant.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Water seeping in after less than 2 months.",
      "text": "Water seeping in after less than 2 months. Been wearing these boots since September, now in the first week of November there's a hole between the sole and foot of the boot that's letting water in.",
      "rating": 1.0,
      "verified": true,
      "author": "artemis",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Absolutely love these boots!!",
      "text": "Very comfortable, I want to wear even off the garden and around town. Waterproof, thick and sturdy but not heavy! have used it on top of sharp surfaces, nails, sharp rocks, one of the best boots I have ever bought for use. I want another one...",
      "rating": 5.0,
      "verified": true,
      "author": "D. Williams",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "Perfect if you have fat feet and big calves",
      "text": "The muck chore classic boot is the only one from the Muck brand that has ever fit my feet and calves comfortably. Nice and comfortable I can wear them all day long with no issues",
      "rating": 5.0,
      "verified": true,
      "author": "suroos2011",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "durable & comfortable w/o being too heavy",
      "text": "Wow...durable & comfortable w/o being too heavy. I haven't been through winter on our little farm yet. New to farm life, I've used rubber rain boots & easily messed up two pairs in two years. So hopefully these will hold up.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Morazan",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "Good insulated boots!",
      "text": "They weren't as comfortable as I thought they should have been for the price but overall they are a good boot especially if you work in extreme cold temps, they will keep your feet warm...",
      "rating": 5.0,
      "verified": true,
      "author": "Clay",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Keeps poop out",
      "text": "So i work with horses and these boots are amazing. I am literally in the thick of it and these boots keep my feet out of it and dry. Only wish they offered in wide sizes. I am a size 14 but as wide as the mississippi river. But overall they do what they are made to do. Keeping my feet out of poop",
      "rating": 5.0,
      "verified": true,
      "author": "Domingo",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "My go to boot.",
      "text": "This seems to be the best Muck boot for my feet. Comfortable and durable. I recently ordered some of their other models and they are sized differently. This boot is nice and wide for my foot and easy to get in and out of. Still comfortable during the wet spring months here in East TX. Did over 10 miles in one day in them out in tall wet pasture fixing fence and my feet were not even sore.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Cope",
      "helpful_votes": 2,
      "publication_date": 20151207
    },
    {
      "title": "Not as good as I hoped over a short period of time",
      "text": "I have to change my review. At first the boots were great. Good fit. But only 3 months in and the inside heel area has worn away. I expected a lot more from these boots. My last pair of Mucks lasted 3 years.",
      "rating": 2.0,
      "verified": true,
      "author": "TANIA P.",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Broke and leaks in the seam",
      "text": "My first pair of Muck Boots were great and lasted over 5 years. I bought a pair for my husband for Christmas and they got a crack and leak in the seam that bends when you walk, in right over a year of use (however not every day). Not waterproof any more..... Very disappointing!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Anna Hornsby",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Puncture",
      "text": "Only had for 3 days working in a wooded area and noticed a very small twig punctured the upper neoprene just above where the rubber ends. There the goes the waterproof feature. For the price I would think the boot should be able to stand up more abuse than working around little twigs. I bought the Chore boots because I thought they would stand up to more rugged wear. Disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Comfortable boots",
      "text": "I purchased this boots for my father in law. The minute he tried it on, he fell in love with it! According to him, it is a very comfortable boots. Way to go MUCK!",
      "rating": 5.0,
      "verified": true,
      "author": "Waihe'e 808",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Great boots",
      "text": "These boots are PERFECT. I wear them every day and am glad i bought them. They're warm, dry, and hold up well. I bought them \"on sale\" at $75 though and they were well worth the money. When mine wear out i WILL be buying another pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Olm W.",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "I love these things.",
      "text": "Easy on and off, warm as toast and are tough! I wear them year around as a quick slip-on for chores in muddy conditions, and they are my go-to for outdoor activities in cold weather.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul E. Fox",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Sturdy",
      "text": "I gave these as a gift. They seemed like sturdy, heavy duty, well made boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen M",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Chores done",
      "text": "I use these in a busy dish room and they keep my feet from getting soaked. Still need to switch out socks, since my feet sweat, but I blame all the running around. Would suggest to my staff",
      "rating": 5.0,
      "verified": true,
      "author": "Cedric McLeod",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Comfortable, quality mud boots.",
      "text": "Bought these for the hubs after a few pairs of cheap ones. He loves them and wishes I had bought them first. His words: “Most comfortable mud boots I’ve ever worn. They’re not hard like the other ones.”",
      "rating": 5.0,
      "verified": true,
      "author": "nursemedlin",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Great boot for outside winter work!",
      "text": "Husband works as a landscaper & does snow removal. These worked great, & kept his feet dry. Also were comfortable. Does keep your feet warm as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "They already leak",
      "text": "I haven’t even had these for 2 months and the left one leaks!!! I should have bought a cheap boot since I was going to get cheap quality. Wo t buy again 😩",
      "rating": 1.0,
      "verified": true,
      "author": "C Fisher",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Bad idea to buy footwear on line...",
      "text": "Feels larger than my size, sort of a “moon boot” feeling, unusually wide...",
      "rating": 4.0,
      "verified": true,
      "author": "danext",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Great for daily use",
      "text": "Use these boots daily with yard work. They do not get hot during summer like other rubber boots.",
      "rating": 5.0,
      "verified": true,
      "author": "J Broker",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "As always these boots do their job as expected, ...",
      "text": "As always these boots do their job as expected, however they continue to be way over priced which is always disappointing. Supply and demand shouldn't mean you take advantage of people. I go thru a pair a season in my line of work, not a fan of the big price tag year after year.",
      "rating": 5.0,
      "verified": true,
      "author": "S. johnson",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "My 5th pair over the years. They will finally ...",
      "text": "My 5th pair over the years. They will finally crack on the tops at flex points, but that takes a year or two. I wear them exclusively all winter and with appropriate socks never gotten cold feet.",
      "rating": 5.0,
      "verified": true,
      "author": "CharlieK",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Excellent boots",
      "text": "High quality, Comfortable, excellent for working in garden or walking in woods Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "C. Hardway",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "A little large",
      "text": "But not soo large to send back. My only complaint is the shipping using Fedex Smartpost. This has got to be the worst shipping arrangements and if at all possible I will avoid any purchases from companies that use this. When you combine Fedex ground and USPS you have got problems. If shipping is either/or you are fairly safe and have decent service, but combine these two and no one wants to take responsibility for any problems/delays. Each blames the other. As far as the muckboot, love the boots.",
      "rating": 4.0,
      "verified": true,
      "author": "ksokie",
      "helpful_votes": 0,
      "publication_date": 20131225
    },
    {
      "title": "Buyer beware",
      "text": "I've worn these boots for years and always wear a Women's 9. This pair was HUGE, even too large for my wife who wears a Women's 10. After double and triple checking the size marked inside (yes, a Women's 9, Men's 8)they have to go back. And, I have to pay the cost of the return shipping. Not happy.",
      "rating": 2.0,
      "verified": true,
      "author": "Jerseymama",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "Great boots",
      "text": "These boots are nice quality and not too heavy. I wear an 11 in some brands and 12 in others. I bought an 11 and they fit well with plenty of room length and width wise. I have been wearing them in high 80s summer weather with no complaints. My feet sweat in sneakers. These boots are not hot nor make my feet hot. Which has impressed me the most.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20160705
    },
    {
      "title": "They leak",
      "text": "I bought two pairs over a five year span and they were great. This time I ordered a pair and both boots leak in the toes so I’m returning and getting another pair. If these leak too I’m gonna return them and buy them directly from muck. They could be knock offs. Idk",
      "rating": 2.0,
      "verified": true,
      "author": "Chris white",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Misleading product picture",
      "text": "Watch out, these are super short muck boots, not the ones that go up just short of the knee like the product picture shows. Should show short ones. Muck boots are great though, 5 stars from me, just wrong product picture if your looking for regular muck boot (who would even wears these muck boot sandals and why, lol?)",
      "rating": 1.0,
      "verified": true,
      "author": "Joel",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "warm and waterproof",
      "text": "29 yo son really likes these boots...super warm and wetproof!",
      "rating": 5.0,
      "verified": true,
      "author": "Carol T",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Worth the price! Why didn't I buy these sooner?!",
      "text": "I absolutely love these boots. I was tired of buying cheaply made boots and them falling apart. These are great for winter. My feet do not get cold and they are comfy. I normally wear 8.5 but purchased a 9. Gives me a little extra room if I want to wear thicker socks when going sledding. 😊 Sorry it took me so long to purchase my first pair! Worth the price!",
      "rating": 5.0,
      "verified": true,
      "author": "FallGirl",
      "helpful_votes": 0,
      "publication_date": 20150226
    },
    {
      "title": "Tough, great tread on the sole",
      "text": "Even though it's a little big, I know that once I put in a proper foot bed and good socks they will be very good. I have tall arches this model works well for me. Other models even though prettier were too tight at the arch point.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "to small on top",
      "text": "the top of the boot is to small for ankle/calf",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Tight fitting",
      "text": "I wear a 10 in almost any other shoe. This is the tightest boot I ever put on,I can't give you my opinion on how it performs because I can't wear it. They don't carry a 10.5 so I'm going to return them. If you cant wear this size don't bother ordering.",
      "rating": 2.0,
      "verified": true,
      "author": "angel",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "Too wide and uncomfortable!",
      "text": "These work boots had absolutely no arch support and were much too wide for my feet. I ordered this in a size 12 men's as I normally wear a 13 in women's boots. I needed a pair of comfortable work boots that I could depend on for good traction in ice, mud and snow while out in the fields with the horses. These boots do not meet my expectations or my needs and I am sending them back for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Candace L. Coates",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Disappointed",
      "text": "The emblem on the side of the boot fell off on both boots within 2 hours of wearing. Boots are probably a knock off of a real muck boot.",
      "rating": 1.0,
      "verified": true,
      "author": "Carolyn G.",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "mud boots",
      "text": "Appear to be a quality boot. Definitely, keeps the mud out.",
      "rating": 5.0,
      "verified": true,
      "author": "rustycorvair",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Very pleased.",
      "text": "Original Muck boots. Need I say more? Highly recommend due to weight, comfort, and easy to clean",
      "rating": 5.0,
      "verified": true,
      "author": "farmfletch",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Fits perfectly. No more, no less.",
      "text": "I have a pair of Craftsman Rubber Boots, and they're 8, but my normal size is 9 for all my others shoes. This one I bought number 9 and fits perfectly. Very pleased with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Miyata",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "One Star",
      "text": "Like wearing weights around your ankles. Heavy. Not for women.",
      "rating": 1.0,
      "verified": true,
      "author": "heather Sullivan",
      "helpful_votes": 2,
      "publication_date": 20180123
    },
    {
      "title": "awesome boots so far!",
      "text": "So far, I love these boots. They are comfortable, warm (but not hot), keep feet dry, good traction on snow and ice. My only complaint is that the finger loop to help put these on/off is actually located on the inside of the boot, which is odd... and doesn't work too well.",
      "rating": 5.0,
      "verified": true,
      "author": "MTC",
      "helpful_votes": 0,
      "publication_date": 20170204
    },
    {
      "title": "Love them !",
      "text": "My husband loves them and have worked excellent in the snow this year. Wide and Plenty of room is what he loves. Well made !",
      "rating": 5.0,
      "verified": true,
      "author": "The Shopper",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Muck boots Chore Classic",
      "text": "I love the boots, the structure is perfect it felt heavy on my feet but I got used to them. They’re awesome. I’m happy I brought them.",
      "rating": 5.0,
      "verified": true,
      "author": "CHEARYLEEN WILSON-SABIN",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Better than BOGS!",
      "text": "My city boy husband wanted a pair of REAL much boots fr when he needs to do farm chores. These are AMAZING boots. I like them even more than my very pricey BOGS brand boots. Lots of cushion, very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Mullendore",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Slippery slope",
      "text": "As a daily hiker, these fit the bill on the rainy mornings (and snow) as the outer sole has good cleating for slippery slopes.",
      "rating": 5.0,
      "verified": true,
      "author": "ira smith",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "Consistent",
      "text": "I am not sure how many of these my husband has over the years. They always fit well and do the job they are supposed to.",
      "rating": 5.0,
      "verified": true,
      "author": "Margo",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Best muck boots you can buy",
      "text": "Around the farm you need muck boots. These are the best I've found, so I keep coming back to them.",
      "rating": 5.0,
      "verified": true,
      "author": "Sigogglin",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Comfortable all day",
      "text": "Love these boots. I can comfortably work in them all day in various terrain. I had to stand in the river to setup my pump and my feet stayed dry. I normally where a size 11 1/2 - 12 so I bought size 12. They are a little big but not enough to send back. I try and wear thick socks with the boots.",
      "rating": 5.0,
      "verified": true,
      "author": "JandG",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "They Don't Live Up to Their Reputation",
      "text": "They started falling apart after a few months. I bought a cheap $20 pair of boots that lasted longer. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Vincent",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Outstanding standing 10 hrs",
      "text": "Perfect height , comfortable , even worn 10 hrs in a manhole",
      "rating": 5.0,
      "verified": true,
      "author": "jennifer philly",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "plenty of room for a men's 9 1/2 wide foot",
      "text": "I wear men's 9 1/2 wide shoes so I was concerned with ordering men's size 9 boot. I was surprised that I had so much room in the toe wearing a cotton athletic type of sock. By coincidence, I had recently purchased a pair of UGG shoes which came with an extra set of wool insoles. I tucked the wool insole into the Muckboot and the fit was perfect- just the right amount of wriggle room. I wore them in the house for a couple of hours and my feet were warm but not sweaty. I have confidence that I'll be fine all day in the rain.",
      "rating": 5.0,
      "verified": true,
      "author": "Ammyh",
      "helpful_votes": 0,
      "publication_date": 20151104
    },
    {
      "title": "Good quality",
      "text": "I have a pair of the ladies boots and my husband wanted a pair. So I bought them for him. He loves them. They fit perfect and keep his feet warm and dry. Would recommend both the men’s and ladies.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Womens 8.5/9",
      "text": "I really like these boots. They are exceptionally warm! I usually wear a womens 8.5-9 so I ordered a mens 7 (which is what I usually order when I convert to mens). The chart said to order an 8 but I thought it would be too big for me. If ordering again I would probably size up and order a mens 8 so that I could have a little more room. They are not so uncomfortable that I would send them back though.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn S Kroenke",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "... to get on and off and says these are perfect.",
      "text": "Purchased for my husband who reports that he \"loves these boots\" He also has a pair of the knee high ones and found them too difficult to get on and off and says these are perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Markstrom",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Fit as expected",
      "text": "Being a winter boot there’s definitely enough extra room in the boot for doubling up socks. Great boot.",
      "rating": 5.0,
      "verified": true,
      "author": "rhodes",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "The sizes have changed",
      "text": "I checked the size on my old pair and ordered a new pair of the same brand. They seemed to be a different circumfirence to receive my feet and thick ankles. They went back. I paid the shipping. Ups picked up",
      "rating": 1.0,
      "verified": true,
      "author": "Robert G.",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Run big",
      "text": "I have two other pairs of Muck boots, same size, but they both fit tighter. These boots are nice but run big. I wear a 10.5 and got an 11 like my others. I should have got a 10.",
      "rating": 4.0,
      "verified": true,
      "author": "Gerard DeModena",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "The brand was requested by my son.",
      "text": "Beautiful boots. Sturdy and nice looking. My son likes nice things and he researches everything. For him to pick these boots they had to be perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "fran tiso",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Warm and comfy",
      "text": "As expected these boots exceeded my expectations. So warm and comfy even on the coldest days",
      "rating": 5.0,
      "verified": true,
      "author": "CR",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "love these boots",
      "text": "I have owned a pair of these boots for three years and they are the best ever. I use them in the barn then hose them off and wear them wherever. I would recommend them highly. I bought a pair for my husband and he also loves them. They are very warm and your feet never get cold or wet. I would recommend that if you wear a half size say a 8 1/2 to go to an 8.",
      "rating": 5.0,
      "verified": true,
      "author": "Gail Hawkins",
      "helpful_votes": 0,
      "publication_date": 20141227
    },
    {
      "title": "Comfort",
      "text": "They fit great. Got them for school because i know i would be in them for longer periods of time. Very comfortable even wearing for 3 hours compared to my other $30 cheap rubber boots that hurt my feet after 30 minutes in them. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Hennessee",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Good waterproof boots",
      "text": "Great boot for the winter, but will make feet sweat on the summer",
      "rating": 5.0,
      "verified": true,
      "author": "landtechjoey",
      "helpful_votes": 0,
      "publication_date": 20200119
    }
  ],
  "product_meta": {
    "title": "Muck Boot Chore Classic Men's Rubber Work Boot",
    "description": "Ideal for landscaping and other general outdoor work, these Muck Chore Classic Men's Rubber Work Boots keep feet dry and comfortable all day long. The 5 mm neoprene is waterproof and shock-absorbent. It also retains heat and is flexible to adjust to the natural contours of the foot for good support. In addition to outer waterproofing, these men's rubber work boots keep feet dry on the inside by wicking perspiration away from the skin. Built for durability, these men's work boots have easy-to-clean rubber overlays and outsoles. Circumference: 17 inches.\n\nNothing will get by these things! Perfect for the outdoorsman (or woman), this boot was made to last and work hard for you. It has a protective, waterproof shell with a soft and flexible shaft, breathable airmesh linings, and a slip-resistant rubber outsole.\n\nThe story began in 1999 with the sole purpose of building the most comfortable, high performance footwear on the market. The need for a more comfortable boot for use in messy and tough conditions led to the design of The Original Muck Boot Company brand footwear. Every boot in the line is expected to deliver the same 100% waterproof quality and comfort that inspired the original footwear. In just a few years, the line has grown to more than 20 styles, all designed to tackle tough conditions in agriculture, lawn and garden, outdoor sporting, equine, and pet care. Today, the Muck Boot brand defines a standard of comfort and quality that goes beyond the expectations of customers around the country.\n\nSee more",
    "rating": 4.6,
    "feature_bullets": [
      "Synthetic",
      "Imported",
      "Rubber sole",
      "Shaft measures approximately 15\" from arch",
      "5 mm neoprene provides comfort and flexibility, along with excellent waterproofing, shock absorption and heat retention properties, adjusts to your foot shape to resist blisters and chafing",
      "100% waterproof work boots, easy-to-clean high-grade rubber overlay with durable, quick-cleaning outsole",
      "Breathable Air mesh lining wicks away humidity and perspiration, and allows air to travel throughout the boot, comfort rated from subfreezing to 65 °F/18 °C",
      "Steel shank for support; triple toe and quadruple rubber heel reinforcement for added protection and durability"
    ],
    "categories": [
      "Men",
      "Boots",
      "Shoes",
      "Industrial & Construction Boots",
      "Clothing, Shoes & Jewelry",
      "Work & Safety"
    ],
    "price": 104.95,
    "specifications": {}
  }
}