{
  "website_summaries": [
    {
      "verdict": "It’s hard to beat this versatile carbide blade for the money.  Performs well and is built to far outlast standard blades.",
      "pros": [
        "The teeth are tipped with Cermet (a ceramic-metal blend) for longer life",
        "Produces burr-free cuts and is capable of cutting a variety of materials, including pipe and steel studs",
        "Vibration dampening is built in"
      ],
      "cons": [
        "Cheaper blades are available for minor jobs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great blades, just pricey",
      "text": "This blade is probably one of the best blades out there in my opinion. I have tried about 10 different ones, and this blade out lasted all but one (Diablo). Even with broken teeth, it will still cut. New, this blade is soooo smooth. I wish they weren't so pricey though. The Diablo blades are just as good but almost half the cost. Overall, for the money they are great blades.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie S.",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Amazing blade. Highly recomended, better than Diablo anyday!!",
      "text": "I cut 3/8ths inch steel sheet with this blade to make a welding table and it cut through it better than my plasma cutter did. Highly recommend this product for straight steel cuts. This is my second blade and I've used the Milwaukee Metal Saw almost daily over a year. Cuts through sfeel like butter. Even cut through 2.5 inch (1/4\" dia) square tube with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Merriman",
      "helpful_votes": 2,
      "publication_date": 20180313
    },
    {
      "title": "excellent metal cutting blade",
      "text": "The Milwaukee 42 tooth metal cutting blade works great for most metal cutting. I have a small welding shop and have used these blades for several years now, with great success. The inportant thing is not to push the saw and blade too hard through the metal. Let the saw and blade do the work. I would recomend this blade to anyone looking for a metal cutting blade.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan P. White",
      "helpful_votes": 7,
      "publication_date": 20091005
    },
    {
      "title": "I can get back to fabricating now.",
      "text": "With a fresh blade I can build some really cool things out of steel. I will get another one soon as a back-up.",
      "rating": 5.0,
      "verified": true,
      "author": "t3chnicianb",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Much happier with this blade over other i had bought for the same project.",
      "text": "i was much happier with this blade than others that i bought for cutting 7\" x 2\" C-channel that was 1/4\" thick on the long side and over a 1/2\" thick in the pit of the corners.",
      "rating": 5.0,
      "verified": true,
      "author": "afdeason",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "It worked great on 100 plus cuts on half inch metal stock ...",
      "text": "I used it with my Hitachi chop box. It worked great on 100 plus cuts on half inch metal stock that I cut on a miter. I wouldn't use it on my best saws because it will leave some carbon build up. A great blade and still using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "works a lot better than the Oshlun blade",
      "text": "This blade works well. It is designed for cutting metal at least 1/8 inch thick thinner material does not work as well.",
      "rating": 4.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Worst blade ever for metal",
      "text": "Used for cutting metal studs. Lasted 2 hours. Worst of 4 different blades I have tried. Halfway through a hoist, is started sparking and smoking, and wouldn’t even complete the cut. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Kirk S",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "The cheap china blade I tried on the a 1/2\" ...",
      "text": "The cheap china blade I tried on the a 1/2\" thick 1018 steel plate crapped out after about 36\". This blade cost twice as much but it has cut 20 feet of the same plate and still going.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "Five Stars",
      "text": "These work great but you do have to be careful with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Dunn",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "Good blade!",
      "text": "Great blade for low rpm circular of chop saws. Cuts through steel like butter!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Great blade",
      "text": "Half the price of fasnall ues mine to cut 1/2 inch plate for truck frames. K Fab",
      "rating": 5.0,
      "verified": true,
      "author": "Richard komorowski",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Great product!!",
      "text": "Excellent product, it was exactly as described. I am using it to build a tool locker at work in my Milwaukee Metal cutting circular saw. So far I have used it to cut the sides 2'x5'x11g, the back 4'x5'x10g, the top 2'1\"x4'x 1/4\" and the bottom 2'x4'x3/8. All were cut from 4'x8' shts. Going to to rip the doors next. It is nice to go from cutting to tacking in place with no grinding. So much better than a track torch or a Matabo, which are the only other options.",
      "rating": 5.0,
      "verified": true,
      "author": "kentaysdad",
      "helpful_votes": 3,
      "publication_date": 20120319
    },
    {
      "title": "METAL CUTTING BLADES",
      "text": "THESE BLADES ARE GREAT. I USE THEM ALOT FOR SCRAP METAL CUTTING TO MAKE LOADS MORER COMPACT. THE ONLY THING IF THERE HAPPENS TO BE A HARD SPOT IN THE METAL IT MAY CHIP OR LOSE A TOOTH. JUST DON'T LET THE METAL BIND THE BLADE OR YOU HAVE TO GET ANOTHER PERSON TO STEADY THE PIECE WHILE MAKING THE CUT. I'VE CUT 2\" SOLID SHAFTS IN A MATTER OF SECONDS. I'D HIGHLY RECOMMEND THESE BLADES OR THE 50T IF THE METAL IS PRETTY THIN.",
      "rating": 5.0,
      "verified": true,
      "author": "JIM",
      "helpful_votes": 7,
      "publication_date": 20101001
    },
    {
      "title": "it has been always performed great! blade cuts good",
      "text": "I've used it before ! it has been always performed great ! blade cuts good,works well and last a while!",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20140718
    },
    {
      "title": "Steel cutting blades are awesome",
      "text": "Yep a steel cutting blade! I only use this on the Milwaukee saw made for cutting steel, some people put this in there table saw or hand held circular saw- I would not do it that way- very unsafe! Use the right equipment for the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi & Jason",
      "helpful_votes": 0,
      "publication_date": 20140611
    },
    {
      "title": "Great Saw Blades",
      "text": "These Milwaukee saw blades work well for us.They do the job well and last as long as any blade we have used. Highly recommended. Thanks Dan",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 3,
      "publication_date": 20111221
    },
    {
      "title": "metal cutting blade review",
      "text": "has worked very well for trimming some 29 gauge sheet metal. Pkg says you can cut mild steel with it like angle iron but no details So I have bee afraid to try it. could not get an E-mail reply from the seller to confirm how heavy of steel it will safely cut. Very good on thin stock though",
      "rating": 4.0,
      "verified": true,
      "author": "jws",
      "helpful_votes": 3,
      "publication_date": 20081111
    },
    {
      "title": "Fantastic Blade",
      "text": "Stick with this the original equipment blade, have tried alternatives but always come back to this. Cuts thicker steel with the ease of cutting a 2 x 4 spruce stud, amazing. Get the 50 tooth for thin stock.",
      "rating": 5.0,
      "verified": true,
      "author": "Maine110",
      "helpful_votes": 6,
      "publication_date": 20110430
    },
    {
      "title": "Cold saw blade",
      "text": "These blades work very well on quarter inch material. I have ripped 16 foot pieces of quarter inch plate no problem and they last a long time if you use a guide.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Novelly",
      "helpful_votes": 2,
      "publication_date": 20130725
    },
    {
      "title": "Metal Cutting Blade",
      "text": "The blades are the best value anywhere. I looked hard! The blades hold up well and have cut a lot of metal. I recommend the blades.",
      "rating": 5.0,
      "verified": false,
      "author": "EF",
      "helpful_votes": 2,
      "publication_date": 20090219
    }
  ],
  "product_meta": {
    "title": "Milwaukee Electric Tool 48-40-4515 Circular Saw Blade, 8\" Diameter x 0.073\" T, 42 Teeth, 5/8\" Arbor",
    "description": "Made for use with circular saws, the Milwaukee Circular Blade is designed for cutting a variety of ferrous materials, which are 3/32” and thicker, including pipe angle iron, steel studs, and conduit. Manufactured from quality materials for superior performance, the blade provides maximum vibration damping, which ultimately reduces heat, sparks, and noise, resulting in cleaner, smoother, burr-free cuts.\n\nAMAZON.COM\nThis Milwaukee 8-Inch 42T Cermet-Tipped Circular Saw Blade is designed to cut a variety of ferrous materials 3/32-inch and thicker, including pipe, angle iron, steel studs and conduit. The blade has vibration damping which reduces heat, sparks and noise for cleaner smoother, burr free cuts. Use it with the Milwaukee Dry Cut Saw 6370-20.",
    "rating": 4.6,
    "feature_bullets": [
      "8” metal circular blade",
      "Thin kerf: .073”",
      "Use to cut pipe angle iron, steel studs, and conduit",
      "0-degree hook angle",
      "5,000 maximum RPM",
      "Circular saw blade for cutting of ferrous materials 3/32-inch and thicker",
      "Cermet-tipped for longer life, more wear resistant",
      "Hardened-steel body",
      "Vibration dampening",
      "8-inch diameter; limited manufacturer warranty"
    ],
    "specifications": {
      "Manufacturer": "Milwaukee",
      "Part Number": "48-40-4515",
      "Item Weight": "14.4 ounces",
      "Product Dimensions": "10.8 x 12.1 x 1.3 inches",
      "Item model number": "48-40-4515",
      "Is Discontinued By Manufacturer": "No",
      "Size": "5/8\"",
      "Material": "Carbide",
      "Item Package Quantity": "1",
      "Number Of Pieces": "1",
      "Measurement System": "Metric",
      "Included Components": "Circular Blade",
      "Batteries Included?": "Yes",
      "Batteries Required?": "No",
      "Warranty Description": "1 year",
      "ASIN": "B00023S32C",
      "Customer Reviews": "4.6 out of 5 stars65 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#50,182 in Tools & Home Improvement",
      "Date First Available": "January 22, 2009"
    },
    "categories": [
      "Blades",
      "Circular Saw Blades",
      "Power Tool Parts & Accessories",
      "Saw Blades, Parts & Accessories",
      "Tools & Home Improvement",
      "Power & Hand Tools"
    ],
    "price": 57.36
  }
}