{
  "website_summaries": [
    {
      "verdict": "The Bose In-Ear Headphones are a hybrid set, falling right between regular earbuds and canalphones. They don't block out noise, but they do provide much more bass than stock earbuds--almost too much, in fact.",
      "pros": [
        "The Bose TriPort In-Ear headphones have strong bass and good overall detail, and they're not intrusive in your ear canal"
      ],
      "cons": [
        "The Bose TriPort In-Ear headphones don't block out any noise, and the fit doesn't feel quite as secure as advertised",
        "The silicone tips come off very easily, and pick up tons of dirt"
      ],
      "aspects": {
        "Design": 4.0,
        "Features": 6.0,
        "Performance": 7.0
      },
      "publication_date": 20070216,
      "rating": 5.7,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "7 Years, 1 Washing Machine and still sound great!!!",
      "text": "I've owned these headphones for 7 years and have taken them on every work trip, road trip, gym workout - you name it. These are my go-to headphones on the go. Still using original ear pieces, and they sound great. Yesterday, I found them in the washer after running a load of laundry. They went through the entire wash cycle. I let them dry out and plugged them into my phone today, and they still work as good as ever. Unbelievable! Was so ecstatic, here I am writing a review 7 years later to say that Bose clearly knows how to make a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "so-so",
      "text": "these are nice earphones... I payed $30 for them. they are NOT worth $99 if you pay full price. yesterday I couldn't get the right ear piece to stay in my ear.. kept falling out. I ended up using my old sony earphones... I don't even know why Bose thinks these are superior to the in-ear headphones available. my Apple in-ear earphones are the same quality if not better. so... $99? NO WAY... and I'm a music minor. I listen to a lot of music, live music..recorded music.. and these just aren't up to par with my standards. the regular $200+ headphones bose makes are outstanding..but these aren't at all!",
      "rating": 2.0,
      "verified": true,
      "author": "Rancheres",
      "helpful_votes": 0,
      "publication_date": 20080901
    },
    {
      "title": "Great Headphones for General Purpose",
      "text": "As almost all the reviewers have said, these headphones are great. Bose has some of the best sound quality devices ever engineered and these headphones are right up there. The comfort, quality, and durability are all great. The onl qualms i have with the product is that the rubber pieces fall off pretty easily. If you get hit even lightly or tug on them the wrong way the rubber parts will fall off and are easily lost. Just keep that in mind. But that pales in comparison to how great these are for general usage. Music sounds phenomenal and even computer games sound great with them. Buy these, you wont regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Casanova",
      "helpful_votes": 0,
      "publication_date": 20100215
    },
    {
      "title": "Very unhappy with these headphones",
      "text": "Conpared to the Shure that I usually use, these have terrible quality sound. There is very little treble, they sound muffled no matter how I get them in my ears. Like I had the midrange cranked up to the point of blaring, the treble turned off and the bass at normal. Very aggravating for this price. I'd accept this from a $30 Sony. Even the smallest size adapter is too large to stay in my ear. I wish I could return them for a refund and buy some more Shure earbuds. Guess the Bose in my car is in no way comparable to the average over the counter (probably outsourced) consumer product.",
      "rating": 2.0,
      "verified": true,
      "author": "CO Finn",
      "helpful_votes": 0,
      "publication_date": 20081006
    },
    {
      "title": "Bose Headphones are the Best",
      "text": "I love my Bose headphones. I purchased this set for my father-in-law for his Ipod Shuffle. I figured he would be fine with the old style as he doesn't work out (he is 78)...mainly listens while sitting, relaxing! I was BLOWN AWAY when this company sent me the newest Bose headphones instead as they had sold out of the ones I ordered...AT THE SAME PRICE AS THE MUCH LESS EXPENSIVE original ones that I ordered. CUSTOMER SERVICE ABOVE AND BEYOND what anyone would expect...without any drama....they just sent them with a note explaining! I can't say enough how impressed I am with their service!",
      "rating": 5.0,
      "verified": true,
      "author": "Keapr",
      "helpful_votes": 0,
      "publication_date": 20110729
    },
    {
      "title": "Be Careful of Bose Chinese Knockoffs",
      "text": "Just ordered some Bose headphones from a reseller on Amazon and they are not Bose product. I just wanted to warn everyone of this. Just Google \"Fake Bose In-Ear Headphones\" and you will see some videos on You Tube that will explain how you tell the difference. If people are going to sell Chinese knockoffs on Amazon they should say that is what they are. I have been ordered stuff from Amazon for years and this is the first time I have been burned.",
      "rating": 1.0,
      "verified": true,
      "author": "Docintherock",
      "helpful_votes": 6,
      "publication_date": 20101121
    },
    {
      "title": "Great headphones, but only for a year",
      "text": "I really enjoyed the sound quality on these headphones. I did lose one of the plastic earbud covers and had to order a new set from Bose. I've been using them for about a year, light use, and now the left earbud no longer works. It quit working in the middle of a run, and now it only works when you hold the connection between the wire and the earbud together (there is no damage to the wire, can't tell why this happened). Very disappointed and probably won't spend the money to get a new pair.",
      "rating": 2.0,
      "verified": true,
      "author": "S. Johnson",
      "helpful_votes": 0,
      "publication_date": 20090529
    },
    {
      "title": "These don't work",
      "text": "I loved these when I first got them. The sound was great and they were very comfortable. After about 5 uses, there was NO sound coming out of the left ear bud. They are now completely useless and I'm trying to return them for replacement, but Brady Tech has not gotten back to me regarding the return (sent an email Friday and as of Monday afternoon, no response at all!).",
      "rating": 1.0,
      "verified": true,
      "author": "Mary Smith",
      "helpful_votes": 0,
      "publication_date": 20110509
    },
    {
      "title": "Wire coating falls off",
      "text": "The wire coating is falling off I contacted BOSE all they would do try to sell me more they cost $100 you would think they would have some guarentee on them",
      "rating": 1.0,
      "verified": true,
      "author": "RONALD GOOD",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Not durable",
      "text": "I was just so happy to receive my brand new bose triport in=ear headphone. After all, it is a bose! The sound was good and the fit was fine. Two days of pleasurable use and then it ended. When I pulled it out of my jacket's pocket, the unit just split into 3 separate parts. It's like the letter Y broken into 3 from the node. The 2 cables from the node to the left and right ears were removed. What a disappointment. I've had so many earphones before (denon, sennheiser, sony, lots of stock units. This is just the first time. Simply a design flaw. The seller was kind enought to refund the whole cost including shipping.",
      "rating": 2.0,
      "verified": true,
      "author": "R. F.",
      "helpful_votes": 0,
      "publication_date": 20080216
    },
    {
      "title": "... bought these in May 2009 and they had the best sound of any earbud headphone I have tried",
      "text": "I bought these in May 2009 and they had the best sound of any earbud headphone I have tried; surround sound, bass, treble - a very full sound. Sadly, they have just now shorted out first in one ear, than the other but they almost made it to seven years - that seems pretty good to me.",
      "rating": 5.0,
      "verified": true,
      "author": "LW",
      "helpful_votes": 0,
      "publication_date": 20160220
    },
    {
      "title": "Bose In-Ear Headphones (ear-buds)",
      "text": "I like the in-ear headphones (ear-buds) that fit in the ear compared to the ear-buds that just sit in the ear. However, even with the in-ear headphones I am continuously pushing them into my ear. They are great for walking & I can still hear noises around me.",
      "rating": 4.0,
      "verified": true,
      "author": "KrisB",
      "helpful_votes": 0,
      "publication_date": 20131209
    },
    {
      "title": "Bose-Tastic",
      "text": "Amazing quality here. Thank god for the redesign. At first they had no bass. Then on day three all of a sudden so much bass it was blowing my mind. My music has NEVER sounded so good. These are a must have. If you are even thinking about it don't these are what you want. If I had to find a flaw it would be the price if you can find a deal don't hesitate take it.",
      "rating": 5.0,
      "verified": true,
      "author": "Yoink",
      "helpful_votes": 0,
      "publication_date": 20080112
    },
    {
      "title": "will not use anything else",
      "text": "I am so spoiled by these ear phones that i am unable to use anything else. the sound is amazing.... as a matter of fact, it kinda made me nauseous at first!! i wear these at work all day... 8-12 hours.. and you can't even feel them in your ears like the round hard ones that come with my iphone.. those bruised my ears. i can't express enough how much i love these ear buds. best money i have ever spent",
      "rating": 5.0,
      "verified": true,
      "author": "Suzi",
      "helpful_votes": 0,
      "publication_date": 20130422
    },
    {
      "title": "At last",
      "text": "The upgrade features added to the Bose in-ear headphones have rendered them easy to use, dependable, and finally, they live up to their promise. Bose has overcome the initial problems involving the silicone tips, which continued to fall off and would not remain anchored in-ear, and these wonderful ear buds can be depended on to keep the listener's music private.",
      "rating": 5.0,
      "verified": true,
      "author": "KasaC",
      "helpful_votes": 0,
      "publication_date": 20080205
    },
    {
      "title": "Comfort and Clarity",
      "text": "These are by far, the most comfortable ear bud headphones I have ever used. I have small ears so it's hard to find ear buds that are comfortable and stay in my ears. The super-soft gel tips make it so comfortable. The sound quality is amazing. Hard to believe these are earbuds. Great bass. Great range. SOOOO crisp and clear.",
      "rating": 5.0,
      "verified": true,
      "author": "KY",
      "helpful_votes": 3,
      "publication_date": 20070102
    },
    {
      "title": "totally worth buying a pair of these",
      "text": "had these for a few years now and use them all the time on the motorcycle and still work as if I just bought them. I put them under my helmet and they cut out a lot of the bike noise but I can still hear around me.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew F",
      "helpful_votes": 0,
      "publication_date": 20150518
    },
    {
      "title": "BOSE TRIPORT IN-EAR HEADPHONES",
      "text": "Did not last! Not worth the money, right earphone didn't last 2 monthS, and I didn't use then very often! Over rated! I pass in the future. I paid 89.99 at the time. 2 Stars for how they worked for the first month.",
      "rating": 2.0,
      "verified": true,
      "author": "M. J. Phillips",
      "helpful_votes": 0,
      "publication_date": 20120305
    },
    {
      "title": "love sound quality hate build",
      "text": "After a couple of months the material on earphones started to strip off then the left ear went dead. One month later earphones were entirely dead (happened over a six month period). Bought another pair but the same thing happened. I would NOT recommend this to a friend. Try the beats in ear instead.",
      "rating": 2.0,
      "verified": true,
      "author": "sherebry",
      "helpful_votes": 0,
      "publication_date": 20130622
    },
    {
      "title": "Not worth the money",
      "text": "I had an old pair of these for over 5 years and they worked and sounded great until the plug in went bad. I don't think the plug would go bad if they made it straight instead of the 90 degree angle. After purchasing a new pair, I found out that they have downgraded the wire, while the silicone ear-piece kept on falling off. Unfortunately the new pairs plug-in only lasted a couple of months before it went bad. The quality has definitely gone down at Bose. For the price they want for them, I would not recommend these . Keep on searching.",
      "rating": 1.0,
      "verified": true,
      "author": "matreds",
      "helpful_votes": 0,
      "publication_date": 20120118
    },
    {
      "title": "Comfortable Ear Buds",
      "text": "I like my Bose ear buds so much, I bought a second pair for my husband. I mostly use them when flying. These ear buds have been the most comfortable I've tried. If only they could block out the screaming babies and children kicking my seat on flights, they would be the best invention known to mankind.",
      "rating": 5.0,
      "verified": true,
      "author": "LynneA",
      "helpful_votes": 0,
      "publication_date": 20091212
    },
    {
      "title": "Wow!!  Great set of earbuds... what you would expect from Bose",
      "text": "Wow!! Just got these earbuds from Electronic Expo (authorized dealer) and they sound amazing. This is exactly what you would expect from Bose. They fit perfectly in the ear. Wore them for over 2 hours straight and did not hurt the ear. The high trebles are there and are in great balance with the low base of the music. My comments on getting these from Electronic Expo is based on the other feedback regarding 'knock-offs' and fakes. I travel quite extensively to China and have bought fakes and they absolutely are not the same.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Le",
      "helpful_votes": 0,
      "publication_date": 20101129
    },
    {
      "title": "Bose Headphones",
      "text": "The sound quality is very good...I do not care for the style, they don't fit snug and I have to use the clothes clip to keep them in..if I moved around with them much I could not use them at all...also, the ear buds come off more easily than the traditional ones...",
      "rating": 3.0,
      "verified": true,
      "author": "C.S. Louis",
      "helpful_votes": 0,
      "publication_date": 20111006
    },
    {
      "title": "Bose TriPort In-Ear Headphones (Ear Bud)",
      "text": "This is a good product. I like the fact that there are 3 sizes of tips available. The sound is quite good, but not noticeably any better than the Jbuds, which I have. The price I paid was good for a Bose product. However, if I had to do it again, I would go with good quality headphones/ear buds that cost less than Bose.",
      "rating": 3.0,
      "verified": true,
      "author": "Online Buyer",
      "helpful_votes": 0,
      "publication_date": 20111018
    },
    {
      "title": "Awesome sound quality, never fall out of your ears.",
      "text": "These seriously are the BEST earphones ever. I run half marathons with them and they have never ever fallen out. They have a clip on the top where you can attach them to your sweater or jacket so the chord doesn't bounce around which I love. Highly recommend these in any use really.",
      "rating": 5.0,
      "verified": true,
      "author": "Caitlin",
      "helpful_votes": 0,
      "publication_date": 20131207
    },
    {
      "title": "Ok - nothing to write home about",
      "text": "Honestly, I'm a little bummed these aren't all that great. Better than the ones that came with my Ipod. They are very comfortable, but the sound is kind of 'basey\". Someone who listens to RAP wold probably be thrilled with these. But for someone who likes music and high fidelity they're marginal at best.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris Huebner",
      "helpful_votes": 0,
      "publication_date": 20080307
    },
    {
      "title": "bose ear buds are the best",
      "text": "I purchased the ear buds and started usuing them and liked the way they fit and also they way they sound. It does not block out all sound but they sound like mini speakers in your ear. Great sound. I then listened to ear phones from my ipod and then I really could appreciate the sound of the bose ear buds. A real treat if you use earphones. They have the quality of sound that you expect from bose. You will not be disapointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Lhommedieu",
      "helpful_votes": 0,
      "publication_date": 20080127
    },
    {
      "title": "terrible quality sound",
      "text": "wires must have been broken inside, cuz not only the intensity of volume oscillates but it also goes mute with any motion...",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Sound is amazing on these ear headphones",
      "text": "Sound is amazing on these ear headphones! The fit is extra snug in my ears but fits perfectly in my fiances ears he ended up receiving these as a gift since they fit him better :-)",
      "rating": 4.0,
      "verified": true,
      "author": "Carly Haden",
      "helpful_votes": 0,
      "publication_date": 20150819
    },
    {
      "title": "These headphones are counterfeit!",
      "text": "These turned out to be counterfeit - confirmed by Bose. They sounded great but stopped working within a year. Apparently you have to buy Bose products from licensed retailers only - not Amazon - if you want to get genuine products.",
      "rating": 1.0,
      "verified": true,
      "author": "Berger",
      "helpful_votes": 0,
      "publication_date": 20150226
    },
    {
      "title": "Hold onto your tips",
      "text": "These headphones sound great and once you pick the proper size ear tips fit great too! The big downside of these is that the ear tips loosen easily when taken off and get lost easily. My solution is to dab a drop of Krazy Glue on each ear tip and those suckers stay put.",
      "rating": 4.0,
      "verified": true,
      "author": "Franc Martarella",
      "helpful_votes": 2,
      "publication_date": 20070325
    },
    {
      "title": "Good headphones but...",
      "text": "I have found substantially better ones.. Shure SE215-K Earphones... this earphone has good sound, but it still permit too much outside sound to interfere with good sound experience.. It is still an upgrade from generic ones.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazoncustomer",
      "helpful_votes": 0,
      "publication_date": 20120427
    },
    {
      "title": "Bose In ear headphones",
      "text": "These take getting used to since it feels like they are slipping out of your ears when you're running. However the sound is unmatched and holds up the BOSE name and tradition. I got these pretty cheap on Amazon and it was well worth the money! I probably will upgrade to the premier noise cancelling soon but for now these are probably the best in ear headphones on the market. Good luck to all that get the opportunity to own these.",
      "rating": 5.0,
      "verified": true,
      "author": "Tkobuckeye",
      "helpful_votes": 0,
      "publication_date": 20080928
    },
    {
      "title": "no thanks!",
      "text": "I was really super excited to get these headphones... I thought that because it was a Bose product that it was going a no-brainer of the quality of the headphones.. turns out, they suck. They fall out of my ears constantly. They have no mid levels.. its all base, or its all treble. Sitting with them is alright, but, walking with them is really frustrating. You can hear everything around you outside.. Ack!",
      "rating": 1.0,
      "verified": true,
      "author": "Em Koelbl",
      "helpful_votes": 0,
      "publication_date": 20090706
    },
    {
      "title": "Super Bose purchase!",
      "text": "This is my 2nd Bose earbuds purchase. My first was several years ago, used daily,but lost them. So I decided to replace them. I didn't want the inside earpiece that connects to the buds, but am happily surprised that it is very soft and comfortable. I love these Bose earbuds for my jogging and exercising! These are great and were cheaper than the first pair from a Bose store!",
      "rating": 5.0,
      "verified": true,
      "author": "Retired Momma",
      "helpful_votes": 0,
      "publication_date": 20101228
    },
    {
      "title": "Great Headphones with great Bass",
      "text": "These headphones sounded fantastic. The bass was great and not too much and the treble was great too. On my IPOD, I set the EQ on treble booster which sounds best. I highly recommend these headphones. Make sure the cord is black and white and NOT all black.",
      "rating": 5.0,
      "verified": true,
      "author": "rktecct",
      "helpful_votes": 0,
      "publication_date": 20090101
    },
    {
      "title": "My ears don't fit!",
      "text": "The sound quality with my SanDisk is good not great. Could be the SanDisk. There are two sets of earbud covers but neither really secures the earbuds in the ear...at least not my ear. Product was received quickly and in condition as described.",
      "rating": 4.0,
      "verified": true,
      "author": "Terry K",
      "helpful_votes": 0,
      "publication_date": 20081123
    },
    {
      "title": "Not worth $100... not nearly.",
      "text": "I'm a music enthusiast as I'm always listening to music throughout the day. I listen to Dance/Rap/R&B/Rock so naturally I need clear acoustics and deep full bass. I thought I might take a gamble on a $100 pair of earphones (I only use earphones as headphones are too bulky) and I was disappointed. The ear buds can't fit plush. It's too uncomfortable. Bass is muddy and sloppy. But the acoustic is crystal clear. I would rather stick with my $15 JVC marshmellows... it has deeper, clearer bass.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael S. Kim",
      "helpful_votes": 0,
      "publication_date": 20090514
    },
    {
      "title": "Bose headphones great!",
      "text": "These headphones were given as a Christmas gift and my son was thrilled with them. He says they are the best and he was excited we thought of them. We are very happy with the quality. Extremely satisfied customers!",
      "rating": 5.0,
      "verified": true,
      "author": "musicmt",
      "helpful_votes": 0,
      "publication_date": 20110108
    },
    {
      "title": "The Good, The Bad, And The Ugly",
      "text": "The \"good\" is that the sound quality engineering is about as good as it can get for such an in-ear product (vs. headphones). The \"bad\" is that none of the three removable tip sizes are comfortable in the ears. The \"ugly\" is that the latter become easily detached and adrift and that the only way to cure \"hide-and-seek\" is to cement on the best fitting size, causing maintenance/cleaning issues. Worth $100? Absolutely not. Even worth the $30 I paid? No.",
      "rating": 2.0,
      "verified": true,
      "author": "Entronaut",
      "helpful_votes": 0,
      "publication_date": 20080727
    },
    {
      "title": "Love it. what is more to say",
      "text": "Very good noise cancellation quality. Excellent base and treble quality. The three covers are good so you can choose depending upon the size of your ears. Negative point: doesnt work well when yoou are working out due to sweat. Overall - 4.5/5.",
      "rating": 5.0,
      "verified": true,
      "author": "Sowmya Ragavan",
      "helpful_votes": 0,
      "publication_date": 20130222
    },
    {
      "title": "Five Stars",
      "text": "Best set I have had so far, Good item. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "PeggyApr",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "Best ear buds on the market",
      "text": "This was a replacement set for a lost ear bud and as usual, Bose has it down cold and produces a perfect product that is both well made and well designed...",
      "rating": 5.0,
      "verified": true,
      "author": "Nilla",
      "helpful_votes": 0,
      "publication_date": 20140617
    },
    {
      "title": "bose makes my brain mushy in a good way",
      "text": "these headphones make music play directly into my ear holes. i have these holes in my skull where sounds are processed and these headphones are good at shoving that sound directly into them. way to go bose!",
      "rating": 5.0,
      "verified": true,
      "author": "J. R. Sheehy",
      "helpful_votes": 0,
      "publication_date": 20110331
    },
    {
      "title": "Rock on",
      "text": "My son loves the heaphones. I haven't bought me a set yet but I will soon since the onesI use firnworking our are mail most dead. These have a very good ans surprising sound",
      "rating": 5.0,
      "verified": true,
      "author": "SB32",
      "helpful_votes": 0,
      "publication_date": 20130113
    },
    {
      "title": "Comfortable ear piece!",
      "text": "The quality of sound is great! I really like the adjustable ear pieces. Especially I have very small ears and usually feel uncomfortable to use earphones which hurt the inner parts of my ear quite a bit after using it a while. But this product is great! They do not hurt my ear, and I can enjoy music, radio shows, movies, etc. for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Lee",
      "helpful_votes": 0,
      "publication_date": 20100211
    },
    {
      "title": "Awesome..",
      "text": "This is my first product from BOSE. It really sounds great. Accessories are really good. All the ear phones I had, after some time one of the ear phone was not working.....Till today it is working fine....Let me wait and see and hope the best form Bose. Worth for the money. ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Vivek A. James",
      "helpful_votes": 0,
      "publication_date": 20080327
    },
    {
      "title": "The best earbuds!",
      "text": "This is my second set of the Bose in ear buds. I have tiny ears and no other brand I have tried fit comfortable if my ear. With the small tips on these it is wonderful and the sound is amazing. My teenager and wife want a pair also. A great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "JSchiavo",
      "helpful_votes": 0,
      "publication_date": 20120330
    },
    {
      "title": "Amazing sound quality, questionable durability...",
      "text": "These headphones are very expensive. They are great ear buds in terms of comfort and sound quality (I have never heard better sound quality from a pair of ear buds, or even over the ear head phones are that matter!), but there is a durability issue. I purchased these ear buds for my fiance for her birthday, and just over a year later, the wire started to split where it comes out of the eighth inch jack. They are no longer functional because of this.She did use them very often though, and even wore them regularly at the gym. It would be great if the exception sound quality was accompanied by more durability.",
      "rating": 3.0,
      "verified": true,
      "author": "jtoth",
      "helpful_votes": 0,
      "publication_date": 20131213
    },
    {
      "title": "Five Stars",
      "text": "Good timing on the delivery, the item is what they said it is. It works grate.",
      "rating": 5.0,
      "verified": true,
      "author": "slyz",
      "helpful_votes": 0,
      "publication_date": 20140924
    },
    {
      "title": "Great sound but durability is not so great",
      "text": "I bought these for the gym while in Afghanistan and they sounded awesome; however, they ended up not surviving the gym. the wire cover would come undone and expose the bare wires.",
      "rating": 4.0,
      "verified": true,
      "author": "Louis Abrams",
      "helpful_votes": 0,
      "publication_date": 20130428
    },
    {
      "title": "Biggest waste of money ever",
      "text": "This is to Bose: Biggest waste of money ever. Didnt even last me 6 months before the wire came out of the ear bud.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel Trujillo",
      "helpful_votes": 0,
      "publication_date": 20141125
    },
    {
      "title": "Awesome Sound",
      "text": "The headphones deliver really good sounds and are capable of hard and deep bases. Unfortunately after about 18 Months the wire broke just above the 3,5mm jack. I went to a Bose store nearby, the warranty was already up but they offered me the new version of the TriPort Headphones 60% off regular price, so i bought those and have them since 3 years now and havent encountered any issue.",
      "rating": 4.0,
      "verified": true,
      "author": "PeterGriffin",
      "helpful_votes": 0,
      "publication_date": 20131109
    },
    {
      "title": "EXCELLENT",
      "text": "With my iPod Nano, this was the perfect purchase. Audio quality is high and they don't fall easily. It's comfortable and discreet.",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo Oliveira",
      "helpful_votes": 0,
      "publication_date": 20121209
    },
    {
      "title": "Bose Head Phones",
      "text": "Look, feel, and sound real, but there is no true way of telling without contacting the manufacturer. I have a friend with the same headphone so I want to compare mine with his to see. All in all, solid headphones. On a side note, I ordered the IE1s and they sent me IE2s which was a nice surprise considering the price difference.",
      "rating": 4.0,
      "verified": true,
      "author": "Zack from UF",
      "helpful_votes": 0,
      "publication_date": 20110315
    },
    {
      "title": "Great, but...",
      "text": "I am enjoying the sound quality of this product. However the ear bud covers often fall off. That can be annoying and you can't use the product without them. At times, there is a hunt in the bed, hunt on the floor of the gym, etc... for the earbud covers. It's a trade off, because the sound quality is exceptional.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Walker",
      "helpful_votes": 0,
      "publication_date": 20091224
    },
    {
      "title": "Cables won't last long but good sound",
      "text": "Had the earphones from Jan 2010 till April 2011 when the left cable shorted out. This is my second set of Bose earphones and I love the sound but am wondering why I'm spending so much money on earphones each year. I think this was my last Bose. Called my credit card and fortunately they're covered under the one year extension. So . . . they sound great, they aren't going to last without shorting out and they don't stay in your ear if you like to exercise with them.",
      "rating": 3.0,
      "verified": true,
      "author": "P. Hayden",
      "helpful_votes": 0,
      "publication_date": 20110415
    },
    {
      "title": "Headphone",
      "text": "great item. What more can I say. I bought them and love the feel in my ear. The're so lightweight and comfortable I sometimes sleep with them",
      "rating": 5.0,
      "verified": true,
      "author": "Michael King",
      "helpful_votes": 0,
      "publication_date": 20121117
    },
    {
      "title": "One of the Best In Ear in the market...",
      "text": "Tried many others, including the Shure's, but these gave details in the music that I was never able to notice before. Also, give it some time for it to \"burn in\" and, if possible, use EQ on the Source Device that matches your taste in music for better results. Anyways, it's very good just out of the box, but for better results and richness, use EQ. Great Buy. Very Fast and Accurate shipping from Amazon. Thank You!",
      "rating": 5.0,
      "verified": true,
      "author": "Tiago \"Biggie\" de Moraes",
      "helpful_votes": 0,
      "publication_date": 20111026
    },
    {
      "title": "Counterfeit",
      "text": "Don't trust em. I got a pair. I thought I was listening to Bose, but a quick stop at the Bose store I realized I had been duped.",
      "rating": 1.0,
      "verified": true,
      "author": "Jesus",
      "helpful_votes": 0,
      "publication_date": 20130103
    },
    {
      "title": "Incredible sound",
      "text": "The Bose earbuds offer incredible sound. After hearing them, I had to buy a set for everyone in the family. They are also comfortable and fit snugly, but buy them for the sound.",
      "rating": 5.0,
      "verified": true,
      "author": "F. Beck",
      "helpful_votes": 0,
      "publication_date": 20090526
    },
    {
      "title": "Sound Great",
      "text": "The feel great in all day and sound quality is amazing. Could be made alittle better, cords can pull out of speakers if not carful. Great ear buds for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Ekass13",
      "helpful_votes": 0,
      "publication_date": 20110214
    },
    {
      "title": "Great sound",
      "text": "Great bass tones, One of the best ear buds on the market. Length of cord is is ideal. three different plastic ear bud covers are also a bonus of this item. The one con is that these cover fall off very easily, they are not secured that well to the ear buds. On a scale of 1-10 I would give this item a nine.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyrone Savage",
      "helpful_votes": 0,
      "publication_date": 20090204
    },
    {
      "title": "comfortable and high quality sound",
      "text": "The Bose TriPort In-Ear-Headphones are by far the most comfortable in ear headphones I've experienced and the sound quality is wonderfully Bose. The superior comfort and sound are worth the extra money you shell out for $99 price range headphones. The case, neck strap are added perks as well. These will not disappoint you.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Albinson",
      "helpful_votes": 0,
      "publication_date": 20080611
    },
    {
      "title": "Not what I expected from Bose",
      "text": "I got these thinking...\"Bose, got to be the best earbuds !\" ....total disappointment. The rubber inserts kept falling out. definately not good for anyone who is active and on-the-go. I must say the sound quality was good but not what i've come to expect from Bose. I got the Sony earbuds as a replacement. A lot more value for your money.",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20090910
    },
    {
      "title": "HORRIBLE",
      "text": "This seller sold me FAKE Bose headphones, and said that they were real I called the company and they said they were fake after looking up the serial number DONT BUY FROM THIS SELLER!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Burn Sirv",
      "helpful_votes": 0,
      "publication_date": 20090401
    },
    {
      "title": "Bose In-Ear Headphones",
      "text": "Great sound and comfort. This is a second pair. The wire on the first pair hooked on a chaair and ripped out of the connection. Bose does not repair this item - you have to buy new but they offer a 50% discount on the replacement set. Worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Tylka",
      "helpful_votes": 0,
      "publication_date": 20090507
    },
    {
      "title": "amazing headphones...",
      "text": "These r the best quality headphones i'v bought till now.. i mean i'b bought some large amount of crappy stuff, but these r jus out of this world.. amazing sound quality,, nice balance b/w the ears.. i mean 52$ in all. and the quality ,, its worth buying once in 2 years.. lol Jus liked them too mch,,,",
      "rating": 5.0,
      "verified": true,
      "author": "Akshya Sharma",
      "helpful_votes": 0,
      "publication_date": 20090422
    },
    {
      "title": "Magnificent sound",
      "text": "I cannot fully describe the difference between these headphones and others I have had. Worth every penny. The sound is perfectly beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20081205
    },
    {
      "title": "Good, not enough trebble",
      "text": "Could use some more highs, but the lows are solid. Very comfortable, stay in ear just fine while staying still. The wires stick to your clothing so if you move around, it tends to pull them out of your ear. Gets annoying, but still a good set of earphones.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Hutchinson",
      "helpful_votes": 0,
      "publication_date": 20081012
    },
    {
      "title": "Did not meet my expectations",
      "text": "Going with name (Bose) and price for buying this product may diappoint you! Although this I felt that the music/sound is highly detailed and clear most of the times, it did not get that punch with detailed sound that my $20 Senheiser headphone gives me. It is still a nicely fitting head phone, and prolonged/continuous use did not give me head ache and discourage me using it again and again. It felt that it is good for listening to recorded music only! and not good for sound testing in studios. I am using it for listening music only.",
      "rating": 4.0,
      "verified": true,
      "author": "BassGuy",
      "helpful_votes": 0,
      "publication_date": 20080119
    },
    {
      "title": "Good for the price",
      "text": "Bought this from the \"New/Used\" option on Amazon for about $50, they are built very well and produce good sound. I wouldn't have paid $100 for them though.",
      "rating": 4.0,
      "verified": true,
      "author": "Tyler McPheeters",
      "helpful_votes": 0,
      "publication_date": 20081201
    },
    {
      "title": "Great ear buds",
      "text": "I bought a pair over 3 years ago, they still work great, great sound quality, even with a 18 month old girl playing with and slobbering on it. My only problem is my wife keeps taking them, so I ordered a new pair for her.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Alan Balzer",
      "helpful_votes": 0,
      "publication_date": 20101118
    },
    {
      "title": "Like new headphones - Great Buy!",
      "text": "These headphones were like new. Great quality sound, great price. Would highly recommend the headphones and the seller!",
      "rating": 5.0,
      "verified": true,
      "author": "Mojo's Mom",
      "helpful_votes": 0,
      "publication_date": 20090205
    },
    {
      "title": "Holy Jesus!",
      "text": "These are without doubt the absolute BEST earbuds I have ever experienced. I would never go back to using anything less!",
      "rating": 5.0,
      "verified": true,
      "author": "Sean D. Reeves",
      "helpful_votes": 0,
      "publication_date": 20080427
    },
    {
      "title": "Stays in Ears!",
      "text": "Dynamite sound and stays in my ears where other earbuds do not. Fast shipping and nice person on the phone. I love them, they rock! First headphones I have had that actually will stay inside my ear.",
      "rating": 5.0,
      "verified": true,
      "author": "Deceased",
      "helpful_votes": 0,
      "publication_date": 20090510
    },
    {
      "title": "Garbage lasted 6 months",
      "text": "Sound quality was not at all what I expected from Bose and they only lasted six months before failing completely.",
      "rating": 1.0,
      "verified": true,
      "author": "AinSophAur",
      "helpful_votes": 0,
      "publication_date": 20130625
    },
    {
      "title": "Review",
      "text": "I wanted an extra pair of headphones so I could travel with one pair and keep one at home. They work, so there are no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Optictongue",
      "helpful_votes": 0,
      "publication_date": 20130715
    },
    {
      "title": "BOSE Headphones",
      "text": "I purchased this product to give as a gift. The product arrived on time & in excellent condition. I recommend using this vendor & I will also make future purchases from them. The recipient of my gift is very pleased with it. Fit is comfortable & the audio has excellent quality.",
      "rating": 4.0,
      "verified": true,
      "author": "William J. Durst",
      "helpful_votes": 0,
      "publication_date": 20090114
    },
    {
      "title": "Great sound, but faulty",
      "text": "I bought these as a birthday present for a friend. He reported that they gave him the best sound quality out of any headphones he had ever had, but after a couple months the right channel was shot.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Freeman",
      "helpful_votes": 0,
      "publication_date": 20090513
    },
    {
      "title": "Best headphones",
      "text": "I had the series one in the past, but unfortunately the cable broke. Now I bought this new version and I'm really amazed by the quality of sound. Also the \"stay in the ear\" works properly, solving one of the biggest lack that the previous series had.",
      "rating": 4.0,
      "verified": true,
      "author": "ades101",
      "helpful_votes": 0,
      "publication_date": 20110118
    },
    {
      "title": "Awesome headphones!",
      "text": "This is a great buy for people like me who love their iPods. Great sound, great quality, and very comfortable. My only complaint is the very long cord, but that's no biggie - it comes with a clip.",
      "rating": 5.0,
      "verified": true,
      "author": "Bernadette J. Wilgers",
      "helpful_votes": 0,
      "publication_date": 20081011
    },
    {
      "title": "Greate Product , Older version",
      "text": "The headphones are great Bose quality , but these ones are not the same as the one sold by Bose in the USA . the silicone ear pieces tend to come off sometimes .",
      "rating": 5.0,
      "verified": true,
      "author": "YR",
      "helpful_votes": 0,
      "publication_date": 20090909
    },
    {
      "title": "Outstanding!!",
      "text": "The very best sound I have ever heard! I always thought that the headphones that came with my IPod were good and I would not notice if I tried Bose. I was wrong. There is a huge improvement with these Bose earphones. Very happy and I would highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Kent T",
      "helpful_votes": 0,
      "publication_date": 20110111
    },
    {
      "title": "EARPHONES",
      "text": "BOSE IS THE BEST YOU CAN BUY. THE CLARITY AND SOUND IS GREAT. THE PRICE WAS GREAT ALSO.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike J. Reese",
      "helpful_votes": 0,
      "publication_date": 20090816
    },
    {
      "title": "Great Amazon service, Great product",
      "text": "The product came on time. The quality of the phones is amazing. Great experiencce of purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel Bursztyn",
      "helpful_votes": 0,
      "publication_date": 20080209
    },
    {
      "title": "Best ever!!!!!!!",
      "text": "The silicon is perfectly fit my ear canal very well and the sound is abosoluetly perfect,when i used other with my ipod the sound was totally different.Bose ever!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Phannaroath Pheav",
      "helpful_votes": 0,
      "publication_date": 20090319
    },
    {
      "title": "Feedback",
      "text": "I am very satisfied with my order. The expo made an immediate fix on my order, only minor issues. But they came around in the end and sent me this product. Good item. Thanks. Berlioz",
      "rating": 4.0,
      "verified": true,
      "author": "Tyler_Berlioz",
      "helpful_votes": 0,
      "publication_date": 20110918
    },
    {
      "title": "I had to replace the silicon case and then the wire broke.",
      "text": "Horrible headphones. Just buy another ones. 1st I had to buy extra replacements for the silicon case. Then the wire was just broken. This are way too expensive headphones for less than a year that I could use them",
      "rating": 1.0,
      "verified": true,
      "author": "JAVIER GARCIA ALVAREZ",
      "helpful_votes": 0,
      "publication_date": 20140209
    },
    {
      "title": "very nice",
      "text": "you can heard the outside noises without having to turn down the volume and it also blocks the outside noises very well with out having to blast into full volume.",
      "rating": 4.0,
      "verified": true,
      "author": "Lidia",
      "helpful_votes": 0,
      "publication_date": 20110109
    },
    {
      "title": "Amazing headphones",
      "text": "I ordered the older version because I had them previously and was completely satisfied, but this company was out of stock and upgraded me to the new ones without charging the difference. Great customer service, great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Alyssa",
      "helpful_votes": 0,
      "publication_date": 20120426
    },
    {
      "title": "Love them!",
      "text": "These are excellent headphones. They are well worth the cost. The sound quality is 10x better than the cheap-o headphones that came with my ipod.",
      "rating": 5.0,
      "verified": true,
      "author": "SN",
      "helpful_votes": 0,
      "publication_date": 20080829
    },
    {
      "title": "Bose TriPort In-Ear Headphones",
      "text": "I purchased these headphones in 2007 and they finally died this year. They had amazing sound quality and sat in my ears comfortably. I never used them while exercising but for a long plane/car ride they were perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "DragonsGrace",
      "helpful_votes": 0,
      "publication_date": 20120309
    },
    {
      "title": "Great",
      "text": "Shipping was fantastic. These are the greatest earphones ever. It sounds like a concert in my head.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20090501
    },
    {
      "title": "Bose is the best",
      "text": "When sound is an issue, definitly Bose is the a bran you can count on it. These ear phones are lightly and the sound is just perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "vaecha",
      "helpful_votes": 0,
      "publication_date": 20111208
    },
    {
      "title": "super durable",
      "text": "cheap great quality great sound quality great mids base is pretty good great treble and higher notes crisp and strong though the earbuds are extremely easy to lose its insane",
      "rating": 5.0,
      "verified": true,
      "author": "Rahul Vungutur",
      "helpful_votes": 0,
      "publication_date": 20140303
    },
    {
      "title": "One Star",
      "text": "very bad speaker quality i need to return it but no one is helping me with this issue.",
      "rating": 1.0,
      "verified": true,
      "author": "evelyn mota",
      "helpful_votes": 0,
      "publication_date": 20150204
    },
    {
      "title": "Bose® in-ear headphones-terrible",
      "text": "The earpieces did not stay in your ears and the overall sound was terrible. I was shocked that Bose would put out such an inferior product. I returned the next day.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve J.",
      "helpful_votes": 2,
      "publication_date": 20070223
    },
    {
      "title": "Great Sound",
      "text": "These headphones provide full, rich bass and clear, clean highs and mid-range. They make listening to my iPod a great experience. I highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorrin",
      "helpful_votes": 0,
      "publication_date": 20100516
    },
    {
      "title": "Amazon is great!",
      "text": "These are great ear buds with a great carrying to also hold other items. I like the idea they came with extra sizes to be able to choose what fits best for me. The sound is awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "MsSocialLuvy",
      "helpful_votes": 0,
      "publication_date": 20110112
    }
  ],
  "product_meta": {
    "title": "Bose TriPort In-Ear Headphones - Headphones ( ear-bud ) - black",
    "description": "Now enjoy high-quality, stable in-ear headphones - engineered and developed by the most respected name in sound. Bose in-ear headphones are the only in-ear headphones with the rich audio and comfortable design you've come to expect from Bose.",
    "rating": 3.3,
    "feature_bullets": [
      "Genuine Bose Headphones",
      "Brand New In Manufacturers Sealed Package With All Accessories",
      "3 Pairs of Silicone Tips (S/M/L)",
      "High Quality Audio From A Comfortable In-Ear Design",
      "Bose Triport Acoustic Headphone Structure",
      "Bose n-Ear Headphones - (44437)",
      "MSRP $99.00"
    ],
    "specifications": {
      "Product Dimensions": "0.59 x 1.02 x 1.3 inches",
      "Item Weight": "0.635 ounces",
      "Manufacturer": "BOSE",
      "ASIN": "B000KLZ7VG",
      "Item model number": "Triport",
      "Customer Reviews": "3.3 out of 5 stars606 ratings3.3 out of 5 stars",
      "Best Sellers Rank": "#16,865 in Earbud & In-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 2, 2006"
    },
    "categories": [
      "Earbud Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": ""
  }
}