{
  "website_summaries": [
    {
      "verdict": "A popular and trusted organic unscented astringent with aloe vera and witch hazel extract.",
      "pros": [
        "The aloe vera soothes while the witch hazel controls blemishes, reduces puffiness, and tightens pores",
        "The lavender and mint give the toner a light, calming scent",
        "Contains certified organic aloe vera",
        "Free of parabens"
      ],
      "cons": [
        "Not a good choice for people who strive to avoid alcohol-based products"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Phenoxyethanol...",
      "text": "I used to absolutely love this product... however, they went and added Phenoxyethanol for pretty much no reason. They didn't have it in it before and didn't need to add it now. Phenoxyethanol is highly recommended to not be used for skin... kinda kills this product and I think I'll be exploring other options after this batch runs out. Look up phenoxyethanol yourself if you dont believe me and think I'm overreacting. How they took such a wonderful product and ruined it with something thats bad for your skin is beyond me. All it took was NOT changing the recipie.",
      "rating": 1.0,
      "verified": true,
      "author": "The Wolves",
      "helpful_votes": 65,
      "publication_date": 20190419
    },
    {
      "title": "This stuff is great! I have large pores (gross",
      "text": "This stuff is great! I have large pores (gross, I know) that get congested (even grosser, I know), which leaves me with unattractive texture on my face, regardless of how often/how little I exfoliate. I decided to try to a toner and randomly picked this one. This stuff is great! My face has changed significantly--I have much less texture and it seems that my pores are staying cleaner. It also helped to even out my very fair skin tone, which shows any blemish/discoloration. It smells wonderful, doesn't smell like alcohol, and dries quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 24,
      "publication_date": 20171227
    },
    {
      "title": "Love it!",
      "text": "I have absolutely loved this product! I was struggling with white heads, problematic acne and clogged pores. I've always taken care of my face by washing regularly and rarely wearing makeup (maybe every 3-4 days), but I hadn't incorporated a toner into my routine. Since doing so, I've noticed a significant difference. My skin feels tighter and I've been less prone to breakouts. I use this product generously 2-3 times a day and it has lasted for 10 weeks. I already purchased and received my second bottle 👍🏻 Also, for those that have used witch hazel in the paste and have an issue with the smell, this product smells wonderful! Very mild and pleasant.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Cantrell",
      "helpful_votes": 21,
      "publication_date": 20170823
    },
    {
      "title": "Buyer Beware!",
      "text": "Came with seal ripped. Don't know where this is made, but recent news article about a mom who had been getting a great facial product from Mexico for 10 yrs. Last order caused neurological damage. She's been 'unresponsive\" since. I worry about US companies that are simply distributors, clearly with no investment in quality control. Returning and now don't trust a replacement. PS. Not a third-party distributor. This is direct from the manufacturer;-o",
      "rating": 1.0,
      "verified": true,
      "author": "Findinggracenow",
      "helpful_votes": 12,
      "publication_date": 20190911
    },
    {
      "title": "One star for this seller only, not for the genuine product",
      "text": "I had purchased Thayer's before, even had one of my old bottles. After reading some reviews on whether these are fake or not, I checked my old bottle and it is different from my last order. There is no serial number on the new ones, the smell is different, and the label as well. I love Thayer's when it is the real deal. I will not be purchasing from here again.",
      "rating": 1.0,
      "verified": true,
      "author": "Theodore Lee",
      "helpful_votes": 4,
      "publication_date": 20190520
    },
    {
      "title": "I use it daily",
      "text": "I've been using it once or twice daily as a toner or quick cleanser and have enjoyed it. I just pour a little on my bandanna or thin washcloth. I think it, along with the rest of my regimen, has really helped even my skin tone and prevent breakouts. I like the scent and feel of it on my skin. Now I'm using a spritzer so it will be a little easier to use less per application, but I'd still recommend the product and buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "AnnieJoy",
      "helpful_votes": 3,
      "publication_date": 20190325
    },
    {
      "title": "Ouch",
      "text": "I tried Thayers WH (Lavender) Toner, and it burned my skin. Even days later, and layering moisturizer, my skin won’t stop peeling. The attached picture is two days after I had tried the toner, and my skin is still dry and discolored.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 4,
      "publication_date": 20191031
    },
    {
      "title": "Great for Padsicles!",
      "text": "My wife and I attended a pregnancy course and the instructor gave us the advice to make \"padsicles\". Basically this is for the mother to use after she has given birth. We need witch hazel and aloe vera. We had quite a few of these and they helped her a lot! We now recommend this to all of our friends who are pregnant.",
      "rating": 5.0,
      "verified": true,
      "author": "Amit Patel",
      "helpful_votes": 3,
      "publication_date": 20190823
    },
    {
      "title": "New formula contains Phenoxyethonal",
      "text": "I compared the list of ingredients to a bottle I purchased almost a year ago. They've added phenoxyethonal, a known skin irritant and carcinogen. Totally unnecessary and I will be looking for a new toner.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 3,
      "publication_date": 20200123
    },
    {
      "title": "Absolute garbage",
      "text": "Thayers used to be great, but the rumors of a reformulation has been made out to be true. There are no healing or moisturizing effects with this witch hazel. I've tried using this stuff to clean the pores by using some cotton pads drizzled in the witch hazel to wipe away dirt and grease. My skin didn't benefit at all. Overpriced and doesn't clean as well as the authentic stuff. The lavender scent smells synthetic. I use this stuff to treat razor burn and a way to moisturize the skin when done showering. It just doesn't matter how much you use.",
      "rating": 1.0,
      "verified": true,
      "author": "Rockwell",
      "helpful_votes": 2,
      "publication_date": 20191123
    },
    {
      "title": "Best witch-hazel I've ever purchased!",
      "text": "As a former model, I am very particular about what I put on my face. I have never loved a witch hazel more than I love this one. It was my first time purchasing and I could not be happier. I'm going to look into their entire product line and see what else they have. If you want a comforting scent, great feel and glow on your skin after your cleansing and before your moisturizing, this is what you're looking for! I would even recommend it if you just want a quick clean at the end of the day before you go to bed. Again, I cannot say how much I love the stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Very nice, but very mild scent",
      "text": "I tried this after using a similar product (different brand) with a medicinal scent others seem to like better than me. (The other brand is also 2x price.) So these things are obviously subjective. This product itself is very refreshing as an after shave splash. I like this one better, but the lavender is very, very subtle—I would have preferred a little more strength in the fragrance. Ironically, I feared the rose would be too strong and feminine, but I tried it in the store and it was really nice—stronger than the lavender but not too strong. As I said I like the product overall, so I think I’ll try the rose next time.",
      "rating": 4.0,
      "verified": true,
      "author": "gsd99dde",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Where is the lavender?",
      "text": "Witch Hazel has been used for many many years. The one thing that this item had going for it was that it came in lavendar, rose and cucumber. I purchased the lavender because my very keen sense of smell is not at all a fan of witch hazel and lavender is soothing. There is absolutely no trace of lavender that I can detect. The only difference that I can find from any fun of the mill bottle of witch hazel is that the scent isn't as strong. That said, you can buy witch hazel (which is a great product) at your local pharmacy for a couple bucks. Save your money, this wasn't worth paying more than double the amount.",
      "rating": 3.0,
      "verified": true,
      "author": "Tammyopus",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Perfect Addition to Everyday Routine",
      "text": "Love the scent! I get hormonal acne, and using this every day has made SUCH a drastic difference. I combine in my routine with Shea Moisture facial products, and the products work great together. For reference, I have combination skin - oily in my T zone and dryness on my cheeks. Since beginning using this product a month ago, my skin is more even, my breakouts have decreased, and it’s even helped with appearance of acne scars. I would highly recommend this to someone who is over the harshness of other products.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Super disappointed. I can’t use it without a lid.",
      "text": "It came without a lid??? What the heck?! The seal is on it but what am I supposed to do when I take the seal off??? There’s no way to close it. Update: I took the seal off but it didn’t even last two hours without spilling everywhere. Ugh! I have a little apartment with almost no counter space in the bathroom but I can’t put a wide open bottle of liquid in a cabinet. It would get stuff inside for one, and for two, it would end up spilling worse! So I currently have a half empty bottle sitting open on my counter inside a mason jar to hopefully protect it. Please send me a replacement lid at least!!",
      "rating": 1.0,
      "verified": true,
      "author": "Skyeli McAdams",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Amazon listing misleading. The ingredients list has changed",
      "text": "My rating is comparing this toner, not to other toners, but to Thayer’s previous formula, which was superior. I love, loved the older formula, which did have alcohol, but had more aloe. It made my skin glow! This is more astringent, less moisturizing. I do not like the scent, which is very medicinal. Though I love real lavender scent. I read reviews on Amazon but then believed the ingredients list. The current list on the actual bottle is pictured here. This listing needs to be updated!",
      "rating": 3.0,
      "verified": true,
      "author": "John K",
      "helpful_votes": 2,
      "publication_date": 20191112
    },
    {
      "title": "No need for expensive products!",
      "text": "I’ve always used expensive Clarins products. My financial situation has changed so I’ve been experimenting with more cost-effective products. This toner is not only cost-effective but high-quality! It’s soothing to the skin and also cleanses. my skin tone has evened out when being used. I will continue To purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Resa",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Obsessed",
      "text": "I've never been a huge skincare fanatic, but I was watching some YouTube videos and even a friend of mine had raved about Thayers Witch Hazel Toner, and when I learned that lavender has healing properties, I decided to try it. I'm obsessed. I use it every time I pass through the bathroom and it leaves my face feeling cool and refreshed, and some of the acne scarring that is on my face has started to lighten and heal. Definitely a fan.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 2,
      "publication_date": 20190327
    },
    {
      "title": "Love it",
      "text": "I love Thayers. I use the rose petal one as well for my mornings which I spritz on my face every morning before I do my skincare/makeup routine. At night after I wash my fash, I put the lavender toner on a cotton round and go over my face to get any remaining debris off my skin. Love the smell.",
      "rating": 5.0,
      "verified": true,
      "author": "Evie",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Refreshing skin care staple",
      "text": "Witch hazel is one of my all time favorite skin care products. I suffer from eczema from time to time and it's one of the only things that feels nice when my face is flaring up. I've used The original (unscented) Thayer's before, but I wanted to give the lavender a go. Honestly, the lavender scent doesn't come through much at all. Smells somewhat like a lavender hydrosol mixed with witch hazel. I've been using it as a toner, and also as a body mist. No adverse reactions, just fresh, clear skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Rabbit",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Be careful if you have very sensitive skin!",
      "text": "My first week of using this product, my skin was absolutely horrible and covered in breakouts as a result of this. I have very sensitive skin on face and new products tend to do this. However, I now use it 1-4 times a day on a cotton round and my skin isn’t perfectly clear but it helps a lot with oiliness, redness and acne. However, please do not buy this thinking it is a miracle product as many blogs proclaim. From my experience, it doesn’t clear your skin but it does help with oil!",
      "rating": 5.0,
      "verified": true,
      "author": "Audrey",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Lavender smells great",
      "text": "I used to use cucumber, but it was sold out so I got this one and I like it better. Only thing was when I opened it, somehow the piece that sticks out from the top that plugs the hole, broke off. So now I can't close the flip top lid. But aside from that i love it. I have sensitive skin and it doesn't bother me. Witch hazel isn't moisturizing to me so I still have to use maracula oil after.",
      "rating": 5.0,
      "verified": true,
      "author": "VA",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Use it Daily Since Purchased!",
      "text": "I bought the lavender scent and I love it! The scent smells so good and I have been using it daily since it arrived. I have been using it in the morning after cleaning my face for almost two weeks and I slowly notice very minor changes on my skin. It keeps my skin fresh. I will continue to use it daily and hope for a more notable difference. So far, it is a happy experience with this skin product.",
      "rating": 4.0,
      "verified": true,
      "author": "Ms. CYC",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Wonderful for people with extreme allergies/sensitivies",
      "text": "I have major allergies and sensitivies to nearly all cosmetics, even those designed for people with the most sensitive skin. This is one of the few products that I have been able to add to my daily beauty regimen, and I am in love! I've even purchased it for our preteen, to add to their daily self care routine. Highly recommend this, and will definitely be a repeat purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Karla C.",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Great for oily skin",
      "text": "I have oil skin so it takes me a while to find good quality skincare products that work for me, and Thayers' Toner is 100% my toner of choice. I break out a lot less often than using other toners and it works great as part of a morning and night routine, as well as midday by itself to remove excess oil if you have oily or combination skin like myself. Per ounce its easily the best value in toner and still the of the highest quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "Ramiro Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Has become a staple in my skin routine",
      "text": "Love this stuff! I just pour a little but into my hands and then rub onto my face after washing (I find this helps make it last longer since you're not losing any to a cotton ball, etc). I use 1-2 times per day and it makes my skin clear and moisturized. That said, I usually layer an additional moisturizer on top during winter months.",
      "rating": 5.0,
      "verified": true,
      "author": "clarke",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Works great but scent is off",
      "text": "I love Thayer's witch hazel. It is an excellent product and is a standard in my skin routine. That said, the lavender witch hazel smells to me like alcohol and sunscreen. It isn't very lasting so I use it anyway, but the smell is not my favorite. Overall though as far as effectiveness goes this product is an excellent morning cleanser/toner. I wipe my face clean with this in the mornings and my skin texture has absolutely improved.",
      "rating": 4.0,
      "verified": true,
      "author": "Emma",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Will buy again! Smell is perfect!",
      "text": "The scent isn’t too overpowering, and I love the witch hazel! I actually bought it for my postpartum padsickes not realizing on the bottle it said “toner” not sure if that makes a difference but it worked great! I’ve always used witch hazel as a toner but the smell of this one is great and it’s alcohol free which ones I’ve used in the past weren’t. I will be buying this again!",
      "rating": 5.0,
      "verified": true,
      "author": "@fivefreespirits",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Wonderful",
      "text": "This actually is quite fabulous. The description for this seemed to be a hyperbole, but it does do wonders. I like that it doesn't have alcohol because it doesn't ever hurt when I use it to clean my face. And it's always the best feeling to use it when you get out of the shower, and still find a bit of excess on the pad. Like woo! Really cleaning my face over hur. Thanks Witch Hazel.",
      "rating": 5.0,
      "verified": true,
      "author": "Katelyn",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Smells great, works great!",
      "text": "I was a little skeptical about getting this as my skin is combination skin. Sensitive, dry and oily all at the same time. It smells great, and when I have to wear a mask for 16 hours a day, it is a great little refresher through out the day",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Great Toner",
      "text": "I have used Thayer's Alcohol-free toner for about a year and I love the stuff. I have tried both the cucumber and lavender and prefer the lavender as it's scent is subtle. The cucumber scent is not bad, but it has a more apparent scent. Lavender is also my favorite scent. I will definitely stick with this toner. It helps keep my skin clear with regular day and night use. Since I have combination skin, I use this with a daily face moisturizer and night cream, Neutrogena's Rapid Wrinkle Repair, and the results are not overly dry or oily. Will continue to buy for clear, radiant skin!",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Scent wasn’t pleasant to me",
      "text": "After trying the cucumber scented witch hazel from this brand I decided to order the remaining two scents as they have different benefits. This one doesn’t smell like lavender. It smells like when you put Nair on to remove hair. This is, in my opinion, the worst scent. It works well though and maybe others would enjoy the scent.",
      "rating": 4.0,
      "verified": true,
      "author": "Krissi",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Great for oily skin",
      "text": "After two weeks my family was commenting on how good my skin looked unprompted. The alcohol-free aspect is amazing. I feel clean and refreshed, and it goes beyond just feeling good because it actually works. I've had awful acne my whole life, but now my regimen is just this and an oil-free moisturizer (I recommend Neutrogena). I use it at least once a day, normally after I've showered and when I feel greasy.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen S.",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Holy Grailllll Toner!",
      "text": "Thayers Lavender was the first thayers product I’ve used and I fell in love! Threw away all my upscale toners and replaced it with this item! This toner has left my face feeling balanced and clean. I absolutely love it! It has even shrunken my pores. I would totally recommend this for anyone with troubled skin or anyone who has a good skin regime. Buy it now!",
      "rating": 5.0,
      "verified": true,
      "author": "Tahreer",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Wonderful product",
      "text": "I have been using Thayers alcohol free witch hazel for many years. I would not use any other brand. Other brands have a certain amount of alcohol in it. This has none. The Lavender and Rose are my favorites. I have both of them and use one or the other every morning as an astringent. smells great and very gentle to my skin. I would highly recommend this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "D. J. Williams",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Great Purchase",
      "text": "It comes in the traditional bottle and smells lovely. I used a few bottles of the rose petal scent prior to this one and wanted to try something a bit new. It is just as great and is an important part of my daily skincare routine. It's a pretty big bottle so it lasts a decent amount of time and I will continue to buy it when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Add to your postpartum sitz baths right now!",
      "text": "Make sure you put this in your postpartum sitz baths!!!! I will be adding this to all my friends new mommy care packages! The lavender and aloe in work wonders for helping you heal quicker down there.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Sussman",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Best I've Ever Used",
      "text": "This is by far the best toner I've ever used, and I've used dozens upon dozens. It helps with redness quite a bit! It also doesn't promote break outs, it doesn't feel like you need to rinse your face after use like a lot of toners do...it just leaves my skin feeling VERY soft, refreshed, and clean. Loyal customer here. <3",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Great for oily skin",
      "text": "I have super oily skin and this product is able to keep it in check. I put cotton pads in a small container and pour this on top. I carry them in my purse and use twice daily. This product smells good and keeps my face oil free without over drying. I havent had a break out since I started using this and I have acne prone skin. I love this product. Thank you Thayers!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Love this! Will buy again!",
      "text": "I’ve been using the lavender version of this, and I love it! I wouldn’t use it alone to take off your makeup, as it doesn’t get everything totally clean, but it’s great as a toner. It definitely calms down my breakouts and makes them less red and swollen, and it seems to make them heal faster too. Not to mention it smells sooooo good!",
      "rating": 5.0,
      "verified": true,
      "author": "Tess",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Wow this stuff is amazing!",
      "text": "I’ve been using this for several weeks now and I’m beyond impressed. I’ve always had a combination of very oily skin with dry spots and sensitive skin. Half the products I’ve tried have given me a rash for whatever reason. This stuff is AMAZING. I have started using this in the morning and night and my skin has never looked better, I haven’t had a single pimple in weeks and my skin is far less oily. I got the lavender scent and it smells incredible. I’ve even stopped using a face wash, just water and a wash cloth then apply this afterwards. This stuff is worth every penny- get it!",
      "rating": 5.0,
      "verified": true,
      "author": "Tony & Katelyn ",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Lavender Love...",
      "text": "I looove the lavender version of this product. I started out with the Rose version then Cucumber and finally Lavender. It was my favorite out of the bunch. The scent is lovely and does not irritate my adult acne prone skin. I use a Benzoyl Peroxide face wash every other day which causes temporary facial redness. This product calms my redness immediately. I use it daily Morning & Night. Without regular use I notice an increase in breakouts around my chin area and hairline. Tip: I put mine in mini spray bottles for a quick refresh spritz on the go and regular use. It helps me stretch the product out.",
      "rating": 5.0,
      "verified": true,
      "author": "Cristal Catalano",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Bacterial Skin Infection",
      "text": "DO NOT USE THIS PRODUCT, especially not from this seller. I ordered this product and immediately began using it. I noticed that it was very harsh on my skin, it would be really red after putting it on. It would get better after a couple hours, but still not right. I discontinued use after a few days. One day after stopping, I developed a bacterial skin infection. After one week of antibiotics the sores started to heal, it's been 5 weeks and I am still healing from it. There was some kind of bacteria in this toner that got into my skin. DO NOT BUY FROM THIS SELLER.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily S.",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Amazing witch hazel toner - highly recommended",
      "text": "I absolutely love this witch hazel toner. I've been using it every day, twice, even three times a day, for the last two years. I swear by it and truly am amazed at the dirt it takes off even after you've used a make up wipe and washed your face. It smells great - although I do recommend the Rose witch hazel, which I currently use. A natural, great remedy for oily and acne-prone skin. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "VDN",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Love love love.",
      "text": "My favorite store bought toner. Very gentle on sensitive skin. I like to put it in a spray bottle and keep in in the refrigerator for after I cleanse my face.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Marie Hansen",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Best toner I’ve ever found. Cruelty Free!",
      "text": "This is the best toner I’ve ever used. My skin always feels so nice. I use it in the morning and night, and it doesn’t dry out my skin. The lavender and rose scents are both great. I like that it’s more natural and cruelty free. I’m switching over to cruelty free cosmetics and facial products, so I’m glad I can keep using this.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Jo",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Smells great works beautifully!",
      "text": "I ONLY use Thayers Witch Hazel on my skin. It’s cool and refreshing and a little goes a long way. I actually like to transfer mine into a spray bottle to use less and perfect for travel. I love all the scents but Lavender is one of my favorites.",
      "rating": 5.0,
      "verified": true,
      "author": "M.W.",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Happy with results!",
      "text": "I love the scent and it works great! I can see on the cotton ball that I use that it cleans my skin well and removes dead skin. Afterwards my face has a tight, clean, and moisturized feeling! I’m a few days into using this and I feel like my pores are shrinking already.",
      "rating": 5.0,
      "verified": true,
      "author": "MN",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Wow Amazing Product",
      "text": "I've had this for 2 days so I cannot attest to the effects of the product but as soon as I opened the bottle i knew I would be obsessed! I purchased the lavender scent and it is just wonderful. It smells so clean and pure- like nothing I've ever experienced before. Almost indescribable. Something about it just makes me happy and calm. Definitely something my skin will benefit from!! New fan of Thayers! Would be interested in trying the cucumber. I would give it a try if you are unsure.",
      "rating": 5.0,
      "verified": true,
      "author": "Nat",
      "helpful_votes": 0,
      "publication_date": 20170715
    },
    {
      "title": "If you like toner, use this!",
      "text": "I finally caved and got this toner! The lavender scent is soooo nice! It's really refreshing! I apply it with a cotton pad after I've cleaned my face in the shower. My pores have noticeably gotten smaller! I follow it up with a moisturizer because that's the extent of my skincare routine and I've had less breakouts! Be wary if you have super sensitive skin!",
      "rating": 5.0,
      "verified": true,
      "author": "Erica G.",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "This product has NO perfume",
      "text": "Nice gentle aloe Vera with the witch hazel felt nice on the skin. Completely odorless , small 12oz bottle very high price compared to the usual drug store brand. I would love to see a review of someone who smelled the Lavender.",
      "rating": 3.0,
      "verified": true,
      "author": "sara kurtz",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Dried my skin",
      "text": "This did not work for me. Every time I used it it dried out my skin, I tried using it once a week and the area around my lips, nose and forehead would start flaking and was sensitive. But I kept trying to incorporate into my routine slowly but I couldn’t. The packaging is cool looking tho but pretty much useless for me",
      "rating": 2.0,
      "verified": true,
      "author": "perla",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Will buy again!!",
      "text": "Got rid of my acne and deep cleaned my skin!! I noticed a difference while using this unlike other products. I use an exfoliating face wash every day but still have acne... once I used this in addition to it I got significantly less pimples. Not to mention my completion over all was more even.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea Grant",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Definitely add to skin care routine",
      "text": "I do not use expensive products for my skincare routine however for 30 years as a toner after washing my face prior to using retinol, vitamin c and sunscreen. Almost 70 with a 50 year old face that I attribute to Thayer's.",
      "rating": 5.0,
      "verified": true,
      "author": "durangojane",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Not bad!",
      "text": "I'm partial to the rose scent of Thayer's, but I purchased this one because it was cheaper. It is still great, but I don't love the scent as much and it seems to not do as much for my redness as the rose one does.",
      "rating": 4.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "I think this is a nice product, but personally I need something a little ...",
      "text": "I think this is a nice product, but personally I need something a little more potent. The smell is heavenly & it's so refreshing to put on, but having skin that's more on the oily side, I need something a bit stronger to help keep my skin clear. I find this to be a gentle toner, & on the bright side, it didn't cause me to break out or anything. Not sure if I will buy more or not, but I'll at least use the rest of the bottle for a lighter toner in the morning before I put on my make up",
      "rating": 4.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Great skin",
      "text": "I don't know why I love this witch hazel so much. Maybe it's because it's boujee? With its lavendar scent and Aloe skin calming abilities. Oh, haven't had any break outs since I added this to my skin routine. Makes my skin look all dooy? Doey? Dewy? However you spell that.",
      "rating": 5.0,
      "verified": true,
      "author": "Genevieve",
      "helpful_votes": 2,
      "publication_date": 20190725
    },
    {
      "title": "My favorite toner!",
      "text": "This is by far my favorite toner! It’s gentle on my sensitive skin and really makes a difference when it comes to my hormonal acne. I highly recommend giving it a try!",
      "rating": 5.0,
      "verified": true,
      "author": "MandyK",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Refreshing toner",
      "text": "I use my husband's account to purchase - so did not want anyone to think he was writing a review :) I picked the Rose petal initially a year ago. I never used a toner till a few years ago. This was a nice change and very refreshing. I picked the lavender when there was a lightning deal. Same results, but I find the scent over powering. Except for this - I would buy it in a heart beat one more time. Will still be using the Rose petal toner though :)",
      "rating": 4.0,
      "verified": true,
      "author": "Durai",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Great facial toner",
      "text": "Great facial toner. Doesn't dry out at all. My 9year old daughter loves the scent and uses it for everything: to clean her ear piercings, on her stinky feet, to clean her dirty nails, to clean scratches before using ointment and a bandaid... etc... We also use it to clean French bulldog's earsI (works GREAT and he doesn't complain at all...) and facial folds, as well as gunky poodle eyes... It is a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "CAB",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Good stuff!",
      "text": "Loving this stuff! The scent is awesome, and not overwhelming. I noticed a difference within just a couple days of starting use even, and it's been great with my sensitive skin as well. Easily would recommend, so much so that I bought more in a different scent to try.",
      "rating": 5.0,
      "verified": true,
      "author": "K L",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "not worth the hype",
      "text": "just bought this stuff a week ago to try for the first time because I had been seeing/hearing about it everywhere. Used it for a week straight and it ended up giving me small pimples all along what was before a completely clear forehead. Also made my face feel even more oily than usual (I have oily combination skin). I would not purchase again.",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley Montiel",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Lovely Natural Toner",
      "text": "All of the fragrances from this brand are delightful. Witch hazel is an excellent astringent. It works well on my sensitive facial skin without drying. Removes residue left behind by cleansers. This is my favorite brand of toner.",
      "rating": 5.0,
      "verified": true,
      "author": "Gypsy Healer",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "This Stuff is Amazing",
      "text": "I bought this product on a whim, hoping maybe it would help with the natural redness that appears in my cheeks every day. Even with the first use, I noticed results. I only use it at night because I have noticed it dries my skin throughout the day if used in the morning. However, I wake up every morning and my skin tone is perfectly even--my complexion seriously looks a thousand times better. It is so soothing to the skin and has even reduced the appearance of my blemishes from past acne. I would highly recommend this product for the quality and price point!",
      "rating": 5.0,
      "verified": true,
      "author": "AK",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "LOVE",
      "text": "I love this product. I have super sensitive skin and have had a hard time with toners. Very soothing but still works. I like the scent but it's not overbearing or burns the skin. No stinging at all. Awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Susie",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Pleasantly surprised",
      "text": "I've used witch hazel as a toner before which were OK but I saw lavender and thought I'd try it. Very nice; the fragrance is not heavy and this brand does not dry my face. I like this so much I just ordered the same brand/cucumber mist. This will be my 'go-to' toner from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "StarGazer",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "great toner for a reasonable price",
      "text": "Love this toner! I apply to a cotton round and use after i have removed my makeup or after i’ve washed my face to refresh and balance my skin. I’ve definitely noticed a more even skin tone and fewer blemishes in the last month or so of using this every night. I have used the rose version in the past but really enjoy the lavender. The scent is pleasant but not very noticeable so it’s definitely not over-powering.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Works Well",
      "text": "Seems to have been doing a very nice job with my skin! It's hard to say, but I do believe my breakouts have been reduced and my skin tone has evened out. I didn't take before and after pics, and I also tend to have breakouts randomly rather than consistently, so I can't say with certainty that this is a miracle product. However I'm very happy with it and will likely continue to purchase it after this bottle is gone, which is a high review for me. It's not as moisturizing as actual lotion or moisturizer, so I often need to use both, but that doesn't bother me any!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "excellent toner",
      "text": "I like that this toner is alcohol free and has simple natural ingredients instead of chemicals that cannot be pronounced. I have very oily and acne prone skin and this toner seems to keep the oiliness and acne under control. Overall a great product and awesome price too. It works for my skin so far and I'm glad I did give it a try. For under ten dollars, I don't think you can find a better toner.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon_afficionado",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Great scent, keeps skin nice",
      "text": "I've been wet shaving for some years, and usually use various forms of alcohol-free aftershave along with an alum block. Recently a friend suggested I use witch hazel rather than Alum, and that there were lots of scented kinds and so I wouldn't need aftershave, either. I really enjoy the Thayer Lavender Witch Hazel as an aftershave, and I also apply it over my entire face every time I get out of the shower or when I wash my face in the morning or evening. It closes up your pores to tone your skin, and the lavender scent is a known stress reliever.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Goldberg",
      "helpful_votes": 2,
      "publication_date": 20140702
    },
    {
      "title": "First Time I Used This Product",
      "text": "I have used many different types of facial toners over the years. This toner works well for my 75-year-old face. It is fresh smelling, cool, and moisturizing. Leaves my skin feeling toned. RECOMMEND.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra M.",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Contains phenoxyethanol",
      "text": "Please note this contains phenoxyethanol and is apparently not totally safe for pregnant women. On the other hand, I've been using it myself and it seems to work well. 3/5 for the questionable ingredients.",
      "rating": 3.0,
      "verified": true,
      "author": "LiebermanJ",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Product is GREAT - Damaged in Shipping",
      "text": "We love witch hazel. I find many of the great Witch Hazel suggestions found online to be spot on. And, for Thayer's...this brand has never disappointed. Until the new bottle design. Same great product....love it!!! But the cap is rigid and arrived broken. I miss the old cap style which was a more subtle plastic. There used to be a contact seller button, if I recall correctly from years back. Does anyone know how I can reach the seller to request a new cap? Thank you. The broken piece snaps on too hard and is sharp. With a crippling condition in my hands, I struggle with the cap. Thank you again!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "So refreshing!",
      "text": "I LOVE this product! It has such a nice, mild lavender scent, which is calming, but not overpowering. I use it after I've cleansed my face to give it one last refreshing touch. It makes my skin glow and feel so soft and clean. I highly recommend this natural product for facial care. It also has helped with the many recent \"breakouts\" I've been having on my face ( mid-life eruptions!). This product was also delivered promptly and without damage. I have no complaints and will recommend their services. Very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 2,
      "publication_date": 20140913
    },
    {
      "title": "You can pass this for sure",
      "text": "Didnt really do anything to my skin but atleast did not exasperate my acne. Did not improve any marks or spots. Its a big bottle so i am thinking where i can use this rather than my face. I read lger it has a lot of fragrance and as an astringent wont help my skin.",
      "rating": 3.0,
      "verified": true,
      "author": "Shivani",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "My go-to face product!",
      "text": "Love this witch hazel! I use it every other day right before bed. My skin has been really clear although I can't say it's only because of the witch hazel but it really has helped clear my skin up and keep it moisturized as I suffer from dry, sensitive skin. Will be purchasing again when I run out.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather B",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Leaves skin sticky",
      "text": "Leaves skin sticky.I only use this when I’m not going to put make up on. It actually leaves a sticky feeling on my skin. Otherwise it’s effective. I have no sent in mine. So I would say unscented five stars.",
      "rating": 3.0,
      "verified": true,
      "author": "kmoran2",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Doesn’t dry out",
      "text": "I’m always surprised at how much extra make up This toner picks up off my face every night after I shower. It doesn’t sting or burn going on and doesn’t dry out my skin. The smell isn’t the best but it doesn’t linger on my skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Carly",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Works well, especially with the cleanser I use",
      "text": "I have struggled with acne my whole life. I have extremely sensitive skin that is very prone to break outs. The only products that have ever worked for me are proactive and Garnier’s SkinActive micellar cleansing water. Proactive is expensive as heck, and I needed a toner to accompany the cleanser I use. This toner worked amazing. I have never had more clear skin. Not only has acne subsided, but my skin is hydrated, and has an even skin tone.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Love it!",
      "text": "I love everything about this product. Typically when I even look at a new product my skin has some kind of reaction. This didn’t cause any kind of irritation at all. Smells amazing and feels great putting on.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Love this product",
      "text": "Love this product, it's a great natural product that truly works. It's definitely helped clear up my acne prone (combo) skin. It smells great and always leaves my face feeling refreshed. I use it at night after washing my face (it will remove any residue you didn't get washing if there is any) and before moisturizer. Then in the morning before putting on any makeup or moisturizer. It will def stay as part of my daily beauty routine!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Smells good!",
      "text": "Smells great, seems to be fine for my skin so far. Someone said in a previous review that it could be far is it doesn’t come with the black stamp letters on the bottom, but mine did! I’ll update my review after I’ve used it for a while if there’s results worth sharing!",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Enjoying this product.",
      "text": "I swore on Dickerson’s Witch Hazel for years! I kept seeing the reviews, and picked up a trial bottle at Ulta. Works great, but I’m not a fan or the rose scent. I ordered the Lavender instead. Good product. Doesn’t burn, and is great post shower/pre_moisturizer.",
      "rating": 4.0,
      "verified": true,
      "author": "Cassidy Simpson",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Works for me",
      "text": "I use for removing tinted moisturizer or anytime needing skin to feel refreshed; next best thing to cleansing with my favorite Ahava face soap. Repeat customer",
      "rating": 5.0,
      "verified": true,
      "author": "MomOf3",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Lovely Scent",
      "text": "Love the smell of this toner... SO MUCH better scent than some other brands of witch hazel. It reminds me of the scent of Johnson + Johnson baby shampoo from when I was little! (late 70's /early 80's)",
      "rating": 5.0,
      "verified": true,
      "author": "S. Johnson",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Love this, it’s my favorite",
      "text": "This is my absolute favorite brand of toner. I use it all the time to rinse the oil from my face. I add lemon & essential oils too for different seasons. It helps clean & close your pores after showers too. This limits break outs.",
      "rating": 5.0,
      "verified": true,
      "author": "Ginger",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Amazing!",
      "text": "Amazing product! I've been fighting whiteheads for a few months, especially on my cheekbones, that no amount of face washing, scrubbing or exfoliating could help.. and after 2 days of using this they are already almost cleared up. My skin looks fantastic and clear! I still moisturize but this is so gentle you could go without if you chose. Going to buy some for my 14yo stepson battling acne & see how it goes.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenni H",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Pleasant smelling toner",
      "text": "Best toner I can find. This has a very pleasant smell and it tightens the pores on my face. I just morning and night and this has been at least my 10th bottle. Love it",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Book",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "This stuff rocks",
      "text": "I have a problem with over exfoliating sometimes...so much that even the most gentle products will sting. The lavender version is honestly the ONLY thing to date that hasn't given me the slightest burning sensation whatsoever. It also smells wonderful and has just the right amount of scent.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie B.Top Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20170605
    },
    {
      "title": "Balanced Skin",
      "text": "I love this product! Non toxic, natural toner. It has helped balance my oily skin. It smells wonderful, it’s hydrating, refreshing & not sticky. It’s now a staple in my daily beauty routine.",
      "rating": 5.0,
      "verified": true,
      "author": "Fiveappleteacher",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Refreshing toner.",
      "text": "Very happy with this toner. I used it on some mosquito bites on my forehead and legs and did not experience the itching I usually have. Feels very good on my face and has a very nice scent - gives a good tingle. Still use my regular moisturizer, but have used the toner alone and it doesn't dry out my skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Frances Traver",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "So glad I found this!",
      "text": "This stuff is just perfect! It makes my skin so smooth! I have combination skin and my t-zone tends to get oily. This stuff evens it out and I haven’t had any break outs since using it. This will now be a staple in my every day routine.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Malkin",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Great to keep skin clean, and refreshing feeling",
      "text": "Great replacement for toners, skins leaving clean and refreshing but dry. Recommend using a lotion with this! Other then that this is a great product, I will recommend this! Good price for the price quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Ken Shi",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "my go to",
      "text": "by far 1 of my favorite skin care products, I give these to everyone as parts of their gifts and they also love it. worth every penny. my skin feels refreshed, clean soft and moisturized every time. removed dirt even after a good face wash",
      "rating": 5.0,
      "verified": true,
      "author": "Wender M.",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Great Witch Hazel without the awful smell",
      "text": "I always avoided Witch Hazel bc the smell of the original kind is not for me but this version smells great and has become part of my morning and night skin care routine",
      "rating": 5.0,
      "verified": true,
      "author": "Marie L",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Works very well!!!",
      "text": "This product works so well!! It’s my first time buying it. I usually bought T.J.Dickerson Witch hazel but amazon was out of stock, so I tried this and I so glad I did! I actually like it better!!",
      "rating": 5.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Fake lavender smell",
      "text": "I really like the rose petal witch hazel and love the smell of real lavender so I thought I'd try the lavender scented witch hazel. It doesn't smell like real lavender at all - it smells very \"soapy\" to me. I still love the witch hazel but I should have stuck with the rose petal scent.",
      "rating": 3.0,
      "verified": true,
      "author": "Brenda",
      "helpful_votes": 0,
      "publication_date": 20170415
    },
    {
      "title": "I love it!",
      "text": "This works great for daily use, makes your face feel so nice after. Also since it has aloe & lavender in it it is great if you have a little sun burn!!",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Thayers Alcohol-Free Lavender Witch Hazel Facial Toner with Aloe Vera Formula",
      "text": "I was looking for a new toner and when I found this in a lavender scent, I just had to try it. Smells amazing and the toner is gentle yet very refreshing on the face. I am 100% certain to but this again !",
      "rating": 5.0,
      "verified": true,
      "author": "Mary M.",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Yes to this product!",
      "text": "I was skeptical to use this toner just because I have sensitive skin. This leaves my face feeling clean and moisturized. Great product to try at least once, you'll love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Javonitalla",
      "helpful_votes": 0,
      "publication_date": 20190721
    }
  ],
  "product_meta": {
    "title": "THAYERS Alcohol-Free Lavender Witch Hazel Facial Toner with Aloe Vera Formula - 12 oz, Clear (TA0035)",
    "description": "Flavor:LavendarYour Skin Will Think You’re at a Spa. Thayers Alcohol-Free Lavender Witch Hazel Toner with Aloe Vera revitalizes the skin with a gentle, soothing formula. Thayers remarkably soothing Lavender Toner is made with lavender extract, filet of aloe vera, and our proprietary Witch Hazel extract. Go ahead: treat yourself. Lavender’s anti-inflammatory and anti-bacterial properties cleanse skin, help manage acne, calm sensitive skin, and reduce redness and irritation. Not only does lavender help calm the skin from the outside-in, the smell can physically calm you as well. Lavender is extremely gentle and beneficial for all skin types, especially those that are sensitive or acne-prone. Thayers creates the only Witch Hazel products made of non-distilled extract from the Witch Hazel shrub, maintaining the highest levels of therapeutic tannins, the mild antioxidants that help your skin look and feel its best. These natural elixirs have been a fixture in medicine cabinets for generations. Once you use them, you’ll know why.\"",
    "rating": 4.7,
    "feature_bullets": [
      "Natural Botanical Skin Toner: Cleanses, tones, and moisturizes with lavender, witch hazel extract, and filet of aloe vera",
      "Witch Hazel: proprietary extract contains 195% more tannins than competitors, tightens pores, controls acne and oil production, reduces redness and inflammation",
      "Beneficial Tannins: mild antioxidant properties, reduces irritation, balances skin pH, clears skin",
      "Conveniently Sized: 12 ounce bottle",
      "Thayers: Withstanding the test of time, since 1847"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "8 x 3 x 3 inches; 14.08 Ounces",
      "Item model number": "TA0035",
      "Department": "Men, women, unisex-adult",
      "UPC": "041507070066 885913743325 885708749174 811214887512 785923201092 090174070060 531479524044 707005323720 791537165651 772195574306 531479523986 787734795074 885129760260 885150415474",
      "Manufacturer": "Thayer",
      "ASIN": "B000PIMUR8",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Face",
      "Beauty & Personal Care",
      "Toners & Astringents"
    ],
    "price": 10.95
  }
}