{
  "website_summaries": [
    {
      "verdict": "The Venus Extra Smooth features 5 coated blades, which are perfectly balanced to glide over skin. There is also an added ribbon of moisture to help the razor shave each area easily.",
      "pros": [
        "Long-lasting blades",
        "Ribbon of moisture is enough without shaving cream for the first few uses"
      ],
      "cons": [
        "A pricey option for a razor",
        "Harder to shave smaller areas due to the bigger head size"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "More blades, less irritating strokes!",
      "text": "These are my fav razors ever and I have sensitive skin. Usually a razor for sensitive skin sacrifices the closeness of a shave but rather than adding a skin bumper and/or extra lube strip that impedes a super close shave, this razor creates a super close shave w 5 awesome blades and less irritation by needing less strokes of the numerous blades to skin to achieve a reliable close shave wo irritation of many strokes w all other razors",
      "rating": 5.0,
      "verified": true,
      "author": "Christy Stephens",
      "helpful_votes": 17,
      "publication_date": 20181012
    },
    {
      "title": "One of the best from Venus series",
      "text": "I have been using different Venus disposable razors since my first year in college, and so far this green color \"extra smooth\" ranks the top in my heart. Compared with the original blue one \"smooth\" and the white one \" sensitive extra smooth\" with aloe, or the pink one with bigger \"comfortable head\", this one is definitely the smoothest. Paired with Gillette sensitive shaving cream, I have never hurt myself a single time cutting hair on the edge of my elbow joint, which somehow happened in those perious ones I talked about from time to time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amoosa",
      "helpful_votes": 6,
      "publication_date": 20200509
    },
    {
      "title": "Works, hasn't broke yet",
      "text": "I have the worst luck with razors. This is my third one from Gillette because they all keep falling off my shelf and breaking. I'll take part of the blame for having a slippery shower shelf...butttt...I wish these things were a little sturdier. That being said, this one hasn't broke yet and it's been a month so maybe I'm turning over a new leaf.",
      "rating": 4.0,
      "verified": true,
      "author": "Leah Brooks",
      "helpful_votes": 4,
      "publication_date": 20190624
    },
    {
      "title": "Provides a Comfortable Shave and Doesn't Leave Shave Bumps Afterwards",
      "text": "My wife has used these razors for ages. She loves them and says they provide a comfortable shave and doesn't leave bumps afterwards. It's definitely nice to have them delivered as when I shop (and yes, I do most of the shopping), I don't think about them. Back to the subject at hand. I know they work well as her legs are always very soft and smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "By CJs Pirate",
      "helpful_votes": 12,
      "publication_date": 20161206
    },
    {
      "title": "The Best Razor for Women Out there!",
      "text": "Love this brand! I honestly, don't buy any other brand! Even though Venus is a more expensive product, it will save more money in the long run because it lasts forever! I usually use my razor without changing the blades for about a year. This is an excellent product! It's great for sensitive skin, and you don't have to press hard for it to work. I usually use my razor when I'm taking a shower. Its such a good product any kind of body soap will work.",
      "rating": 5.0,
      "verified": true,
      "author": "A. L. C",
      "helpful_votes": 12,
      "publication_date": 20160625
    },
    {
      "title": "Yikes! Rash for days! Never happened before!",
      "text": "Worse razon rash I've ever had in my life. It gets the hair and pivots like crazy. But after i got out of water, omg burning EVERYWHERE THE RAZOR TOUCHED! i have rashew that are not going away anytime soon, regardless of how much lotion or vaseline i put on them. 1st time using venus product, i dont require sensitive skin only products, i am allergic to nickel, lead, and silver. So if it isn't the metal, something is wrong with what surrounds the blades.",
      "rating": 2.0,
      "verified": true,
      "author": "Megan Brooks",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Good for what it is, nothing crazy special",
      "text": "It does what it needs to, just like any other shaver. The hair does stick to the soap part of the shaver which is annoying and you cannot keep the shaver face down or the soap will melt into the bathroom/bathtub surface. It doesn't shave any different than any others I have used, I have to completely shave my entire leg easily only by shaving upwards against the grain which isn't good for the skin. If i shave downwards it gets some hair only.",
      "rating": 4.0,
      "verified": true,
      "author": "Honest Reviews!",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "No Need to Pay an Arm and a Leg for a Great Shave!",
      "text": "I recently moved across the country and hadn't unloaded the \"right\" box with my Venus. It was a no brainer to order this razor again because I always experienced a consistently smooth shave. Of course, a couple of days later, my old one \"razed\" up. It will go in my travel bag. I've used many styles in my lifetime; this is a better design!",
      "rating": 5.0,
      "verified": true,
      "author": "GG",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Average razor",
      "text": "Beat part about this razor is the head of the razor which really allows you to get around the curves of the legs without nicking yourself. The moisturizer around the head of the razor is ok, it tends to break off and dry out pretty quickly which leaves it basically unnecessary. The handle is easy to hold and thicker so gives lots of control when using.",
      "rating": 4.0,
      "verified": true,
      "author": "Catherine",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "If you've had others, try this one",
      "text": "This is my brand of choice. I don't shave often- sort of a hairless wonder, but under my arms every couple of weeks and I get my shins. This is extremely gently on my underarm area and it glides over my skinny shins without nicks. I like the long handle; having tried the \"travel\" version of this brand I prefer it. Good basic at a decent price.",
      "rating": 5.0,
      "verified": true,
      "author": "lizzz",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "It does everything it claims",
      "text": "I liked this razor because of the plastic surrounding the razor for the smooth use and it covers the razor blades so you won't cut yourself as easily as the others I previously used. I recommend this razor because you can easily replace the blades rather than having to get another razor. It says it can use a lot of razor heads except for one type. I haven't replaced the razor head yet, I just got the product. But it seems pretty adaptable.",
      "rating": 5.0,
      "verified": true,
      "author": "User",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Always like Venus",
      "text": "Arrived on time. I've used Venus for years & have tried all versions. I like that it has rounded edges. Having 5 blades is great. Venus handles are easy to hold. This is a great value at almost 50% less than the exact same configuration in a store. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Deas",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Best Women Razor Hands Down",
      "text": "I’ve been using this razor for 10 years. Best razor. The only tip is you don’t want to place the razor face down bc the moisture bar will stick to the surface and I feel like it makes it last less, so always have it face up :)",
      "rating": 5.0,
      "verified": true,
      "author": "Ellie",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Shaves smoothly with bonus razor burn",
      "text": "It does shave smoothly, but there's no moisture bar protecting you from razor burn and it always irritates my skin and. It's the first razor I've had in a while that's done that and I would expect more from Venus. Get the step up from this one.",
      "rating": 3.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 2,
      "publication_date": 20180718
    },
    {
      "title": "Rusts. To much work required!",
      "text": "If you don’t have a container to protect this one the moisture stuff will peal off on the tub after use. If you flip it over so the blade lays up it rusts. I only shave my legs weekly. I have to use kitchen topper wear to protect it as rusting and or losing the moisturizer ruins the product.",
      "rating": 3.0,
      "verified": true,
      "author": "Darc",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Best one yet",
      "text": "Best razor I have used. It is much easier to not cut myself with this one compared to other similar brands I have tried. The head is wider with more trim around it, not sure if that is part of the reason. But my ankles have not been nicked in months thanks to this. Also gives a nice close shave.",
      "rating": 5.0,
      "verified": true,
      "author": "54321",
      "helpful_votes": 3,
      "publication_date": 20170311
    },
    {
      "title": "Trash!",
      "text": "This product I recieved is not like the ones I've gotten in stores. Terribly dull & not smooth at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Ivy",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Best razor ive tried",
      "text": "I was using mens razors because they shave closer but i ALWAYS cut myself around my ankles and i just got sick of it and bought this guy. Works better than i could have imagined. The shave is just as close but without the cuts and knicks at my poor ankles.",
      "rating": 5.0,
      "verified": true,
      "author": "erica v",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "So comfortable",
      "text": "I've had a Personal Touch razor my entire adult life. I last bought blades for it in 2006 and they've lasted me this long somehow. I even checked the internet to try to find more blades for it because I didn't want to give it up. (They are selling for like $150.00 haha!) so I finally broke down and got this. Uh, what was I waiting for? LOL. Technology has changed, and razors have gotten better (who knew?) and this gives such a smooth and comfortable shave. Sorry I waited so long.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Del Sesto",
      "helpful_votes": 0,
      "publication_date": 20170415
    },
    {
      "title": "Favorite women’s razor",
      "text": "I don’t like how the moisturizing stuff melts if you put it face down, so it’s important to keep it with the head up, but this is my favorite razor by far!",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonAR815",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Great razor for shaving",
      "text": "I've been using this brand of razors for years. It's really smooth on my skin and is able to leave my skin feeling smooth as well. Shaving cream is not needed, however, if you prefer it then go ahead and buy a bottle. I really like that the razor is available through Amazon Prime, because it saved me a trip to the store.",
      "rating": 5.0,
      "verified": true,
      "author": "Jasmine",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Great",
      "text": "Great razor, easy glide during shave with shave cream or soap. Leaves area soft, and clean shaved without having to going over the same areas. Definitely worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rocky",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Worst. Razor.  Ever.",
      "text": "Just choose another! This is without a doubt the worst razor ever!! It's impossible to get a smooth glide across your skin no matter how soapy your skin is. It's hard to grip and just a total nightmare.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Fritz",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Can't say it's for sensitive skin",
      "text": "A little bit firm for sensitive skin. I think it should be softer. The quality of blades are very high. Very comfortable to hold in hand.",
      "rating": 3.0,
      "verified": true,
      "author": "Just kate",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Great Product",
      "text": "I realize that with some razors the rubber looking strip is not moisturizing at all. This one is very moisturizing, has a flexible head which makes the experience better as well as the little rubbers at the button set of blades really help with that grip. I ended up purchasing more than one as a result.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffery Porter ",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Good product !",
      "text": "I have been using Venus for very long time. It is a great product, good for sensitive skin, easy to hold and great value for money! The reusable blades are easy to install.",
      "rating": 4.0,
      "verified": true,
      "author": "Swati",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Amazing!",
      "text": "I’m not sure if it moisturizes or not but i think my skin is super sensitive and since it was my first time shaving i made very little tiny cuts and gotten better after a few times, this is really easy to hold but if it’s your first time shaving still should be careful but it’s a very good product",
      "rating": 4.0,
      "verified": true,
      "author": "Lennie",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "*Smooth shaving*",
      "text": "This razor is easy to use and does a great job of getting my skin smooth. I wish it comes with a cover. Just for safety purposes.",
      "rating": 4.0,
      "verified": true,
      "author": "Ruth Ritetrus",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Wasn't impressed",
      "text": "I am looking for a razor that shaves and I don't have to EVERY day. I want a close shave and this just didn't do it.",
      "rating": 3.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Don’t bother.",
      "text": "Did not hug curves well and after trying to shave my legs with it, my legs were still prickly! Super disappointing after the good reviews this razor has.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "THE VENUS RAZOR IS THE WAY TO SHAVE",
      "text": "I love the VENUS razor. I have never cut myself shaving using the Venus razor. I've used many different types of razors. I like the way it bends back and forth when I'm shaving my knees.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Fuller",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Love this razor!",
      "text": "We have sensitive skin and this razor doesn’t dry us out or cause any issues. We love the Venus brand!",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki V.",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Shaving",
      "text": "Gets dull fast, but when you don't want to spend the money it does a pretty good job but if you could afford the better ones do it",
      "rating": 3.0,
      "verified": true,
      "author": "Exhausted pigeon",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Perfume-free👍",
      "text": "I’m really glad I got a new handle, it was just time to. Lucky I kept the old suction cup holder because this one didn’t have that part. I was glad it’s a sensitive perfume free one.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Best razor I've used",
      "text": "Seriously best razor I've ever used. Comfortable, rarely cut myself and leaves such a nice close shave. Use on all my lady parts, no slip handle is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin B",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Good quality",
      "text": "I have been using this product for a long time. Those razors are much better. They are smooth and long lasting.",
      "rating": 4.0,
      "verified": true,
      "author": "Saima",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Best razor for women!!",
      "text": "I’m so glad I bought this. Such a high quality great razor. I will be buying the refills on amazon as well. Love love love",
      "rating": 5.0,
      "verified": true,
      "author": "Allys0nn",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Always works great",
      "text": "Great price and razor. It's very rare for me to cut myself and the price is great on Amazon",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Pretty Good Razor",
      "text": "I had a few packs of the razor blades at home new in the pack, but could not find the handle. I decided to check my local place but they were out. I decided to purchase this online. I was happy with the price & shipping. Pretty good razor.",
      "rating": 4.0,
      "verified": true,
      "author": "Bobbye M Hill",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Removed Easily, Def Recommend",
      "text": "My new Favorite razor. Easily removed sensitive area course hairs. Surprised how at how much is removed easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Nice razor",
      "text": "Provides a smooth shave and it doesn’t leave me with razor bumps. It’s my favorite shaver.",
      "rating": 5.0,
      "verified": true,
      "author": "Anmllvr234",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "No razor",
      "text": "Open box. Just a handle. No razors. Not very useful...... thanks amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Katelynne D.",
      "helpful_votes": 2,
      "publication_date": 20180808
    },
    {
      "title": "Perfect razor for shaving your legs",
      "text": "I've been using these razors for 15 years and don't think I'll ever switch. Great blades, stay sharp for a long time, and I rarely get any sorts of cuts (unless it's my own clumsy fault, which has happened maybe 5 times in any given YEAR.) These also allow me to get by without using shaving cream, which I love!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily WTop Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "Adequate",
      "text": "Customer service and shipping was great however I expected to have replacement blades which this did not have",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "I got the box broken.",
      "text": "I got the box broken and it seemed that was a retuned item. MEH. Anyways because the refills were not open I didn't return the item because I needed it immediately. Even if we don't consider that, this razor does not shave easily specially in the curves of the body. You have to go again and again around the curves. It makes the shaving waste a lot more time. I had other Venus razors, and they were a lot better. I do not recommend this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Shiva",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Much better, smoother",
      "text": "Used Schick Quattro for years. Couldn’t get a close shave underarms. Decided to try this for a change.. wish I would’ve tried years earlier. Much better, smoother, closer shave and no razor burn. Very happy with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "MomOf2",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Works great!",
      "text": "Great razor... just wish it came with a way to hang it in the shower instead of it sticking to the surface of what its drying on, other than that I love it",
      "rating": 3.0,
      "verified": true,
      "author": "Linda Bradley",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Don’t recommend it ! Unless u enjoy bleeding and getting skin cuts",
      "text": "No moisture no gel ! Is rough and will get skin cuts !",
      "rating": 1.0,
      "verified": true,
      "author": "DINA",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Great Stuff!",
      "text": "Exactly what I wanted. Oddly, it was even easier than running to the store. Thank you for making it like that. I'll be back!",
      "rating": 5.0,
      "verified": true,
      "author": "Kirby Arrow",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Leaves your legs feeling soft, smooth, and with no bumps or irritation.",
      "text": "I’ve tried many different razors over the years and never been as satisfied with a razor as I have been with this one. I have very sensitive skin. This is the only razor that does not leave bumps or cause my legs to itch like crazy. It leaves my skin so soft and smooth. I will be buying these from here on out.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Great product",
      "text": "My wife switched to this from a cheap razor and it makes all of the difference. She used to complain about razor burn, bumps, rashes etc. This razor is so nice for her, she doesn’t have any of that anymore. It’s funny when the commercials are actually true and this is an example.",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie Reas.",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "not for beginners",
      "text": "this was difficult for me to use personally. I couldn’t quite get into the nooks and crannies and although it made a really smooth shave the first time it was very difficult to achieve it.",
      "rating": 2.0,
      "verified": true,
      "author": "Paisley Truitt",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Smooth",
      "text": "Absolutely love this item. Only razors I will use is Gillette's, have never used any other",
      "rating": 5.0,
      "verified": true,
      "author": "cheryl chavalia",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Venus girl! 😎",
      "text": "I would buy these again. Nice find. Love Venus razors.",
      "rating": 5.0,
      "verified": true,
      "author": "Darkstar",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Shaves VERY well, however....",
      "text": "Shaves VERY well, however, the amount of nicks and bumps I got was just crazy. If and when you use it, just be careful lol and I strongly suggest exfoliating before and after use. Also, don’t go too fast and don’t go too hard.",
      "rating": 4.0,
      "verified": true,
      "author": "MaryNel1424",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Would buy again",
      "text": "I’m a beginner to razors and this was my first one and it was the only one that didn’t give me a deep cut or a cut except for razor bumps I always had. It helped cuz it’s bigger and maybe works well with my hair type but apart from the razor bumps I would go back to this.",
      "rating": 2.0,
      "verified": true,
      "author": "qasim jaffri",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Dull and dry",
      "text": "Not smooth at all. Sticks to the shower. Feels kind of dull.",
      "rating": 3.0,
      "verified": true,
      "author": "Cynthia Cruz",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "BEST RAZOR BY FAR IVE EVER HAD",
      "text": "BEST RAZOR IVE EVER HAD!! AND ON POINT ACCURATE WITH NO IRRATATION.",
      "rating": 4.0,
      "verified": true,
      "author": "MARCO'",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "NOT SMOOTH FEELING",
      "text": "A little disappointed at the way the razors feel on your skin. I'm regretting buying it. Now I have to use it til all refill razors are done and get something else with moisturizing strips.",
      "rating": 3.0,
      "verified": true,
      "author": "colombianpaisa",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "THE DESCRIPTION SAYS I bringS TWO CARTRIDGES HOWEVER I ONLY ...",
      "text": "THE DESCRIPTION SAYS I bringS TWO CARTRIDGES HOWEVER I ONLY GOT ONE. I JJUST OPENED IT TODAY AND THIS IS WHAT WAS IN IT.",
      "rating": 1.0,
      "verified": true,
      "author": "S07D7",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "Best Razor that I have used",
      "text": "I usually by the cheap razors that are like 5-8 for a pack of 5 and was hesitant on buying this one for the price. However, I knew my skin is sensitive and I needed something that would be good for my skin and get a clean shave. I used it and it removed hair perfectly. I exfoliated afterward & my skin was so smooth, no razor bumps or irritation like other razors.",
      "rating": 5.0,
      "verified": true,
      "author": "Jae",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Great shaver!",
      "text": "My skin cuts easily and this is terrific!!!! I haven’t had a cut yet! I will continue to buy these one.",
      "rating": 5.0,
      "verified": true,
      "author": "Janelle Janke",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Comfortable women's Razor",
      "text": "I've tried a few different razor brands and styles recently, but I've come back to the Venus Embrace because it provides such a smooth shave and is easy to use while shaving around my knees and ankles. The replacement's are kind of expensive, but Venus normally has coupons floating around online, or Amazon has a deal with their subscribe and save. I'm happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "littleEwokGirl",
      "helpful_votes": 0,
      "publication_date": 20150626
    },
    {
      "title": "It’s not as good as the other Venus blades",
      "text": "This one isn’t as smooth as a shave as other Venus blades",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Works OK.",
      "text": "Works OK. So far, doesn't cut my legs shaving. But doesn't shave any closer or better than any other razor I've tried.",
      "rating": 5.0,
      "verified": true,
      "author": "Chrystel",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "This is definitely the best razor I've ever had",
      "text": "This is definitely the best razor I've ever had. However, contrary to popular belief, and advertisement, this razor does not come with a shower holder. I love the blades - they work like none other, and my leg hair tends to get quite thick. Again, this is cheaper online than any store, so it's definitely worth it.",
      "rating": 4.0,
      "verified": true,
      "author": "Dez Repse",
      "helpful_votes": 0,
      "publication_date": 20150219
    },
    {
      "title": "Great product.",
      "text": "The best shavers I've ever used. It shaves clean without leaving razor burn.",
      "rating": 5.0,
      "verified": true,
      "author": "Shiffy weinberg",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Worth every penny!",
      "text": "Ahhhh! Finally! A product that results in smooth skin, great shave, no nicks and no razor burns! I’m so glad I purchased this product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sugar73bj",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Love this!",
      "text": "I used this with the Gillette Women's Shaving Cream and the combination of these two was the best ever!",
      "rating": 5.0,
      "verified": true,
      "author": "movielover",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Feels nice. However",
      "text": "Feels nice. However. Not close enough shave for my legs. For the cost of replacements. But all of them are to expensive imho. Thinking of going the epilator route.",
      "rating": 3.0,
      "verified": true,
      "author": "clcfla",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Great price and awesome product",
      "text": "Super amazing if you have sensitive skin no razor bumps or cuts love it",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Good",
      "text": "Pretty good razor. Works well and the sharpness lasted long so that’s good. Easy to hold and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Khorshid McLaughlin",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "As expected",
      "text": "blade does not last long. but does the job as always",
      "rating": 4.0,
      "verified": true,
      "author": "Toni House",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "High Quality",
      "text": "Love this razor! Glides easily and the multiple blades allow for a close shave with minimal irritation",
      "rating": 5.0,
      "verified": true,
      "author": "Meesh628",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Misleading number of blades included.",
      "text": "This listing is titled as a razor with two refill blades but when it showed up, it was a handle for the razor only with two refills on the side. I expected to recieve a handle, with a blade head attached AND two additional blades to refill it when the original one was no longer of use. That is what \"refill\" means afterall. I have used this style of razor before though and it does last a long time. Almost seems like it lasts an eternity compared to the cheapy disposable ones. I throw the blade out when it doesn't seem sharp enough. The refill blades are interchangable between other Gillette Venus handles.",
      "rating": 2.0,
      "verified": true,
      "author": "Roxy",
      "helpful_votes": 5,
      "publication_date": 20170624
    },
    {
      "title": "Smooth shave",
      "text": "Smooth and light as a feather. My legs are happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Judi White",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Don’t like ones with soap attached",
      "text": "Not what I thought. I do not like the ones with soap around the head part. Wasn’t clear that it was that kind.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Rowley",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "not happy!!",
      "text": "not smooth at all the blade are really sharp yes, however they are painful.",
      "rating": 2.0,
      "verified": true,
      "author": "Tee",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Smooth",
      "text": "I love Venus razors and having 5 blades is great for a clean shave!",
      "rating": 5.0,
      "verified": true,
      "author": "Kalynn",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Cuts close but doesn't nick",
      "text": "Shaves very easily even in hard to reach places and over odd shapes",
      "rating": 5.0,
      "verified": true,
      "author": "Shiratha",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Great shave",
      "text": "Best razors if any I have tried and less waste since the head can be replaced but you can keep using the handle. Close shave - no nicks!",
      "rating": 5.0,
      "verified": true,
      "author": "netkat",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Best inexpensive razors out there!!!",
      "text": "These are my new holy grail razors!! I love them. I have thick, dark, coarse body hair all over and these razors leave my skin feeling SO SMOOTH. Even without shaving cream. Amazing especially for the price!!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Rebeiro",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Did not come with razor head!",
      "text": "My razor didn’t come with a razor attached - just two extra cartridges! It was opened when I got it. What do I do???",
      "rating": 1.0,
      "verified": true,
      "author": "Mckaela Schmidt",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "DULL- wouldn't even shave!",
      "text": "I love these razors from the store, but these ones were DULL right out of the box! Don't buy razors off Amazon! FAKE product",
      "rating": 1.0,
      "verified": true,
      "author": "Tl",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "I really like this razor compared to the others",
      "text": "I really like this razor compared to the others. It works amazing the first couple of days, but then I find that it's not as smooth anymore. I guess I need to change the refills more often.",
      "rating": 4.0,
      "verified": true,
      "author": "Davion",
      "helpful_votes": 0,
      "publication_date": 20160518
    },
    {
      "title": "Amazing",
      "text": "I loved this razor, it was smooth and gentle on my skin...HUGE difference from a different Venus model that I replaced. This will be my go to from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "LadySnow",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "The amount of blades is perfect though.",
      "text": "Doesn't get a very close shave due to the hydration strip. The amount of blades is perfect though.",
      "rating": 3.0,
      "verified": true,
      "author": "Deez Nizzles",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Four Stars",
      "text": "I love this razor. The price for replacement cartridges is ridiculous, but I keep coming back anyways.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Venus 5 blade razor",
      "text": "Love the smooth shave with the 5 blades. Much smoother than 3 blade models.",
      "rating": 5.0,
      "verified": true,
      "author": "cmwillms",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "No different than regular no name brand",
      "text": "not as great as i thought gives me really hard hair growth and not as easy to use as i thought",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Not satisfied",
      "text": "Blades are dull, left stubble. Not up to par for Venus!",
      "rating": 3.0,
      "verified": true,
      "author": "deb",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Good but could be better",
      "text": "I liked this razor however after one use the gel strips were deformed from being wet and made my next shave not as close.",
      "rating": 3.0,
      "verified": true,
      "author": "Kayla B ",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "this one is perfect for bikini area",
      "text": "I have been trying all kinds of brand for shaving bikini area, and I am finally found the one in my mind! this one is perfect for bikini area! work smoothly, and perfect for sensitive skin like mine!",
      "rating": 5.0,
      "verified": true,
      "author": "Fynn",
      "helpful_votes": 0,
      "publication_date": 20160314
    },
    {
      "title": "Sexy legs",
      "text": "Love it. It’s help me not have a boo-boo on my knees. Keep my legs Smoove longer",
      "rating": 5.0,
      "verified": true,
      "author": "Bitsy kamps",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Product gives a great shave.",
      "text": "The Venus Embrace really does a good job following the curves of my legs and under arm area.It doesn't fit on older versions. The packaging was manageable and not excessive. There is a suction cup holder so you can store it in the shower conveniently.",
      "rating": 4.0,
      "verified": true,
      "author": "penny's from heaven",
      "helpful_votes": 0,
      "publication_date": 20140411
    },
    {
      "title": "Fair",
      "text": "It doesn’t seem to last as long as other Venus models",
      "rating": 3.0,
      "verified": true,
      "author": "Loren W. Christensen",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Haven’t found a better razor",
      "text": "My favorite razor to use. Leaves my skin nice and smooth!",
      "rating": 5.0,
      "verified": true,
      "author": "Alexis Lemus",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "It works",
      "text": "My wife loves it, haven't had any problems with it yet",
      "rating": 5.0,
      "verified": true,
      "author": "russell",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Decent",
      "text": "Great razor. My only complaint is that the razor blades cost so much.",
      "rating": 4.0,
      "verified": true,
      "author": "Catherine Ishmael",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Great combination of razor, refill blades, and holder",
      "text": "The razor works perfectly for shaving in the shower. Nice to get refill cartridges with the razor too, and the self-stick razor holder is perfect to keep the blades dry and sharp for as long as possible. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "LindyLouTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20141223
    }
  ],
  "product_meta": {
    "title": "Gillette Venus Extra Smooth Green Women's Razor Handle + 2 Blade Refills",
    "description": "Venus razors for women are designed with a woman’s body in mind. From handles designed for a comfortable grip to pivoting heads that contour to curves, Venus razors are designed to help reveal touchably smooth skin. Enjoy a close, controlled shave with Venus Extra Smooth razors. With five blades for super close shave, and an ergonomic, soft grip handle that perfectly fits your hand, you’ll experience skin that feels smoother for longer (vs Venus Smooth). The water-activated ribbon of moisture around the blade helps protect from nicks and cuts. Did you know that any Venus blade refill fits any Venus razor handle? Shave your way without buying a whole new Venus handle.\n\nFROM THE MANUFACTURER\nGillette Venus Embrace is created with 5 razor blades to hug every curve and get virtually every hair. The result is an ultra-close shave and unsurpassed Venus smoothness.",
    "rating": 4.6,
    "feature_bullets": [
      "5 BLADES for a long lasting shave",
      "ERGONOMIC METAL HANDLE with anti-slip grip for control",
      "REFILLS FIT ALL VENUS RAZOR HANDLES",
      "The water-activated RIBBON OF MOISTURE around the blade helps protect from nicks & cuts",
      "PIVOTING, ROUNDED HEAD hugs curves and fits easily into hard-to-shave areas",
      "LUBRASTRIP FOR GLIDE"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "2.2 x 2.2 x 7.95 inches; 1.6 Ounces",
      "Item model number": "75031022",
      "UPC": "047400098961",
      "Manufacturer": "P&G",
      "ASIN": "B000XVSNTQ",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Shave & Hair Removal",
      "Women's",
      "Razor Systems",
      "Beauty & Personal Care",
      "Razors & Blades"
    ],
    "price": 9.97
  }
}