{
  "website_summaries": [
    {
      "verdict": "This milk cleanser’s array of organic oils and botanical extracts work wonders for cleaning and hydrating dry skin.",
      "pros": [
        "Grapeseed oil, aloe, and sunflower oil combine to hydrate and cleanse",
        "Rich in Vitamins C, E, and B5",
        "Organic sesame oil soothes and softens skin",
        "Effectively cleans away makeup without drying out skin"
      ],
      "cons": [
        "Its worst quality is its fairly high price tag"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I absolutely love it and it did wonders for my skin",
      "text": "I bought the juice beauty organic kit and it included this face wash. I absolutely love it and it did wonders for my skin. However this one I ordered causes burning, itching, and extreme redness with my skin. I believe this product is fake and not the real cleansing milk.",
      "rating": 1.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 20,
      "publication_date": 20180114
    },
    {
      "title": "FAKE - Do not order!",
      "text": "I ordered this product that I have been using for years, so I know it VERY well. I had a gift card and thought what the heck I will order thru amazon. Product was not true juice beauty. I even took the bottle to Juice Beauty and CONFIRMED that it is FAKE. The texture was greasy, the smell was not right, the sensation after you wash was not there and the bottle labeling was incorrect. DO NOT ORDER as you are just getting ripped off. I am super angry over this. I also ordered the green apple gel face wash and it was the same.",
      "rating": 1.0,
      "verified": true,
      "author": "Robyn Diamond",
      "helpful_votes": 6,
      "publication_date": 20200512
    },
    {
      "title": "Fake?",
      "text": "This appears to be a knockoff. The logo looks different than the one I bought at ULTA.",
      "rating": 1.0,
      "verified": true,
      "author": "Brooke N.",
      "helpful_votes": 20,
      "publication_date": 20170523
    },
    {
      "title": "Great cleanser!!",
      "text": "First off my skin type: super frustrating is what I would describe it as. Very oily around my nose, very dry on my forehead and eyebrows. Sensitive and acne prone to boot with big pores and redness (do I sound pretty yet?). Anyway, finding skincare that doesn't dry out my dry patches or act up my acne but still cleanses is very difficult. This totally does the trick!!! It cleanses without drying bUT still feels clean and doesn't exacerbate any redness or acne. Totally recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Molly Copenhaver",
      "helpful_votes": 7,
      "publication_date": 20170103
    },
    {
      "title": "... during the start of my pregnancy and it worked great. bought a starter kit from whole foods initially ...",
      "text": "i bought the juice beauty cleansing milk and nutrient moisturizer to help combat skin issues during the start of my pregnancy and it worked great. bought a starter kit from whole foods initially and upgraded to the full size shortly after w/ amazon. needed a second cleansing milk just for the sake of convenience, i.e. one in the shower and one on the counter. HOWEVER, the second one i bought always feels like my face is burning afterwards. and it certainly looks red and angry. goes away, but this can't be normal. lack of lot to lot consistency warrants at least a two star deduction.",
      "rating": 3.0,
      "verified": true,
      "author": "Juliana",
      "helpful_votes": 6,
      "publication_date": 20170818
    },
    {
      "title": "My favorite face wash",
      "text": "For those who havent used this before, it is an amazing product. A few years ago, I realized my skin was sensitive to fragrances and alcohols and I was desperately trying to find skincare that worked for me without breaking me out. I am so happy to have come across this product. Thank you for making sure this bottle was shipped with care!",
      "rating": 5.0,
      "verified": true,
      "author": "Mandy",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "May not be authentic Juice Beauty",
      "text": "I have purchased this cleansing milk several times and usually love it. However, this most recent delivery the scent of the cleanser was completely different and the packaging was slightly off. I'm afraid it's not authentic. Beware!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20171211
    },
    {
      "title": "Clean active everyday cleanser",
      "text": "Ingredient list is why I choose Juice Beauty - clean. I have acneic, oily + combination skin type. This is a trusty standby for AM cleansing and post-make-up wipe cleansing in PM. After almost every wash, my skin does redden. This does not worry or deter me from use because the reddening provides mild acid exfoliation and improves circulation in my face. Within 2 minutes the blotchy redness evens with rest of my skin tone and just feels vibrant.",
      "rating": 5.0,
      "verified": true,
      "author": "Willis Household",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Smells good, feels good, love it",
      "text": "Amazing. This is truly a milk face wash. It's very creamy and rich. It does not act like regular suds soap, it gently cleans my face and removes makeup with just good oils. Washing my face with oil has always helped my completion. This face milk cleanser is a god send. I would recommend it to all skin care types. I use one or two pumps and slowly rub it around my face in a circular motion. I take my time to let this gentle cleanser do it's job :-). I've been using it night and day with zero breakouts",
      "rating": 5.0,
      "verified": true,
      "author": "SD buyer",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Terrible.",
      "text": "This is definitely fake. Look at the logo and then go to the website. Terrible.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20171220
    },
    {
      "title": "Silky milky moisturizing cleanser",
      "text": "I really like this cleanser, it's very silky and \"milky\". It feels more creamy than other cleansers I have tried. It's almost like a moisturizer that you use as a cleanser. I love that it's organic and free of toxins, and my face feels smooth after use. I also like that I dont need to use a full pump, half a pump is more than enough to wash my face, behind ears and decolletage. I think using this cleanser along with doing a nightly yogurt mask has help improve my skin..no more dry spots and havent had a breakout yet. A++ in my book :)",
      "rating": 5.0,
      "verified": true,
      "author": "Captain Awesome",
      "helpful_votes": 16,
      "publication_date": 20110811
    },
    {
      "title": "NOT THE SAME!!",
      "text": "This is not the same as the products from juice beauty website! I’ve been purchasing from their website and because they were sold out I turned to amazon. The texture of it is different, it’s much more liquid like and burned my face when I used it! It smells different too. I was able to compare side by side with the left over of my previous one, THEY ARE NOT THE SAME PRODUCT. After a week of use I started to get what seems to be dermatitis on my face. So I threw it away. Buy from the website only and avoid make up on amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "But the third it made my face felt like burning and all red",
      "text": "First time I used it on my face was okay, second time I used my face started getting a little bit red. But the third it made my face felt like burning and all red. Apparently I'm allergic to some ingredients of this cleanser. I thought Organic ingredients won't cause skin allergic :( too bad. And I don't even have super sensitive skin. Juice beauty is just not right for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Peach",
      "helpful_votes": 3,
      "publication_date": 20160823
    },
    {
      "title": "So mild and easy on the skin!",
      "text": "First of all, I do not wear a ton of makeup. This cleanser is so mild which is great for sensitive skin like me. I don't know if it's because of this product, but I feel like my acne prone skin has cleared up a lot. And not to mention the great price and natural ingredients like chamomile (which is used for baby skin too). I think I found my favorite cleanser!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Lee",
      "helpful_votes": 4,
      "publication_date": 20141120
    },
    {
      "title": "not my favorite cleanser. I have several other Juice Beauty facial ...",
      "text": "Ok item, not my favorite cleanser. I have several other Juice Beauty facial products that are GREAT. This just isn't for my skin, I guess. It feels slimy on my face while using it, and afterwards my skin feels oil-coated.",
      "rating": 3.0,
      "verified": true,
      "author": "MotherChickie",
      "helpful_votes": 2,
      "publication_date": 20170327
    },
    {
      "title": "Gentle and “clean” product",
      "text": "Very creamy and milky consistency. Hydrates face after use like you have a moistures on. Love this line because it is clean and toxin free. My wife uses it as well and only wishes it removed mascara, eye liner better.",
      "rating": 4.0,
      "verified": true,
      "author": "Weelosh",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "This product caused an allergic reaction. After applying, ...",
      "text": "This product caused an allergic reaction. After applying, it turned my face a dark red (which lasted about 30 minutes) and I experienced a burning sensation which also lasted for about the same length of time. Also, there is no option to choose to return this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Karyn",
      "helpful_votes": 3,
      "publication_date": 20171012
    },
    {
      "title": "Cleans well and so happy with the ingredients",
      "text": "Cleans well and so happy with the ingredients. Is great for sensitive skin and thoroughly cleans makeup off, even eye makeup. Has not blocked my pores and it is not heavy in consistency. I have already ordered my second bottlle.",
      "rating": 5.0,
      "verified": true,
      "author": "DelJL",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Did the formula change?",
      "text": "Just received a new bottle, smells strongly of grapefruit. I don't remember the old one smelling like that? Still a solid product, very low to no sudsing, very moisturizing, works well to remove makeup.",
      "rating": 4.0,
      "verified": true,
      "author": "Valerieah",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Great cleanser",
      "text": "I have been using this cleanser for years to take my make-up off at night. It is completely non-irritating to my skin and gently removes eye make-up with no stinging or burning.",
      "rating": 5.0,
      "verified": true,
      "author": "The Purple Onion",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "FAKE PRODUCTS",
      "text": "Got it in the mail today and immediately noticed the difference in appearance. The font/design on the bottle is wrong. The smell is awful and it comes out like liquid instead of a creamy consistency. Really disappointed. The moisturizer is fake as well. Do not buy from this seller!!!",
      "rating": 1.0,
      "verified": true,
      "author": "adriel",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Don't buy from this seller",
      "text": "I love this product, it's excellent for my skin. However, the selling must've thought I was a chump because they definitely mixed something in here. As a person that uses this product everyday I know what the consistency and smell of this product is and this was not it.",
      "rating": 1.0,
      "verified": true,
      "author": "Rberger",
      "helpful_votes": 6,
      "publication_date": 20160910
    },
    {
      "title": "DOES NOT remove make up like it states",
      "text": "It states on the bottle itself that it \"removes makeup\" and it DOES NOT remove one bit of make up! I was so excited to use this product to take off my make up and hydrate my skin all in one, but after I was done using the face wash, I still had a full face of make up on still! I don't even wear a lot of make up (mineral powder foundation, some eyeshadow, and blush). VERY disappointed in this product!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Doesn’t lather",
      "text": "This doesn’t lather and feels rather like smearing hair conditioner on tour face. A return for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole D.",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Organic",
      "text": "I live this cleanser. It leaves your face silky smooth without overdrying it. There are no overpowering scents either.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole P.",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "LOVE IT",
      "text": "I use this as a daily cleanser...whenever I wash my face. The way I really realized how well It worked for me was when I ran out and did not use it for a month. My skin did not feel as good or look as good as when I use it. I am 49 years old and this keeps my skin feeling good and smooth..hydrated too. I have larger pores and this seems to diminish that as well. I will never allow myself to run out of it again.",
      "rating": 5.0,
      "verified": true,
      "author": "pamj",
      "helpful_votes": 5,
      "publication_date": 20130516
    },
    {
      "title": "Not the brands best",
      "text": "This is one of the my lesser favorites of the juice beauty brand. I love the exfoliating cleanser & my face always felt clean after washing with it. This wash just doesn't perform as well. I will definitely be going back",
      "rating": 3.0,
      "verified": true,
      "author": "yogagirl13",
      "helpful_votes": 0,
      "publication_date": 20160127
    },
    {
      "title": "Burns my eyes, doesn't so a fantastic job of removing makeup",
      "text": "Okay so it burns my eyes and does not remove natural mascara. I don't use waterproof products either, so that is not an issue. I wanted something to use in conjunction with my clarisonic and I'm not impressed. For how much this product costs, it's a disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "This is the best face cleanser I have ever used",
      "text": "This is the best face cleanser I have ever used! It looks pricey on the page, but each use of this cleanser is so small that it competes with lower priced cleansers very well. The feel and texture of my skin has been significantly improved right away.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Engelman",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "Product is Not From Original Manufacturer!",
      "text": "If you're a regular Juice Beauty user, you are very familiar with the texture and application of this product. Whatever I received is a \"knock-off\" and was delivered in a plastic zip-lock bag with no labels. Buyer beware!",
      "rating": 1.0,
      "verified": true,
      "author": "Dwain J. Kyles",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Absolutely love this product",
      "text": "Absolutely love this product. I have combination skin type and this is neither too oily or too dry. You will want to use a make-up remover in addition to this cleanser but that's nothing new for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "Just ok",
      "text": "OK product, there are other similar washes for less $ out there. When there was about 1/8 of product left, the pump did not reach it, I had to unscrew the pump and get it out by hand. Annoying considering I spent $22 on it!",
      "rating": 3.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "I like the ingredients but this face wash doesn't wash off ...",
      "text": "I like the ingredients but this face wash doesn't wash off well. It's a bit too oily for me and it doesn't remove make-up well. Although I like this brand I won't be ordering this product again.",
      "rating": 3.0,
      "verified": true,
      "author": "Christyb",
      "helpful_votes": 0,
      "publication_date": 20150710
    },
    {
      "title": "Terrible for sensitive skin",
      "text": "Horrible. Felt like a chemical peel, face turned completely red and burned for about a half an hour after using it.",
      "rating": 1.0,
      "verified": true,
      "author": "DB",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Good cleanser (just not for removing makeup)",
      "text": "Pleasant smell and does not dry out skin. Not great for removing makeup, if you wear makeup you will have to also use another product.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Slyter",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Great for sensitive skin; leaves it feeling super smooth!",
      "text": "I have super sensitive skin and this makes it feely very smooth and never irritates me. I've been using it for 6 months now and I won't switch to anything else. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151119
    },
    {
      "title": "I love this product",
      "text": "For my normal-to-dry 30+ skin, I love this product. And when the pump didn't work, the company quickly sent me a new one. Plus I love the stem cellular moisture sample they sent with the cleanser. I may officially be a Juice beauty convert.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Meyer",
      "helpful_votes": 0,
      "publication_date": 20150106
    },
    {
      "title": "This is my new favorite cleanser, because it gives a deep clean without ...",
      "text": "This is my new favorite cleanser, because it gives a deep clean without drying the skin. A lot of cleansers claim to do that, but this one actually delivers. Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Langer",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "I love this stuff",
      "text": "I love this stuff, have never had a bad reaction, makes my face feel clean and I think really helps with my sensitive skin.",
      "rating": 5.0,
      "verified": true,
      "author": "ElizabethR",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "Clean and non-drying",
      "text": "This wash hits just the right combination of cleansing and moisturizing. Skin feels clean without feeling stripped. Great for the cold and dry winter months, but might not be enough for the summer.",
      "rating": 5.0,
      "verified": true,
      "author": "jeneefah",
      "helpful_votes": 0,
      "publication_date": 20131209
    },
    {
      "title": "Great product for my oily skin",
      "text": "Have used this product for several years. Great product for my oily skin type",
      "rating": 5.0,
      "verified": true,
      "author": "Lula11",
      "helpful_votes": 0,
      "publication_date": 20160517
    },
    {
      "title": "Juice Beauty is the best.",
      "text": "I have been using this cleanser for years and it is the only thing that doesn't dry my face out. Even better than DHC oil.",
      "rating": 5.0,
      "verified": true,
      "author": "JLawrence",
      "helpful_votes": 0,
      "publication_date": 20140410
    },
    {
      "title": "I love that I can confidently use it very close to ...",
      "text": "This smells lovely. It helps me relax at night every time I use it and it leaves my skin feeling very smooth and hydrated. I love that I can confidently use it very close to my eyes without any irritation. I will buy again!",
      "rating": 4.0,
      "verified": true,
      "author": "Natalia Loaiza",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "Well worth the money!",
      "text": "Excellent product, especially for sensitive skin. Leaves skin feeling soft and clean",
      "rating": 5.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 0,
      "publication_date": 20141218
    },
    {
      "title": "No need to waste any more $$$ on a cleanser that pampers your skin",
      "text": "Over the last 15 years, I have wasted thousands of dollars on average priced to unnecessarily expensive cleansers for my hyper-sensitive skin. this one's a keeper.",
      "rating": 5.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 0,
      "publication_date": 20131028
    },
    {
      "title": "So Silky!",
      "text": "I love this cleanser! It is so smooth and silky...it just glides across your face. It helped clear up my acne and is so refreshing in the morning. It has a pleasant but rather light smell...not strong at all.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Miller",
      "helpful_votes": 2,
      "publication_date": 20140206
    },
    {
      "title": "Love it. Not greasy or oily",
      "text": "Love it. Not greasy or oily. Leaves my skin soft and clean. Will be buying again when I run out.",
      "rating": 5.0,
      "verified": true,
      "author": "jewell",
      "helpful_votes": 0,
      "publication_date": 20141204
    },
    {
      "title": "Five Stars",
      "text": "Amazing! Extremely moisturizing and keeps skin clean and soft. Great for Acne and use with Rentin-A products!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160531
    },
    {
      "title": "Five Stars",
      "text": "Love it! Gentle and keeps my skin bright, clear and heathy.",
      "rating": 5.0,
      "verified": true,
      "author": "The Dope Bohemian",
      "helpful_votes": 0,
      "publication_date": 20160211
    },
    {
      "title": "BEST CLEANSER BY FAR",
      "text": "This is so gentle for my skin, I'm 38 and pregnant, I was looking for something natural because you cant trust anything on the market these days and the chemicals are overwhelming. This cleans my skin, I have combination and feel so good, it doesnt leave a residue. I highly recommend this",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer N. Mccall",
      "helpful_votes": 2,
      "publication_date": 20130505
    },
    {
      "title": "Great product.",
      "text": "This cleanser gets my skin clean & doesn't dry it out like other cleansers, especially since I use Retin-a daily.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey",
      "helpful_votes": 0,
      "publication_date": 20140505
    },
    {
      "title": "Intensely moisturising, gentle yet tough on make-up",
      "text": "Working for a skin care brand myself, I've been slightly intrigued by the ethos of this brand and by their affordable prices. Could they deliver a superb cleanser that is gentle on the skin and doesn't dry your skin up? Well, fortunately for me, Yes they can! This Milk is better than expected and it leaves my usually dry skin smooth, supple, hydrated and fresh. Love it! And will continue to purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Frankie",
      "helpful_votes": 0,
      "publication_date": 20140617
    },
    {
      "title": "I love the aroma and the texture and the way it ...",
      "text": "I love the aroma and the texture and the way it cleanses and the way it makes my skin feel.",
      "rating": 5.0,
      "verified": true,
      "author": "shelly carter",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "My skin has never looked better!",
      "text": "Juice beauty is the best. My skin has never looked better. I love the fact it is all natural, and Vegan. It makes me feel good about using this product. I also use the juice hydrating mist as a combination. This cleanser will last you a long time as a little goes a long way.",
      "rating": 5.0,
      "verified": true,
      "author": "NatalieFord",
      "helpful_votes": 0,
      "publication_date": 20161010
    },
    {
      "title": "Did not work for me...",
      "text": "I had never used this product before. It did not remove my makeup.",
      "rating": 2.0,
      "verified": true,
      "author": "Leauwa",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "I've been using this product for years! It is ...",
      "text": "I've been using this product for years! It is the only thing that doesn't make me break out!! It removes makeup well too! My hubby even uses i .",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda I. Colburn",
      "helpful_votes": 0,
      "publication_date": 20160217
    },
    {
      "title": "Smells Awful",
      "text": "This did not cleanse my skin or remove ANY makeup. It also smells disgusting unlike all other juice beauty products. I recommend trying a different face wash from their other lines.",
      "rating": 1.0,
      "verified": true,
      "author": "Pamela F",
      "helpful_votes": 0,
      "publication_date": 20150211
    },
    {
      "title": "juice beauty",
      "text": "Amazing product. Received in no time. Exact same product from juicebeauty.com but more affordable.. If u are ready to go natural and non toxic. Try juice beauty . U will love it",
      "rating": 5.0,
      "verified": true,
      "author": "mrs. dennis",
      "helpful_votes": 0,
      "publication_date": 20130220
    }
  ],
  "product_meta": {
    "title": "Juice Beauty Cleansing Milk",
    "description": "Size:6.75 Fl Oz\n\nThis creamy formula deeply cleanses and removes all makeup with organic grape seed and sunflower oils, while soothing normal, aging, or sensitive skin with organic chamomile and calendula. Tones with resveratrol from grapeseed. Soothes and replenishes with botanical extracts of chamomile, calendula, linden. Feeds the skin with rich nutrients of vitamins C, B5. Emollient action with vitamin E.\n\nIngredients: Vitis vinifera (organic white grape juice/jus de raisin blanc bio)*, aloe barbadensis (organic aloe juice/jus de aloès bio)*, glycerin†, cetearyl alcohol†, caprylic/capric triglyceride†, prunus amygdalus dulcis (organic sweet almond oil/huile d’amande douce bio)*, carthamus tinctorius (organic safflower seed oil/huile de carthame bio)*, rubus idaeus (organic red raspberry juice/jus de framboise bio)*, helianthus annuus (organic sunflower seed oil/huile de graines de tournesol bio)*, sesamum indicum (organic sesame seed oil/huile de graines de sésame bio)*, vitis vinifera (grape seed oil/huile de pépins de raisin), hydrolyzed linseed extract, cetearyl glucoside†, gluconolactone†, calcium gluconate, sodium benzoate, potassium sorbate, potassium hydroxide, sodium citrate, citric acid, calendula officinalis (marigold flower extract/extrait des fleurs de souci), chamomilla recutita (chamomile extract/extrait de camomille), tilia cordata (linden flower extract/extrait des fleurs de tilleul), panthenol (Vitamin B5/vitamine B5), ascorbic acid (Vitamin C/vitamine C), tocopherol (Vitamin E/vitamine E), allantoin, xanthan gum, citrus sinensis (orange oil/huile d’orange), boswellia carterii (frankincense oil/huile d’encens)\n\n\n\nBRAND STORY\nBy Juice Beauty",
    "rating": 3.6,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "5.5 x 2 x 1.8 inches; 6.08 Ounces",
      "Item model number": "AAJ-023",
      "Department": "Beauty",
      "UPC": "834893004049",
      "Manufacturer": "Juice Beauty",
      "ASIN": "B000UV7FXE",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Amazon Best Sellers Rank": "#50,298 in Beauty & Personal Care",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Washes",
      "Skin Care",
      "Face",
      "Cleansers",
      "Beauty & Personal Care"
    ],
    "price": 18.75
  }
}