{
  "website_summaries": [
    {
      "verdict": "A versatile but small clamp for light projects. Controls may be finicky, and the handle may break during operation.",
      "pros": [
        "Suitable holding power for light- and medium-duty projects",
        "Spreading feature can be easily engaged"
      ],
      "cons": [
        "Reversed release and tighten controls take getting used to",
        "Multiple reports of ratcheting handle breaking after a few uses",
        "Smaller than some expected, and a few owners find the clamp flimsy"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Absolute crap",
      "text": "I can't unrecommend these enough. I was hoping they'd be helpful for simple jobs like cabinet work, but when you squeeze the trigger mechanism, the internal plastic mounts for it break. I wasn't even using two hands! One broke and the other was fine for a little longer (I bought two and figured one just was faulty) but the other broke shortly after. Making the fulcrum where all force is applied out of plastic was a REALLY poor choice",
      "rating": 1.0,
      "verified": true,
      "author": "Reynard Loustaunau",
      "helpful_votes": 26,
      "publication_date": 20181025
    },
    {
      "title": "Total Junk!",
      "text": "Junk! I bought 4 of them to clamp materials together to join them. The simple and lighter clamping needed was okay. But when I need to clamp several glued 2x’s together overnight, 2 of them snapped at the handle and were trash after I released the clamps the next day. Got 1 use out of those and that’s it. The other two held okay, but the triggers feel weak and are made of plastic. Don’t purchase these if you need them for real projects. For simple stuff around the house.... maybe",
      "rating": 1.0,
      "verified": true,
      "author": "Jason ",
      "helpful_votes": 8,
      "publication_date": 20190808
    },
    {
      "title": "Came broken",
      "text": "Was skeptical about the quality for a $4 clamp and sure enough when mine arrived it arrived broken. The small round button that you push to release the clamp had fallen off and was missing. It is not worth $4 to box it up again and drive to the local UPS so I just left it as a failed experiment.",
      "rating": 1.0,
      "verified": true,
      "author": "Servant DC",
      "helpful_votes": 5,
      "publication_date": 20181212
    },
    {
      "title": "Lightweight and compact/small compared to its competition; inexplicable fulfillment problems",
      "text": "OK, it's lightweight and compact. Small is better for some jobs. Enormous pressure is not needed for some jobs. Looks OK for my intended lightweight use (stretching some sling chairs) and the compactness actually helps in my case. Fulfillment, on the other hand, had severe problems. First shipment, missing fixed jaw. First replacement, a 12\" clamp with a 24\" paper wrapper on it. A small tear on the paper wrapper so I wonder if was somebody's return that they didn't put back together right. Third time was the charm, it appears. Somebody needs to do some incoming quality control, that's 2 of 3 shipments that had obvious product defects. I haven't seen Amazon do so badly before.",
      "rating": 3.0,
      "verified": true,
      "author": "Liudvikas Bukys",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Much smaller than expected.",
      "text": "Looks larger in display photo than what it is. Says 6-inch with a 9\" Spreader... the spreader bar is about 9\" long x 1/4\" wide. The jaws are really small -- about 3/4\" in size. Can only fit handle grip between a thumb and 2 fingertips to tighten - it's that small. Will keep to use on small - light duty projects. Can't be used for what they were purchased for however. Not sure what feature of these clamps the 6-inch is referring to.",
      "rating": 3.0,
      "verified": true,
      "author": "Lurabyss",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Not Very Strong",
      "text": "I bought this clamp to fix my door after it was damaged during a break-in. The lock had held strong, but the door split at the door knob through the middle as if filleted. I'm trying to fix it, so I don't have to cough up $200-400 plus labor for a new door to be installed (I'm very broke). I squeezed Gorilla Glue into the crack, and clamped firmly. If I don't stand there and hold the clamp tight, it loosens. It was a cheap clamp, but it was also a waste of money. Removing the door and sitting on it while the glue dries proved to be easier than using these clamps.",
      "rating": 2.0,
      "verified": true,
      "author": "B. Hernandez",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Good for the DIY homeowner.",
      "text": "I really like these bar clamps. Yes, there are better ones out there. But these are ~$9.00. Compare them to other $9 clamps and they are very nice. Sure you won't find them in a professional woodworking shop, but for a homeowner, they are more than adequate. I use them to help assemble furniture; hold down wood on my drill press, table saw and miter saw; build picture frames and boxes; and more. I never felt like they didn't grip well enough. But I don't do any high torque things with them. For that I use my screw style bar clamps.",
      "rating": 5.0,
      "verified": true,
      "author": "PaleBlueDot",
      "helpful_votes": 7,
      "publication_date": 20150912
    },
    {
      "title": "So cute, and works great for me.",
      "text": "I love mine! It's truly mini, which is just plain cute. It's also strong, and feels solid when clamped. The pads are flush and give a good grip. I am using them to hold together a miniature set for filming stop-motion animation. I clip walls to supports, or supports to the table, and hold the whole set together. I haven't used it much, only for a few filmings, but so far so good. Yes, the trigger is small, but the whole thing is tiny so it's appropriate to the scale of the rest of the clamp. I haven't used it as a spreader, so I can't comment on that, except it's straightforward to reconfigure it to be a spreader.",
      "rating": 5.0,
      "verified": true,
      "author": "Nutella Crepe",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Nice quality for the price with a few caveats",
      "text": "Great ratcheting bar clamp. Used it on a number of project and it's going strong. I like that I can use it for spreading as well. Unfortunately the tightening lever is quite small, so you have to put some force into it to get high clamping pressure, and when you do that, the release button is far too tight and you end up finding something apply pressure to it to release. Pro's: - Nice quality for the price - Able to put good clamping pressure with some force - Able to use for spreading as well. Con's: -Tightening lever is quite small - Release button is very hard to release when clamping pressure is high",
      "rating": 4.0,
      "verified": true,
      "author": "Vitali",
      "helpful_votes": 2,
      "publication_date": 20161213
    },
    {
      "title": "Would not recommend",
      "text": "Plastic is cheap and flimsy, I opened the box, immediately went to use them, and they both broke on first use. The triggers completely broke. Went to local big box hardware store, got 2 better clamps (for pretty similar pricing), and it's like night and day. Save yourself the hassle and get something better",
      "rating": 1.0,
      "verified": true,
      "author": "Aileen Grech",
      "helpful_votes": 6,
      "publication_date": 20170111
    },
    {
      "title": "Useful but will not take much force.",
      "text": "Was looking for a small and inexpensive clamp. This fit the bill but keep in mind these are not high quality. They will not take a lot of force. One broke while I was compressing two pieces of wood together. Weak point is the ratchet trigger hinge. Opened it up to see if repairable. The hinge pin is held in place by a very small piece of plastic which will not take much force. These are ok as long as you do not need to apply any force to compress your project.",
      "rating": 3.0,
      "verified": true,
      "author": "Wayne H.",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Not bad, not great",
      "text": "Not a \"bad\" clamp for light duty use, but their \"backwards\" handle and light duty bar don't cut it for the all-purpose uses I like my clamps to have. You can have a clamp that will do light duty, then you can have a clamp that does light and heavy duty; I prefer the latter. I bought one 24\" to try it out a couple years ago but you don't see two in my collection. It has stood up well I suppose, but I don't reach for it unless I am out of other 24\" clamps.",
      "rating": 2.0,
      "verified": true,
      "author": "kindle user",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Perfect for what I needed",
      "text": "I have four patio dining chairs, called sling chairs, and the fabric failed after many years. The chairs were so comfortable that I really wanted to try my hand at replacing the fabric. I absolutely could not have gotten it done without this tool. It seemed to me that the tool needed to exert a LOT of force to position the frame properly, but the tool got it done.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise Galante",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "I love these clamps.",
      "text": "I love these clamps. They're way better than hand-held stretch clamps (like chip clips) that break when stretched just a tad too far. So satisfied with this product that I've bought several sizes at this point. The mini size is just as strong as the full-size, which was very impressive. The red piece at the tip of the clamp does slide off occasionally after the clamp settles into place, which is to be expected. Absolutely no hassle to slide back on, and preferable to other clamps where this piece would just break off.",
      "rating": 5.0,
      "verified": true,
      "author": "Alyssa",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Very Good value.",
      "text": "Easy to open and close. My only complaint is that when open (and wanting to close around something), the weight of the bar (or more probably the lack of compression in the JAW), causes them to close. I've had some success keeping them open by holding the clamp down, but don't think I should have to do that.",
      "rating": 4.0,
      "verified": true,
      "author": "B Woods",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "These are SUPER fragile and easy to break.",
      "text": "Broke each one within a week. The handle mechanism is attached by a cheap plastic clip that breaks as soon as you apply hard pressure. I think if you need clamps for small projects that require very little pressure, these would work fine (although the handles don’t make sense and are backwards from every other clamp I’ve ever used). However, if you need to actually “clamp” things together, these are no good. I should’ve spent a little more on the clamps I’ve always used and haven’t had trouble with breaking.",
      "rating": 2.0,
      "verified": true,
      "author": "Maverick",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Faulty",
      "text": "Using these for a small project. Neither one holds much clamping pressure at all. They slip and are not holding the slightest pressure, basically they only have enough pressure to hold themselves on. I will not buy again",
      "rating": 1.0,
      "verified": true,
      "author": "Hellkell",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Can't beat them for the $$$$$",
      "text": "I use a lot of clamps and bought for clamping fences while they're built. Worked like a charm....easy to use and held 2x4's to 4x4's firm enough for fastening together. Working outside did add a little rust which was quickly taken off which some 200 grit metal paper and then oiled. Good value for \"expendable\" clamps that will be around a while. Only bad thing is once it a while the release sticks due to the rust but no problem really...WD or PB makes it right again.",
      "rating": 4.0,
      "verified": true,
      "author": "Fisherman",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Gentle squeeze at best & the release button is junk",
      "text": "The release buttons are crap - you have to gran the whole clamp so you can really squeeze hard to get it to release. The clamping ability is weak at best, more like a gentle squeeze. I'm no master Carpenter, but I can build something square... I was screwing and glueing 2 boards together and used this clamp to hold them together. It was not able to pull the boards together flush. I used one of my irwin 12\" light duty clamps and it pulled the boards flush with no problem.",
      "rating": 2.0,
      "verified": true,
      "author": "C.T.",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Keep looking, it is not worth it",
      "text": "I do not normally write reviews, I have had a lot of luck with Tekton tools in the past and still have quite a few in my inventory. However there is absolutely no quality in this product at all. The first time I used it the handle literally snapped off. I was using it to bond two 1/4 to one 1/2 sheet of plywood. The smaller Irwin ones I own were able to do what this couldn't. While a very cheap price for once it is not worth it..",
      "rating": 1.0,
      "verified": true,
      "author": "Diver Bill",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "compact and easy to use",
      "text": "I needed something to clamp 2 separate couch pieces together because they kept on sliding apart. I was able to stick my arm under the couch and put these on without being able to see them. Super easy to use, and enough clamping force for my needs. I think the price is great. I was a little worried about the size since the space I'm clamping is pretty much exactly 6 inches, but these were definitely sized a hair bigger than 6 inches, so they worked just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Broke before I could even use it",
      "text": "Broke the very first time I used it. The holder on the end is plastic and snapped right off. I was really excited to use these on some new project ideas, but I suppose I'll have to invest in some better ones. Might be okay for gentle use, but snapped before I could even use them once while assembling a table top.",
      "rating": 1.0,
      "verified": true,
      "author": "DJ Joey D (K-Town Sound)",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Not bad for occasional light clamping pressure",
      "text": "These clamps are fine for positioning assistance, but they aren't strong enough for glue up applications. I had 5 of them and they all back off a little bit after applying clamping pressure. The \"ratchet\" doesn't have any pawls, it's only a spring loaded friction bar as you can see in some of the other reviews. They are pretty compact though, and they do have their uses, since they hold pieces together better than a few dollar bills.",
      "rating": 2.0,
      "verified": true,
      "author": "Bucky Goldstein",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "These are really great small clamps",
      "text": "I got these because sometimes a spring clamp doesn't open enough to use in a small area. I've gotten cheap ones from Harbor Freight, but these are so much better than those. You can count on these to actually hold well. And the quick release button allows you to move the jaws freely up and down the bar, then they grab when you squeeze the handle, so getting them set in small spaces is easy. Good quality materials and assembly. They did a great job on these.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry010101",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Pretty good",
      "text": "The clamping mechanism works great, is very strong & does not slip. They are lightweight & super easy to use. Only issue is when you clamp 2 pieces of wood together really tight, when you go to release the clamp – the release button is really hard to push in. I'm not going to return them, but I don't think I will buy these same ones again.",
      "rating": 3.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "This is a great tool!",
      "text": "This little tool is awesome! I needed the reversible feature on it to press something apart and it did the job. To uses it this way you just slide the end off and put it on the other way. Otherwise it would be used to hold something together. I’ve since used it for several other tasks. It’s small so make sure you read the dimensions. I wish they made a larger version to because I would buy it. This is a great tool to have in your toolbox!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul N. Scaggs",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "They break easy, fix them before you use them",
      "text": "These clamps have a design flaw that causes them to break, I used mine twice and they both broke in the same place, I fixed mine and they will never break again, if you're handy, (just a bit), take them apart and note where the pin that mounts the lever engages the bosses in the grip panels, take a drillbit just bigger than 3/16 and drill through the bosses, reassemble with a through bolt and a self locking nut, grind off the excess thread, now you have something... I wound up using a 3/16 x 1\" roll pin...",
      "rating": 2.0,
      "verified": true,
      "author": "Mr. Wu",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Great general purpose clamp",
      "text": "I use clamps for hobby projects, gluing, and crafts as well as the odd furniture repair. This is my favorite style and favorite size. It clamps really quickly and releases very quickly. About the right size to work for most jobs. I'm not going to use the metal ones you have to screw to close any more. These are just too fast and efficient. I have some of this style that are much smaller (4 inches) for gluing little things). 5 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "G. FarnsworthTop Contributor: Board Games",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Great little clamp",
      "text": "I have got by for years with a bunch of the small threaded, screw down type of clamps. They are great. This is just better. It is much quicker and holds very steady and tight. It was a great purchase. I almost bought the more expensive variety not to be named haha, but i feel like they are price gouging. I have some of their bigger clamps and these seem right in line with their quality, functionality and durability.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey M. Arnold",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "No complaints",
      "text": "The TEKTON 6-Inch x 2-1/2-Inch Ratchet Bar Clamps are handy little clamps to have. I use them to clamp things down on a temporary basis, because they're easy to use. I wouldn't recommend trying to use them for heavy clamping jobs that require a lot of torque. They'll slip if you try to clamp them down harder than what they can handle. They work for what I need them for, so I have no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Slapshot",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Break when pressure applied",
      "text": "Cheap, and you apparently get what you pay for. Seemed to work well, but don't apply any real pressure to them. If you any kind of significant squeeze pressure they will break. Both of mine broke. Fair if you need to keep things aligned. But do not use as clamps or on anything you need good hold on.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel Muelhaupt",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Release too small",
      "text": "Great range and best price for the size but I would like the pads to be softer for less slip and most important is that the release it too small making it hard to access and very hard to release when under heavy pressure. I chose the size for a heavy duty framing application but it might be better suited for light duty jobs.",
      "rating": 3.0,
      "verified": true,
      "author": "Darren D.",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Clamps work but I have to believe they were made wrong which is why they are inexpensive",
      "text": "Well, they work well but the handles are definitely backwards. Someone manufactured them wrong (I have to believe this) and the company just decided to sell the inventory very cheap since they still functioned. The squeeze trigger grip is backwards and uncomfortable to the hand. They also move the wrong way along the bar BUT they do work. Hopefully the guy who messed this up at the factory got fired!! lol!",
      "rating": 4.0,
      "verified": true,
      "author": "J. Salomon",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "This was a bad purchase for me - never again will I buy ...",
      "text": "The small red button the releases the clamp on one of the two clamps that I bought was broken off and I could not see if it arrived broken or was broken in the shipping. Nonetheless, it is worthless on any tight clamping. I did use it for light clamping to hold some parts together - it fell on the floor (about a 2 foot drop) and the stationary clamp hold broke off. This was a bad purchase for me - never again will I buy Tekton. I've not yet decided on the returning part but I'll update if needed.",
      "rating": 1.0,
      "verified": true,
      "author": "Bendalike",
      "helpful_votes": 3,
      "publication_date": 20180223
    },
    {
      "title": "excellent.",
      "text": "I bought 2 of these, and reversed one to use as a spreader with the other for a clamp. They are easy to use, even when exerting a lot of force. The only improvement I could hope for would be to be able to release the pressure slowly instead of all at once.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas B.",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Tiny but mighty!",
      "text": "I got these as a add on to my order. I'm so glad I did as I didn't realize I would soon be putting them to the test. I had a wood project where I needed to glue up some small wood pieces and my normal size clamps would be too big for the job. These were just what I needed and they look solidly made. I think I'll be getting more as they are easy to manipulate and gave a strong hold and stayed put. Good price too!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeephers",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Broke both of them the first time I tried to use it",
      "text": "I don't know why they made the cross section of material so small on the clamping feet. I have 10 other similar plastic clamps that I've used for 10+ years and I have never broken any of them. I broke both of these on the first use.",
      "rating": 2.0,
      "verified": true,
      "author": "Eric Tischer",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Great tool",
      "text": "I have purchased several of the Tekton Bar Clamps and as of yet I have not been disappointed with their performance. They are easy to use and really clamp down when I add a good dose of pressure. I have several different lengths and I use them almost daily.",
      "rating": 5.0,
      "verified": true,
      "author": "Vince_A",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "I purchased 2 of these, one broke but was replaced promptly by the manufacturer",
      "text": "I purchased 2 of these, one of them broke while clamping...I'm not the strongest guy in the world however I'd expect a clamp to be able to clamp using moderate pressure from a human hand. Update: +1 star for customer service. My broken clamp was replaced by Tekton, unfortunately it's a bit cold in my garage to be woodworking at the moment so I can't update this review further at the moment. Update 6-16-16: +1 more star. The replacement clamp has been used over 12 dozen times without fail. It's an unusual clamp but it works and for the price I guess it can't be beat. Will purchase more eventually.",
      "rating": 3.0,
      "verified": true,
      "author": "Edward Caraballo",
      "helpful_votes": 2,
      "publication_date": 20160109
    },
    {
      "title": "Junk. Breaks after first use.",
      "text": "These are junk. I’ve used them just a couple time to clamp 1/4 in lauan and two of the eight I bought broke. The trigger no longer returns after squeezing to tighten.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Roberts",
      "helpful_votes": 3,
      "publication_date": 20180731
    },
    {
      "title": "Just what the doctor ordered",
      "text": "bought a refurbished ping pong table for $89. One corner showed wear and tear. with some wood glue and cardboard and sawdust, re-formed the corner, and used this mini clamp to hold things in place while the glue set. after 24 hours, glue was set, and the refurbished ping pong table was good as new. $5 dollar glue and this inexpensive clamp, turned the $89 table into a $300 table again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "These clamps work so great I bought more!!",
      "text": "I bought two just to try them out and was so impressed I bought 4 more. The cost was a fraction of what the big box store wanted to charge me and they hold things in place where I need it. Yes, some parts are plastic but so far have held up well and I use them often. I really like the feature of being able to push the button and slide right the to section I want and then tighten by gripping the handle. All in all I am pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Aussiebat",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Defective",
      "text": "I ordered 2 of these, one was perfect, the other one won't open. I didn't notice until I took the packaging off and brought them to work to use. Very disappointed because the other one works perfectly. Since I already removed the packaging I doubt I can return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Love To Shop",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "This is a nice clamp, but it the trigger pull on it ...",
      "text": "This is a nice clamp, but it the trigger pull on it is short, so it doesn't give the feeling that it is clamping as tight as my Irwin clamps, even though it is clamping tight. I thought the push button release would be problematic, but it is not and it is not difficult to push the button in to release it. Update...it doesn't clamp nearly as tight as my Dewalt and Irwin clamps. But, you get what you pay for.",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "Great.. for a bit.",
      "text": "Purchased to use as a clamp on my Kreg jig. I don't like the clamp that comes with the jig. I used it for two builds pretty regularly and it clamped down and released great. But the clamp action wore out quickly. Now when I squeeze the trigger to clamp, the trigger won't rebound, even if there is no tension on the clamp. It worked great for light duty though. I'll keep using it until it frustrates me too much to continue to bother with it. But for the price, it did fine.",
      "rating": 3.0,
      "verified": true,
      "author": "Gregory W.",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Poorly Made",
      "text": "At first I really liked these; they worked well for a fair price. But they both broke in the past week. First I noticed the plastic of the handle would expand out when pressure was applied, then they simply stopped applying pressure. Would not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "Z. Kummer",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Delicate tiny lightweight",
      "text": "4 very very lightweight type project miniature models could hold paper and cardboard and popsicle sticks red grips had to be glued on they would make the entire clamp slide off Perfect for tiny little preschool projects",
      "rating": 2.0,
      "verified": true,
      "author": "ToriToriTori on the Fire",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Buyer beware, weak clamps",
      "text": "I ordered two of these clamps and after 1 glue-up job, the far end of the clamp broke off. The other one has some give to it as well already. The quick-release mechanism also failed to work as needed when I was taking off the clamps. Do yourself a favor and just go to Harbor Freight. The clamps I got from there have lasted 3 years and are heavy duty. A lot cheaper too.",
      "rating": 1.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "useful and sturdy clamps",
      "text": "Very useful. I purchased a half dozen of the 30 inch clamps and a half dozen 36 inch clamps for a project that requires making up some wide boards from narrower ones glued together. These clamps do the job of holding the boards together while the glue cures. The design makes it possible to steady the work piece with one hand while putting clamping pressure with the other. This eliminates the need for a third hand that a screw clamp would require. They are convenient and so far they are holding up very well.",
      "rating": 5.0,
      "verified": true,
      "author": "John HenryTop Contributor: Woodworking",
      "helpful_votes": 0,
      "publication_date": 20160609
    },
    {
      "title": "Hit or miss",
      "text": "Hit or miss honestly. The ones that work are actually pretty great...but that's if they work. I ordered 8 this time around, one didn't hold right out of the box, another's head broke off on first tightening, two more stopped holding / tightening after a few uses. I have 4 that I purchased a year ago that work great and are still going strong, however.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Great and not too expensive !!",
      "text": "I bought 2 and buying more. Just got 3 more and 1 doesn't work. The handle doesn't release. I opened it up and one of the metal pieces used to lock are getting stuck. The metal piece on top is either put in backwards or just too short. The handle is getting stuck because the metal is too short.",
      "rating": 4.0,
      "verified": true,
      "author": "brad8118",
      "helpful_votes": 37,
      "publication_date": 20150421
    },
    {
      "title": "Secure and sturdy. Easy to use",
      "text": "I used this to stabilize some MDF planks being cut to make a small bedside table. They worked perfectly, kept everything in place yet did not mar the wood. A great addition to my toolbox.",
      "rating": 5.0,
      "verified": true,
      "author": "LolaChicago",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "You get what you pay for and that's a fact with these cheaply made clamps",
      "text": "For starters, I'm still waiting on part of my order, and in two days, two have broken. The ends are made of a cheap plastic, and when you clamp down they snap off. And I'm only clamping drawer fronts while the glue drys.",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony J Nuccio",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Falls apart after light use",
      "text": "Purchased two of these clamps and after a year and a half a very light use the buttons fell off and no longer able to unclamp not very good quality for very minimal use don’t last very long.",
      "rating": 1.0,
      "verified": true,
      "author": "Lwood",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Great little clamp",
      "text": "For very small projects it's a handy little clamp. You wouldn't want to use it where any serious forces were at play, but when you just need to hold something fairly light without damaging it this will do that, and the mechanism allows you to get a solid grip with no wiggle very easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Diggie",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Broke on first use.",
      "text": "Unfortunately I didn’t get to use this on the original project that I purchased for because it arrived late. So the first time I needed it was after the return date had expired and it broke on the first use. Honestly you can see the design flaw in the plastic claw piece. Used it to hold flat pieces together so no torquing involved, and didn’t even get it to 100% tightened when it snapped. Definitely don’t purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Comatose82",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Difficult to release, no clamping power at all",
      "text": "Overall is acceptable if using occasionally. Not for professionals. After using several times revising to 1 star from 4 stars. No power at all. My tiny Dewalt clamp squeezing much stronger.",
      "rating": 1.0,
      "verified": true,
      "author": "THT",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Hard to switch to spreader",
      "text": "These work fine but we’re a real PITA to switch over to spreaders. There is a little grommet thing on either end that I had to tap out then it took a lot of doing to get the plastic pieces back on to make it a spreader. Now that it is set up, it works fine, but this will now be a dedicated spreader and I won’t switch between spreader and clamp.",
      "rating": 3.0,
      "verified": true,
      "author": "K. lai",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Poor quality",
      "text": "These clamps are any good. They are so cheaply made. I just started using them and they will not tighten up on whatever you want to clamp together. I will not by these again. If you have bought these, send them back to Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "kightrider52",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Perfect alternative to Irwin clamps...much cheaper but work just as well!",
      "text": "Perfect clamps! I own an assortment of Irwin, Dewalt, and Tekton bar clamps (all basically same style with the pistol grip). I needed a longer version, and the irwin ones were pretty expensive. I decided to give the Tekton ones a try and they're great! They're not as sturdy or heavy duty as the Irwin ones, well, at least their \"super duty\" ones or whatever, but they're great for my general woodworking needs. These work great and were much much cheaper than other competitors. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 4,
      "publication_date": 20140810
    },
    {
      "title": "Not a lot of clamp pressure",
      "text": "I am a 34 yo male that has used similar trigger clamp products from Dewalt and Irwin. I've been happy with the design and had high hopes for this one so I purchased four. Tekton is a US company and provides a legit warranty. However, despite all my strength, I'm not able to clamp these tightly. For example, if I clamp them on a piece of wood, I can easily pull the clamp off that wood with one finger.",
      "rating": 2.0,
      "verified": true,
      "author": "sro",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Complete garbage.",
      "text": "I wish I hadn't waited so long to use it, but I bought it when I ordered my irwin set. The Irwins held up fine, I just figured I might as well get an 18\" clamp because I'd need it eventually. Needed it, first use and the trigger mechanism broke the casing. Now it's past the return date because I'd waited too long to even use the dang thing. DO NOT BUY. Just spend a few bucks extra for something that won't break immediately.",
      "rating": 1.0,
      "verified": true,
      "author": "Graham L Florida",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "A good cheap alternative with some quirks",
      "text": "These tekton clamps are good overall. I question their true strength, but most of the type for my pretty typical glue-ups they serve the job nicely. In a perfect world I'd love for the trigger to be the opposite direction, and for a better release mechanism as the red button release can be a bit hard to trigger. Overall though, and nitpicks aside, they work quite well and were VERY reasonably priced. I've got about 10 of these of varying sizes and they all are quite reliable.",
      "rating": 4.0,
      "verified": true,
      "author": "Kyle Albanese",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "The mini clamps are a piece of junk, the full size are great",
      "text": "The first time I ordered these I paid about $4 and it was the full size (6\") clamp. It worked well, so I reordered but in the reorder for the same price, I got the mini clamp. It wouldn't tighten and barely held things together. I'd recommend this product, just don't get the mini clamp.",
      "rating": 4.0,
      "verified": true,
      "author": "Elliott",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Cheap for a reason",
      "text": "This clamp feels and works the way its priced. I would recommend just spending extra money and get a Irwin clamp. Pros: 1)Good Price Cons: 1)Cheap quality 2)Does not work well",
      "rating": 3.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Good for small toy repairs",
      "text": "Bought the 6-inch clamp to assist with toy repairs for my young kids and it works well. It's a little \"sticky\" to pre-adjust the position with the release button depressed, but the trigger provides a nice way to tighten the clamp gently. Good for (dollhouse-sized) beds, chairs, and teapots!",
      "rating": 4.0,
      "verified": true,
      "author": "D. Tanner",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Big price increase on 36”",
      "text": "This is a decent around the house bar clamp, not sure it would benefit professional carpenters but it’s come in handy plenty of times. I purchased the 36” last year for $16.00 I don’t understand why it’s st 40 bucks now. Going to purchase another but going directly to Tekton site to by it for 16. If price goes back down I will reconsider my review",
      "rating": 3.0,
      "verified": true,
      "author": "Robert L.",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Works Great, Great Price!",
      "text": "For the price, this is a low-cost way to get a big ratchet bar clamp. Works great for my amateur woodworking projects. Pros: Length for the price. Ability to spread as well as clamp. Cons: The \"push button\" release is a bit harder to work, compared to other leading brand-name clamps, if you clamp it down hard. I bought this one for less than $10. I bought one at Harbor Freight for $7, and it broke after a few uses, so I returned that one and ordered a second one of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Snake",
      "helpful_votes": 0,
      "publication_date": 20160306
    },
    {
      "title": "Why did I wait so long to buy these?!?",
      "text": "Ok. Now I need more haha. And some various sizes! Super easy to use. Good clamp grip. Great clamp strength. Tekton continues to impress.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Lester",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Broke the first time I used it",
      "text": "Total junk. I have a lot of Tekton products and this really disappointed me. First time I needed to use it, several parts snapped. Not repairable.",
      "rating": 1.0,
      "verified": true,
      "author": "TonyGZ",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Kinda flimsy",
      "text": "I have a bunch of clamps from different brands but I never had a Tekton brand clamp before. The price looked good, so I thought I'd try them. They work, but I don't think I'll use them much. My Bessey and Irwin and Jorgensen clamps work better. One of those cases where you get what you pay for, I guess.",
      "rating": 4.0,
      "verified": true,
      "author": "Str8oz",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Perfoms as well as high dollar version",
      "text": "I have several of the Irwin and some older all metal models but needed on just a bit longer so tried this Tekton. It really did the job for my simple project, so have not used it commercially or over a long period of time but expect it will perform just fine for the DIY'er.",
      "rating": 5.0,
      "verified": true,
      "author": "Chadwick",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "If you like good quality tools, these are not for you.",
      "text": "I was not impressed with these, I use a lot of clamps, and was attracted to these by the price. Well, you get what you pay for, and I didn't pay a lot. They work, but don't have the strength and ease of use as the higher priced clamps. Would I buy them again just as some extra clamps to have around just to save money? In a word, no. 'Nuff said.",
      "rating": 2.0,
      "verified": true,
      "author": "Beach Bum",
      "helpful_votes": 0,
      "publication_date": 20170326
    },
    {
      "title": "Well at least one of the two worked",
      "text": "I realize you can't expect to much from a piece of hardware that costs less than $4 but essentially I bought two to get one that worked. The one that doesn't work will hold its grip but can't be tightened. I wish they'd replace the one that failed but I'm not going to go through a lot of effort for something so inexpensive.",
      "rating": 2.0,
      "verified": true,
      "author": "Keith Hill",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Great product.  I think they work as good as the other brand at a much lower price.",
      "text": "The reverse closing takes a little getting used to, but these are excellent tools. Their competition (which doesn't have the reverse closing), is priced much higher and I can't figure out why. These are sturdy, hold their grip and are reversible for holding things open.",
      "rating": 5.0,
      "verified": true,
      "author": "WebBuzzard",
      "helpful_votes": 0,
      "publication_date": 20171222
    },
    {
      "title": "Never have too many clamps.",
      "text": "These little clamps have come in handy more times than I can count. Great little product at a good price. Fast shipping, too. I have had these for a while now and they are holding up nicely. In fact, they're out in the shop right now holding something together. Perfect for small parts or hard to reach areas. The reversible head is a nice feature to have. I can remove the head and puse the bar through the dog holes in the top of my dovetail bench (a mini workbench that sits on top of my workbench) and it becomes a tiny holdfast.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140423
    },
    {
      "title": "Weak clamps, but they’re affordable for a reason",
      "text": "They’re not very strong, but I’m sure they’re good for holding pieces of cardboard together or something. I bought 6 to use for gluing skateboard decks together (making a guitar), but none of them held. Even when I tried to apply all 6 they’d all just slowly loosen up.",
      "rating": 3.0,
      "verified": true,
      "author": "Zachary",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Great bar clamp",
      "text": "This bar clamp is excellent, good sturdy construction and it is reversible so it an be used to compress or expand.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Slides closed even when the release button is not pressed",
      "text": "The clamp will slide shut with gravity even without pressing the release button. Ideally, a good product would only move when the release button is pressed. This may be a design feature I missed when reading the description - nonetheless, I don't like it sliding except when I expressly want it to slide.",
      "rating": 3.0,
      "verified": true,
      "author": "isotope493",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Cheap",
      "text": "It barley clamp anything in place. The clamp is very cheap in quality. I was trying to clamp two pieces of wood and drill a hole, but half way it lost it's grip. Save your money and get a real clamp.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Chu",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Wrong advertisement",
      "text": "These do not “ratchet “ as stated in the description. I specifically purchased these for that reason. WTH!",
      "rating": 1.0,
      "verified": true,
      "author": "Eric S.",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Cheapo",
      "text": "You get what you pay for I guess. I purchased 4 of the 36 inch and two of the 24 inch. I'm only a wood hobiest so I couldn't justify dishing out big bucks for the big name clamps. These clamps are next to impossible to release when they are clamped tightly. The release button is about half the size of a dime and partially recessed into the handle. I'm 6'4 and 230 pounds and the only way I can release them is to hit they sharply with a hammer. They work OK for a weekend wood warrior but keep your hammer handy when you need to release them.",
      "rating": 2.0,
      "verified": true,
      "author": "Ron W",
      "helpful_votes": 0,
      "publication_date": 20150327
    },
    {
      "title": "As designed it's not particularly robust, but decent for ...",
      "text": "As designed it's not particularly robust, but decent for light work. The clamp is prone to failure as the trigger mechanism pushes the handle halves apart when pulled. As such mine failed at the pin joint after a week. After I reassembled the clamp and constrained the two halves with a 1\", 1/4-20 bolt and nut it has been able to hold much higher loads for a month now. If Tekton spent the extra 10 cents to do this themselves or just added a couple more screw connections at this failure point they'd have a much stronger product that'd be worth five stars, but alas.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170706
    },
    {
      "title": "Poorly made",
      "text": "Very lightweight. Not much clamping power. The curved squeezing handle makes it uncomfortable and the handles are too small.",
      "rating": 2.0,
      "verified": true,
      "author": "furionsavage",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "If you're not a contractor or doing wood work every weekend, buy this instead of the more expensive ones.",
      "text": "Haven't had a chance to really test drive these yet, but I was considering a clamp for almost 2x the price. I'm glad I got these instead. It seems very high quality, especially for the price. I plan to use this on several small projects and don't need anything professional grade. I'm glad I got these.",
      "rating": 5.0,
      "verified": true,
      "author": "Gilbert Chan",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "They did not hold up over time",
      "text": "Yes they are inexpensive but after about a year of use - they no longer work well. I would not recommend them.",
      "rating": 2.0,
      "verified": true,
      "author": "Ralph May",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Good product",
      "text": "I've got a dozen or more clamps in my shop. I bought two of these and they are my 'go to' clamps.",
      "rating": 5.0,
      "verified": true,
      "author": "Foxfire",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Excellent Wood Clamps",
      "text": "Woodworking is my hobby and these clamps worked quite well for the projects that I've been working on. For any larger projects, I may need to purchase additional clamps, but that would be a no-brainer. Yes, I'd buy them again.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael R Emmert",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "A great handy tool you never knew you always needed!",
      "text": "Doesn't everyone collect clamps? Well, we kind of due. Clamps are not just for the woodworkers of this world. They can hold down a Lazy Kate while Spinning, or keep a project form moving around while working on it, it even works for an impromptu hook for holding cord within reach. Everyone needs one or two of these in their junk drawer. The Mini 6\" is just enough for most household small items and is easy to store. A great handy tool you never knew you always needed!",
      "rating": 5.0,
      "verified": true,
      "author": "Chronarchs",
      "helpful_votes": 0,
      "publication_date": 20150906
    },
    {
      "title": "Excellent ratchet clamps.",
      "text": "I bought a few of these ratchet type of clamps few weeks ago and they work just fine when using them to glue tight wooden boxes. They are easy to clamp fast and hold the power well without slippage. I was skeptical initially due to low price but they are proving to be an excellent value. Tekton seems to be trying to move upwards in quality while still holding their initial price point at the low end, and that is a good thing for consumers.",
      "rating": 5.0,
      "verified": true,
      "author": "Max™",
      "helpful_votes": 0,
      "publication_date": 20150708
    },
    {
      "title": "sturdiness",
      "text": "Adjustable clamp keeps sliding up and down shaft when not in use, won't stay in one position until tightened.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Very Well Made and Priced Right",
      "text": "I use a stitching pony at my leather craft table.. I bought these to clamp it to the table. They are very strong and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "It's ok.",
      "text": "Its ok. The clamp is not very strong and I find it slipping a lot because it cannot hold the pressure. Also the cheap plastic parts on the two tips keep falling off. I wouldn't use this for anything that you need to be clamped together with a lot of pressure.",
      "rating": 3.0,
      "verified": true,
      "author": "Daniel Barcus",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "Don't Clamp on to these",
      "text": "Cheap Stuff. Not strong enough to hold anything together, maybe 2 pieces of paper. And the red pieces on the ends keep falling of. So, what are these used for?",
      "rating": 1.0,
      "verified": true,
      "author": "tom russo",
      "helpful_votes": 2,
      "publication_date": 20171225
    },
    {
      "title": "Not well-made, cracked. Could have injured me.",
      "text": "This thing is NOT well-made. I hand-tightened using one hand and it snapped in multiple places. The plastic is not strong enough for this use. Buy something else.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew Meyer",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Buyer beware",
      "text": "One clamp holds about 10 lbs of force, the other clamp only holds the ratchet arm in place. Buyer beware-this product does not work for its intended purpose.",
      "rating": 1.0,
      "verified": true,
      "author": "Nea",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Great clamps for wordworking",
      "text": "Just starting to get into some woodworking and these seem to work great for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason J W",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Good clamp for money but clamp I reieved was missing red clamp covers",
      "text": "Like this clamp and believe it was a good value for the price ($10). Although it works well in general, I find button release can be difficult to use when trying to release items clamped very tightly. Mine also came without the red plastic clamp covers , so I have to be very careful to avoid damaging clamped items. UPDATE: Upping to 4 stars - Seller sent replacement clamp with red plastic covers",
      "rating": 4.0,
      "verified": true,
      "author": "Kayly",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "Broke after 3 days",
      "text": "We used this 3 times holding together lumber on a relatively small woodworking project. Today, it broke in my husband's hand. I guess it's disposable.",
      "rating": 1.0,
      "verified": true,
      "author": "VAMom",
      "helpful_votes": 14,
      "publication_date": 20140625
    },
    {
      "title": "Pretty strong clamps for such a compact size",
      "text": "Pretty strong clamps for such a compact size! I used one extensively for a few months but it recently broke. The plastic trigger part deformed under stress, and now it remains stuck in the depressed position. Given the price point it's still a decent value, but I'd rather spend a bit more for higher quality parts.",
      "rating": 3.0,
      "verified": true,
      "author": "as",
      "helpful_votes": 6,
      "publication_date": 20151227
    }
  ],
  "product_meta": {
    "title": "TEKTON Mini 6-Inch x 1-1/2-Inch Ratchet Bar Clamp and 9-Inch Spreader | 39180",
    "description": "Size:Mini 6 in.Perfectly sized for model-making, crafts, small projects, and tight spaces, the TEKTON Mini Ratchet Bar Clamp / Spreader applies precise, consistent pressure to hold workpieces together for gluing or assembly. Press the quick release button to freely position the jaw, then squeeze trigger to apply pressure. Once set, jaw is locked and will not creep. Soft jaw pads offer sure grip, but won't damage surfaces. When the job is finished, simply press the quick release button to let go of workpiece. If you need to push pieces apart or press them against outside surfaces, convert clamp to spreader by loosening wingnut and moving fixed jaw to the opposite end of bar.\n\nFROM THE MANUFACTURER\nAn essential tool for wood-working, the TEKTON 6-Inch by 1-1/2-Inch Ratchet Bar Clamp is perfect for holding small projects together. Constructed with a super-strong nylon jaw. Trigger action applies precise clamping force and positions jaw instantly along bar with quick release button. Ratcheting action is smooth, silent and precise. Soft jaw pads will not scratch or mar work piece surfaces. Bar clamp jaws convert for use as spreaders. The clamp is backed by a lifetime replacement guarantee. So, go ahead, Take It On. Specifications: Jaw Capacity: 6-Inch; Throat Depth: 1.5-Inch.",
    "rating": 4,
    "feature_bullets": [
      "Continuous, trigger-operated ratchet action applies precise and consistent pressure",
      "Press quick release button to freely slide jaw to any position",
      "Strong reinforced nylon jaw assemblies",
      "Soft jaw pads grip workpiece and protect surfaces from damage",
      "Convert from clamp to spreader by placing fixed jaw on opposite end of bar",
      "Drop Forged, Heat Treated Steel Jaws",
      "Precision-machined Jaws and Pivot Joints",
      "Comfortable Non-Slip Cushion-Grip Handles",
      "Four Home Fashion Floral Prints",
      "Multi-purpose Jaws Grip Flat-sided and Round Fasteners, Pipe and Cut Wire"
    ],
    "specifications": {
      "Manufacturer": "Michigan Industrial Tools",
      "Part Number": "39180",
      "Item Weight": "3.04 ounces",
      "Product Dimensions": "10 x 4.3 x 0.7 inches",
      "Item model number": "39180",
      "Is Discontinued By Manufacturer": "No",
      "Size": "Mini 6 in.",
      "Material": "Nylon",
      "Item Package Quantity": "1",
      "Number Of Pieces": "1",
      "Number of Handles": "2",
      "Included Components": "",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "Always Guaranteed: support@tekton.com",
      "ASIN": "B000NY4UDQ",
      "Customer Reviews": "4.0 out of 5 stars2,212 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#3,705 in Tools & Home Improvement",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "March 3, 2007"
    },
    "categories": [
      "Clamps",
      "Hand Tools",
      "Tools & Home Improvement",
      "Power & Hand Tools",
      "Bar Clamps"
    ],
    "price": 6.62
  }
}