{
  "website_summaries": [
    {
      "verdict": "Tough, no-nonsense construction with reinforced toe guard and bumper. Best choice for extreme wear.",
      "pros": [
        "Attractive contrast stitching detail around main panels",
        "Molded sole with anatomic design to protect feet with every step",
        "Top-notch slip resistance",
        "Comes with leather treatment that is effective at waterproofing"
      ],
      "cons": [
        "On the bulky side,  and slightly heavier than other Blundstone boot styles"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "and I have to say that they don't fit like the first four",
      "text": "I'm a huge fan of Blundstone boots. I am very hard to fit (wide feet!) and Blundstones are a dream come true for me. These Bump-Toe's are my fifth pair, and I have to say that they don't fit like the first four. I attribute that to their work boot heritage; they are a heavier grade of leather, it seems, and aren't quite as supple and comfortable right out of the box. I have high hopes that they will break in to a long lasting and (more) comfortable boot. For buyers new to Blundstone - beware the sizing difference between US and AUS standards. These 7.5 boots equate to a US 8 1/2 wide. Check sizing carefully when you order.",
      "rating": 4.0,
      "verified": true,
      "author": "Jon McPherson",
      "helpful_votes": 4,
      "publication_date": 20170425
    },
    {
      "title": "Best boot for HVAC",
      "text": "These last me a good 8 months at a time. Doesnt sound like a lot, but I do HVAC 12 hours a day 6 days a week in Arizona heat with constant kneeling or walking on scolding hot shingles. Could probably squeeze another month or two out of them easily, but why bother running the rubber completely bare. The leather itself is in great shape, the bump toe really keeps the leather by your toes from wearing out too fast if you spend alot of time kneeling or sitting down in tight spaces. Definitely lasted me longer than my Ariats or Redwings did.",
      "rating": 5.0,
      "verified": true,
      "author": "Mister Wispies",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Sturdy boots, weatherproof, solid traction, looks nice",
      "text": "I wear these boots just about every day now. I get compliments on the look even though to me they are more of a work boot! Great in the snow, mud, rain, what have you. Easy to take on and off. They took a couple of days to break in but it wasn't a bad process. My feet are wide, especially in the toe I bought a women's 10.5 which is what I normally wear, and they fit great. Highly recommend using the NikWax that comes with the boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Tuula",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "First pair of blundstones and am impressed",
      "text": "Very comfortable out of the box. When I first saw the liners I thought they looked too thin and that I’d probably replace them but I’ve been wearing them for weeks with the liners they came with and have had no discomfort or sore feet working on construction sites all day. This is the first pair of blundstones I’ve ever owned and I’m very impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "Fallout",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Updated Blunnies with the moulded sole.  Great for industrial work use- water and grease resistant, good support.",
      "text": "I'm a Chef, I use these in the kitchen. Good slip resistance, comfortable, with the molded rubber sole that repels water and gunk. Slip on/ slip off is a plus and they look cool. They came with a small pack of leather treatment/ waterproofer (NikWax) that seems pretty good. After several months the leather still looks new and the sole is not worn at all. I expect them to last for a long time. Besides all of that, nothing beats the look of Bludnstones with white socks and shorts. So uncool, that it's totally cool.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Junkie",
      "helpful_votes": 6,
      "publication_date": 20150404
    },
    {
      "title": "Haven't given up yet.",
      "text": "2nd pair of blundstones, loved loved loved my super 550s, but these I've been wearing for 2 months and I can't get em to break in. And the toe protector of course adds the added cautionary line of where/ how the boot material bends above my big toe :-/ unfortunately still to uncomfortable for me to wear 8 hours a day. My 550s I wouldn't wanna take off. These I may have to during the day for some relief.. I'll keep at em...",
      "rating": 3.0,
      "verified": true,
      "author": "jeff",
      "helpful_votes": 2,
      "publication_date": 20170210
    },
    {
      "title": "Comfortable and durable",
      "text": "This is my fifth pair of Blundstone boots, the others were made in AU, wish they still were. The fit on these is a little on the big side, but a thicker pair of socks and they’re perfect. I like the sole on the 490 compared to the 500, or 510- more cushioned. The leather is perfect and so is the stitching. I put some Obenhauffs on them and they’re ready for the snow. All around durable and comfortable boots.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim L.",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "4th pair of blundies",
      "text": "I have been buying these for the last 20 years. my last three have been similar in that I get the bump-toe, or extended rubber sole. Working around machinery I have found that this keeps the boots in better condition and my feet drier. the 490 is from multiple pieces of leather stitched together so I have found that it fits my feet better than the single piece. the seems are well finished, so there is no discomfort.",
      "rating": 4.0,
      "verified": true,
      "author": "John Frederick",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "What an amazing deal on these workhorse boots",
      "text": "What an amazing deal on these workhorse boots, which are beautifully made and fit perfectly. Remember to check sizing (Australian sizes differ from US). From the Blundstone site I learned that half sizes actually do not add length to the boot just extra width. They are perfect for my medium to wide feet. The ankle and front of instep took a few wearings to loosen up but the boots have been incredibly comfortable straight out of the box. I can't wait until mine are as scuffed and broken in as those of all the happy Blunnie reviewers on YouTube.",
      "rating": 5.0,
      "verified": true,
      "author": "kmj",
      "helpful_votes": 0,
      "publication_date": 20170206
    },
    {
      "title": "Problems with breaking the boots in",
      "text": "I had a real problem getting these boots broken in. They fit all right out of the box, but they were rather stiff and took a couple of days of wear before they felt like they had some good flex to them. My problem was that the boots remained really very stiff around my shins and calves; and after about a week, I got a painful bruise on my left shin that made walking in the boots really uncomfortable. After a few weeks of this, I finally sent the boots back; I just could not get them broken in.",
      "rating": 2.0,
      "verified": true,
      "author": "Alex N.",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Great boot!!",
      "text": "I first saw these boots being worn by one of the main characters on Criminal Minds. I liked their style so I did some research on this boot. The reviews were top notch. These are my first pair of slip on boots that are ankle height. They arrived yesterday and I was not disappointed. I love the look and they fit as expected. I used the Nikwax that was included in the box and gave the leather a nice coat of wax. They look sharp and are comfortable. They should now be ready for the rain.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Wolfe",
      "helpful_votes": 0,
      "publication_date": 20151110
    },
    {
      "title": "Poor quality",
      "text": "The 490 series are nothing like the originals. The fit is off and they’re super uncomfortable. I’ll be returning these and going back to the OGs. Also they feel super cheap. Like Walmart cheap. It says made in Vietnam. Guess there’s no such thing as made in country of origin anymore. I’m bummed. Stick with the originals!",
      "rating": 1.0,
      "verified": true,
      "author": "Matt Douglas",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Great Shoes",
      "text": "Bought this for my grand daughter who is a horsey girl. It's her second pair. The first pair took 4 years to wear out and she loved the old ones and loves the new ones. They are great shoes for all the stress that comes with barn work and riding.",
      "rating": 5.0,
      "verified": true,
      "author": "tobrina",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "perfect all the time boot",
      "text": "These are all my husband has worn for the past 6yrs! He usually has 2 pairs a nice pair & a work pair that are more beat up. Then when the work pair dies he switches the nice (week end) pair to his work pair & I buy him new ones. He loves them! In his line of work (glazier) he is on his feet all day & up and down ladders. He does have very high arches, so wears special insoles with them. We find each pair lasts about 2yrs, but he is VERY hard on his shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "kathlin",
      "helpful_votes": 0,
      "publication_date": 20131112
    },
    {
      "title": "Very good quality boots",
      "text": "They are very good quality boots. It maintains its smart look after regular use. Few things I want to point out 1) They are not necessarily made to keep your feet warm. 2) You can not run with them. It hurts above the heels. I guess that is true with any boots. 3) When you remove the boots, it pulls the socks with it. Not a big deal though. 4) Tough material. Bit unwieldy. Supposed to get better with regular wear. 5) Everyone I meet love the look of the boots. 6) Not sure if they are waterproof. I am talking about short walk in the rain or 2 inches of snow.",
      "rating": 4.0,
      "verified": true,
      "author": "Swarup",
      "helpful_votes": 3,
      "publication_date": 20140116
    },
    {
      "title": "Fit perfectly",
      "text": "Grandson loved the boots. They fit perfectly. Great outdoor boot",
      "rating": 5.0,
      "verified": true,
      "author": "Diane B",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "but they have obviously never worn a truly comfortable pair of boots",
      "text": "I'm not sure who these 5-star reviewers are, but they have obviously never worn a truly comfortable pair of boots. The sole of these boots was good, but the leather upper seemed thin and flimsy (the ridge of the inner toe cap could be seen through the upper of the left boot) and there was no arch support at all. They were returned.",
      "rating": 2.0,
      "verified": true,
      "author": "Marigold",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Best boot ever",
      "text": "These are amazing very little if any break in time",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda Burns",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "The shoes are quite comfortable and durable",
      "text": "The Product does run large on the shoe size. I returned the first set of size 9, my typical shoe size, and replaced them with a pair of size 7 1/2. The shoes are quite comfortable and durable. I would recommend them for everyone that are on there feet all day doing light construction.",
      "rating": 4.0,
      "verified": true,
      "author": "Chan",
      "helpful_votes": 0,
      "publication_date": 20150907
    },
    {
      "title": "Best boots ever",
      "text": "Best boots ever, can be worn all day without pain or pinching. Warm with thick socks. Waterproof if you use the wax enclosed and take care of the boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Five Stars",
      "text": "Thease shoes are great!!! Amazon works fantastically!!! Thanks from Belgrade, Serbia, Europe :)",
      "rating": 5.0,
      "verified": true,
      "author": "zeljko",
      "helpful_votes": 0,
      "publication_date": 20150910
    },
    {
      "title": "Rock'n boots",
      "text": "This is my favorite style of Blundstone boots! Good fit and so versatile. I work, ride horses, do barn chores, go to town in these boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "great fitting sturdy boots",
      "text": "These are the most sturdy boots and have the best support and comfort ever! They provide excellent stability and there is a nice protection at the roomy toe area. I have another pair that have been worn daily for the past six years, sole still in great shape after years of wear!",
      "rating": 5.0,
      "verified": true,
      "author": "kitty says",
      "helpful_votes": 0,
      "publication_date": 20140419
    },
    {
      "title": "Super Comfortable...",
      "text": "This is my 2nd pair of Blundstone boots, purchased the 584 winter boots and loved them right out of the box. I needed a pair of lightweight construction boots, so I got these 490's. They too are very comfortable and well built... love-em",
      "rating": 5.0,
      "verified": true,
      "author": "grizz",
      "helpful_votes": 0,
      "publication_date": 20150501
    },
    {
      "title": "All round winner!",
      "text": "True to size right out of the box. Bought a second pair because the price was right. I have worn them working in the garden,working on ladders, in the welding shop and even to Church, need I say more about my Blundstones versatility? Happy, happy, happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry Harrison",
      "helpful_votes": 0,
      "publication_date": 20150828
    },
    {
      "title": "buy now",
      "text": "Wow even better than my 550, the only issue I had with the 550's was the toes scuff easy when at job sites, the bump toe eliminates, this issue. My only choice in boots....",
      "rating": 5.0,
      "verified": true,
      "author": "PWR",
      "helpful_votes": 0,
      "publication_date": 20150828
    },
    {
      "title": "Five Stars",
      "text": "Great product, love this booties. too bad they have discontinued",
      "rating": 5.0,
      "verified": true,
      "author": "Gaily",
      "helpful_votes": 0,
      "publication_date": 20170414
    },
    {
      "title": "and should be good after i get the one boot broken in",
      "text": "One boot it and broke in well. The other I have had to work to break in at the front break of my ankle. They fit well, and should be good after i get the one boot broken in.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150803
    },
    {
      "title": "My favorite boots on the planet",
      "text": "I love the look and comfort of these. I own 4 pairs of Blundstones and these are my \"dressing up\" ones. Blundstone is getting rid of these and replacing with a new model that also looks very good.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Riley",
      "helpful_votes": 0,
      "publication_date": 20140807
    },
    {
      "title": "Great work boot!",
      "text": "These are a hardworking boot with a rugged sole, but are very comfortable. Husband loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellen",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "Not what they used to be..",
      "text": "Blew out within 10 months of medium wear. Not what they used to be.",
      "rating": 1.0,
      "verified": true,
      "author": "RN",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Order 1/2 size smaller.",
      "text": "Size US10 (my usual size) was way too big. Returned for size US9.5 which fit fine (immediately ordered a second pair. On sale at a great price!",
      "rating": 4.0,
      "verified": true,
      "author": "N. Bessie",
      "helpful_votes": 0,
      "publication_date": 20150912
    },
    {
      "title": "Best boot",
      "text": "I've been wearing nothing but Blundstones for years. The 490's have a larger toe box than the 500 series.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Howard",
      "helpful_votes": 0,
      "publication_date": 20150721
    },
    {
      "title": "Love the boots",
      "text": "Love the boots. KNOW YOUR SIZING - I wear a US 9.5, UK 42 AU 7.5 and these are spot on. Great Romeo boot.",
      "rating": 5.0,
      "verified": true,
      "author": "UltimateGearGuide",
      "helpful_votes": 0,
      "publication_date": 20151110
    },
    {
      "title": "Great boot.",
      "text": "Second pair I have owned. Loved the first one so much, I reordered when they wore out after many years of use.",
      "rating": 5.0,
      "verified": true,
      "author": "diva",
      "helpful_votes": 0,
      "publication_date": 20150222
    },
    {
      "title": "they look better when worn for a",
      "text": "Fit and durability, they look better when worn for a while",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica L.",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Love Love Love Blundstones!!!",
      "text": "You can't go wrong with Blundstones! Once you own one pair you will become an addict!!! They are designed for comfort and durability and you will not be disappointed. This is my first Bump toe pair and I love them. Got my husband a pair too and he is now asking for more.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd McMillan",
      "helpful_votes": 0,
      "publication_date": 20150805
    },
    {
      "title": "ozzys do it right",
      "text": "These are the best boots, super comfortable, great quality and durability, they shine up the tits, and pop on and off.. I love them, great buy too.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregor N.",
      "helpful_votes": 0,
      "publication_date": 20160226
    },
    {
      "title": "Why did I ever bother with Redbacks",
      "text": "Fit as expected. Didn't take any time to break in. No slipping on wet or greasy tile floors. 10 hour work day, no comfort issues at all. 490 model much more rugged.",
      "rating": 5.0,
      "verified": true,
      "author": "Mister M",
      "helpful_votes": 0,
      "publication_date": 20160327
    },
    {
      "title": "SIZING???",
      "text": "Could not fit foot into show. Sizing = ????? Blundstone's are great.shoes. Will reorder Blundstone #550's. Sizing chart could be more clear.",
      "rating": 2.0,
      "verified": true,
      "author": "henry r. dulik",
      "helpful_votes": 0,
      "publication_date": 20140214
    },
    {
      "title": "Three Stars",
      "text": "Great boots but fit a bit smaller than some Blundstones",
      "rating": 3.0,
      "verified": true,
      "author": "Kim Ackerman",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "Greatest Boot In The World",
      "text": "This is my second pair, my other ones are two years old and still going strong. I bought these because just the very thought of life without my \"Blunys\" is unbearable. Yes it is possible to love a shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "Sugarfingers",
      "helpful_votes": 0,
      "publication_date": 20140109
    },
    {
      "title": "Best boot ever",
      "text": "I have five pair of Blundstone boots, if they made a boot sneaker I would buy it. Just the best in fit, comfort and quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Francis J. Leroy",
      "helpful_votes": 2,
      "publication_date": 20130201
    },
    {
      "title": "Great Boot Purchase",
      "text": "Great Purchase. Husband loves these boots and this is a great price!!! Arrived in just a few days. We are happy he will have a new pair to replace the tired pair he currently has.",
      "rating": 5.0,
      "verified": true,
      "author": "Veronica",
      "helpful_votes": 0,
      "publication_date": 20120404
    },
    {
      "title": "great boots for all occasions!",
      "text": "great boots! This is my third pair in 15 years.",
      "rating": 5.0,
      "verified": true,
      "author": "ducatiflip",
      "helpful_votes": 0,
      "publication_date": 20141119
    },
    {
      "title": "Great Shoes.",
      "text": "Second pair... Maybe there were some quality issues in the past, but mine have been great. worn daily. I will have a third pair",
      "rating": 5.0,
      "verified": true,
      "author": "mike holland",
      "helpful_votes": 0,
      "publication_date": 20150620
    },
    {
      "title": "well constructed",
      "text": "Brutally painful for a week,,,, love them now! Great quality leather, I think they'll last several years because I can't wear them for more than an hour at a time",
      "rating": 3.0,
      "verified": true,
      "author": "Terri hebert",
      "helpful_votes": 0,
      "publication_date": 20131023
    },
    {
      "title": "Five Stars",
      "text": "awesome boot 3rd pair of blundstones, will always wear blundstones",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony S.",
      "helpful_votes": 0,
      "publication_date": 20150701
    },
    {
      "title": "Five Stars",
      "text": "I love these boots. They are so comfortable and look great!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Appleton",
      "helpful_votes": 0,
      "publication_date": 20141005
    },
    {
      "title": "second pair, won't be the last",
      "text": "Love these boots, only shoe I wear. Working on the farm, with a skirt to a show, town day, visiting in-laws, summer to winter. First pair lasted 4 years of continuous use.",
      "rating": 4.0,
      "verified": true,
      "author": "juniper",
      "helpful_votes": 0,
      "publication_date": 20130108
    }
  ],
  "product_meta": {
    "title": "Blundstone 490 Bump-Toe Boot",
    "description": "Blundstone's 490 boot is a great companion for long days at work. This anatomically correct design features a removable moisture-wicking insole and a dual-density rubber outsole for a comfortable step, while its Shock Prevention System significantly reduces your risk of being shocked when on the job.\n\nBlundstone has been making sturdy and unique boots in Tasmania, Australia, since 1870. The family-owned company has maintained the quality, integrity and authenticity of their products for over 130 years. Blundstone boots are no-nonsense, go-anywhere, do",
    "rating": 4.2,
    "feature_bullets": [
      "100% Leather",
      "Imported",
      "Synthetic sole",
      "Shaft measures approximately 4 1/2\" from arch",
      "Heel measures approximately 1.5 inches\"",
      "Boot opening measures approximately 9\" around",
      "Side gore panels for easy on and off. Sturdy front and back pull-on tabs. Kick toe styling for an aggressive look. Twin-needle reinforced stitching with a high tensile strength thread. Synthetic leather lining for a comfortable fit. Removable Xtreme comfort EVA footbed with XRD® heel and forepart inserts providing greater underfoot comfort. Shock Protection System (SPS) disperses shock at the heel strike and reduces skeletal stress on the feet, knees, and vertebrae. Heat-formed heel for a",
      "Comfort and quality come together with this rugged boot.",
      "Style number: BL490 (Brown).",
      "Premium oil tanned leather upper.",
      "Work boot with electrical hazard protection."
    ],
    "categories": [
      "Men",
      "Boots",
      "Shoes",
      "Clothing, Shoes & Jewelry",
      "Chelsea"
    ],
    "price": 204.95,
    "specifications": {}
  }
}