{
  "website_summaries": [
    {
      "verdict": "A stainless steel manual egg beater that's easy to use and clean.",
      "pros": [
        "Stainless-steel beater with plastic grips on the handles",
        "Easy to turn the handle",
        "Blends ingredients together quickly and with minimal effort",
        "Easy to wipe clean"
      ],
      "cons": [
        "Not dishwasher-safe",
        "Some users have complained that it doesn't rotate smoothly"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Simply grand",
      "text": "I bought this egg beater for my 85 year old mother, who still cooks & bakes regularly. She LOVES it! She said it's the best one she has used in all her years, that the metal beater blades are slimmer than on a traditional beater which allows them to turn swiftly and do a thorough job. She is impressed at how sturdy yet light this egg beater is. If any kitchen product earns Mom's high praise... it must be A+A+A+ !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mickey",
      "helpful_votes": 25,
      "publication_date": 20181205
    },
    {
      "title": "it worked great, my grandchildren loved being able to mix with ...",
      "text": "I took this for travel baking, it worked great, my grandchildren loved being able to mix with it, They are 8 & 9. It works nice with their small hands. Also with my small hands. Just like we had MANY years ago. Great non-electric appliance!",
      "rating": 4.0,
      "verified": true,
      "author": "D lively",
      "helpful_votes": 18,
      "publication_date": 20170906
    },
    {
      "title": "Poor quality",
      "text": "Poor fit and finish, gears get out of sync and you can't turn the handle unless you manual force the beaters to be recentered.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 19,
      "publication_date": 20170405
    },
    {
      "title": "Hard to Use Egg Beater",
      "text": "This egg beater is much harder to use than the old one I had for 30 years which was made completely of stainless steel and whose gears turned much easier. Alas, it broke after 30 years, and this looked to be the best one I could replace it with, but it is not very good.",
      "rating": 3.0,
      "verified": true,
      "author": "Orco",
      "helpful_votes": 6,
      "publication_date": 20190519
    },
    {
      "title": "This product was inexpensive and arrived quickly. Unfortunately it ...",
      "text": "This product was inexpensive and arrived quickly. Unfortunately it does not work nearly as well as the much older one it replaced. Our old one had the flat blades while the end that goes into the whip cream on this one is just round metal rods. The end result is that it splatters more and takes longer to whip the same one. It would cost $6 to send it back so it's not worth it. But considering that it also feels very cheaply built I am not confident about it's lifespan. TL;DR: You may want to buy something else if you're going to use this for whip cream.",
      "rating": 2.0,
      "verified": true,
      "author": "shovenose",
      "helpful_votes": 13,
      "publication_date": 20141111
    },
    {
      "title": "Came apart after 6 weeks",
      "text": "Worked for 6 weeks and then the small piece that holds the handle in fell out and will not go back in permanently. Amazon's 30-day return window passed so I guess I can't return it. The last one I had just like this lasted for almost 10 years. Very disappointed because we use this often for eggs.",
      "rating": 1.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 10,
      "publication_date": 20160309
    },
    {
      "title": "This is the Classic egg beater design.",
      "text": "Design is classic. I'm a lucky man in that my wife likes old school stuff as gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Duck Chaser",
      "helpful_votes": 2,
      "publication_date": 20200512
    },
    {
      "title": "Recommend",
      "text": "Great products. Easy to use, easy to clean. I've been using it ever since I got it. Seems to be very well made. Recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 2,
      "publication_date": 20200108
    },
    {
      "title": "Worked as expected.",
      "text": "I used it 4 times and it did what I expected it to do. Seemed well made and not to difficult to use or clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary W. Williams",
      "helpful_votes": 2,
      "publication_date": 20200112
    },
    {
      "title": "Smooth operation",
      "text": "I purchased the Norpro hand-cranked egg beater two years ago and love using it. It operates smoothly left handed and right handed - backward and forward. It is easy to clean by hand or put in the dishwasher.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 2,
      "publication_date": 20190930
    },
    {
      "title": "Save yourself the aggravation, don't buy this.",
      "text": "The product is heavy, clunky, not very efficient, and not a pleasure to use. It is like something I would expect from a Siberian factory from the mid 50's. My previous one was a delight and I used it for 40 years and it was probably 50 years old when I got it at a second hand store, but it gave up the ghost. This item is almost useless. I mostly just use a whisk now until I can find another antique one to replace my last one.",
      "rating": 2.0,
      "verified": true,
      "author": "Pierce C. West",
      "helpful_votes": 17,
      "publication_date": 20131126
    },
    {
      "title": "wouldn't bother, just use a whisk.",
      "text": "due to the plastic used in the gears it is both really hard to turn and feels like it might break with how hard you have to turn it. it is better than using a whisk but not by much.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Bleiweiss",
      "helpful_votes": 2,
      "publication_date": 20180317
    },
    {
      "title": "Good 'egg beater'",
      "text": "Classic 'egg beater'. Well built, works smoothly, my wife likes it because it gives good control over fast vs. Slow beating. Round stainless steel beaters are easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160811
    },
    {
      "title": "Made well!",
      "text": "My husband was mad at me for getting rid of our antique egg beaters. I bought this one for him and we both use it. It is well made and perfect for small mixes when you don't want to clean up the Kitchen Aid!",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Hernandez",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "nice little hand mixer",
      "text": "I like having a sturdy manual hand mixer. This one is perfect. Rounded blades are easier to clean thoroughly. All stainless steel too. Not wobbly. Hasn't shown any rusty areas. Good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "sunnygirl",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Good hand mixer",
      "text": "Nice mixer if you enjoy old time stuff. It does a pretty good job mixing but it needs to be rinsed right away otherwise hard to clean",
      "rating": 5.0,
      "verified": true,
      "author": "refourre",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Defect",
      "text": "First time we used this product the screw fell off that kept the handle in place. Will return if I can find the packing information.",
      "rating": 1.0,
      "verified": true,
      "author": "Judy Gilman",
      "helpful_votes": 2,
      "publication_date": 20200426
    },
    {
      "title": "Simple, basic, sturdy, uncomplicated!",
      "text": "The headline says it all. I use it whenever I need to mix something quickly and completely...and don't have to drag out something more complicated!!",
      "rating": 5.0,
      "verified": true,
      "author": "Po Valley Indian",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "It’s old time magic!",
      "text": "Makes a lot of cooking tasks easier. Also reminds me of how my mother used to do it. Does not require electricity so you can take it anywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Awesome awesome!!",
      "text": "Haven't had one of these for over a decade. Very happy to have one back in the house. Smooth working, shiny looking, heavy-duty build... Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "The old ways are sometimes the best ways",
      "text": "Sometimes the old school method is the way to go. This is a great product and a great price",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Holcomb",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Great product, great price,arrived on time!",
      "text": "Love that we have an old-school off grid option for hand mixing!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Was jammed up when arrived but has worked perfect since then!",
      "text": "This is as good as the old one I had. It is so convenient to grab this from the drawer and be done with it before you would have a corded one plugged in!",
      "rating": 5.0,
      "verified": true,
      "author": "Careful Buyer",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Very impressed with this egg beater. WOW",
      "text": "This item is sooo much better than I expected. Turns easy, dishwasher safe, sturdy. I am very pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Legacy Creation",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Not worth it.",
      "text": "I like hand beaters, but this one didn't last long at all. Choose another one.",
      "rating": 2.0,
      "verified": true,
      "author": "Shelley",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Good hand mixer",
      "text": "I use it for scrambling eggs. It is so much easier than a whisk.",
      "rating": 4.0,
      "verified": true,
      "author": "Doc IA",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Excellent Product, Well Made",
      "text": "This whips egg whites beautifully. It's strong and sturdy. Very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Christian Jones",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Happy Father's Day",
      "text": "My Dad has been honing his crepe recipe for years and I finally decided he needed to graduate to a better manual beater besides a fork. He loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "sturdiest eggbeater I've ever used!",
      "text": "use my eggbeater for eggs, cake mixes, dips and sauces! It's quick and convenient. A must for someone who loves to cook!",
      "rating": 5.0,
      "verified": true,
      "author": "kit",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Old School!",
      "text": "A little hard to turn but I got it for nostalgia's sake! It does work though. Good for scrambled eggs and liquids!",
      "rating": 4.0,
      "verified": true,
      "author": "J Notlimah",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Good",
      "text": "Got this as a gift for my dad. It was better quality than what he was expecting. I recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer ",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "A must have for the kitchen for every day mixing.",
      "text": "I use it almost every week. I haven't had to get the electric mixer out since we purchased the hand one. It works great for beating eggs and mixing most thin batters. Easier to clean than the electric mixer.",
      "rating": 5.0,
      "verified": true,
      "author": "William B Ridge",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "It's sturdy, cleans easily",
      "text": "It's sturdy, cleans easily, and works as well as the egg beaters I remember from my 50's childhood. I use it 3-4 times a week. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Dixie A. Moore",
      "helpful_votes": 2,
      "publication_date": 20170910
    },
    {
      "title": "Well made.",
      "text": "My Mom loved this gift she requested for Christmas! She said it is very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah E Mitchell",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Love!",
      "text": "You can only find the electric hand held ones in the store anymore and they're over priced and made cheap! This is sturdy and reminds me of Grandma's!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sherri",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Pretty cool",
      "text": "Pretty good, but the small plastic piece on the center makes me wonder how reliable it will be after a year or 2.",
      "rating": 4.0,
      "verified": true,
      "author": "Enzo",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Simple egg beater.",
      "text": "Simple, uncomplicated egg beater for when you don't want to take out complicated blenders or mixers. Dishwasher safe.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Ebel",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Hand Beaters",
      "text": "Have been looking for a quality hand beater this is perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Sile Bauriedel",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Surpasses all my expectations. It is a joy to use.",
      "text": "I bought this to replace a rotary beater that I had purchased about 20 or 25 years ago. This new rotary beaterSurpasses all my expectations. It is a joy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Alta Heath",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Works Well!",
      "text": "Great product for those not wanting to spend money on an electric one.",
      "rating": 5.0,
      "verified": true,
      "author": "Audri",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Good enough to beat egg whites to stiff peaks",
      "text": "My old vintage hand cranked beater is falling apart and this is a good replacement. I’ve used it to make eggnog and whip egg whites til stiff. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "She says it works great.",
      "text": "Gift for family member that want it. She says it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Kitten Lloyd",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Not satisfied",
      "text": "Plastic gears mesh into a metal wheel - jammed after 3 uses.",
      "rating": 1.0,
      "verified": true,
      "author": "Mr. Bob",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Works well for whippcream....and eggs",
      "text": "Kind of expensive but does a great job and is environmentally healthy...no use of electricity...",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriella B.",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Beat them up.",
      "text": "I beat my eggs like they owe me money with this thing. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "The Rod",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Norpro egg beater",
      "text": "The Norpro egg beater is an excellent buy. It's very sturdy, and has exceeded expectations. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Melody7473",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Would have liked an egg beater",
      "text": "I received a ladies green top instead of my egg beater! Very disappointed! Am returning for refund 😲",
      "rating": 1.0,
      "verified": true,
      "author": "EstherMPolk",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "So glad I found it available",
      "text": "Easy to use for quick mixing and does not need to take out electric mixer.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynetta Haynes-Oliver",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "I am very pleased with my eggbeater",
      "text": "I am very pleased with my eggbeater. Very sturdy. Delivery was quick. Nice to use instead of dragging out the electric mixer for small jobs.",
      "rating": 5.0,
      "verified": true,
      "author": "Sylvia Englert",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Great price!",
      "text": "Bought this specific products for the price and that it was metal. First one I had to return because the beaters would get stuck, second one works much better. Still sometimes it hesitates, but for quick and easy mixing I love having it in the kitchen.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Gorman",
      "helpful_votes": 8,
      "publication_date": 20100502
    },
    {
      "title": "Perfect Sturdy Eggbeater",
      "text": "It is hard to find eggbeaters in local retail stores these days. This one is perfect for what I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Ice Brown Sugar",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Excellent",
      "text": "Easy to use & clean. Makes light work of cake and brownie mixes.",
      "rating": 5.0,
      "verified": true,
      "author": "MW",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "Beaters are perfect. Thank you for offering the Beaters",
      "text": "Beaters are perfect. Thank you for offering the Beaters.. They are for my 97 year old Mom, and she is thrilled with them",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy R. Bojko",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "Cheap cheap cheap",
      "text": "Flimsy construction. Feelings like it worn out even when new.",
      "rating": 2.0,
      "verified": true,
      "author": "graham d.",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Seems to be good quality so far",
      "text": "Just what i was looking for. Seems to be good quality so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Retro Kitchen Gadget",
      "text": "I remember my mother using one of these hand beaters to make meringue. That was more than 30 years ago. I was really surprised to find a new one all these years later. I'm delighted with my Norpro hand beater. It works!!",
      "rating": 4.0,
      "verified": true,
      "author": "Jo Taylor",
      "helpful_votes": 0,
      "publication_date": 20101123
    },
    {
      "title": "Arrived with jammed gear, didn't work...",
      "text": "Perhaps this happens with only one in a thousand, but the egg beater arrived broken, with a jammed gear. More likely 1 in 100 as those nylon gears (not like the metal ones of the old days) break after awhile anyway. Made me wonder, don't they even crank the thing once to make sure it works before packaging it? I bought a good balloon whisk instead and I love it!",
      "rating": 1.0,
      "verified": true,
      "author": "Far North",
      "helpful_votes": 15,
      "publication_date": 20101007
    },
    {
      "title": "Norpro Rotary Egg Beater",
      "text": "This was a great choice. The egg beater works perfectly and it is very sturdy! I would highly recommend this egg beater.",
      "rating": 5.0,
      "verified": true,
      "author": "Dolores",
      "helpful_votes": 0,
      "publication_date": 20140204
    },
    {
      "title": "Egg beater",
      "text": "Works pretty well. Good for the price, would recommend it. Be sure that parts are where they should be if you try to whip brown rice flour or something thick, the blades could stop working, make sure upper part where gear is for each blade is where it should be. I recommend Not using this with any kind of gritty flour, as it can muck up the gears. That is my experience.",
      "rating": 4.0,
      "verified": true,
      "author": "Susan E. Pendell",
      "helpful_votes": 3,
      "publication_date": 20100222
    },
    {
      "title": "Not satisfied with the mechanical functioning of the egg beater,",
      "text": "My egg beater's mechanical mechanism sticks when you use it. I requested the supplier send me a new one and when would they send it. I have not heard back from them since 2/13/14.",
      "rating": 1.0,
      "verified": true,
      "author": "Wally Harrelson",
      "helpful_votes": 2,
      "publication_date": 20140217
    },
    {
      "title": "Old Fashioned Success",
      "text": "Just enough to get the job done without having to clear the counter! I have difficulty using a whisk because i don't have good feeling in hands or as strong a grip as I once had. This is more heavy duty than expected and a great value for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Clay Clark",
      "helpful_votes": 4,
      "publication_date": 20130319
    },
    {
      "title": "Actually it's a grandchild who loves it",
      "text": "A grandchild suggested wanting an egg beater for a birthday present. Isn't that weird? Oh well, it was what he wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "John J. Price Jr.",
      "helpful_votes": 0,
      "publication_date": 20130510
    },
    {
      "title": "like to cook and travel",
      "text": "It is sturdy and works on the quick beat like eggs or pudding. Nice looking and cleans easily. Beats smoothly.",
      "rating": 4.0,
      "verified": true,
      "author": "animal lover",
      "helpful_votes": 0,
      "publication_date": 20130716
    },
    {
      "title": "Wobbly Egg Beater",
      "text": "The unit is too wobbly for mixing at fast speed.",
      "rating": 2.0,
      "verified": true,
      "author": "Julie Coddington",
      "helpful_votes": 0,
      "publication_date": 20141220
    },
    {
      "title": "just poor quality control during manufacturing",
      "text": "It works well now that I have straightened the beater support legs. This was done by removing and replacing the rivets. It was not damaged during shipping, just poor quality control during manufacturing.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeffrey Schell",
      "helpful_votes": 0,
      "publication_date": 20141216
    },
    {
      "title": "Doesn't Work Very Well",
      "text": "It locks up every time you use it. Have to keep playing with it to get it to spin freely. Have tried to scramble eggs with it 3 times and have given up on it each time.",
      "rating": 1.0,
      "verified": true,
      "author": "Clay Kersey",
      "helpful_votes": 2,
      "publication_date": 20151031
    },
    {
      "title": "Works Great",
      "text": "It is a hand crank operated egg beater. There is not much more to say. It was shipped fast and the quality is good.",
      "rating": 5.0,
      "verified": true,
      "author": "EliW",
      "helpful_votes": 0,
      "publication_date": 20130218
    },
    {
      "title": "Sometimes ya just need a little none electric mixin!",
      "text": "Nice egg beater. The handle rotates the beater fairly smooth. The gears are plastic and likely to wear out prematurely.",
      "rating": 4.0,
      "verified": true,
      "author": "Sp",
      "helpful_votes": 0,
      "publication_date": 20140306
    },
    {
      "title": "Just what I needed",
      "text": "It was just a little item, but I needed a hand held eggbeater and this was just the thing. Arrived right in time, and is just like one I had once before. Good service all around.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 0,
      "publication_date": 20110424
    },
    {
      "title": "Great",
      "text": "There's no this kind of beater here in South Korea. So when I found this here, I didn't hesitate to purchase. After reading some reviews, I worried about the quality though, but the one that I received, is fine, and works very well. It is a little bit heavy, so it gives me stability when I use this. and the plastic gears something, I think it won't break or wear down easily. I'm satisfied with it very much.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 14,
      "publication_date": 20110130
    },
    {
      "title": "eggbeater",
      "text": "Thought I couldn't find eggbeater. Looked in usual places. Starting with the stores. Finally found on Amazon! My nice eggbeater works very well. I got it for my camper. I was begining to think they weren't made anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "kristy",
      "helpful_votes": 2,
      "publication_date": 20130519
    },
    {
      "title": "Such a handy item for easy mixing.",
      "text": "Could not find this item in any store. So happy not to have to dig out my electric hand mixer every time I need to beat an egg or mix some pudding.",
      "rating": 5.0,
      "verified": true,
      "author": "Evelyn Irvine",
      "helpful_votes": 0,
      "publication_date": 20140104
    },
    {
      "title": "... what I wanted and it works and cleans up great.",
      "text": "It was exactly what I wanted and it works and cleans up great.",
      "rating": 5.0,
      "verified": true,
      "author": "Gail Morrow",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "not happy",
      "text": "I don't know if what I was trying to mix was to thick for this beater but now the blades bang together when I use it. This was about the second or third time I used it. And as another reviewer said it is difficult to mix stuff in the very bottom of the bowl.",
      "rating": 1.0,
      "verified": true,
      "author": "Dennis H. Schneider",
      "helpful_votes": 9,
      "publication_date": 20100131
    },
    {
      "title": "Three Stars",
      "text": "Bought as a gift for a friend she loved it",
      "rating": 3.0,
      "verified": true,
      "author": "Sandra Smith",
      "helpful_votes": 0,
      "publication_date": 20150307
    },
    {
      "title": "Excellent beater",
      "text": "This beater is made out of very tough material and very easy to use. I have used it for eggs, pudding and cakes and it surpasses ANY electric mixer!!",
      "rating": 5.0,
      "verified": true,
      "author": "Floyd E. Booker Jr.",
      "helpful_votes": 0,
      "publication_date": 20100417
    },
    {
      "title": "Arrived broken. Not a surprise since it was just ...",
      "text": "Arrived broken. Not a surprise since it was just packaged in an envelope. Also noted gears are plastic. Returned immediately.",
      "rating": 1.0,
      "verified": true,
      "author": "Curtains",
      "helpful_votes": 3,
      "publication_date": 20170914
    },
    {
      "title": "Hand beater",
      "text": "Have not used it much, but glad i have it if the power goes out. Seemed to me to be a bit expensive, but cost more on other sites.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Kerwood",
      "helpful_votes": 0,
      "publication_date": 20100422
    },
    {
      "title": "Doesn't work",
      "text": "The egg beater came quickly and properly packaged, but it doesn't work well. Went back to square one and asked my brother if I could have our mother's (dating back maybe forty years).",
      "rating": 1.0,
      "verified": true,
      "author": "somorgan",
      "helpful_votes": 7,
      "publication_date": 20101017
    },
    {
      "title": "Given as a gift, and the gift-receiver LOVES using ...",
      "text": "Given as a gift, and the gift-receiver LOVES using this egg beater. Says it's nearly exact to the one she used to own years ago. Works perfectly. Unsure if it is dishwasher safe, gift-receiver handwashes it just to keep it pristine​.",
      "rating": 5.0,
      "verified": true,
      "author": "Mighty Freeper",
      "helpful_votes": 0,
      "publication_date": 20160130
    },
    {
      "title": "Not a good buy!",
      "text": "This egg beater broke the 2nd time I used it. Not a good buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Starrynite",
      "helpful_votes": 0,
      "publication_date": 20150118
    },
    {
      "title": "beat my ass",
      "text": "This is a hand egg beater. What can I say. It works, its sturdy, I like it.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Ahlemann",
      "helpful_votes": 0,
      "publication_date": 20100214
    },
    {
      "title": "Where is my item???? Never received!!",
      "text": "I tracked my package and it says it was delivered...in Williston and it was supposed to go to Alburgh?? I don't see any way to contact the seller....and I am frustrated. What happened? Please contact me - I have never experienced this through Amazon before... Thank you.",
      "rating": 1.0,
      "verified": true,
      "author": "Elisabeth Harris",
      "helpful_votes": 0,
      "publication_date": 20110530
    },
    {
      "title": "High quality.",
      "text": "I spend probably 2-3 hours per day cooking. I have owned a bunch of manual beaters in the past. One broke within a month, one within two. These are keepers. They are just like the ones my grandmother had. They go through the dishwasher fine on the upper rack and unless you drop them the beaters will stay smooth and work efficiently. I am very happy with this purchase and have used them multiple times per week for the past month.",
      "rating": 4.0,
      "verified": true,
      "author": "LRRE",
      "helpful_votes": 8,
      "publication_date": 20180208
    },
    {
      "title": "Product defective on arrival",
      "text": "Got this 15 minutes ago. Took it out of the packaging and you can't spin the crank! Gears aren't meshing properly with the crown wheel! Jerk it to get it started, will go for a partial turn and then lock up again. Totally useless....and I paid $39.00 + for a worthless item. Was fooled by the price, thinking at that price it had to be quality. Wrong! Obviously no one tested this item before it shipped. Online description says \"Body and gears are polished aluminum.\" They are not. Crown wheel is metal but beater gears are nylon. Look closely at the pictures. I'm returning it. Don't buy this item!",
      "rating": 1.0,
      "verified": true,
      "author": "oldb4mytime",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "EZ TO USE/CLEAN",
      "text": "MY DAUGHTER LIKES TO MAKE SCRAMBLED EGGS FOR HER BREAKFAST. SHE DOESN'T LIKE USING THE STICK MIXERS. I RECALLED SEEING MY MOM USE THESE IN THE 60'S WHILE GROWING UP. EZ TO USE, NO PLUGS OR ATTACHMENTS AND JUST SPIN IT CLEAN IN THE BOWL YOU HAD JUST WHIPPED SOMETHING IN! SHE USES THIS MIXER INSTEAD OF A FORK NOW!",
      "rating": 5.0,
      "verified": true,
      "author": "THOMAS HAYMOND",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Old Fashioned Quality!",
      "text": "I wasn't sure this would be so great - my hand me down from Grandma finally fell apart.... I love using the hand beater for eggs, pancakes, and pudding. Most of them looked flimsy. This is sturdy and capable. Recommended",
      "rating": 5.0,
      "verified": true,
      "author": "B.T.",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "(almost) old-fashioned quality",
      "text": "I have purchased several versions of this tool that have been \"modernized\" aka made from cheap plastic parts that quickly strip and fail. When I saw this one just like the one my mom had for years when I was a child, I bought it. My only problem with it is that it still has one set of plastic gears that could potentially be the weak point.",
      "rating": 4.0,
      "verified": true,
      "author": "WackyMom",
      "helpful_votes": 4,
      "publication_date": 20160227
    },
    {
      "title": "Great Find",
      "text": "Just broke my 50+ year old egg beater.......wasn't sure they were even still made. Of course, AMAZON came through with exactly what I wanted!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy Lynn Paolillo",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "looks like pictre",
      "text": "bought this to give to my daughter since she has been wanting one for awhile now. she has not used it yet but seems durable.",
      "rating": 5.0,
      "verified": true,
      "author": "chad",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Poor quality-use a whisk!!",
      "text": "The spin was spastic, so we didn’t even use the egg beater, returning it right away. Very poor quality. Decided to just use either our wire whisk or the whisk feature on our mixer.",
      "rating": 1.0,
      "verified": true,
      "author": "Cecile F.",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Quality, Well Made Hand Egg Beater- A Kitchen Must!!",
      "text": "If you like a good old fashioned egg beater- this is for you!! Nothing beats it (pun intended) for quick beating. Handle fits comfortably in the hand, easy to turn, and beats eggs(and other stuff) faster than you can say lickety split. So glad I found this item- it's a must in the kitchen!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen D. Fennell",
      "helpful_votes": 2,
      "publication_date": 20160523
    },
    {
      "title": "Functions adequately for price.",
      "text": "Product came a little “bent” put got it working. Not as smooth as our previous mixer and doesn’t crank as good as had hoped, but gets the job done.",
      "rating": 3.0,
      "verified": true,
      "author": "Lory & Karlea",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Best egg blender.",
      "text": "Used it the first time today and I was really surprised how well it helped me with my Fritatta.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry Basham",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Best I Have Found in Recent Years",
      "text": "They just don't make these like they used too, but this is the best I've been able to find.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Markes",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Just Okay..",
      "text": "This mixer is a little hard to use, gears don't mesh well and hard to turn, it works, but with some difficulty.",
      "rating": 3.0,
      "verified": true,
      "author": "MLB",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Heavy Duty",
      "text": "I have given up on buying cheap stuff. I would rather pay a little more for high quality. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "great",
      "text": "Been looking for a good quality beater other than plastic and I finally found it ! Works great !",
      "rating": 5.0,
      "verified": true,
      "author": "fortsam",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Almost as good as my mothers",
      "text": "Almost as good as the older ones but NOT quite.... nothing is made like a product out of the 50's",
      "rating": 4.0,
      "verified": true,
      "author": "CynthiaMhuber",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "My son was very happy with this product",
      "text": "My son was very happy with this product. Was concerned about his hand fitting in the handle. No problem, he also liked the white handle.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Weaver",
      "helpful_votes": 0,
      "publication_date": 20180105
    }
  ],
  "product_meta": {
    "title": "Norpro Egg Beater Classic Hand Crank Style 18/10 Stainless Steel Mixer 12 Inches",
    "description": "Size:12 inchMeasures: 12\" X 3. 75\" X 3\"/ 30. 5cm x 9. 5cm x 7. 5cm. Sturdy hand mixer easily mixes up ingredients for smaller baking jobs, without the use of electricity. Fast rotary Action to easily beat eggs, blend batters, whip cream or egg whites and much more! Hand crank beaters are not fitted to a particular mixing bowl, so you can use in any type of bowl! Includes two heavy-duty stainless steel beaters! Body and gears are polished aluminum. Plastic handle allows for an easy grip. Quick and easy cleanup!\n\nAMAZON.COM\nAn old-fashioned hand beater comes in handy even if a kitchen is equipped with electric beaters and mixers. Sometimes the chore is too small or the need too urgent to bother with electric cords and elaborate cleanup. When those times arrive--beating eggs, blending pancake batter, whipping cream or egg whites--this sturdy tool is just the ticket. Its beaters are heavy-duty, 18/10 stainless steel, so they won't interact with acidic foods. The handle and gear are polished aluminum, and both grips are tough plastic. Dishwasher-safe. --Fred Brack",
    "rating": 4.5,
    "feature_bullets": [
      "Sturdy hand mixer easily mixes up ingredients for smaller baking jobs, without the use of electricity.",
      "Fast rotary Action to easily beat eggs, blend batters, whip cream or egg whites and much more!",
      "Hand crank beaters are not fitted to a particular mixing bowl, so you can use in any type of bowl!",
      "Includes two heavy-duty stainless steel beaters!",
      "Body and gears are polished aluminum.",
      "Plastic handle allows for an easy grip.",
      "Quick and easy cleanup!"
    ],
    "specifications": {
      "Product Dimensions": "3.8 x 3 x 12 inches",
      "Item Weight": "8 ounces",
      "Manufacturer": "Norpro",
      "ASIN": "B00004UE7D",
      "Item model number": "2268",
      "Customer Reviews": "4.5 out of 5 stars310 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#35,295 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 6, 2007"
    },
    "categories": [
      "Home & Kitchen",
      "Baking Tools & Accessories",
      "Beaters",
      "Bakeware",
      "Kitchen & Dining"
    ],
    "price": 30.25
  }
}