{
  "website_summaries": [
    {
      "verdict": "A cool, comfortable sheet set with a budget price and the look/feel of upscale satin.",
      "pros": [
        "Sheets have a slick, satin feel and a high-end appearance",
        "Price is low"
      ],
      "cons": [
        "Lower thread count (230)",
        "Sheets should be pre-washed to prevent black dye transfer"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Terrible quality",
      "text": "Thin fabric snagged and got tiny holes in many places the very 1st time we laundered them. The flat sheet frayed all along edge from raw edge not having a double-fold, hidden edge. The pillow cases ends are not finished correctly and should not have a flopping edge. The un-reinforced seams completely pulled apart on 2 corners from trying to place the fitted sheet over the mattress. Corner seams are only 9 inches deep and NOT as advertised on Amazon [Ad says: \"Fitted sheet includes all-around elastic and 14-inch pocket for mattresses up to 17 inches deep.] Our mattress is only 12” deep.",
      "rating": 1.0,
      "verified": true,
      "author": "LA",
      "helpful_votes": 66,
      "publication_date": 20181012
    },
    {
      "title": "HORRIBLE! NOT DURABLE WHAT-SO-EVER!!  BAD FABRIC",
      "text": "( Divatex Home Fashions Royal Opulance) I've used (imitation) satin sheets in the past, with acceptable results....... THESE are TERRIBLE! ....(really bad!) Appearance and \"feel\" were OK, but, from normal rubbing occurring in-use, while in bed, the fabric COMPLETELY failed, particularly in the area(s) near the bottom of the bed especially where contacted by my feet. NOTE: I do not have dry or rough feet or heels...I'd call them totally normal.) These sheets should be considered \"SEMI- DISPOSABLE USE at best, I am completely disappointed regarding durability and wear resistance of these particular sheets, completely unacceptable!",
      "rating": 1.0,
      "verified": true,
      "author": "Bruce Q.",
      "helpful_votes": 72,
      "publication_date": 20180226
    },
    {
      "title": "Worst sheets ever!",
      "text": "The sheets are terrible the worst sheets I have ever had in my lifetime. Two months later they were not satin anymore they became scratchy and did not feel like satin anymore. They only messed up in the places where I lay my body they became unbearable and I got hives from laying on them. Buyer beware when purchasing this product. The sheets were worse where I leave my feet becoming very scratchy with the material coming apart. I could not lay my head on the pillow case because my head kept sliding down and I could not position myself properly because I kept sliding and they did not fit properly either.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 29,
      "publication_date": 20170604
    },
    {
      "title": "Meh...",
      "text": "They're not really worth $30. The material is extremely cheap and they look a lot better in the picture than they do in person. After a quick wash on delicate and dry on tumble the edges are already starting to fray. :( The company put a \"thank you\" business card inside the Packaging directly on the sheets and by the time it got to me the corners of the card had dug into the cheap thin material and caused snagging. As far as comfort goes... there was none, it was like laying between two nylon plastic garbage bags.",
      "rating": 1.0,
      "verified": true,
      "author": "chris m edwards",
      "helpful_votes": 24,
      "publication_date": 20170328
    },
    {
      "title": "Awesome! True to photo and so soft!",
      "text": "I was a bit skeptical to order because of the mixed reviews, but I am so glad I ordered! It came in a plastic package wrapped in a bow, and it included two pillow cases, a fitted sheet and a regular sheet. I do not have problems with the fitted sheet or the regular sheet sliding off. They are so comfortable and soft! It looks elegant and classy and just how I wanted, and for the price I couldn’t pass them up! They are true to size and color, and I would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Caitlin Pollitt",
      "helpful_votes": 11,
      "publication_date": 20180914
    },
    {
      "title": "These are nice not meant for cats",
      "text": "Nice but if you have a cat with claws this isn't for you😅😅. I will say they are very comfortable I thought it was going to make me hot at night but actually has a cool feeling",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany aye",
      "helpful_votes": 6,
      "publication_date": 20190117
    },
    {
      "title": "Only get what you pay for",
      "text": "I was hesitant at first to buy these because of the reviews. But didnt have much money after buying our new bed so I figured I would try them and I was NOT disappointed. These sheets are great quality for the price. Been through the wash a couple times and I have had no quality issues. Theyre a beautiful bright red colour, very true to pictures and are so soft and light-weight for summer sheets! If you rotate sheets weekly these are a great addition to your linen cupboard if you are looking for sheets that are soft, sexy and cozy for a very reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "dthlhm",
      "helpful_votes": 2,
      "publication_date": 20190821
    },
    {
      "title": "So far so good I’m not gonna try them until tomorrow when my ...",
      "text": "So far so good I’m not gonna try them until tomorrow when my new bed and the fur blanket gets here but I will write a second review on how they feel and how they last but for now I give them a five. I love the sheets they’re so comfortable and when you have a Fur blanket on top of him you can’t go wrong",
      "rating": 5.0,
      "verified": true,
      "author": "A Traveling Man",
      "helpful_votes": 7,
      "publication_date": 20180206
    },
    {
      "title": "Love",
      "text": "I love satin sheets! I have them in 4 colors now.I have heard they're very good for the skin and hair they are wonderful. they feel luxurious and they keep you warm when it's cold and they're cool when it's hot! I recommend the sheets Update: I recently purchased another brand and they were awful these are the best brand on Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "Jpg",
      "helpful_votes": 20,
      "publication_date": 20140811
    },
    {
      "title": "Great concept, Impractical",
      "text": "I really wanted Satin/silk sheets for the softness and to prevent damage to my hair while I slept. I was really excited the first day that I received them. Looked nice. I fitted them to my bed and the fitted sheet wasn't deep enough and it was a snug fit around my mattress. After only a couple of weeks, I was fed up. The corners wouldn't stay on, the corner seems ripped and because of feet nails and rough skin, the material started to rip. Having satin or silk sheet are really difficult to maintain if you are a toss-and-turn sleeper.",
      "rating": 1.0,
      "verified": true,
      "author": "Julie A. Palmer",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Very satisfied",
      "text": "I've struggled to find sheets that got this bed correctly since I bought it. These are perfect. They got nice and snug and don't slip off or out of place. I haven't paid attention to the time free factor. Of course they had creases from the folds of being packaged. I'll have to pay closer attention next time I lay down. As for comfort... Very very very luxurious and cool. Feels like I'm in a high price hotel. I'm ordering more in other colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Great, wish they were deeper.",
      "text": "Such comfortable sheets. I have always used luxury styled silk/satin sheets and needed one to pocket my pillow-top and cooling memory foam topper. Though this one doesn't do a great job of holding both, it does better than my previous 14\". The black color is rich and so incredibly silky that everything constantly falls off your bed. The middle sheet does not seem correct though. Seems like more of a Full sized sheet. Not sure why companies word these together, full is obviously skinnier. So with everything I can't really tuck these in well but they'll do.",
      "rating": 5.0,
      "verified": true,
      "author": "ICH8RS",
      "helpful_votes": 2,
      "publication_date": 20161130
    },
    {
      "title": "Really good until...",
      "text": "I loveeeed this product when I first purchased it (I've had it for about two months now). It was so sleek and sexy my boyfriend and I just fell in love with it. After a couple of \"late nights\" we noticed that it stopped feeling so silky and that it had started to pill like an old sweater where it had been exposed to moisture and friction I'm assuming. I like it, I just wasn't expecting to have to replace these sheets every couple of months...",
      "rating": 3.0,
      "verified": true,
      "author": "J. Neal",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Material is very nice, the quality of the stitching is terrible.",
      "text": "After less than 5 times on the bed the stitching in the corners started coming undone. The sheets feel great and look great but the quality of the stitching is terrible, I tried to have the one corner repaired but then another corner went bad. The flat sheet is still OK as are the pillow cases, but with out the bottom sheet it is not a set. Just beware, now it is possible that I got just a poor set but I do not know. Good luck.",
      "rating": 2.0,
      "verified": true,
      "author": "Ron Kramer",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "I really have nothing good to say about these sheets",
      "text": "I really have nothing good to say about these sheets. I got red and it was nothing near the color in the picture. It was more of a dark burgundy. The fitted sheet is not big enough and just barely stretches over the corner of the mattress. The fabric is very cheap and the stitching is very poor. There were already many loose strings right when I pulled it out of the bag. This order was a huge let down.",
      "rating": 1.0,
      "verified": true,
      "author": "Chandler",
      "helpful_votes": 8,
      "publication_date": 20170114
    },
    {
      "title": "Quality comfort fashionable softness durability accurate description and value for your money.",
      "text": "Absolutely love them. We both do. They are soft and comfy. Seem to be pretty good quality no issues so far. They are beautiful. Feel great. In love with these sheets I don't want to get out of bed they're amazing.. the fabrics soft fits great just a great deal all around. Definitely will be back",
      "rating": 5.0,
      "verified": true,
      "author": "Mommabear",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Wrong Item and Poor Quality",
      "text": "First the product shipped by GRAND LINEN was not the same product advertised. What I received were \"Charmeuse Satin Sheet Set\" by LandMark, not the \"Divatex Home Fashions Royal Opulence Satin Queen Sheet Set\" as advertised. The first thing that I noticed was that the sheets were very rough and not very silky as mentioned. Thinking that they might soften up after a washing, I unfolded it to prep and found that in many places the stitching had already starting pulling apart. Needless to say I'm returning it right awasy.",
      "rating": 1.0,
      "verified": true,
      "author": "Anon. Customer",
      "helpful_votes": 6,
      "publication_date": 20160707
    },
    {
      "title": "Beautiful, and  luxurious",
      "text": "These are soft, and warm on a cool day, cool on a warm day. Feels luxurious! They are not wrinkle free, but seriously, doesn't much matter! It is however slippery. Very easy to move around and roll over on these, but not so good for a small child or pet sleeping close to the edge.. Plop!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda W Sunny",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Don’t buy.",
      "text": "I had these sheets on my bed for two days! You can never get your pillow to stay where you want it, it just slides so it was never comfortable. I went to fix a corner and it completely ripped. I’m super angry with this quality and will never buy sheets like this again. I’m only rating this two stars because I liked the color. All it did was make me and my partner argue because the blankets wouldn’t even stay on the bed.",
      "rating": 2.0,
      "verified": true,
      "author": "Kiersten",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Great for memory foam beds.",
      "text": "I gave this 3 stars because I can only use just the sheet. The pillow cases slide too much on top of the sheets. I use regular black instead of them. The satin is a really nice feel. It is extremely comfortable and nice on a memory foam bed because they are so cool it doesn’t feel like your overheating.",
      "rating": 3.0,
      "verified": true,
      "author": "Gabbie Rose",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Don’t do what I did.",
      "text": "So before buying I was reading the reviews and finally just decided to get them though I know I shouldn’t have. They don’t fit and they aren’t the best at all in quality. The number count is extremely low and you can tell just by the touch. I had whole in mine when I got them, but I would just go to Bed Bath and Beyond and buy the $100 ones for better quality. It’s really up to you.",
      "rating": 2.0,
      "verified": true,
      "author": "Catherine Shatney",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Slip and Slide burgundy",
      "text": "Slip and slide but pretty. I have to say that I was super excited to buy these and they were perfect for the bed. However, the drawback is that you slip and slid all over the place. It's been saved for special nights ( *wink wink* you know what I mean) and for when we just want to feel like a king and queen. The color is rich, the fabric is smooth and silky to the touch, and it fit the bed.",
      "rating": 3.0,
      "verified": true,
      "author": "ManaTapMomma",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "I assure you, this is NOT what you are looking for.",
      "text": "I bought the black ones. Because of the positive reviews, I am partially questioning if I received the same product as others. I wanted my futon to have a silky black Asian theme. My boyfriend said that it looks like a cheap Asian whorehouse. Buy these if the look of a bad 70's porn is what you are going for. Cheap, thin (I could see through them in the light), and plastic-like. Think high-quality trashbag....something you might find at Nordstrom Rack. I am surprised Amazon even wanted them back when I processed my return. I would have happily burned them in a fire instead.",
      "rating": 1.0,
      "verified": true,
      "author": "Kitty Meowski",
      "helpful_votes": 2,
      "publication_date": 20150629
    },
    {
      "title": "Super cheap feeling, not soft",
      "text": "They are so cheaply made. One side of the top sheet is fine... the other side is really not comfortable at all, which is unavoidable to touch sometimes regardless of how you sleep honestly. As a whole they aren't as soft, as comfortable, or as wrinkle-free as expected or desired. I would definitely never buy these again and I wouldn't recommend them to anyone else. They could be *worse*, which is why it isn't a 1. But I might as well have bought these on Wish without looking at reviews first - it's that level of quality...",
      "rating": 2.0,
      "verified": true,
      "author": "Bunny (FieryAshes)",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Not as good as the reviews suggested.",
      "text": "The description says the pockets are 14” deep and they can handle mattresses 17” thick. I have a 14” mattress and the sheet bows on the edges and have to be periodically put back over the mattress corners. The material is pretty thin and when pulling the sheet back over the corner in the middle of the night it tore a hole through were one of my fingers was. The material feels a little plastic-y and not like a true satin. It is pretty much what you expect given the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Jason Williams",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Slidey",
      "text": "They slide a lot. They wrinkle a lot. They stretch after a couple weeks. I have a Twin bed with 3 pillow top pads, and at first the sheets barely fit. Fast forward to a month-is later, and they fit under all the pads and the mattress without problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "You get what you pay for- Waste of money!",
      "text": "Tale as old as time-You get what you pay for....awful cheap looking...color (gold) made it look extra cheap... Figured I’d just use fitted sheet for a night since I had spent the money... When tried to put on mattress pockets on two sides of fitted sheet completely ripped & split and left big enough tear on both sides to the point sheet was no longer “fitted” or useful!... Shoulda tried to return but threw in bin instantly.... money wasted 😠",
      "rating": 1.0,
      "verified": true,
      "author": "Cary",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Just don't buy from someone cheating out the quality",
      "text": "I Purchased This and at first it was exactly as it was described for two months down the line washing it once a week it tore on the sides, it won’t keep it shape and the quality of the texture fades over time, it’s straight out feels like rough cotton that had a wire brush go through it.",
      "rating": 1.0,
      "verified": true,
      "author": "ricky salazar",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Super soft but very thin",
      "text": "I do like these sheets! They are very soft. But they are a very thin material. I bought these for my double sided pillow top queen. They fit, BUT, since it's a double sided it's a think mattress so the fitted sheet rises up daily and the sheet doesn't fully tuck in upon making the bed.. So if you have a thick queen mattress get a king size sheet set. Other than that I will say I'm pleased with my purchase. 😁",
      "rating": 4.0,
      "verified": true,
      "author": "MeghanJ",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "TERRIBLE",
      "text": "Washed One time and tore the hell up also if u have any hardness on your feet it will make the satin pull and leave Lil pulls everywhere It is not wrinkle free and overall dislike the product can’t return just missed the window for returning",
      "rating": 5.0,
      "verified": true,
      "author": "iheartamazon",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "everyone slides off my bed lol",
      "text": "I love it. my curls are never frizzy and more manageable, my skin is soft and I love the added bonus of watching everyone fall off my bed when they sit on the edge. if I ever sleep over anyone's house I always take a pillow case with me cuz I hate cotton pillow cases",
      "rating": 5.0,
      "verified": true,
      "author": "Ariana",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "I love the color and satin fabric",
      "text": "I love the color and satin fabric. This sheet set is not of the highest quality but it was inexpensive. I use the flat sheet as a cover on my bed when I do not want to use the bed spread. The pillow slips are too long and they were for a king size pillow. I will have to cut them a bit an sew them. Otherwise, the color is vibrant and looks pretty.",
      "rating": 4.0,
      "verified": true,
      "author": "hopechest",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Kind of soft, kind of annoying.",
      "text": "We bought these sheets awhile ago. The sheets stayed really cool which was a huge plus for me. But the pillows slid off the bed every few minutes bc of how slippery it is. Honestly if you slid across the bed, you'd fall off the other side. They weren't extremely soft which was disappointing. Not bad for the price but still overall, disappointing.",
      "rating": 3.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "!",
      "text": "Just getting more nicer sets, I have got to use this for a week, they fit great on the king mattress, they feel great, comfy, careful if you toss something on the bed with these on, don't need to pick up the girlfriend or wife off the floor",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "was wrinkled extremely and wont un wrinkle",
      "text": "I ordered something like this before on amazon and was very pleased. this one however is very disappointing..It feels very cheap not satin at all and it wrinkles horribly it came so wrinkled that even after washing it still has deep wrinkles it looks like trash and is embarrassing to use. I would not recommend this to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "mrsimport",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Pretty but not practical.",
      "text": "These sheets look pretty, but they just aren't practical. The material is so slippery that it won't stay on the mattress protector very long. After a night of sleep, don't be surprised to find that all the corners have come off, as well as the sides. They also snag easily. After a couple of washes, they looked very snagged and I gave them away. The quality is just not that great and if you have a top loading machine that uses an agitator, be prepared for these sheets to not last you very long. They are also quite hot, so keep that in mind if you're the kind of person who has night sweats.",
      "rating": 3.0,
      "verified": true,
      "author": "BeachGirl",
      "helpful_votes": 0,
      "publication_date": 20160126
    },
    {
      "title": "Not Silky Soft, But Silky Enough",
      "text": "I don’t hate them but they’re definitely not as silky buttery soft as I would like. Little bit too plastic-y, but overall still a great set of sheets that fit true to size (queen bed). Comes with 2 pillow cases, 1 fitted sheet, 1 flat sheet. 4 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Brunette Butterfly 🦋",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Ok for the price.",
      "text": "It's ok for the price. They fit the bed fine,but like satin sheets do, they slide around on the mattress like mad. They don't stay tucked either. My husband loves them, I do not. I like how they feel but not that it is an entire bed remake every morning. The color is pretty ugly, honestly. I felt like I was hoping into a bed from the '70s. I thought the color would be kind of light like the company product phot. It's not. When you look at the gold, think almost the color of. Rolos candy wrapper. Other than that it washed well. No fading or pilling or threading.",
      "rating": 3.0,
      "verified": true,
      "author": "Bamgela",
      "helpful_votes": 2,
      "publication_date": 20150302
    },
    {
      "title": "You get what you pay for...",
      "text": "Bought black satin sheets for my queen sized bed, and after only a week I can see that the stitching is starting to come apart. What’s worse is that the stitching is WHITE on black sheets! So far, they’ve survived a wash and a dry cycle—but I’m wondering how long until they need to be thrown in the trash. Looks nice, feels slippery/smooth but you can feel the quality difference.",
      "rating": 2.0,
      "verified": true,
      "author": "Madison",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "Not as great as I thought they would be.",
      "text": "Nice sheets but not durable. Mine are already starting to tear apart a few months in and I’m not even person that sleeps in my sheets every night. You can also tell immediately they are cheaply constructed and there isn’t the normal thick seam at the top. The color is also lighter than what I expected and more of a brush gold than solid true pure gold. Two stars because they were true to the satin nature and I do enjoy sleeping on them. I just wish they had lasted.",
      "rating": 2.0,
      "verified": true,
      "author": "Kelly Williams",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "But Hubby and I love these sheets",
      "text": "Took off a star because they are a tad big for our queen size matress and they slip off the corners in the night. But Hubby and I love these sheets. They're soft and silky. Only wish we'd pi ked a different color. We chose red and now our bedroom looks like they film porn in it.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 2,
      "publication_date": 20160122
    },
    {
      "title": "Not for pillow tops mattress",
      "text": "It is not deep enough. I was hoping for at least 16” but when I pull one side over the other side is showing. Now day’s mattress are thicker. I have a pillow top and it does not fit right. Just going to deal with it until I find deeper sheets. Otherwise nice.",
      "rating": 2.0,
      "verified": true,
      "author": "txcogirl",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Waste of $$!!!!",
      "text": "These sheets LOOK gorgeous and are slippery (a plus!)... however they are not real satin (I knew that already), but are very very HOT and don't stay on the bed. Each night I'm sweltering against my skin and the mattress, and when I wake up the fitted sheet is coming off the mattress. Also, some portions of it are already rough, pilling, and no longer satin-like, and we can't figure out why (I'm the one with the rough feet, but it's pilling on my husband's side). We've only had it about 2 weeks and haven't even washed it yet, so we can't blame the pilling on washing. Very disappointed in these sheets :(",
      "rating": 1.0,
      "verified": true,
      "author": "M. Parrish",
      "helpful_votes": 9,
      "publication_date": 20120310
    },
    {
      "title": "Great sheet set. You can't go wrong!",
      "text": "I've purchase this sheet set in multiple different colors and sizes over the past few years and I'm still continually pleased by how well the sheets hold up, how soft and cool they are to the touch, and how well they fit the bed. I really don't think you can go wrong with satin sheets and I think that this is a great inexpensive brand put on your bed. I especially enjoy the pillowcases because I've heard that having satin /santeen pillowcases helps keep your face from being as wrinkled and it can also help to reduce acne, which is always a plus. Overall I plan to continue to buy these sheets in different sizes and colors in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki",
      "helpful_votes": 0,
      "publication_date": 20150911
    },
    {
      "title": "HORRIBLE",
      "text": "So i left a review on how horrible the satin sheets i bought were. and how they ripped and had holes in them after two nights of sleeping on them and after ONE wash... so i got a phone call like 15 minutes after i left my review and they said they saw my review and they were very sorry and that they would replace it that day and have it shipped.... lol BUT WAIT they asked me to REMOVE my review. thats the best part. and its been over 3 weeks since that phone call.. and haven't received new sheets. NOT HAPPY.",
      "rating": 1.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 5,
      "publication_date": 20140617
    },
    {
      "title": "Great for a secondary set of sheets",
      "text": "I am a male with rough feet and hands but I have never really had a problem with getting pulls on these sheets. If so its been minor. My only two real complaints are that everything slides around so darn much, throughout the night I am constantly re-adjusting my pillows. Secondly, sometimes if it's humid or hot your skin will stick to these sheets like glue. Otherwise for the price @ less than $20 for a queen these are a really nice change from the norm. I suggest getting these as a secondary set when you feel like mixing it up. They really are smooth and silky. I also love the chocolate brown color it's so 70's yummm.",
      "rating": 4.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 0,
      "publication_date": 20151112
    },
    {
      "title": "Don't waste your time",
      "text": "Consistent with previous reviewers, I found these sheets to be totally unsatisfactory. I would return them if I hadn't already used them. Sheets did not fit properly (mine were Full/Double) and kept coming off the mattress. They are so slippery that I was unable to sit on the edge of the bed without sliding off. And every morning when I woke up, the other bedding would be slipping off to one side or the other. Cute pattern, but poorly made and with an unsuitable fabric. Seems I have to keep re-learning the lesson that one gets what she pays for . . .",
      "rating": 1.0,
      "verified": true,
      "author": "Full Moon Baby",
      "helpful_votes": 0,
      "publication_date": 20131211
    },
    {
      "title": "Silky sleep",
      "text": "Just what I wanted. Silky smooth sheets. I've had really great sleep since I bought them. Soft against my skin. They make my bed feel so luxurious. I will definitely purchase again. They came packaged very nicely. I did wash before using them so they did wrinkle in the dryer. If I cared I would iron them on a low setting to remove the wrinkles. My sheets and other pillows tend to slide alot throughout the night. It's pretty funny but I don't mind. . Good buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicquel Davis",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Was good for a couple days",
      "text": "We really enjoyed these sheets for the first couple of days, unfortunately almost immediately two things started to happen. The first is that the corners of these sheets slide off the bed sides, leaving us waking up with bunched up sheets. And second the corners have started to rip at the seems.",
      "rating": 2.0,
      "verified": true,
      "author": "Raul",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Comfortable sleep",
      "text": "After I removed it from the packaging and put it on the mattress I did notice a marker like mark on the top of it. I am using it under a comforter so it doesn’t bother me but I do suggest checking for this if you purchase it. Although they are very soft And comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "They stay cool and don't cause you to sweat",
      "text": "I thought I'd sweat from silk like sheets but this is not true. These sheets actually hold the ac blowing in my room and stay cool! They are very comfortable and are slippery. I love them and so far so good. No problems fitting on my queen bed",
      "rating": 5.0,
      "verified": true,
      "author": "sarah",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Great for the price",
      "text": "Really nice sheets. Mines did have a hole at one of the seams unfortunately. I still kept them for the price. I never had silk sheets so I wasn’t completely aware of the mysteriously slide covers in the middle of the night but I still love these sheets.",
      "rating": 4.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Not WORTH IT",
      "text": "TERRIBLE SHEETS. Not worth it at all. I was so excited when I unwrapped them yesterday. Last night my husband and I had the worst sleep . It kept coming off of the corners to the point I ended up just sleeping on my mattress because the sheet kept slipping off. They were extremely uncomfortable. Now I am not one to complain NORMALLY. But this was so terrible I couldn’t stop myself. The quality is crappy, and the sheer itself ripped last night as I tried to put the rounded edge back on after it fell off every time I barely moved an inch.",
      "rating": 1.0,
      "verified": true,
      "author": "addywat13",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "You get what you pay for with these cheap sheets.",
      "text": "These weren't worth the hassle of returning. I'd gotten satin pillowcases last year that worked wonders for my hair, so naturally, I looked into buying a full set. Unfortunately, the sheet brand does not produce full sets. On Amazon, there really weren't many options: this lower brand, or brands that were around the $200 mark. I figured I didn't have a whole lot to lose, so purchased these. Not worth it. I got a queen-size for my double bed, but they still don't fit appropriately. Too big (for obvious reasons) before I washed them, and then they shrunk. The material feels incredibly cheap, which... to be fair, it is. Not worth it.",
      "rating": 1.0,
      "verified": true,
      "author": "AmazonGirl81",
      "helpful_votes": 2,
      "publication_date": 20150916
    },
    {
      "title": "AMAZING!",
      "text": "Husband and I absolutely love these sheets. We are disappointed because we didn’t think about our pillow top-our mistake. We needed deep pocket sheets. We haven’t washed the sheets yet (I love the crispness and the freshness of new sheets). But so far we love these. They are so smooth and so nice to crawl into after a long day.",
      "rating": 5.0,
      "verified": true,
      "author": "Destiny Ayers",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "You get what you pay for",
      "text": "I bought these for a photo shoot prop which they worked fine for. When I was done decided to use them on my bed. Big mistake! Not even on the bed one week and the seam of the pillow case was ripped and the top sheet well, look at the pictures. Very very low quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Brenda B",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "You get what you pay for",
      "text": "These are ok.. they have a slick feel but not soft. The pillowcases have the slit in the middle which was a pain to put my pillows in... one side is starting to unravel On the fitted sheet.. will keep but would look for something with better quality next time",
      "rating": 3.0,
      "verified": true,
      "author": "Mrs.Smith",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Disappointing",
      "text": "The sheets seem to be heavily coated in something from the factory, as they lost much of their sheen and comfort after the very first washing. Additionally, the sheets started to pill very heavily after the first washing, towards the bottom. Yet another issue, the sheets have very little stretch and can get quite tacky and stick to you, which causes them to slide out from their tucked position. If you use the top flat sheet, I imagine this particular problem would be lessened (we choose not to use the flat sheet). They get two stars instead of one because they seem to be at least mildly durable (minus the pilling) and would probably be great for a guest room.",
      "rating": 2.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20140809
    },
    {
      "title": "Look great, but don’t stay on bed.",
      "text": "Super silky sheets! They look really nice and feel great, but they don’t stay on your mattress and the corners already have holes in them from ‘trying’ to stay on my bed. Every time I move, the sheets fall off and I have to worm jump to try to put them back on. Probably wouldn’t buy again, but glad that I did to know that silky sheets aren’t for me. Very happy with the pillow cases!",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica Harmon",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Comfortable but not sturdy.",
      "text": "Very comfortable at first but the seams on the fitted sheet split after about 6 months and sheets were worn and not comfortable after about 10 months. Still not a terrible purchace, just expect to replace them.",
      "rating": 3.0,
      "verified": true,
      "author": "Charles A.",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "If you’re in need of a shower curtain...",
      "text": "I opened these and immediately re-packaged them for return. They do not feel like satin; they feel like a shower curtain! One side is smooth and plastic-way, and the other just feels like cheap fabric. Wish I had read the reviews",
      "rating": 2.0,
      "verified": true,
      "author": "Patience Marie",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "SilkyLuxery...low cost...",
      "text": "These are nice!!! A Very affordable bit of luxery. Every girl needs a silky something in her life and I found these super silky sheets at a great price. They come in a variety of colors. Black is my favorite. Silky enough to be able to sleep on your face;) Skin experts say \"Never sleep on your face, as it causes wrinkles\" well I sleep on my face and there are no \"sleep\" wrinkles on my face or my sheets!!! These sheets need no ironing. I wash them in Woolite on delicate cold cycle so the color keeps. I am very happy with my little luxery;) and they shipped quickly!",
      "rating": 5.0,
      "verified": true,
      "author": "Raine",
      "helpful_votes": 0,
      "publication_date": 20140906
    },
    {
      "title": "Good sheets, slippery",
      "text": "These sheets are great, I got them in gold and they are elegant and bright as I'd hoped. One thing thought as you will read, they are incredibly slippery. To the point that I'd rather stay at my boyfriends than have him stay over. It's like a slip n slide so prepare for that, hopefully will get better with a few more washes. Otherwise, good quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Sparkle Watts",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Prepare for ultimate slippage!",
      "text": "Boy, you really slide around in these! It's kind of fun, to be honest. My boyfriend and I only use the pillowcases just because we kept falling off the best from slipping.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Van Sant",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "The WORST bed sheets I have ever slept on",
      "text": "I have had these sheets maybe 2 weeks now. They are already ripped on 1 side and they never stay in the bed. We wake up on the bare mattress every single morning. They don’t feel silky at all either, actually they feel sticky kind of. I’m really upset that I bought these. Learn from my mistake and splurge a little on your new sheet set.",
      "rating": 1.0,
      "verified": true,
      "author": "Bri",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Nice looking sheets",
      "text": "Their ok, the inside of the sheet is rough so I just flipped it and use the shiny side. It's nice but not soft and smooth as I expected, looks good on the bed.",
      "rating": 3.0,
      "verified": true,
      "author": "The Morgans",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Get what you pay for.",
      "text": "They are soft and comfortable. They do not last long. After the 1st wash they begin to tear. But they are good for the price. They should last about 3months before having to replace them. I fad to order 3 in the past 10 months.",
      "rating": 3.0,
      "verified": true,
      "author": "Portia",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Looks great if you don't sleep on them.",
      "text": "Looks and feels great, but getting the fitted sheet to stay on the bed is a nightmare. We have to fix it every morning. y husband has woken up UNDER the fitted sheet more than once after it's come loose and the regular sheet slid off the bed. I think the corner pockets should have been made a little deeper. Satin sheets sounded good in theory, but they cause everything to slide off the bed constantly. I do like the pillow cases though, they leave my hair much more manageable in the morning than our cotton pillow cases did.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140928
    },
    {
      "title": "when I got these I thought they were awesome and they were for a while",
      "text": "So, when I got these I thought they were awesome and they were for a while. I like sleeping on the more silky sheets and these are definitely that. However, because they're so silky the fitted sheet very easily slips off the bed which means having to redo them every day-- or I did until I gave up and bought some high thread count cotton and left it at that. I don't use them anymore they're not worth the struggle. If they find a way to make them more secure to the bed maybe I'll try again but I won't be buying these again if they continue to make them like they are right now.",
      "rating": 2.0,
      "verified": true,
      "author": "Read the Signs",
      "helpful_votes": 0,
      "publication_date": 20150614
    },
    {
      "title": "Really great for cool night sleeping",
      "text": "I find this very comfortable to sleep on. It is nice and cool, which helps with adjusting the body temperature for sleep. The material can be a little too slippery in my opinion for the pillows. I let my dogs sleep on my bed, and I have no issues with their nails scratching or tearing up the material, leaving it rough.",
      "rating": 4.0,
      "verified": true,
      "author": "Adam P.Top Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "I love these sheets!",
      "text": "I cannot stand being hot in bed, it is one of the most uncomfortable things in the world to me to be sweaty laying in a heat-soaked bed. We swapped our mattress for a GREAT product from Amazon, the. These sheets fit perfectly, and feel so cool and smooth, that they are perfect! Combined with the buckwheat pillow I use (), it makes for a FANTASTIC sleep! These are great sheets, they fit deep mattresses very well, and have so far been very durable in the wash, with no shrinking. We now own several sets, and love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. D. Caudle",
      "helpful_votes": 0,
      "publication_date": 20110930
    },
    {
      "title": "cool to the touch then it warms up nicely",
      "text": "I was skeptical about these sheets because of the slide factor but I love the feel on my skin at first it is cool to the touch then it warms up nicely, if it gets too warm just slide to a new spot. These sheets also lets the skin breath. Before I bought these I did research on satin sheets, seems the best is \"woven Polyester\" The first fabric really used for satin sheets. It is strong and machine washable and produces a nicer silky feel. upon 1st washing it did bleed color so make sure you put it with like colors",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua and Michele",
      "helpful_votes": 0,
      "publication_date": 20150917
    },
    {
      "title": "Divatex Satin Sheets",
      "text": "Some husbands would probably say \"what do you want satin sheets for?\" Mine has gotten to really like them. I purchased satin sheets about 6 years ago and have been purchasing them ever since. I have rheumatoid arthritis and turning in bed makes it a lot easier for me, and a regular sheet. It really makes a difference. I told several friends and they also purchased them and said how much easier it was to sleep on them and turn. Satin sheets definitely get my best rating. They are great for me and my husband actually likes them also. They may at times be a little more expensive, but the cost is well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Flamingo",
      "helpful_votes": 0,
      "publication_date": 20140103
    },
    {
      "title": "Disappointed",
      "text": "At first I thought these sheets would work. I'm sensitive to cotton so silk sheets are the only ones I've used in the last five years. When my favorite silk sheets ripped, I didn't want to pay that much for a replacement set. Enter satin. I washed them and they washed beautifully. I put them on my bed and the first night was ok. The second night they started slipping off. Every morning, I put the bottom sheet back on. I found myself waking up at night twisted in too much fabric. Bottom line, the sheets don't stay on the bed. Back to silk. Sigh.",
      "rating": 1.0,
      "verified": true,
      "author": "Karen Ranney",
      "helpful_votes": 0,
      "publication_date": 20140115
    },
    {
      "title": "Terrible quality",
      "text": "These are the worst sheets I’ve ever purchased. I’ve purchased other sheets around this same price and they’ve been fine. I always wash my new sheets and tumble dry before putting them on my bed. As I was putting them on they ripped on both sides. Not to mention they are extremely see through.",
      "rating": 1.0,
      "verified": true,
      "author": "Breanna",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Good product",
      "text": "I like this sheet set. I think it is worth the $25 I paid for them. They are very soft and did not come with any picks in them. They are a true cream color, which I was worried about. I have not slept in them yet, so I will try to come back and update my review on their durability. They did come very wrinkled which is expected with this material.",
      "rating": 5.0,
      "verified": true,
      "author": "McKenzie Newton",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "I was really disappointed because they are a nice color",
      "text": "We had these sheet for a few months. We live where it gets really cold in the winter. When the sheets arrived they looked exactly as what was advertised. Every single night we would wake up to the fitted sheet off the corner of the bed. We specifically purchased the Cal King sheets because we have a Cal King and not even one night went by without getting snapped in the face by it. I was really disappointed because they are a nice color. Also the bottom where your feet are because very rough and the material started to come apart. I threw them away less than 6 months after purchasing!",
      "rating": 2.0,
      "verified": true,
      "author": "Crystal B",
      "helpful_votes": 0,
      "publication_date": 20141127
    },
    {
      "title": "Nice for those 'special' occasions",
      "text": "My wife and I bought these to use sparingly for 'special' occasions. Anniversaries, birthdays, Christmas, Valentine's Day, bar-mitzvahs, Easter, New Years, Thanksgiving (eww), and weekends ... and sometimes weekdays. I'm not a very big fan of satin sheets, I find they stick to the skin, but these are nice to throw on the bed to spice up the occasion. I can't attest to whether or not they stain the bed because they only last a day or maybe ... nope just one day, then they're cleaned and go back in the closet. For this purpose the work perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "Almeson",
      "helpful_votes": 0,
      "publication_date": 20140217
    },
    {
      "title": "Terrible purchase",
      "text": "Washed sheets when I got them the same day and they came out snagged, shredded and bunched up. Such beautiful sheets but very disappointed with what happened. Does not have any tags, or anything so no washing instructions. I used the sheets setting on my washer and dryer, not sure if I used the wrong setting, or if they shouldn’t be machine washed and dried... a hint on what to do would have been nice. I don’t usually like to blow $30 on something that falls apart the day I got it....",
      "rating": 1.0,
      "verified": true,
      "author": "Kaila Pfau",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Dollar store knock-offs",
      "text": "It’s only been on my bed not even a week and it already has lint balls stick to it. The cheap threading is already coming loose but I guess you get what you pay for it wasn’t expensive. Next time I want to invest in satin sheets, i’m going to pay the money and invest in real satin sheets, These sheets are dollar store knock offs.",
      "rating": 1.0,
      "verified": true,
      "author": "Kare",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "You get what you pay for",
      "text": "Is expecting red, like the photo. However the red in person is more of a blood orange. You can tell my the feel of the fabric, it's more on the cheaper side. Hey, you get what you pay for, sometimes. These just so happened to be under $40.",
      "rating": 3.0,
      "verified": true,
      "author": "melimel",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "The initial feel is great, but I won't be buying again",
      "text": "The initial feel is great, but I won't be buying again: - The material quickly developed small burrs / fuzz balls, especially down at the foot of the sheet. They don't wash out, leaving you with weird rough spots in an otherwise silky-smooth sheet. - Fitting sheet constantly creeps up. While the fitted sheet appears deep pocketed, it won't stay put for more than a few days without adjusting. - Slippery sleeping surface. It sounds silly, but the slickness of these sheets make it hard to keep your body and pillows to stay where you put them.",
      "rating": 3.0,
      "verified": true,
      "author": "Court Christensen",
      "helpful_votes": 0,
      "publication_date": 20160708
    },
    {
      "title": "Nice cheap sheets",
      "text": "Nice sheets, much softer once they have been washed. Not the highest quality fabric, corners all ripped out within the first couple months, slips off bed even with connectors. Snag easily",
      "rating": 3.0,
      "verified": true,
      "author": "sara brown",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Silky Feeling",
      "text": "These sheets are silky and comfortable. Wish the bottom sheet was sized to fit a deeper mattress as mine has extra toppers. They washed up very nicely. Happy Holidays. Love and Gratitude.",
      "rating": 5.0,
      "verified": true,
      "author": "Jango",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "These sheets are wonderful",
      "text": "They feel incredibly soft, and came right on time. These sheets are great if you have pets because the pet hair comes off very easily. The reason I gave this product a four out of five stars is because I noticed some small snags in it but they aren't very noticeable and the product is still in tact. Overall, they are a great price for what you get and I would recommend giving them a shot.",
      "rating": 4.0,
      "verified": true,
      "author": "Haley Rowley",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Not what i expected",
      "text": "The material reminds me of a cheap children Halloween costume. I can see through the fabric and its just not what I was hoping for. If you're looking for a high quality satin sheet keep searching.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenn B",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Dont waiste your money.",
      "text": "I have used satin/silky sheets for years but these are by far the worst. I ordered a brown and black set and when I got them in the material was stiff. I figured if they were washed it would fix that and it did but the material is so thin that I have several snags and holes in my brown set. I haven't used the black set yet. I will not be buying these again",
      "rating": 1.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 2,
      "publication_date": 20161206
    },
    {
      "title": "Better than expected",
      "text": "These were more comfortable than I expected - very smooth and cool (which is nice living in a warmer climate) and thicker than I expected. I was worried about staining so I put them through the wash cycle twice before using them and haven't had any issues with staining. I like that these have elastic all the way around, although I was already usingto keep my sheets in place. The only thing I don't like is that I feel like my head is sliding around on the pillow case, so I usually use a pillow case from a different sheet set. My husband doesn't mind the pillow cases though and really likes this sheet set.",
      "rating": 4.0,
      "verified": true,
      "author": "wxyzzzzzzzz",
      "helpful_votes": 0,
      "publication_date": 20130416
    },
    {
      "title": "Okay for the price",
      "text": "I’ve had these sheets for maybe 2 months and they are already tearing on the fitted sheet. They dont stay in place very well either. I had to wash segeral times before the color stopped staining my clothes, Im not a super heavy sleeper but the color still transfered on to my clothes",
      "rating": 2.0,
      "verified": true,
      "author": "maria",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Love the way it feels, but its just so easy to damage.",
      "text": "Absolutely love the soft texture of the satin sheets and pillow cases, but the one problem is when I sleep with my Apple watch on, my watch gets caught on the satin, and will rip and pull at it! I have never had a set of satin sheets do this before and it honestly kind of confuses me. If you're gentle with it, absolutely great. 10/10 would recommend. Just don't give it to your kids.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathan Besore",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "I love them",
      "text": "Soft, silky and luxurious. I bought these two Christmases ago and they are still as soft as ever. I don't wash them on the delicate cycle or anything special, just throw them in with the rest of the linens and they are still soft and perfect. Others who do take that extra step should be in love with these for much longer than I. An excellent purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "So silky smooth, very slippery, much satin.",
      "text": "So silky, so smooth. my wife has very long hair, and lint is a tangle terrorist. this material is very lint-repellent. it's also very smooth, and cool for sleeping in. the one problem i have with it is that pillows won't stay up. they may as well be finely oiled, because they slide on each other frictionlessly. you can put a pillow on one end of the bed, give it a light push, and it will slide all the way to the other side of the bed. it's like that canadian curling sport with the big stone on the ice. anyway, you can't really sit up in bed on your pillows, but that's the only downfall so far.",
      "rating": 5.0,
      "verified": true,
      "author": "West",
      "helpful_votes": 0,
      "publication_date": 20140722
    },
    {
      "title": "Pure ELEGANCE",
      "text": "Beautiful!!️!!️!!️ This sheet set gives your bedding a look and feel of pure elegance. My children came into the room, and absolutely loved it as much as I do👌🏼",
      "rating": 5.0,
      "verified": true,
      "author": "SkinnTeaHunni",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Great but slippery",
      "text": "I like these sheets but they are so slippery that the covers just slide right off the bed when you move around. Great for summer time when you want to be cool, but not so great in the winter when you're cold. They are very romantic because of the silky texture but I just get crazy when I have to pick up my covers off the floor every so often. I've stopped using them because I'm a bit of a neat-freak and can't handle disorganization. Still, they are good quality sheets.",
      "rating": 4.0,
      "verified": true,
      "author": "Laconfuso",
      "helpful_votes": 0,
      "publication_date": 20150922
    },
    {
      "title": "Not true to color",
      "text": "I am using them for a toga costume, but I'm not sure how well they would hold up in a bed. They are slightly marked up and snagged already, and NOT even close to the gold portrayed in the picture. The only reason I am keeping them is because I need them for this weekend and don't have time to purchase something else.",
      "rating": 1.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Get what you pay for",
      "text": "I think they look and feel great. Pillows and sheets fall off the bed at first but soon you get used to it. The slickness is very pleasant and cool and I love the color. Other reviews said the edges start to fray after washing so I hope that doesn’t happen to mine. Worth the price, ultimately satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Not for me",
      "text": "Personal preference only. I regretted the purchase. It is so slippery to the extent of disturbing my sleep. First and last time to buy satin sheets.",
      "rating": 2.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "How do you keep the pillow on the bed? No, really...",
      "text": "Was hoping these would be cold when I climbed in bed like my satin pillow case but that wasn't the case.... I have never slept on satin sheets and it is really a challenge to keep the pillow on the bed. LOL I finally solved the problem by putting a tshirt over my pillow case and then pulling back the top so that I am sleeping on the satin but my t-shirt is holding the pillow to the satin. There has GOT to be a better trick to sleeping on Satin sheets!!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "Just get em!",
      "text": "This is the third time we've purchased these sheets in three different colors - we LOVE them. So soft, so shiny, and they're great for pet owners (the hair doesn't stick).",
      "rating": 5.0,
      "verified": true,
      "author": "the_sQuares",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Thin & frayed. Ok I guess.",
      "text": "They are soft, but the color is lighter than in the picture, more like a cream gold, and the edges are already fraying after 1 week. They are extremely thin. They will do until I can get a nicer set.",
      "rating": 2.0,
      "verified": true,
      "author": "T. S.",
      "helpful_votes": 0,
      "publication_date": 20190616
    }
  ],
  "product_meta": {
    "title": "Royal Opulance Luxurious Satin Queen Sheet Set,Ivory",
    "description": "Color:Ivory| Size:QueenEnjoy a luxuriously smooth slumber with this complete set of satin sheets for Queen beds in a fashionable solid ivory hue. This set includes one flat sheet, one fitted sheet, and two standard-sized pillow cases. These shiny, silky sheets have a sublimely smooth touch to the hand, and they're made of 100 percent woven polyester satin. The fitted sheet has elastic all the way around, and it offers a pocket depth of 14 inches that will accommodate mattresses up to 17 inches deep. Both the flat sheet and the pillowcases have a 4-inch hem. Machine wash and tumble dry on the gentle setting.",
    "rating": 3.8,
    "feature_bullets": [
      "100% Polyester",
      "Imported",
      "Complete set of sheets for Queen beds in solid ivory; includes one flat sheet, one fitted sheet, and two standard-sized pillowcases",
      "100-percent woven polyester satin is smooth and silky, with lustrous sheen for added style",
      "Fitted sheet includes all-around elastic and 14-inch pocket for mattresses up to 17 inches deep",
      "4-inch hem on pillowcases and flat sheet",
      "Machine wash and tumble dry for easy care"
    ],
    "specifications": {
      "Package Dimensions": "15.1 x 10.9 x 2.3 inches",
      "Item Weight": "2.49 pounds",
      "Department": "Home",
      "Manufacturer": "Royal Opulence",
      "ASIN": "B000RH175S",
      "Item model number": "109485",
      "Customer Reviews": "3.8 out of 5 stars7,689 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#3,478 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Fabric Type": "100% Polyester",
      "Number of Pieces": "4",
      "Batteries Required": "No",
      "Import Designation": "Imported"
    },
    "categories": [
      "Home & Kitchen",
      "Sheet & Pillowcase Sets",
      "Bedding",
      "Sheets & Pillowcases"
    ],
    "price": 25.22
  }
}