{
  "website_summaries": [
    {
      "verdict": "A good way to keep your vehicle elevated while working underneath it or while changing a tire using a jack.",
      "pros": [
        "Extremely easy to use in a pinch",
        "The stands come with a simple adjustment lever to change the height so you can fit it to your car",
        "The height is adjustable from 11 inches to 17 inches",
        "Solid handles and self-locking ratchets allow you to work on your vehicle safely"
      ],
      "cons": [
        "Too small to confidently use with large and heavier vehicles like large trucks"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Check the double-lock, mine was not implemented properly",
      "text": "As a safety issue I give these 1 star. I bought these because they're described as double-locking (ie safe) but the saddle bar teeth barely extend over the lock bar. It's like 1/32\" of coverage on one end and 1/16\" on the other end. I think either the quality control is poor or they're a design clone and they didn't know how important lock alignment was when they cloned it. Another possibility is that they correctly designed the stand mouth BUT for a saddle bar that had wider teeth, not what was included. What I got is totally unacceptable from a safety standpoint. I'll be returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Poster",
      "helpful_votes": 60,
      "publication_date": 20190709
    },
    {
      "title": "The welds look really good and they used really heavy duty metal to put ...",
      "text": "These are very heavy duty Jack Stands that I have trusted my life with many times! I have used them on my 3/4 ton Dodge Ram several times and I have never even had a thought that they might break. The welds look really good and they used really heavy duty metal to put these together with. The double locking feature is an added bonus to give me piece of mind! Keep in mind these are for trucks and SUV's and will most likely not fit under most cars unless you jack them up way more than what is needed or even safe for basic maintenance work on a vehicle.",
      "rating": 5.0,
      "verified": true,
      "author": "Cyndric",
      "helpful_votes": 125,
      "publication_date": 20161129
    },
    {
      "title": "Broke after 15 months and light use",
      "text": "I have not used these stands much at all. Maybe 3-5 time in the 15 months I had them. And yet a little round pin that connects the release handle to a ratchet for holding the toothed rod in place broke. the disturbing thing is that it was not under load. I was just walking with it from one spot to the next holding the ratcheting handle and then powey it broke. I guess it is a blessing that I was not under the car when that happened. But now it makes me wonder whether the 'good' one is safe. Buyer beware.",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph Gimenez III",
      "helpful_votes": 24,
      "publication_date": 20190725
    },
    {
      "title": "SUV or Truck then buy 6 ton",
      "text": "If possible opt for 6 ton version. I have a 4runner with a respectable amount ground clearance (unmodified). I found myself using the maximum extension of the 3 ton jack when changing the oil. I was able to perform the maintenance and there is even enough clearance to change a tire or do the brakes but I would love to have the extra range of the larger 6 ton version. The product performs as advertised but if you have an SUV or truck then don't sell yourself short.",
      "rating": 5.0,
      "verified": true,
      "author": "Walter M.",
      "helpful_votes": 71,
      "publication_date": 20191205
    },
    {
      "title": "Large, sturdy Jack Stands",
      "text": "Never had 6 ton stands before always 3 ton or junk scavenged from trailers and worse. These are nice, really nice. Big and on my little Acura she is jacked up reaaaaaly high (both side wheels off the ground) just to get these under at their lowest setting. With a little work you could get a car up ridiculously high. I felt way safer under the car with these monsters holding it up compared to my 3 ton ones. Massive overkill for a little Acura, yep. Worth it YEP!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Yeck",
      "helpful_votes": 67,
      "publication_date": 20191002
    },
    {
      "title": "Buyer beware",
      "text": "Product arrived obviously used — scratched up and dirty. Returned for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "tumbleweed_scout",
      "helpful_votes": 8,
      "publication_date": 20190223
    },
    {
      "title": "Welds cracked producket unsafe",
      "text": "I ordered this twice the extra lock is cool but it's useless if the welds come cracked",
      "rating": 1.0,
      "verified": true,
      "author": "mitchell",
      "helpful_votes": 7,
      "publication_date": 20190917
    },
    {
      "title": "Ok jack",
      "text": "This is my second set of these. In the first set, the ratcheting would not work (jack would not stay up) and the pin would not go in either. The whole jack seemed \"bent\" out of shape. This is my second set now and this is much better but it does seem a little dinged up. The pins go in on each jack this time but it only \"catches\" on one of the jacks, not both. Overall, I think these will work but they have some seriously quality control issues that could be life-threatening.",
      "rating": 3.0,
      "verified": true,
      "author": "Toni ",
      "helpful_votes": 2,
      "publication_date": 20200329
    },
    {
      "title": "Crappy welds, questionable if itd hold capacity",
      "text": "Sending back, poor welds for the money spent on these they aren't cheap more middle of the road and they could have done better. I wouldnt totally trust these with a truck on them.As a welder I thought of rewelding them but I shouldn't have to depends on price to ship back. I like the design and price, not sure why they weld the backside and not the front where label is, perhaps looks wouldn't want wrinkly label now lol someone's life depends on these.",
      "rating": 1.0,
      "verified": true,
      "author": "Peter A.",
      "helpful_votes": 8,
      "publication_date": 20171109
    },
    {
      "title": "Not sure I would buy again",
      "text": "I have used a pair of these at my old job and really liked them for the extra safety locking mechanism and they great but when buying these I noticed quite a few bad reviews and figured I would try anyway the secondary lock works good but the primary lever lock sticks seems like it's due to the paint on it I haven't tried to lube it which would probably solve he issue but this should not happen on something like a jack stand where someone could be seriously hurt or killed because of some paint hanging the lever up",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181224
    },
    {
      "title": "Safety pin barely makes contact.",
      "text": "Very disappointed to see that the safety pins barely contacts the teeth on the vertical members. I will not trust them as a safety at all. I am surprised because I have the 2-ton version of these that I bought about 12 years ago and the safety pins on those make full/substantial contact.",
      "rating": 1.0,
      "verified": true,
      "author": "J Silliman",
      "helpful_votes": 7,
      "publication_date": 20180322
    },
    {
      "title": "Double locking is a must",
      "text": "I bought two pairs to lift a 7000lbs travel trailer. It works great. Double locking provides much more confidence.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond",
      "helpful_votes": 66,
      "publication_date": 20200125
    },
    {
      "title": "It was a gift - recipient is happy",
      "text": "This was a gift (really!). Not my idea of a gift, but what the recipient wanted. :-) The recipient was happy with the jack stands. However, we noted that they were not packed very well and banged together in the shipment. The paint on both jack stands was pretty dinged up and the recipient noted that had these been on the shelf in a store, he would have asked for a \"scratch and dent\" discount. That said, when I offered to return them, he declined and said that they were going in the garage and would get beat up in use anyway.",
      "rating": 4.0,
      "verified": true,
      "author": "G1",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Six tons... no sweat",
      "text": "I have a vintage 24-foot Class C RV, and on occasion it needs to be jacked up for maintenance --plumbing, tires, this and that. I hated climbing under there with just a bottle jack between me and eternity. I only did that once. I put off repairs rather than do it again. Then I bought these. Last week, I jacked it up, stuck one of these under the frame, and worked all day with only the most passing thought about mortality (you never want to be completely oblivious about working under that much steel). They're stashed with the rest of the tools now, just part of the kit. Good deal.",
      "rating": 5.0,
      "verified": true,
      "author": "David Cortner",
      "helpful_votes": 63,
      "publication_date": 20190709
    },
    {
      "title": "Stay away!",
      "text": "After returning my Harbor Freight stands that were recalled, I wanted something better with a locking mechanism. If you buy it for the lock, don't buy them. One would lock in place in maybe 2 positions, and the other would not lock in any position. I could not determine the reasoning for the first one not locking, but the second one's pawl was crooked (pictured). The stand itself was also not level (also pictured). I would rather have HF stands than this garbage. They're all made in China anyway, so little difference in quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Poor Welds and No Welds on some sets,  but not all sets!",
      "text": "Somebody missed quality check when these left the warehouse. I have bought two sets of these jack stands, one with perfect welds and one set with both bad and no welds at all in some places. Definitely check to make sure your welds are together properly! I couldn't believe that some areas were not welded at all! So I'm torn, one set was great perfect welds. And the other set had a first-time welder missing steps completely. See pictures and decide for yourself. I returned them.",
      "rating": 2.0,
      "verified": true,
      "author": "Dave R.",
      "helpful_votes": 2,
      "publication_date": 20200531
    },
    {
      "title": "Product not working properly and quality not what I expected.",
      "text": "Ordered these 6 ton jack stands because of highly favored reviews. Regarded as high quality and workmanship. However, when delivered the box looked like it had been dropped off a 50 ft cliff. I inspected the jack stands and noticed some paint chipping, the release lever on one stand does not fall freely as intended (see photos) I have to force it down and I am afraid to use it now. Both stands do not sit even on level ground. These stands do appear to be well constructed but QC dropped the ball on these pair. I am quite disappointed with these jack stands. I'm going to contact the manufacturer see what they have to say.",
      "rating": 3.0,
      "verified": true,
      "author": "Gary Rosas",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Great investment for vehicle work. You can see and feel the quality.",
      "text": "I'm sure everyone looking for replacements for their weak Harbor Freight stands that got recalled are wondering if these will unlock and let your vehicle crush you. Well, as of writing this review, I can attest to the fact these things hold up well and are strong. The locking mechanism is solid and gives you a very high level of assurance it will not fail. I highly recommend these for any driveway mechanics. These will last you a lifetime.",
      "rating": 5.0,
      "verified": true,
      "author": "DM1986",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Like the locking feature",
      "text": "These jack stands are well built and I like the locking pin feature. These stands look very similar in design to my 30 year old Craftsman jack stands, so I expect them to be durable. Some folks have complained about poor welds in jack stands on sale now and from what I've seen this is a random problem. I've seen poor welds in stands that cost 4X what these do, so just hope you get one that was not welded on Monday or Friday! The welds on my stands are OK. Just one spot that I'd say was not good, but overall they are acceptable.",
      "rating": 4.0,
      "verified": true,
      "author": "Redsvbob",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "My Priority is 24,000 lbs of SAFETY. What's yours?",
      "text": "Just finished a bilateral rear hub assembly replacement on a JK wrangler ULT. Needless to say I had two pairs of these monsters jacking up the whole frame. Wasn't gonna attempt the job with NOTHING less!",
      "rating": 5.0,
      "verified": true,
      "author": "SG1_PRO",
      "helpful_votes": 65,
      "publication_date": 20190524
    },
    {
      "title": "Next Best Stands",
      "text": "Was looking for a set of 6 ton stands that would provide better protection than the recalled ones from a well known big box store. These seemed to be the go to for most folks. The quality seems pretty good and the finish on the stand/support appear to be nice and in tact. These do have the little extra locking bar that will keep the pawl and lever in place while the jack stand is in use.",
      "rating": 5.0,
      "verified": true,
      "author": "bart2546",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Worth the extra money for dual locking jack stands",
      "text": "Worked great to hold up my 2009 Mazda 6 when I was bleeding my brakes. They are a bit tall for lower cars, however, that won't be an issue so long as you don't use a cheap low profile jack like I did. They held my car up with no issue at all and surprisingly the paint on the bottom has held up well to me sliding them around on my rough concrete floor. These are a great value and they are quite seriously a life saver.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooks Robinson",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Not too bad, but not 100% level to the ground",
      "text": "Cool safety feature, but it didn’t feel level to the ground. Felt like it was about a milimeter off or something. It also came scratched/damaged from the box. I bought it and didn’t have time to use it until last week so the return time was over and I needed something to work on my car, so I just kept it. The scratch doesn’t bother me too much since it’ll get scratched up over time.",
      "rating": 4.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "When you life depends on a tool, it's worth paying a little more for a quality one",
      "text": "After having my Harbor Freight stands recalled, and then the replacements recalled, I decided it was worth spending more for a well made set. These fit the bill, and the extra safety lock makes them even stronger. The base is wide enough to keep them stable. Cheap tools are OK for some uses, but not to hold up several thousand pounds while your lying under that weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Stand Tall",
      "text": "These work really well and seem well made for the price. Working great with my 8\" lift Samurai. Overkill really, but someday I may have a tank to put on these. My reason for 4 stars is the locking pin. It can be knocked out with a very light touch or brushing up against it for example. A safety feature like that should not be able to be pushed out when a mouse farts. They really need to rethink this feature and redesign it so it stays in place. I will have to McGuiver my own solution.",
      "rating": 4.0,
      "verified": true,
      "author": "Jiggidy Jives",
      "helpful_votes": 2,
      "publication_date": 20170419
    },
    {
      "title": "Awesome Jack Stands",
      "text": "I trust Big Red - They have been making Jack Stands for a few decades. They are extremely sturdy - however the minimum height increases when you go up in Capacity. You can use the 3 ton stands w/ a car but because the minimum height is 15\" that is sort of high for a car.. but definetly workable. I always buy the higher capacity Jack Stands - getting squished would be a terrible way to go out. Am i right? =]",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "One for the price of two",
      "text": "Received these jack stands while I was in military orders and didn’t get a chance to open them until (conveniently) a couple of days AFTER the return window closed. Package was half destroyed when they arrived and one of the black legs was missing, so essentially I got one stand for the price of two. The one that is complete is nice. The other one is already chipping paint off.",
      "rating": 1.0,
      "verified": true,
      "author": "Corey",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Perfect replacement for the recalled Harbor Freight stands",
      "text": "After 2 recalls on Harbor Freight jack stands, I returned 2 sets (2 and 3ton) and got these. Positive lock, very sturdy and probably won't kill me. (something I look for in safety equipment)",
      "rating": 5.0,
      "verified": true,
      "author": "David C. Logothetis",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "I remember my first weld smh.",
      "text": "1 jack came looking perfect but the other one in the box look used. Red paint coming off and scratches everywhere. Also the weld on the dirty jack has holes in the weld. I remember my first time welding smh. where’s the quality control?",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Good looking jacks at value price",
      "text": "Jacks appear well-made, good materials, sturdy. Unfortunately, they were delivered several days too late and my need had passed. Also, the shipping box was all beat up with parts of the jack poking thru. They ship in the flimsy \"point of sale\" OEM box, which is not placed inside of an additional actual shipping box.",
      "rating": 4.0,
      "verified": true,
      "author": "John R. Anderson",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Very nice jacks!",
      "text": "I bought these to replace the defective and dangerous ones from HF and I'm impressed. They were slightly more than the HF refund, but included the locking mechanism for safety. I have to admit, they are tall, but that's why I needed them. I bought two packs for four total and just used them on a tire rotation this morning. Quality.",
      "rating": 5.0,
      "verified": true,
      "author": "James Gleason",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "I bought it for the double locking",
      "text": "I brought my previous jacks back to Harbor Freight when they got recalled due to sometimes releasing. I studied Amazons choices of Jack strands and I picked out these and I wasn't sorry. They are nice and sturdy, not that much heavier that the smaller capacity jacks and have a dual locking system.",
      "rating": 5.0,
      "verified": true,
      "author": "A. A. lll",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Massive With High Lift",
      "text": "I got the 6 ton since they were only $10-11 more than the 3 ton plus they had higher lift capability which is nice to give you extra space to work under your vehicle. The double locking safety feature is comforting. These aren't for a centerpiece on your dining room table. I paint chip here or there has not effect on their functionality. I'm very happy with the value for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Yonker",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "They are small",
      "text": "I envisioned wider profile stands however, small is really not a bad thing. They are perfect under my Ford Escape when changing oil or my Scag mover when changing out blades. Under my full sized Chevy truck I would prefer the larger 6 Ton stands for a wider stability stance. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "MR",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Great stands for SUVs and Light Trucks",
      "text": "I used these stands to change the shocks and struts on my Jeep Grand Cherokee. They were the right size and were very stable. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Mattski",
      "helpful_votes": 2,
      "publication_date": 20190814
    },
    {
      "title": "Good price! but the quality should be improved.",
      "text": "I bought it this one to change my transmission fluid. It helped me get job done today. But i have something to say. I thought the steel is not thick enough. when jacking up my car, it was not very vertical as picture, so the safety pin can fits very well. Honestly, I was a little worried about my safety while I was under the car today!",
      "rating": 3.0,
      "verified": true,
      "author": "シュエ",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Returning this product immediately",
      "text": "Needed to do some brake work on the family vehicle, my Torin 3 ton jacks just arrived the previous day. Unpacked everything to be completely disappointed. The locking handle on one of the jacks was broken. Styrofoam on one end was kind of brokenup, but to me that shouldn't matter. These jacks are 3 tons thy should be able to take a little beating. This is not safe and I doubt I will buy this brand again. To the local auto store I go.",
      "rating": 2.0,
      "verified": true,
      "author": "Joshua G. Brown",
      "helpful_votes": 5,
      "publication_date": 20170622
    },
    {
      "title": "Safe quality product",
      "text": "I bought these to replace the deadly harbor freight recalled jack stands these are very nice but don’t let your guard down they are mechanical devices things happen make sure you keep the floor jack in place these are secondary safety’s I do like the safety pins that go through the ratchet these are definitely a major upgrade I feel much safer now !!",
      "rating": 5.0,
      "verified": true,
      "author": "Traveling tech",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Great jack stands for the money.",
      "text": "I bought these upon a recommendation from a third party source. The feature that really convinced me to buy this set was the double locking feature. With this feature, it makes you feel much safer while working under a half ton truck. There was an issue with the weld bead on one of the stands; however, the seller was very good about resolving the issue.",
      "rating": 5.0,
      "verified": true,
      "author": "sped teacher",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Unstable",
      "text": "One of the jack stands doesn't sit on all 4 legs, crooked and unstable. Came with paint chips from transposition",
      "rating": 1.0,
      "verified": true,
      "author": "gelovet",
      "helpful_votes": 2,
      "publication_date": 20190810
    },
    {
      "title": "The welds are all good, legs are even",
      "text": "I was pleasantly surprised with the quality I received for the price. The welds are all good, legs are even, moves and locks both smoothly and positively, and the pin for an extra safety lock is another added bonus. I would recommend them for anyone who needs a high lift, heavy rated jack stand. These are 6 ton PER for a total of 12 for the set, according to the box and stand labels.",
      "rating": 5.0,
      "verified": true,
      "author": "Motorhead",
      "helpful_votes": 63,
      "publication_date": 20180512
    },
    {
      "title": "Very good for the price",
      "text": "They work very well, for the price you can't expect anything better. They are by no means industrial quality but it's also not at an industrial price. For anyone working on a few cars here and there these are perfectly fine. However, I wish I would have bought the 2 ton stands just because the 3 ton jacks sit a little high for my small car. The 2 ton stands sit about half an inch lower in the lowest setting. Not a big deal but it's something to think about.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "absolutely worth it",
      "text": "great price. the double lock feature for mine seem sturdy. i was a bit concerned reading others reviews of the lock not being completely solid or even that good. but i have had ZERO problems and i am so happy i bought these. are they the absolute best in the world. no. there are definitely higher quality ones. but are these great for the every day man working on his own car. ABSOLUTELY.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared Skinner",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Perfect,fast shipping",
      "text": "Looks good and welds and paint looks good cant beat the price and fast shipping",
      "rating": 5.0,
      "verified": true,
      "author": "Alan and ash",
      "helpful_votes": 64,
      "publication_date": 20191008
    },
    {
      "title": "Worked great for 5,200 lbs. Truck",
      "text": "These do exactly what you want. Have used them to support the front of my 5,200 lbs truck. The double locking feature adds piece of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "RG",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Good product for the price",
      "text": "Pretty decent set of jack-stands for the price. The lowest setting is about 15 inches, so you need a jack that can raise your car up at least that much in order to use them. These will work well for light usage. They worked on the front end of our Honda Odyssey, but they don't have the clearance for our truck.",
      "rating": 4.0,
      "verified": true,
      "author": "Sterling M. Smith",
      "helpful_votes": 3,
      "publication_date": 20170306
    },
    {
      "title": "Just OK",
      "text": "Does what it's supposed to, but seems cheaply made. I'm using them to store a small import off the ground, but wouldn't feel comfortable working under them, especially at the highest setting. Unfortunately you have to pay a lot more for jacks of any real quality",
      "rating": 3.0,
      "verified": true,
      "author": "Russ S.",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Solid affordable jack stands",
      "text": "I’ve used this for multiple jobs on a Toyota Camry, paired with their scissor jack (which has been sturdy and well for its price), and they’ve held the car up no issue. I’ve had it sitting for up to 16 hours all intact. Well priced compared to some other stands, and for the small increase in price from their normal stands, the double lock feature is good for added security and ease of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Not happy with return policy!",
      "text": "Bought two sets of 3T stands. Thought there was 1 stand per box - there are two per box. Stands are too short for my Tacoma. Requested return. Will charge me $20.00 for the FEDEX return label before refund of balance. This was my choice as I could have sent them by another carrier. I will purchase 6 Ton stands from another vendor. Otherwise quality of product was good (what I saw).",
      "rating": 4.0,
      "verified": true,
      "author": "Miner",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Pair?",
      "text": "I thought this was a pair of stands I received 1 stand. It's a nice stand but I needed a pair.",
      "rating": 1.0,
      "verified": true,
      "author": "scott",
      "helpful_votes": 5,
      "publication_date": 20170725
    },
    {
      "title": "This is what I needed for safety and peace of mind when working under a couple of tons",
      "text": "This is a much better option then some of the 3 ton jack stands out there. If it will fit under your vehicle it is a safer option then relying on some of the welds on cheaper 3 ton units and this one locks the pawls in so there is that peace of mind also.",
      "rating": 5.0,
      "verified": true,
      "author": "stpaja59",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "I'm not dead yet.",
      "text": "So far these have held my 392 Hemi Scat Pack up without crushing me. Only time will tell. These are very well made, very sturdy, and very strong. The double locking feature is great peace of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Rugged Stands",
      "text": "These things are monsters. I feel totally safe under our cars and trucks using these stands. For added safety there are pins that keep the stands from accidentally slipping and that was my main selling point. They are heavy and rugged too. On my pair I found no noticeable bad welds as other reviewers observed.",
      "rating": 5.0,
      "verified": true,
      "author": "Islanders Man",
      "helpful_votes": 2,
      "publication_date": 20170324
    },
    {
      "title": "Really Nice",
      "text": "I really like these, the only thing is that they are extremely tall! I have to use my 3 ton and have extended all the way to the limit. I don’t think I’ll ever use it higher than the lowest setting.",
      "rating": 5.0,
      "verified": true,
      "author": "D Perry",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Great price, easy to use, and sturdy",
      "text": "Definitely sturdy enough for me to trust going under my car to change my oil. Easy to use as well.",
      "rating": 5.0,
      "verified": true,
      "author": "TesPot",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Very strong and reliable so far",
      "text": "Looking back, the double locking pins are overkill but I guess it's nice. I used these a few times for brake jobs and tire replacement at home and they have served me well so far. I did inspect the welds because many other comments talk about them being bad. The welds for mine seem very good, but keep in mind I'm not a professional welder.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Great value",
      "text": "These jack stands are sturdy, the recess in the head isn't too deep, the extra locking pin is a great idea. Paint is thick and seems like it will last a long time. Overall a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "CaptainBasic",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Poor all around gaulity",
      "text": "I bought two pair returned immediately. Problems - poor quality welds, 1 of the 4 does not sit flat on the floor, 3 of the 4 the columns rock in the housing. 3 of 4 the safety pin does not engage the column so the ratchet would have to fail before it \"might\" engage the column. I don't feel the ratchet engages the column any better than the recalled HF units.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Of good quality and quick delivery",
      "text": "Took a real close look at all welds and found them to be of good quality. Enjoy the double lock feature. A little more confidence over single lock stands. I am happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Kurt",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Decent, but double locking part barely engages...",
      "text": "Solid. Good quality for the price. Only issue (as mentioned by previous reviews) is that the double locking mechanism barely engages the teeth. I wouldn't put my life based just on that. But the primary mechanism seems just as solid as any other single locking stand.",
      "rating": 3.0,
      "verified": true,
      "author": "Maker Mac",
      "helpful_votes": 2,
      "publication_date": 20170612
    },
    {
      "title": "Locking pins do NOT fit, terrible packaging.",
      "text": "Locking pins do not fit. Both stands looked used due to marks and scratches on the stands, the box was open at the seams and was poorly re-taped to barely hold it together, parts of the box coming apart, box had large recatangle bare sections where some type of labels had been previously removed, stands are unusable and unsafe due to safety pins could not fit through the insert holes. Stands returned for refund.",
      "rating": 1.0,
      "verified": true,
      "author": "WWL",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Good for my Miata!",
      "text": "I own a Miata and had my shocks fail on me.. so I got stupid and bought a coilover kit, and once the overexcited mechanics installed the coilovers I lost the ability to work or raise the car (yeah don't mess around with your stock settings on your miata trust me..keep it stock...) anyway raised the car back closer to it's stock height but still had a real hard time changing oil on my car and I do not feel safe working on a car without extra jacks...so it was pretty hard to find one that could fit under the fender on a low setting but these jack stands are great... work flawless... cheap and high quality. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Chidester",
      "helpful_votes": 0,
      "publication_date": 20141102
    },
    {
      "title": "Good value but a couple of irritations",
      "text": "I'm not sure if I should have taken a star or not, but although these are very sturdy and a value as-is, I think that the ratchet could be more compressed (more ratchets) so that there isn't so much wasted space between the seat of the ratchet (top) and the bottom of the vehicle's jack-position. Also, the second lock is like a kid's puzzle and could be much less challenging to insert. Otherwise, these are keepers.",
      "rating": 4.0,
      "verified": true,
      "author": "MikeInWeston",
      "helpful_votes": 0,
      "publication_date": 20160822
    },
    {
      "title": "Sturdy and Decently Well-Built",
      "text": "Yes some of the welds on these are sloppy, but I can't see any spots where the the strength might be compromised. Overall, these are very sturdy and the locking pin is a nice safety upgrade from the regular jack stand. I have a pair of the older version with out the lock pin that have been used and abused for many years, without issue. I used them to hold up the front end of my diesel HD pickup. This second pair will allow me to do tire rotations in the garage. For the price, Torin jack stands are great for the home user.",
      "rating": 4.0,
      "verified": true,
      "author": "Vegoose",
      "helpful_votes": 0,
      "publication_date": 20160316
    },
    {
      "title": "Safe, stable and awesome",
      "text": "Great product! I purchased these (6ton stands) for my 2017 Toyota Tacoma. Very nice heavy duty stands with locking pin and wide stable base. This is totally five star worthy but I rated it at four stars due to the paint being worn off in a few spots upon receiving. The item was packaged well but somehow it happens. Not a big deal at all. I am glad I upgraded to these stands safety is very important to me.",
      "rating": 4.0,
      "verified": true,
      "author": "Doug",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Replaced my Harbor Freights death traps",
      "text": "Nice locking mechanism with pin. Welds look sturdy and base is wide. Bought these to replaced my Harbor Freight recalled jacks and even replaced the replacement jacks as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Thaeyo",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Built Like a Tank",
      "text": "They're stout and heavy....bought to work on an old 3/4 ton pickup...worked well",
      "rating": 5.0,
      "verified": true,
      "author": "T. Mos",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Just absolute junk",
      "text": "Lousy welds, poor locking , just all around junk. I will never get under a vehicle using them, kept them for my lawn mower and the kids go karts. Buyer beware!!!!!!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Old Timer",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "They make me feel safe under my Jeeps",
      "text": "I feel safe using these. They are a little heavy but that’s a good thing. The extra lock gives me comfort and they have been a great asset when changing the oil, diff fluid, transfer case fluid.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian E. Eckley",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Short and lightweight for smaller cars",
      "text": "I have an old set of lightweight stands, seems they are always under something when I need another. Decided to buy two more, these fit the bill perfectly. I just wish the locking pin was held in with a pin clip so they don't fall out moving it from project to project. I may drill a hole in each pin to avail this feature.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "great set of stands",
      "text": "just plain works - and the double locking is a must when working under a car. has held up car for over a week with NO movement whatsoever (also using big red chocks and torin 3K jack for a third stand)",
      "rating": 5.0,
      "verified": true,
      "author": "ken logsdon, jr.",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "I'm happy with the purchase",
      "text": "Appear to be very sturdy safety features I pictured the six ton jack next to the two ton jack to give someone an idea the difference in the size",
      "rating": 5.0,
      "verified": true,
      "author": "John Talley",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Perfect size up",
      "text": "Needed some stands that were taller than the average stands and these are perfect. Nice solid, sturdy base and the bonus is the locking pin that comes with them. Delivered 2 days earlier then expected and no damage to the stands. Great stands for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Geisel",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Great Jack Stands",
      "text": "Solid and well made to hold the box frame of my F250 without concern. They have enough height variance to get my biggest truck off the ground and yet fit under my smallest vehicle. The locks are a great safety feature in addition to making them easier to carry around. No doubt they can handle the weight and they look to stand the test of time as the wear points are very robust. They come disassembled so you need to bend a piece of pretty thick metal if you want to ensure the shafts never pull all the way out again.",
      "rating": 5.0,
      "verified": true,
      "author": "JonBolt! \\o/",
      "helpful_votes": 0,
      "publication_date": 20151218
    },
    {
      "title": "These jacks are safe",
      "text": "These jacks have a locking feature which makes them safe for holding up cars, trucks, mowers, etc. The ones sold in Walmart, harbor Freight are susceptible to failure. They can allow the weight to fall on you if disturbed abruptly.",
      "rating": 5.0,
      "verified": true,
      "author": "James C",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "they're welding machine needs to be fired",
      "text": "These stands are ok. So far they havent killed me at least. I was a little worried because I read a lot of reviews saying that the welds were poor. But I decided to buy them because the price was right. Once they arrived I checked them over good and 3 of the 4 stands I bought had somewhat decent welds but the fourth one looked like chewed bubble gum. I use them anyway because I figured something that important would have to be well tested considering peoples lives are on the line. I don't know if I'm right in assuming that or not. But it does make me nervous every time I crawl underneath.",
      "rating": 3.0,
      "verified": true,
      "author": "Eric R.",
      "helpful_votes": 0,
      "publication_date": 20140922
    },
    {
      "title": "Poor Quality",
      "text": "I bought these as a replacement after the Harbor Freight recall. I never had any issues with my HF stands and wished I had kept them. These arrived and the the box was destroyed, a half dozen spots of scratched or completely chipped off paint and seem more unreliable then the recall items. Would NOT recommend!",
      "rating": 2.0,
      "verified": true,
      "author": "TGF",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "New rings please",
      "text": "Look okay paint chipping right out of box. Different sized pin holes bought 2 pairs 1 pair fits snug 1 pair is loose. And 2 of my o rings that connect the chains on one of the pairs I bought came defective. Would atleast like another set of the rings sent.",
      "rating": 1.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "it works.",
      "text": "they work. The pin slot is hard to get the pin into. It feels sort of solid. The design of these is made to go on the chassis...BUT the car manuals say to use the rails on side. Well...these DON'T FIT side rails! Now you need some other adapter to fit. Otherwise you will eventually buckle your rails.",
      "rating": 3.0,
      "verified": true,
      "author": "AfterhourshopTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "work great and safety pins are an added bonus",
      "text": "These were much needed as I was tired of having the small 2 ton jack stands. These are much better and safer. Love how much more room I have under the vehicle while laying on a roller creeper. Never had a locking pin in my other jack stands, definitely worth the upgrade. Unboxing did reveal some scratches to the paint from shipping but these are gonna get used and I don't expect them to remain flawless. Bought 2 pairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Pashan Vossoughi",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Good buy",
      "text": "Product made well. Have already used several times. No issues with fabrication welds. Back-up lock pin is a must have. Pleased with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Lawson",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "These are great!  Very secture!",
      "text": "I purchased these to restore my classic car. I'm able to support the car on four jacks with ease. I feel secure working under it because of the security locks. I cannot recommend these enough!",
      "rating": 5.0,
      "verified": true,
      "author": "KU Fan",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "If you own a truck or SUV, you need these!",
      "text": "These jack stands are awesome! I own a Chevrolet Avalanche Z71 and I can fit most standard jack stands underneath the frame without even jacking up the truck, so I needed jack stands that give me the high lift ability while still remaining stable. The lift range on these jack stands is great, and the build quality is very high. I have complete confidence in these jack stands while working beneath the truck. Similar jack stands are well over $75. The additional safety lock is a great feature, especially if you have to work near the jack stand. It is a simple metal bar that slides in between the lift teeth, preventing the neck from lowering.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20120227
    },
    {
      "title": "Great Jackstands",
      "text": "Solid, wide base, safe with the lock pin. They are tall, though. They will be great for my Tundra, but It's a bit tougher to get my Odyssey high enough to sit on them. Got to jack it way up. Overall, though, love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Stith",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Jack stands",
      "text": "What made me choose these stands over any other: It has an second safety feature to assure your vehicle will not come down and kill you. Read the description - they clearly are not the same as others offered. Not to say the others are not safe - just that THESE offer and added feature - - I -- would not ignore. SAFETY FIRST - in anything, everything.",
      "rating": 5.0,
      "verified": true,
      "author": "Mona",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Solid jack stands",
      "text": "Love the locking pins. For just a little bit more I felt much more confident being under the car for hours",
      "rating": 5.0,
      "verified": true,
      "author": "f p",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Little extra money for the peice of mind - double locking pin",
      "text": "Bought one set of these so I could change my own oil and jack up the front of my car. I'll be buying another set. worth the extra money for the piece of mind from the double locking pin. I looked into getting a pair from my local harbor freight and the build quality and locking was scary. not something I want to trust my life with. With these Torin double locking ones I have no problem getting under my car to wrench.",
      "rating": 5.0,
      "verified": true,
      "author": "GeorgeWashington",
      "helpful_votes": 0,
      "publication_date": 20161126
    },
    {
      "title": "nice and strong",
      "text": "I bought these after I couldn't find any others locally. I'm really glad I picked them up. I have used them several times in the past few weeks and I'm very happy with them",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. H.",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Great, just needs an extra safety feature.",
      "text": "I loved this product. I have another 2 ton jack that I keep in my trunk for emergencies but I needed these for other repairs to my car, and they have worked well so far. My only complaint is that there is not a locking pin for the pins, to keep them from falling out. The locking pins themselves work good and feel sturdy, but if the jack got bumped I would be afraid of one of the locking pins slipping out.",
      "rating": 4.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Just what I needed",
      "text": "These are awesome little jacks. Not only is the 6 ton capacity nice, but they reach fairly high which is nice for my pickup",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth Hampton",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Overall, very nice for the price!",
      "text": "Very nice for the price. They're supporting a 1979 Jeep Wagoneer's front end right now. They go up plenty high for my wagoneer and are holding up nicely. They are stable enough to pull an engine out with and feel safe. The added safety of an additional ratcheting lock gives me a bit more confidence. As one person said, they are only welded on the inside so I wouldn't recommend taking them right to the 2 ton limit. They are great for normal home use and I can expect and predict I'll be using these just the same in 10 years easily. I'd recommend them for normal home use.",
      "rating": 4.0,
      "verified": true,
      "author": "Sailor B",
      "helpful_votes": 0,
      "publication_date": 20131016
    },
    {
      "title": "Sturdy stands",
      "text": "Good, solid stands. Missing one of the lock pins. Contacted Torin and they happily sent a replacement. Excellent customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Sturdy, but bent pawl",
      "text": "I ordered two pairs of these. One pair was fine. One of the stands in the other pair came with a bent pawl so the ratchet wouldn't engage. I didn't find this out until later since I wait for a while to open the box. Just be aware and check it out before using. Otherwise the backup safety is nice and they seem well built and strong. Be safe out there, always have a back up like cribbing!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Nice and sturdy",
      "text": "I needed something with some height so I could raise my truck up and let the axle and suspension drop. These worked great on my f150 extended cab 4x4. Nice locking features also.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Well Made and as advertised",
      "text": "Already used these jack stands. They are well made and I like that they have the extra lock for more safety.",
      "rating": 4.0,
      "verified": true,
      "author": "Darlene Silva",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Auto jack stands",
      "text": "These are steel construction and heavy. Just what I wanted. They also fit under car with the low profile jack I have.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Great For Home Garage",
      "text": "Professional grade and worth every penny! Rotated my Tesla Model 3 tires in my own garage thx to these bad boys!",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "TGFR thank God for returns",
      "text": "This is the second set I've bought. Both came missing a post. Yes, these were \"like new\" from Amazon warehouse, but both sets were well used.",
      "rating": 1.0,
      "verified": true,
      "author": "mr.fix.it",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Missing and damaged.",
      "text": "Item showed up damaged and missing parts. This happened before shipping as the outside box was in good condition.",
      "rating": 1.0,
      "verified": true,
      "author": "DsC",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "They seem to be sturdy. I like the locking pins.",
      "text": "Read the reviews and ordered. They seem to be sturdy enough for my 2.5 ton car. I also like the locking pins as added security. The welds may not be pretty, but as long as they hold up, that's what matters. Also, NEVER leave your life dependent on a single device!!! ALWAYS use a floor jack IN ADDITION to these stands, and any other solid objects wedged under the frame that would support the weight of your car as additional backup. I also have a second pair of jack stands that I use in addition to the floor jack in the event that something on these stands fail.",
      "rating": 5.0,
      "verified": true,
      "author": "lbf",
      "helpful_votes": 0,
      "publication_date": 20141119
    }
  ],
  "product_meta": {
    "title": "BIG RED T43002A Torin Steel Jack Stands: Double Locking, 3 Ton (6,000 lb) Capacity, Red, 1 Pair",
    "description": "Size:3 Ton| Style:Double LockingThe Torin BIG RED T43002A steel double locking jack stands are a must have necessity in any garage. Handles a wide range of vehicles including small cars, jeeps, ATV's, UTV's, and more. It's constructed of high-grade steel with a welded frame for quality and long term durability. Features a lifting range of 11-1/4\" to 16-3/4\" with a 3 ton (6,000 lb) load capacity. Each stand is equipped with a removable locking support pin designed and dedicated to keeping you safe and increases safety by 200%. Multi-position forged iron ratchet bar has a sawtooth design, allowing for quick height adjustments that lock into place. The saddle has a large surface area that provides better contact with the load being supported. Wide pyramid style foot base provides added strength; Large foot base delivers additional stability and measures 7-11/16\" x 6-7/8\". Meets ASME safety standards and includes a limited 1 year manufacturer warranty.",
    "rating": 4.6,
    "feature_bullets": [
      "Double locking jack stands help support vehicles after lifting with a jack; Handles a wide range of vehicles including small cars, jeeps, ATV's, UTV's, and more",
      "Features a lifting range of 11-1/4\" to 16-3/4\" with a 3 ton (6,000 lb) load capacity; Saddle has a large surface area that provides better contact with the load being supported",
      "Constructed with heavy-duty steel and is industrial welded for quality and long term durability; Removable locking support pin provides added security that increases safety by 200%",
      "Wide pyramid style foot base provides added strength; Large foot base delivers additional stability and measures 7-11/16\" x 6-7/8\"",
      "Multi-position forged iron ratchet bar has a sawtooth design, allowing for quick height adjustments that lock into place; Meets ASME safety standards and includes a limited 1 year manufacturer warranty"
    ],
    "specifications": {
      "Manufacturer": "Torin",
      "Brand": "BIG RED",
      "Model": "T43002A",
      "Item Weight": "1.2 pounds",
      "Product Dimensions": "8.27 x 7.48 x 14.17 inches",
      "Item model number": "T43002A",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "T43002A",
      "OEM Part Number": "T43002A",
      "Folding": "No",
      "Cover Included": "Parts",
      "ASIN": "B00026Z3E0",
      "Customer Reviews": "4.6 out of 5 stars1,755 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#1,071 in Automotive",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "December 5, 2007"
    },
    "categories": [
      "Vehicle Lifts, Hoists & Jacks",
      "Jack Stands",
      "Automotive Parts & Accessories",
      "Tools & Equipment",
      "Garage & Shop",
      "Automotive"
    ],
    "price": 35.04
  }
}