{
  "website_summaries": [
    {
      "verdict": "It's not the perfect controller for Virtual Console games, but the WaveBird remains the best wireless controller for playing older games on the Nintendo Wii.",
      "pros": [
        "Wireless controller that works with Nintendo's GameCube and Wii systems",
        "selectable wireless channels",
        "identical design and feel as the standard GameCube controller"
      ],
      "cons": [
        "Comparatively bulky and heavy",
        "button layout isn't the best match for some pre-GameCube Virtual Console titles"
      ],
      "aspects": {},
      "publication_date": 20070208,
      "rating": 7.5,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great alternative to buying a new controller",
      "text": "This is my third Wavebird and at this point if you're purchasing this, you know what this is, and you're more so curious as to the condition that these are in. I purchased it used in acceptable condition and it works well, has a few small scratches, but otherwise looks great and works just as well as the one I've had for more than 10 years. Considering that a new one costs well over $100 this was a great choice if you plan on actually using it. I might just end up purchasing one or two more.",
      "rating": 4.0,
      "verified": true,
      "author": "Six20SevenTop Contributor: DC Comics",
      "helpful_votes": 8,
      "publication_date": 20170825
    },
    {
      "title": "but other than that it's pretty good condition and works well",
      "text": "I purchased this Gamecube wavebird for my Luigi's Mansion game . And reason that I am giving this product four stars is because it came poorly packaged , and another reason is because sometimes you have to change the frequency about every 30 minutes to an hour , but hey what more can I expect from a used product , but other than that it's pretty good condition and works well . So if you want one of these but want to save money this is a good choice :)",
      "rating": 4.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Quality Wireless Controller",
      "text": "This is the first wireless controller I ever owned. It works perfectly and haven't had any connection issues for the nine years I've owned it. Unfortunately on my original controller, the battery prongs are loose so batteries are having a hard time powering the controller. I re-ordered another controller without the plugin adapter, since I still own the plugin from my previous controller, and the new controller works perfectly with it. Anytime I feel like booting up my Gamecube/Wii, this is the controller I use to play games wirelessly.",
      "rating": 5.0,
      "verified": true,
      "author": "Kairia",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Almost perfect",
      "text": "I purchased this item as used. And I might have not liked it that much at the beginning, but now it's okay. I didn't expect the controller to be smelly and somewhat unclean. However it's nothing some hours of delicate brushing and wiping wouldn't solve. It works very good with my console, I would have liked it was cleaner prior shipping.",
      "rating": 4.0,
      "verified": true,
      "author": "Christian",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Awesome Gamecube controller!",
      "text": "This controller has great response; in fact, it seems just as responsive as the hardwired controller. And now my dog can’t get tangled in the wires while I’m trying to beat a boss! Awesome! I bought this used, but it came in almost-new condition, there was the tiniest bit of wear on one or two of the buttons. Overall, I could not be more pleased with this controller. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "📚 Bookwyrm 📚Top Contributor: Brewing",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Late, wrong color, terrible shape, no receiver",
      "text": "I purchased this. It was not only later than the original time given, but it's silver instead of gray. The receiver is missing so it's completely useless, and it's in worse shape than any controller for any system I have. There are what appears to be chew marks on it and more. Do not buy from this person.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike C.",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Controler Malfunction",
      "text": "The controller does not work properly. I paid for a fully functional controller. It came up short on functionality. It was suppose to be fully tested, maybe it was tested with the wrong game. Zelda Wind Waker is the game the controller does not function with. You cannot play the game with this controller.",
      "rating": 1.0,
      "verified": true,
      "author": "Donald K.",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Excellent product!!",
      "text": "I bet the more reviews you read the more confused you are! I don't know what to say... this item works flawlessly and was nothing to get to work, everytime I turn it on there is no problem whatsoever... I have read reviews that it doesn't work well with 2 players with this controller and that I cannot comment on b/c I always have the other player use a wireless controller so I don't really know... I think it is well worth the price for this item unless you don't play your gamecube/wii much or don't care about having wires all over the place!",
      "rating": 5.0,
      "verified": true,
      "author": "desorbod",
      "helpful_votes": 0,
      "publication_date": 20140404
    },
    {
      "title": "Go wireless with one of these and you won't be disappointed.",
      "text": "Unbelievable for such a great price. I've seen them for so much more all over the net. well worth the investment. especially for being fairly rare in comparison to the standard controllers. I bought this for my Wii and it's really great not having to deal with a cord on a system that is natively wireless. I got it out of the box and proceeded to plug it in, forgetting g to set the channel setting (of which there are more than 10) so I freaked myself out for a moment before remembering. I had one of these on my GameCube a few years back. it is just like I remembered, perfect response! great condition!",
      "rating": 5.0,
      "verified": true,
      "author": "White Fox",
      "helpful_votes": 0,
      "publication_date": 20140121
    },
    {
      "title": "Almost perfect",
      "text": "So much has already been written and recorded about this controller, so I will keep this brief rather than add to the hype. This is an excellent controller. That said, I was severely disappointed when I discovered that it does NOT have force-feedback (rumble). I was fully expecting that, but I suppose the designers felt it would lower the battery life too much. Thus, I have to either live without force-feedback, or live with an extension cable for my regular corded controller. Tough choice; thanks, Nintendo.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris McGee",
      "helpful_votes": 0,
      "publication_date": 20130305
    },
    {
      "title": "Awesome",
      "text": "I do not use this but my son loves it. He had one when they first dropped on the market but over the years it was lost during moves. Just recently he bought a \"retro game\" and found another one of these. It was advertised as working from anywhere in the room and not needing a direct line of sight. We tested it and the controller worked through a brick wall - now that is as good as it gets.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia S Hubbard",
      "helpful_votes": 0,
      "publication_date": 20141203
    },
    {
      "title": "no mess Buttons & Sticks feel good Multiple Channels Cons",
      "text": "In today's world wires are just not convenient any more. Being able to buy a wireless wavebird over a corded controller was a huge benefit. Cords keep you close to the TV and look really messy scattered. The controller has a reciever with 10+channels so you can have multiple cordless controllers without interference. The controller does require batteries which isn't a big deal, but you will want to keep some on hand for those inconvenient times when it dies. Pros: No Wires, not tied down, no mess Buttons & Sticks feel good Multiple Channels Cons: Batteries",
      "rating": 5.0,
      "verified": true,
      "author": "Carl",
      "helpful_votes": 0,
      "publication_date": 20141110
    },
    {
      "title": "Why are they not making these anymore?",
      "text": "Bought a used one off of Amazon for Wii purposes - as most of you reading know by now, gamecube ports come standard with the Wii. This is an amazing controller, and probably the best for things like Super Smash. The range is amazing (I accidently took a game off pause changing the battery from a closet!) and I have yet to have interference. Good size and weight. Hopefully now that the Wii has a lot of users, many either playing games like Super Smash or the retro virtual console titles, they will put something siimilar on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20080829
    },
    {
      "title": "Disappointed",
      "text": "Really disappointed, controller was dirty, no back, and did not come with a receiver at all.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180723
    },
    {
      "title": "My first wireless controller",
      "text": "Or at least it was, a long time ago. I ended up getting rid of my original one long ago and when I decided to buy a Wii, I needed one of these so I didn't have to sit in front of my tv. After plugging it in, it's still just as good as ever. The range is great, the buttons all work as expected and there aren't any odd quirks that plague 3rd party controllers like they do today. If you have own a Gamecube, this is a must have accessory. It works great, the battery life is probably gonna last longer than my truck's, and overall, it is nigh perfect at what it does.",
      "rating": 5.0,
      "verified": true,
      "author": "beastwarking",
      "helpful_votes": 0,
      "publication_date": 20130502
    },
    {
      "title": "Worked well",
      "text": "Has some wear and tear, I had to clean it before using it .However, it worked perfectly with my Wii. Please note that you can not use the controller without the adapter.",
      "rating": 5.0,
      "verified": true,
      "author": "JASIM",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Great",
      "text": "Seller said it may have cosmetic issues but no problems at all. Really nice great condition. Ready for Smash Bros in December!",
      "rating": 5.0,
      "verified": true,
      "author": "Clay Clark",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Best gamecube controller by far.",
      "text": "My friends and I got really intoduring college. We would use wired gamecube controllers or wiimote+nunchuck combo. Four players with super short wires on their controllers led to a really cramped space. I found these online and they have been just what we needed. They definitely helped us up our game and made us a ton more comfortable. I would recommend for anyone who doesn't like wires and uses gamecube controllers.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey",
      "helpful_votes": 0,
      "publication_date": 20110802
    },
    {
      "title": "Nice layout, a little too big.",
      "text": "This controller works very well from the wireless standpoint. I have large hands and yet I did find that the controller was a little on the big side. It can become uncomfortable when playing for long periods of time. However, since it is wireless I will overlook the size in favor of the wireless convenience, especially since I'm using it with my Wii and I shudder at the image of the Wii flying off the top of the entertainment center when someone gets a little overzealous.",
      "rating": 4.0,
      "verified": true,
      "author": "frankfromnj",
      "helpful_votes": 4,
      "publication_date": 20061213
    },
    {
      "title": "was in terrible condition",
      "text": "would love refund without sending back since put my own money into fixing after got the sticks where not to the condition in pictures and seems to have been chewed on or something of that nature",
      "rating": 1.0,
      "verified": true,
      "author": "dan p.",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Quality but not complete.",
      "text": "Controller arrived in the time frame, but is not usable in current condition. It did not come with a reciever to connect to console.",
      "rating": 3.0,
      "verified": true,
      "author": "Steven H",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Love it!",
      "text": "A little dirty in some places, but otherwise in very good condition. Shipping was fast. It works like a dream. Glad to have one of these again!",
      "rating": 5.0,
      "verified": true,
      "author": "Maeko",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Exactly as expected",
      "text": "It's a GameCube controller that's wireless! It works perfectly with the Wii for various version of Mario Kart. It's just as responsive as a wired controller, but without the wires. It is also a lot heavier with the radio and batteries, but I actually find it feels nice and substantial in my big hands. I am going to get two more to have a complete set for the Wii or GCN. Not having wires makes life so much easier!",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20111022
    },
    {
      "title": "Better than Wii remote",
      "text": "Love it. I personally think that this remote is better than the Wii remote because the Wii remote needs a direct path to the sensor, as the wavebird does not. It works from a pretty far length too, you can be across the room maybe even in a another room and still play. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "If I could marry a controller, it would be the Wavebird.",
      "text": "The GameCube's first-party wireless controller will not disappoint. At ~100 hours of gameplay, it has an unbeatable battery life, even outstripping XBOX 360 and PS3 controllers. The extra bulk is hardly noticeable and actually helps if you have large hands like mine. Its only drawback is the lack of rumble feature, which helps save battery life. If you don't mind not having rumble feature, this controller is phenomenal.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Pettit",
      "helpful_votes": 0,
      "publication_date": 20130201
    },
    {
      "title": "Exactly what you want and a little more :)",
      "text": "Just received mine. It was exactly as described in very good condition and with it's receiver (unlike some other sellers, beware!) The very positive unexpected addition was a pair of AA batteries so I didn't even have to go dig some out. Very thoughtful!",
      "rating": 5.0,
      "verified": true,
      "author": "David E.",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "One controller to rule them all: 10 years later",
      "text": "The Nintendo gamecube is a excellent system. The wired controller is one of the most comfortable controllers I have used to this date. The Wavebird is no different. It has a almost identical design , and works great. The receiver is small and fits perfectly, and so far in the 18 hours I've played, it hasn't lost or had a messed up connection. Many reviews state that the Wavebird is heavier. I havent noticed a notable difference. I love this controller with all of my hear and would have bought four of them if I wasn't four when they were originally released in 2003",
      "rating": 5.0,
      "verified": true,
      "author": "Linus Johnson",
      "helpful_votes": 0,
      "publication_date": 20131024
    },
    {
      "title": "Wavebird controller review",
      "text": "I am a huge fan of the gamecube. All the Resident Evil games for the GC, as well as Paper Mario and others are games that I have been fond of, even prior to the GC. This controller works perfectly, and for anyone who loves playing games on the Gamecube, there is no reason why you should not have at least one of these controllers for your system!",
      "rating": 5.0,
      "verified": true,
      "author": "Crank2Lover",
      "helpful_votes": 0,
      "publication_date": 20130918
    },
    {
      "title": "Wirless Says it All!",
      "text": "It is so much nicer to be able to play Game Cube games on the Wii with a wireless controller. No more dragging the Wii across my living room to reach the couch and then having my dogs trip over the cords and have to start a game over. I bought a used one because a new one was $105.00 (ridiculous) but the used controller works perfect-just insert batteries!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20101202
    },
    {
      "title": "Gamecube Wavebird Wireless Controller",
      "text": "Works as expected. Great price. Great packaging. Great timing. Great! A+",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Darnell",
      "helpful_votes": 0,
      "publication_date": 20161114
    },
    {
      "title": "Works great, batteries last for a long time",
      "text": "I have no complaints about this controller. I love that it's silver (it's become my default controller because of it), and it works really well. I haven't had any problems with any of the keys or joysticks, and it's energy efficient so the batteries last for a really long time as long as you make sure you turn it off after playing.",
      "rating": 5.0,
      "verified": true,
      "author": "Lina",
      "helpful_votes": 0,
      "publication_date": 20130108
    },
    {
      "title": "Absolutely Beautiful. Childhood Nostalgia fufilled",
      "text": "Super fast shipping, along with a near perfect and original controller and receiver make this a great buy. Not to mention the fantastic customer service and attention to detail by the seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew M. Cornelio",
      "helpful_votes": 0,
      "publication_date": 20160507
    },
    {
      "title": "The best 2014",
      "text": "Bought it used and it works perfectly. Having bought several knockoffs this is the one you should buy. Its worth the extra 10 bucks believe me. Also if make sure the product comes with the receiver.",
      "rating": 5.0,
      "verified": true,
      "author": "BOB!",
      "helpful_votes": 0,
      "publication_date": 20140520
    },
    {
      "title": "couldn't be happier with my purchase",
      "text": "The wavebird controller works amazingly, couldn't be happier with my purchase. And to those wondering, I don't notice any input lag.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Works",
      "text": "Turns on. Did not come with the gamecube connector, didn't say it would. Was metallic grey and not flat like picture. In decent and working repair I believe",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Classic Gamecube controller without the wire mess",
      "text": "I love the Wavebird. I find the slightly higher weight more comfortable, and I love that I can use it from far away. The cable length of the Gamecube speaks to the smaller screens of years past. Excellent controller from a gentler time.",
      "rating": 5.0,
      "verified": true,
      "author": "Plasmarobo",
      "helpful_votes": 0,
      "publication_date": 20130205
    },
    {
      "title": "Great controller",
      "text": "Great controller, the wireless is such a great feature. You lose the rumble and the light weight of the wired controllers, but it is definitely a great controller to have to avoid the cord mess.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Stealyogurt",
      "helpful_votes": 0,
      "publication_date": 20141117
    },
    {
      "title": "was in POOR condition and was covered in disgusting stains that i ...",
      "text": "was in POOR condition and was covered in disgusting stains that i am still removing today. i need a screwdriver to replace the chewed up joystick",
      "rating": 2.0,
      "verified": true,
      "author": "sarah9158",
      "helpful_votes": 0,
      "publication_date": 20150730
    },
    {
      "title": "Gamecube Wavebird Platinum",
      "text": "Best controller of all time. The buttons pressed completely natural. I have had mine for over 2 years now and its still in the same shape as when i got it. The c stick is accurately placed to give easy gameplay for smooth control. The back R and L handle well with a nice click sound when ever you press it. the Z stick is a little bit harder than the other buttons, but it doesnt get in the way when you play your games. A must for any platinum gamecube. I know i got one, did you?",
      "rating": 5.0,
      "verified": true,
      "author": "regalado7",
      "helpful_votes": 0,
      "publication_date": 20100714
    },
    {
      "title": "Fast order fulfillment",
      "text": "From purchase to delivery by normal mail , I received my order in 4 days! Excellent condition ,exactly as described and it works! Five stars",
      "rating": 5.0,
      "verified": true,
      "author": "amanda brooke steele",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Good controller, bad wireless.",
      "text": "The controller works exactly like a GameCube controller should work. All the buttons feel responsive, and no stickiness. However, the wireless adapter that connects to the GameCube is a little wonky. I've had the signal drop multiple times in the time that I've used it. It's done it so much that I've switched back to using my old wired controller with a wire extender. I got this hoping I could cut the cords from my playing. Turns out the cords were keeping me playing.",
      "rating": 2.0,
      "verified": true,
      "author": "Derek",
      "helpful_votes": 0,
      "publication_date": 20131009
    },
    {
      "title": "Buyer beware",
      "text": "The controller itself is in great condition, but it is essentially an oversized paperweight because it was not shipped with the receiver. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris M.",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "A great controller",
      "text": "I've been using this controller for a while, with zero problems...and as long as I make sure I turn it off when I'm done, the batteries last quite a while. The only downsides, as I see it, is it's a bit big, and there's no rumble...but, then, a rumble pack would likely run the batteries down too quickly.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20071004
    },
    {
      "title": "No problems at all!",
      "text": "bought from amazon directly to guarantee official product, and still working perfectly on my Wii (original) played madd hours of ssx tricky (gamecube version) on my Wii using this controller laid up in my room!",
      "rating": 5.0,
      "verified": true,
      "author": "CaneLink",
      "helpful_votes": 0,
      "publication_date": 20170416
    },
    {
      "title": "Wish all controllers were this good.",
      "text": "This controller is perfection. I still use it 6+ years later to play GameCube games on my Wii. The battery life is good, the connection has always worked even in the other room. I wish all controllers for my consoles were this good.",
      "rating": 5.0,
      "verified": true,
      "author": "tmoss77",
      "helpful_votes": 0,
      "publication_date": 20121126
    },
    {
      "title": "Missing battery cover",
      "text": "It was in such great condition but it came without a battery cover :(",
      "rating": 1.0,
      "verified": true,
      "author": "John Wang",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Check for the receiver. Some sellers don’t include it.",
      "text": "My seller included the dongle/receiver. Everything was in perfect working condition and very well taken care of.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesus Leon Jr",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Mandatory for any Gamecube/Wii owner.",
      "text": "It's nearly perfect. I only wish it had rumble, but as far as layout and feel goes it's one of the best controllers I've ever owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Colin",
      "helpful_votes": 0,
      "publication_date": 20140821
    },
    {
      "title": "Unusable !!! No adapter !!!",
      "text": "It’s unusable because it does not come with the adapter ....",
      "rating": 1.0,
      "verified": true,
      "author": "Elijah Milton",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Five Stars",
      "text": "Works great, clean and in fantastic shape considering it's used. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "TheMarvelousMrsMortician",
      "helpful_votes": 0,
      "publication_date": 20160603
    },
    {
      "title": "Five Stars",
      "text": "No need for wires ever again on the Gamecube/Wii/Wiiu. This was exactly what i was looking for",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan S. Eliasof",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "Headline for my review because amazon says so",
      "text": "Came as advertised. Not a rip off or anything like that. Works well so far, no problems. It doesn't vibrate but I assume that is for all wireless controllers and not just for this one.",
      "rating": 5.0,
      "verified": true,
      "author": "justaaveragejoe44",
      "helpful_votes": 0,
      "publication_date": 20140519
    },
    {
      "title": "Although it does not have rumble, there's no other ...",
      "text": "Although it does not have rumble, there's no other way I would prefer to play Gamecube. Wireless is the way of the future!",
      "rating": 5.0,
      "verified": true,
      "author": "Snappy J",
      "helpful_votes": 0,
      "publication_date": 20140508
    },
    {
      "title": "Four Stars",
      "text": "works great. buy one if you have a GC at home, there is no better GC controller available.",
      "rating": 4.0,
      "verified": true,
      "author": "Frank Twain",
      "helpful_votes": 0,
      "publication_date": 20151209
    },
    {
      "title": "Great quality product",
      "text": "Great quality product. Feels like I have owned it all along (I tend to be very carefull with all my console controllers and accesories, so they last forever) It came in good shape and feels really responsive (no broken or loose sticks, buttons work great).",
      "rating": 4.0,
      "verified": true,
      "author": "Victor Castrejon",
      "helpful_votes": 0,
      "publication_date": 20151204
    },
    {
      "title": "Gamecube wireless controller",
      "text": "This item shipped quickly and arrived within 2 or 3 days. It was in good condition, a little dirty, but nothing that a good wipe down with a clorox wipe or something similar couldn't fix. It works very well, the receiver picks up a signal from a good distance and it even works with the wii (which is a main reason I bought it since the wii's cords aren't as forgiving as the GC). It came very securely wrapped and included 2 fully charged AA batteries, which was a nice touch! Great product from a great seller!",
      "rating": 4.0,
      "verified": true,
      "author": "Bergatroid",
      "helpful_votes": 0,
      "publication_date": 20130131
    },
    {
      "title": "Don’t trust this seller",
      "text": "Receiver does not work. Poor quality control don’t trust this seller",
      "rating": 1.0,
      "verified": true,
      "author": "Leo",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Used products in very good condition",
      "text": "Both GameCube Wavebirds were received as described in very good appearance and working condition.",
      "rating": 5.0,
      "verified": true,
      "author": "BigDog",
      "helpful_votes": 0,
      "publication_date": 20160104
    },
    {
      "title": "Buy elsewhere!!",
      "text": "Dirty, smudged, and the analog stick BROKE on the first week.",
      "rating": 2.0,
      "verified": true,
      "author": "Cristian T.",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Didn’t get receiver.",
      "text": "I didn’t get the receiver, only the controller. Completely useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Nash",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Five Stars",
      "text": "I highly recommend this! Great wireless, feels good, works flawlessly!",
      "rating": 5.0,
      "verified": true,
      "author": "Jarin",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "best controller ever",
      "text": "Fulfills needs perfectly! Nothing is better than this product at the moment. Highly recommended to anyone its low price as well!",
      "rating": 5.0,
      "verified": true,
      "author": "George K",
      "helpful_votes": 0,
      "publication_date": 20140517
    },
    {
      "title": "So glad to finally have a second one",
      "text": "Very nice, definitely could tell it had been used, but well taken care of :)",
      "rating": 4.0,
      "verified": true,
      "author": "Lucy",
      "helpful_votes": 0,
      "publication_date": 20151204
    },
    {
      "title": "Excellent Product!",
      "text": "I got this item a day earlier than expected. Was a little dirty when I opened the package but I cleaned it, tested it out and works great! Would definitely buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "MMZeroFTW",
      "helpful_votes": 0,
      "publication_date": 20150603
    },
    {
      "title": "greatest buy ever",
      "text": "greatest buy ever! i was super lucky to find it this cheap! the device is an original and still works today 2015!!",
      "rating": 5.0,
      "verified": true,
      "author": "jonathan m.",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "Great controller.",
      "text": "This controller is awesome, works very far away from the tv. It isn't heavy at all with the added battery, I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "ShenAkuma",
      "helpful_votes": 0,
      "publication_date": 20130514
    },
    {
      "title": "It is what it said it was",
      "text": "It said it was a little worn on the joystick and it was true. it still works perfectly fine and I gave it to my dad as an extra controller to have because his controller is so worn down their is barely a joystick left.",
      "rating": 4.0,
      "verified": true,
      "author": "Britney",
      "helpful_votes": 0,
      "publication_date": 20140507
    },
    {
      "title": "Works great, but needs to be cleaned. Badly.",
      "text": "The controller works fine, although the shoulder buttons feel a little too used. It just needs a good cleaning is all.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob Bob",
      "helpful_votes": 0,
      "publication_date": 20140204
    },
    {
      "title": "Works great.",
      "text": "I'm told this is the best wireless Gamecube controller available, and it definitely works well. I have two total, and they work perfectly well at the same time, so I am very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Allie K.",
      "helpful_votes": 0,
      "publication_date": 20130725
    },
    {
      "title": "No more cables. Yeah!",
      "text": "Wavebird wireless controller is the way to go. Works just as good as wired and is just as easy to set up. Would recommend to anyone tired of tripping over cables. Well worth the investment.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Stites",
      "helpful_votes": 2,
      "publication_date": 20070111
    },
    {
      "title": "Solid",
      "text": "Wonderful, solid product. It's good on batteries, but I think that might have a lot to do with the omission of rumble feedback. After playing with one for a year, I bought more.",
      "rating": 4.0,
      "verified": true,
      "author": "M(400HV) C.",
      "helpful_votes": 0,
      "publication_date": 20080317
    },
    {
      "title": "Origal and Great!",
      "text": "Got nothing to complain about. It is nice to find an original controller that works. Just glad I found one.",
      "rating": 5.0,
      "verified": true,
      "author": "Chavez14",
      "helpful_votes": 0,
      "publication_date": 20140114
    },
    {
      "title": "A++!",
      "text": "Product was exactly as described and is like new! Thank you so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Trevor",
      "helpful_votes": 0,
      "publication_date": 20170408
    },
    {
      "title": "better than the wii mote",
      "text": "After getting this controller I have asked myself again and again why did nintendo change their remotes when this remote was so awesome! im now using my wii more than ever, but for gamecube games rather than wii games. I sugest this controller to anyone that doesnt like wires and has a gamecube. I hope the wii u has a similar controller",
      "rating": 5.0,
      "verified": true,
      "author": "Nate ",
      "helpful_votes": 0,
      "publication_date": 20130426
    },
    {
      "title": "Amazing!!!",
      "text": "I really love wireless controllers, especially GameCube's. I decided to buy this because I always have to move my console and place it on my basement table whenever I'm playing with friends, and put it back in my entertainment center when I'm finished. Simple Solution, get a few more wireless controllers. Game_Genie's controller I had no problems with it and it came in a rather speedy delivery. Nothing more I could ask fore",
      "rating": 5.0,
      "verified": true,
      "author": "gamer12",
      "helpful_votes": 0,
      "publication_date": 20120627
    },
    {
      "title": "An accesorie that is rare in good condition good luck finding it",
      "text": "A nice controller for the gamecube or the wii (the one that is bacwards compatible though) get them they are worth their value now days!!! Tha bad side is they do not have feedback (they dont vibrate).",
      "rating": 5.0,
      "verified": true,
      "author": "HOMBRE LENTE",
      "helpful_votes": 0,
      "publication_date": 20130104
    },
    {
      "title": "best nintendo controller ever",
      "text": "I had a madcats controller for my Wii but for some reason it just wasn't working right. so I got on amazon and found the wavebird which I knew about and wanted since I used one when my nephew had a Gamecube. it might have been preowned but it looked and worked as if I bought it brand new and took it out of the box. if you have a Wii and are planning to get Gamecube games get this controller",
      "rating": 5.0,
      "verified": true,
      "author": "James E. Stone",
      "helpful_votes": 0,
      "publication_date": 20100228
    },
    {
      "title": "Bought for the Wii",
      "text": "After downloading \"The Legend of Zelda\" off the Wii shop, I found gameplay with the wavebird to be the perferred gameing option. Good battery life (great compared to the Wii Remotes) and 99% consistant connection lets me play from a comfortable distance from my TV. I bought another one (in platnum) for head-to-head Mario Kart battles!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Berrier",
      "helpful_votes": 0,
      "publication_date": 20070701
    },
    {
      "title": "This wireless controller works as smoothly as my cable controllers ...",
      "text": "This wireless controller works as smoothly as my cable controllers. Keep clean and the controller should work for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20141023
    },
    {
      "title": "was very happy to receive",
      "text": "Replaced a very worn controller, was very happy to receive!",
      "rating": 5.0,
      "verified": true,
      "author": "T. Woods",
      "helpful_votes": 0,
      "publication_date": 20141227
    },
    {
      "title": "Awsome Controller",
      "text": "It's perfect, not much else to say about it. No interference, no lag, fantastic distance and the batteries last a very, very long time.",
      "rating": 5.0,
      "verified": true,
      "author": "David Esposito",
      "helpful_votes": 0,
      "publication_date": 20100110
    },
    {
      "title": "amazing",
      "text": "this controller is great without all the hassle from the cable. i love it and I'm glad i got it.",
      "rating": 5.0,
      "verified": true,
      "author": "Erik",
      "helpful_votes": 0,
      "publication_date": 20140115
    },
    {
      "title": "Reliable",
      "text": "The Wavebird controller is an awesome controller to have for your gamecube or wii. Shipped fast and was also packed nicely in it's box",
      "rating": 5.0,
      "verified": true,
      "author": "GR82",
      "helpful_votes": 0,
      "publication_date": 20141230
    },
    {
      "title": "Five Stars",
      "text": "At the price I purchased this product, it may as well have been highway robbery",
      "rating": 5.0,
      "verified": true,
      "author": "Kian Faroughi",
      "helpful_votes": 0,
      "publication_date": 20141213
    },
    {
      "title": "Make more Wavebirds!",
      "text": "The Gamecube Wavebird Wireless Controller feels and functions just like the original Gamecube Controller, except that it's wireless! The wireless feature is very reliable - no loss of play control and works from a very generous distance from the receiver. The only problem with this item is that manufacturing has been discontinued even though some newer Wii games still support it.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 2,
      "publication_date": 20101209
    },
    {
      "title": "Rumble",
      "text": "if it had the rumble it would be perfect . . . . . . . . . . .",
      "rating": 4.0,
      "verified": true,
      "author": "xKillerMaverick",
      "helpful_votes": 0,
      "publication_date": 20130124
    },
    {
      "title": "Very satisfied.",
      "text": "I have no complaints at all and the controller works mint, as if i just bought it brand new. Very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Worm",
      "helpful_votes": 0,
      "publication_date": 20150228
    },
    {
      "title": "All Hail.",
      "text": "Still the greatest wireless controller ever built. Unequaled for party situations. A lovely piece of machinery. Their sole error was that they didn't make more.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul M Kent",
      "helpful_votes": 0,
      "publication_date": 20150119
    },
    {
      "title": "Great controller",
      "text": "This is definately a great controller. You can play all the way in the back of the living room with this controller. The lack of rumble is a minus, but it has great battery life in exchange. Highly reccomended.",
      "rating": 5.0,
      "verified": true,
      "author": "DL",
      "helpful_votes": 0,
      "publication_date": 20140308
    },
    {
      "title": "I was disappointed to find that I could not use these upon ...",
      "text": "First of all, I purchased used. I received 2 controllers but no receivers. This should be made clear in the description. I was disappointed to find that I could not use these upon arrival.",
      "rating": 2.0,
      "verified": true,
      "author": "WJD",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "Wonderful",
      "text": "I bought it for my daughter and now I use it when I play Medal of Honor. It's terrific, amazing. Easy to install and has a great range. You won't be disappointed! Meirelles",
      "rating": 5.0,
      "verified": true,
      "author": "A Meirelles",
      "helpful_votes": 0,
      "publication_date": 20070109
    },
    {
      "title": "Great controller",
      "text": "Helpful and compatible for Wii use and I still will keep it. Wears out battery power when used a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Hermie R Medina Jr",
      "helpful_votes": 0,
      "publication_date": 20130207
    },
    {
      "title": "Not satisfied :( Wheres my receiver for my wireless remote????",
      "text": "I got my wavebird but i was also expecting a receiver for it, I cant use it without one!!! It would of helped if you mentioned i was only buying the controll without receiver, i mean, come on!!!",
      "rating": 2.0,
      "verified": true,
      "author": "juan sanchez",
      "helpful_votes": 0,
      "publication_date": 20150602
    },
    {
      "title": "Very Good Customer Service and Good Item",
      "text": "It came ahead of time and was very clean. I tried it out and it worked perfectly. Highly recommend this seller.",
      "rating": 5.0,
      "verified": true,
      "author": "SS-220",
      "helpful_votes": 0,
      "publication_date": 20150926
    },
    {
      "title": "im sooo glad i bought it",
      "text": "For every wii game i love it if it can be played using a gc controller coz it feels so right . i was also really happy about the controller bieng wireles coz that took care of the whole problem. i tried the wavebird and it is awesome. thanks nintendo! :)",
      "rating": 5.0,
      "verified": true,
      "author": "S. Nagarajan",
      "helpful_votes": 0,
      "publication_date": 20130517
    },
    {
      "title": "great price and fast delivery",
      "text": "Great price with the receiver. A lot of other sellers did have the controller but no receiver so finding the one I did help a lot because the receiver seemed to be the hardest to find",
      "rating": 5.0,
      "verified": true,
      "author": "Louis",
      "helpful_votes": 0,
      "publication_date": 20140429
    },
    {
      "title": "Everything works fine and haven't had any issues",
      "text": "Normally expected wear was very minimal. Everything works fine and haven't had any issues. Received it quickly and had no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20160314
    },
    {
      "title": "fast shipping",
      "text": "I ordered a Wavebird with no receiver (already had one here at home) and that's exactly what I got. Controller was in excellent condition and complete. Joysticks work well, as do buttons and triggers. Was shipped promptly and got here ahead of schedule well packed.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan P. Sparks",
      "helpful_votes": 0,
      "publication_date": 20130725
    },
    {
      "title": "Great!",
      "text": "everythings included, aside from light scuff marks, no physical damage! its in great shape and batteries were even included! receiver works fine as well, it's hard to find both controller and receiver for such a good price",
      "rating": 5.0,
      "verified": true,
      "author": "Hardy Chen",
      "helpful_votes": 0,
      "publication_date": 20131028
    },
    {
      "title": "Gamecube Wavebird",
      "text": "Great wireless controller for the Gamecube. Has great range. Plays just as good as original wired controllers with the freedom of no cords. Approved by YODA.",
      "rating": 5.0,
      "verified": true,
      "author": "Joey D. Potts",
      "helpful_votes": 0,
      "publication_date": 20071225
    }
  ],
  "product_meta": {
    "title": "Gamecube Wavebird Wireless Controller - Platinum",
    "description": "Color:PlatinumEnjoy the same controls of the standard GameCube controller, minus the cords. Works from up to 30'.\n\nFROM THE MANUFACTURER\nThe Nintendo GameCube WaveBird Wireless Controller uses revolutionary RF technology that allows people to play Nintendo GameCube from anywhere in the room, without wires and without having to be directly in front of an infrared receiver. The WaveBird Wireless Controller replaces standard controllers. Up to four controllers can be used at one time. With the WaveBird Wireless Controller, you can play up to 100 hours on just two AA batteries.",
    "rating": 4.3,
    "feature_bullets": [
      "Control your favorite games from up to 20 feet away -- the RF transmitter send signals to a Receiver that plugs into your GameCube",
      "Up to 16 different channels can be set -- set up as many as four wireless controllers, for massive multiplayer action",
      "Works on 2 AA Batteries that provide up to 100 hours of gameplay for each controller (not included)",
      "Color - Platinum"
    ],
    "specifications": {
      "ASIN": "B00005BOSF",
      "Release date": "November 1, 2003",
      "Customer Reviews": "4.3 out of 5 stars317 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#8,900 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Product Dimensions": "9 x 7 x 3 inches; 12 Ounces",
      "Binding": "Video Game",
      "Item model number": "VANIN 045496950538",
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "12 ounces",
      "Manufacturer": "Nintendo",
      "Batteries": "2 AA batteries required.",
      "Date First Available": "March 8, 2005"
    },
    "categories": [
      "GameCube",
      "Accessories",
      "Legacy Systems",
      "Video Games"
    ],
    "price": 329.95
  }
}