{
  "website_summaries": [
    {
      "verdict": "The Delphi Premium Sound System is a nicely flexible portable boom box that will satisfy XM satellite radio owners with a hankering for bass.",
      "pros": [
        "The Delphi Premium Sound System offers good audio quality and a useful bass-boost function",
        "It also includes a built-in handle and can run off of battery power for full portability",
        "The speaker unit works with a nice array of XM satellite radio players and includes auxiliary line-in for use with MP3 players"
      ],
      "cons": [
        "The Premium Sound System doesn't come with its own remote, and it suffers from a bit of background hiss"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 8.0,
        "Performance": 7.0
      },
      "publication_date": 20070514,
      "rating": 7.7,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Plug it in or use batteries.",
      "text": "It is a great product, I feel lucky to have found it on Amazon. We use it continuously at home and will take it with us camping. Don’t want to miss “old time” radio on Sirius/Xm with Greg Bell!",
      "rating": 5.0,
      "verified": true,
      "author": "Wingman51",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "It works fine once you figure out the nuances",
      "text": "It works fine once you figure out the nuances. There is no ON/OFF button - if the receiver is in place it just comes on. The really strange thing about this is the electric plug. You can not tell the polarity of the plug - both prongs are the same size but the boombox will only work if you determine which one is the \"large\" prong and plug it in correctly. As a result of these two things it is not what I would consider very user friendly, however, I have kept it and will continue to use it.",
      "rating": 3.0,
      "verified": true,
      "author": "SGR",
      "helpful_votes": 2,
      "publication_date": 20150825
    },
    {
      "title": "PERFECT BOOM BOX FOR MY OLD XM!",
      "text": "Fantastic book box for my old xm radio --- I have a lifetime subscription for this radio and was looking for a way to listen without headphones and this box booms it out. Wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "Eddie38",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "Nice Sound",
      "text": "This unit has a full sound and base. I use to run my receiver on my home system until I purchased this unit. I now leave it on the counter in the kitchen. I highly recommend this unit. The one drawback is the short run time on batteries (1-2hours) at low volume.",
      "rating": 4.0,
      "verified": true,
      "author": "Dad1999",
      "helpful_votes": 0,
      "publication_date": 20080707
    },
    {
      "title": "Dishonest seller?",
      "text": "It worked less than ten uses. Now there is no sound from the speakers. Plus it wasn't sent with a power cable and I had to spend another $30 for that. My wrong for not doing better research, but I could've gotten a brand new one cheaper. Which now I'll have to do.",
      "rating": 2.0,
      "verified": true,
      "author": "Lisa Gotto",
      "helpful_votes": 0,
      "publication_date": 20131005
    },
    {
      "title": "great sound!",
      "text": "I have used this boombox for the past 3 yrs for roughly 8 hrs a day, 5 days a week, under some harsh conditions and it still plays great and sounds as good as the day I 1st played it! Rich stereo sound and strong signal reach make this satellite boombox hard to beat.",
      "rating": 5.0,
      "verified": true,
      "author": "magic44",
      "helpful_votes": 0,
      "publication_date": 20111101
    },
    {
      "title": "Bad deal for customer!",
      "text": "I'm very unhappy with the fact that' you would send a dusty dirty satelllite radio. No sense of satisfying the customer in selling a product that's worthy of the price charged.",
      "rating": 1.0,
      "verified": true,
      "author": "Eddie Haywood",
      "helpful_votes": 2,
      "publication_date": 20160927
    },
    {
      "title": "Sent it back already",
      "text": "I sent it back to you today, no hard feelings,just refund my money. Lesson learned by me , don’t buy used merchandise. I am sure you meant well. Have a great day!",
      "rating": 1.0,
      "verified": true,
      "author": "carl ostrowski",
      "helpful_votes": 0,
      "publication_date": 20201109
    },
    {
      "title": "Deep, rich sound",
      "text": "I was hesitant to buy this because of the price, but I've had it for four months and am delighted with it. It is worth the money. Fantastic sound with a bass button. I like that there is no standby light to keep me up at night, as it is by my bed. I take it with me to the kitchen, as it has a handy handle. I connect my XpressRC unit to it. Family and friends who have heard it remarked how great the sound is.",
      "rating": 5.0,
      "verified": false,
      "author": "Rollie",
      "helpful_votes": 2,
      "publication_date": 20080821
    },
    {
      "title": "great convenience, excellent product",
      "text": "excellent product. yes, hiss is present with xm broadcasting but it seems secondary to receiver and xm signal itself, since it doesn't occur with the ipod attached to AUX. most importantly IT IS NOT BAD AT ALL. the Delphi boombox is very versatile product with superb built-in antenna that picks up signal so you can almost walk around the house with live xm, and batteries of course. plenty and sometimes too much bass for the unit of this category, very nice sound, not Bose but very good. Have fun, i am thinking of getting another one.",
      "rating": 5.0,
      "verified": false,
      "author": "Marijan Jednacak",
      "helpful_votes": 0,
      "publication_date": 20080211
    },
    {
      "title": "Best Buy Yet",
      "text": "This portable boombox is awesome! I had almost purchased the same item at a higher price through XM, so happy I checked with Amazon, first. This box makes listening to XM outside so simple, before I had a regular cd player the cassette adaptor, the antenna, the power source for MyFi and the power source for the cd player, way too many wires. I couldn't believe how easy it was to plug in and listen for hours without all the wires. The reception is crystal clear and the sound is just awesome! I would recommend it to anyone who has XM radio. It has made listening by the pool a joy. :)",
      "rating": 5.0,
      "verified": false,
      "author": "GiGi",
      "helpful_votes": 2,
      "publication_date": 20080707
    },
    {
      "title": "versatile receiver",
      "text": "This handy, portable Delphi xm receiver works well, as long as the placement indoors allows the antenna to clearly face the south. Also the reception is more stable on the second floor. Once placement issues are worked out, the sound from this small box is very satisfying.",
      "rating": 4.0,
      "verified": false,
      "author": "Davis ",
      "helpful_votes": 0,
      "publication_date": 20080601
    },
    {
      "title": "Great sound for a Great Price",
      "text": "I was somewhat skeptical when I first considered purchasing this item, however, I was more than satisfied with my decision once it arrived. I use this in my office and it looks very professional yet delivers a rich digital sound. The enclosed antenna was especially good to have in order to help with my reception.",
      "rating": 5.0,
      "verified": false,
      "author": "David J. Bruns",
      "helpful_votes": 0,
      "publication_date": 20080127
    },
    {
      "title": "Great Product",
      "text": "Product exceeded expectations on every level. Sounds really good for a small set of speakers. Batteries last over 10 hours, unlike reviews I read stating the batteries would be dead after just a few hours. I am definately glad I made this purchase.",
      "rating": 5.0,
      "verified": false,
      "author": "m.a.",
      "helpful_votes": 2,
      "publication_date": 20090626
    },
    {
      "title": "nice sounds",
      "text": "nice sound and picks up the xm stations in the house without doing anything to the ant... great buy ..i was going to get another one but the price jump 40$",
      "rating": 5.0,
      "verified": false,
      "author": "agent of chaos",
      "helpful_votes": 2,
      "publication_date": 20071130
    }
  ],
  "product_meta": {
    "title": "Delphi SA10221 XM Portable Satellite Radio Boombox",
    "description": "Product Packaging:Standard PackagingThe Delphi Premium Sound System is a portable satellite radio \"\"boombox\"\" which allows you to dock your Roady XT, SKYFi3, MyFi, or Audiovox Xpress receiver (XM receiver not included). With an optional adapter, you can also dock your Pioneer Inno or Samsung Helix. The Premium Sound System has precisely-engineered integrated speakers, state-of-the-art power supply and amplifier technology, and advanced digital signal processing. In order for the system to work, you'll need a subscription to XM Satellite Radio in addition to the satellite radio receiver.",
    "rating": 3.9,
    "feature_bullets": [
      "Digital Signal Processing",
      "Maxxbass Technology",
      "Dual Tuned Ports",
      "Integrated Xm Antenna With 20-Ft Cable"
    ],
    "specifications": {
      "Product Dimensions": "17.6 x 10.2 x 9.5 inches",
      "Item Weight": "8.8 pounds",
      "Manufacturer": "Delphi Products",
      "ASIN": "B000OZA8NA",
      "Item model number": "SA10221",
      "Customer Reviews": "3.9 out of 5 stars23 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#355,556 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 14, 2004"
    },
    "categories": [
      "Portable Audio & Video",
      "Electronics",
      "Boomboxes"
    ],
    "price": ""
  }
}