{
  "website_summaries": [
    {
      "verdict": "The BD-C5500's expandable Samsung Apps platform and DLNA compatibility make it stand out from other entry-level players, although it's one of the slower players we've tested.",
      "pros": [
        "Excellent Blu-ray image quality",
        "Netflix, Vudu, YouTube, and Pandora media streaming, plus the expandable Samsung Apps platform",
        "DLNA-compliant"
      ],
      "cons": [
        "Sluggish operational speed",
        "no built-in Wi-Fi",
        "compatible Wi-Fi dongle is too expensive",
        "last year's Samsung Blu-ray players had questionable reliability"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 6.0,
        "Performance": 8.0
      },
      "publication_date": 20100514,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Look elsewhere.",
      "text": "Very finicky. I did a ton of research being an \"early\" adopter of Bluray. This player received very good reviews. From day one it was terrible with pausing a bluray disk. It would pause and resume fine so long as it didn't go to the screensaver. If you did you had to power off and back on. It also often gets stuck at the menu when first loading a disk. Again you would have to power it off to resume. It is also somewhat limited in its app capabilities. It has lately been making funny noises which interferes with quiet scenes. I have since relegated it to the sitting room and purchased an xbox one for my theater.",
      "rating": 2.0,
      "verified": true,
      "author": "dmcdlrn",
      "helpful_votes": 0,
      "publication_date": 20150330
    },
    {
      "title": "Basic functions fail on this player...",
      "text": "This is the only Samsung product I own and I'm glad for it. This player fails to play discs on a regular basis that have even the slightest minuscule smudges or dust particles. You begin to watch your movie and it just stops. You take out the disc - clean - return in to the player and the player fails to remember where you left off. This is a feature that has been part of DVD players - much less blu-ray players - for over a decade. Last Samsung product for me - if they can't get a simple blu-ray player right - what else do they mess up??",
      "rating": 1.0,
      "verified": true,
      "author": "Zapata's Ghost",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Stutters, skips, pixelates, during DVD play",
      "text": "I have used this Blu-ray player perhaps 10 times since I purchased it in 2011. The last 4-5 times I have played DVDs in it, it constantly stutters, skips, and I also get some occasional pixelation during play. I have updated the firmware once, and I will try a second firmware update. If the last update does not cure the problem, I am going to purchase a new player. Quite disapointing for a relatively simple product. The very first DVD player I have ever had any problems with, and I also have a Samsung BD C5900 that seems to work well. EDIT: Updated firmware but still stutters, skips, etc. Replaced with a new Blu-ray player. Terrible product.",
      "rating": 1.0,
      "verified": true,
      "author": "Kaorisdad",
      "helpful_votes": 0,
      "publication_date": 20130513
    },
    {
      "title": "samsung blu-ray player",
      "text": "Overall, I'm satisfied with this player. Though I do think the price could have been a little cheaper, as the blu-ray player itself is pretty basic. Pros -Good for a basic, entry level blu-ray player. Plays blu-rays well. -Works very well with Samsung TV. -Nice picture, sound, and overall quality. -Easy navigation. Cons -For some reason, the blu-ray player only seems to turn on when my samsung TV is on. Similarly, turning on the player automatically turns on the TV. -This player doesn't come with built-in wifi and wireless LAN adapter. -No HDMI cable is included. -Initial setup went ok, though the manual wasn't particularly helpful.",
      "rating": 4.0,
      "verified": true,
      "author": "Alla S.",
      "helpful_votes": 0,
      "publication_date": 20111108
    },
    {
      "title": "Samsung BD-C5500 1080p Blu-ray Disc Player",
      "text": "great blue ray dvd player at a great price. easy to set up out of the box. didn't really need instructions. hooked up to internet LAN port with a cat5 ethernet cable & everything worked great. the streaming netflix feature which requires a $7.99 subscription is a must have & the you tube feature is awesome as well. highly recommend this dvd player. had to call customer support for an issue that was related to hooking the dvd player up with my home stereo receiver & they were very helpful. liked it so much bought another for another room...............again, great product at great price",
      "rating": 5.0,
      "verified": true,
      "author": "MADMACK",
      "helpful_votes": 0,
      "publication_date": 20110522
    },
    {
      "title": "Stylish, nice operation",
      "text": "I own two and they seem to work reasonably well. I have only experienced one glitch during operation that required stopping and restarting a movie. I have been using a PS3 and I never experienced a glitch like that. I was a bit disappointed with the networking capability. It does not work with my TVersity server. It sees the files (both audio and video) but can't play any of them them. I hope that firmware updates allow for a wider range of file types. Still all in all I like the styling, small size, low power and is very quiet.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 17,
      "publication_date": 20101001
    },
    {
      "title": "Samsung Rocks",
      "text": "This entry level Blu ray player from Samsung is terrific,boots fast,usb port on the front makes my external Hard Drive fits nice and plays my favourite files be it mp3', video files,especially Matroska(MKV)gitter free, smooth. Matched with the Samsung LN32C350 LCD HDTV it's crystal clear when watching movies over dvd, flash drives either with HDMI cable or Component Video. This player makes my 720p Samsung LCD HDTV looks like am watching a 1080p Display with its onboard conversion. Awesome product from samsung.Thumbs up.****",
      "rating": 5.0,
      "verified": true,
      "author": "SayeedR",
      "helpful_votes": 0,
      "publication_date": 20110125
    },
    {
      "title": "Not the best, perhaps one of the worst?",
      "text": "Ours has never quite worked well It's a couple of years old and I have had enough of it. Complaints 1 - Takes forever to get going 2 - Lately you have to power it off and on again almost every time we put a disk in it 3 - Eject does not work at times, have to turn it off and back on to get it to work.",
      "rating": 2.0,
      "verified": true,
      "author": "SJHANKS",
      "helpful_votes": 2,
      "publication_date": 20140308
    },
    {
      "title": "Great Product!",
      "text": "The product is great. I bought it used two years ago and I love it. I use it with a wired connection to incorporate Netflix and Hulu into my viewing experience. I had connection issues at first, but was able to contact Samsung customer support and my issue was corrected within minutes. The player itself works great and the customer service experience I had through Samsung caused me to stick with Samsung products.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20140204
    },
    {
      "title": "Great quality.",
      "text": "This unit performs as advertised. The menus are easy to follow and the Blu-ray movies play with a crisp, sharp picture. Non Blu-ray movies are also greatly improved over a non Blu-ray player. It pays to purchase the wireless adapter to take advantage of the available online features built into the unit. Samsung customer service and tech support are excellent to work with should there be any questions or problems. Be sure to keep up with the latest firmware updates.",
      "rating": 5.0,
      "verified": true,
      "author": "TEB",
      "helpful_votes": 0,
      "publication_date": 20110110
    },
    {
      "title": "Refurbished Blu-Ray Player",
      "text": "I ordered this refurbished Blu-Ray from the Amazon Marketplace at a very good price. It arrived in a timely fashion but in setting it up I discovered the remote was defective. When I called Tech-for-Less they agreed with my assessment, apologized, and sent me a replacement remote. That one worked fine and I am now happy with my purchase. They were quick to solve the problem but if they just had better quality control this would not have happened.",
      "rating": 3.0,
      "verified": true,
      "author": "Fremont Williams",
      "helpful_votes": 0,
      "publication_date": 20111208
    },
    {
      "title": "Still strong!",
      "text": "I’ve had this thing for several years and it still works - great quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda R. McGuire",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "For the price I guess it is OK. It ...",
      "text": "For the price I guess it is OK. It does not play my Blu-ray disc some times. It is just not worth sending back.",
      "rating": 3.0,
      "verified": true,
      "author": "Dano",
      "helpful_votes": 0,
      "publication_date": 20160508
    },
    {
      "title": "DB-C5500",
      "text": "This is the second SAMSUNG Blu-ray disc player I've owned, and it was a little faster to load than the prior...but it is still extremely SLOW to boot up a DVD...even a regular (non-Blu-ray) disc. I have to imagine there are faster products out there.",
      "rating": 3.0,
      "verified": true,
      "author": "The Nickster",
      "helpful_votes": 2,
      "publication_date": 20140130
    },
    {
      "title": "Samsung BD-C5500",
      "text": "This Blu-ray disc player looks neat and works great! It practically installed itself. We have the HDMI connection to a wide screen HD TV set with cable box hookup. We haven't connected to the internet as of yet but are looking forward to doing so in the future. We can't wait to purchase Blu-ray discs which will no doubt look even better than the older DVDs that we've been playing. Those older discs are greatly improved on the Samsung BD-C5500.",
      "rating": 5.0,
      "verified": true,
      "author": "Mickey",
      "helpful_votes": 0,
      "publication_date": 20110414
    },
    {
      "title": "Great Picture - Temperamental Operation",
      "text": "The picture quality is excellent, and I really like the features of being able to stream video through the device. I am happy with the product for the most part. My only complaint is that it does not always operate properly. Sometimes the DVDs will get hung up (won't play, FWD, REW, stop, or allow me to get to the main menu). The only way I have found to get past this is to open and close the DVD tray, then it usually works fine. It's a bit of an inconvenience, but other than that, it seems to be a good product.",
      "rating": 4.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20110416
    },
    {
      "title": "I liked it so much I bought another",
      "text": "I bought this as a Gold Box deal for $108. So far it has been great. Streams Netflix movies without a problem and plays music via Pandora. Noticable picture improvement over my last player. Not sure about other people issues. Mine is connected to the internet and has updated with no problems. After a few weeks I was so happy I bought another. This time I was able to get it for $99 through Amazon but by a vendor. The first was bought directly from Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Dunn",
      "helpful_votes": 0,
      "publication_date": 20110401
    },
    {
      "title": "Great Blu ray player",
      "text": "I bought this blu ray player to replace a Samsung that had stopped working after 14 months. I was lucky and bought the old one with an Amex so they paid for my replacement. Suffice it to say this player has a lot more functionality for almost half the price of what I paid for the other one 18 months ago. It starts quickly and has a lot of internet connectivity. Has worked just great so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven J. Murphy",
      "helpful_votes": 2,
      "publication_date": 20100601
    },
    {
      "title": "Samsung Blu-Ray DVD Player",
      "text": "This is a great piece of machinery to accompany our new 46\" Samsung TV (from Amazon). We had only experienced inexpensive dvd players in the past and Blu-ray is something else - what a new avenue for watching movies. I purchased several Blu-ray movies (old WWII movies) and the picture and sound is truly amazing. We are not into internet TV so this DVD player is a wonderful new world for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda J. Jones",
      "helpful_votes": 0,
      "publication_date": 20110215
    },
    {
      "title": "Picky playing blu-ray discs",
      "text": "I've had this player for 3 years. (Just replaced it with a Panasonic DMP-BDT220.) It was ok with the few brand new discs that I tried with it, but I typically rent blu-rays from Redbox, and it would stutter and freeze up with about half of those. Of course, these rented discs were probably less than pristine, but most of the ones it had problems playing did not have a lot of visible scratches. I don't use most of the extra features. Just wanted a blu-ray player to play blu-ray discs, and this one failed to do that consistently.",
      "rating": 2.0,
      "verified": true,
      "author": "JRH",
      "helpful_votes": 0,
      "publication_date": 20130413
    },
    {
      "title": "love it",
      "text": "love it apps come with it, you can download more if you want, synced up with my tv no problem, havent' had a problem with it in years. do yourself a favor, if it comes with cords expect to buy some longer ones. if you need hdmi cords don't get the 6 foot ones, they are always too short, go long or go home",
      "rating": 5.0,
      "verified": true,
      "author": "bass lover",
      "helpful_votes": 0,
      "publication_date": 20140915
    },
    {
      "title": "More than I expected",
      "text": "I just received my player so I may edit this review later but here are my first impressions. The setup and software update were easy and intuitive. I installed samsung's pc share manager and was playing my HD video in under an hour. This is a good product. Back after using the product for 18 months. It is still working well and I'm glad I chose this model.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Clanon",
      "helpful_votes": 0,
      "publication_date": 20111112
    },
    {
      "title": "Working great so far!",
      "text": "Easy setup. Easy to use. If there are any fetaures missing I sure don't know it! Plays evrything fine. We use the Samsung wireless adapter with this to stream all the internet goodies from the Blu Ray player. This was a freebie, alnog with the wireless adapter, when we bought a Samsung UN40C5000 TV from Amazon on Feb.1, 2011. If any later issues will update review.",
      "rating": 5.0,
      "verified": true,
      "author": "SandySTC",
      "helpful_votes": 0,
      "publication_date": 20110220
    },
    {
      "title": "Good player - great price",
      "text": "Plays standard DVD media with HD upsampling so your older movies play in high definition. The speed that the player recognizes Blu-ray media is really good - players that load Blu-ray faster cost much more. The network capabilities are nothing short of fantastic and the ability to access online content for Blu-ray movies is a nice bonus. Note: you'll need a small (1GB) external USB flash drive for most online Blu-ray content.",
      "rating": 5.0,
      "verified": true,
      "author": "ARthur",
      "helpful_votes": 0,
      "publication_date": 20110218
    },
    {
      "title": "Samsung BD-C5500 so - so",
      "text": "Player slow booting up even with firmware update. Low price for player and integration with Samsung TV best part of player. Most Web apps need subscription for cost and need Wi-Fi adapter to work Samsung adapter overpriced. Other then Blu-ray start up time, picture is fine. Will upgrade this and TV at later date.",
      "rating": 4.0,
      "verified": true,
      "author": "Tjaye",
      "helpful_votes": 0,
      "publication_date": 20110520
    },
    {
      "title": "Awesome DLNA and internet streaming",
      "text": "Was looking for another dlna compatible device besides PS3 to stream video from my dlna NAS. Supports divx and mkv video. Browsing dlna was slow at first, but applied firmware update and is much quicker. Streams with no hiccups, and excellent quality. Netflix streaming works well, but only able to browse and stream items already in queue. Have yet to find a device with netflix interface as good as the Xbox 360. Pandora streaming sounds great, and is a nice, and quick setup for a party mix. Can apply firmware updates via internet. Remote supplied has large buttons and text, for those who do not use a universal remote.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Kucmierz",
      "helpful_votes": 0,
      "publication_date": 20100402
    },
    {
      "title": "Disappointing coming from Samsung",
      "text": "This product was a complete disappointment. We bought it because we trusted the Samsung name and were so pleased with our Samsung LED TV. From the very beginning this product had many \"bugs\". It would often freeze up when we tried to play a DVD or when we tried to watch movies via the internet streaming. Many times it wouldn't even read the disc. Finally after growing tired of battling the blu ray player every time we wanted to watch a movie, we returned the product.",
      "rating": 2.0,
      "verified": true,
      "author": "Flmags",
      "helpful_votes": 0,
      "publication_date": 20120129
    },
    {
      "title": "Bang for the bucks",
      "text": "I bought this blue-ray player 3 weeks back. It has worked very well. Initially, I was using the standard AVI cables and the video quality of netflix/yourtube were not that great. The quality improved after I switched to hdmi cables. I am using the ethernet cables for internet connectivity and it has worked pretty well so far. It was not able to play some DVDs I bought in India (I guess some region settings), the same DVDs play fine on my regular DVD player. But it's not a big deal for me. All in all, it was a good investment.",
      "rating": 4.0,
      "verified": true,
      "author": "Prabhakaran",
      "helpful_votes": 0,
      "publication_date": 20110427
    },
    {
      "title": "Works for me.",
      "text": "For $100 bucks, this is the best deal going. This is the second one of these players I have bought. - BluRay picture and sound are fantastic. - Netflix works great. - USB port for videos works flawlessly. I have put .avi and .mp4 files through it and am very pleased with the user interface and picture/sound quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Pod",
      "helpful_votes": 0,
      "publication_date": 20110404
    },
    {
      "title": "Very pleased",
      "text": "While looking over other reviews for this Blu-ray player, some said it loaded very slowly. I have not found that to be the case. It loads noticeably faster than the Panasonic Blu-ray player it replaced (because it would not play all BR movies - like Avatar). This is not the \"top of the line\" player, but for the price and features, I'm very pleased.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark Scott",
      "helpful_votes": 0,
      "publication_date": 20110331
    },
    {
      "title": "Good player",
      "text": "You can browse titles not in your q on this on your netflix. I needed to plug my lan cable in to get the latest update(some blu rays wouldnt play right) and now it works fine. I bought this mid may 2011 Still mad several blurays still have black bars but thats the case with every player, it does sound and look much better than SDVD.",
      "rating": 5.0,
      "verified": true,
      "author": "bugaloo",
      "helpful_votes": 0,
      "publication_date": 20110529
    },
    {
      "title": "SCAMSUNG",
      "text": "Do not buy!! Utter garbage. Stopped playing after little use. At first it wouldn't play a regular DVD and then it wouldn't play Blu-rays either. It is not even a year old. I have never had this happen to any video player I had but I had never bought a Scamsung before and will never again. Caveat emptor.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris Bish",
      "helpful_votes": 2,
      "publication_date": 20111130
    },
    {
      "title": "No complaints",
      "text": "We live in a semi-rural area that does not offer true high-speed streaming. This product was the second of this model for us, and was purchased strictly for blu-ray viewing. It was a problem free, easy setup. It was also an obviously later generation than the first as screens were different, and updates were not necessary. I would recommend this product.",
      "rating": 4.0,
      "verified": true,
      "author": "tr",
      "helpful_votes": 0,
      "publication_date": 20110219
    },
    {
      "title": "Very nice blu-ray player even though refurbished",
      "text": "We currently have an older Samsung player, and needed this newer one that can play apps like Plex and netflix from my computer wirelessly to our NEC projector. For something around $37.00 this was a great find. Samsung has tons of apps you can add to this and newer machines. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "wifeypoo",
      "helpful_votes": 0,
      "publication_date": 20130728
    },
    {
      "title": "Terrible.",
      "text": "It's been about 3 years since I purchased this blu ray player. I must say it is horrible. It has a hard time loading movies and half the time sounds like its ready to give up. It's been like that forever. I will say it has lasted 3 years but if I had to do it again I would take a different blu ray player with less of the headaches.",
      "rating": 2.0,
      "verified": true,
      "author": "Harley Micheals",
      "helpful_votes": 0,
      "publication_date": 20130407
    },
    {
      "title": "Exactly what I needed",
      "text": "I've had this player for a few weeks now and I have to say I really like it. It even integrated with my DirecTV remote! We use it primarily as a Netflix player. It couldn't behave any better. Streaming is flawless and the speed of the app is great too. Even the BD's look great. I'd recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "Bradley M",
      "helpful_votes": 0,
      "publication_date": 20110406
    },
    {
      "title": "I was sold a defect player",
      "text": "This product didnt come with a remote control. It wont even play a bluray disc even though its supposed to be a blue ray player.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "nicccccce",
      "text": "I was contemplating quite a few bluray players and with a cheap price tag. I finally bought this one not knowing it had internet capablity. I was super excited when I opened the box and saw that. I would recommend this blu ray player to anyone and everyone. I love it! Oh and for any new comers...buy your HDMI cable on amazon too because the stores like walmart and best buy try to get you to pay ridiculous prices for HDMI cables.",
      "rating": 5.0,
      "verified": true,
      "author": "melaney90",
      "helpful_votes": 0,
      "publication_date": 20110131
    },
    {
      "title": "GIVE THE OPERATIONAL MARKERS ON UNIT SOME CONTRAST.",
      "text": "A very good product. The new trend seems to be \"make the unit instructions unreadable\" on the unit itself. Bud Dixon",
      "rating": 4.0,
      "verified": true,
      "author": "bud dixon",
      "helpful_votes": 0,
      "publication_date": 20150122
    },
    {
      "title": "Very Happy",
      "text": "Unbelievable value for the samsung blueray play. I paid $45.00 and it is worth over $100.00. The item plays dvds perfect. I also was able to hook up an LAN to it and I can now access the internet with it. Works perfect, no complaints. I was skeptical at first, but item arrived looking brand new. Great value and highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff B",
      "helpful_votes": 0,
      "publication_date": 20120701
    },
    {
      "title": "Otherwise the play quality and reliability of this item are very good.",
      "text": "Often DVDs get stuck on the \"menu\" section for some reason. I then have to open and close the tray again to get the movie to start playing, or even get the DVD remote to operate the player. Otherwise the play quality and reliability of this item are very good.",
      "rating": 2.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20150425
    },
    {
      "title": "Loved it even though it was defective",
      "text": "I saw the reviews here and thought it sounded really good. It is, except on mine the video kept dropping out every few minutes. Fortunately Amazon is refunding the price and I am returning it. Thanks for that. It really has nice features though, so I may break down and get another one. It's pretty fast to load the menus and is pretty easy to operate overall.",
      "rating": 3.0,
      "verified": true,
      "author": "JimBob",
      "helpful_votes": 0,
      "publication_date": 20120411
    },
    {
      "title": "bogus -- can't resume play",
      "text": "Th performance of this unit seems to be fine. But when I pause long enough for the unit to power down, the disc will freeze. I can turn the unit back on, the on-screen display indicates that it is playing, but the image doesn't change. It stays frozen at the point where I paused it. The only fix I've found is to eject the disc, which takes me back to the beginning menu and previews. Incredibly annoying. I've never had any other dvd player with this problem.",
      "rating": 2.0,
      "verified": true,
      "author": "tasteful dude",
      "helpful_votes": 0,
      "publication_date": 20110512
    },
    {
      "title": "OK except for one flaw",
      "text": "Everything was OK except for one flaw which I consider rather glaring. It does not restart where you left off if you turn it off in the middle of a movie. You better make sure to write down the chapter and scene or you'll have to do some hunting to get back to where you left off. Hopefully, Samsung will come out with a firmware upgrade to address this issue. The only other minor issue is the amount of noise the heads make when a disc is first inserted. It's a lot noisier then my old DVD player but once the movie gets going it quiets down.",
      "rating": 3.0,
      "verified": true,
      "author": "R. E. Wise",
      "helpful_votes": 0,
      "publication_date": 20100422
    },
    {
      "title": "No cinavia crap so it's awesome",
      "text": "Was looking for a BD player that does not have all this protection garbage on it. Cinavia sucks so if you are looking for player with no Cinavia this is one of the few players that you can get.",
      "rating": 5.0,
      "verified": true,
      "author": "ReliaStream",
      "helpful_votes": 0,
      "publication_date": 20140506
    },
    {
      "title": "Developed Noise",
      "text": "Player was fine for first 6 months, then we started having problems getting a disc to load. Sometimes had to try 2 or 3 times. Now we've had the player for just over a year a it has developed a noise during playback. Basically, whenever it is spinning a disc it makes a loud grinding noise that is audible throughout the room with the tv at normal volume. Very dissatisfied with the product.",
      "rating": 1.0,
      "verified": true,
      "author": "Stinky Pete",
      "helpful_votes": 3,
      "publication_date": 20120425
    },
    {
      "title": "Great Value",
      "text": "This is an excellent Blu-Ray player for the money. You need to add a Samsung wireless USB LAN adapter to connect to a network via WiFi. The app for streaming Netflix was easy to setup and works great. You can also access shared video, music, and pictures from other computers on your network. System updates worked great over the wireless network. Some of the other Samsung apps are a little more awkward to setup and operate. Entering text via a remote control is not consistent among apps.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob G.",
      "helpful_votes": 0,
      "publication_date": 20101230
    },
    {
      "title": "Poor picture quality",
      "text": "Removed from box and connected to my Samsung HDTV using an HDMI input. I noticed during the setup that the picture was flashing intermittently. After updating the firmware, I tried playing a DVD. Picture quality was poor (not sharp and somewhat jittery). The intermittent flashes continued during DVD playback. I reconnected my old DVD HDTV 1080i player and tested with the same DVD and everything was fine. I'm writing this review and sending this Samsung DVD player back to Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Black Belt",
      "helpful_votes": 0,
      "publication_date": 20110329
    },
    {
      "title": "Great player! well done Samsung",
      "text": "Very easy to setup, I updated the firmware with no issues at all, the main interface its user-friendly, the remote its OK and if you already have a Samsung TV you're all set to control both devices with one remote, the picture quality its just superb!, oh and the load times are just fine, very fast actually. I would definitely recommend this player, Samsung...you've done it again!",
      "rating": 5.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 2,
      "publication_date": 20110301
    },
    {
      "title": "Good load times, and good Netflix",
      "text": "Have only used the Bluray and Netflix service but works great for what we have used it for. Loads a little slower than our PS3 but is alot cheaper. It has a great Netfli interface and has a great Bluray picture quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Wilson",
      "helpful_votes": 0,
      "publication_date": 20110927
    },
    {
      "title": "Wireless",
      "text": "I purchase this so i could set it up wireless. Works great, plays Netflix movies wireless no problem. Plays DVD's better than my old player. Has many other applications that can be install like wireless news sports and games.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Howard",
      "helpful_votes": 0,
      "publication_date": 20110902
    },
    {
      "title": "Good Price for a 1st Blu-ray",
      "text": "Good price for a first blu-ray. Love netflix streaming, except their selection is poor. Remote is confusing. Wish that we could stream HULU, but so far have been unable to load it on this particular model, even though it is advertised as an app. Super fast shipping and overall very satisfied with purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "maynard",
      "helpful_votes": 0,
      "publication_date": 20110203
    },
    {
      "title": "Samsung BD-C5500 Wi-Fi Connections",
      "text": "I like the sharp images of this blue-ray plus all the streaming features from the internet, like Netflix and Yahoo widgets. They are some features that I did not imagine existed. I am very impressed and glad I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Ramos",
      "helpful_votes": 3,
      "publication_date": 20100415
    },
    {
      "title": "move to Blu-ray",
      "text": "It was a snap to instal our Samsung Blu-ray player. We purchased the \"Amazon Basic High-speed HDMI Cable\" with our unit and condensed the wires in the back of our TV. With the HDMI hook-up our picture and sound is fantastic.",
      "rating": 4.0,
      "verified": true,
      "author": "William R.",
      "helpful_votes": 0,
      "publication_date": 20100731
    },
    {
      "title": "Works but slower than previous unit.",
      "text": "Good but works slower than previous version after software upgrades. Samsung should optimize their code on upgrades better. But did not brick on upgrade as some units will.",
      "rating": 4.0,
      "verified": true,
      "author": "etsrep",
      "helpful_votes": 0,
      "publication_date": 20131122
    },
    {
      "title": "Very good product",
      "text": "This Bluray player is really good. It starts up very quickly, connets to Internet, and plays my DVDs and blurays without a problem. I recommend it, and it is cheap. One more: As I have a Samsung TV it recognizes it. Great job Samsung",
      "rating": 5.0,
      "verified": true,
      "author": "Esteban Tapia Ch",
      "helpful_votes": 0,
      "publication_date": 20110517
    },
    {
      "title": "BD-C5500 Samsung BluRay Player",
      "text": "This is truly a \"plug and play\" unit. It literally took less thsn 2 minutes to plug into the wall outlet and plug in the HDMI cable to the TV. That's all thats required. It has astounding picture and clarity. This has got to be the best possible deal on a DVD/BluRay player ever!",
      "rating": 5.0,
      "verified": true,
      "author": "Dale Yarbrough",
      "helpful_votes": 0,
      "publication_date": 20110203
    },
    {
      "title": "exelent product and exelent shippeng",
      "text": "exelent product and exelent shippeng good very good buys exelent product and exelent shippeng good very good buys exelent product and exelent shippeng good very good buys",
      "rating": 5.0,
      "verified": true,
      "author": "lester",
      "helpful_votes": 0,
      "publication_date": 20130308
    },
    {
      "title": "I don't have it.",
      "text": "It is gone, along with my ex. A small price to pay to live free and be happy. It was a good Blu-Ray player, kinda miss it (The Blu-Ray) but have since bought a different BR model.",
      "rating": 5.0,
      "verified": true,
      "author": "flag1aa",
      "helpful_votes": 0,
      "publication_date": 20130410
    },
    {
      "title": "LOVE THIS!",
      "text": "I love this product! I love the picture quality and because I got the thumbdrive? I'm able to get Netflex and other products on it. I signed up for Pandora and Blockbuster. It's simple to use and looks good.",
      "rating": 5.0,
      "verified": true,
      "author": "c parsons",
      "helpful_votes": 3,
      "publication_date": 20110616
    },
    {
      "title": "BD-C5500",
      "text": "Great Blu-ray player for the price. I had to order the wi-fi adapter to get the Netflix streaming but once I got it, everything works great. Love the picture and upscaling of regular DVD's.",
      "rating": 5.0,
      "verified": true,
      "author": "Domer 2X",
      "helpful_votes": 0,
      "publication_date": 20110103
    },
    {
      "title": "Works great",
      "text": "Plays all my disks, works great, so happy to find it on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20150530
    },
    {
      "title": "Great DVD player",
      "text": "I'm really happy with this player. The upscaling feature makes my old DVD's look like Blu-Rays. The price was right as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris C",
      "helpful_votes": 0,
      "publication_date": 20121207
    },
    {
      "title": "works great!",
      "text": "This Blu Ray came as bundled deal with my Samsung 46\" TV and so far it has been a great addition to my entertainment ensemble.",
      "rating": 5.0,
      "verified": true,
      "author": "DMc",
      "helpful_votes": 0,
      "publication_date": 20130530
    },
    {
      "title": "Great !",
      "text": "Samsung has certainly made TV and TV appliances an art. They work seamlessly together and make viewing easy. Now if we had only easier remote controls",
      "rating": 5.0,
      "verified": true,
      "author": "WVP",
      "helpful_votes": 0,
      "publication_date": 20111113
    },
    {
      "title": "Great unit for the price",
      "text": "Bought this a month ago as a secondary bedroom blu-ray and it works great. Much faster than my older Samsung unit. Netflix downloads faster and is clearer for some reason even though software has been updated on older model. Did have to update software on this one out of the box upon setup but did not take to long. Amazon had the best price and I received quickly. Would highly recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul M. Kelly",
      "helpful_votes": 0,
      "publication_date": 20110214
    },
    {
      "title": "Could be better",
      "text": "It is good as a BLU RAY/DVD player, the only bad thing about it is that when you connect external HD to play files it can't read such files like m2ts( very comom on internet). there could also be a time bar skip or a fast forward going \"faster\" so that if we wanted to start seeing a movie in the middle of it it woudnt take so long. Price is good, design not no much.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Pioli",
      "helpful_votes": 0,
      "publication_date": 20100502
    },
    {
      "title": "Excellent product",
      "text": "Works very well and no problems, arrived in very excellent condition and works without any problems, would recommend it people I know",
      "rating": 5.0,
      "verified": true,
      "author": "Gordon A Hill",
      "helpful_votes": 0,
      "publication_date": 20130730
    },
    {
      "title": "Very pleased!",
      "text": "Arriving in only 2 days, we were able to hook it up and watch regular DVDs AND Blu-Ray discs immediately. It took awhile to figure out the remote, but we did and are very happy with this purchase. Next up - a HDTV to make it all the better! Great product at an even better price. Thanks, Amazon!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Craig M. Heinze",
      "helpful_votes": 0,
      "publication_date": 20110317
    },
    {
      "title": "great for basic blu-ray",
      "text": "I bought this specifically so that I would be able to stream Netflix. Its a pretty good Blu-ray player and streams video really well. Great value.",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda CW",
      "helpful_votes": 2,
      "publication_date": 20110207
    },
    {
      "title": "samsung scanner",
      "text": "Very easy to install, could come with user guide, but pretty basic to set up and use. Disk holder seems a little flimsy, maybe not recommened with young children to use. Great picture, sound and features. Bought to streamline movies and netflex. Not dissaponted.",
      "rating": 5.0,
      "verified": true,
      "author": "Cutter",
      "helpful_votes": 0,
      "publication_date": 20110325
    },
    {
      "title": "Great Player",
      "text": "This player arrived in a timely fashion. Works best with a Samsung LCD. The remote already recognizes the commands on the TV, so you can use the blu-ray remote to control TV too.",
      "rating": 4.0,
      "verified": true,
      "author": "Abby R.",
      "helpful_votes": 0,
      "publication_date": 20110111
    },
    {
      "title": "Great Network Blu Ray player!",
      "text": "I bought this mainly to receive Netflix movies, but it is a great player for Blu Ray as well as standard definbition DVDs. It is mated with a 50\" Samsung plasma and I am very happy with both products.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert G. Oldroyd",
      "helpful_votes": 0,
      "publication_date": 20100517
    },
    {
      "title": "Really Expensive Paperweight",
      "text": "Playing DVDs both Blu-ray and standard definition is slow and non-responsive. A few times I've had to restart the player to get it to play. The streaming Netflix works maybe 50% of the time. I can stream Netflix via Mac Mini, Wii, and Roku player. None of these seem to be giving me any problems, so I do not think it is a network issue (or speed issue) on my end or a Netflix issue. FYI: My Blu-ray player is wired directly to my router and player has received the latest updates. I would not recommend this product. Update: Decided to box it up and return it. Above symptoms have gotten worse.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael9602",
      "helpful_votes": 18,
      "publication_date": 20100619
    },
    {
      "title": "WORST PURCHASE EVER!",
      "text": "This is absolutely the worst piece of electronics I have ever purchased. Sure it plays blu-rays but the internet connection is pitiful. The picture quality of blu-ray is only part of the experience. The streaming media is really more of the experience these days. First, you have to buy their wifi adapter--another $40. Then it reverts back to wired internet every 5 minutes. Trying to watch a half hour show and you need to switch it back to wifi, turn it off, reboot...sometimes every two minutes. Just garbage--extremely frustrating. Spend a few extra buck and get a better machine. This one stinks!",
      "rating": 1.0,
      "verified": true,
      "author": "B. Richards",
      "helpful_votes": 0,
      "publication_date": 20110830
    },
    {
      "title": "Plays up to 1920x1080 MKV, XVID, DIVX etc.",
      "text": "Plays up to 1920x1080 MKV, XVID, DIVX etc videos. Fantastic unit - plays almost any video, music or pictures streamed from any network computer - hook up a NTFS (up to 2TB size) usb hard drive to the bluray's usb port and play almost any video, music or pictures stored on the hard drive. Plus it even plays BluRay discs!",
      "rating": 5.0,
      "verified": true,
      "author": "NobleMD",
      "helpful_votes": 2,
      "publication_date": 20100712
    },
    {
      "title": "Slow but dependable.",
      "text": "Makes things look just as good as any other Blu-Ray player, but it is on the slow side. I don't really care if it takes longer to load, it's a good value.",
      "rating": 4.0,
      "verified": true,
      "author": "Brett",
      "helpful_votes": 0,
      "publication_date": 20121105
    },
    {
      "title": "You will not find a better Bluray play for this price!!",
      "text": "This player does it all. I can hook my external drive to it and play movies all day long. Live streaming wiht WIFI adapter.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryce Walker",
      "helpful_votes": 0,
      "publication_date": 20110404
    },
    {
      "title": "Great little Blu-Ray player",
      "text": "Pros: Easy setup and installation; great pictures on HD LED TV; great remove (can also control HDTV); One quirky issues (please read Cons section); Takes very little space. Cons: Movie lags at times during playtime; No WiFi to connect network. Comments: Overall, it's a great little BD player. Lots of basic controls (no need of useless extra functions). Love this BD player. It took very little space in my entertainment center.",
      "rating": 4.0,
      "verified": true,
      "author": "Platini",
      "helpful_votes": 0,
      "publication_date": 20100731
    },
    {
      "title": "LOVE IT!!!",
      "text": "Everything works great! Just need to fine tune the file sharing on my network. I would recommend this item. BAM",
      "rating": 5.0,
      "verified": true,
      "author": "Jarrod",
      "helpful_votes": 0,
      "publication_date": 20130722
    },
    {
      "title": "It rocks for the price",
      "text": "It does the job, plays Blue-rays, Netflix, Youtube and it works with our old 1080i Phillips HDTV. For now that all we need.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20110111
    },
    {
      "title": "absolutly thrilled",
      "text": "This is a wonderful player, does everything i expected and more. If you pair it with a Samsung tv with the BD feature it basically set its self up when you connect via HDMI. The unit streams very well, I can only assume the people that complain it does not have spotty internet connections. Buy this item with complete confidence!!",
      "rating": 5.0,
      "verified": true,
      "author": "karen",
      "helpful_votes": 0,
      "publication_date": 20110523
    },
    {
      "title": "Inexpensive BR-DVD Supports DLNA",
      "text": "I bought this primarily to get NetFlix streaming and to try out the new DLNA in-home streaming features. DLNA is only as good as your server, but this device works well with DLNA. To date, Samsung has not permitted HuluPlus to stream to this device which is a bit of a drag, but I use that on my Apple devices.",
      "rating": 4.0,
      "verified": true,
      "author": "Timothy Sales",
      "helpful_votes": 3,
      "publication_date": 20101018
    },
    {
      "title": "Samsung does it well",
      "text": "The unit plays reg dvd beautifully but haven't tried Bluray yet. MLB widget has too many stoppages & freeze ups. May not be units fault as I also have some of those streaming problems using my computer. All said it is very convient to hit a few buttons & have my NYY game on with YES in New Hampshire my new home state.The rest of the widgets that I have tried work well.",
      "rating": 4.0,
      "verified": true,
      "author": "Ron Christie",
      "helpful_votes": 0,
      "publication_date": 20110523
    },
    {
      "title": "Samsung blu ray player BDC5500 1080p",
      "text": "Awesome picture with my Samsung HD television. Recommend a very good HDMI cable-makes the world of difference; worth the $65.00 spent.",
      "rating": 5.0,
      "verified": true,
      "author": "JKBR",
      "helpful_votes": 0,
      "publication_date": 20120229
    },
    {
      "title": "Blu Ray Player",
      "text": "I love this product! Easy to install and use. Picture quality is great and we were able to set up Netflix on it right away. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen R Legere",
      "helpful_votes": 0,
      "publication_date": 20110426
    },
    {
      "title": "Just what you need for bluray",
      "text": "Like most of the reviews I have read it is great! It does everything you need it to do and does just what it says it will do. If you have a Samsung TV with the extra link feature you will not be disappointed, I'm not. Thanks Amazon and Amazon merchants for a good deal and fast delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "W. JENSEN",
      "helpful_votes": 0,
      "publication_date": 20100602
    },
    {
      "title": "samsung dvd player",
      "text": "This player allows me to surf the web, use apps, and also plays blueray disks. It additionally plays videos directly from my flash drive. Amazing DVD player",
      "rating": 4.0,
      "verified": true,
      "author": "mando",
      "helpful_votes": 0,
      "publication_date": 20140203
    },
    {
      "title": "Works easy with Samsung TV",
      "text": "Installation was great. worked find out of the box with Netflix. Hardest thing was running the internet cable. BlueRay movies are unbelievable.",
      "rating": 4.0,
      "verified": true,
      "author": "Steven E. Sund",
      "helpful_votes": 0,
      "publication_date": 20101208
    },
    {
      "title": "Samsun 1080, Blu-ray Disc Player",
      "text": "It is Samsung. How could it not be perfect? I love it. We plugged it in, put in a disc and it has been playing for almost a year now. I bought it and a Samsung TV last January as a Christmas gift to myself. No regrets.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Alligood",
      "helpful_votes": 0,
      "publication_date": 20121224
    },
    {
      "title": "Excellent Product",
      "text": "Samsung just makes excellent products. Own several TVs and this DVD Blu-Ray. Also own BDC6800 with builtin WiFi. Both work great. Bascically the same features except for the WiFi. Would definitely buy Samsung Blu-ray DVD players again. Purchased from two from Amazon. One for myself and one for my daughter.",
      "rating": 5.0,
      "verified": true,
      "author": "Poppy",
      "helpful_votes": 0,
      "publication_date": 20110522
    },
    {
      "title": "Freezes When Watching Brand New DVD's and Blu Rays",
      "text": "I bought this Blu Ray player last November. It has always had problems freezing while watching a movie, even if the disc is clean or brand new. This problem has steadily gotten worse over the last year. After the latest firmware upgrade the picture would not only freeze, but would also scramble the picture.",
      "rating": 2.0,
      "verified": true,
      "author": "bird",
      "helpful_votes": 0,
      "publication_date": 20110917
    },
    {
      "title": "Great Player",
      "text": "I have been using it for about two weeks now. I was nervous reading all the reviews but now I can not understand what the noise was about!! It plays all my Blue Ray and DVDs perfectly. Netflix is awesome and so is Pandora! Of course it does not come with an HDMI cable (its like $5 on eBay) or the wireless dongle, but it never claimed that it does. Great player at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Big Buyer",
      "helpful_votes": 0,
      "publication_date": 20100726
    },
    {
      "title": "What the heck",
      "text": "Several Blu Ray DVD's would freeze the entire system. The only solution was to turn the thing off and then eject the disk and watch it elsewhere. I have had it since October 2010 and the problem has persisted with such regularity that I am going to buy something to replace it. DON'T Buy it!",
      "rating": 1.0,
      "verified": true,
      "author": "fitz73",
      "helpful_votes": 0,
      "publication_date": 20110329
    },
    {
      "title": "Great BluRay DVD Player by Samsung!",
      "text": "I have been using this BluRay DVD Player by Samsung for over 6 years. Its been very good and held up great!",
      "rating": 5.0,
      "verified": true,
      "author": "starfox",
      "helpful_votes": 0,
      "publication_date": 20140407
    },
    {
      "title": "Samsung DVD player",
      "text": "This blu-ray DVD player works great. I have yet to try the added features such as Internet streaming etc. But as far as DVD picture quality, I have no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Linderman Curtis",
      "helpful_votes": 0,
      "publication_date": 20110926
    },
    {
      "title": "First DVD",
      "text": "This is my first DVD. With this DVD, I purchased, an Intellinet LAN wireless & HDMI cable. Our daughter helped my wife I hook the components up & get the player on our wireless system. We have enjoyed Netflix & Pandora. A wonderful hook-up.",
      "rating": 5.0,
      "verified": true,
      "author": "oildriller",
      "helpful_votes": 0,
      "publication_date": 20110303
    },
    {
      "title": "No FF/Rew or Pause option for shared network streaming video files!",
      "text": "This is a good BD player in general, but one of the main reasons for the purchase was for playback of shared video files on my network. They play fine, but you don't have an option to FF/Rew or Pause these files during playback. My other Samsung player does this without an issue. In contacting Samsung, they confirmed this is not an option on this model and offered no explaination or solution in sight. If this function is not an issue for you, then go for it. Otherwise, look for another purchase option. I'm waiting to hear back from Vanns to see if they will take it back in exchange for another model...",
      "rating": 1.0,
      "verified": true,
      "author": "Jason B.",
      "helpful_votes": 6,
      "publication_date": 20100831
    },
    {
      "title": "Good price",
      "text": "Very good product and at a good price. Initially had problems trying to run a couple of discs but once I downloaded the updates everything was ok.",
      "rating": 4.0,
      "verified": true,
      "author": "Jaime Nunez",
      "helpful_votes": 0,
      "publication_date": 20101123
    },
    {
      "title": "Very Satisfied!!",
      "text": "Good quaility blue ray player, easy setup and automiatically updates when connected to the internet.",
      "rating": 5.0,
      "verified": true,
      "author": "msong",
      "helpful_votes": 15,
      "publication_date": 20100913
    }
  ],
  "product_meta": {
    "title": "Samsung BD-C5500 1080p Blu-ray Disc Player",
    "description": "The Samsung BD-C5500 Blu-ray Player offers Internet at TV, which delivers the best of the web, straight to your HDTV with downloadable widgets and apps such as Blockbuster, Facebook, YouTube, Twitter, Flickr, Pandora and more. You can shop online, share pictures, catch up with friends and connect to a wide range of streaming digital content at the touch of a button. The Samsung Blu-ray DVD player BD-C5500, refurbished is also wireless LAN-ready (wireless LAN adapter not included). Add to that AllShare, which enables content to be seamlessly streamed between DLNA devices, allowing you to play files stored on your PC.\n\nFROM THE MANUFACTURER\n \n\nThe Samsung BD-C5500 Blu-ray Player offers Internet@TV, which delivers the best of the web, straight to your HDTV, with downloadable widgets and apps like BLOCKBUSTER, Facebook, YouTube, Twitter, Flickr, Pandora and more. You can shop online, share pictures, catch up with friends and connect to a wide range of streaming digital content at the touch of a button. It is also wireless LAN ready (wireless LAN adaptor not included). Add to that AllShare, which enables content to be seamlessly streamed between DLNA devices, allowing you to play files stored on your PC through your Blu-ray player.\n\n\nKEY FEATURES\n * Internet@TV: Connect to an ever-expanding portal of your favorite digital content. Customizable widgets give you access to BLOCKBUSTER, Facebook, YouTube, Flickr, and more – all on your HDTV.\n * BD-Live ready: Get more out of a Blu-ray Disc than what's on it. BD-Live 2.0 lets studios future-proof their Blu-ray titles, so they can add content to BD-Live Ready discs even after they have been shipped. Simply connect your Blu-ray player to the Internet (through the included Ethernet port or using an optional Link Stick USB wireless dongle) to download images, subtitles and more. Text-chat with friends during a movie, or play against others in online trivia games to unlock exclusive video content and earn discounts on other products.\n * AllShare: Sync up your entire household. A wired or wireless DLNA connection lets you stream your PC audio and video files to your HDTV using your remote.\n * Wireless LAN-ready (Wireless LAN adaptor not included)\n * Screen fit, ultra fast play\n * Full 1080p Picture Quality\n * Sleek, slim design (39mm)\n * Universal remote control included\n   \n\nConnections\n\n\n * 1 HDMI\n * 2 USB\n\nAudio\n * Advanced HD audio (Dolby Digital TruHD, DTS-HD Master Audio)\n * 2 channel audio out",
    "rating": 3.9,
    "feature_bullets": [
      "Full HD picture quality (1080p),Power AC 120 V",
      "WiFi Ready(Wireless LAN Adapter not included)",
      "Internet at TV",
      "AllShare , Full HD 1080p and 1080p up-conversion",
      "BD-Live (Profile 2.0)"
    ],
    "specifications": {
      "Brand Name": "Samsung",
      "Item Weight": "3.53 pounds",
      "Product Dimensions": "8.07 x 17.05 x 1.69 inches",
      "Item model number": "BD-C5500",
      "Is Discontinued By Manufacturer": "No",
      "ASIN": "B000B60H0G",
      "Customer Reviews": "3.9 out of 5 stars405 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#176,918 in Electronics",
      "Date First Available": "February 9, 2010"
    },
    "categories": [
      "Television & Video",
      "Electronics",
      "Blu-ray Players",
      "Blu-ray Players & Recorders"
    ],
    "price": ""
  }
}