{
  "website_summaries": [
    {
      "verdict": "These bypass loppers have been popular with gardeners and landscapers for decades, and we love the ease of use and the good balance during heavy-duty trimming or pruning jobs.",
      "pros": [
        "Handles soft limbs up to 2 1/2 inches in diameter",
        "Handle length is good for thick growth",
        "Requires minimal arm strength",
        "Low-friction coating resists sap and debris buildup"
      ],
      "cons": [
        "Handle can break on larger limbs",
        "Blades dull quickly",
        "Some complaints of premature rusting"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Broke Day #1",
      "text": "Day 1 using these and they snapped like a cheap child's toy. Totally unacceptable and not what I believed this brand to be. I was trimming fruit tree branches no larger than 1\" in diameter, did not expect the handle to break and mash my hands together. Could be a one off faulty made but beware, I see others have had issues with these breaking as well.",
      "rating": 1.0,
      "verified": true,
      "author": "Tom Snyder",
      "helpful_votes": 39,
      "publication_date": 20190318
    },
    {
      "title": "Soft metal",
      "text": "These loppers were of a solid weight and did a good job of biting through small diameter branches. Unfortunately , with their first use, and after just a few hours of branch trimming, I found the blade has already lost its edge.",
      "rating": 1.0,
      "verified": true,
      "author": "Erik",
      "helpful_votes": 14,
      "publication_date": 20180806
    },
    {
      "title": "Fiskars Bypass Lopper is perfect!",
      "text": "My cheap loppers had gone dull, and because I'm a senior citizen living in the woods, I have to have something that will do the job without lots of effort. I know Fiskars as a quality brand, so I read many reviews before choosing this model 9146 and I am thrilled with my choice. Many models apparently have a wide handle spread; this model is absolutely perfect. A lightweight unit with perfect handle spread so I can get underneath those pesky box elder growths with ease. These don't have the fancing gearing, but they don't need it. For anyone wanting a lightweight power cutter, this is the one!",
      "rating": 5.0,
      "verified": true,
      "author": "L. J. Snider",
      "helpful_votes": 96,
      "publication_date": 20120826
    },
    {
      "title": "one of the blades broke off--a very clear stress fracture due to poor casting.",
      "text": "There is a manufacturing defect in the one I got. The first time I used them, one of the blades broke off--a very clear stress fracture due to poor casting.",
      "rating": 1.0,
      "verified": true,
      "author": "Blossom",
      "helpful_votes": 19,
      "publication_date": 20161017
    },
    {
      "title": "I had been using it for a while, and ...",
      "text": "I had been using it for a while, and then I went to cut a branch of a bush, and the handle bent. It's made from hollow aluminum, which doesn't allow for strong bushes.",
      "rating": 1.0,
      "verified": true,
      "author": "Rob Lewis",
      "helpful_votes": 11,
      "publication_date": 20180619
    },
    {
      "title": "BEST Loppers ever owned!",
      "text": "These helped me cut off enough branches from a limb that fell out of my maple tree onto my driveway, that I could pull it completely out of the way. I'm a retired, 117 pound, 68 year old lady (who relies on my daughter and son-in-law, who live out of town, to help with things). But these Loppers work SO much better than the old wood handled ones I used to use. I've even cut down huge crepe myrtle bushes with them as easy as can be!",
      "rating": 5.0,
      "verified": true,
      "author": "Nah Nah",
      "helpful_votes": 2,
      "publication_date": 20200504
    },
    {
      "title": "I put this lopper to the test. 1 1/2in? Broke cutting 1 1/4 branch! Didn't make it through day 13!",
      "text": "I took on a tree using only a hand saw and this lopper. I made a verified purchase through Amazon and this Lopper worked well initially but had a hum when cutting anything, a lil WD40 and that went away completely. This Lopper did well and thought I made a great purchase but today one of the arms fractured cutting a 1 1/4 in branch! Arrived on September 15, didn't make it to the end of September 28. RIP. Lifetime Warranty? I will put it to the test but I think I'd rather pay the difference for a higher end one due to the dismal failure of this good cutter.",
      "rating": 3.0,
      "verified": true,
      "author": "John S",
      "helpful_votes": 8,
      "publication_date": 20170928
    },
    {
      "title": "didn't realize the difference",
      "text": "Bought these loppers to replace an well-used older pair of fiskars that had slipped out of joint. these will probably do for most of my purposes. However had I been aware of the difference, I would have bought the Fiskars 91326964J Power-Lever 28-Inch Bypass Lopperlike the older pair. They had been left in the house by the previous owner and came in handy trimming trees downed by several storms. They were the excellent pair that I based my choice on. I didn't know that fiskars loppers were not all the same!",
      "rating": 4.0,
      "verified": true,
      "author": "Donna A.",
      "helpful_votes": 2,
      "publication_date": 20180926
    },
    {
      "title": "Quality is lacking from Fiskars",
      "text": "Would be nice if it were not so stiff and hard to operate. Fiskars usually has quality products (when they manufactured in USA) since their have moved to CHINA the quality has dropped drastically. Have purchased Fiskars for years and very satisfied until the last few years. I will no longer purchase their products. I don’t mind paying the higher price for quality, but that is no longer the case. Really ashame.",
      "rating": 2.0,
      "verified": true,
      "author": "Faith of Mustard Seed",
      "helpful_votes": 4,
      "publication_date": 20180424
    },
    {
      "title": "Ah No, It's Not Fabulous",
      "text": "It certainly looks wonderfully prepared to slice and cut. It's not that heavy, but to use it over your head, it's sluggish and a bit hard to open to slice, and it doesn't slice enthusiastically, smoothly or easily. I would have returned it except for the shape and having tossed the box it came in. Spend some more and hunt for an efficient tool.",
      "rating": 1.0,
      "verified": true,
      "author": "madeleine gallay",
      "helpful_votes": 2,
      "publication_date": 20190511
    },
    {
      "title": "So glad I got these..",
      "text": "I received these & immediately went out back to clear the fence line. They are so smooth & sharp, I had the whole fence line plus a small tree trimmed in less than half an hour. These things cut through green branches like butter! They also stop with plenty of room for both of my hands between the handles- no pinched fingers, no matter how hard I closed them. I even used these to cut through branches quite a bit larger than it says they’ll do. They feel very sturdy, yet not heavy. See photos for what 25 mins with these bad boys will get you. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Raewyn",
      "helpful_votes": 2,
      "publication_date": 20180408
    },
    {
      "title": "Good product, great company/warranty",
      "text": "Worked great to cut through overgrown tree that had about 1\" branches. Fiskars doesn't necessarily have the toughest/highest quality products out there, but they have a top notch warranty. I buy their products since they have such a great warranty and customer service that I don't need the need to spend more on other brands. I know if I break the tool they'll cover it no questions asked. Fill out the claim and send a picture with it.. good to go!",
      "rating": 4.0,
      "verified": true,
      "author": "Chris ",
      "helpful_votes": 3,
      "publication_date": 20171111
    },
    {
      "title": "Easy to use and cut smoothly",
      "text": "This one looks so different from the one I had - very simple looking and simply to use. As soon as I received it, I took it out and tried cutting some branches off. It works so well and it cuts smoothly. Love it! I am over 80 years old and if it is easy for me, it should be to all ages!",
      "rating": 5.0,
      "verified": true,
      "author": "mo",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "These are amazing! I was debating between getting a much more ...",
      "text": "These are amazing! I was debating between getting a much more expensive electric or even gator lopper, vs these. We have lots of bamboo from our neighbor's property creeping onto ours, among other reasons I needed these. Some of these bamboo are 2\" in diameter or wider. I was worried this lopper would not be powerful enough to cut them, but it was more than adequate. It took me just a few seconds to quickly cut through the overgrowing bamboo. The length of the handles is great for providing strong leverage. I really didn't have to apply that much force. Overall, am happy with this purchase and quality of product.",
      "rating": 5.0,
      "verified": true,
      "author": "Rahul",
      "helpful_votes": 2,
      "publication_date": 20170718
    },
    {
      "title": "Well Made and Really Easy to Use",
      "text": "although I don’t buy many tools these days I got a ridiculous quote to do some branch trimming and so decided to do it myself - this bypass lopper fit the bill perfectly. It performed exactly as described and as I’d hoped. With a bit of effort but nothing outrageous - I’m 54 and in pretty good shape - I was able to get the vast majority of branches trimmed in 2 afternoons - and the photo shows their condition after these two uses. I trimmed 14 trees in total so far.",
      "rating": 5.0,
      "verified": true,
      "author": "OYGVALT",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "CUTS LIKE BUTTER!!! Must buy!!!",
      "text": "Cut a 6ft tall and about 4ft wide rose bush within minutes! Some limbs were an 1 1/2 inches wide! They literally cut like \"Butter\" I just had to do the action of cutting the branches, these Clippers did the rest! Never seen nothing like it before! I'm ecstatic BEST BUY EVER!!! as for the price \"WOW\" overall incredible. Thanks so much will definitely buy more tools of this brand",
      "rating": 5.0,
      "verified": true,
      "author": "Melynda",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Cut well, Made well",
      "text": "I picked these loppers because they were supposed to cut bigger branches than most. They do and they are built nice and strong. Arms are long too which is often handy when trimming trees.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul W.",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Light weight and comfortable",
      "text": "I am very pleased with this lopper. It is light weight and works great. Very sharp and cuts really good. Have used several times now on some thick limbs of a big hedge I have and cut great. I am getting older and have found a lot of yard tools are too heavy for me to use but these are Perfect. I am very happy with these and would buy again. Definitely would recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "cc",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "no quality",
      "text": "Very low quality of blade, no heat treatment. See blade after 1 hour light work. This is my first negative review in Amazon. Victor",
      "rating": 1.0,
      "verified": true,
      "author": "Viktor Bannov",
      "helpful_votes": 6,
      "publication_date": 20181110
    },
    {
      "title": "These are great for moderate-level yard work",
      "text": "These are great for moderate-level yard work. They're long enough to reach under and through things to cut back vines, for example. I've also been able to cut down unwanted saplings with them. The rubberized handles make this easy to hold onto and to \"steer.\" The thin design means you can snake them through trees and cut back invading vines (something I frequently use these for). My main complaint is that they're heavy enough that I have to limit my use.",
      "rating": 4.0,
      "verified": true,
      "author": "Simone",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Sliced through like butter",
      "text": "Worked well for cutting the little skinny trees around our property. I believe I was able to cut tree/plant branches and bark up to about the thickness of 3 fingers put together side by side with absolutely no problem. This 28 inch Fiskars is not for huge projects. It did what it was supposed to do. The first maybe 30 to 40 branches I cut sliced up like butter. As the day went on it didn’t slice as easily, but it still worked well.",
      "rating": 4.0,
      "verified": true,
      "author": "MOM OF  3Top Contributor: Baking",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Great price - Solid construction - Works great!",
      "text": "All the loppers I looked at - expensive and economically priced - always had a certain percentage of poor reviews, so I was somewhat apprehensive about how this purchase would work out. But I was super pleased when I opened the box and saw a well-made pair of loppers - and even happier when I put them to work. As billed they slice through branches - thin and thick - with ease. This was a huge relief as I'd let a number of bushes, hedges to get out of control over the last couple of years. Glad I didn't buy the more expensive options. Great buy for the money! Strongly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "GuauGuau",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Perfect Lopper does the Job and then some",
      "text": "This is a great all around lopper and my standard go to item when something really needs to be cut down. This does as it says and even cuts thicker branches with ease. I would recommend this product. It is made very well and definitely worth the money. I have small hands and this doesn't feel cumbersome to handle or too heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "Zen and NOW",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Cheap loppers that break easily",
      "text": "I'm reviewing this product under moderate to heavy use. The bolt freezes up and makes it impossible to use. I've loosened the bolt and it eventually tightens again. The blades don't keep a sharp edge for long. The handles bend with too much force. I have yet to find a better pair so I buy a pair of these each year expecting them to not last.",
      "rating": 1.0,
      "verified": true,
      "author": "Erik",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Very nice for the price",
      "text": "I bought these for my personal use. I think they are a great bargain and seem to be of very good quality. They do have a lifetime warranty. I have previously used Craftsman loppers and have had to get them replaced a few times. Only time will tell how these hold up, and how the warranty will work, if needed. I was impressed enough that I bought 3 more pairs for our community group to use.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Thomas",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "quality",
      "text": "I bought this while back, but I finally ended up using it to cut some branches. First, it is very super heavy. Second, after cut few branches, it already became dull. I could not believe it. The previous one was same brand, and I have had it almost forever. So, I wonder if this was one of bad product, but I could not return or replace it because it is out of allowed time.",
      "rating": 1.0,
      "verified": true,
      "author": "Kuhn",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Fiskars is the BEST",
      "text": "Fiskars truly is the best. I'm super happy with how great this pair of loppers have been. I've used it a lot for pruning this season, and it's been fantastic. I couldn't recommend these more. The lifetime warranty is also absolutely stunning. This is the best brand for gardening tools. I highly recommend this product and all of their others.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Top quality tools!",
      "text": "These are great. I think the people breaking them don't know what they're doing. I used the same pair at a cannabis grow in colorado and was sold on them then and sold on them now. I just got done clearing out some overgrowth for my inlaws and works flawlessly. We never broke a pair at the grow and this pair is holding up just as good. Fiskars makes excellent products. Their hand trimmers are perfect for trimming cannabis! These took down our harvests no problems!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "These work great!! I have had no issues and they ...",
      "text": "I have been using these loppers for a few days now. I have mostly bodark trees and some pecan and white oaks. These work great!! I have had no issues and they cut through thick branches with no issues. And trust me, I worked them. I figured if they will break (like some reviews said), I might as well break them now while I can still return them. I trimmed about 15 trees with no problems. They are strong and my trees now look great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 2,
      "publication_date": 20170710
    },
    {
      "title": "Not what I expected.",
      "text": "Read reviews etc., expected to be much lighter. Not comfortable returning items because of misunderstanding, so I gave item to family member. They agreed with me item is heavy. Read reviews before purchase as I AM SHORT AND cannot lift heavy items high to use. I originally purchased because of brand reputation. Have 12 physical therapy visits schedule this mo because of heavy shears,",
      "rating": 3.0,
      "verified": true,
      "author": "Barbara J.",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "It broke before first use",
      "text": "The first time I picked it up to use it, the cover fell off the handle before I could even cut anything. I put it back on and tried using it, but couldn't get the leverage I needed to cut thick branches without the handle falling off. I was able to cut some smaller branches, and it did well. If I can secure the handle cover back on it, I'll be very happy with it.",
      "rating": 2.0,
      "verified": true,
      "author": "Susanls67",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Best loppers I've ever purchased or used",
      "text": "Best loppers I've ever purchased or used. These bad boys helped me single handedly take down a bamboo forest that took up residence in the yard I just inherited. The stalks were over 20ft high and some nearly 2in in diameter. I am not a large human, I am a 5ft2 woman. Trust me when I say these do the job. I was able to chomp it all down alone.",
      "rating": 5.0,
      "verified": true,
      "author": "FantasticallyFrugal",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Worked out great for me",
      "text": "I'm an older female. I had a bunch of bushes to take down. I bought these about 6 weeks ago and they have worked out fantastic. Based on other reviews, I was worried they would break but I did not have any trouble at all. I was attracted to the Fiskars lifetime warranty - if they did break (or break down the line), I know Fiskars would take care of it. So I'm very pleased and do recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "A. E.",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Broke on first use",
      "text": "I purchased this for my son's birthday and the first time he used them to cut a half inch branch the metal blade buckled. I should have read the reviews more carefully.",
      "rating": 1.0,
      "verified": true,
      "author": "E. C. Tozer",
      "helpful_votes": 10,
      "publication_date": 20160423
    },
    {
      "title": "Works great cuts like a champ easy to use even my 6 year old likes it!",
      "text": "So far I really like them. They are very sharp and light weight. I like that it has rubber hand grips and the light weight feels like you can use it for a good amount of time without getting tired. Only concern I have and why I didn't give it 5 stars is I am not sure how long they will last as they do feel a little light duty.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Ideal",
      "text": "I just used these loppers yesterday for yard work and it made it so much easier! The length is ideal for reaching into shrubbery and trees to cut limbs and thin them out. Although the blades of the loppers are short they are extremely efficient. Depending on each persons upper body strength, cutting through branches or limbs that are or almost the width of the cutting edge be between difficult-definitely cannot. For $9.99 I was more than ecstatic with all of the work I was able to accomplish with them. With a step ladder, even more can be easily accomplished.",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie Trotter",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "A great name brand that is well worth it",
      "text": "My old lopper was getting worn out and dull and I needed to prune some trees (AZ mesquites - they grow like weeds) before winter. This is nice and sharp and clips 1.5 inch branches with only a little extra effort and all smaller ones are a breeze! Trust Fiskars for top notch products of all kinds!",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Sayers",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Very soft blade",
      "text": "Well built but soft blade. First test cuts on 1 inch thick limb put dents in the blade. I will just use for smaller stuff.",
      "rating": 3.0,
      "verified": true,
      "author": "P. Theo",
      "helpful_votes": 2,
      "publication_date": 20190605
    },
    {
      "title": "Bad grip design",
      "text": "I had to take a sledge hammer and round the shape of the grips because the poorly designed shape was \"knife edging\" into my fingers while using them, so its obvious that the designers never actually tried to cut anything with these. Other than that these appear very functional",
      "rating": 1.0,
      "verified": true,
      "author": "Mark H",
      "helpful_votes": 2,
      "publication_date": 20181011
    },
    {
      "title": "Fiskars are indeed worth every penny",
      "text": "Yes Fiskars Brand anything are indeed a little over priced. The question that I felt need answering was \"I's it truly worth the extra $5.00 over the no-name brand\" I believe so. I am a tight wad for sure, however we are hard on our gardening tools (We have 16 30x60 gardens) and are always willing to spend that little extra on any Fiskars brand as they truly are worth the extra cash every time. These loppers work fantastic, not necessarily used in the garden but we use them quite often with 45acres of trees and trails threw out. I would suggest these to anyone looking for a quality set of loppers.",
      "rating": 5.0,
      "verified": true,
      "author": "Family Homesteader",
      "helpful_votes": 2,
      "publication_date": 20150518
    },
    {
      "title": "Good product!!",
      "text": "Went to town using this thing-- I am very hard on yard tools and broke my last pair very quick as I am always trying to cut much thicker than the recommended levels. These held up through the entire spring and summer for me and are still going strong for next season. Cuts very nice and quick as super sharp. No hard straining like the last one. Even if they broke right now I would buy another pair for next year due to the price and endurance that I can put these through.",
      "rating": 5.0,
      "verified": true,
      "author": "DK",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Good value",
      "text": "Work well for light to medium pruning in my yard. Happy with price and performance",
      "rating": 5.0,
      "verified": true,
      "author": "CP",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Work great even on larger branches",
      "text": "These loppers/pruners work really well, they cut branches like butter. They are not that light, but not that heavy either. I think they need a little weight in order to due what they do. But they can easily cut through a 3 inch tree branch so problem. They may be able to do a 4 inch. Very nice product. My previous ones by the same company were made of some type of plastic that was supposed to last a lifetime. I broke mine but that was after about 3-4 years of good use. The new ones are not plastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Mags",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Working great so far",
      "text": "My old clippers were wore smooth out. These had good reviews, so I bought a couple of them. I am very pleased with them thus far. I cannot comment as to longevity, but I've been using them a lot and they are doing great so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa G. Kirkpatrick",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Very powerful",
      "text": "Holy crap are these powerful. I was surprised but the thickness of the branches I was getting through. I am not a very strong person but I was able to remove several bushes and saplings by myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan Byrne",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Strong and sharp!",
      "text": "As described, & they cut VERY well. I tried cutting out a big free root (it was really too big for the snips) and the snips didn’t break even though I put A LOT of force on them. They still continued to cut normal sized branches afterwards too which was really nice since I beat the trimmers up pretty badly.",
      "rating": 5.0,
      "verified": true,
      "author": "Kalyn Robbins",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Excellent product",
      "text": "These are the best loppers I've ever had. I've used 2 other brands, one is the best name in garden tools, and I think these are better. They easily cut through 1 1/2\" branches w no trouble, even oak and maple. I know that's hard to believe but it's true, I think the long handles give you more leverage.",
      "rating": 5.0,
      "verified": true,
      "author": "artistclare",
      "helpful_votes": 3,
      "publication_date": 20170317
    },
    {
      "title": "Happy so far.",
      "text": "I have only used one time cutting up a fairly large bush in order to get some of it into my garbage container each week. So I can't speak on how it holds up over time. It appears to be sturdy and well made. It was very easy for a woman to use. The Amazon price was wonderful on this item compared to the big store that starts with the letter L.",
      "rating": 5.0,
      "verified": true,
      "author": "Love Amazon",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "Exactly what I wanted",
      "text": "Exactly what I needed. I'm 4'10 and 115 lbs. I wanted to be able to trim low hanging tree branches without having to ask my husband after he works 9 hours. These are awesome. I even got some branches that are bigger than what they're meant to cut. Can't beat the price either",
      "rating": 5.0,
      "verified": true,
      "author": "Cherie Sutton",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Terrible quality, greatly satisfied with return and refund experience.",
      "text": "I would give theses loppers a 0 star review if I could but the customer service experience 5 stars. These pruners dulled and deformed within the first 2 minutes of light use. I used them to prune small branches from bushes and it was unacceptable that their wear looked more like what you would expect after a season or two from quality loppers. Because of the incredibly poor quality of these I sought to return them and it was wonderfully expedient to do so.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "It broke!",
      "text": "It was doing great until we tried it on normal sized branch and it just broke. We had used it quite a bit in the beginning of summer, but it should have lasted at least a season.",
      "rating": 2.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Definitely worth the money",
      "text": "These are awesome! We've used it to cut thick branches and even palm fronds. Wer mainly bought it to cut the thick vines off or fence but we have weeds that are growing to look like trees and we are able to cut them with just a snip. Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Danella",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Love the loppers",
      "text": "This is easy to handle, not too heavy, and sharp. Though with longer use it needs resharpening. I keep the blades clean which helps. I like the orange stripes so I can find if set down in leaves. Recommended for any gardener.",
      "rating": 5.0,
      "verified": true,
      "author": "Reading Fool",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Much heavier than my other Fiskars",
      "text": "I Have the 15inch loppers, which I love. These are way heavier which is worse in a long handled item. The handles are also thinner and that puts concentrated pressure o your hands when using. Would definitely not recommend",
      "rating": 3.0,
      "verified": true,
      "author": "Vincekg",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Good Loopers",
      "text": "Received it yesterday and started looping away! I trimmed back 2 medium sized bushes. The looper are a god solid weight and has good leverage and sharp cutting ability. Happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Na Spa",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Great quality",
      "text": "I bought these as a gift and they seem to be very good quality. They have a nice feel and the person using them says they have no complaints. I picked this brand because I have a couple other tools by them and they’ve held up great",
      "rating": 5.0,
      "verified": true,
      "author": "Dan & Nicole",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "loppers",
      "text": "This is an excellent product.Even though arthritis is a problem, these loppers are a great help in the garden, getting rid of overgrown canes in my roses, without stressing out hands and wrists.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosalie K. Doss",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Fiskar Lopper Handle Broke",
      "text": "This lopper had only been used a couple of times and probably didn't cut more than a dozen times of branches less than 1/2 inch. It appeared to be rusted on the inside. It had been stored in a cabinet in an enclosed patio.",
      "rating": 1.0,
      "verified": true,
      "author": "Joan, Eureka, CA",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Very good shears",
      "text": "Best pair of lop shears we've ever owned. When our kids were young, we couldn't keep lop shears in good condition. Now they're grown and gone, the shears are where they belong and are no longer used improperly... So these shears will last us a lifetime.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel Ricard",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Worked",
      "text": "This thing is great. I cut off all the branches from the neighbor's trees that were overhanging my fence into my yard. I can now see the fence. Then went through the yard and found remaining little stumps from previous junk bushes that would flatten my riding lawn mower's tires.",
      "rating": 5.0,
      "verified": true,
      "author": "Russ Lefebvre",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Amazing value! I had a small spring-loaded hand clipper ...",
      "text": "Amazing value! I had a small spring-loaded hand clipper with the same kind of cutting head, and it cost about the same. Surprising such a large tool can be had for $13. I thought I'd just use it for pruning larger tree branches, but I found it helped me trim flower bushes much quicker. I can reach through and cut selected wooden stems without much fuss, though on first glance it seemed it would be too large and unwieldy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonaholic",
      "helpful_votes": 0,
      "publication_date": 20170311
    },
    {
      "title": "Did The Job",
      "text": "I needed something to trim small branches from a tree growing too close to the house. Worked well and easy to use. I can’t speak for the durability as I’ve only used them once, but I’m happy so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra L",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Those branches didn't stand a chance!",
      "text": "I feel like a master gardener when I'm wielding these bad boys. That branch over there? Snip, done. Easy to use, sharp, sleek design, grippy handles. I now know why the Kardashians prefer these to the other guy. 10/10: will cut again.",
      "rating": 5.0,
      "verified": true,
      "author": "Conrad",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "I'm happy with these loppers",
      "text": "These loppers are a very good value. They arrived sharp and they worked well cutting down some pampas grass (very tough grass, almost as tough as bamboo). However, a rivet in one of the handles was not completely ground down. It didn't bother me as I was wearing leather work gloves. Quality control seems to be lacking. I've only used them once so I can't comment on long term durability. But overall I'm happy with these loppers.",
      "rating": 4.0,
      "verified": true,
      "author": "technical-engineer",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Broken only after a few times of use. broke ...",
      "text": "Broken only after a few times of use. broke at cutting blade on small root. Past return date had a few months. Bought in feb.",
      "rating": 1.0,
      "verified": true,
      "author": "Sue Fowler",
      "helpful_votes": 12,
      "publication_date": 20160515
    },
    {
      "title": "The blade edge has broken in several places",
      "text": "The blade on the Fiskars loppers I received broke in several places while I was using them. Large sections on the blade edge simply broke off with use. This product in made in China.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Love These Loppers",
      "text": "These loppers cut through 1.5inch branches with such ease. I have had mine for 10 years and they work as well as new. I recently bought another pair for my 70 year old mother to use for light yardwork. She raves about how easy they are to use, she loves them too. Definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "melissa j hulings",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Great buy",
      "text": "These pruners are awesome. They are long enough to get higher branches. They have comfortable handles which makes it easy to use during long projects. No hand cramping. Also, blades are so sharp it cuts branches that are nearly an inch thick. I had a pair like this which I somehow managed to lose. Wasn't happy about having to spend more money on something that should be in my house somewhere, but these blow the old ones away. Glad it happened. These are worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 0,
      "publication_date": 20160710
    },
    {
      "title": "Awesome clipper!!",
      "text": "I have issues with my right wrist and elbow, but have no problems cutting things with these. They are light enough for me to use, but have great cutting power. The length is perfect - not too long so I have to strain to 'aim' at what I'm cutting",
      "rating": 5.0,
      "verified": true,
      "author": "Santa Fe railfan",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Chipped",
      "text": "Loppers arrived sharp, comfortable to operate, and easy to use. The blade had a significant chip in it after an hour of use on live Honeysuckle bushes. I continued to use it with plans to smooth the blade with a grinder & file when my job was finished but then it chipped a second time. I notified Amazon and returned it for refund. I have had good luck with my other Fiskars pruning shears and cutters so I assume that I received a blade with an imperfection in it. Refund process was smooth which is the reason for the 3 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Not as good as the older model",
      "text": "Got this for my sister for Christmas - she'd borrowed mine and wanted her own so I got her a brand new one. Turns out that the brand new one is mostly plastic as opposed to the one we've had for years (purchased at Hoe Depot) that is mostly metal and feels much better in your hands than this one.",
      "rating": 3.0,
      "verified": true,
      "author": "CC Florida",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Makes trimming branches a breeze - even with both wrists having osteoarthritis",
      "text": "I've tried some other versions of this, but they required more effort to do the cutting. I trimmed branches up to 1 12\" in diameter and the cutting was a breeze. I have some arthritis in both my wrists and after completing trimming the tree, I had no pain. Very easy to use, very easy to clean, cuts smoothly and does not put pressure on the wrists.",
      "rating": 5.0,
      "verified": true,
      "author": "Debra F",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "Broke on First Use",
      "text": "I'm sure many others have had good experiences with these given the reviews, but take into account that on first use a big chunk broke directly out of one of the blades, probably the size of a penny. Was bigger than the stick I was trying to cut through, so no reason they should've failed! They feel pretty good out of the box, but ultimately I'm buying a different kind (rather than getting a replacement).",
      "rating": 1.0,
      "verified": true,
      "author": "G",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Good product, does what it says it will do",
      "text": "Does what it says and does it well. I could have gotten the same item somewhere, but that would have involved shopping around. Frankly, when the temp is >100 and I have very little time to shop, this was the best way to purchase the tool. The price point was perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "giftstore",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "I do not recommend this.",
      "text": "The second time I used these, the blade broke in half. Not at a joint. The metal broke. I do not recommend this.",
      "rating": 1.0,
      "verified": true,
      "author": "gh",
      "helpful_votes": 14,
      "publication_date": 20160506
    },
    {
      "title": "Cuts all the things",
      "text": "This loppers can cut a spindly vinr, a tree branch, and everything in between. I also found myself using them to whack through brambles to pull tangled vines away from the trees and then cut the vines one by one. I had other tools available but these were the most versatile for clearing out the smaller stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "epheme",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Great sharp loppers.",
      "text": "Got these for pruning fruit trees and shrubs. Comfortable grip and sharp so I don't feel like I have to use a lot of unnecessary effect cutting. I can go a long time with these before my arms are tired and my hands don't hurt. A great buy as the shorter loppers can hurt your hands after continued use.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Bishop",
      "helpful_votes": 2,
      "publication_date": 20170407
    },
    {
      "title": "Snip, snip, done",
      "text": "Best bypass lopper ever. Makes quick work of whatever it is you’re trimming. The only downside is my brother stole mine so I had to get a new pair ((eye roll))",
      "rating": 5.0,
      "verified": true,
      "author": "D. Giff",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Sharp and tough",
      "text": "I have owned these now a couple of years and have only sharpened them a few times. The metal is forged well and takes an edge properly. I expect many more years out of these comfortable clippers.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "GOOD VALUE ITEM WELL MADE",
      "text": "I found these to be very well made and still they were lightweight. No problems with them. they look as good as higher priced ones. I have bought cheap ones and 65 dollar ones. All are not that much different. Good value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Ralph  Wentworth",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Ok tool.  Blades prone to chipping",
      "text": "Works well enough. But metal material used seems to be fairly weak. Already has chips in the blades from normal pruning use. Kind of disappointed",
      "rating": 3.0,
      "verified": true,
      "author": "MikeyArgie",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Blade has rolls and chips after one light use",
      "text": "I would give this zero stars if I could. I used it on small twigs and such and the cutting edge has chips and rolls in the metal. Do not buy this even for super light stuff. I own a lot of fiskars equipment and this is major let down.",
      "rating": 1.0,
      "verified": true,
      "author": "Mighty Mowers LLC",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "sharp when you get them, but dull quickly",
      "text": "I used this to trip some bushes which were within the cutting parameters listed for this lopper. At first, it worked great. After a month of using, though, it does not easily cut the branches it is supposed to be able to. I will need to have it sharpened to work....and I only use this on bushes around my house.",
      "rating": 3.0,
      "verified": true,
      "author": "Tmuadib",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "good buy",
      "text": "Nice and sharp. Handles were a little longer and tool heavier than expected which made it awkward to maneuver into plants to cut branches off but it works. Length did let me cut things way higher than me since I'm short",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Great buy!",
      "text": "I am able to cut through 3 inch diameter vines with little to no effort. They are one of the higher quantities set that I can find for a reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy DiFrancesco",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Great!",
      "text": "They worked very well. I purchased them to trim down some of the trees in my front and backyard, and they made the cuts very easily. The previous pair I had were awful compared to these, and I didn’t realize it until I used this one. Overall, very happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Emm zee",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "They do the job.",
      "text": "The tool is light in weight but seems quite sturdy. I cut oak and hickory saplings, all under one inch in diameter but tough. It worked fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Beau Tramp",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Quality is not there",
      "text": "A handle broke on the first use of this product. This company used to make high quality products, but based on this one, quality is no longer there.",
      "rating": 1.0,
      "verified": true,
      "author": "Merry Reader",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Adds a bit bigger bite to your limb chopping",
      "text": "Older guy, could use come extra help with chopping limbs. This does the job great! I carry my regular high-quality lopper along, and only use this for the thick stuff, as it does require a wide-swing with the handles so doesn't fit into some situations. This one cuts the branches that my other lopper kinda goes sideways on and gives up. Certainly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Kinsey",
      "helpful_votes": 0,
      "publication_date": 20170313
    },
    {
      "title": "Help!!!",
      "text": "How does one remove the plastic ties around clippers? I tried cutting which does not work. No instruction were included.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Plain and simple...",
      "text": "I needed to trim some tree branches and other things around the yard. This is a simple, basic, and affordable option. They are light weight, cut easily, and seem durable so far. I'll update my review should anything change.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Manuverability",
      "text": "Works great - exactly what I wanted - I am 77 years old and needed something to trim the larger branches - palm fronds etc.- very light weight",
      "rating": 5.0,
      "verified": true,
      "author": "shirleyje",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Sharp Valuable  Tool",
      "text": "Upon delivery I opened the package and used it immediately to prune my lemon tree. I was very impressed by the quality and how sharp it was. The handle gripping was comfortable. Your hands did not hurt trying to close the tool. Ergonomically made. This is from someone who has bilateral tendernitis. I highly recommend this product, you're getting quality and value as well as technology. Marjorie E.",
      "rating": 5.0,
      "verified": true,
      "author": "Chantal21",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "easy to use",
      "text": "Used this to cut thick branches on a rosemary bush. It was easy to move around and sharp enough to cut through even the thickest pieces.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin C",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "GREAT OPTION",
      "text": "Pleasantly surprised by ease of use. I have arthritis in my hands and thought my trimming days were over. These are sharp and lightweight. They hold an edge.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Dugan",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Great value!",
      "text": "I've only had these for a few months, but they are working great! They came very sharp and slice through tree limbs like it's nothing. They are easy to use and feel solid. Since it's only been a few months I can't speak to durability, but I'm guessing I'll have these for awhile! These are great and much cheaper then buying in a store!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffery P.",
      "helpful_votes": 0,
      "publication_date": 20170308
    },
    {
      "title": "Blade too soft",
      "text": "it's light-weight, easy to handle, but the blade is too soft, which bends and nicks after the very first use for only couple minutes.",
      "rating": 3.0,
      "verified": true,
      "author": "Gavin.H",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Work great",
      "text": "These have held up and worked like a charm. Very pleased with my purchase and even more pleased to have them delivered instead of going to a big box store",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "What I always needed but did not know it",
      "text": "Great for trimming bushes and trees. I like the length. Friskars has an 15\" product which is as sharp but has less leverage.",
      "rating": 5.0,
      "verified": true,
      "author": "Bromelain",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "As advertised.",
      "text": "I've used this brand for many years, this item is up to their usual standards. I find it easy to work with; I carry a pair with me while I'm on my Deere and trim off low hanging tree branches where necessary.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190821
    }
  ],
  "product_meta": {
    "title": "Fiskars 28 Inch Bypass Lopper Black/Orange (391461-1003)",
    "description": "Color:BlackChoose Fiskars Bypass Lopper for smooth, easy cuts on tree branches, comfortable use and lasting value. A fully hardened, precision-ground blade stays sharp, and a low-friction coating helps it resist rust while making every cut even easier. Shock-absorbing bumpers eliminate the jarring conclusion at the end of cuts, and non-slip comfort grips make our lopper easier to grip, carry and maneuver when cutting at awkward angles. In addition, durable steel handles provide lasting strength through heavy use.\n\nAMAZON.COM\nThe Fiskars bypass lopper is an ideal choice for big cutting tasks. The unit's fully-hardened stainless steel blades are designed to provide a cleaner cut for living, green growth. The blades are also replaceable, and can cut branches up to 1-1/2-inches in diameter. Additionally, the blades' non-stick coating ensures smooth and clean cuts. Durable steel handles feature soft, cushioned grips and a shock-absorbing bumper for all-day comfort.",
    "rating": 4.7,
    "feature_bullets": [
      "Ideal for cutting green, living growth like tree branches",
      "Fully hardened, precision-ground blade stays sharp through heavy use",
      "Rust-resistant, low-friction coating helps the blade glide through wood and prevents it from gumming up with sap and debris",
      "Length: 28 icches with a cut capacity of 1-1/2 inch thick branch"
    ],
    "specifications": {
      "Product Dimensions": "1.13 x 9.63 x 28.38 inches",
      "Item Weight": "2.9 pounds",
      "Manufacturer": "Fiskars",
      "ASIN": "B000BX1IB6",
      "Item model number": "391461-1003",
      "Customer Reviews": "4.7 out of 5 stars2,656 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#722 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Loppers",
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Hand Tools",
      "Gardening & Lawn Care"
    ],
    "price": 26.6
  }
}