{
  "website_summaries": [
    {
      "verdict": "A cooking tripod made from solid steel and designed to take on Dutch ovens of all sizes.",
      "pros": [
        "Made from cast iron",
        "Strong and long lasting",
        "Raised about 3 feet over the fire",
        "Chain is 24 inches long",
        "3 legs of the tripod are connected",
        "Tripod collapses for easy storage",
        "Very sturdy",
        "Works well on irregular ground",
        "Holds the pot steady"
      ],
      "cons": [
        "This product is not very tall which can make it a challenge to use with larger Dutch ovens",
        "Lodge also makes a 60-inch option"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Lodge tripod",
      "text": "Used this tripod on a recent camping trip. I have the lodge 3 quart dutch oven and it worked great. I didnt have any issues with the legs being unstable, I just hammered down the legs into the dirt. Super easy to setup. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "TPAGE",
      "helpful_votes": 26,
      "publication_date": 20170224
    },
    {
      "title": "Perfect",
      "text": "This worked perfectly with our cauldron. My Pop put wood under the legs which wasn't necessary. I removed the wood later but did not get a photo of it without it. It's very sturdy and stable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda C T Wigfield",
      "helpful_votes": 3,
      "publication_date": 20191215
    },
    {
      "title": "Perfect height, easy set up, heavy duty construction",
      "text": "Its medieval heavy duty basic 3 iron legs and a hook. Reviews I read about hard to set up are totally wrong. Reviews about it being too short are wrong unless cooking over a monster fire. Buy it! Its perfect for its intended use.",
      "rating": 5.0,
      "verified": true,
      "author": "Zorro",
      "helpful_votes": 3,
      "publication_date": 20190910
    },
    {
      "title": "Works as intended.",
      "text": "Not exactly a hand forged heirloom, it does its job, needed a few straightening tweeks on the legs (the welded thread ends for the legs were not all straight). Holds an 8 qt mostly full dutch oven without a flex.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Hey, what's in the bowl Mitch?",
      "text": "Worked great, stored easy on my touring motorcycle. Sturdy enough to hold a large Dutch oven.",
      "rating": 5.0,
      "verified": true,
      "author": "Review Guy",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Love Lodge",
      "text": "Work like its suppose too. holds my dutch oven over fire just fine... nothing more to say, you cant go wrong with USA Lodge. Although not 100% sure this item is usa but it's good.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Great buy",
      "text": "Far exceeded my expectations. I expected some hallow pipe crap. It’s solid. Mine didn’t Have rust on it when I got it. if u r buying this for camping use idk why u would expect it to be used on concrete like some complained about. 🙄 But works great for a dirt fire pit and is definitely tall enough.",
      "rating": 5.0,
      "verified": true,
      "author": "linda arciniega",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "camping time",
      "text": "stable once you get them in the fire. Suggestion put in before fire gets too hot! We use this with our dutch oven for camping and it works great they do not sway or move when the pot is hanging on it.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Allen",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "I was very happy with the durability after one use in bad conditions",
      "text": "Had this posted IN the hot fire and only got a slight bend out of one of the poles, I was very happy with the durability after one use in bad conditions.",
      "rating": 5.0,
      "verified": true,
      "author": "Wesavesharks",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Solid tripod",
      "text": "Good, sturdy, solid legs. Well made, as all Lodge products typically are.",
      "rating": 5.0,
      "verified": true,
      "author": "Ambassador of Canned Fruit",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Dutch-Oven Users Need This",
      "text": "I use this almost every weekend; I do not plan to go back to burning myself because I put my Dutch Oven directly in the coals.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck Bauer",
      "helpful_votes": 2,
      "publication_date": 20160225
    },
    {
      "title": "Self locking pot support",
      "text": "Got this for my son for Christmas along with the large outdoor pot and lid. I was amazed how stable it became once the pot was put on it. The linkage at the top self locks and makes the whole unit stable once a load is applied to the chain. Good engineering, and made in the U.S.A. to boot!!!",
      "rating": 5.0,
      "verified": true,
      "author": "FullSupport",
      "helpful_votes": 12,
      "publication_date": 20130125
    },
    {
      "title": "I like my tripod because it is adjustable in its height ...",
      "text": "I like my tripod because it is adjustable in its height works well on flat ground and hills. Carry case is nice too keeps everything together.",
      "rating": 5.0,
      "verified": true,
      "author": "Fellow shopper",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "I bumped it a little made the cast iron swing a bit made sure it was sturdy. chain is long but wasn't an issue",
      "text": "Haven't used it yet but I set it up on concrete and hung up the lodges cast Iron camp dutch oven (4 quart) and it worked well. I bumped it a little made the cast iron swing a bit made sure it was sturdy. chain is long but wasn't an issue.",
      "rating": 5.0,
      "verified": true,
      "author": "katrina",
      "helpful_votes": 0,
      "publication_date": 20170812
    },
    {
      "title": "Well built but if I was buying it again I ...",
      "text": "Well built but if I was buying it again I would buy the taller one to give you more clearance in a fire pit",
      "rating": 5.0,
      "verified": true,
      "author": "Vaughn",
      "helpful_votes": 2,
      "publication_date": 20150918
    },
    {
      "title": "Five Stars",
      "text": "Solidly built and works great... however its a lot shorter than you expect.",
      "rating": 5.0,
      "verified": true,
      "author": "Native Texan",
      "helpful_votes": 2,
      "publication_date": 20150529
    },
    {
      "title": "LOVE IT! WORKS GREAT",
      "text": "LOVE IT! WORKS GREAT. just the right size we been looking for",
      "rating": 5.0,
      "verified": true,
      "author": "snoopy",
      "helpful_votes": 0,
      "publication_date": 20170219
    },
    {
      "title": "Four Stars",
      "text": "In the package was a note that stated a carring bag was included, it wasn't.",
      "rating": 4.0,
      "verified": true,
      "author": "Mitchell M. Dupre Jr.",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "Easier on your back",
      "text": "Now you don't have to bend as far down to do campfire cooking. As we age we don't bend as easily but can still enjoy cooking outdoors.",
      "rating": 5.0,
      "verified": true,
      "author": "PENNY L. WHEELER",
      "helpful_votes": 4,
      "publication_date": 20130108
    },
    {
      "title": "Stows easy enough and last for many years",
      "text": "Simple design but effective for intended use. Stows easy enough and last for many years.",
      "rating": 4.0,
      "verified": true,
      "author": "Scotty S",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "Practical tripod",
      "text": "It is great for cooking outdoors. Get the carry bag though! It will save you tying it up to carry it.",
      "rating": 5.0,
      "verified": true,
      "author": "Val",
      "helpful_votes": 0,
      "publication_date": 20131005
    },
    {
      "title": "Five Stars",
      "text": "great for out door cast iron cooking set ouer my fire pit like was made for it",
      "rating": 5.0,
      "verified": true,
      "author": "michael f caswell",
      "helpful_votes": 2,
      "publication_date": 20170126
    },
    {
      "title": "outdoor cooking",
      "text": "This item necessary for outdoor open fire cooking- have recipe book handy for making delicious meals-stews, rolls, & casseroles, etc. My brother & I will put this to good use!",
      "rating": 5.0,
      "verified": true,
      "author": "pat luchsinger",
      "helpful_votes": 0,
      "publication_date": 20130403
    },
    {
      "title": "It was what expected",
      "text": "Perfect for my outdoor cooking. Lodge is an excellent brand. The product was inexpensive as compared with other sites. What i like the most is that it will not rust.",
      "rating": 5.0,
      "verified": true,
      "author": "Gilberto Adames",
      "helpful_votes": 0,
      "publication_date": 20130420
    },
    {
      "title": "Great Tripod.",
      "text": "This is a nice tripod for holding your dutch oven over the fire. Really best for stews and boiling water as opposed to baking. We also use this to hold a lantern where we need it around the campsite as well. Very self explanatory and sturdy. I would highly recommend this tripod.",
      "rating": 5.0,
      "verified": true,
      "author": "Ace",
      "helpful_votes": 0,
      "publication_date": 20170409
    },
    {
      "title": "Great stand",
      "text": "This stand is far more sturdy than I was expecting. I would definitely recommend this stand to anyone looking to cook over a fire with a Dutch Oven.",
      "rating": 5.0,
      "verified": true,
      "author": "Wesley",
      "helpful_votes": 0,
      "publication_date": 20140621
    },
    {
      "title": "great gift",
      "text": "Easiest Christmas shopping I've ever done! Couldn't be happier with my purchase r the customer service. All around great shopping experience.",
      "rating": 5.0,
      "verified": true,
      "author": "MstrsK",
      "helpful_votes": 0,
      "publication_date": 20130115
    },
    {
      "title": "no chain",
      "text": "for some reason, mine didn't come with the s hook or chain. it's almost useless with out them.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20160120
    },
    {
      "title": "Bad Picture",
      "text": "Product is fine, and as usual with Amazon shipping was very fast. Product picture shows with the carry bag. Carry bag for this item is optional. Overall, a handy product for outdoor cooking with your Lodge dutch oven. They should show picture of product set up though! FOLLOW UP See they fixed picture...great. Only reason I didn't give it a higher rating at the time was that I felt that the product was misrepresented in that the visual appeared to suggest the carry bag was included.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian Miller",
      "helpful_votes": 20,
      "publication_date": 20070423
    },
    {
      "title": "but is very sturdy when put up and seems like its going to ...",
      "text": "Have not used the product yet, but is very sturdy when put up and seems like its going to work great!!",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20151106
    },
    {
      "title": "backyard campout",
      "text": "This is a great way for a fun party with good food",
      "rating": 5.0,
      "verified": true,
      "author": "humblepie",
      "helpful_votes": 4,
      "publication_date": 20110706
    },
    {
      "title": "flimsy",
      "text": "It's not as sturdy as I was hoping for I haven't used it yet but I almost feel as if it will not hold up to the weight of my heavy duty cast iron pot.",
      "rating": 3.0,
      "verified": true,
      "author": "kristin valadez",
      "helpful_votes": 0,
      "publication_date": 20160917
    },
    {
      "title": "Poorly made",
      "text": "The product shipped was as posted, however when using this be very careful to not get the campfire roaring hot as it will melt the tripod.",
      "rating": 2.0,
      "verified": true,
      "author": "Thomas Warner",
      "helpful_votes": 4,
      "publication_date": 20140619
    },
    {
      "title": "Seems good except a curved leg? Threads weld point?",
      "text": "Seems nice and solid EXCEPT, one of the legs threaded junction is welded a little wonky. See picture and you can see what I mean. Other legs sit straight. *** update Spoke with lodge directly they admit looks Like a defect on this one and photos reviewed by their quality control people. I guess a matter of so many made a few oops are going to happen. But must say also kinda disappointed thought lodge used to be made in USA but not this item.. will see how replacement is once I get it",
      "rating": 4.0,
      "verified": true,
      "author": "Technology geek.",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Works",
      "text": "The chain is long enough so that if you were to hang a 12 in dutch oven on the last ringlet of the chain the dutch over would be touching the ground. No problem you can shorten the chain from the top by hooking a ringlet half way up the chain. Not hard to use. Just don't over think it, create a triangle with the 3 legs and you will be good to go.",
      "rating": 5.0,
      "verified": true,
      "author": "bill1burp",
      "helpful_votes": 6,
      "publication_date": 20170212
    },
    {
      "title": "sigh",
      "text": "lodge outsourced a simple, heavy duty accessory. a previous three star review described the result. mismanufactured. the parts are there, just in the wrong order. i wish the hook was removable so i can put it where i want it. as it is, i'll just add another hook at added expense. some reassembly required. sigh..",
      "rating": 3.0,
      "verified": true,
      "author": "jc",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Very simple design",
      "text": "This is just 3 metal rods with a chain in the middle! Very sturdy and holds my large cast iron pot from it without any issues. You can maneuver the legs to go over an irregular surface and they still feel very strong and stable. Good purchase for use with campfires, home hearths, or the backyard fire pit.",
      "rating": 5.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 15,
      "publication_date": 20130121
    },
    {
      "title": "Given as a gift",
      "text": "This was a gift and the recipient was excited to receive it. I have review of sturdiness or clean-ability but was happy with the easy of shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda K. Jeider",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Really good and sturdy",
      "text": "I do YouTube videos as \"Da Garbage Disposal\" I am a professional eater that does bad actin' as well (very good at both)",
      "rating": 4.0,
      "verified": true,
      "author": "Da Garbage Disposal",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Just what we needed",
      "text": "Perfect for our outdoor event. We made Hot mulled cider over the fire pit. Thus was perfect to hold the cast iron pot.",
      "rating": 5.0,
      "verified": true,
      "author": "L. G. Royer",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Good for the camp fire",
      "text": "My son in law enjoys cooking with cast iron on a campfire. I ordered this for him to use and he really likes this, and especially liked that it came with the carrying bag. The bag makes it much easier to store and carry. UPDATE- I need to add that this did not come with the bag, I ordered the bag along with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Randall Dias",
      "helpful_votes": 7,
      "publication_date": 20130526
    },
    {
      "title": "Easy gadget for campfire cooking",
      "text": "This worked well for hanging out Dutch oven over the fire. Set up and was super fast and we were eating cobbler in no time.",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "I will say that we found a great use for it to hang our percolator over our ...",
      "text": "Way shorter than expected but I should have paid attention to the dimentions. I will say that we found a great use for it to hang our percolator over our chimney starter to make coffee quick and easy.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy Drumgool",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Just \"OK\"",
      "text": "A bit awkward and not as stable as I would have liked. Passable",
      "rating": 3.0,
      "verified": true,
      "author": "Islandflea",
      "helpful_votes": 2,
      "publication_date": 20160301
    },
    {
      "title": "Made in China",
      "text": "Should be called Chinese Lodge. For a company like lodge, that is proud of its American made products, they really sold out there American workers on this one. I am really disappointed with lodge mfg. on this product from China.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike S.",
      "helpful_votes": 6,
      "publication_date": 20171003
    },
    {
      "title": "perfect tripod",
      "text": "Works great. Goes great with the whole setup. a handy item to have to go with the whole lodge setup and worth the investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Russell B. Covert",
      "helpful_votes": 0,
      "publication_date": 20130821
    },
    {
      "title": "... son and daughter in law and they are completely happy with",
      "text": "It was a gift to my son and daughter in law and they are completely happy with it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "tripod stays cool too the touch after hanging over fire for a ...",
      "text": "Very well made, tripod stays cool too the touch after hanging over fire for a long time. Makes for easy removal when cooking is finished and fire time continues. Folds down fairly small and fits in my camping storage easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Wagner",
      "helpful_votes": 0,
      "publication_date": 20150610
    },
    {
      "title": "Awesome",
      "text": "It's a tripod so there isn't much to say about it. I love to use it! I take it everywhere I go when I car camp.",
      "rating": 5.0,
      "verified": true,
      "author": "Jman",
      "helpful_votes": 0,
      "publication_date": 20131025
    },
    {
      "title": "Not tall enough",
      "text": "I wanted to use this tripod to hang a cauldron over my fire pit. The tripod is so short that the cauldron could not get off the ground even with the chain at minimum length. I made some extensions with 1/2 in tubing and solved the problem. The quality is very good and will last a long time.",
      "rating": 3.0,
      "verified": true,
      "author": "candelier",
      "helpful_votes": 2,
      "publication_date": 20130425
    },
    {
      "title": "Sturdy Tripod",
      "text": "This is a sturdy tripod for your Lodge cookware. The photo shows the carrying case however, you only get the tripod. The details did say case not included.",
      "rating": 5.0,
      "verified": true,
      "author": "Turnings",
      "helpful_votes": 10,
      "publication_date": 20090401
    },
    {
      "title": "I left this at my last campsite - on purpose",
      "text": "You get what you pay for. I was expecting the legs to lock in position somehow. I've asked several experienced campers and they all said you just have to stick the legs in the ground and hope for the best. Seriously? I want a tripod where the legs lock. I camp in the desert and the ground is like concrete so I can't just stick them in the ground.",
      "rating": 1.0,
      "verified": true,
      "author": "SVinLV",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "Does anyone else think it's way too low to the ground?",
      "text": "I've used this once, and my fires have flames that RAGE up and OVER my dutch oven when using this tripod. Is that normal? There is literally about 3\" of space below my 12 dutch, and that's with a shortened chain and no firewood directly below it. Normal? I just started using LODGE and love my ovens and skillets, but I'm questioning the use of this tripod. Am I using it wrong? I'd love to hear feedback. I need this for our camping trip and the TallBoy wouldn't get here by this weekend.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Rausch",
      "helpful_votes": 4,
      "publication_date": 20120523
    },
    {
      "title": "Good solid tripod",
      "text": "very sturdy, well made and it works perfectly. I looked at others but am very happy I chose this one",
      "rating": 5.0,
      "verified": true,
      "author": "James F.",
      "helpful_votes": 0,
      "publication_date": 20131107
    },
    {
      "title": "Gift",
      "text": "Bought this as a gift for my son-in-law; he love's it! Score 1 more for the mother-n-law!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Sylvester",
      "helpful_votes": 0,
      "publication_date": 20100831
    },
    {
      "title": "campfire tripod",
      "text": "I have not used the tripod yet, but it appears to be well made, and should do the job it was designed for",
      "rating": 4.0,
      "verified": true,
      "author": "Ronald L. Mccrea",
      "helpful_votes": 0,
      "publication_date": 20130328
    }
  ],
  "product_meta": {
    "title": "Lodge 5TP2 Tall Boy Tripod ,Black",
    "description": "Size:60-InchThe solid steel construction and adjustable chain make the Lodge tripod an excellent way to hang Dutch ovens and enjoy the great outdoors with great food. This large tripod features 60 inch legs with 36 inch chain. All-steel construction with high-temp black finish. Other sizes available: Lodge Camp Dutch Oven Tripod has 43. 5 inch legs with 24 inch chain (3TP2). Warning: This product can expose you to chemicals including Chromium (Hexavalent Compounds) which is known to the state of California to cause cancer and birth defects or other reproductive harm.",
    "rating": 4.7,
    "feature_bullets": [
      "Tall Boy tripod features 60\" legs with 36\" chain",
      "All-steel construction with high-temp black finish",
      "Adjustable chain to hang Dutch ovens over campfire",
      "Perfect accessory for cooking great food in the great outdoors",
      "Sport type: Camping & Hiking"
    ],
    "specifications": {
      "Item Weight": "11.43 pounds",
      "Department": "Boys",
      "Manufacturer": "Lodge",
      "ASIN": "B0008G2W2K",
      "Item model number": "5TP2",
      "Customer Reviews": "4.7 out of 5 stars339 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#43,072 in Sports & Outdoors",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 29, 2005"
    },
    "categories": [
      "Outdoor Recreation",
      "Open Fire Cookware",
      "Sports & Outdoors",
      "Camping Cookware",
      "Camp Kitchen",
      "Camping & Hiking"
    ],
    "price": 79.66
  }
}