{
  "website_summaries": [
    {
      "verdict": "This benchtop half-horsepower mortiser is designed and priced for a homeowner performing lighter-duty work.",
      "pros": [
        "Jet's benchtop mortiser is manufactured using cast iron and steel",
        "It is sized to easily fit in even a small space and features an oversized chuck to help prevent scraped knuckles when changing bits",
        "The unit comes with a five-year limited warranty"
      ],
      "cons": [
        "Although it is a durable machine, this model doesn't handle hardwoods as well as some may desire"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Too Specialized To Justify",
      "text": "Mortisers are specialized by nature, but with this type, the utility is very limited. If your mortises are not at 90 degrees to the surface AND 90 to the side, you can’t use this machine. Want a mortise at the end grain of a board (more then 6 inches long)?Forget it. Whatever the machine does, you can do better with a router. Instead of this machine, I find myself using my router or just chisels. If you are doing production work, by all means , a mortiser can help - just get one that tilts and allows end grain mortises. This one doesn’t.",
      "rating": 3.0,
      "verified": true,
      "author": "Brian Egras",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "It's been a great first mortiser for me.",
      "text": "This is the first and only mortiser that I've ever used. It seems to do everything it's supposed to do, and I've used it on a dozen projects so far. I can see how having a heavier unit with a longer handle might be helpful, and I wish there were an easy way to align the chisel portion of the bit so that it's perfectly square. However, a couple of test punches lets you see any adjustments that are needed. A bigger back fence with a clamping system would be great, but again I think that probably comes with the more expensive units.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 6,
      "publication_date": 20160407
    },
    {
      "title": "Beware of the chuck size . . .",
      "text": "I did not read the entire description all the way down at the bottom of the page - this is my fault. Maybe I can help somebody else. First surprise, the machine comes with chisels - wish this would have been more clear - because I bought a set (1/4\" - 3/4\"). Second (and bad) surprise was that the chuck accepts nothing larger than the 1/4\" bit and chisel. I need to make 4 pockets that are each 4\" long x 1/2\" wide . . . going to take some time.",
      "rating": 1.0,
      "verified": true,
      "author": "Yankee Wanna Be",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Needed a few tweaks",
      "text": "A good machine for the price, just had to play with the tension adjustments on the column to make the head easier to raise back up. I think it is supposed to retract to the full upright position since there is a stiff spring to do that, but it still has to be manually raised with the handle. Tried lubrication and silicone spray too, but without any changes. It drills square holes, and that's what I wanted it to do. Mounted it to a piece of plywood so I could move it around if needed, then just clamped the plywood to the bench.",
      "rating": 4.0,
      "verified": true,
      "author": "Gary W.",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "I have a set of great chisel/drill bits and value the work I can get ...",
      "text": "The fence does not track parallel, resulting in slightly off-set mortises. That being said, I would not want to exchange it because it is a workhorse for my little shop. I have a set of great chisel/drill bits and value the work I can get done on everything from hard maple to fir.",
      "rating": 4.0,
      "verified": true,
      "author": "LINDSEY PHILPOTT",
      "helpful_votes": 4,
      "publication_date": 20170714
    },
    {
      "title": "Like they say",
      "text": "I won't beat the concept to death; this is a great benchtop mortiser. Fast accurate and done in a slight fraction of the time it would take me to do it by hand. The only con is that I find i need to square the chisel bit out every so often, but not enough to be a pain or actually slow things down appreciably. I don't regret this and I wish I'd purchased one sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "J B",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Make sure chisel is square to fence before using",
      "text": "Always wanted one. I love mortise and tenon joinery. This makes it a lot easier. After reading a lot of product reviews for machines under a certain price this one was 1 of 3 finalist. I picked it because a lot of the negative reviews I read I could blame on operator error and not the tool. Also the brand name and 5 year warranty helped me decide. Be sure you have the chisel squared to the fence. Practice on scrap to make sure it is square. Easily adjusted",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Howard",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "great for money",
      "text": "Had one I bought at a sale. Was getting a little loose. Bought this new one and love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Boas",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "My favorite toy.",
      "text": "Exactly as described. Never boys down. My only complaint is the Piston that's supposed to spring it back into place doesn't work as well as the demo one at rockler. I absolutely love the machine and it makes mortices effortless.",
      "rating": 5.0,
      "verified": true,
      "author": "RS",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Great addition to my workship!",
      "text": "I don't think I can say it much better than most of the other reviewers here, but that's never stopped me before. It's a very well made product, from the mortiser itself, the very sharp chisels that come with it and the chuck key. However, the hold down does leave a bit to be desired. It doesn't give me that sense of confidence at all times as far as whether or not it'll stay put...but it has so far. Personally, other than the hold down, I love this tool! If you're drilling holes and chiseling the waste wood or routing...well if you've got the dough (and in this economy, it's an understandable consideration!), give the Jet a looksee!",
      "rating": 4.0,
      "verified": true,
      "author": "Eric Jones",
      "helpful_votes": 3,
      "publication_date": 20081230
    },
    {
      "title": "Good Buy",
      "text": "Wish I had bought this years ago. Well made, accurate, and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Good addition to your shop.",
      "text": "I saw some reviews say that this did not come with any bits but it does comes with a set. I have used this on one dresser so far and it worked great. Very easy to set up.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon ",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Fair price, good quality",
      "text": "Works as designed to, as with most new items once its used it will loosen up so it will move freely, I would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob R.",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Great customer service",
      "text": "The 1st one came with a cracked cast iron base. Called Amazon and they quickly shipped a new unit and picked up the defective one. Unit works great.",
      "rating": 5.0,
      "verified": true,
      "author": "James Petillo",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Easy to use with great results",
      "text": "Have enjoyed learning how to use my new mortising machine. It's been great using mortise and tenon joints instead of dowels....I am currently building a cherry table desk.",
      "rating": 5.0,
      "verified": true,
      "author": "John E. Porter",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Okay but could be better.",
      "text": "Very limited height, table is too small. Otherwise, it is okay. Not a lot to brag about on this one. I'd do an internet search and find a better model.",
      "rating": 3.0,
      "verified": true,
      "author": "Mississippi",
      "helpful_votes": 2,
      "publication_date": 20150705
    },
    {
      "title": "too old to find out now.",
      "text": "This is one fine tool. I didnt think I would ever want one of these tools but I an building a baby bed so I thought I would try one out.The only thing I can say is I waited till I was in my seventies to try one.Sorry for that. Personally I dont see how one could be any better than this.I am well satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Floyd A. Mccullough",
      "helpful_votes": 2,
      "publication_date": 20100430
    },
    {
      "title": "Great Tool!",
      "text": "I'm a new woodworker and I bought this machine, because I was afraid of messing up good work with a drill press and hand chisels. I was apprehensive over the purchase, because most benchtop mortisers seemed to draw mixed reviews. But I needn't have worried. The Jet machine arrived in perfect shape, was very easy to set up and worked exactly as I'd hoped it would. It's not perfect, positioning the workpiece square against the fence requires some care and attention to detail, but the machine still makes mortising easy and accurate. It's definately worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "shaysite",
      "helpful_votes": 2,
      "publication_date": 20090531
    },
    {
      "title": "Pretty nice",
      "text": "I'm a Delta fan and read the earlier Amazon reviews on JET'smortiser. I passed over the Delta model because of these reviews. TheJET is quickly and easily set up and it runs smoothly. Very nicely designed. Adjustments are simple and quick. The hold-down should have a horizontal adjustment to prevent binding on the upstroke, but that's a minor matter...",
      "rating": 4.0,
      "verified": true,
      "author": "R. Startzman",
      "helpful_votes": 18,
      "publication_date": 20000502
    },
    {
      "title": "The machine showed up in good condition and the components were square and the assembly ...",
      "text": "The machine showed up in good condition and the components were square and the assembly seemed to be a decent bench top machine. Two days into owning this machine with no load on the chisel the machine started to smoke. I have a call out to Jet Technical Support who think that it is the capacitor and we will see if that will fix this. The Jet Customer Support was not particularly knowledgeable about this product which made the troubleshooting an issue. Overall I think I got what I paid for and I will need to purchase a larger professional machine because the quality control on these \"prosumer\" grade tools is just so poor.",
      "rating": 1.0,
      "verified": true,
      "author": "Luke Foco",
      "helpful_votes": 12,
      "publication_date": 20161213
    },
    {
      "title": "Good product",
      "text": "The mortise machine arrived on time, as specified and has performed as expected!",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart Short",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Good quality and does the job just fine",
      "text": "I've always wanted one. Good quality and does the job just fine. Just remember take you time and do not force.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Debany",
      "helpful_votes": 0,
      "publication_date": 20150326
    },
    {
      "title": "Rattles excessively",
      "text": "Rattles excessively, but it works okay after you fiddle around with it.",
      "rating": 3.0,
      "verified": true,
      "author": "Klay Ashby",
      "helpful_votes": 0,
      "publication_date": 20160621
    },
    {
      "title": "short mortiser",
      "text": "This is not typical Jet equipment, I have a Jet table saw, lathe and band saw, they are impressive tools. I should have read the small print with the mortiser. the throat is just enough to mortise a 2X4, in hard wood the motor jams because of wood chips, the chuck is too small 5/8ths would have been a better choice and hard to access. I did keep the machine and added a spacer for wider stock. It does work better than my drill press but not much. Rich",
      "rating": 2.0,
      "verified": true,
      "author": "Rich B",
      "helpful_votes": 10,
      "publication_date": 20070207
    },
    {
      "title": "Damaged",
      "text": "The first unit delivered had a large dent in the motor cap. Waiting for replacement.",
      "rating": 2.0,
      "verified": true,
      "author": "David F. Johnson",
      "helpful_votes": 0,
      "publication_date": 20160216
    },
    {
      "title": "Hubby loves it",
      "text": "Works well and hubby loves it. Has used it for a year now and it's still going strong. He's a woodworker so if he's happy I'd recommend it to anyone who needs one.",
      "rating": 5.0,
      "verified": true,
      "author": "Dreamer",
      "helpful_votes": 0,
      "publication_date": 20151211
    },
    {
      "title": "BEWARE \"LIKE NEW\"",
      "text": "I'm a pretty loyal Amazon fan, but I won't be ordering any used power tools again. The first mortiser I received was broken off at the head (it was a Delta). This one looked okay until I got it set up and all it did was make a \"whirring\" sound. Looking at it more closely, it appeared that it had been dropped and had a significant dent on the top of the head. Think I'm going to stick with really new.",
      "rating": 1.0,
      "verified": true,
      "author": "mrcm",
      "helpful_votes": 3,
      "publication_date": 20140214
    },
    {
      "title": "Fledging woodworker",
      "text": "Exceptional machine. It is easy to operate, and turns out great work. Very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170428
    },
    {
      "title": "Five Stars",
      "text": "Works Well but in order to use a 5/8 ths bit I had to order a diffewrent chuck",
      "rating": 5.0,
      "verified": true,
      "author": "Carl O. Hamilton",
      "helpful_votes": 0,
      "publication_date": 20150113
    },
    {
      "title": "... complaint about this tool is that it is somewhat tedious to adjust",
      "text": "My only complaint about this tool is that it is somewhat tedious to adjust. Once it is \"dialed in\", it works very well.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20160603
    },
    {
      "title": "Arrived in good condition and worked very good",
      "text": "Arrived in good condition and worked very good. I am very satisfied with this tool. My project right now is made from Hawaiian Koa which is very hard and dense,,,no problems .",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth Kriner",
      "helpful_votes": 0,
      "publication_date": 20150812
    },
    {
      "title": "Nice machine, easy to set up and use",
      "text": "Nice machine, easy to set up and use. I didn't get the quality of mortises that I had hoped for, but I am fairly certain that was my fault and I look forward to my next project.",
      "rating": 4.0,
      "verified": true,
      "author": "scotloomis",
      "helpful_votes": 0,
      "publication_date": 20150103
    },
    {
      "title": "Jet Mortiser",
      "text": "The tool works well! I am happy with its' ease of use and set up. For a low end mortiser it works very well for the occasional user. The first one I received had a caved in top due to improper packaging. I let Amazon know, and in two days I received a new replacement, at no charge. The staff at Amazon were great - it was very easy to get a new one sent quickly and have UPS pick up the one that was damaged. Thanks, Amazon for your wonderful customer support.",
      "rating": 3.0,
      "verified": true,
      "author": "Jerry L. Jenkins Jr.",
      "helpful_votes": 6,
      "publication_date": 20070119
    },
    {
      "title": "Five Stars",
      "text": "The perfect machine for a handyman shop repairing small to medium furniture.",
      "rating": 5.0,
      "verified": true,
      "author": "Financial Expert",
      "helpful_votes": 0,
      "publication_date": 20161105
    },
    {
      "title": "A quality tool you'll love owning",
      "text": "I received my Jet Mortiser a couple of days ago and was pleased by the easy assembly. But better yet was the quality of the power unit and the excellent chisels that were included as a free bonus. I've cut mortises in oak, cherry, pine and even pressure treated pine all with excellent results. This is a well built tool and appears to be constructed to withstand many years of heavy use. I'm glad I checked your website reviews before ordering, as I definately made the right choice in this tool.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Logan",
      "helpful_votes": 25,
      "publication_date": 20000626
    }
  ],
  "product_meta": {
    "title": "Jet Bench Mortiser, 1/2 HP, 120V, 1/2\" Cap.",
    "description": "Bench Mortiser Motor HP 1/21 Phase, 115.\n\nAMAZON.COM\n\n\n\nIdeal for professional furniture makers as well as for home woodworkers, Jet's affordable 708580 JBM-5 benchtop mortiser features a 1/2-horsepower induction motor and is designed to take up to 1/2-inch chisel bits. The dependable rack-and-pinion head adjustment gives you accurate drilling control, while its heavy-duty cast iron and steel construction provides durability and stability for years of use.\n\n\n\nDependable mortiser for home woodworkers or professional furniture makers (view larger).\n\nFEATURES\nAt only 44 pounds, the Jet 708580 is sturdy but also easily maneuvered, plus it reverses on its base to allow for mortising in long stock. The 4-3/4-inch head stroke is great. Bits are easy to change. Just flip open the steel door on either side (other models on the market often have doors made of flimsy plastic) to gain easy access to the chuck. And, thanks to the 4-inch chuck key, there's little chance of banging or scraping your knuckles while switching bits.\n\nThe mortiser's feed handle adjusts so you can choose the most comfortable position for each application, and it also offers a quick-setting depth stop and a removable toggle switch that prevents accidental or unauthorized use of the tool. It's set on a heavy-duty cast-iron base with four predrilled mounting holes. Other features include a three-jaw drill chuck that keeps a positive grip on mortising bits for chisels up to 3/4-inch in size, two hinged side doors for easy access to the chuck, and a reversible column for mortising larger stock. It's backed by a 5-year limited warranty.\n\nSPECIFICATIONS\nWHAT'S IN THE BOX\nOne Jet 708580 JBM-5 benchtop mortiser, one hydraulic cylinder, one handle, 3/4- and 5/8-inch chisel bushings, one spindle extension, one chuck key, one table, hold down, fence assembly, screws, and owner's manual.\n\n\n\nCombines 1/2-horsepower motor for solid performance and a heavy-duty cast iron and steel construction.\n\n\n\n\n\nFROM THE MANUFACTURER\nFor all the projects you do that require mortising, get solid performance and trouble-free operation with this 1/2-horsepower, 115-volt , benchtop mortiser from JET. The rack-and-pinion head raises and lowers for positive drilling control while the long, multiposition splines permit repositioning of the feed handle for perfect handle position. There's a three-jaw drill chuck with an extended chuck key for positive grip on the drill bit. Two hinged side doors allow for complete drill chuck access while the heavy-duty cast-iron and steel construction adds durability and stability to the base. A removable toggle switch prevents accidental turn-on. 1/2-inch chisel capacity and 4-3/4-inch head-stroke. This set comes with three bits: 1/4-inch 708590, 3/8-inch 708592, 1/2-inch 708593.\n\nSee more",
    "rating": 4.5,
    "feature_bullets": [
      "1/2 horsepower bench mortiser; 115 volts; 1,752 rpm Motor",
      "1/2 inch chisel capacity; 4 3/4 inch head stroke; Rack and pinion head",
      "Constructed from rugged cast iron and steel",
      "Includes mortiser, three bits, chuck key",
      "44 pounds; Backed by 5 year limited warranty"
    ],
    "specifications": {
      "Manufacturer": "JET",
      "Part Number": "708580",
      "Item Weight": "53 pounds",
      "Product Dimensions": "14 x 9.5 x 30 inches",
      "Item model number": "708580",
      "Is Discontinued By Manufacturer": "No",
      "Size": "1",
      "Power Source": "Corded Electric",
      "Voltage": "115 Volts",
      "Horsepower": "0.5",
      "Item Package Quantity": "1",
      "Speed": "1752 RPM",
      "Included Components": "1 JPW Manufactured Product",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B0000223M4",
      "Customer Reviews": "4.5 out of 5 stars143 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#233,483 in Tools & Home Improvement",
      "Date First Available": "September 14, 2007"
    },
    "categories": [
      "Drill Presses",
      "Mortisers",
      "Power Tools",
      "Tools & Home Improvement",
      "Power & Hand Tools"
    ],
    "price": 457.96
  }
}