{
  "website_summaries": [
    {
      "verdict": "Worth considering if you have a little one to introduce to the water – fit and functions are built to please most kids and parents.",
      "pros": [
        "Sports a fun design with removable and adjustable sun shade, play center, and comfortable fit",
        "Ideal for ages 9 to 24 months"
      ],
      "cons": [
        "Difficult to inflate, and awkward to carry around once inflated",
        "The sun shade is flimsy, but nice once you get it in place"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Everything you love about the SwimWays spring float only with a fun play center for extra entertainment.",
      "pros": [
        "Dual inflation chambers for safe water play",
        "7 fun toys included",
        "UPF 50+ sun shielding, removable protective canopy",
        "Soft fabric doesn't rub sensitive skin"
      ],
      "cons": [
        "Seat may be too deep for smaller babies"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "So much fun!",
      "text": "Amazing!!! Using it for my 4 month old. He's always been super strong and has been sitting on his own for a minute or two at a time. Before we used it in the pool we sat him on top of the seat area and he loved it! He could balance perfectly with the support and play with the toys. In the pool he was more leaned back but could also lean forward to play with the toys. The puffer fish squeaks & they all float. The shader was amazing & snaps into place. He also took a nap on it outside the pool. Perfect!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 118,
      "publication_date": 20170907
    },
    {
      "title": "Would never go to the beach without it",
      "text": "Would never go to the beach without it. My husband and I were so grateful that we bought this before our trip to Hawaii. Our son was six months old and was very familiar with swimming in the pool but with waves it would’ve been totally different. This was awesome. He would float on the top and just kind of ride the waves, even bigger ones, even when it got deep, we felt very safe with our son like this as opposed to in our arms.",
      "rating": 5.0,
      "verified": true,
      "author": "ShoppingMama",
      "helpful_votes": 108,
      "publication_date": 20171009
    },
    {
      "title": "My little guy loved it!",
      "text": "We used this for our 5 month old son's first experience in the water and he had a blast! He was 18 pounds at 5 months and it was just a little too deep for him to chill by himself, but I wouldn't leave a 5 month old to float around the pool on their own anyway... At 6 months he's 20 pounds and fits perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy J. Reed",
      "helpful_votes": 49,
      "publication_date": 20170707
    },
    {
      "title": "PERFECT FOR 2.5 MONTH OLD!!",
      "text": "We were going to Florida for our sons first Christmas at 2 and a half months old and wanted to have him swim in the pool with us. We looked at all the reviews and were worried about the age limits. He weighs about 14 lbs and we had to hold in from underneath and from behind but the floatie was perfect for him! He could hold his head up and even lean forward. The sun shade protected him from the wind and he genuinely had a great time. I wouldn't hesitate to use this with a child of any age provided you have plenty of adult supervision and support him both behind the back and under the bum.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler Grove",
      "helpful_votes": 122,
      "publication_date": 20151224
    },
    {
      "title": "Poor quality...",
      "text": "We used it 3 times in July before we left to go visit my parents out of the country. When we returned, 5 weeks later, we took it to the pool again. In about 5 minutes it filled up with water on the inside. I assume that there is a hole somewhere caused by the cheap glue used....or something of that nature. Anyways...it is not worth it he money...at least based of my experience....",
      "rating": 1.0,
      "verified": true,
      "author": "Anastasiia",
      "helpful_votes": 8,
      "publication_date": 20180917
    },
    {
      "title": "Perfect even for younger babies.",
      "text": "I agonized over which one of these to buy. We took this one with us on a trip to Costa Rica and it was perfect. My son was 3 months, 25 inches long with partial head control at the time. His head was out of the water and he loved kicking the octopus (it rattles!). It folds back up easily and we've used it several times since that trip. It's a sturdy little floatie and I'd buy it again if I needed to.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey",
      "helpful_votes": 9,
      "publication_date": 20170703
    },
    {
      "title": "Great float and very safe",
      "text": "I’m very happy with this for my little one! It was very easy to blow up (and collapse, although you’ll want to watch a YouTube video on how to fold it back in the little bag). We went to the beach this past week and this was perfect for the pool! Since the float is so wide, it is very safe and did not encounter one thought of “oops, he could tip over”. I am so pleased with this and would highly recommend, assuming your little one meets the weight guidelines. For reference, my little one is 12 months, 21 pounds. He has room to grow for the rest of the summer so it is perfect for us!",
      "rating": 5.0,
      "verified": true,
      "author": "LHeat",
      "helpful_votes": 4,
      "publication_date": 20180610
    },
    {
      "title": "Love this!",
      "text": "LOVE this thing! We have actually gotten to use it for two seasons now. My son is 15 months old now, and we also used it last summer when he was 4-5 months old. Yes that’s younger than recommended, but he is a big baby and even without great core control he could lounge back in it and he loved it. The sun shield is the best part. Depending on which buttons you snap you can put it wherever you need it. He doesn’t use the little guy in the front this year but it comes off easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 4,
      "publication_date": 20180611
    },
    {
      "title": "Perfect",
      "text": "This was the best deal as it cam with more bells and whistles than other ones (most other ones I could find did not have the octopus activity part for the same or more priced). At first my 7 month old (19 lbs) was unsure... which a nice lady told me at the pool that baby's dont like the free floating feeling at first and I think that was exactly what it was. I supported his bottom in it for a bit and walked him around in it in the water and started letting him float by himself with me right next to him and he was set!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20170718
    },
    {
      "title": "Defective - Poor Quality",
      "text": "This item arrived with a tear and we were unable to use it. As we ordered it in March and did not open it for use until we opened out pool in May, it appears to be in eligible for return.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Hamilton",
      "helpful_votes": 5,
      "publication_date": 20190604
    },
    {
      "title": "Depends on size of baby/stage",
      "text": "Based off other reviews I purchased this for our baby when she was about 4 months old. She wasn't sitting up yet so it was perfect! She just laid back and Lounged the whole time. However now that she is 8 months old, much more active, and is sitting up she sits too far down in the netting and the water goes almost up to her chin. Not safe! She will not be able to use this again until she is much bigger. So it's all right if your baby doesn't move much and just lays back and floats there or if your baby is larger. It does protect from the Sun depending on which way you are facing.",
      "rating": 3.0,
      "verified": true,
      "author": "Joyce",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Used product",
      "text": "It only lets me post one picture, but I was very disappointed after receiving this product! I was so excited to get this for my baby but upon opening it, most all the toys had teeth marks on them and the squishy ball pictured still had water inside and the whole float smelled like chlorine. So obviously it was used.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20180717
    },
    {
      "title": "Had to return and then still didn’t get all of product with replacement.",
      "text": "Had to return once because the inner tube and all toys were missing. And the replacement (which arrives quickly) still was missing a couple of toys. It wasn’t worth messing with a second return though. That being said; great product. Had a similar item for my first child and this one is for our second. We love it and it keep the infant safely afloat while parents came swim around while keeping an eye on infant. Using it for our 9 month old.",
      "rating": 2.0,
      "verified": true,
      "author": "R. L. P.",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "So much fun in the pool!!",
      "text": "My 3-month-old had such a great time with this float in the hotel pool!!! I thought it was defective at first because we couldn't blow up the outer ring, but it turned out we were just doing it incorrectly (our friend inflated it in seconds!). It feels stable (though I never let it go of course) and made our baby feels so secure in the pool; he had a great time. It folds up so small too when you're done!! A great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "EV",
      "helpful_votes": 3,
      "publication_date": 20180809
    },
    {
      "title": "Perfect way to introduce my little one to the pool",
      "text": "Perfect way to introduce my little one to the pool, not to challenging to fold up and out back into the case. Haven't used the toys yet my little one is only 11 weeks so we put a towel in the seat so he wasn't flopping everywhere. It will be great when he gets a little bigger",
      "rating": 5.0,
      "verified": true,
      "author": "collin keating",
      "helpful_votes": 15,
      "publication_date": 20160530
    },
    {
      "title": "Defective",
      "text": "Defective product. Purchased for a recent trip to Thailand, my mistake not checking before our trip to see if everything checked out good. I ended up on a trip with a 8 month old without a floaty because there was a hole in the product. Sad because I've used these before and liked them.",
      "rating": 1.0,
      "verified": true,
      "author": "sandra",
      "helpful_votes": 2,
      "publication_date": 20191130
    },
    {
      "title": "Looks cool but i put my 6 month old in it ...",
      "text": "Looks cool but i put my 6 month old in it hes almost 20lbs and the water comes up to his neck so no not very happy",
      "rating": 1.0,
      "verified": true,
      "author": "meridith hall",
      "helpful_votes": 8,
      "publication_date": 20180603
    },
    {
      "title": "I loved it",
      "text": "This is a good floatie for your baby / toddler. I only used it when mine was 15 months old, so I can't say if any smaller baby would be a good fit for this. At 23 lbs, she fit just fine. It floats just fine, but of course I always had a hand on it while in use. You can leave the inflatable frog off of it and the kids find the hole in the front very amusing.",
      "rating": 5.0,
      "verified": true,
      "author": "Diabla",
      "helpful_votes": 2,
      "publication_date": 20190617
    },
    {
      "title": "Absolute necessity!!",
      "text": "Absolutely love this float! I researched all different kinds of floats and this one caught my eye because of the large shade and attachable toys. It is incredibly easy to set up (3 minutes) and my baby was so happy in it! I was worried the seat would be too deep as other reviews had mentioned, but my son is 8 months 30 inches tall and about 21 pounds and he fit perfect. This is an absolute necessity for babies! The only con was I could not figure out how to fold everything back up and fit it in the storage bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Faulty, tab missing to secure sun shade to the float.",
      "text": "Took out of package today for first time and tab that connects sun shade to the float is missing. Impossible to secure shade to the float without it. To late to return since I ordered 2 months ago.",
      "rating": 1.0,
      "verified": true,
      "author": "Don and Nancy",
      "helpful_votes": 4,
      "publication_date": 20190521
    },
    {
      "title": "Cute and functional but difficult to inflate without a pump.",
      "text": "This is super cute and I love how it fits in such a small package. I will say that we were super disappointed at how difficult it was to inflate (you definitely need a pump- it would take hours to do it manually- we had 3 different people try). I like that the toys don’t always have to be on there and that the canopy is removable. I will say that the canopy loses It’s ability to stay up after awhile (my nephew had this float). So with ours, I unsnap the canopy after each use and just snap it back on when we are going in the pool.",
      "rating": 4.0,
      "verified": true,
      "author": "Kendall",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Great pool float for a baby.",
      "text": "I bought this for my 7 month baby to use while in palm springs. It worked great, the sun protection was ok and I had a hat on her to keep the sun off her face. She loved the toys and was able to splash the water on the sides. I found it somewhat difficult to inflate since the valves don't come out enough to put in your mouth. Also to fold it you must have all the air out or it doesn't close well. I had to deflate it, fold it and then squeeze residual air out as it was folded. Final result was a great pool float that is good quality and I'm happy we bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "The best I’ve seen!",
      "text": "This is the very best water floater EVER! My opinion I know. But it’s cool to the touch and doesn’t burn the child like the plastic ones do. It has toys that come off to clean and to play with. If one gets away they float so it’s easy enough to retrieve. I move the overhead screen as we walk around the pool to shade fro the sun. It moves easily. It’s still advised to wear sunscreen and long sleeve bathing top. I would buy this again. For gifts and if I needed another. I highly recommend it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Shetter",
      "helpful_votes": 2,
      "publication_date": 20180806
    },
    {
      "title": "A Hole",
      "text": "I’m so sad , there was a hole :( I was really looking forward to using this for my baby . I wish I could get a refund",
      "rating": 1.0,
      "verified": true,
      "author": "Latinarose",
      "helpful_votes": 5,
      "publication_date": 20190402
    },
    {
      "title": "Do your research",
      "text": "Pros: Like the canopy to protect from the sun, like that we finally got our son a float, our son loved the toys that came with it. Cons: You have to be careful baby can still get to the water others informed us you could tie a pool noodle around it but not sure how so he isn't so much into the water. So for that reason we only use it a few mins in the water before we just end up holding him. Our son is on the tall side he is 9 months in the 85% tile and he's about 23 lbs for readers to take into consideration when purchasing.",
      "rating": 2.0,
      "verified": true,
      "author": "Mrs.Ramsey",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Portable!",
      "text": "This float is awesome; especially for travelling purposes. It folds and unfolds in seconds and is very compact and quick to inflate! I take it to the community pool, family pools, and to our friends house. The toys it comes with are just a bonus that my kiddo loves (:",
      "rating": 5.0,
      "verified": true,
      "author": "Ashlie",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Is a pain but does what it's supposed to",
      "text": "This thing was so hard to get blown up. We left it blown up for other uses in the summer since it was so difficult. Then when we went to let the air out to actually put it up, it didn't want to come out, you have to squeeze the life out of it basically. And it didn't want to fold back. I don't think we will be using it again. The seat part of it is huge and I had to tie off a bit. It does float good and does what it's supposed to, it's just a pain.",
      "rating": 3.0,
      "verified": true,
      "author": "Elecia Cox",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Very happy little fishy",
      "text": "I LOVE this. I don't write reviews often, but this merits 5 stars. I had a similar float for my daughter, but it never held her upright and the toys constantly floated away. This one is much more stable and the toys stay close at hand. I really like the adjustable sun shield. After our first weekend of swimming, I am sure this will be a staple of our summer. My son floated happily for a long time and had a blast. Absolutely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura H.",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "The best floarer EVER!!",
      "text": "Hands down the best floating device for infants. My baby was just 3 months when I purchased. You place the baby in it and they can littleraly float by themselves. Not advising to leave baby along but the point is that you dont have to reposition the baby at all. They are happy and very well safe in the floater. One of my best baby purchases. The roof is great. It can be moved with super ease to block the sun. The toys are cute and good for the pool. Easy to fold and store after using it too.",
      "rating": 5.0,
      "verified": true,
      "author": "amanda",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Extremely comfortable for infant",
      "text": "We purchased this for our 3-4 month old (so below the age limit). He did fit in here fine but there is definitely room to grow. With proper supervision, this inflatable is perfect for infants. Mine fell asleep in it, so either he loves it or was so terrified he passed out. It also holds our drinks nicely (and is shielded from the hot sun) when the infant is no longer using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "LOVE THIS! Works great for my 3 month old ...",
      "text": "LOVE THIS! Works great for my 3 month old - have been using it since he was 2 and 1/2 months - for now I lay a towel across the top and he gets to feel the cool water in the towel while still getting a shady ride in the pool! The seat sits a little deep - but again he is young. It will fit him perfectly by the time he is 3 and 1/2 to 4 months!",
      "rating": 5.0,
      "verified": true,
      "author": "Autumn Birch",
      "helpful_votes": 2,
      "publication_date": 20180627
    },
    {
      "title": "Perfect for the pool",
      "text": "Has been perfect for my 7 month old to use in the pool this summer. Love the sun shade, it’s adjustable or completely removable. Baby sits pretty deep in the seat so he stays about half submerged in the water, keeps him cool and he loves kicking his legs in the water. It is a little difficult to get his legs in the mesh seat, usually takes two adults to get it done.",
      "rating": 5.0,
      "verified": true,
      "author": "mmancc11399",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Shade is nice - baby can escape",
      "text": "This is a cute float but my 9 month old son does not enjoy being in it. He even crawled out of it while in the pool. Also, he popped the octopus with his teeth after one use. The shade is really nice to keep a baby from getting burnt.",
      "rating": 3.0,
      "verified": true,
      "author": "Faith S.",
      "helpful_votes": 3,
      "publication_date": 20180714
    },
    {
      "title": "Great float",
      "text": "Overall this is a really great float. I love all the toys that come with it and the removable sun screen. It’s a cute design and we get lots of compliments. My son loves this float. The only problem we really had is that my son likes to lean over to splash the water, but that leads to water coming over the side ( yes it’s blown up all the way) and his face has gotten really close to going under a little ( we are always standing right by the float, playing with him just in case something happens). I still highly recommend this float and I know the older he gets the more we will like it.",
      "rating": 4.0,
      "verified": true,
      "author": "Benjamin Kelly",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Baby loved it. Stable float.",
      "text": "Great pool float. The mesh screen was nice (extra UV protection.) The included toys were fun for her to play with, although the inflatable \"octopus\" in the middle...not so much. It's just kind of there. Just like any swim ring with a \"pouch\" it's not always easy to get a chubby little baby in or out, but that's par for the course. Worked great and held air all season.",
      "rating": 5.0,
      "verified": true,
      "author": "FireMedic",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Super dangerous",
      "text": "Doesn't not have enough support to keep then baby's head above the water.",
      "rating": 1.0,
      "verified": true,
      "author": "llewis.fl",
      "helpful_votes": 9,
      "publication_date": 20171205
    },
    {
      "title": "Would recommend",
      "text": "Great floaty for baby. The sun protection works well. Quality, safe material. The 4 legged “octopus” is worthless because the added toys fall right off. And gets in the way of seeing babies face, threw that thing away but the rest of the product is great.",
      "rating": 4.0,
      "verified": true,
      "author": "Cel",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Good for 6 months prob",
      "text": "Bought for 3 month old. She’s not tall or long enough I guess to sit up comfortably in it yet. Or maybe it’s just for bigger babies like 6 month olds+ we had to hold her up from underneath, because the angle of the seat makes her lean back her head was close to the water. I think it’ll be fun for her when she’s older. She’s 12 pounds now. Only stayed in pool 10 mins bcs got tired of holding her up.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "6 Month Old Loved It",
      "text": "Our baby loved this floatie, it has a nice wide base so it's very stable. The sunshade is nice too but I also had a hat on the babe for some extra protection from the sun. My baby is small for her age, she has very good neck control and can sit up on her own and had no problem using the device. That said, I bet a younger baby could be comfortable in here as well as long as a caregiver is helping to support.",
      "rating": 5.0,
      "verified": true,
      "author": "MD501",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Doesn't really float the baby, his face is still ...",
      "text": "Doesn't really float the baby, his face is still way too close to the water, my baby swallowed water and choked the first time using this, and its very difficult to get his legs through the holes, Im just going to buy a straight up inflatable baby tuby.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20170621
    },
    {
      "title": "Baby is better off in your arms",
      "text": "Toys - Are horribly made, my daughter is teething and bit through the foamy toys it provides. Star toy- Observes tons of water which consequently has your baby drinking pool water. The float- is designed cute, my baby was able to push herself off the float at 10 months. The only way to feel safe is to actually stay holding your baby at all times.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Great for babies!",
      "text": "This float is perfect for babies. At first when I ordered, I thought it was a bit overpriced, but honestly after a couple of uses, it’s well worth the money. It gives my baby the water experience while keeping him safe. He loves playing with the toys! We also love the shade that the float offers!",
      "rating": 5.0,
      "verified": true,
      "author": "Tara398",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Nope...wasted money. Go to Wal-Mart instead. 1st step water floaty is much better and cheaper!",
      "text": "Our baby is 11 months and this honestly didnt keep his face far from the water. He hated it. Used it once. Ended up spending $5 on a yellow baby float from walmart and he loved it! Sit him up farther out of the water. I would save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "A Salsman",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Best baby floatie out there!",
      "text": "Great for your baby! There is no way they can climb out of it. It collapses and stows away really nicely. You only need to inflate 2 small chambers, it's a piece of cake. The octopus thing on the front with the swim toys was a huge hit!! Love it! Even my 3 year old came over to borrow toys from the baby. I wouldn't be without this!",
      "rating": 5.0,
      "verified": true,
      "author": "Niraf",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Fun Water Float! A Summer Baby Must Have!!!",
      "text": "This is a must have this summer! I bought this for my 8 month old grandson's first trip to Sanibel FL. We've used it in the pool and he loves floating around in it. I love that it has a canopy is SPF 50 to help protect my grandsons skin. It travels very compact and super easy to blow up! The activity center on the front is an added bonus. My son and daughter in law loved my surprise purchase for our trip. It will get plenty of use!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine in CT",
      "helpful_votes": 2,
      "publication_date": 20170510
    },
    {
      "title": "Couldn’t even use it",
      "text": "We actually never got to use it. The product’s valve comes sealed so basically you have to make a puncture to fill air and that is so tricky. In spite of me being very cautious the hole came through the actual tube leaving it useless!! 2 stars coz my kid uses the toys that came with it and they are cute.",
      "rating": 2.0,
      "verified": true,
      "author": "Anu Ajith",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Awesome for baby’s first pool experience!",
      "text": "Bought this for my 10 month old to go in the pool. She LOVED this float, and had a wonderful introduction to swimming. She played with all of the toys and loved just relaxing in this. It does gold right back back down easily. One note is that I found it had better sun protection when I didn’t snap the back snap on the shade. Instead I let it just stay upright like a beach umbrella and that provided awesome shade. Very happy with this purchase and you can’t beat the reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "LISA WANGELIN",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Not recommended",
      "text": "My little one is 16lbs and petite. The shade doesnt stay up and doesnt cover her when it is up. When she sits in the seat, doesnt hold her up and she falls forward into the puddle of water that has formed. Inflating is easy, but doesnt blow up as much as expected. Storing is not easy. Would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "HapEvaAfter",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Large Legs (Thighs)Can Get Stuck! 😲",
      "text": "Age span is off. My daughter just turned 10 months 5 days ago. She is a bigger child at 25 lbs. Her thigh got caught in the leg part when taking her out. It left a large mark. I was shocked & she was screaming. Large legged children do not bother. This is geared towards a thin or average size baby. Large should not attempt. Change the age span or make the holes for legs stretchy. I was shocked it was not stretchable!",
      "rating": 1.0,
      "verified": true,
      "author": "KristenJeni",
      "helpful_votes": 2,
      "publication_date": 20190727
    },
    {
      "title": "Works well but",
      "text": "It wasnt easy to inflate, i used a manual inflator, didnt work well. Had to do it by mouth, and it wasnt easy, the sun protection only good for straight up, when its in a angle (when the sun coming down), it doesnt work well. But it keeps the baby up and the toys are nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Most Amazing",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Super cute floatie BUT",
      "text": "Super cute floatie BUT it popped and ripped as soon as we inflated it so we weren’t able to enjoy it. It was the first time we used it too so that wasn’t fun... On the bright side it provided good sun protection and it comes with cute toys for baby to play with during pool times. Definitely returning and trying out another one.",
      "rating": 2.0,
      "verified": true,
      "author": "The Sloth Life",
      "helpful_votes": 2,
      "publication_date": 20190429
    },
    {
      "title": "Awesome baby float!",
      "text": "Absolutely love this infant float. Used it for my one year old. He loves it! I love the added shade! Very easy in inflate, not the easiest to fold back up but we just leave it open on the boat. Keep your hands on baby at all times though as this is not a life saving device!",
      "rating": 5.0,
      "verified": true,
      "author": "Kasie",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Must buy for first time water experience.",
      "text": "Got this for my LO for a family vacation when she was 10 months old. It was her first pool/water experience and she loved it. I loved the shade. Negatives- she would try to (and could) drink the pool water. But I can’t hold that against the float! Also, she loved it too much and would cry and throw a fit when we took her out. She enjoyed just sitting in it and pretending to be in the pool in the hotel room.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 4,
      "publication_date": 20180102
    },
    {
      "title": "Would purchase again",
      "text": "I loved this for our 6 months old. It inflated quickly and folded back down flat when time to travel back home. The toys were great and kept my little one entertained. The sunshade worked great and stayed in place. The only con was that my son sat lower in the seat than I would have preferred. But I used a hair tie to tie the bottom so he wouldn't sit as low in the water.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Perfect for the baby",
      "text": "We got in the pool each day practically right after breakfast and we would play volley ball and all kinds of stuff and in about 1.5-2 hours the baby would be sleep. he didn't lip forward . often held his head back the sun shade kept him from burning. I would definitely get this for any kids. soon as you guys start making adults one let me know lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Candy EO 825",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Incorrect Fit",
      "text": "When you put the baby in the float , the baby sits really low compared to other floats I have purchased.",
      "rating": 1.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 2,
      "publication_date": 20190602
    },
    {
      "title": "No seat straps, but cute toys",
      "text": "While I love the toys that come with this float, they tend to fall off. My son just chews on the blow up thing instead. There is NO adjustment strap under the seat so good luck with your little babies. If your baby is maybe 9month+ then I would recommend this float.",
      "rating": 3.0,
      "verified": true,
      "author": "McClain",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Sons loves it and great for pull days",
      "text": "My son loves this thing and really enjoys the water. There is not always great protection from the sun and (my son) does like to lean forward but as a good parent we do watch him carefully when he is in the water. Easy to blow up and use I would recommend",
      "rating": 4.0,
      "verified": true,
      "author": "Quaid",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "High quaity floating in any environment",
      "text": "We've tried out a lot of baby floaties and this is the one that definitely outshines the rest on the market; not sure how I feel about an octopus with only 4 legs though. The inflation process is easy, but I recommend using a pump (don't try to blow into it--you will probably pass out), and it's a versatile product that allows for children to lie back and sit up in the water. We've never felt uncomfortable with the safety of this product since the surface area is so large. It's foldable and great for travel as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Not worth the money disappointed",
      "text": "The cover doesn’t really protect against sun, it has a cheap metal frame and it’s junk Doesn’t come anywhere close to giving the baby protection on a floaty in the poolThe accessories that come with for the float are nice and fun for baby the float itself is OK for the amount that I paid for it I think it would’ve been better to get a cheaper $15 one at Walmart",
      "rating": 3.0,
      "verified": true,
      "author": "JEstelle",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Not impressed",
      "text": "Not impressed. The cover did not block the sun unless my baby's back was to the sun- only at a specific angle that didn't last as soon as she floated a but. The toys feel off the octopus right away. It was easy to blow up though. Would not purchase again.",
      "rating": 2.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "6 month old sinks",
      "text": "Our 6 month old sinks into this. Forward or backward. Not totally convinced it’s the best purchase till a child is MUCH older. We use our arm to hold him up while he’s in it. Otherwise he will go under.",
      "rating": 3.0,
      "verified": true,
      "author": "JenniferTop Contributor: Baby",
      "helpful_votes": 2,
      "publication_date": 20180806
    },
    {
      "title": "Great way to introduce 1 year old to the pool",
      "text": "My 1 year old loves this float. We used it the first time she got into a pool and it worked well. It allows her to practice kicking with her legs and to splash a little with her hands. It appears to be very safe; however, she does occasionally pull up on the front edge of the raft and pull herself forward out of the seat a little.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorsey Ladson",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Perfect for a 1 year old",
      "text": "We, like everyone else, decided to get a pool this year. This was a perfect thing to get our daughter in the pool safely with our other kids. We were in the pool too, which I would recommend. It floats nicely, provides shade, and a few toys are a plus.",
      "rating": 5.0,
      "verified": true,
      "author": "NC Guy",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Great pool floatee",
      "text": "Our 10 month old nephew loved floating in this in the pool on vacation. It was a little harder than we expected to blow up. You had to pinch the little rubber part in an exact place, but then it blew up easily. The octopus activity center was great, but we unattached it from the floatee since he wasn't big enough to be able to see over it. Overall, great purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Ann Marie Norrid",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Love",
      "text": "My son loves this pool float. We got so many complaints on it at the pool. There are two things I wish were better, the mesh seat is hard to get your kids feet in, because it moves around in the water, once their in, it's great. Two, while it does fold back up flat I wish it would fit back in it's case well. It would make storing it so much easier!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 2,
      "publication_date": 20170813
    },
    {
      "title": "I really want to love it.......",
      "text": "This device is beautiful and sturdy. The only issue I have is that we have used it maybe 5 times and my 8 month old knows how to climb out of it, and will not stay inside. There are no straps of buckles to hold him in there, so now it is a waste :(",
      "rating": 3.0,
      "verified": true,
      "author": "Charilynn",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Great Float",
      "text": "Although this is meant for older babies (9 months and up), I got it for my 3 month old. It’s been 1 month and he’s still using it and likes it. He cannot sit in it properly because he is too small and it is meant for older babies. But I lay him on top just fine. He is constantly supervised in it, so it is safe. I didn’t want to have to buy a float for this year and another one next year. This will work for multiple years!",
      "rating": 4.0,
      "verified": true,
      "author": "PinkDaisy",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Springs, Lakes, Pools",
      "text": "I wish we had this earlier! Went to a cold water springs in Florida (72 degree water)... put our 11 month old in, slooowwly, and she started to fuss a bit. After about 5 minutes, she was in and happy! We also got a baby wet suit to keep her warm in the cold water. Fantastic! Update: have been using it in pools, in lake Michigan and Lake Superior. She freakin loves it! Just be sure to have toys (rocks and driftwood work) so they don't just float there. Parts of the great Lakes are awesome because they stay shallow for so long, she can practice walking into the depths.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Cortado",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Loved it!",
      "text": "I absolutely love this floater! My 6 month old had a blast in it today. It was his first time and he loved it. After about 10 minutes though he wanted out but not too bad for his first time; he also liked the toys that came with it. It was easy to assemble and I love that it easily folds and comes in a travel bag. I didn’t let him sit by himself in it because the water did come a bit high since he is still a bit small but he loved me spinning him in it. At one point he laid back and seemed super relaxed. I absolutely love that it has a shade also!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Zambrano ",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "AMAZING",
      "text": "My son loves the water but every float we tried has failed until this. We used a hand pump it up and he loved it easy to keep them entertained and he played for 3 yrs!! It is just amazing quality and im just so happy with the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Alexis",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Great baby float",
      "text": "We used this float for a lazy river in Las Vegas. Our baby had so much fun playing in the water. The only reason I mark my review down on inflating the float is because it felt like it needed more air after manually blowing with my lungs. We took the float to an electric pump and it really added more air that we couldn’t manually do. I’d say the extra air from the pump was needed. The extra air provided more stability in the water.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Cole",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Works great for my 7 month old.",
      "text": "Overall, the float is great for my 7 month old. It feels durable and safe. Inflation was a bit tricky, and I could not get the float to fold back into the storage bag. They should have made the bag a lot bigger. Also, the company should make more designs because the two they have now are more for boys than girls.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith W.",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Shade works for covering the little one’s",
      "text": "I don’t know about security features there’s no seat belt lol but I hope everyone is watching there baby in it either way. My baby loved it. However I think it would deflate quickly or something that she was easily accessible to drink the water like she was low so definitely have to watch the little ones in there. But shade does work",
      "rating": 5.0,
      "verified": true,
      "author": "Desree",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Great Quality- Baby Loved it!",
      "text": "Comes in a really nice re-usable storage bag. Love the frog/toys in front because it gave him something to do while floating. Canopy can adjust to cover the back side, overhead, or face which is nice depending on where the sun is facing at the time. I used it for my son who is 7 months old (and very large for his age) and he fit just fine. I wouldn't recommend it for any baby under 20lbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke Erin Shufflebotham",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Not a good product",
      "text": "I bought this for our 14 month old to use during our Hawaii vacation. It came in a simple package which was great for packing so I didn't open it until Hawaii. The darn thing would not inflate. 3 of us tried for almost an hour. It's the worst product I've ever bought from Amazon. It's too bad because my Daughter could have really used it to protect her from the sun.",
      "rating": 1.0,
      "verified": true,
      "author": "Happy mommy",
      "helpful_votes": 12,
      "publication_date": 20150603
    },
    {
      "title": "Not enough sun protection",
      "text": "Item doesn’t provide good enough sun protection. It only covers the backside, so like the neck area, but doesn’t do a good job with helping cover the front area of the face. Also it doesn’t feel as secure as I’d like for it to be. I prefer to invest in a floater where I don’t have to worry too much about whether or not my baby will drown or fall or flip over.",
      "rating": 2.0,
      "verified": true,
      "author": "Kayten L.",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Cool float but safety concerns",
      "text": "This float has a canopy and toys to attach. Very cool. I had to exchange the first one I bought due an issue with a seam not sewn so it would not stay inflated. I received the replacement very fast. 2 days! This float stays inflated. Unfortunately the seat is sideways instead of forward facing. The toys can’t be reached easily but more importantly the sides don’t provide as much support to prevent being able to lean over faCe first in water. This float is very cool if quality could make sure it’s built properly before sending it to someone.",
      "rating": 2.0,
      "verified": true,
      "author": "EB",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Colorful, functional, and easy to store",
      "text": "This definitely surpassed my expectation. The inflation was a little tricky but not impossible and didn’t lose any inflation over time. The attachments were cute and my little one definitely enjoyed the toys. Love the design and everything was a breeze to fold and put away!",
      "rating": 4.0,
      "verified": true,
      "author": "Isquared",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "great for private pools",
      "text": "Brought for my Grandson for the pool was to be used at out local public pool but the rules changed & now the public pool does not allow any floaties even these for babies so that was a bummer but he still got to use it at a friend's pool",
      "rating": 5.0,
      "verified": true,
      "author": "Gspluvr",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Great product",
      "text": "Needed this for our grandchildren who come to vist. Perfect. We had another brand that broke within a week, then they sent another one, that lasted 2 weeks. This is a good product",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas W. Rowan",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Suck to inflate, but amazing otherwise!",
      "text": "Pain in the butt to inflate, but such a great purchase regardless. My extremely independent daughter LOVES this float and I love that she can safely be in the water without my holding her (although I'm always directly next to her). The float is comfy and the shade can be repositioned or removed if needed. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Not as impressed. NEEDS more stability for child's safety",
      "text": "Doesn't keep baby as supported as you'd hope. Lots of titling baby forward and possibly drowning or dry drowning. The mesh bottom could be smaller and the opening where baby sits could be smaller. The air filled tubing could also be bigger to allow more safety for the baby.",
      "rating": 3.0,
      "verified": true,
      "author": "Alisha",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Excellent choice",
      "text": "I am delighted with the float ... perfect for my baby since 6 months I started using it and even after a year it remains intact and functional. The baby can play freely in the water and with adults interact and all share in the water happy and hands-free. I recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "Cristi fernandez",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Worth every  penny!",
      "text": "Worth every penny! Took this on a week long vacation to Hawaii, used it every single day at the pool or in the ocean with my 5 mo old. It also served as a perfect shady spot for naps. The little toys that were included kept her entertained in the car-- best money I've spent in a while! Packed back into its little bag for the next adventure. Amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "AlaskaGrown",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "not sitting high enough",
      "text": "I wish this product would allow my baby to sit up higher. I had to hold her the hole time because her mouth could go underwater if I didn't. She is 7 months old, and in the 60%ile, so it isn't like she is this very small baby. It may be perfect for taller babies.",
      "rating": 3.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Middle portion fills with water...",
      "text": "Cute float, but not functional for me. It is nice and wide, which is cool. However, a big downside is that the seat (middle portion) fills with water and my son swallowed a lot of it-several times. I would just be careful and keep a watchful eye on the child inside. A friend of mine bought the this, too, and said the same thing happened to her daughter. Found a much cheaper one that works much better. Just wish returns were free so I could get my money. It’s s lot of money down the drain for something I can’t use!",
      "rating": 2.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Love this",
      "text": "I bought this for my almost two year old. I blew it up at the beach and he floated in the lake without issue. Some of these rings don't hold kids up out of the water and they are falling with their face in the water. This, however, allowed my son to float without me holding him up. I would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Lopez",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Love this and the toys came with it",
      "text": "I went to my friends house and my son try this at their pool and absolutely LOVED it. So, I bought it and this is great because it comes with different toys that he can play on his bath as well. Definitely recommended and it’s worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rafaela ",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "a must buy",
      "text": "My son absolutely love this! Took him into the pool for the 1st time and he was laughing and kicking. He seemed like he was comfortable. Plenty of shade. Stays afloat nicely. Well worth the money. Perfect for summer",
      "rating": 5.0,
      "verified": true,
      "author": "STEPHANIE",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Great!",
      "text": "My 8 month old loves being in the pool. This float is very sturdy and I feel safe with him in in (and next to me of course). The sunshade isn’t huge so it doesn’t fully block the sun at midday but I just position it with his back to the sun and he’s fully shaded.",
      "rating": 5.0,
      "verified": true,
      "author": "sarah",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Good quality... Toys are great",
      "text": "Great for older infant 6+ month.... Sturdy and fun... Decent amount of shade but still has some sun.... Wish basket wasn't so big so baby didn't flop around in it. My son is 17 lbs and isn't able to sit straight up in it due to that.... so he will grow into it eventually which is fine... Always having to hold him erect so he doesn't fall backwards",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "I was looking for a fun float so I didn't have to hold my 6 ...",
      "text": "I was looking for a fun float so I didn't have to hold my 6 month old every single second we are in the pool. After reading the reviews, we decided in this float and are so happy we did. He is able to sit and float in this for a long time (under our constant supervision). He loves the octopus on the front and we love the canopy overhead. Our only (small) complaint is that the toys aren't attached and our son is constantly dropping them in the pool. Overall, a great product!",
      "rating": 4.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 2,
      "publication_date": 20150811
    },
    {
      "title": "very pleased",
      "text": "My son absolutely loves it! Very easy to put together, however I do wish where he sits it was slightly tighter. I have to stick a small peice if pool noodle so he sits up right",
      "rating": 5.0,
      "verified": true,
      "author": "danny",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Awesome infant floatie for my son who loves water.",
      "text": "Awesome infant floatie for my son who loves water. Since he’s still quite little at only 3 1/2 months I have to put a crescent shaped pillow behind him for extra support and hold him in place, but he’s going to really enjoy the freedom to wiggle around once he’s bugger.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda VanAmburg",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "The only good thing about it is the squeaky fish",
      "text": "Impossible to inflate!!! We had three people in the household try to inflate this thing with no success. The pump did not work either. Returning this product. The only good thing about it is the squeaky fish, the rest of the toys are useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Natalia Fischer",
      "helpful_votes": 9,
      "publication_date": 20170515
    },
    {
      "title": "Love this thing!",
      "text": "I love this float so much! My son is only 4 months old and the float works great as a float for him BUT what I use it most for is a comfortable shaded place to lay him down! I take this thing EVERYWHERE with me. It was great on the beach and also at the lake! Highly recommend! I couldn't figure out how to fold it at first and had to watch a you tube Video but once I figured it out it was so easy! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Leah Landis",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Highly recommend",
      "text": "Great float! Tried today right after receiving it and our 11 month son loved it! The toys are great additions to this already awesome float. We wish we had bought it sooner. If anything we didn’t like, the nub where you blow in air is a bit hard to grab. It took my husband a few more minutes to blow it up than we had thought but it wasn’t too annoying. For the joy we got out of it, the extre few minutes was totally worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "all4thecat",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "my DD LOVES this thing and so does Mama and Daddy",
      "text": "I have been using this thing since my baby was four months old. She sits in it with assistance under her bum, just fine. SHE LOVES IT!!!! I feel like she is safe and secure in this floatie and the canopy is wonderful. I live in AZ and this summer has been terrific for my DD. She loves the octopus and chomps on the tentacles every time she is in the pool. At four months old, she weighed 14lbs 12oz. She has excellent head and neck control.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany Mangan",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Ripped",
      "text": "The snaps that attach the sun shade ripped same day. The sun shade doesn't seem to actually shade him. My son is 8months old and bigger for his age and he sink in seat and water is almost up to his mouth. My son hates it and won't sit in it",
      "rating": 2.0,
      "verified": true,
      "author": "Tired RN",
      "helpful_votes": 0,
      "publication_date": 20190801
    }
  ],
  "product_meta": {
    "title": "SwimWays Baby Spring Float Activity Center with Canopy - Inflatable Float for Children with Interactive Toys and UPF Sun Protection - Blue/Green Octopus",
    "description": "Introduce your baby to the pool in the SwimWays Baby Spring Float Activity Center with Canopy baby float! The rotating octopus character on this baby floaty provides a focus for play with each octopus tentacle holding a toy that your baby can touch and activate: squeaker fish, stacking rings, fish teether, and soft touch star. Designed to provide a more comfortable and secure water introduction experience, the Baby Spring Float is the only pool float for babies with a patented inner spring sewn into the float all along the edge of the outermost inflation chamber underneath the fabric cover. This spring adds stability to the float in the water, giving you added peace of mind. The removable sun canopy offers a shady spot with UPF 50+ sun protection, and the mesh sides of the canopy allow you to maintain eye contact with your baby at every angle, so you never miss a smile or giggle. This brightly colored inflatable baby pool float has fabric-covered inflation for added durability and a soft mesh seat with leg holes for comfort. A wide base, child safety valves, and dual air chambers ensure security. The Baby Spring Float Activity Center folds flat into 3 compact circles making it a great choice for travel or trips to the neighborhood pool. Baby Spring Float makes a wonderful baby shower gift for new parents; giving parents the opportunity to bond with their child in the water as he or she grows. The SwimWays Baby Spring Float Activity Center with Canopy is part of the SwimWays Swim Steps learn to swim program. Swim Step 1 supports babies and toddlers as they are introduced to the water, helping them stay comfortable and happy. Includes a reusable carry bag. For babies age 9-24 months. Sold individually.\n\nFROM THE MANUFACTURER\nThis is the ultimate Baby Spring Float to introduce baby to the water, helping them stay comfortable and happy. All the features of the original Baby Spring Float plus more! This float includes a removable canopy and an octupus arm to hold babies toys in place!",
    "rating": 4.6,
    "feature_bullets": [
      "SWIM STEPS: Baby water float designed to help babies and parents relax and enjoy the water introduction experience",
      "INTERACTIVE: Adorable octopus turns 360 degrees around to face child. Its arms hold toys baby can touch and activate, including a squeaker, rattle, stacking rings, and soft touch star",
      "SAFETY MINDED: Features child safety valves, dual air chambers and a patented inner spring which gives greater stability in the water. Removable canopy has mesh sides and offers UPF 50+ sun protection",
      "PORTABLE: Folds easily for storage and transport in the included convenient carry case - it’s a great pool float for travel!",
      "DIMENSIONS: Measures 34\"L x 30\"W x 20.5\"H; Recommended for babies age 9-24 months; Toys include: 1 fish toy, 1 soft star, stacking rings, and 1 squeaker fish. Octopus and canopy are removable"
    ],
    "specifications": {
      "Product Dimensions": "13 x 13 x 3 inches",
      "Item Weight": "3.15 pounds",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "ASIN": "B000WQZD9U",
      "Item model number": "11601",
      "Manufacturer recommended age": "9 months - 2 years",
      "Best Sellers Rank": "#833 in Toys & Games",
      "Customer Reviews": "4.6 out of 5 stars4,403 ratings4.6 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "December 1, 2007",
      "Mfg Recommended age": "9 months - 2 years",
      "Manufacturer": "Swimways Far East Company Limited"
    },
    "categories": [
      "Baby Floats",
      "Pools & Water Toys",
      "Toys & Games",
      "Sports & Outdoor Play"
    ],
    "price": 25.1
  }
}