{
  "website_summaries": [
    {
      "verdict": "Leather gel cleaner from a well-known car-care-products manufacturer, available at a great, low price.",
      "pros": [
        "From a long-trusted name in automotive surface care is this effective leather formula in a flip-top bottle",
        "Gets rid of deeply ingrained dirt and soil on car interiors or furniture",
        "Conditions and revives suppleness while it cleans,  protects surfaces from harmful sun, heat, and humidity, and shields against future staining, cracking, fading, discoloration",
        "Very cost-effective, too"
      ],
      "cons": [
        "A few users didn't like the results achieved using this product, and one person didn't like the smell"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It works, happy with the results!",
      "text": "My dog decided to take a dive at a nearby lake, and when he jumped back into the car he was covered in mud. I bought this product after reading all the good reviews, and other customers are right: it works! My car seat is still \"work in progress\" since I still have some stains to remove, but comparing the before and after (just one application and minimum cleaning with a cloth 5 minutes later), I can see why this product is so popular!",
      "rating": 5.0,
      "verified": true,
      "author": "tf",
      "helpful_votes": 37,
      "publication_date": 20170120
    },
    {
      "title": "Very good conditioner and cleaner.  Easy to apply.",
      "text": "Have used a lot of leather conditioners. Some do one thing good, and others another thing. This conditioner does all things pretty well and is a very good all in one product. Good on conditioning and very gentle on the leather. Never had a problem with this. I apply it by hand and it is non irritating to my skin. Easy to apply this way and get into all the nooks of the seats and very easy to control. Squirt it right on the seats and work into leather by hand unless you are allergic to something in it. Let the leather take most of it up for a few minutes, and then wipe gently before it drys.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonian",
      "helpful_votes": 14,
      "publication_date": 20190328
    },
    {
      "title": "Best Auto Leather Cleaner/Conditioner",
      "text": "This is my favorite leather cleaner/conditioner. I detail cars as a side job and am a major neat freak and take great care of my own vehicles as well, and I only use this stuff. It lasts in the bottle for a long time and is easy to use, mess-free application as well. I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "FutureNow",
      "helpful_votes": 13,
      "publication_date": 20180421
    },
    {
      "title": "Thank you!!",
      "text": "One month after buying a new car, my cat peed in his carrier on the way to the vet. The interior of my car reeked! I tried all the basic fixes (baking soda, coffee grounds, etc.) and the smell stayed. Then I bought the Magic Carpet & Upholstery Cleaner. It was easy, fast-working, and didn't stain my seat (Toyota Corolla). I drove my friends around the next day and asked if they smelled anything funky... They all agreed it just smelled like new car! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Daniela",
      "helpful_votes": 10,
      "publication_date": 20180718
    },
    {
      "title": "Great leather conditioner",
      "text": "When I couldn't find this in the local WM I panicked and bought a couple of bottles here. I've found this to be a very effective leather treatment for the car. Seems to provide the right amount of moisturizers and conditioners to keep the leather from drying and cracking. Has a pleasant but not overpowering scent. Apply, rub it in, and let it be. No buffing or wipe off necessary. It refreshes the leather's color and suppleness but doesn't leave it greasy. It also works well with leather jackets!",
      "rating": 5.0,
      "verified": true,
      "author": "J. H.",
      "helpful_votes": 3,
      "publication_date": 20200211
    },
    {
      "title": "Amazing Product",
      "text": "This stuff was perfect, I had used a different cleaner to clean a stain in my car’s seat but it made the stain worse. This cleared it all up! I had to use it a few times cause mine were pretty bad. But, it looks SO good now! (I attached before and after photos - after photo has weird lighting.) i am going to use it one last time to try to get some of the lingering lighter stains, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 4,
      "publication_date": 20200522
    },
    {
      "title": "I love this, my friend got grease/oil off his jeans ...",
      "text": "I love this, my friend got grease/oil off his jeans on my passenger seat and all I had was this, with a little bit of scrubbing i was able to get it out into a micro fiber and get it just like new. Gets seats nice and clean, moisturized, and slick. People will be sliding around your car like it's covered in a layer of teflon! Use this and regular armor all to get close to that new-car smell.",
      "rating": 5.0,
      "verified": true,
      "author": "TobsG",
      "helpful_votes": 12,
      "publication_date": 20170421
    },
    {
      "title": "Remarkable !!  Beeswax must be the reason.",
      "text": "Used this new Armor All Leather care product with Beeswax. Best darn Leather care product I ever used. I like the idea of Beeswax being used too. I just ordered the same product in the Wipes.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Metaxas",
      "helpful_votes": 8,
      "publication_date": 20190505
    },
    {
      "title": "Works and keeps working...",
      "text": "My seats had icecream and other things spilt on them.... This worked well, though took a few applications to see much difference. However, I came back later and I guess sitting in the sun it continued to work. I wetted and wiped down the seats again and more dirt came up without even applying more of the product. I continued to apply, clean, and then re-clean after it had settled in. After a few sessions things were looking really good.",
      "rating": 5.0,
      "verified": true,
      "author": "A.",
      "helpful_votes": 4,
      "publication_date": 20181202
    },
    {
      "title": "Bummer!",
      "text": "Here is the thing... I received this product last night.. and the lid is completely busted and broken into several pieces. The top doesn't stay on at all. In fact it had sprayed out in the box. I tried returning the product to get a replacement... and it says its not eligible for a return. I order through Amazon very frequently. To get an order that comes broken is extremely frustrating when you cant return or get a replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "nikki",
      "helpful_votes": 3,
      "publication_date": 20190808
    },
    {
      "title": "Black upholstery in car",
      "text": "I used this in my black upholstery in my chevy cruze and I loved it. Makes my car look new again. Slightly werid scent but nothing over the top and can be easily masked with another spray but I accidentally used it on my steering wheel cover which is made of faux leather and it's slightly discolored now. Overall I would purchase again but bummed it's not safe for everything.",
      "rating": 4.0,
      "verified": true,
      "author": "julia miller",
      "helpful_votes": 7,
      "publication_date": 20180727
    },
    {
      "title": "Work's great!",
      "text": "Works great for my sofas and leather car upholstery. It's shiny when first applied and then has a matte finish.",
      "rating": 5.0,
      "verified": true,
      "author": "JTZ",
      "helpful_votes": 4,
      "publication_date": 20200113
    },
    {
      "title": "easy to use",
      "text": "Leather surfaces look more like leather brings out the goose bumps and natural leather look. I used on brand new car. absorbs into leather leaves seats grippy ( a good thing ) must be the bees wax. steering wheel was a little slippery but that seamed to ware off in one car ride.",
      "rating": 5.0,
      "verified": true,
      "author": "jeff",
      "helpful_votes": 2,
      "publication_date": 20200504
    },
    {
      "title": "Makes my leather seats happy",
      "text": "A good product. I used on the leather seats in my Avalon to try ans prevent cracking etc. Just squirt it on a towel, or directly on the leather like I did, and wipe. It doesnt make the seats too slippery or sticky. The smell is not overwhelming either. I condition the leather every other month or so to keep it in great shape. For around $5 a bottle this product is worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Izzybk42",
      "helpful_votes": 2,
      "publication_date": 20190828
    },
    {
      "title": "spray, wait, scrub, gone!",
      "text": "does a pretty darn good job and about to order my second bottle I have used this in my new car over the past year from stuff from food droppings, dogs, juice/milk from bottles leaking, etc and it pretty much has removed everything but one little spot. :( I have no clue what it was but it did fade it where you can hardly tell it's there. Since i am the owner i am probably the ONLY ONE can notice the spot lol spray it on and let it sit and give it a quick scrub and boom you are good to go",
      "rating": 5.0,
      "verified": true,
      "author": "Joe vs you",
      "helpful_votes": 9,
      "publication_date": 20160309
    },
    {
      "title": "Tackles tough stains on car seats",
      "text": "Bought this to remove a week-old coffee stain on my driver's seat, and also used it on a two-year old apple cider stain on the passenger seat. I was impressed by how much of the stain was actually removed, even the two-year stain! You should definitely let it sit for the recommended 3-5 minutes, and for older stains it's best to repeat the treatment. It's not perfect, of course, but for a relatively inexpensive DIY cleaning treatment, this is a good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 3,
      "publication_date": 20180630
    },
    {
      "title": "Bad Order",
      "text": "regards, I just received my order, which came this product without its lid, and I do not think I can use it that way. In the same way I got the T-Shirt of a very large size and chose the Size L and came very large Size XL. What can we do about it.",
      "rating": 1.0,
      "verified": true,
      "author": "Henry Marrero",
      "helpful_votes": 4,
      "publication_date": 20180912
    },
    {
      "title": "I buy this product every time; it's good",
      "text": "I use this once a month on my leather sofas and they look great. I get lots of comments on how good they look by visitors. The shine lasta about 10 days and then they still look \"OK\" until I reapply it each month. It's not greasy, applies and buffs easily (just a few seconds) with a paper towel or cotton rag. I always buy this product.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Armor All 18934 Leather Care with Beeswax, 16 fl. Oz",
      "text": "Armor All 18934 Leather Care with Beeswax, 16 fl. Oz, came in with head unscrewed/loose in a plastic bag in the Amazon Box, needless to say, what a Mess, missing liquid in the bottle!!! Liked a return of my money, not worth sending it back or replace it , since it may happens again. :(:(:(",
      "rating": 5.0,
      "verified": true,
      "author": "K. Kelley",
      "helpful_votes": 2,
      "publication_date": 20200420
    },
    {
      "title": "Okay, not great",
      "text": "I used this on my 14 year old SUV seats which are still in really good condition. Seems to work fine, but I needed to use a lot more than the small amount directed, so I don’t think it will last very long. It’s more like a cream than a gel. Needs to be reapplied frequently and the conditioning Isn’t very supple - more like a surface shine than a deep condition - hopefully that is enough to provide UV protection, tho. Not really much of a cleaner. Doesn’t have a strong or lingering smell.",
      "rating": 4.0,
      "verified": true,
      "author": "Psyche",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "The best product for leather, evvvvver!",
      "text": "I can not say enough good things about this product. First the smellS is AMAZING! And it helps to keep your seats clean for awhile with only one use. Small amount goes a long long way! It’s an incredible product and would recommend this to everyone. Love, love, love!",
      "rating": 5.0,
      "verified": true,
      "author": "K.lo",
      "helpful_votes": 2,
      "publication_date": 20200308
    },
    {
      "title": "Good Cleaner/Conditioner",
      "text": "Does the job well, easy to apply, penetrates and keeps leather clean and shiny, though not that shiny as some other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "amazonian",
      "helpful_votes": 7,
      "publication_date": 20171009
    },
    {
      "title": "Do not waste money.",
      "text": "This did not do the job for my carseats. My kids spilled some fast food in backseat and I spent money to get this product only to come out with a bigger stain. So I trashed it and got carseat covers.",
      "rating": 1.0,
      "verified": true,
      "author": "terri",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Cleans Leather, Non Drying",
      "text": "Works great on an oyster color leather sofa that gets daily use.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonnie Santos",
      "helpful_votes": 3,
      "publication_date": 20191109
    },
    {
      "title": "Works Well",
      "text": "I used this to clean my wife's 09 Prius. Some of the upholstery had been very dirty for a long time. I was impressed by how well it cleaned up old stained looking spots with just one or two rounds of scrubbing with this. Try to not get this on your skin though. I did and it irritated my skin for a few days, but that's probably why it works so well.",
      "rating": 5.0,
      "verified": true,
      "author": "don",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Has kept my leather arm chair in good condition.",
      "text": "When I purchased my first leather arm chair to make my allergy doctor happy I was advised to wipe it down with a leather conditioner and keep it out of the sun as much as possible. I studied all the leather cleaning products I could find and settled on this one. It hasn't let me down. After several years of use my chair is still soft, clean, and almost scratch free. This one seemed to be the most cost effective option. I'll buy another bottle when I use this one up.",
      "rating": 5.0,
      "verified": true,
      "author": "NLWPS of Amherst",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Works well, smells a bit like cinnamon",
      "text": "Worked well and it’s been 2 wks since I cleaned the car and it still looks clean with leather shiny! Didn’t leave a firm on your skin either which is nice! Only thing that was odd is it smelled like cinnamon so that was a bit strange as I thought it would smell like leather for a leather cleaner, it was a nice smell I just prefer leather smell but I bought spray and other leather scented items to keep it smelling new.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Amazing job of sorting and moisturizing the leather seats.",
      "text": "Excellent, only good things to say. This is my go to product to protect the leather seats in my and my wife’s cars.",
      "rating": 5.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Works!",
      "text": "It actually works! I didn’t have bad stains - just some spotting on the fabric near the top - above the door. I sprayed and left it. Almost gone so I sprayed again and lightly dabbed it with a cloth. I think they’re totally fine - or at least enough where I don’t notice them.",
      "rating": 5.0,
      "verified": true,
      "author": "OakParkMusicGuy",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Not worth the higher cost",
      "text": "Really do not think the \"beeswax\" is worth the extra money this product costs.",
      "rating": 3.0,
      "verified": true,
      "author": "marichal",
      "helpful_votes": 2,
      "publication_date": 20191211
    },
    {
      "title": "Smooth matte finish.",
      "text": "This is a good product if you don't want to have your leather seats with a glossy finish, kind of smooth matte finish. I used a microfiber cloth to apply this product and worked perfectly . I sprayed to the microfiber and applied it. Made the leather feel so much better and good looking afterwards.",
      "rating": 5.0,
      "verified": true,
      "author": "ERIC GURBUZ",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Not product i ordered",
      "text": "Why Did one box have the proper product i ordered and the other just orange bottles and it doesnt even smell the same? See pics",
      "rating": 1.0,
      "verified": true,
      "author": "53",
      "helpful_votes": 2,
      "publication_date": 20190601
    },
    {
      "title": "It worked!",
      "text": "It worked on my car seats that had grease and wine stains!",
      "rating": 5.0,
      "verified": true,
      "author": "arto4ever",
      "helpful_votes": 4,
      "publication_date": 20180920
    },
    {
      "title": "Just what we needed",
      "text": "Exactly what we needed for our car. We have a convertible and during the summer times, intense heat can dry up any leather. This was what we needed to keeping our interior looking nice and conditioned to maintain the leather for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Make your leather look new again",
      "text": "Use on our 12 year old leather sectional couches that are the play ground of dog and 4 cats. One of the best products I've encountered for leather. Easy to apply not greasy or sticky a d the results look great. And for the price I'd put it up against other products I've used costing considerably more and didnt yield half the results.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Kopin",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "It works!!",
      "text": "I love this product ! It is getting harder and harder to find it in the box stores! It cleans cloth seats like magic and the smell does not make you gasp for air! I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "donnamarie",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Leaking everywhere due to a broken seal.",
      "text": "Haven’t had a chance to use this product because when I received it, it was leaking badly. I thought it was just the nozzle but it turns out the seal along the long side of the bottle was broken. This is causing the bottle to leak like crazy. To put the cherry on this experience, while I was trying to figure out where the leak was and clean up the mess, the liquid started to burn my hands.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180417
    },
    {
      "title": "Good product does the job",
      "text": "Overall the product was efficient in it served his purpose a condition the product and it did not leave any stains I can definitely see the longevity and using this product have used it for a year-and-a-half with no issues",
      "rating": 5.0,
      "verified": true,
      "author": "N!",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Largely, but not perfectly effective",
      "text": "Overall happy with the results of this spray; worked out most of the stains on my Toyota Corolla 2015's car seats. However, despite using much of the bottle, I did not manage to entirely work out the stains, to my disappointment. This spray is pretty good, it's just not magic, is all.",
      "rating": 4.0,
      "verified": true,
      "author": "gabe b.",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Super shiny",
      "text": "I use this for the leather seats in my car and it works great! I use a micro fiber washcloth and my seats look like they've just bee detailed. The scent isn't great, so I make sure im done using my car for the day. But definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Brittnie",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "On my second bottle because.....",
      "text": "This is literally food for Leather, it glows like baby skin. The leather instantly looks rich like new,I use it on all the leather items in the house and my car. Buy it you won’t regret!",
      "rating": 5.0,
      "verified": true,
      "author": "Honest reviewer",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Needs periodic applications",
      "text": "Tried mink oil, Coconut oil, Saddle soap, meguirs. This seems to be the best. But you do need to apply often to get the nice rich look. About every four months.",
      "rating": 4.0,
      "verified": true,
      "author": "Waiting to retire ",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Wonderful",
      "text": "Our leather recliner sofa is 5 years old and with 3 little puppies always on it, I had to protect the couch so that I can keep it for a long while. I applied it and the couch looks like brand new. I even did my purses and hubbies shoes and they look like new",
      "rating": 5.0,
      "verified": true,
      "author": "Anneliese",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Smells amazing",
      "text": "This product was amazing it cleaned and made my seat smell so good. I had childrens gunk all over my seats and this got it off without a problem. Was also every easy to use and the smell is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Braun",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Great for handbags, clutches, and wallets!",
      "text": "This may sound funny, but I use this to condition all of the canvas and vachetta on my Louis Vuitton pieces. It actually works beautifully and is much less expensive than some of the other products touted in designer bag circles.",
      "rating": 5.0,
      "verified": true,
      "author": "Bridget Pagano",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Worked well",
      "text": "Worked very well at getting the dirt stains off of my cream colored leather arm rest. Treated the rest of the car. The stuff smells good too and it’s not overwhelming.",
      "rating": 5.0,
      "verified": true,
      "author": "aronf_53",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Came with no cap",
      "text": "The bottle came with no cap. Just a protective seal. I ended up having to pour it all out into a Tupperware container and just store it that way. Product itself works well. Smell is ok, i preferred to leave my windows down the day i used it because it’s pretty strong.",
      "rating": 2.0,
      "verified": true,
      "author": "Helena Chamberlain",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Great product for car leather",
      "text": "I have used this product 3-4 times a year on my car’s black leather and it still looks brand new 10 years later. Easy to apply with applicator pad and has pleasant, clean scent.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Y.",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "It cleans and covers scratches!",
      "text": "I had a scratch on my leather in the car from the dogs. I don't see the scratch anymore after wiping it with this cleaner. I just don't like the scent. It's a little to perfumed for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Guadalupe B.",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Made A Believer Out of Me!",
      "text": "So many companies promote products with a promise to deliver a certain service. This one makes good on that promise. Shocked the daylights out of me! It removed some stains in my car upholstery that had been there for a significant amount of time. This is a product I will always have on hand as one of my every day cleaning products. I will be ordering this one again....already created my Dash button. 😊",
      "rating": 5.0,
      "verified": true,
      "author": "B. White",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "This stuff is great on leather!",
      "text": "My vehicle is 7 years old and the leather looks new thanks to this stuff. Tried a lot of more expensive leather conditions but this stuff is the best. Also gives a bit of new car smell once you apply it. I try to apply it every 3 months. Works great!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Frugal George",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Made it worse",
      "text": "I wanted to love this, I love their leather cleaner, but this ended up staining my (cloth) seats worse than what I was trying to get out",
      "rating": 1.0,
      "verified": true,
      "author": "Hryan",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Not just for cars!",
      "text": "Bought this for our leather seats in the cars, but then used it on our leather couches - AMAZING! Not only does our full hide, twenty plus year old couch, chair and ottoman suck up the lotion and immediately feel more supple, but our hands get really soft! Nice, subtle lanolin fragrance to it.",
      "rating": 5.0,
      "verified": true,
      "author": "Monica S",
      "helpful_votes": 5,
      "publication_date": 20160207
    },
    {
      "title": "Voodoo Juice",
      "text": "My neighbor turned me on to this stuff. Gets out stains in my carpet that I never thought would come out. I just got a truck that in a previous life was a farm truck. This took the mud, dirt, and even tar (yes tar) right out with some elbow grease.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard B",
      "helpful_votes": 6,
      "publication_date": 20160309
    },
    {
      "title": "Best leather cleaner I've ever tried !",
      "text": "This stuff is amazing. Cleaned the leather seats on my 2013 Ford Edge and they look and feel great ! They look nourished and shiny, I think its the beewax the makes the difference. It smell yummy too ! .",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio Menendez",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Love this stuff",
      "text": "Great cleaner for leather seats and leaves a nice clean fragrance in vehicle. Works good on the dash as well. Use all of the time! Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "lots of bang for the buck",
      "text": "I love this stuff so far. I love the way it smells, too. I will be buying more. I used it on a very old tapestry which I was pleased with how well it worked and how safe it was to the material. It cleans nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "connie",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Good enough",
      "text": "Good to just spray on and use with a leather brush then wipe off. Seems to make leather look a bit newer again and keep it clean.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazonian",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Removes Stains on car seat",
      "text": "My car's seat had a quagmire of stains on them. I sprayed each one, rubbed it in with a brush, blotted with a microfiber towel, and let them air dry. All of the stains completely disappeared. Amazing! Will purchase again, thanks Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "J.",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Good stuff",
      "text": "I love this stuff. Keeps the color of my jeans from rubbing off on my seats. Also keeps my leather from drying out. I have been using it for many many years and keep buying more",
      "rating": 5.0,
      "verified": true,
      "author": "C. Norment",
      "helpful_votes": 3,
      "publication_date": 20170812
    },
    {
      "title": "Strong chemical scent",
      "text": "Arrived without packaging, which is super weird. It was in the orange bottle, but no label. The smell is very strong and very chemically. It did shine up my leather, but also left it super slippery. Would not buy again and I already tossed it.",
      "rating": 1.0,
      "verified": true,
      "author": "3PugzTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Spots GONE!!",
      "text": "We had an inconvenient coffee spill...on a white rug...and tried everything. Nothing worked. Ordered Armor All and happy day! The spots are gone! Spritz and the problem is gone.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Smells nice",
      "text": "Would buy it again. You can see it is high quality",
      "rating": 5.0,
      "verified": true,
      "author": "AK",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Works really good.",
      "text": "It works really well. I used it for my car seats. Spray it evenly, let it soak in and scrub dry with a clean towel.",
      "rating": 5.0,
      "verified": true,
      "author": "Juan Mendoza",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "No lid!",
      "text": "I received this order today but there was no lid. It will be a pain to use and store without a kid, so I will be returning. I've used this before, so I know that too expect, in the actual product but very disappointed it did not come with a lid.",
      "rating": 2.0,
      "verified": true,
      "author": "BRM",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Love the product",
      "text": "I put on both of my cars with leather seats and on my leather couches. This leather care gel makes the leather very slippery but it feels much better and cleaner. This is also a very useable amount of gel.",
      "rating": 5.0,
      "verified": true,
      "author": "zydrunas dinsmonas",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "It Works!!!",
      "text": "I had a stain on my couch and it definitely lighting it. I would give it more stars but I’ll wait until I tackle the seats in my car!!! Stay tuned....",
      "rating": 3.0,
      "verified": true,
      "author": "SoulGoddess",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Instructions",
      "text": "Bottle leaked and washed out the label and all instructions",
      "rating": 1.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Well conditioned leather car seats.",
      "text": "Product seems to work well at keeping the my leather car seats in good shape and well conditioned. I’m not sure if this is the same product my grandpa used to use in his car but the scent brought back nostalgic memories of riding with him.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Looks great, feels great, smells amazing! Really works to soften and preserve leather.",
      "text": "Good stuff! Use on my Boxster seats once or twice a month. Makes the leather look and smell like new. Easy to apply and doesn’t leave a sticky residue. Dries quickly and lasts for weeks. Smells amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "ZF",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Go-to for 10+ years",
      "text": "This stuff is great. Use it on every cloth interior & fabric accoutrement. Avoid contact with leather and promptly wipe from plastics. Follow up with a steam/carpet cleaner attachment before drying. Definitely read the side of the can!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Outstanding for the price",
      "text": "Puts a nice richer black on my black leather seats. They look years newer and has a nice smell to it also!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaredz",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Good cleaner",
      "text": "Wasn't huge fan of the smell but it honestly cleans the best out of several others I've tried in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "CASSANDRA RICE",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Scent doesn’t smell premium...",
      "text": "It did a decent job, But the scent is so bad!!! Now my car smells like a strip club... :(",
      "rating": 3.0,
      "verified": true,
      "author": "calidoscopio",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Adds stains rather than removing them",
      "text": "Tried using this on my car seat. I followed the directions, but it ended up adding stains to the car seat.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark T",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Recommend",
      "text": "Works great. Been using this product for years on not only my car leather seats but my living room leather. Keeps the leather soft and clean.",
      "rating": 5.0,
      "verified": true,
      "author": "bourbonthedog",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "So so.",
      "text": "Compared to other similar products I have used, I cannot say that this is any better. It seems to float on the surface of my leather seats, not absorb into the grain.",
      "rating": 3.0,
      "verified": true,
      "author": "C.P.",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "So-do product",
      "text": "I certainly have used better leather care products. Not the best. Seems more like rubbing regular silicone based Armorall on the leather if you ask me.",
      "rating": 3.0,
      "verified": true,
      "author": "James R. Starkey",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Must have in your car",
      "text": "Works really good on my carseats and on carpet. I did a color test first to make sure it wouldnt mess up my black seats. It did great",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey K",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Leather looks great, really lasts",
      "text": "I was previously using this leather cleaner & conditioner for my car seats. But they ended up looking even drier than before I used it. Purchases this product, and the seats not only look great, but it really lasts a long time on the seats without being greasy feeling.",
      "rating": 5.0,
      "verified": true,
      "author": "Marissa J.",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Awesome leather conditioner/cleaner!",
      "text": "Stuff is incredible on leather and smells terrific. Think I am hooked!",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia Roethlisberger",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Makes my shoes and bags look like new!",
      "text": "This product is easy to apply and made my shoes and bags look great. A little goes a long way too so this bottle will probably last me a while!",
      "rating": 5.0,
      "verified": true,
      "author": "E T",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Does not work well on car upholstery",
      "text": "I bought this to clean my car upholstery. Did not work well at all. Left it looking worse than before cleaning.",
      "rating": 3.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Worthy",
      "text": "This item is better than some other products i have purchased/used in the past",
      "rating": 5.0,
      "verified": true,
      "author": "annapolian",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "It is an ok product",
      "text": "It does not shine enough. But overall it is an ok leather spray.",
      "rating": 3.0,
      "verified": true,
      "author": "Onur Arca",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Works Great",
      "text": "Even though I have nothing to compare with, this works very well on my leather planner binders, especially the vintage ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcy",
      "helpful_votes": 2,
      "publication_date": 20171202
    },
    {
      "title": "Shipped without labels!",
      "text": "This was delivered without any stickers or labeling on the bottle! I'm pretty sure it's the right product but it's just a blank bottle.",
      "rating": 1.0,
      "verified": true,
      "author": "AndrewB",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Smells amazing",
      "text": "This product smells amazing and it’s not oily. I like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sanjin Agic",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Works great!",
      "text": "I had a set in coffee stain on my car seat and this took it out in 5 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Berlin",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Works Great",
      "text": "Works like I expected it. Got the stains out after a few applications.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Waters",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "This is the best leather care. I have tried many. have to buy online now.",
      "text": "This is the best leather care. I have tried many. have to buy online now.",
      "rating": 5.0,
      "verified": true,
      "author": "nonameguy",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Great!",
      "text": "I'm buying this over and over for my car leather.",
      "rating": 5.0,
      "verified": true,
      "author": "John C",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Works great.",
      "text": "It smells a little funny however it’s not very noticeable after a day or two. My 13 year old leather car seats look great. No residue left over. Lots of it for the money too",
      "rating": 5.0,
      "verified": true,
      "author": "ccdizzled",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "no streaks",
      "text": "cleaned car seats after a beach day, solid job cleaning and nice scent",
      "rating": 5.0,
      "verified": true,
      "author": "DhungJoo Kim",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Looks",
      "text": "This was easy to apply but doesn't look very good. Smear lines and uneven even though I tried everything to balance out how it looked.",
      "rating": 3.0,
      "verified": true,
      "author": "AJ Clay",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Gets the spots out",
      "text": "This stuff works awesome. My lady always spills coffee in the car and this got it right out.",
      "rating": 5.0,
      "verified": true,
      "author": "Colin R.",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Fine for water marks I guess",
      "text": "This did virtually nothing on general staining in car upholstery but did ok for water marks on the seats. Waste of effort.",
      "rating": 2.0,
      "verified": true,
      "author": "Garin Hatch",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Not good for a Kia Soul",
      "text": "This stuff messed up my leather seats in my Kia Soul, it has stains now from this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Great product",
      "text": "Makes my leather seats feel like new again on a 15 year old car.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis T.",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Upholstery magic",
      "text": "This worked perfect. A Youtuber suggested it and it worked better than expected",
      "rating": 5.0,
      "verified": true,
      "author": "Louise bailey",
      "helpful_votes": 0,
      "publication_date": 20191206
    }
  ],
  "product_meta": {
    "title": "Armor All Car Leather Conditioner Gel, Interior Cleaner for Cars, Truck and Motorcycle, Cleans and Conditions, 18 Fl Oz, 9963",
    "description": "Style:Leather Gel (1 Pack)Fine leather requires special attention and care, especially when it’s subjected to the intense sun, heat and humidity in your car. Our rich, luxurious Leather Care Gel pampers and conditions fine leathers to protect and preserve their rich, supple, natural appearance. Our advanced leather formula!",
    "rating": 4.6,
    "feature_bullets": [
      "Cleans, conditions and protects leather",
      "Cleansing Agents reach into the grain of the leather to remove dirt and soil",
      "Conditioners enhance leather’s rich, natural beauty and restore its supple feel",
      "Powerful Blocking Agents help protect against spills, stains, cracking, fading, discoloration and premature aging",
      "Pampers and conditions fine leathers"
    ],
    "specifications": {
      "Manufacturer": "Armor All",
      "Brand": "Armor All",
      "Model": "Car Leather Conditioner Gel",
      "Item Weight": "1.17 pounds",
      "Product Dimensions": "3.54 x 4.33 x 7.48 inches",
      "Item model number": "9963",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "10961",
      "Folding": "No",
      "Cover Included": "LEATHER GEL",
      "ASIN": "B0002JSZ8I",
      "Customer Reviews": "4.6 out of 5 stars726 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#1,636 in Automotive",
      "Date First Available": "July 7, 2004"
    },
    "categories": [
      "Car Care",
      "Automotive Parts & Accessories",
      "Interior Care",
      "Leather Care",
      "Automotive"
    ],
    "price": 6.44
  }
}