{
  "website_summaries": [
    {
      "verdict": "Also suited for outdoor sport use. Despite ventilation, some fogging is still possible. Combine with an elastic sunglasses strap for maximum security and comfort. Excellent price point.",
      "pros": [
        "Clear or dark lens options for different purposes",
        "Bridge is rubber-tipped and adjustable for improved comfort",
        "Ventilated to reduce fogging"
      ],
      "cons": [
        "Frames may have some unfinished, abrasive areas",
        "Lenses are prone to scratch damage and can distort user's vision slightly",
        "Fit isn't snug, especially for smaller users"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Part of my PPE",
      "text": "I needed a pair for work badly due to I work on a Covid floor. They are comfortable pretty slick style and easy to clean and doesn’t get in the way with the other PPE that I have to wear. They do fog up if you don’t put your mask on right however they are essential and one of the items that is protecting me from this deadly virus. My co worker has a pair of Oakleys that is 4 times the price and look almost exactly the same. Thank you so so much!!! Mahalo. 🤙🏾",
      "rating": 5.0,
      "verified": true,
      "author": "V. Garcia",
      "helpful_votes": 28,
      "publication_date": 20200517
    },
    {
      "title": "Great so far!",
      "text": "I'm a surgical tech student so I wear a surgical mask to my lab class. This means A TON of fog diverting up into the glasses and this is the third time I've had to buy eyewear because the other 2 so called antifog and anti scratch pair were TERRIBLE even though they had good reviews. Just tried these on in lab today and I've never been able to see so clearly! Not even a little bit of fog. Not sure if that will wear off over time, but so far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Keslee Anderson",
      "helpful_votes": 28,
      "publication_date": 20170906
    },
    {
      "title": "great fit and comfortable",
      "text": "I use these are my eye protection while working with COVID patients. There is good coverage for my face, and minimal gaps, and my eyelashes don't bat up against the lens which they do for other glasses. When you wear them for hours at a time, there is a little glare from lights on the sides of the goggles, that are a little distracting when you walk around or turn your head. So, in hindsight, I should have found a pair with anti-glare coating, but these fit so well, that I will suck that up.",
      "rating": 5.0,
      "verified": true,
      "author": "Betty",
      "helpful_votes": 3,
      "publication_date": 20200618
    },
    {
      "title": "Won’t buy them again.",
      "text": "If the bridge of your nose is narrow, you might look at a different pair of safety glasses. I have that narrow bridge, and won’t be buying these again. I also find that the temples (stems) arc out enough that they interfere with the seal of my Peltor muffs. I also bought a pair of Dewalt Dominator glasses and they don’t have these problems. They will be my new standard.",
      "rating": 2.0,
      "verified": true,
      "author": "Geoff",
      "helpful_votes": 4,
      "publication_date": 20190727
    },
    {
      "title": "ok glasses",
      "text": "they advertise that they are \"anti-fog\" - um not true especially when wearing a mask. As a hospital worker, I need to have my eyes covered at all times when dealing with patients. I purchased these because of what the product boasted about, only they fell a little short. When they do fog up, they also become dirty. Frustrated, but better then what the hospital gives us to wear.",
      "rating": 3.0,
      "verified": true,
      "author": "Audrey Olson",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Nice produce, good value",
      "text": "I bought these for evening bike rides when it's too dark for sunglasses and I don't want gnats in my eyes. They are comfortable, don't fog up badly, great product at a cheap price. Comfort wise they are similar to Smith or oaskley sunglasses that I have had.",
      "rating": 5.0,
      "verified": true,
      "author": "luke",
      "helpful_votes": 2,
      "publication_date": 20200702
    },
    {
      "title": "Great clear eye protection",
      "text": "great lightweight eye pro. I bought a few of these just to leave around in my bags for shooting, as well as around the garage for general use. I actually also have a few pairs that I use for work (Healthcare worker). All in all, I probably have 5 or 6 pairs scattered around my locker and home. Doesn't fog up easily, and when it does fog it clears very quickly also.",
      "rating": 5.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Great Glasses, Especially For The Price!",
      "text": "The build quality on these is fantastic! I am using these to replace an awful pair of Head racquetball glasses that costs 3x more than these.. Frankly, these seem better in every way. The plastic frame seems very high quality, like ABS plastic maybe? The nose piece is adjustable, and is made of the same type of rubber as the ear pieces. They're very comfortable and don't fog very much, thanks to the vented lenses. The only drawback is they have ever so slightly more glare than some of the higher end glasses I've owned, but to be honest, I'm really nitpicking. All in all, a fantastic purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 3,
      "publication_date": 20171031
    },
    {
      "title": "Nice",
      "text": "I needed them for work because I am a nurse and I work in a clinic around patients. These were nice looking but the best part was the price, $3.60. They're light weight and don't fog up.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs L.",
      "helpful_votes": 2,
      "publication_date": 20200804
    },
    {
      "title": "Great Glasses!",
      "text": "I bought these hoping that they would help with my dry eyes. The rec center where I play has blowers that make the dryness worse and causes blurred vision. I could see more clearly for the first hour but then some blurriness returned, so I can't say for sure they are 100 percent effective for this but there was a real improvement for a while. And no fog. Plus, they are comfortable and I feel confident that my eyes are protected. I would buy these again.",
      "rating": 4.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 2,
      "publication_date": 20170321
    },
    {
      "title": "Stylish and effective",
      "text": "Got two sets of these, one for me and one for my SO. She is interested in getting into shooting sports and for the price of these, it's so much better than having to rent or borrow some scratched up ones from the range. They fit well, are as stylish as a pair of eye protection can be, and fit under hard hearing protection without digging into the side of your face, which sometimes can happens with other brands. Worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Home&GardenGoods",
      "helpful_votes": 2,
      "publication_date": 20180329
    },
    {
      "title": "Very Good Glasses - House Flipper",
      "text": "I like these glasses alot. The blue lenses are fantastic. I can't attest to the protection factor as of yet but I can say that they are very comfortable to wear. I actually use them in low light driving conditions because they seem to really brighten up the view. Great price, great style and great all day comfort! I have purchased several different lens colors including very dark ( work as well as my un-polarized Oakleys). No discernible distortion. I highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve K",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "This is my second pair, the second pair disappoints",
      "text": "First pair was a great value. The anti-fog that worked... ...Second pair I ordered was advertised anti-fog, however it appears that I was sent a pair that has not been treated. Will be returning the second pair.",
      "rating": 3.0,
      "verified": true,
      "author": "Mr Pix",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Great goggles  for Nurses.",
      "text": "With the crisis were in right now it was very difficult to get face shields and masks. So these goggles with a home made face mask are better than nothing. The goggles themselves appear well made and so far are holding up with daily 12 hour shifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas G.",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Great Pair!",
      "text": "Great pair of safety glasses that I use for the range! They’re lightweight and give great coverage for eye protection. They also look stylish and don’t just look like plain ole safety glasses. The anti fog works great! Haven’t had any problems yet. I shoot at an outdoor range during midday so the sun is really beating down. I sweat a lot so having Anti fog is a big deal for me. Never fogged once yet. If you’re on the fence, get it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Hawaii Guy",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Great for sports",
      "text": "I bought these glasses for cycling and running when it's too dark for sunglasses but I still want to keep the wind off my eyes. They work just great for that. They're not super high quality, but they're really lightweight. I am very glad that I got them. I've gone on some runs at night and they've done awesome on those keeping the wind out but not tinting the night even darker as sunglasses would have done. And you can't beat the price.",
      "rating": 5.0,
      "verified": true,
      "author": "bisully",
      "helpful_votes": 23,
      "publication_date": 20130605
    },
    {
      "title": "My second favorite pair of safety glasses.",
      "text": "Feel sturdy, not too dark for in the shop work, but I like them best for yard work. I have a slightly narrower face (Pupil distance 64) and usually like a pretty tightly wrapped frame for safety frames. These work well without any adjustments to the fit, but I don't think these have any adjustable components anyway. I compared these against and, which I really loved.",
      "rating": 4.0,
      "verified": true,
      "author": "Thrifty American",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "Racquetball",
      "text": "I bought these specifically for playing racquetball. As I had read through other reviews, a few other people had mentioned they use these for racquetball. They are fantastic. They do not move around on my head; they stay perfectly in place. And the best part: They do not fog whatsoever!! And I mean zero fog. I play hard. I live in Louisiana and it is humid as hell here. Two hours at a time on the court multiple times over, zero fog. I couldn't recommend these for racquetball more. You won't be disappointed. I store them in a bag inside an empty racquetball sleeve. No scatches!",
      "rating": 5.0,
      "verified": true,
      "author": "hs0656",
      "helpful_votes": 0,
      "publication_date": 20160215
    },
    {
      "title": "Love These",
      "text": "Ended up buying a few different pairs of safety glasses after my last ones randomly disappeared and I would've been better off just getting a few pairs of these. I like them far more than the Dewalt ones. Will definitely plan on ordering more of these if this pair disappears like my AmazonBasics ones did...",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "They run small",
      "text": "These run small and the nose piece doesn't adjust. Didn't find them comfortable and I don't have a particularly large head or face; wouldn't buy again for that reason. The fog resistant lenses do seem fairly legit.",
      "rating": 3.0,
      "verified": true,
      "author": "rags",
      "helpful_votes": 3,
      "publication_date": 20180619
    },
    {
      "title": "One Year in and Still Great",
      "text": "I have owned my pair for a solid year of daily wear. That fit great, lightweight and does the job. I work in manufacturing and we don't necessary have objects flying at our faces daily, but, the risk is there so we are required to wear these. With that, these are perfect. In workplaces with heavy construction and such, I would be curious and question the durability on these glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Very comfortable, fog free & perfect tint for indoor/outdoor",
      "text": "THESE ARE THE BEST SAFETY GLASSES I'VE EVER HAD!!! And I've tried alot of them! Most of them have hurt my ears or scratched really easy, but not these! They are perfect! Great indoor/outdoor lenses, fog free & very comfortable!!! I'm a customer for life!!! Thanks Pyramex!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Lindon",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "High-quality product, great for all types of sports",
      "text": "I love these safety glasses. I decided I wanted to find some durable safety glasses for playing racquetball. The sports versions are pretty flimsy and cheap so I decided to look around. These are more comfortable and more durable than the racquetball goggles made purposely for Racketball.",
      "rating": 5.0,
      "verified": true,
      "author": "Bman in the Sunshine State",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Rubber pieces easily slide off; get lost",
      "text": "Pros: very comfortable, protect eyes well, seem to be strong, inexpensive Cons: the rubber nose piece and rubber ear guards are not glued on and they easily slide off. I ended up losing a piece and so I had to trash them. No good if you can't wear them. If you do buy them, through a little crazy glue on them to save you a headache.",
      "rating": 3.0,
      "verified": true,
      "author": "Mikey Cap",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Steamy",
      "text": "These are supposed to be \"fog free\" but they do steam up a bit. I push them down my nose a bit and that seems to help.",
      "rating": 4.0,
      "verified": true,
      "author": "booknerd74",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Wouldn't recommend these safety glasses",
      "text": "They're not very comfortable around the nose area for me and the parts that go behind the ears are not either, they're very slim and hard. They do not sit very close to the face either. One plus is I have noticed they do not scratch as easily as most cheap safely glasses do.",
      "rating": 3.0,
      "verified": true,
      "author": "kyle",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Good for antifog",
      "text": "These glasses are pretty good with not fogging but they do create condensation instead of the fog. Not bad though. I work in a cheese production factory packaging cheese for stores like Walmart and etc so when in the building it gets pretty chilly and now having to wear face masks with this covid going on I needed antifog glasses which our job does not provide.",
      "rating": 4.0,
      "verified": true,
      "author": "Heather E. Post",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Avoid",
      "text": "Very cheaply made. Gave me a headache because the lenses bent the light in a weird way so that if you need to look to the side (past the field of vision of the lens; e.g. if you ride your bike and want to look behind you before you turn) and back again quickly it is hard for your eyes to adjust.",
      "rating": 1.0,
      "verified": true,
      "author": "Dr. Marty",
      "helpful_votes": 13,
      "publication_date": 20141201
    },
    {
      "title": "Clear lens has no UV protection.",
      "text": "Tested with UV light , dollar bill security micro printing and credit card. UV light went straight through the lens and the security features were visible.",
      "rating": 1.0,
      "verified": true,
      "author": "Recycled",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Inexpensive, comfortable, and clear",
      "text": "Very clear lenses with no distortion of light at any angle, at least for the pair I purchased. They squeeze to my head, but not so tight it's uncomfortable. I only wear them about 1-2 hours a day at work on average, but so far so good. Will buy a couple more soon to have on hand and for my own home projects.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Rubber nose piece fails",
      "text": "I will never buy these glasses again I bought 10 of them thinking they would last me awhile. Come to find out the rubber nose piece is junk. I could wear a pair 3 to 4 times and the rubber nose piece would rip off. Nose piece failed before ever getting a scratch.",
      "rating": 1.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 3,
      "publication_date": 20190627
    },
    {
      "title": "You get what you pay for",
      "text": "The lenses still fog, though I would say a little less due to the slots on the top. Since day one, the rubber on one of the arms slides off every time I take the glasses off. It gets stuck behind my ear with very little effort. I finally removed it and use them with one side missing. The nose piece left black residue on the bridge if my nose for about the first 3 days wearing them. I won’t buy these again.",
      "rating": 3.0,
      "verified": true,
      "author": "Ben B.",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Most cost effective racquetball glasses I've found, work great.",
      "text": "Best value racquetball goggle out there. The tension is a little light keeping it in place on the side of your head vs other sports oriented safety glasses, but even this item marked as general safety glasses does great for that.",
      "rating": 5.0,
      "verified": true,
      "author": "PH",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "A MUST BUY FOR OR PERSONNEL!",
      "text": "I bought these for a friend and she loved them so much I got myself a pair. We both work in the OR. They provide adequate protection and don't fog. ALL OPERATING ROOM PERSONNEL I HIGHLY RECOMMEND THESE. The mirrored effect is great so our surgeons can't see us rolling our eyes and in the same turn the view looking from them. They help deflect some of the bright OR lights also ( you know the ones that cause us migraines and burn our retina).",
      "rating": 5.0,
      "verified": true,
      "author": "Sassy",
      "helpful_votes": 2,
      "publication_date": 20160715
    },
    {
      "title": "DO NOT BUY",
      "text": "Glasses don't come with a strap to wear around your neck and the ends are rather large for the common straps. With that being said, you either have to wear them all day or sit them down and lose them like i already have",
      "rating": 1.0,
      "verified": true,
      "author": "Man",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Piece of junk - CORRECTION",
      "text": "Let me CORRECT that. The nose piece, as it turned out, was OFF the plastic guide it was supposed to be on. It looked like it was broken. So, taking that back. Will see how it works. Pure garbage. The nose piece fell off before I put the glasses on even once. I cannot believe I paid $11 for that. AVOID!",
      "rating": 3.0,
      "verified": true,
      "author": "igorm",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "EXCELLENT PRODUCT",
      "text": "I really like these sheer eye covering. It covers my eyes well and they are clear.",
      "rating": 5.0,
      "verified": true,
      "author": "BELINDA",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Lightweight with good visibility",
      "text": "We bought these for my 8 year old son. He loves them! Lightweight with clear lenses. He barely notices they there which means he leaves them alone. Only reason I didn’t give 5 stars was because they didn’t come with a protective cover or case.",
      "rating": 4.0,
      "verified": true,
      "author": "Valerie Thomas",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Anti-fog and Scratch Resistant",
      "text": "I am always a little skeptical. These safety glasses have never fogged up nor show any scratches after a month of active use. I love them.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Stuber",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Great fitness glasses, no fogging (Gray Lens With Black Frame)",
      "text": "I got these glasses to stop pollen from irritating my eyes while I was commuting by bike and because summer is coimg. But I was worried about fogging while I put the power down. However after 3 weeks, I do not regret passing on the Anti-fogging versions, because the non-anti-fog versions work just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "FJT",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Great night driving riding anti-glare protection (mango color lenses)",
      "text": "I have had these for over a year. I use them daily for night\\day biking for anti glare / UV. The straight ear pieces go well over my helmet straps. They have stopped countless bugs, dust, hot winds, gravel, and the massive glare from new headlights. I intended on buying a 2nd pair, but my original is still going strong. The UV they block (mango color) is sufficient for average days in AZ, but start to struggle on high (13 extreme) UV days. They are awesome for my intended purpose, anti-glare - eye protection. I also feel they would work nicely in a florescence environment to put a soothing color over harsh lighting.",
      "rating": 5.0,
      "verified": true,
      "author": "RBob",
      "helpful_votes": 0,
      "publication_date": 20150727
    },
    {
      "title": "Very nice Eyeglasses for moderate eye protection from larger objects at ...",
      "text": "Very nice Eyeglasses for moderate eye protection from larger objects at an affordable price not too tight around my temples nice rubber head headpiece. I wear them 8 hours very comfortably the adjustable nosepiece (rubber) is exactly what I wanted. I am going to buy more of these glasses they are stylish and offer moderate eye protection from not aso heavy things. I did notice powdered objects getting into my eyes at work they offer little protection from things coming up in under them when working with very fine particles. I will be gifting these around the holidays coming up to hunters shooters campers working people basically anyone who can use some cheap stylish eye protection.",
      "rating": 4.0,
      "verified": true,
      "author": "Vino",
      "helpful_votes": 0,
      "publication_date": 20141018
    },
    {
      "title": "Firm and sturdy glass.",
      "text": "Glass are very firm. When put on the face, there is a gap from the glass to the base of the nose and eyes. If your looking form a tight and secure fit that you don't have to worry about dusk flowing into the glass... these glass are really good. On the bright side, this gap allows the sweat/moist evaporate from my eyes. Unlike other glasses that would fog up...",
      "rating": 5.0,
      "verified": true,
      "author": "Thien Doan",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "Buy these",
      "text": "Great glasses. Fit comfortably. Look amazing. Didn't fog at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of 2",
      "helpful_votes": 6,
      "publication_date": 20170713
    },
    {
      "title": "But I'm glad I got them!",
      "text": "I never knew I would need these, but I'm glad I got them! I use them for riding my bicycle at night, and am VERY glad I started using them, as it seems insects around here go from March, till early October! It usually doesn't matter during the day, but at dusk or after dark, it gets dangerous! I've had all manner of insects hit these glasses, (and I'd rather they hit the glasses than my eyes!) but just recently, I had a Junebug hit them! Junebugs are BIG insects! I just hope I don't have a 'run-in' with a \"Goliath Beetle\"! Needless to say, I was SO happy I was wearing these glasses!",
      "rating": 5.0,
      "verified": true,
      "author": "Saenar Drift",
      "helpful_votes": 0,
      "publication_date": 20141023
    },
    {
      "title": "Very comfortable.",
      "text": "Good except the they still fog for a while. Especially when wearing a face mask. I really like the design and are very comfortable for wearing several hours at a time.",
      "rating": 4.0,
      "verified": true,
      "author": "DM Springer",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "It moists so bad and hurts!",
      "text": "Not helped at all. I guess you get what you paid for! Cheap material. The fit isn’t good. Better invest with a much quality material. It’s my fault of being very cheap!",
      "rating": 1.0,
      "verified": true,
      "author": "maricar",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Lightweight and comfortable",
      "text": "These glasses performed nicely for my work. Stylish but also lightweight and comfortable. Not bad for the price, just don't scratch them!",
      "rating": 5.0,
      "verified": true,
      "author": "JEli28",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Good glasses, protect your eyes with this product, good idea",
      "text": "Good glasses, comfortable, clear, easy to see through. Better than old scratched version you might get to borrow from somewhere.... better to buy something good, use them...",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonBuyerNorCal",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Good quality product for a good price, recommended.",
      "text": "I got these for cycling in the evening when the sun is fading and the night is creeping in. I never wore amber color glasses before, it takes a little getting use to it, but once your brain adjust, everything actually looks clearer and sharper, just an interesting effect. It also works great for cloudy days that tend to be too bluish. The quality built of the product is excellent. They fit great, they feel great and they are sturdy so as long as I take care of them, I see keeping these for a very long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Lokitoz",
      "helpful_votes": 0,
      "publication_date": 20140430
    },
    {
      "title": "I forget I’m wearing them!",
      "text": "I’m very happy with these safety glasses. In my woodshop, most glasses are annoying. I don’t wear eyeglasses and safety glasses usually bother me. However, I wore these for a couple hours and forgot I had them on. They feel solidly made and the lenses are crystal clear. I’m very happy with these.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy And Layna",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Pleased, But Not Fog-Proof",
      "text": "I'm very pleased with these safety glasses. They fit well on my head and face and so far, I haven't had issues with them sliding down. The real test though will be when the weather gets hot and humid and I'm sweating like a pig. As others have noted, I've also had some minor fogging, so these definitely aren't fog-proof.",
      "rating": 4.0,
      "verified": true,
      "author": "Kurt Meyer",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "Would be 5 stars if the lenses didn't scatch so easily",
      "text": "I like these safety glasses. I purchased 2 pair and will continue to use them. My only complaint is the lenses scratch pretty easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark A.",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Good glasses for night riding",
      "text": "I bought these glasses for night rides on my mountain and road bike. They are not perfect compared to some cyclist glasses because they don't wrap around as much and leave some room below your eyes however I gave them 5 stars because for $6 I couldn't beat the price. I don't do a lot of night riding but when I do these are great. They do fog a little if you are not moving but with the vents once you are riding they immediately clear up. I would recommend these to anyone...especially for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20130720
    },
    {
      "title": "Solid Eye Protection for a Good Price",
      "text": "I was about to start some furniture building & refinishing products and needed to replace my old school eyewear. Those glasses were the kind that sealed around the eyes and when worn, I spent most of the time wiping off fog. These Pyramex glasses are just what I needed. Lightweight, good eye protection, and they're comfortable to wear with protective ear muffs. The only time they ever fogged up was when using a dust mask, but that's pretty common when using the cheap masks that vent out the sides. Regardless, I'm going to pick up another pair of these just to keep around the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn",
      "helpful_votes": 0,
      "publication_date": 20140617
    },
    {
      "title": "pretty good but they do fog up",
      "text": "I bought these for protection from coronavirus. They work pretty well and seem to be good quality, but they do fog up a bit.",
      "rating": 4.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Great in the sun. Also works well in low light inside.",
      "text": "Are used to have two pair of safety glasses. One for inside one for outside. These take care of both situations. Whether the suns out or you’re working in very low light. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray Mosel",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Great, especially for the price",
      "text": "Just needed some lite duty safety glasses and these were perfect. Very clear, no scratches, etc. Would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "LJ",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Comfortable and they don't fog up!",
      "text": "Great value for a quality product. I have been wearing these for some times 12 hours at a time as PPE for the COVID outbreak and they don't bother my ears. Also a plus when added with a medical mask they don't fog up like many of the other safety goggles and masks I have tried.",
      "rating": 5.0,
      "verified": true,
      "author": "LJMT",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "very comfortable",
      "text": "super comfortable. I hate to wear glasses but have to for work. These are very comfortable and lightweight. Very well vented and hardly ever fog up on me. I work indoors and outdoors in temperatures from -10 deg F to 130 deg F. These are remarkebly better than any other glasses I've tried in the last 10 years. Thank You!",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Love them!",
      "text": "They seriously are anti-fog!! I had horrible problems with fogging up with prior glasses. These haven’t fogged once.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Macey",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Ventilated and comfortable used for cycling.",
      "text": "ErazGwI actually purchased these for cycling. Clear cycling specific glasses are 25 dollars or more. I ride to work at 3 a.m. to bake bread and these work really well to keep dust and rain out of my eyes. When cars pass they keep debris from passing cars at bay. The rubber pieces that rest on yourears are very flexible and grippy so i dont have to worry about slipping.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Andrew day",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "Best among name brands",
      "text": "I need eye protection for firearm practice. Distortion in the lenses will translate to poor hand-eye coordination -- and that's bad for practice. After picking up Pyramex ear protection and finding it superb. I thought I should try their eyewear. To be sure, I also bought some other pairs from brands that were 'more recognized.' Excuse the pun, but I was blown away with the quality of the Pyramex optics. My eyes are very sensitive. These glasses are clear and comfortable (unlike the others). They clean up perfectly with dishsoap, cold water, and a piece of clean old flannel. One of the popular pairs of glasses actually magnify everything (causing misjudgement of distance)! Not so for these.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Taft",
      "helpful_votes": 0,
      "publication_date": 20120617
    },
    {
      "title": "Product 5stars! Packaging zero stars.",
      "text": "Product is great quality! Too bad it only came with a plastic wrap. I would give no stars to packaging",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Great product at a great price",
      "text": "I purchased these for bike riding and they have been great. I sweat a lot and usually after about 10-15 minutes other glasses are fogging up - not these! They have small vents at the top that work great for keeping the moisture and heat from building up. Also, they fit really well. I don't have to worry about them falling off or dropping off my face if I look down. They aren't too big or too small and I'd guess that they would fit well on the average size adult. I plan on buying more for my family members.",
      "rating": 5.0,
      "verified": true,
      "author": "Nozama in NC",
      "helpful_votes": 2,
      "publication_date": 20130813
    },
    {
      "title": "Flimsy",
      "text": "I used these a few times at a gun range with no problem. Over this winter, I wore them while running a snow blower in our driveway. What with the blowing snow and all, I'd place the glasses on my face, up on top of my head or pull them off to clean and dry the lenses. These simple actions resulted in both earpieces breaking off. Yeah, they're cooler looking than the standard safety glasses, but I'm not wasting my money on this style again. I'm going back to the ones that are goofy looking but solid.",
      "rating": 2.0,
      "verified": true,
      "author": "LWP",
      "helpful_votes": 0,
      "publication_date": 20140312
    },
    {
      "title": "They weren't as comfortable as I had hoped for",
      "text": "They weren't as comfortable as I had hoped for. The ear pieces were a little longer than I had anticipated, but I guess thats just because of my small head. They did get a little irritating behind the ears but I got used to it after a while. Very light weight frame, but the lens tend to get dirty easily and they scratch easily too. I've had mine for little over 3 months and they are starting to wear. But I do love the feature of anti-fog lenses, as they really don't fog up!",
      "rating": 3.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "Great safety glasses",
      "text": "These are nice and lightweight and don’t fog up as easily as some of the cheaper safety glasses I have. I can hardly tell I’m wearing them sometimes.",
      "rating": 4.0,
      "verified": true,
      "author": "Reveal Consulting Group",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "It holds itself in place behind your ears.",
      "text": "It fits well and it is very light. The device will protect well and you can't beat the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Old DOS user",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Nice and comfortable good price also.",
      "text": "I have small nose bridge, this fit perfect on my face and comfortable plus it does not hurt my ear.my company provide a cheap throw away glasses but When wear it all day I need this.",
      "rating": 5.0,
      "verified": true,
      "author": "Schant",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Great And stylish glasses",
      "text": "Bought these for a dear friend I ride bicycles with. She wears contacts and wanted something to protect her eyes. She is VERY style conscious and I was delighted when she loved these glasses. I bought the silver and she's out of town now with five other ladies and she took them with her. The glasses are very very nice. they not only protect your eyes but they're very nice looking on. would highly recommend them to anybody.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert H.",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "Looks and feels great",
      "text": "I use these in the ER, the clarity is fine for suturing and the glasses look professional.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "They fit great",
      "text": "Fit great, other shooting glasses are too close to my eyes, I can feel my eye lashes (and I don't have fake eye lashes) pushing against the glasses. These ones are a little further away from my eyes due to the bigger nose piece yet I feel very protected. I highly recommend these glasses and will buy them in black too.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Edgar",
      "helpful_votes": 0,
      "publication_date": 20151215
    },
    {
      "title": "Full, durable, inexpensive clear glasses",
      "text": "I use these for cycle commuting to work at least 5 days a week. Work great in the cold weather and to keep wind, etc. out of the eyes. I have had no problems with them fogging at all and the lenses wrap around/ provide great full coverage to really kleep the wind out of the eyes so that I can see clearly. They are inexpensive so they are my throw-around always-carry commuter glasses and work great for this purpose! Not too stylish, certainly not too unstylish, and solid but basic design and feel. Definitely worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Maxwell Kraft",
      "helpful_votes": 0,
      "publication_date": 20130323
    },
    {
      "title": "Lightweight and comfortable",
      "text": "Worked really good for FTX. They are comfortable and light weight. Great value.",
      "rating": 4.0,
      "verified": true,
      "author": "SmilyArly",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Nice fit, but very slight irritation behind ears after a few hours",
      "text": "They fit well and don't fog up. I'm very happy with the look and the function. However, the way I wear them, I find that the small surface area of contact behind my ears leads to some slight chafing. Nothing that isn't solved by adjusting them a little bit, but I still found myself having to do so every two or three hours in order to keep them comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Logan Pulley",
      "helpful_votes": 0,
      "publication_date": 20170416
    },
    {
      "title": "True Anti-fog Safety Glasses!",
      "text": "These are great!! I’ve tried a couple different types and these are the only one’s that haven’t fogged up on me! Being in Texas, and working inside and out, it’s important for that anti fog part to work!",
      "rating": 5.0,
      "verified": true,
      "author": "Jacquelyn",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Eye Protection",
      "text": "They do the job... This is my second pair... Great !! Exactly what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "E",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Cool Glasses",
      "text": "These glasses are very stylish. Currently, they are doing a great job at protecting my eyes.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Lynn",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Awesome protection for the price",
      "text": "These are great, and they are listed at a great price. They do not fog 90% of the time. I have one of those faces that sweats while in indoor-ranges without quality AC, so its hard to find glasses that won't fog. They fogged once, out of the few times I have used them, and it wasn't bad. They are vented well, the are solid in their construction, and they feel good. They hug my head with their flexible arms, so they don't fall off but are not too tight. Great product, for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 0,
      "publication_date": 20140811
    },
    {
      "title": "Keeps the cadaver juice out of my eyes",
      "text": "As a first year medical student, what I want most in life is to not have cadaver juice in my eyes. These glasses have served me well in that respect.",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Roose",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Protective eye wear",
      "text": "I wear to work during this COVID-19 pandemic to protect my eyes but it fog up very easily so I stop wearing them.",
      "rating": 3.0,
      "verified": true,
      "author": "peggy C",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Safety Glasses with Flair",
      "text": "These are comfortable, lightweight, effective, and actually look nice! Thumbs up.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean B. Schoonmaker",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "comfy fitting glasses for all day",
      "text": "cant tell im wearing them. very comfortable for work in for an 8hr or 12hr shift",
      "rating": 5.0,
      "verified": true,
      "author": "Scot",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Scratches too easy",
      "text": "within a week they are already scratched, despite careful handling. Nice otherwise.",
      "rating": 3.0,
      "verified": true,
      "author": "kdmmcc",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "I expected better",
      "text": "Bought these for Dental Hygiene School because the ones I had were scratched and fogged up all the time. These weren't a whole lot better. They are not scratch resistant and still fog up. I only wear them to clean and break down my unit as I have loops for patient care. I would not want to wear them for patient care. They are really comfortable though and you barely feel them on your face.",
      "rating": 4.0,
      "verified": true,
      "author": "DC2Kids",
      "helpful_votes": 0,
      "publication_date": 20141108
    },
    {
      "title": "Anti-fog works good.",
      "text": "For the cost I wasn't so sure they would really work, with the anti-fog and all. But they worked really good. And are very comfortable. Can't go wrong with the price on these and the comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "Opentoe",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "My favorite safety glasses!",
      "text": "Love these safety glasses! I use them every day and have no complaints. They are comfortable and durable. The vents at the top prevent fogging. Will definitely buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "JamesVos",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Great Buy!",
      "text": "I work at Trane where they require to wear safety glasses during the whole shift and this are very sturdy and comfortable to wear all day",
      "rating": 5.0,
      "verified": true,
      "author": "Raul Terrazas",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "Day good fo the money",
      "text": "Work great. Feel quality and comfortable on a medium face. My 👀 feel safe and secure behind these babies.",
      "rating": 5.0,
      "verified": true,
      "author": "RicFlairRadio",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Nice cycling glasses",
      "text": "Excellent, inexpensive safety/riding glasses. Nice rubberized and somewhat flexible arms that stay where you position them. I'm using them for cycling, but would use them anytime I need eye protection. They only fog up on cooler/wetter days when stopped. As soon as you start moving again, the fog goes away, so no big deal. Rain-x works well on them for wet weather.",
      "rating": 4.0,
      "verified": true,
      "author": "Herbie W.",
      "helpful_votes": 0,
      "publication_date": 20141128
    },
    {
      "title": "Pretty sweet stuff",
      "text": "Just got these today. I ordered them because I have a very big problem with my glasses fogging up while I'm working, it's incredibly irritating. The glasses themselves are slightly large on my head (shouldn't be a problem for people with a normal sized head), but the nose pieces seem to hold them on really well when I shake my head and look down. The anti-fog is really impressive. I keep messing around breathing on them because it's pretty cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay Brock",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "Strong and Appealing",
      "text": "These protective glasses are stylish so I occasionally forget their initial purpose because they are so comfortable and streamlined. The lenses have protected my eyes from metal shavings and welding arcs so I am satisfied with their performance. Their overall structure is compact and doesn't seem likely to break if stored tightly or dropped.",
      "rating": 5.0,
      "verified": true,
      "author": "Reviewer",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "Good all around glasses",
      "text": "Nice glasses comfortable and they don't fog up when I cover my face with a facemask in the cold",
      "rating": 4.0,
      "verified": true,
      "author": "stokey",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Did the trick!",
      "text": "Ordered these for my husband as he uses them for range glasses. I actually threw away his old pair accidentally- yikes!! He liked these and was very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Shooting glasses",
      "text": "They fit my big head, never fog up and don't get weird distortions around the edges like some other cheap plastic lenses do -- plus the price is right. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich A.",
      "helpful_votes": 0,
      "publication_date": 20160228
    },
    {
      "title": "Very comfortable even on wide noses",
      "text": "Bought these for work on a drydocked ship, the glasses they supply we're very narrow for the bridge of the nose, I was worried these would be the same but I was very wrong. These glasses for very comfortably even on my wide nose, now my nose doesn't burn after a day of work.",
      "rating": 5.0,
      "verified": true,
      "author": "Levi Blount",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Makes early evening \"brighter\"",
      "text": "I put these on to cut grass after dinner, sun was blocked by clouds. These made everything brighter and it was like the sun was not blocked anymore. However, once the sun went down, these were too dark and I had to revert to clear lense.",
      "rating": 5.0,
      "verified": true,
      "author": "Cust8e0",
      "helpful_votes": 0,
      "publication_date": 20170519
    },
    {
      "title": "Light, durable, stick to your head well",
      "text": "Great value for the money. They are very light and the vent is nice--they haven't fogged up on me at all. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "thescout",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Great safety glasses",
      "text": "Been wearing them a few weeks now, great fit, comfortable and durable. Could not get a better pair for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Sczesny",
      "helpful_votes": 0,
      "publication_date": 20181025
    }
  ],
  "product_meta": {
    "title": "Pyramex Fortress Safety Glasses",
    "description": "Pyramex Fortress Safety Glasses feature a lightweight sport styling design that contours to the face providing maximum protectionAn adjustable nose pad provides ultimate comfort for all face sizesVented lens allows air to flow away from the lens to prevent foggingSafety glasses have a straight back with rubber coated temple tipsAnti-scratch lenses offer 99% protection against harmful UV rays.",
    "rating": 4.5,
    "feature_bullets": [
      "Vented lens allows air to flow away from the lens to prevent fogging.",
      "Straight back rubber coated temple tips.",
      "Adjustable nose pad provides a comfortable fit for a broad range of bridge sizes.",
      "Anti-Scratch lenses offer 99% protection against harmful UV rays."
    ],
    "specifications": {
      "Date First Available": "April 13, 2012",
      "Manufacturer": "Pyramex Safety",
      "ASIN": "B01G93S8DM",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Safety Goggles & Glasses",
      "Personal Protective Equipment",
      "Sports & Outdoors",
      "Eye Protection",
      "Tools & Home Improvement",
      "Safety & Security"
    ],
    "price": 6.39
  }
}