{
  "website_summaries": [
    {
      "verdict": "Effective at teaching large dogs not to pull on the leash, and it uses durable hardware that will last.",
      "pros": [
        "Works nicely for dogs of multiple sizes",
        "Has 2 connection options for dealing with dogs who need minimal or extensive correction",
        "Uses blunt prongs so they won't puncture the dog's skin during obedience training sessions",
        "Can add extra links as needed to increase the size of the collar"
      ],
      "cons": [
        "Not made for wearing all day",
        "Prongs can tangle in long fur"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Product, not for me",
      "text": "This is a well-made collar. I can't speak to the durability of it, but it appears long lasting. It is definitely comparable to another H-S brand, without the middle plate. This was unfortunately way too large for my dog, even with all but 4 links taken out. This is more my mistake than anything else. The ends of the prongs are well rounded. It is difficult to separate the links to take it on and off, but that is the nature of the collar especially with a heavier weight prong. Overall great buy, would have happily kept and used if it was the right size.",
      "rating": 4.0,
      "verified": true,
      "author": "Phhayes",
      "helpful_votes": 3,
      "publication_date": 20190214
    },
    {
      "title": "This has saved my life.",
      "text": "A few months ago I adopted a puppy that is so high-energy she became impossible to handle any time a person or animal got close. She is not aggressive but, just wants to be “all over” anything that gets close. I transitioned from a regular collar to a choke-chain and was still barely able to hang on to her. This training collar made an instantaneous difference. Now I can walk her without it requiring every ounce of my strength and energy to keep her under control.",
      "rating": 5.0,
      "verified": true,
      "author": "Catnip",
      "helpful_votes": 3,
      "publication_date": 20181027
    },
    {
      "title": "Not painfully spiky, reduces pulling",
      "text": "The prongs just make it possible for her to notice the collar. She was hurling her full weight against her normal collar & harness, trying to get loose to chase cars. Did that twice with this, yelped slightly but not a mark on her, probably just surprised. The adjustable nature of the prongs also makes it possible for them to snap apart if the dog twists the collar up, so a good fit is important.",
      "rating": 5.0,
      "verified": true,
      "author": "ltwelve",
      "helpful_votes": 2,
      "publication_date": 20200227
    },
    {
      "title": "Excellent price for a great collar.",
      "text": "I reveived mine this morning and must say ir is an Excellent prong collar and an amazing price. Exactly as deacribed. Works perfectly for my 65lb APBT With a larger neck size. Much lighter than the bulky generic large prong collar bought at Petco for double if not triple the price of this one. We had a 3.2mm one for our 80 lb APBT/American bulldog. And he was more responsive so we bought this one for our other dog. Only docked 1 star because ot would be nice to have the option to incled 2- additional prongs since this one is slightly narrower than our other 3.2mm collar but it is perfectly fine otherwise!",
      "rating": 4.0,
      "verified": true,
      "author": "Sophia Oberbroeckling",
      "helpful_votes": 6,
      "publication_date": 20170509
    },
    {
      "title": "Unruly dog is now ruly on walks!",
      "text": "After my dog was viciously attacked right next to our home she was a hot mess on walks and around other people and dogs. This collar has magically kept her focused and grounded and keeps her in control when another dog tries to lunge or starts growling and cursing at her. If you have a puller, dog with aggression, etc this is the last and only collar you will need. Always thought they looked barbaric, but they just give the dog a firm grip without choking them out. Super effective!!",
      "rating": 5.0,
      "verified": true,
      "author": "Road to Awe",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Good product...",
      "text": "I like the way it stops my malenois/shep in her tracks when she's after a cat or a coyote! But, she's only 2 and has a thin frame and I noticed walking 2miles, it gets heavy for her neck to carry! I'm using her nylon color more, which unfortunately, doesn't give me the control, but doesn't weigh down her neck..she's very big but only 65lbs so far..I'm thinking the cooler weather will add some fur and weight..it's been 110 her for months so we've been walking at 5am!! Otherwise, great product, great price!",
      "rating": 4.0,
      "verified": true,
      "author": "Dee Arizona",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Great for teaching a puppy not to pull",
      "text": "This made a world of difference in training our 7 month old puppy not to pull. It's good quality and fairly easy to remove the links. It looks a little scary (my wife says it looks like a medieval torture device haha) but trainers recommend these and most dogs will know not to pull hard when using this. After a while, they just get used to staying near :).",
      "rating": 5.0,
      "verified": true,
      "author": "Trevor Adams",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "OMG -  Worked Immediately!!",
      "text": "I'm training my daughter's year old dog and she had a terrible problem with pulling while walking and not heeding instructions. I tried click training and lots of practice and nothing was working. I bought this as a last resort and am amazed! Immediately upon putting the collar on she walked perfectly on the leash. It doesn't appear to cause here discomfort when she's doing what she needs to be doing but also doesn't cause harsh punishment if she's not. She now walks like a show dog and is such a pleasure to take a stroll with. Thanks!! I would recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie S. Carroll",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "What can I say, it solved our pulling problem ...",
      "text": "What can I say, it solved our pulling problem. We got it for our pitbull who loves to pull on the leash. After multiple solutions this is the only one that works.",
      "rating": 5.0,
      "verified": true,
      "author": "Alissa Adams",
      "helpful_votes": 2,
      "publication_date": 20180525
    },
    {
      "title": "It broke but was easy to use",
      "text": "Loved this at first, she got a little nervous when we took it off after the walks. She ended up snapping it. I’m sure it will still work from the way it holds we clasped it back together but haven’t had to use it again. She free roams the big yard now.",
      "rating": 3.0,
      "verified": true,
      "author": "Dorothy Zarnick",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Great quality!",
      "text": "Works great for my German Shepherd husky! He likes this much better than a harness for walks! I wouldn’t keep it on your dog for long periods of time though!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Gets the job done",
      "text": "My dog does not like wearing this collar when we go on walks. However it does get the job done because it allows me to restrain him much better when he sees another dog and tries to jump and pull away.",
      "rating": 4.0,
      "verified": true,
      "author": "Question",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Works incredibly well!!!",
      "text": "My husband no longer falls over when the dog yanks, because he no longer yanks. Incredible product!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Reynolds",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "It's very big and heavy but good quality.....",
      "text": "This is much bigger that I thought it was. It seems well built and is pretty heavy. I was needing it for a small/med dog. It is too large.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Best",
      "text": "Great, very Durable no problems figuring out how to use. Link can come off to adjust.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie ",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Instant success",
      "text": "This collar barely fits my dog (my dog is a very small lab), so be warned if you have a large dog. But,,My dog stopped pulling on her leash immediately! This thing is a game changer, walks are fun to take the dog on now.",
      "rating": 5.0,
      "verified": true,
      "author": "Frugal",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Great for training!",
      "text": "Great collar. I use it to train my dogs 👌",
      "rating": 5.0,
      "verified": true,
      "author": "Janelle C",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Very reliable and sturdy! Well made!",
      "text": "I liked this a lot. My boy wears it hiking and it’s just enough pressure so he won’t pull but not too much that it hurts him.",
      "rating": 5.0,
      "verified": true,
      "author": "AndersonA",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Need to improve on the easy remove collar",
      "text": "I like that it was instant functional with my terrier lakeland but i disliked the way to take it off and then if i left it off he would have discoloration on the neck and hair loss 😞",
      "rating": 3.0,
      "verified": true,
      "author": "Junior ",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Working well for my pup",
      "text": "Fits well, sturdy, as nice as much more expensive versions.",
      "rating": 5.0,
      "verified": true,
      "author": "Doodlingdaisies",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "but great collar, very",
      "text": "Needed an extra link for my 70lb lab, but great collar, very durable",
      "rating": 5.0,
      "verified": true,
      "author": "BobsYourUncle",
      "helpful_votes": 0,
      "publication_date": 20171205
    },
    {
      "title": "Training collar works well",
      "text": "I use it to walk my dog so they pull it seems to work",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Not the best or worst",
      "text": "I've used better but for the price and convenience it was good enough. It is large even for my med-large dog so definitely take a couple out",
      "rating": 3.0,
      "verified": true,
      "author": "brownsgal33",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Perfect doesn't hurt dog.",
      "text": "Doesn't hurt my dog. Keeps him from chasing cats when on walk.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret Brown",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Worked well for my pit bull",
      "text": "My 65lb pit bull loves to pull. The minute I put this on him, he didn’t even try to pull. It’s a little bit bigger so it comes off higher on his neck but it works very well!",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor Coughlin",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Five Stars",
      "text": "She learned how to walk at my pace husky owner",
      "rating": 5.0,
      "verified": true,
      "author": "Reviews Help :D",
      "helpful_votes": 0,
      "publication_date": 20151005
    },
    {
      "title": "High quality. Fits my lab perfectly without having to ...",
      "text": "High quality. Fits my lab perfectly without having to unfasten the prongs. Replaces one I used for 15 plus years.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Three Stars",
      "text": "Works better but still not as good as everyone says",
      "rating": 3.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 0,
      "publication_date": 20150518
    },
    {
      "title": "Collar larger than portrayed/returns difficult",
      "text": "This collar is made for a larger dog. There is no way it could be used as a 10\" collar and it is way too heavy for most 14-16 inch dog/neck size let alone anything smaller. In addition, the vendor requires prior approval on returns but includes no phone number to call for approvals.",
      "rating": 1.0,
      "verified": true,
      "author": "zoe",
      "helpful_votes": 5,
      "publication_date": 20100720
    },
    {
      "title": "First time ever to have a nice, relaxing walk with my dog since I got her. .",
      "text": "I am so happy!! I can enjoy walking with my dog now. It was effortless. I put the collar on her, went for a walk and it's like I had a brand new, trained dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Belky",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Don’t buy this cheap garbage",
      "text": "Why would anyone buy this?!?! Go with the original Herm Sprenger! This obviously is bad if all the prongs go the same direction and there is no plaque in the center of the collar to protect the dogs throat! Don’t be cheap and buy this garbage! Go with Herm Sprenger! Thats the original prong collar.",
      "rating": 1.0,
      "verified": false,
      "author": "Kate",
      "helpful_votes": 2,
      "publication_date": 20181218
    }
  ],
  "product_meta": {
    "title": "Hamilton Prong Training Dog Collar with 3.2mm Chrome Prongs",
    "description": "Hamilton Prong Training Dog Collar, with 3.2mm chrome prongs is a humane and effective way to control your dog while on the leash.",
    "rating": 4.5,
    "feature_bullets": [
      "An effective way to stop the habit of pulling while on the leash by applying a gentle pinch to enhance control",
      "Hardware is strength tested for safety",
      "Hamilton builds quality into all our of our products",
      "These collars can be made smaller by removing links and longer by adding links. Additional prongs are available to lengthen the collar if needed, C3201"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "17.25 x 1.75 x 1.25 inches; 8.8 Ounces",
      "Item model number": "C3200",
      "Date First Available": "October 1, 2004",
      "Manufacturer": "Hamilton Animal Products LLC",
      "ASIN": "B0006G4WD4",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Dogs",
      "Pinch Collars",
      "Pet Supplies",
      "Collars, Harnesses & Leashes",
      "Collars"
    ],
    "price": 12.42
  }
}