{
  "website_summaries": [
    {
      "verdict": "We love the versatility of this large cooler, which is designed for use on the water but can function on hunting trips or small commercial ventures as well.",
      "pros": [
        "The main benefit of this cooler is its size and strength",
        "Able to contain a whopping 30 pounds of ice and 250 pounds of fish, some users have reported that the cooler is able to handle transporting large catches from a hunt as well",
        "A convenient threaded drain plug makes emptying easy"
      ],
      "cons": [
        "The hinges are slightly small for such a large lid, and tend to snap if the user is not careful"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "game or fish then this is a great option.",
      "text": "This thing is huge! On my last hunting trip, I loaded it with 2 large pronghorn (antelope) carcases, quartered. There was plenty of room for several days worth of ice. There was plenty of ice left when I got home after a 4 day hunt. I bought two of these - my third pronghorn fit into the second one with plenty of room to spare for other food. Difficult to carry, but if you need to pack a lot of food, game or fish then this is a great option.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin G. McCoy",
      "helpful_votes": 2,
      "publication_date": 20141217
    },
    {
      "title": "The right size for toting raw (for dogs) cross country ...",
      "text": "The right size for toting raw (for dogs) cross country. I needed something large enough to hold a decent size order and keep it cold long enough for me to make a 2-3 day drive. This fit the bill because it's not too large, fits in my vehicle along with my supplies AND my dog. Kept things cold well. Now I need to find those ice packs that are meant to refreeze and fit into the lid as pictured with identical product.",
      "rating": 4.0,
      "verified": true,
      "author": "VinAZ",
      "helpful_votes": 0,
      "publication_date": 20150113
    },
    {
      "title": "momma always said life is like a giant cooler....",
      "text": "Cooler is satisfactory, very big, nicely insulated. The plastic bottom is fairly thin which means dragging it at all is a bad idea, and that's almost impossible because its so bulky and heavy.The description stated freezable inserts would be included with product and it would come with stainless steel hinges, both of which were not the case. I can't figure out how to contact the seller, which kind of sucks, but oh well I guess. To reiterate, satisfied with product, slightly bummed with misleading description and quality of plastic.",
      "rating": 3.0,
      "verified": true,
      "author": "Veronica D.",
      "helpful_votes": 11,
      "publication_date": 20131105
    },
    {
      "title": "Description isn't for this model!!!",
      "text": "The ad said there would be dividers and freezer packs for the lid. The cooler was returned and the replacement didn't have them either. Too late for our needs. Addendum: the model number in the product description is not for this cooler; this model does not come with inserts. If you want inserts, it's $19.99 EACH on Rubbermaid.",
      "rating": 2.0,
      "verified": true,
      "author": "April",
      "helpful_votes": 4,
      "publication_date": 20140206
    },
    {
      "title": "Best ice chest ever!!",
      "text": "THE BEST ICE CHEST YOU CAN GET! WILL LAST YEARS! Handles won’t break off like most will. We love them. Personally I think they are even better than “yeti”..",
      "rating": 5.0,
      "verified": true,
      "author": "Autumn",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Rubbermaid Marine Cooler, 150 quart",
      "text": "Excellent cooler, initial use was for a 65 pound pig which fit easily inside. I made my first five day camping trip and the ice held up nicely for the whole time as well.",
      "rating": 5.0,
      "verified": true,
      "author": "silbernd",
      "helpful_votes": 5,
      "publication_date": 20140516
    },
    {
      "title": "Used it on 6 day raft trip with dry ice ...",
      "text": "Used it on 6 day raft trip with dry ice and blocks in 90+degree heat stI'll had ice on last day",
      "rating": 4.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Beware!!  Freezer bottles not included.",
      "text": "The description on here clearly states that the refreeze bottles are included. I did not get any. Upon further research, I realized the description is for the Gott Marine Cooler, which is the same cooler but with the bottles and stainless steel latches and hinges. This price is for the cooler with plastic parts and no refreeze bottles. It also doesn't appear to be easy to get the bottles either. I can only find used ones on ebay for way too much money. I did find the Iceolator bottles for $9.09 each which wasn't bad.",
      "rating": 4.0,
      "verified": true,
      "author": "Glory D.",
      "helpful_votes": 2,
      "publication_date": 20140228
    },
    {
      "title": "Good cooler great deal",
      "text": "So far so good it's bigger then I thought and I like the handles no busting these off. I bought it for hunt and sure can pack some meat into it",
      "rating": 3.0,
      "verified": true,
      "author": "Thomas Herrera",
      "helpful_votes": 2,
      "publication_date": 20141108
    },
    {
      "title": "Boss cooler",
      "text": "I went up a size because the price was so good and am very happy with the purchase. I store lots of ice everyday and this cooler looks to be very high quality. Shipping was quick too",
      "rating": 5.0,
      "verified": true,
      "author": "JBS",
      "helpful_votes": 0,
      "publication_date": 20140615
    },
    {
      "title": "High end cooler.",
      "text": "This cooler exceed my expectations. It wasn't inexpensive by any means. This is a great case of getting what I paid for though. Heavy duty and tough.",
      "rating": 5.0,
      "verified": true,
      "author": "rgoodi",
      "helpful_votes": 0,
      "publication_date": 20141119
    },
    {
      "title": "Excellent product",
      "text": "I placed frozen meat in this cooler, traveled 1000 miles with it on a trailer in the sun & heat. It arrived 20 hours later still frozen.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry \"Butterkup\" Haas",
      "helpful_votes": 0,
      "publication_date": 20140328
    },
    {
      "title": "Appears to be the best bang for the buck on huge coolers on Amazon",
      "text": "Have not used it yet. Appears to be the best bang for the buck on huge coolers on Amazon",
      "rating": 4.0,
      "verified": true,
      "author": "dan",
      "helpful_votes": 0,
      "publication_date": 20150326
    },
    {
      "title": "Great for a boat fish box",
      "text": "works great for a fish box on my boat and the drain plug is a screw on plug which is nice I have no complaints at all",
      "rating": 4.0,
      "verified": true,
      "author": "darrel",
      "helpful_votes": 0,
      "publication_date": 20150609
    },
    {
      "title": "Great, Great Price",
      "text": "Great, Great Price, Great shipping (time was fast) Big enough for , well almost anything!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris farrugia",
      "helpful_votes": 0,
      "publication_date": 20141026
    },
    {
      "title": "Watch Out!!",
      "text": "The product is a good Cooler but you won't get what you think you ordered.This Seller is showing you and describing a GOTTS 150qt Cooler in his Item Description with Brass Hinges and 3 Freezer Bottles for the Lid and a Freezeable compartment divider, not the Cooler your ordering.You will receive a Cooler and THATS IT with plastic hinges and NOTHING ELSE.One would expect AMAZON to stop this type of BAIT and SWITCH from this SELLER.I had read this same thing in a review but thought it was just a mistake on the SELLERS part,guess not.MY BAD.I gave the cooler a 4 and the SELLER a 0!!!!!",
      "rating": 4.0,
      "verified": true,
      "author": "RaBar",
      "helpful_votes": 28,
      "publication_date": 20140311
    },
    {
      "title": "The bottom is narrower than the top and makes it ...",
      "text": "The bottom is narrower than the top and makes it unsable. I haven't tried it loaded on the boat but I am concerned that it will wobble in any kind of sea. or if I use it as a step.",
      "rating": 3.0,
      "verified": true,
      "author": "JD Port Townsend,  WA",
      "helpful_votes": 0,
      "publication_date": 20150828
    },
    {
      "title": "Three Stars",
      "text": "THE COOLER DOSE NOT LAST FIVE DAYS AT ALL BUT IT DOSE HAVE ALOT OF ROOM",
      "rating": 3.0,
      "verified": true,
      "author": "Randy Brooks",
      "helpful_votes": 3,
      "publication_date": 20141017
    },
    {
      "title": "I Am sure it will do the job My Husband ...",
      "text": "I Am sure it will do the job My Husband WAS LOOKING FOR.. .",
      "rating": 4.0,
      "verified": true,
      "author": "Carolyn's",
      "helpful_votes": 0,
      "publication_date": 20141031
    },
    {
      "title": "Four Stars",
      "text": "Could use an internal tray to keep things cool and dry",
      "rating": 4.0,
      "verified": true,
      "author": "GreenMtnCloud",
      "helpful_votes": 0,
      "publication_date": 20140915
    },
    {
      "title": "we were totally pleased! we did not know what to expect from ...",
      "text": "we were totally pleased! we did not know what to expect from the \"used\" description, the box was beat up, one corner was smudged, but that wiped right off. we would buy an item marked used again, and again. thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Eileen Douglass",
      "helpful_votes": 0,
      "publication_date": 20150410
    },
    {
      "title": "Great cooler",
      "text": "best handels on any cooler I have owned. will not break out when full like igloo. had same cooler for 5yrs and will not buy any other brand. Thanks Rubbermaid you hit a homerun with this one!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Mullens",
      "helpful_votes": 0,
      "publication_date": 20131203
    },
    {
      "title": "Great cooler. Plenty of space and stays cold for ...",
      "text": "Great cooler. Plenty of space and stays cold for days.",
      "rating": 5.0,
      "verified": true,
      "author": "William H. Gilbreath",
      "helpful_votes": 0,
      "publication_date": 20141117
    },
    {
      "title": "The only thing we don't like is the latch to close and open the ice ...",
      "text": "Just the right size for us. The only thing we don't like is the latch to close and open the ice chest. It's plastic and flimsy. We shall see how long it last.",
      "rating": 4.0,
      "verified": true,
      "author": "Sara Centeno",
      "helpful_votes": 0,
      "publication_date": 20141213
    },
    {
      "title": "Four Stars",
      "text": "VERY NICE COOLER BUT ICE ONLY LASTS 4 TO 5 DAYS...I WOULD BUY ANOTHER...",
      "rating": 4.0,
      "verified": true,
      "author": "BOB FOLTZ",
      "helpful_votes": 0,
      "publication_date": 20140718
    },
    {
      "title": "Works well - but Huge!",
      "text": "We needed a large cooler for trips to Costco and the frozen goods. This works well - holds everything but do not try to move when full. I took one star off due to the size - I mean it is huge.",
      "rating": 4.0,
      "verified": true,
      "author": "Mountain Mama",
      "helpful_votes": 0,
      "publication_date": 20140218
    },
    {
      "title": "Not to great on the shipint",
      "text": "Box was torn up upon receiving item. Ice chest had slight damage to back side of unit",
      "rating": 2.0,
      "verified": true,
      "author": "Anthany",
      "helpful_votes": 0,
      "publication_date": 20140806
    },
    {
      "title": "first time I used it the hinges broke. I ...",
      "text": "first time I used it the hinges broke. I contacted Rubbermaid and they asked me to buy some metal hinges and they'd send them to me. I declined. I got some new hinges, and gorilla glued the screws in.",
      "rating": 1.0,
      "verified": true,
      "author": "matt",
      "helpful_votes": 4,
      "publication_date": 20140918
    },
    {
      "title": "Not the best quality cooler and no where near 7 days but ...",
      "text": "Not the best quality cooler and no where near 7 days but can't beat it for the price on a cooler this large",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin Templeman",
      "helpful_votes": 0,
      "publication_date": 20141103
    },
    {
      "title": "This cooler will not hold ice for 7 days in ...",
      "text": "This cooler will not hold ice for 7 days in 90 degree weather it won't hold ice for two days in 50 degree weather. Piece of junk",
      "rating": 2.0,
      "verified": true,
      "author": "Lamar Smith",
      "helpful_votes": 0,
      "publication_date": 20141110
    },
    {
      "title": "False advertising",
      "text": "First it does not come with the ice packs as described and when you contact amazon they send out the same product. Oh sorry you want what's advertised plan on spending more money due to their lack of moral ethics.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer WEBB",
      "helpful_votes": 4,
      "publication_date": 20140321
    },
    {
      "title": "Rubbermade is behind the learning curve",
      "text": "Hinges pulled off within 4-5 trips when other coolers last years this one last 1 year. Even more irritating is that you cannot go online and buy replacement parts (Rubbermaid hasn't realized this is the 21st century). Cannot buy the cooler icepack inserts online. Again have to call rubber made! This review is on the rubbermaid product not the seller.",
      "rating": 1.0,
      "verified": false,
      "author": "Tundra",
      "helpful_votes": 0,
      "publication_date": 20170709
    },
    {
      "title": "excellent whitewater rafting cooler",
      "text": "I bought this cooler for whitewater rafting because of the molded handles... works much better than the new style for strapping into a raft.. i wish it had a split lid, and no molded cup holders...",
      "rating": 4.0,
      "verified": false,
      "author": "Bella",
      "helpful_votes": 5,
      "publication_date": 20110222
    },
    {
      "title": "Three Stars",
      "text": "screws to the lid are too small and the lids becomes dis assembled",
      "rating": 3.0,
      "verified": false,
      "author": "David",
      "helpful_votes": 3,
      "publication_date": 20140903
    },
    {
      "title": "No regrets",
      "text": "Bought this to bring home pork from the processor. It easily held over 100lbs. It's definitely a 2 person carry when full. Even while empty, it's easier with two people due to its length, but it can be moved around by one person. No regrets, so I ordered a second one.",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20131220
    },
    {
      "title": "GOOD COOLER",
      "text": "We bought this cooler at sams club ($59.87) but it is still the same cooler. We really like it. My husband has plans of using it for bringing home meat from a up and coming elk hunt. I do wish it did not have the cup holders. They just catch crud and I wish the lid fastener wasn't plastic...and I wish it had a split lid. But honestly we really do like this cooler.",
      "rating": 4.0,
      "verified": false,
      "author": "D. CURTIS",
      "helpful_votes": 6,
      "publication_date": 20080109
    }
  ],
  "product_meta": {
    "title": "Rubbermaid Fg2B8001Trwht Water Cooler, 150-quart",
    "description": "Size:150-quartRubbermaid water cooler, Rubbermaid, Series: marine, 150 qt storage, white, 20-1/2 in length, 45 in width, 19 in height.\n\nFROM THE MANUFACTURER\nThe Rubbermaid FG2A7501TRWHT 150 Quart Gott Marine Cooler Ice Chest has extra thick insulation that keeps ice up to 7.5 days at 90-Degree F. Its large size can accommodate either 250-Pound of fish with 30-Pound of ice or 252 cans plus ice.",
    "rating": 3.6,
    "feature_bullets": [
      "Rubbermaid water cooler, rubbermaid, series: marine, 150 qt storage, White, 20-1/2 in length, 45 in width, 19 in height",
      "SELECT propellants that deliver consistent accuracy and performance",
      "The product is manufactured in United States"
    ],
    "specifications": {
      "Product Dimensions": "46.75 x 19.94 x 21.44 inches",
      "Item Weight": "1 pounds",
      "Manufacturer": "Standard Plumbing Supply",
      "ASIN": "B000QD3VIE",
      "Item model number": "FG2B8001TRWHT",
      "Customer Reviews": "3.6 out of 5 stars60 ratings3.6 out of 5 stars",
      "Best Sellers Rank": "#210,643 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 28, 2017"
    },
    "categories": [
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Camp Kitchen",
      "Coolers",
      "Camping & Hiking"
    ],
    "price": ""
  }
}