{
  "website_summaries": [
    {
      "verdict": "This robotic vacuum cleaner uses minesweeping technology to do a slow and not entirely thorough job of cleaning floors without your assistance.",
      "pros": [
        "Picks up superficial household debris well",
        "gets itself out of tight corners",
        "included Virtual Walls let you define vacuuming area",
        "returns to charging dock independently"
      ],
      "cons": [
        "Works slowly",
        "misses some spots",
        "no attachments or stair-cleaning capability",
        "occasionally gets stuck"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 7.0,
        "Performance": 6.0
      },
      "publication_date": 20040720,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Used iRobot 4210 Discovery",
      "text": "I had one of these before(yard sale buy for $5 was said to be broken but worked for a few months) and we loved it! We have 5 chih/jack russell mixes that shed EVERYWHERE and this vacuum has helped me sweep the whole house its great! It is no more loud than a larger regular vacuum, it can sweep over my floor mats which is a bonus. This one I bought was used not new but honestly I cannot tell the difference. I would definitely purchase again",
      "rating": 4.0,
      "verified": true,
      "author": "LaReyna25",
      "helpful_votes": 0,
      "publication_date": 20141113
    },
    {
      "title": "Not  Enough  Poop",
      "text": "I got the Discovery Roomba for tile floors with a lot of pet hair and discovered that it has storage for about a pinch of the stuff, where I needed it to pick up handfuls. The dustbin has room for perhaps a cup of dirt, and it would probably be good for picking up superficial dirt when used regularly. It certainly doesn't have the power for deep cleaning. The search strategy takes a lot of time and repeat sweeps to cover a given area, so it's not very efficient or ecological. I gave this product to a friend and returned to my handy dust mop, brush and dustpan to git-er-done.",
      "rating": 1.0,
      "verified": true,
      "author": "Charles Heckel",
      "helpful_votes": 4,
      "publication_date": 20070627
    },
    {
      "title": "Great Little Robot Vacuum",
      "text": "I have a friend that uses an IRobot Roomba and she loves hers so I had to try one and it really is quite nice. Now I can multitask my chores while my room's floor is being cleaned. I feel like George Jetson! It really does work it's way all over a room, under and around obstacles, working closely around the edges and the little side brush does scoop in additional debris. It seems to work without any problems and as a new Roomba owner and user I am enjoying it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bungalow Guy",
      "helpful_votes": 3,
      "publication_date": 20130627
    },
    {
      "title": "Very Responsible Seller.",
      "text": "I got this vac for my birthday in December and loved it. Roomba malfunctioned in March and the company was extremely helpful and courteous. Apparently a wire had broken leading to one of the wheels. I was told to return the screen that held the brushes and they would replace my Roomba at no cost to me. I received my vac today! You certainly couldn't ask for a more timely response than three days. Thanks Amazon and IRobot for making life just a bit easier for me.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Gurley",
      "helpful_votes": 4,
      "publication_date": 20050323
    },
    {
      "title": "Good vacuum but not for allergy sufferers",
      "text": "I like the ease and convenience of the Roomba vacuum. It picks up more than what you would expect. However it is not a sealed filtered unit and lets enough dust through to create problems with my allergies if I'm home when it cleans. This is not a huge issue but one reason I got the unit was with a thought of vacuuming more often to help with my allergies. Unfortunately any I time I use it and am home, it will be sneeze city for me. So I just turn it on and leave for work. The only problem is only room a day can be done this way.",
      "rating": 4.0,
      "verified": true,
      "author": "Ron T",
      "helpful_votes": 2,
      "publication_date": 20060219
    },
    {
      "title": "Roomba 4210",
      "text": "An excellent little unit. It's limitations are clearly spelled out and within those parameters it does a fine job. Works especially well on ceramic tile, medium pile and Berber carpet. Does a wonderful job in bedrooms; chasing down the dust bunnies hiding under the beds! The key is to keep the unit perfectly clean. I use compressed air to blow out the unit after every use and have had none of the problems reported online.",
      "rating": 4.0,
      "verified": true,
      "author": "Donald M. Burg",
      "helpful_votes": 2,
      "publication_date": 20070109
    },
    {
      "title": "We love our \"Ruthie\"!",
      "text": "This has become a part of our family and we have named her Ruthie. She is great at picking up the dog hair. It is a little noisy on hard floors, but much quieter on the carpets. I have even taken it to work to clean my office carpet, and it works wonderfully. It really does a great job and we are very happy with ours. In fact, one is being delivered to my son today as a house warming gift for him in his first home. I'm anxious to see how he enjoys his also.",
      "rating": 4.0,
      "verified": true,
      "author": "Pamela Gallik",
      "helpful_votes": 0,
      "publication_date": 20060310
    },
    {
      "title": "didn't work properly. Seller sent another and it had the same issue plus another,",
      "text": "1st one would not charge battery, It would actually drain it. Seller sent another one. It did the same thing, and the suction fan would not run. Gave up.",
      "rating": 1.0,
      "verified": true,
      "author": "Randyored",
      "helpful_votes": 2,
      "publication_date": 20150106
    },
    {
      "title": "Works but support is a zero",
      "text": "Works great, but does not last more than 12 months. Needed to pay for shipping to return iRobot due to charging problem. iRobot returned unit with new battery and charger, it worked for a month then the same problem of not recharging. Now in the trouble shooting mode that says to recharge it for 72 hours after the green light comes on. Almost bought the scooba today but deleted the order when I realized it would only work for six-12 months like the other iRobot probucts I have owned. Wished they worked better, becuase I like what they do.",
      "rating": 2.0,
      "verified": true,
      "author": "Jerome",
      "helpful_votes": 0,
      "publication_date": 20060821
    },
    {
      "title": "Savior",
      "text": "I had a roomba for some time. I turn it on when I leave for work. I make sure that there are no wires in the area to be cleaned or low areas where it can hang. I block those areas (I use wood pieces and hand weights). You still need a vacuum to clean some areas and to clean the Roomba. My house has laminate and tile floors. The Roomba is ideal and does a good job.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Ting",
      "helpful_votes": 0,
      "publication_date": 20070703
    },
    {
      "title": "What can I say",
      "text": "This is by FAR Irobots best vacuum. very sad they discontinued it..... this is much more efficiant than my brand new 790 and my mothers samsung navi bot. this things has much more power and cleans so much better.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Catlett",
      "helpful_votes": 0,
      "publication_date": 20130227
    },
    {
      "title": "Great Invention!",
      "text": "I absolutely love this vacuum. It works great and saves me a lot of time and energy that I formally spent vacumming. I have recommended it to several people who also rave about it. I recently purchased another one for upstairs and used the electronic wall. Again, very pleased with it's performance. Now...if they could only make one for stairs!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Meyer",
      "helpful_votes": 2,
      "publication_date": 20050816
    },
    {
      "title": "Roomba Cleans Rooms",
      "text": "Very good product. Able to clean in the tightest of spaces. The only problem is with tall area rugs and/or fringe.. the roomba gets stuck. It works best if you move everything out of its way. When it has free clearance, it does a great job.",
      "rating": 4.0,
      "verified": true,
      "author": "Audiodoc",
      "helpful_votes": 0,
      "publication_date": 20070809
    },
    {
      "title": "Egregiously bad warranty and customer service",
      "text": "Aside from the fact the product failed to function right out of the box and aside from the fact it took two weeks for them to ship a replacement, what really burns me is their refusal to provide for return shipping costs or reimburse me the $19.68 it cost me to return their defective product. They offered me a filter pack, a $14 dollar value!, (which costs them about a buck). Whoopee. If you buy this product, buy it from a store that takes returns. It might be a good idea to test it right there to make sure it charges.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Goben",
      "helpful_votes": 3,
      "publication_date": 20070630
    },
    {
      "title": "I love my Roomba",
      "text": "I have been having back problems and find it hard to vacuum, so when I heard about the Roomba I thought it was worth a try and am I glad I did. It is amazing on both carpet and hard floors like wood and tile, and it even goes under the bed and my sofa. The only tiny problem I have is, it sometimes has a hard time finding its way back to the charger when it runs down at the other end of the house, so I have to take it there. and how hard is that? I understand they are coming out soon with one that washes floors, I cant wait!!",
      "rating": 5.0,
      "verified": true,
      "author": "Pauline Shirley",
      "helpful_votes": 0,
      "publication_date": 20050809
    },
    {
      "title": "Better than I thought...",
      "text": "The Roomba is an amazing robotic vacuum that works better than I could have imagined. I had done a lot of research and read everything I could about the machine before I bought it. I read that it has difficulty with rug ends and floor transitions. In our case, however, it is not true. Not only does it have an easy time with the tassels on our rugs, it goes over many cords without incident. The coverage of the floor is also quite acceptable. The power of vacuum, while not amazing, is enough to pull most dust and loose dirt out of our rugs. All and all i'm very impressed - and happy not to vacuum!",
      "rating": 5.0,
      "verified": true,
      "author": "Happy",
      "helpful_votes": 7,
      "publication_date": 20051023
    },
    {
      "title": "LOVE IT, LOVE IT, LOVE IT!!!!",
      "text": "Anybody that has to vacuum should purchase one of these! I have all hardwood floors in my house so I don't know how it performs on carpet though. You'll still need to clean the baseboards and corners with your conventional cleaner. I'm amazed at the good job this small cleaner does. If your time is valuable and you'd rather be sitting out by the pool or on the golf course, get one of these!",
      "rating": 5.0,
      "verified": true,
      "author": "H. Barnes",
      "helpful_votes": 4,
      "publication_date": 20070514
    },
    {
      "title": "Not if you have oriental rugs",
      "text": "This is an amazing product and a preview of the future in which robots will be increasingly important in our lives. It cleans amazingly well, both on hard floors and especially on carpet. The only problem is that it can't cope with the tassels on oriental rugs (of which we have quite a few) - it chokes on them.",
      "rating": 3.0,
      "verified": true,
      "author": "Daniel Hill",
      "helpful_votes": 0,
      "publication_date": 20080111
    },
    {
      "title": "Great Product",
      "text": "We've been using this type of vacuum for the past few years and it does a good job between regular vacuuming.",
      "rating": 5.0,
      "verified": true,
      "author": "Sal",
      "helpful_votes": 0,
      "publication_date": 20140117
    },
    {
      "title": "Suprisingly effective but a bit buggy",
      "text": "We've had our Roomba for about 4-5 months and we've been surprised at how well is cleans. It also pretty tough. One day I caught the edge on a cabinet as I was picking it up and the plastic was pulled up. I was able to snap it back together again and it works just fine still. Every once in a while it acts a bit strange. We haven't downloaded the latest firmware, so that might help. Overall we've been very pleased and have recommended Roomba to many of our friends.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Checketts",
      "helpful_votes": 3,
      "publication_date": 20070108
    },
    {
      "title": "Goes into intermittent spot cycles and then quits",
      "text": "When I first got it ,it would go into small circles and quit. I noticed that the sensor cover on top was loose and glued the cover on and used lens wipes to clean this sensor. I used it to clean floors again and it seemed to work OK,but now it is back to small cycles again. Any suggestions? Tom Yingst",
      "rating": 2.0,
      "verified": true,
      "author": "Thomas Yingst",
      "helpful_votes": 2,
      "publication_date": 20130424
    },
    {
      "title": "Great Roomba",
      "text": "Roomba is great. This little guy picks up pet hair like you wouldn't believe. We have 2 cats and this thing is a life saver. I use it every other day for light cleaning during the week to keep up with the hair and cat litter around the boxes. Best thing I've bought in a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20130219
    },
    {
      "title": "fantastic",
      "text": "This thing is truely amazing it does everything i needed it to do although i had to cover the cliff sensors so it would go over my rug (it wont run on black carpet otherwise). But after i covered them with tape perfection i strongly recommend this machine",
      "rating": 5.0,
      "verified": true,
      "author": "tweak",
      "helpful_votes": 0,
      "publication_date": 20130514
    },
    {
      "title": "Roomba Discovery",
      "text": "This vaccuum is good for in between your regular vacuuming. We have 3 cats and a dog who shed terribly. It helps keep up with the pet hair. I let it go once a day. It charges a lot faster than the older models. Remember, this vacuum does not replace your larger vacuum, it just helps to not have to regular vacuum as much.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Torres",
      "helpful_votes": 3,
      "publication_date": 20060827
    },
    {
      "title": "I love my Roomba",
      "text": "I love my Roomba. I am so happy with it I bought one for my mother. I research every product that I purchase online and the price on Amazon is the best around.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr Francine",
      "helpful_votes": 0,
      "publication_date": 20070512
    },
    {
      "title": "RobbieThe Robot",
      "text": "This is my second iRobot Roomba 4210 (the 1st was damaged in a broken water heater flood) My first was purchased in a promotional sale in 2004 and was still in perfect operating condition in early 2010. Number 1 Robot was one of my most valued possessions,-- as is Number 2!",
      "rating": 5.0,
      "verified": true,
      "author": "Pauline Conover",
      "helpful_votes": 3,
      "publication_date": 20100604
    },
    {
      "title": "DO NOT buy referbished and DO NOT buy anything from JGalvanTreasures!",
      "text": "Bought mine from JGalvanTreasures. It broke completely after one month of light use. When I got the box, the unit itself and the inside of the box were filthy, and there were bugs inside! Box was ripped up outside as well. Started using it, everything was fine for about a week, then it just stopped working altogether. I changed the filter, emptied out the dust collector, but it still doesn't work. Can't even get my money back!",
      "rating": 1.0,
      "verified": true,
      "author": "New York",
      "helpful_votes": 2,
      "publication_date": 20150713
    },
    {
      "title": "Bait and Switch",
      "text": "I've had my Romba Discovery for about a year, and its worked pretty well. Now the battery is dead, and Irobot won't replace it. They say the batteries are on back order, but offer a discount for a trade in. It's been 2 months since I ordered the battery and Irobot can't tell me when I can get this replacement part, but they can offer a good deal on a new unit. THIS IS CLEARLY A BAIT AND SWITCH AS WELL AS A DECEPTIVE BUSINESS PRACTICE. THIS UNETHICAL BEHAVIOR MEANS I WILL NEVER DO BUSISNESS WITH THIS COMPANY AND I ADVISE EVERYONE TO AVOID I-ROBOT. DO NOT BUT THIS PRODUCT.",
      "rating": 1.0,
      "verified": true,
      "author": "Honest Reviewer",
      "helpful_votes": 7,
      "publication_date": 20061008
    },
    {
      "title": "irobot",
      "text": "so far this product is everything it says it is. Works like described right out of the box.",
      "rating": 5.0,
      "verified": true,
      "author": "R. J. Gregg",
      "helpful_votes": 2,
      "publication_date": 20071227
    },
    {
      "title": "too complex",
      "text": "we sent it back could not use it in our stage of life or style of house....cost us 27 dollars to send back and was charged 27 restocking fee and it was not the one that was ordered....I clicked on the 129,00 price and up came 204.00 price...so that ended that experience with 54,00 loss",
      "rating": 1.0,
      "verified": true,
      "author": "Sheila Silver Halet",
      "helpful_votes": 0,
      "publication_date": 20140529
    },
    {
      "title": "Great product",
      "text": "I am very pleasantly surprised with the Roomba 4210. It does a better job than I thought it would and it does not bother our 3 dogs. I have just got into the habit of cleaning the dust collector and filter before I recharge it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kensington",
      "helpful_votes": 4,
      "publication_date": 20050912
    },
    {
      "title": "Money well spent",
      "text": "This vacuum has my house cleaner than it has been since the maid retired. I rave about it to all my friends. What could be better than coming home to a freshly vacuumed room? It doesn't even scare the bird!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Holmes",
      "helpful_votes": 3,
      "publication_date": 20060828
    },
    {
      "title": "great machine, poor instructions",
      "text": "The irobot works well once you figure out how it runs. The directions are not very clear on the use of the \"walls\" and the remote controll.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy O'Neill  ibex",
      "helpful_votes": 0,
      "publication_date": 20060807
    },
    {
      "title": "Roomba Sweeper",
      "text": "I bought this as a gift for my daughter. She said it works just fine. So far so good. I was a little skepticl since it was used. The seller cleaned it up a little, I did give it a little bit better cleaning before giving it as a gift, it's hard to make something like this look brand new, but it looked pretty good. My daughter was thrilled and didn't seem to mind, and as I said it did work just fine. I was pleased with the seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Loretta",
      "helpful_votes": 0,
      "publication_date": 20120104
    },
    {
      "title": "Defective, dirty product.",
      "text": "Another disappointment. Came with dead battery which wouldn't recharge. I ordered new Tenergy battery from Amazon and the iRobot worked for 10 minutes and stopped. I give up. I realize the iRobot was used, but it was useless and I don't feel like the hassle of returning it. By the way, it was filthy when I received it, not a good representation of an Amazon",
      "rating": 1.0,
      "verified": true,
      "author": "John Lyon",
      "helpful_votes": 3,
      "publication_date": 20141030
    },
    {
      "title": "iRobot Roomba 4210 Discovery Floorvac Robotic Vacuum",
      "text": "Gave as a gift ... person appreciated, but had to return...said it didn't work well on wood floors.",
      "rating": 3.0,
      "verified": true,
      "author": "Carol M. Woollens",
      "helpful_votes": 0,
      "publication_date": 20070111
    },
    {
      "title": "I can't rate this item since my first shipment was ...",
      "text": "I can't rate this item since my first shipment was \"lost\" and the seond unit that was sent does not operate. A call to to the iRobot people deemed it was an issue with the robot so after over a month of waiting for it, it doesn't even work. It is back in it's packaging, being returned.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Roy",
      "helpful_votes": 0,
      "publication_date": 20140728
    },
    {
      "title": "One Star",
      "text": "DOES NOT WORK CAME INCOMPLETE WITHOUT HOMEBASE AS SHOWN IN AD !",
      "rating": 1.0,
      "verified": true,
      "author": "enyduke",
      "helpful_votes": 0,
      "publication_date": 20160214
    },
    {
      "title": "Roomba",
      "text": "Very disappointed! It is a joke & doesn't work. Part was missing! We have sent it back for a refund!",
      "rating": 1.0,
      "verified": true,
      "author": "Charles W. Potts & Mary Spinks",
      "helpful_votes": 0,
      "publication_date": 20140524
    },
    {
      "title": "It does the work for you!",
      "text": "I get to sit on the couch and watch my vacuum clean my floors! Love Roomba's! It's definitely not the top of the line Roomba, but for the price, it's still going a year later!",
      "rating": 4.0,
      "verified": true,
      "author": "Seth Slaymaker",
      "helpful_votes": 5,
      "publication_date": 20140529
    },
    {
      "title": "Poor little robot",
      "text": "It came dirty, the trap was full of dirt and hair, the brush was also full of hair... the battery doesn't charge all the way, so I'm lucky for it to last 10 minutes at a time. (Not sure if it's the battery, the docking station, or the charger not working at full capacity - no time to experiment.)",
      "rating": 3.0,
      "verified": true,
      "author": "Jeni Spring",
      "helpful_votes": 0,
      "publication_date": 20130620
    },
    {
      "title": "Extremely disappointed",
      "text": "Product was supposed to be new but it wasn't. It was in old box and when we opened it, it had hair, rat's nest, and sticky stuff. With all the extras, it didn't even have the owner's manual. Seller wasn't helpful at all and made me pay to send back even though he admitted it was there error. Will never purchase anything from The Computer Guy again.",
      "rating": 1.0,
      "verified": true,
      "author": "thomas ford",
      "helpful_votes": 2,
      "publication_date": 20130810
    },
    {
      "title": "The Worst!",
      "text": "The machine was absolutely filthy, the filter, brushes and container were all nasty. I returned it and did get my refund. Worst purchase I have ever made on Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Marcia Glover",
      "helpful_votes": 2,
      "publication_date": 20121013
    },
    {
      "title": "Works great",
      "text": "Thank a lot man! saved me a bunch of money on my room insurance by switching to a DJ Roomba.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Chang",
      "helpful_votes": 0,
      "publication_date": 20131006
    },
    {
      "title": "Don't waste your time.",
      "text": "Ok so when I got the roomba it wouldn't change and it turned out that the battery was bad. The seller sent me another battery that worked well for 6 months. Now I have issues with the dock not recognizing that the roomba is docked to charge. Roombas are serious trouble. They constantly have issues. I don't think they are worth the headache and the amount you pay for them. I also have tile floors and feel like the barely pick anything up. Really not worth it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenny R",
      "helpful_votes": 0,
      "publication_date": 20140919
    },
    {
      "title": "Roomba 4210",
      "text": "I've owned the Roomba for over 2 years now and love it. It does a great job and allows me time to do other things while it's vacuuming. After seeing how well it cleans both my carpeted and non-carpeted floors, 2 of my relatives also purchased Roombas. It does a great job going around and under furniture as well as cleaning edges. I live in a multi-level house and find it amazing how it \"knows\" not to go over the edge or down the stairs without using the virtual wall units. Overall, it does a great job, but I do haul out the vacuum cleaner about once a month to thoroughly deep-clean the plush carpeting.",
      "rating": 5.0,
      "verified": true,
      "author": "brig",
      "helpful_votes": 3,
      "publication_date": 20070106
    },
    {
      "title": "I love it, even though it's not perfect",
      "text": "If you're a pet owner, like I am, this could just be the product you've been dreaming of. You can get all the hair up off the floor every day, while you're doing something else! My carpets have never looked so good. BUT the brushes and dustbin require a lot of maintenance. You have to empty the dustbin after each and every use. Fur gets wrapped in the brushes too easily and it seems I'm forever taking them out and tending to them. And I get frustrated when it gets \"confused\" and has a hard time heading back to the base. Still, I'm glad I have it.",
      "rating": 3.0,
      "verified": true,
      "author": "Noneofyourbiz",
      "helpful_votes": 7,
      "publication_date": 20060703
    },
    {
      "title": "An excellent purchase",
      "text": "I'm very happy with the Romba. I agree with many of the other reviews when it comes to the weaknesses of the Romba. It will get caught on some electrical cords and rug tassels. It does have a small dust bin and it does need cleaning to keep in running right. With all that said I'm still very happy with my purchase. For me it is still easier to just Romba proof my room, press clean and walk away instead of having to break out the vacuum cleaner every few days. Plus, it is fun to watch. I'm amazed at how good the suction is. It cleans much better than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Shane Williams",
      "helpful_votes": 3,
      "publication_date": 20060304
    },
    {
      "title": "iRobot Roomba 4210 Discovery",
      "text": "This is my third Roomba. Two Discoveries and one Sage, and they all vacuum up at least 85% of loose dirt. There always seems to be loose dust, etc. that the air from the Vac blows in different directions that the Roomba doesn't catch. Still, it's better than me getting on my knees every day to hand dust the floors w/Swiffer cloths. A cleaning maintenance schedule is vital to the performance and life of the vacs. A monthly thorough cleaning, and a quick cleaning (of all parts) at least after every second to third use will keep them working efficiently.",
      "rating": 4.0,
      "verified": true,
      "author": "Marlene Boran",
      "helpful_votes": 4,
      "publication_date": 20070111
    },
    {
      "title": "My wife loves her Roomba",
      "text": "This thing is practically a member of our family. My wife loves it. It works very well for us, with wood floors and not much carpeting. It doesn't do well with thick carpeting, but oriental-type rugs are fine. It has some trouble with the transition from floor to rug if the rug is very thick with a pad under it, but the rug can be done separately if this happens. It's easy to clean and use. We're still using the original filter after about 6 - 8 months. Everyone who gets one loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Marty d'FriedTop Contributor: Woodworking",
      "helpful_votes": 3,
      "publication_date": 20070105
    },
    {
      "title": "Works well... came dirty",
      "text": "The Roomba itself works great. Saves my wife from doing 15 minutes of daily sweeping with just a click of a button. However I can only give this 4 stars because it came filthy as if it hadn't been cleaned for months of use. I took about 50 minutes to clean and prep it for use. Took a long time to charge for the first use... about 24 hours specifically. Keep that in mind on deciding whether or not it works properly!",
      "rating": 4.0,
      "verified": true,
      "author": "G C",
      "helpful_votes": 0,
      "publication_date": 20140527
    },
    {
      "title": "Roomba is a girl's best friend!",
      "text": "I couldn't be happier with Roomba. We have 4 cats and all hardwood/tile floors, and it turns out that Roomba is the perfect solution for us. Roomba is getting a lot of use, so I'll reserve judgement on durability/logevity. How wonderful to be able to put Roomba in a room, close the door, then re-enter to find the floors dirt and fur-free! And no more moving beds and couches ... Roomba has no trouble zipping under most furniture. My floors have never been cleaner.",
      "rating": 5.0,
      "verified": true,
      "author": "N Stroud",
      "helpful_votes": 2,
      "publication_date": 20070123
    },
    {
      "title": "I love my little robot",
      "text": "I purchased the Roomba because I have 2 big dogs. They leave fur everywhere. As clean as I am, I can never get to the fur. I never want my house to smell like pets. So, I gave this a try. I LOVE IT! It is very efficient, idiot proof to use, and cleans an amazing amount of dust and fur. It goes over every surface in my house, knows not to go down stairs, and recharges quickly. I loved it so much I bought 2 more!",
      "rating": 5.0,
      "verified": true,
      "author": "Lori Denning",
      "helpful_votes": 0,
      "publication_date": 20070202
    },
    {
      "title": "Works for us",
      "text": "The Roomba 4210 Discovery is perfect for our bare floor needs. With 2-3 minutes prep time each morning, we come home to a clean floor after work. Roomba is quietly recharging for tomorrow. It is not be the most powerful vacumn and we doubt it could handle the living room carpet due to pets, furniture, toys, plants, and such. It is what it is and we are satisfied with this purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "B. K. Wallen",
      "helpful_votes": 2,
      "publication_date": 20070217
    },
    {
      "title": "Very good at what it does, but cat/dog hair requires lots of human intervention",
      "text": "When I use this roomba every day or two, my place is definitely a lot cleaner. But b/c I have pets that like to shed, it means I have a spend a decent amount of time cleaning the fur out of the roomba. It is still a time-saver, but it looks like the newer models are better at handling fur, so I am considering an upgrade...",
      "rating": 4.0,
      "verified": true,
      "author": "Seiijuro",
      "helpful_votes": 0,
      "publication_date": 20140501
    },
    {
      "title": "Roomba another dud!!!",
      "text": "I have nothing but problems! I have bought two of these over the years! I WILL NOT Ever buy another one! The batteries don't last even through the warranty. Of coarse the batteries only have 90 days on them! I recommend you don't waste your money on the robot vacs!",
      "rating": 1.0,
      "verified": true,
      "author": "Brad Glasser",
      "helpful_votes": 0,
      "publication_date": 20140520
    },
    {
      "title": "This thing is great, unless it gets angry.",
      "text": "We got this for our office, about 5000 square feet. It's terrific, as we are all slobs, and Roomba is not. HOWEVER. it is feisty, and will destroy your desk if you have cables laying around on the floor. One day it pulled a mouse, some lamp, the phone, and a keyboard all over. Order some zip ties with this.",
      "rating": 4.0,
      "verified": true,
      "author": "matt b",
      "helpful_votes": 4,
      "publication_date": 20050901
    },
    {
      "title": "IRobot Roomba",
      "text": "This works pretty well. It does best on hard floors and low pile carpet. It does best in rooms where there are not many objects to go around. It takes a while and may run out of charge before completion. If the room is pretty clear, it does a better job. Kinda neat not having to do anything but turn it on.",
      "rating": 4.0,
      "verified": true,
      "author": "Schnauzer",
      "helpful_votes": 2,
      "publication_date": 20070812
    },
    {
      "title": "Love my Roomba",
      "text": "I have had my Roomba for about four weeks now. He has made life a lot easier at our house. I just set his boundaries and off he goes. He vacuums under the furniture and beds(where I don't). He does back to his docking station, recharges, and is ready for his next \"mission\". I have him do one room at a time and it works for us. The only negative thing I can say about him is that he does not like really really thick carpet, like an area rug. He seems to get confused then, but in all fairness, that was disclosed in the video presentation.",
      "rating": 5.0,
      "verified": true,
      "author": "Milford",
      "helpful_votes": 4,
      "publication_date": 20050817
    },
    {
      "title": "Robot cleaner ok for light cleaning",
      "text": "The docking and charging of the Roomba 4210 is not as simple or as reliable as advertised. It is difficult to clear a typical room to enable the vacum to successfully dock. Once the Roomba is charged it does a pretty good job of cleaning but you must move most of the cords or small items from the room to get the cleaner to keep moving over the entire floor. I am satisfied with it's cleaning ability but frusted in moving objects out of the way to get it to clean the whole floor.",
      "rating": 3.0,
      "verified": true,
      "author": "D. A. Lowe",
      "helpful_votes": 0,
      "publication_date": 20070222
    },
    {
      "title": "Delighted with the vacuum",
      "text": "Had all parts that seller specified. Worked well. Delighted with the vacuum.",
      "rating": 5.0,
      "verified": true,
      "author": "sheila j",
      "helpful_votes": 0,
      "publication_date": 20161028
    },
    {
      "title": "It puts laziness into a whole new category.",
      "text": "The Roomba Discovery is my new best friend. I'm not even joking. It takes a few moments to empty the bin every few vacuumings, and beyond that I can pretty much ignore it aside from telling it to go. It's like having a miniature servant.",
      "rating": 5.0,
      "verified": true,
      "author": "P. R. C.",
      "helpful_votes": 5,
      "publication_date": 20070828
    },
    {
      "title": "My Roomba!",
      "text": "I rec'd a rather old one, but in excellent condition. Once I got the battery (hard to find, except on Amazon) it woks grand. Wish you could see my Doberman trying to figure this out. :) Funny!! Really works wonderful for a handicapped woman. Jo",
      "rating": 5.0,
      "verified": true,
      "author": "JoJo",
      "helpful_votes": 0,
      "publication_date": 20130117
    },
    {
      "title": "4 kids, 2 dogs, one roomba",
      "text": "I love this machine. Everyday I turn it on and it cleans my floors. It is not the same thing as when I haul out my full size vaccuum. It's easier, quicker, quieter. Of course, it doesn't clean as thouroughly, but it's pretty close, and it goes under the beds and tables! If you have kids or dogs, this machine is fabulous. I would definately buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20060803
    },
    {
      "title": "Roomba",
      "text": "I love the Roomba. It does a very good job for day to day use. Occasionally I have to use the upright to brush up the nap of the carpeting. The roomba gets under the beds and tight places that are difficult to get with the upright without moving furniture. I have two of them.",
      "rating": 4.0,
      "verified": true,
      "author": "Peggy Ellenwood",
      "helpful_votes": 0,
      "publication_date": 20110830
    },
    {
      "title": "Good for rooms without too many obstacles",
      "text": "Unfortunately my condo is full of furniture and obstactles. If you have more wide open rooms (like my bedroom) it does a pretty good job and is a good investment. But you can count on it in a crowded space. I was impressed with how well it could climb up onto my heavy rug and avoid gettng stuck in crowded/tight spaces.",
      "rating": 3.0,
      "verified": true,
      "author": "M. Neeley",
      "helpful_votes": 0,
      "publication_date": 20060303
    },
    {
      "title": "Roomba rocks",
      "text": "I love the Roomba. It doesn't eliminate the need to vacuum or shampoo carpets but it does day to day maintenance very well and cleans up the leaves etc that the dog drags in.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Smith",
      "helpful_votes": 4,
      "publication_date": 20060828
    },
    {
      "title": "Horrible Product - Dont waste your money",
      "text": "Worked for about 2 weeks then died... returned it for a new one... same thing happened.. when it worked it worked well. the quality is just not there.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Goldsberry",
      "helpful_votes": 0,
      "publication_date": 20111130
    },
    {
      "title": "I love my Roomba",
      "text": "I was very skeptical of this item, but it works great. I have very thick plush carpet and it does an amazing job. It does an even better job on the ceramic tile. Amazon.com had the best price. I am thinking about buying a second unit for upstairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Hurry Up",
      "helpful_votes": 0,
      "publication_date": 20060807
    },
    {
      "title": "Great product",
      "text": "I think everyone is a little sceptical about this vacuum cleaner before they buy, but don't be - it works great!",
      "rating": 5.0,
      "verified": true,
      "author": "M.S. - Fort Myers",
      "helpful_votes": 0,
      "publication_date": 20070107
    },
    {
      "title": "It mostly works",
      "text": "The Roomba cleans my carpet, hardwood floors, & tiled floors very well. It does a nice job getting into corners. However, it does not like to clean my area rug which is primarily black.",
      "rating": 4.0,
      "verified": true,
      "author": "Chuck",
      "helpful_votes": 0,
      "publication_date": 20070110
    },
    {
      "title": "So Far So Good",
      "text": "We've had our little Roomba for over a month now and have run it almost every day. We are very satisfied, I just hope it lasts a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Markus Mumper",
      "helpful_votes": 3,
      "publication_date": 20050711
    },
    {
      "title": "Got what I wanted out of it",
      "text": "Getting the Roomba does 2 things: 1) Vacuum occurs more frequently. 2) Gets us to keep our stuff off the floor. Both of these are more psychological on the owners than physical product. It is also easier to clean hair out of than a standard vacuum.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Lawrence",
      "helpful_votes": 3,
      "publication_date": 20070512
    },
    {
      "title": "I love my Roomba!!!!!",
      "text": "we have tile floors and 5 cats. We run Roomba almost every day and it works great and picks up everything! It knows where to go and can go almost anywhere except it doesn't fit under the couch. I have so much more time to do other things besides vacuum now. I would recommend this product to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Marker",
      "helpful_votes": 2,
      "publication_date": 20050929
    },
    {
      "title": "Roomba Review",
      "text": "I love my Roomba! I especially like how the Roomba goes under my beds and sofa. I have 2 dogs so I clean the brushes, etc. after every use. I highly recommend the Roomba--especially if you, like me, are not related to Mrs. Clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie Ellis",
      "helpful_votes": 4,
      "publication_date": 20060730
    },
    {
      "title": "Robot Roomba",
      "text": "I have had a Robot in my home for 3 years and love the work it cleans up, Pet hairs etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Anita M. Cremer",
      "helpful_votes": 0,
      "publication_date": 20071125
    },
    {
      "title": "Grat",
      "text": "You can't beat a roomba don't buy the knockoffs this was a lightly used one but so was my first one they both vacuum every very well I sucotion is strong my mom got one form a company it worked badly no suction and it was new thier is a reason rooma is the best becuse of the way thier made they make them very good to last and the heavy dirt sencer works good if it senses a lot of dirt in a area it stays tells it's gone I love roomba they need to make it with a voice that whould be great",
      "rating": 5.0,
      "verified": true,
      "author": "robert",
      "helpful_votes": 0,
      "publication_date": 20131020
    },
    {
      "title": "One Star",
      "text": "The product was not properly described very disappointed with seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20140805
    },
    {
      "title": "This thing is GREAT!",
      "text": "I got mine yesterday and it has not stopped cleaning! Very smart and easy to use. Does a great job!",
      "rating": 5.0,
      "verified": true,
      "author": "DK",
      "helpful_votes": 2,
      "publication_date": 20060110
    },
    {
      "title": "won't charge",
      "text": "Bought this used. Doesn't work. Won't charge. Tried on the station and direct but just won't work. Lights up like it's charging but...",
      "rating": 1.0,
      "verified": true,
      "author": "barbara",
      "helpful_votes": 2,
      "publication_date": 20140318
    },
    {
      "title": "what a piece of junk",
      "text": "my wife wanted this unit to save time vacuuming. what a wast of money, piece of junk. Does not work as advertised.",
      "rating": 1.0,
      "verified": true,
      "author": "LUPO",
      "helpful_votes": 0,
      "publication_date": 20101205
    }
  ],
  "product_meta": {
    "title": "iRobot Roomba 4210 Discovery Vacuuming Robot, White",
    "description": "Roomba Discover Robotic FloorVac",
    "rating": 3.6,
    "feature_bullets": [
      "Robotic floorvac with dirt detection and convenient infra-red cliff sensors",
      "Auto adjusts to any floor surface; 2-hour continuous cleaning; easy-to-empty debris bin",
      "Edge-cleaning sidebrush; stasis sensor; virtual wall for confining to designated area",
      "Rechargeable APS battery, 3-hour charger, 2 virtual walls, 2 air filters, and remote control included",
      "Measures 16-3/4 by 21 by 5 inches; 1-year warranty"
    ],
    "specifications": {
      "Product Dimensions": "21.1 x 16.8 x 5.2 inches",
      "Item Weight": "10.4 pounds",
      "Manufacturer": "iRobot",
      "ASIN": "B00022HYJ6",
      "Item model number": "4210",
      "Batteries": "4 D batteries required.",
      "Customer Reviews": "3.6 out of 5 stars659 ratings3.6 out of 5 stars",
      "Best Sellers Rank": "#2,757,319 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Specific Uses For Product": "Carpet, Wood, Tile and Linoleum",
      "Warranty Description": "1 year.",
      "Batteries Required": "Yes",
      "Import Designation": "Made in USA and Imported"
    },
    "categories": [
      "Home & Kitchen",
      "Vacuums",
      "Robotic Vacuums",
      "Vacuums & Floor Care"
    ],
    "price": ""
  }
}