{
  "website_summaries": [
    {
      "verdict": "This is an affordable option if you're interested in trying acne body sprays to see if they will help you.",
      "pros": [
        "This bottle has a special pump that works from any angle",
        "It won't stain clothes and has moisturizing ingredients to help keep your skin from drying out",
        "The formula does not smell"
      ],
      "cons": [
        "The sprayer is prone to clogging, making it difficult to get product out"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great for inside masks!",
      "text": "I’ve been using this stuff Inside my mask to reduce bacteria and moistness & it works wonders. I highly recommend anyone use this in their mask if you are prone to breakouts or have recently got “maskne.” The smell isn’t overpowering and it has helped my breakouts / not made any more breakouts ever since I started spraying my mask.",
      "rating": 5.0,
      "verified": true,
      "author": "Zoe Marie",
      "helpful_votes": 16,
      "publication_date": 20200917
    },
    {
      "title": "Great!!!",
      "text": "So far it works as well as the ' acne-free' spray, and the only reason I switched from that is bc it's aerosol. And I'm trying to move away from aerosol sprays so I ordered this one and it seems to works great and it's actually less sticky on my skin and fries faster than the Acne-free spray.",
      "rating": 5.0,
      "verified": true,
      "author": "VeronicaB.",
      "helpful_votes": 5,
      "publication_date": 20190428
    },
    {
      "title": "Mascne miracle",
      "text": "I bought this product to spray on the inside of my mask while I’m at work to combat mascne (acne on my face where my mask is all the time). I was concerned that there would be a suffocating chemical smell but there isn’t so I’m impressed. It also feels good on my skin and not overly drying it out.",
      "rating": 4.0,
      "verified": true,
      "author": "Travis Yockey",
      "helpful_votes": 4,
      "publication_date": 20200806
    },
    {
      "title": "I need more",
      "text": "I use this because having to wear a mask all day. I started breaking out. You can feel it working it has a slit burn feeling when it hits your pimples. I had quite a few white heads on my side and now they are gone just left over redness",
      "rating": 5.0,
      "verified": true,
      "author": "kellsie",
      "helpful_votes": 2,
      "publication_date": 20201003
    },
    {
      "title": "Don't get your hopes up",
      "text": "Bought this with high expectations since I've used other products by Nature's Cure (5% benzoyl peroxide and their female 30 day acne pills) and I had a lot of successful outcomes with their products. This one doesn't work. I do appreciate that the nozzle is designed to be sprayed upside down. I think a lot of these other companies that also produce a similar product forget about those details.",
      "rating": 3.0,
      "verified": true,
      "author": "Elaine",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "This is thee worst product I've ever tried",
      "text": "This is thee worst product I've ever tried. I saw so many good reviews so I figured I'd try it. I was frustrated and has tried everything. And now? Four days and my body has just blown out in a full outbreak. It's summer and I can't even wear a swimsuit. I'm humiliated to say the least. Don't wast your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Ali Amaya",
      "helpful_votes": 20,
      "publication_date": 20170707
    },
    {
      "title": "Prevent mask break outs!!",
      "text": "This is perfect if you have to wear a mask all day! I spray my mask before wearing it to prevent breakouts!! Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Britt",
      "helpful_votes": 3,
      "publication_date": 20200820
    },
    {
      "title": "SECOND BOTTLE",
      "text": "at first i only use on my back because i wanted to try it first to see if it works then move on to my face. My back completely cleared out after 3 days, then my chest, and then finally use it on my face and the results are all amazing. i used it for over a year now. ordering my second bottle",
      "rating": 5.0,
      "verified": true,
      "author": "Thu Pham",
      "helpful_votes": 5,
      "publication_date": 20190303
    },
    {
      "title": "It actually works!",
      "text": "THANK YOU FOR THIS PRODUCT!!!! I’m 31-years-old and my back acne is horrific. I had it as a teenager and it has returned with a vengeance. My doctor said Accutane may have to be my final option (which destroys your insides to clear the outside). I tried this spray as a last resort... I have only used it for two days! TWO!!! And I can already see an improvement! Fingers crossed that it continues to help!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Clare P.",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Good for maskne",
      "text": "I am a dental assistant and have to wear a kn95 every day all day now and have started breaking out. I still get little break outs using this product but I think they would be worse without it.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Nice.",
      "text": "I have used this product for a while. I do like it, it is not the best for that stubborn cyst acne but it doesn't stain clothes at all! I love the smell and the spray does work upside down!",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "One Star",
      "text": "Waste of money. Used it on my son everyday as directed and didnt notice it work at all.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Shayka",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Okay so far. But no change.",
      "text": "Been using for about a week morning and night. Not seeing any difference. I have had bacne for 10 years now. Fluctuating in severity. Hoping this will help. Want clear sink for wedding. We will see. Will update in a month. This products Does not smell bad or make you cough like another product I’ve tried.",
      "rating": 3.0,
      "verified": true,
      "author": "Alyssa S-A",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "It works.",
      "text": "This stuff really works. I have always struggled with acne on my back (made worse by commuting with a backpack most days). Even though I have only used this spray sporadically, I notice a big difference each time. For comparison, I have used Neutrogena Acne Wash for years, which helps a bit, but this spray is much more dramatic. My back feels nice and smooth! Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily H",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "Maskne",
      "text": "My daughter got the dreaded acne from wearing a mask at school. This was the perfect solution! She sprays it on the inside of her mask, lets it dry and then wears it with no breakouts! Be sure to let it dry or it will cause some irritation.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Possert",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "So far so good",
      "text": "My daughter suffers from chest and back acne. The upside down spray is nice. She saw an improvement in just a week or so. It is not completely gone but much better",
      "rating": 5.0,
      "verified": true,
      "author": "KDL",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Good for prevention",
      "text": "Using it for my face and on my masks. Spray is great and I believe it’s helping prevent breakouts with the daily mask usage. It does make your face dry so make you sure moisture!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "great product, finally a regimen our 14 yr old will stick with",
      "text": "small bottle but a great product, great idea to have a spray. finally a regimen our teen son will stick with. says for body only, not to use on face. warns not to spray on lips or get in eyes. wish it could be sprayed on the face",
      "rating": 5.0,
      "verified": true,
      "author": "CaringConsumer",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Refreshing and smells good",
      "text": "Great spray, keeps my skin clear and vibrant. It smells good too, leaves your skin feeling fresh.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda M",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "It worked, But takes time",
      "text": "Used for 3 weeks and the backacne fade a lot. It is said that u should used for couple months and i will wait and see. But i also order SAL3 salicylic acid sulfur soap bar today, will use with it and see if it will have better result. It is not easy to spray by yourself though, and have to wear the clothes without cloth on the back when u spray.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "It's effective even more so with sunlight",
      "text": "I'm a (female) runner and as soon as I sweat, I break out. I've tried both benzoyl, sacilyic wash and treatment, clindamyacin and sulfur. This is the only thing that works. I've been to the dermatologist so many times for this. Just try it you won't be disappointed. It takes a couple of weeks of consistent use and don't pick!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny L Grondin",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "FANTASTIC PRODUCT!",
      "text": "REALLY WORKS! I was training for a half marathon this summer - running, cross training, hiking and sweating daily with friction rubs from workout gear and awful breakouts on my back. This product smells good, doesn't upset my sensitive skin and works so well. I'm now breakout free and so happy my skin is back to normal. Would HIGHLY recommend this spray!",
      "rating": 5.0,
      "verified": true,
      "author": "Louise Royston",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "I was using Neutrogena body spray but decided to purchase ...",
      "text": "I was using Neutrogena body spray but decided to purchase this to see how it worked. No complaints but no difference as well. It helps maintain my skin but no noticeable differences in helping my skin.",
      "rating": 3.0,
      "verified": true,
      "author": "Nikki Morales",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Works- bottle not full though",
      "text": "Works well but sucks that it gets used so fast. Wish they made bigger bottle options. These bottles also aren’t filled completely, which is annoying.",
      "rating": 4.0,
      "verified": true,
      "author": "Sasha B. Andersen",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "So easy to use",
      "text": "My teenagers have had great results with Nature's Cure Acne Treatment products. This is the first time I have ordered the spray. My daughter loves it. She has acne on her back, chest and upper arms. The biggest problem she faced was that she had to have help to apply any treatment to her back. The spray solves that and she said it is faster and easier to apply to her chest and arms as well. Great product and now more convenient to use. Thumbs up!",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20130713
    },
    {
      "title": "It seemed like since it was just applying such a thin film ...",
      "text": "I purchased the acne spray to use on my back to help prevent acne- it was to hard for me to apply to my back without help. It seemed like since it was just applying such a thin film of product it really didn't do much.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160922
    },
    {
      "title": "Good ingredients bad spray bottle.",
      "text": "The product works and has a high concentration of salycilic acid but it DOES NOT spray in any direction. I turned the bottle upside down to use it on my back and it wouldnt work.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Ineffective",
      "text": "Ineffective. I have been using this for over a month now and have had absolutely no improvement with the acne on my back.",
      "rating": 1.0,
      "verified": true,
      "author": "LaBoss",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Works for me!",
      "text": "Stings a bit but does seem to make a difference i spray on a cotton pad to apply",
      "rating": 4.0,
      "verified": true,
      "author": "Emily M.",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Amazing!",
      "text": "This stuff works great! I workout twice a day and have developed back acne from sweating so much. So I decided to give this a try. I use it three times a day in the morning after my workouts, before my workout, and before bed. It has cleared my acne up within 3 weeks of using it. I ordered another bottle because this is the only product that I have found that actually works. It's better than Proactiv (it didn't work for me).",
      "rating": 5.0,
      "verified": true,
      "author": "Va'Lyndi Ferris",
      "helpful_votes": 0,
      "publication_date": 20170624
    },
    {
      "title": "Better solution: 2% sa pads that are half the ...",
      "text": "This is ok. It’s a very small bottle that stops working once there is 1/3 left. 90% of the ingredients are pseudo science. Better solution: 2% sa pads that are half the price and work better.",
      "rating": 2.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "Not impressed",
      "text": "Used this only a few times, made my back itchy and kinda sticky.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephanie ",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Beware of the product you receive.",
      "text": "I got a bottle without any packaging or seal. Just the bottle. Inside was a partially filled dark yellow liquid that smelled like hairspray which should be a clear liquid. Seems like someone refilled it with something else and the seller resold it. The real product, on the other hand, works great.",
      "rating": 2.0,
      "verified": true,
      "author": "M M",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Love this!!",
      "text": "LOVE LOVE LOVE this! Definitely helps fight the acne due to mask wearing all day everyday. I do blot my face with it via a cotton ball and I spray my mask with it everyday. Starting swing a difference in just a couple days!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Works better than expected",
      "text": "didn't expect it to, but happy to find out that it works. it seems to have reduced the acne on my back.",
      "rating": 5.0,
      "verified": true,
      "author": "Y.C.",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "Does NOT WORK",
      "text": "Do not buy this one. Wont do anything to your skin but causing you more breakouts.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "To inexpensive not to try. It works.",
      "text": "It works well on backne and bikini line issues. The bottle really sprays from all directions. This is my second bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany Campbell",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "No",
      "text": "I used this for what seemed like months and had no changes to my body acne issues. If anything it only dried my back out and made the acne worse. I don't really recommend this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Smadams",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Only 2/3 of the product came?",
      "text": "I haven't used it yet but the bottle came in a half wrapped plastic and came only 2/3 full. I picked it up and it felt light so i looked inside and it wasn't full all the way. Feels like this was part of a 3 pack or someone used it.",
      "rating": 1.0,
      "verified": true,
      "author": "Suzy Han",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Thanks but No Thanks!",
      "text": "It seems to get the job done for the most part; didn't notice any huge improvements while using it but didn't get any additional breakouts or anything. Either way, the bottle was way too small (I thought) and the product once applied, way too sticky. I'll pass.",
      "rating": 3.0,
      "verified": true,
      "author": "N. A. Kovic",
      "helpful_votes": 0,
      "publication_date": 20150424
    },
    {
      "title": "Gets the job done!",
      "text": "I love this product! It is easy to use and I can apply it myself, which is mainly what I was looking for. I’ve seen a lot of improvement in my skin since starting to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Doesn't work.",
      "text": "Super hard to apply to self. Doesn't work at all, at least for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Rhiannon Marshall",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Does nothing but smell bad",
      "text": "Does nothing , Acne Free brand is much better. Assume it has stronger salicylic acid.",
      "rating": 1.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "It works!",
      "text": "Works great! It's hard to spray my back on my own, but the bottle sprays from any direction which helps. But I actually see improvement when I use this!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "My go-to spray for acne (bacne)",
      "text": "Best spray for acne in hard to reach places. Does not stain clothes. I’ve used it for years.",
      "rating": 5.0,
      "verified": true,
      "author": "William Decker",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "I really like this. It's easy to use right out of ...",
      "text": "I really like this. It's easy to use right out of the shower and has helped. I've been using this for about a month and it's stopped new breakouts. I will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "lizzy",
      "helpful_votes": 0,
      "publication_date": 20160826
    },
    {
      "title": "Sprayer gets clogged easily and doesn't spray well",
      "text": "Sprayer gets clogged easily and doesn't spray well. Isn't a smooth pump sprayer if that makes sense. I was hoping to find something similar to the Neutrogena body spray that seems to have been discontinued. This is okay, but not an exact match.",
      "rating": 3.0,
      "verified": true,
      "author": "mocomo",
      "helpful_votes": 2,
      "publication_date": 20160506
    },
    {
      "title": "Body acne cure!!",
      "text": "This stuff is AMAZING! I saw results almost immediately. I used it 2-3 times a day, and now I am down to using it every other day as a preventative. I would recommend this product to anyone. It worked wonders for me.",
      "rating": 5.0,
      "verified": true,
      "author": "K.G.",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "good spray",
      "text": "I find it perfect for my back and shoulders to protect it from acne I love it till now it works with me",
      "rating": 5.0,
      "verified": true,
      "author": "m.I.",
      "helpful_votes": 0,
      "publication_date": 20170326
    },
    {
      "title": "Received more than half empty :(",
      "text": "I just received my bottle today and was excited to try it, but when i opened it I saw it was less than half full. A little bummed out about that.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicole musgrave",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Meh",
      "text": "Shipping was too slow and also I do not even like this product. A bunch of the ingredients are alternative medicine/ herbal BS. I only buy it because there is no better alternative",
      "rating": 1.0,
      "verified": true,
      "author": "Olga Creighton",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Not a fan",
      "text": "Got this to spray in my mask to help with mascne (acne caused by wearing masks) Didn't really seem to make much difference.",
      "rating": 3.0,
      "verified": true,
      "author": "Jacque",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Works!",
      "text": "Works well, sprays upside down, no bad odor, and not sticky. Great product",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah Anderson",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "This products is pretty good! I started using it because it's cheaper ...",
      "text": "This products is pretty good! I started using it because it's cheaper and easier to find than the Neutrogena 180 body spray. I will probably end up buying this again when it runs out, but it gets 4 stars because I still prefer the Neutrogena one.",
      "rating": 4.0,
      "verified": true,
      "author": "Christina A.",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Five Stars",
      "text": "Good for body acne in hard to reach places. Mild enough not to irritate my sensitive skin.",
      "rating": 5.0,
      "verified": true,
      "author": "lizlemon333",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Works well on my back. Took a few weeks ...",
      "text": "Works well on my back. Took a few weeks to see results but now I have no problems when I use it everyday.",
      "rating": 4.0,
      "verified": true,
      "author": "Ellie",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Worked great!",
      "text": "Smells good and worked just as well as my (expensive) Murad body spray I used to buy before!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "effective",
      "text": "This has been very helpful. I noticed a big difference after a couple of days.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie R.",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Easy to use spray bottle",
      "text": "Easy to use spray bottle. I've been using it for a few weeks and don't see any improvement. My back is still breaking out.",
      "rating": 3.0,
      "verified": true,
      "author": "JCSF",
      "helpful_votes": 0,
      "publication_date": 20150805
    },
    {
      "title": "Disappointed",
      "text": "Been using for a month now and see no difference with my acne. Also doesn’t spray well",
      "rating": 1.0,
      "verified": true,
      "author": "Joder  ",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Two Stars",
      "text": "Didn't work. No visible change after weeks of using it, but maybe it's just not for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "It works",
      "text": "I have never use other products so I can’t compare.. But I am very happy with this It works well with my back acne .",
      "rating": 5.0,
      "verified": true,
      "author": "Rie T.",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Satisfied",
      "text": "Not sure if this is helping or the prescribed medication but we are happy with it for my sons back acne",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 0,
      "publication_date": 20160708
    },
    {
      "title": "Please Bring Back in Stock!!!",
      "text": "I love this product! It's so good at keeping zits at bay! I use it on my body and even on my face and everything has cleared right up! I didn't have sever acne but just regular zits here and there and now they are all gone!! Please bring this product back!",
      "rating": 5.0,
      "verified": true,
      "author": "Chihuahua Mama",
      "helpful_votes": 0,
      "publication_date": 20120202
    },
    {
      "title": "Didn't work",
      "text": "I've been using this for almost two months and it has done nothing to clear my body acne. I was very disappointed after seeing that it had gotten so many good reviews, but maybe it just isn't right for my skin type. I had pretty severe acne all over my back, chest, and a little on my shoulders but this spray hasn't made any difference. Also, it leaves a slight stickiness after applying and is difficult to spray upside down.",
      "rating": 1.0,
      "verified": true,
      "author": "Sunshine",
      "helpful_votes": 4,
      "publication_date": 20120412
    },
    {
      "title": "One Star",
      "text": "Did not like the smell, did not work on my skin.",
      "rating": 1.0,
      "verified": true,
      "author": "Krista Rineman",
      "helpful_votes": 0,
      "publication_date": 20170422
    },
    {
      "title": "It's so easy to use and I love it",
      "text": "It's so good, I like it so much, it's so good, it's just a bottle of it",
      "rating": 5.0,
      "verified": true,
      "author": "brian",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "I have bad back acne and after a week of using this",
      "text": "I have bad back acne and after a week of using this, I saw a drastic difference. Will be buying again because I am almost out.",
      "rating": 5.0,
      "verified": true,
      "author": "Emanuel052302",
      "helpful_votes": 0,
      "publication_date": 20170512
    },
    {
      "title": "Worked pretty well on my son's arm",
      "text": "Worked pretty well on my son's arm, back, and chest acne - have to use daily to keep skin clear.",
      "rating": 4.0,
      "verified": true,
      "author": "SAE",
      "helpful_votes": 0,
      "publication_date": 20161224
    },
    {
      "title": "Like this product!",
      "text": "I have gotten good results with this product even when prescriptions wouldn't work.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 0,
      "publication_date": 20161102
    },
    {
      "title": "This product really does work!",
      "text": "This product really works! I was surprised but it only took a little over a week to see results with back acne.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Tingle",
      "helpful_votes": 0,
      "publication_date": 20141223
    },
    {
      "title": "Great natural cure",
      "text": "Works great! An aerosol would be easier to use but still worked well",
      "rating": 5.0,
      "verified": true,
      "author": "Ross A. Sather",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Good product",
      "text": "spray dries rashes and does not dry the skin. has a bit of bluff smell while spraying. good volume. got lost on the way from the spray cap",
      "rating": 5.0,
      "verified": true,
      "author": "Nataly",
      "helpful_votes": 0,
      "publication_date": 20131014
    },
    {
      "title": "Great product!",
      "text": "With Acne on my back it is hard to reach and with this spray it makes that much easier to reach. Feels a little sticky but goes away after a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "Mostly Effective",
      "text": "This product was perfect for spraying on hard to reach areas on my back and shoulders. It does well at fighting acne breakouts that are already existing on your body but does not do a good job at preventing acne from coming back.",
      "rating": 4.0,
      "verified": true,
      "author": "angelbearbp",
      "helpful_votes": 0,
      "publication_date": 20140916
    },
    {
      "title": "Love it!",
      "text": "Dries out body acne in a matter of days! I loved this product! It runs out in about a month, so it lasts quite a while! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 2,
      "publication_date": 20131215
    },
    {
      "title": "Runs out quickly and I didn’t see a huge difference",
      "text": "Runs out quickly and I didn’t see a huge difference",
      "rating": 3.0,
      "verified": true,
      "author": "Lea Dochterman",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Five Stars",
      "text": "my son is using this with the pill/crème and it seems to be helping his acne",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa R.",
      "helpful_votes": 0,
      "publication_date": 20150209
    },
    {
      "title": "Works just like it says!",
      "text": "This stuff is amazing! it works quickly. I would definitely purchase this again...and I have.",
      "rating": 5.0,
      "verified": true,
      "author": "Reader in MD",
      "helpful_votes": 0,
      "publication_date": 20150316
    },
    {
      "title": "VERY easy to use",
      "text": "VERY easy to use, since it sprays from all angles. I've only been using it for about a week, so no real results yet, but I have high hopes!",
      "rating": 5.0,
      "verified": true,
      "author": "LH",
      "helpful_votes": 0,
      "publication_date": 20140815
    },
    {
      "title": "Easy to use but didn't really work for my back ...",
      "text": "Easy to use but didn't really work for my back and shoulder acne. I think I need to just go the doctor and get prescription strength stuff. The 10% stuff worked on my back but went into and bleached clothing.",
      "rating": 2.0,
      "verified": true,
      "author": "Ron Don",
      "helpful_votes": 0,
      "publication_date": 20160609
    },
    {
      "title": "Four Stars",
      "text": "Works great on backacne but bottle doesnt last, so it can get expensive to be re-ordering ever 2 weeks",
      "rating": 4.0,
      "verified": true,
      "author": "Ag",
      "helpful_votes": 0,
      "publication_date": 20141101
    },
    {
      "title": "no luck for me, maybe for others tho",
      "text": "Didn't work for my chest acne.. maybe it would work for someone else?",
      "rating": 2.0,
      "verified": true,
      "author": "tatalin0608",
      "helpful_votes": 0,
      "publication_date": 20140803
    },
    {
      "title": "Half empty",
      "text": "Got this half empty no plastic seal on it at all!",
      "rating": 1.0,
      "verified": true,
      "author": "Cristal",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Five Stars",
      "text": "I love this product. It has helped with my acne a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Tuong Vy",
      "helpful_votes": 0,
      "publication_date": 20160228
    },
    {
      "title": "This product really works. I have been using it ...",
      "text": "This product really works. I have been using it for 4 weeks now and I can really see a difference. Time for me to order another bottle!",
      "rating": 5.0,
      "verified": true,
      "author": "Bonita B.",
      "helpful_votes": 0,
      "publication_date": 20160714
    },
    {
      "title": "Amazing Spray!",
      "text": "I've been dealing with embarrassing body acne on and off since I was 15. I've tried countless body washes, creams, and lotions, and nothing has worked as well as this. It's easy to use, it doesn't leave any residue, and my skin is clearer than it's been in a long time. It's even started to heal the current breakouts I have, and with hope my skin should be completely clear in a few weeks. I just wish I had found this sooner. I will be re-purchasing.",
      "rating": 5.0,
      "verified": true,
      "author": "kmp515",
      "helpful_votes": 0,
      "publication_date": 20150114
    },
    {
      "title": "It works",
      "text": "Purchased this to get rid of a few pimples on my chest. I saw results in two days. I highly recommend if you want to get rid of body acne fast!",
      "rating": 4.0,
      "verified": true,
      "author": "Simplygailg",
      "helpful_votes": 0,
      "publication_date": 20140624
    },
    {
      "title": "Blah",
      "text": "I used the whole thing. Maybe it helped a little. Can't really tell.",
      "rating": 2.0,
      "verified": true,
      "author": "Shaun Aldridge",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Very happy.",
      "text": "No problems. Came quick and as expected. My daughter is excited to start using.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "Works great",
      "text": "I cycle and this helps with some of the saddle sore problems and shaving rashes. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jabirugirl",
      "helpful_votes": 0,
      "publication_date": 20130302
    },
    {
      "title": "It is really helpful for body acne but the spray becomes to work worse and worse",
      "text": "It works when all bottle has been used. I did not feel dryness like some reviewers said. After having a baby I got all my back acned. Now, they are almost gone. Also, it made my skin soft. I reordered another bottle today. However, I gave 4 because when there is quarter of the bottle left, the spray stopped worked under any angle. So, I spray on my palms and apply on the back. It is not comfortable to do.",
      "rating": 4.0,
      "verified": true,
      "author": "Inna",
      "helpful_votes": 0,
      "publication_date": 20150111
    },
    {
      "title": "Second time buying this product.",
      "text": "I have some acnes on my back, and I apply it after showers. After using whole bottle, I can see them dissapearing a bit. So far no complains.",
      "rating": 5.0,
      "verified": true,
      "author": "SJ",
      "helpful_votes": 0,
      "publication_date": 20140304
    },
    {
      "title": "One Star",
      "text": "Product was delivered only 3/4 full with no safety seal.",
      "rating": 1.0,
      "verified": true,
      "author": "M Float",
      "helpful_votes": 2,
      "publication_date": 20170113
    },
    {
      "title": "It works amazing and I'm acne free",
      "text": "This spray has changed my life. It works amazing and I'm acne free. highly recommend for those with body acne.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Four Stars",
      "text": "been using this for 2 days now and can honestly see a difference .",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160412
    },
    {
      "title": "I love it! I've tried a bajillion over-the-counter and prescription ...",
      "text": "I love it! I've tried a bajillion over-the-counter and prescription products over the years (back acne problems since my puberty, now in my 30s), and this is the only one that's made a significant difference. It's true that it won't 100% eliminate everything, but it really helped get things under control. The smell isn't overpowering, it's not too harsh on my skin, doesn't leave annoying bleached marks on my clothes or bedding. I would recommend using it regularly, even when things clear up, as it seems effective at prevention. I'd also echo other reviews that sometimes it's difficult to spray, so maybe invest in a better empty spray bottle, but otherwise I highly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Great product, doesn't dry out skin",
      "text": "I'd only used a Neutrogena spray before, but I couldn't find it in the store. I like this spray and I REALLY like that it doesn't dry out my skin. I bought it because I work out often, so I breakout on my back. Great purchase, will purchase again!",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer N.",
      "helpful_votes": 2,
      "publication_date": 20160215
    },
    {
      "title": "Two Stars",
      "text": "Sprayer stopped working after a few uses. Product seemed to have work..",
      "rating": 2.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20151123
    },
    {
      "title": "Great Product",
      "text": "Had stubborn back acne that seemed to not clear up with any product. Spraying this body spray on my back a couple times a day finally seemed to do the trick! I'd recommend this product to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "ana27",
      "helpful_votes": 0,
      "publication_date": 20110713
    }
  ],
  "product_meta": {
    "title": "Nature's Cure Body Acne Treatment Spray - 3.5 fl oz",
    "description": "Size:3.5Nature's Cure Body Acne Treatment Spray - 3.5 fl oz",
    "rating": 4.3,
    "feature_bullets": [
      "Comes in a specially designed pump that sprays from any angle for treatment of hard-to-reach places",
      "Fights acne caused by sweating and friction from athletic gear and clothing",
      "Contains 2% salicylic acid, dermatologist-tested",
      "Please read all label information on delivery"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4.9 x 3.6 x 1.7 inches; 3.21 Ounces",
      "Manufacturer recommended age": "6 months - 3 years",
      "Item model number": "2038210741",
      "UPC": "885190468522 890839457386 885788863227 701857363668 885120075622 885813334418 885546053679 885812457576 885782596503 020382120431 885677672688 885172456325 885544595829 524883466376 887852102515 701874749292 885861811626 890331580902 885540881933 885248817685 885204791035",
      "Manufacturer": "Nature's Cure",
      "ASIN": "B00027DHYM",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Moisturizers",
      "Skin Care",
      "Body",
      "Beauty & Personal Care",
      "Lotions"
    ],
    "price": 12.92
  }
}