{
  "website_summaries": [
    {
      "verdict": "With a decent capacity and an appealing price, this roaster admirably serves many fans. The best bargain roaster available.",
      "pros": [
        "Solid steel, dependable appliance",
        "Stay-cool handles"
      ],
      "cons": [
        "Temperature can \"run hot\" at times",
        "Smaller capacity than some other models"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Love it!",
      "text": "This was my Christmas present this year from my husband. I've always wanted a roaster but held back because they take up a lot of space when not in use. It is essentially a second oven, you can cook pretty much anything in it. I opened it up right away and cooked our Turkey for Chrismas dinner. It cooked much faster than a traditional oven. I would recommend it to anyone who has the storage since it is quite large. Even if we only use it for holidays and family get together so still think it is well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "MH",
      "helpful_votes": 20,
      "publication_date": 20160215
    },
    {
      "title": "Perfect Roaster for Parties",
      "text": "Perfect Roaster size for a party of 15-20 people and is extremely easy to transport. We utilize the roaster for holidays and family/friend get togethers on a regular basis. The light weight design allows for the roaster to be easily packed and moved and overall works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 8,
      "publication_date": 20171117
    },
    {
      "title": "Great device",
      "text": "Living in a Polish family, for years I have made golobkis in a blue enamel roaster in the oven. I finally broke down and purchased this oven and I LOVE it. Less messy, less kitchen heat and portable. Why did I wait so long?",
      "rating": 5.0,
      "verified": true,
      "author": "karen m",
      "helpful_votes": 13,
      "publication_date": 20161106
    },
    {
      "title": "Great Capacity",
      "text": "You can cook anything you can make in an oven in this roaster. I bought this in preparation for Thanksgiving and to cook my turkey. In less than a month, I have already used this roaster three times to make bake pasta dishes for a large group and love it. I even took it to a soccer game to keep the food warm - all you need is an outlet. I recommend you use liner bags to make clean-up easier. The rack is great for heating frozen foods. The outside does not get too hot.",
      "rating": 5.0,
      "verified": true,
      "author": "A Mead",
      "helpful_votes": 8,
      "publication_date": 20151020
    },
    {
      "title": "Cookwell porcelain chipped off.",
      "text": "The porcelain after several uses, started to rust and the porcelain pieces chipped off into the roaster. I've used it about 2 months when this happened, so I can't return it and I can't put in a claim to American Express. I guess you have to use the liners for this product.",
      "rating": 1.0,
      "verified": true,
      "author": "cmac2006",
      "helpful_votes": 16,
      "publication_date": 20160125
    },
    {
      "title": "Great for summers",
      "text": "Nice size for potlucks and large dinners. Controls are very simple to use. I can bake, roast, or whatever with it.I have used this indoors and out. It is light weight for metal and its size. Great for hot whether. I put it outside or in the garage to keep my house from heating up using standard oven (no central A/C). Quality made from a brand I have a lot of items from in my kitchen.",
      "rating": 4.0,
      "verified": true,
      "author": "Lora Ann",
      "helpful_votes": 4,
      "publication_date": 20160205
    },
    {
      "title": "Bought an amazon warehouse one...what a nightmare",
      "text": "I returned it as it was missing parts and came completely used and unwashed with gravy drippings down its sides. Does the warehouse even check it’s returns!!! This was an absolute joke!",
      "rating": 1.0,
      "verified": true,
      "author": "Naz",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "No Customer Service",
      "text": "Thanksgiving - Dang near burned my turkey. Temperature control knob broke somehow. Tried to call for a replacement and the customer service number does not work and disconnects you. Tried emailing - zero response. Do not buy this! My roaster wasnt even 2 years old! Cant find knob online anywhere. Quite honestly dont even know if this is a company anymore. No one picks up the phone at this place.",
      "rating": 1.0,
      "verified": true,
      "author": "Denise",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Excellent Product; Excellent Service",
      "text": "Ordered the Rival R0230-B 22-Quart Roaster Oven after reading Amazon and other reviews. Hosted a family gathering for Thanksgiving; needed more oven space so the Roaster Oven seemed like the perfect solution. We cooked a 21 lb. fresh turkey in the oven; the turkey fit w/ some room to spare and came out moist and tender. The oven does, however, cook fast; we expected the turkey to be done in 4 hours and it was done in 3 hours following the time guidelines from Butterball. The turkey did come of fully browned; this was a complaint w/ some previous buyers. Excellent product and excellent shipping service from Amazon & UPS. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "FloridaCathy",
      "helpful_votes": 7,
      "publication_date": 20111124
    },
    {
      "title": "Perfect!!!!",
      "text": "I got this just before Christmas, I cooked my ham in it and it came out perfect. If you want fall off the bone food you NEED to have this in your kitchen, I look forward to a roast and brisket. Don't hesitate it's not that expensive and it pays for itself in one meal. My brother in law made a turkey for thanksgiving and it was so moist I couldn't believe it, you don't need spices or anything. ENJOY!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lillie bug",
      "helpful_votes": 2,
      "publication_date": 20151229
    },
    {
      "title": "Perfect for parties or a turkey",
      "text": "This is a great product. I looked at local stores without luck, and found exactly what I wanted at Amazon (again!) The size is great for cooking for a big party or making a turkey. The only complaint is that the light goes off when it hits the desired temp - this should stay on all the time when plugged in. We will get many years of use out of this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea P",
      "helpful_votes": 5,
      "publication_date": 20141102
    },
    {
      "title": "Can't live without it",
      "text": "I use this roaster oven every Thanksgiving when I need to bake a traditional noodle dish and the turkey is taking up all my oven space! This roaster oven comes in handy any time I need more than one oven. When not in use, it is stored away high in a cabinet. I have found this roaster to be very reliable. If you need a second oven, I would seriously consider this low-cost alternative to other ovens.",
      "rating": 5.0,
      "verified": true,
      "author": "P. S.",
      "helpful_votes": 0,
      "publication_date": 20150722
    },
    {
      "title": "RIVAL ROASTER OVEN",
      "text": "I really love the Rival roaster oven. It's exactly as described, and I use it to bake cakes, deserts, and roast all sorts of meats and chicken. When not in use, I store non perishables inside. Perfect! It remind me of my mother's.",
      "rating": 5.0,
      "verified": true,
      "author": "Margie Baby",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Amazing turkey",
      "text": "Purchased this on a whim to make a turkey. BEST kitchen purchase this year. The turkey was beyond tender. The meat fell right off the bone and everyone raved about how good it was. Not bad for having ALL the family over (in-laws and step parents / divorced parents included!)",
      "rating": 5.0,
      "verified": true,
      "author": "Maya B",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Hamilton Beach roaster oven) and is good looking. I expect it will heat up just ...",
      "text": "I just received this oven yesterday, so have not used it yet. It is light weight (much lighter than my 22 Qt. Hamilton Beach roaster oven) and is good looking. I expect it will heat up just fine and do its job. I will use it only to bake sweet and regular potatoes. Why only three stars? the electric cord is only two feet long. Two Feet! I will have to run an extension cord. My Hamilton Beach oven has a six foot cord, which reaches the outlet and is convenient. For what they charge, can't Rival put four more feet on their cord?",
      "rating": 3.0,
      "verified": true,
      "author": "Bo Tidie",
      "helpful_votes": 3,
      "publication_date": 20140919
    },
    {
      "title": "Great oven space saver!!",
      "text": "My daughter-in-law has this same roaster and she LOVES it, so I decided to buy one since my oven is very small and when I have a turkey in, I don't have any room for anything else. This really solves the problem. I don't know why I didn't think of it sooner. The turkey doesn't get \"crispy\" brown like in the oven, but it does brown up and tastes great. The only thing I would like to see is a glass (see-through) lid so you could see when the turkey (or roast, etc.) is getting brown without removing the lid. Otherwise, it works great and the price is definitely well worth any minor shortcomings.",
      "rating": 4.0,
      "verified": true,
      "author": "Avid Shopper",
      "helpful_votes": 4,
      "publication_date": 20110105
    },
    {
      "title": "This is pretty good and ridiculously low priced",
      "text": "This is pretty good and ridiculously low priced. It's nice to have as a back up oven, particularly when hosting several people. But in my opinion, the temperature runs moderately hotter than stated. Therefore, either set it lower or pull your animal out nice and early to check the meat temperature. Last week I pulled my turkey out 45 minutes before indicated and it was absolutely done, son.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve D",
      "helpful_votes": 4,
      "publication_date": 20141204
    },
    {
      "title": "Rival 18 Quart",
      "text": "This is great for large birds. I use this for turkeys at family gatherings. Keeps everything warm and moist. I can't imagine a large cookout without one of these. The Rival has held up well, and is easy to transport. You really can't beat this for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Professor H",
      "helpful_votes": 6,
      "publication_date": 20150728
    },
    {
      "title": "Long Lasting",
      "text": "Still using after eight years. It's a bit hard to clean and the interior finish is gradually going away but I bet this roaster outlives me.",
      "rating": 4.0,
      "verified": true,
      "author": "My Name Is Nobody",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Needed addition to kitchen",
      "text": "My daughter's kitchen has only one oven...not good when the holidays roll around. We never have room to cook all the food. This was definitely worth the money. My only complaint, if you want to call it that...the turkey breast skin was not the usual brown crusty skin I am used to having. The legs and thighs were great...just not the breast. I would definitely recommend this to anyone. I think someone just starting out would really appreciate this addition to their kitchen. I would have 40 years ago.",
      "rating": 4.0,
      "verified": true,
      "author": "Ella Bell",
      "helpful_votes": 0,
      "publication_date": 20121229
    },
    {
      "title": "This frees up the oven on turkey day.",
      "text": "This frees up the oven on turkey day. The secret to browning the crockpot turkey is using olive infused hellman's. It moistens with olive oil and the egg component browns the turkey. Wine sauce doesn't do so well in the crockpot. It has a tray insert, so don't spend money on those fancy turkey stabbers as it lifts itself. For goodness sake, do not buy those expensive baggies that melt the plastic. What were they thinking? Get a crockpot big enough to do the job. I recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "gumby4yoga",
      "helpful_votes": 0,
      "publication_date": 20130613
    },
    {
      "title": "Great for cholent!!",
      "text": "If your looking to make a big cholent this is the way to go!! For those not jewish-cholent is a food us jews eat Saturday morning but because we can’t use fire on the sabbath it must cook from Friday afternoon-hence the slow cooker! Try it, it’s great!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "cooks well, but lacking everywhere else",
      "text": "Heats up fast, and cooks evenly, but fit and finish is a bit lacking. Cooking surface is prone to sticking (as compared to an older nesco), and roasting well has sharp edges that scare me every time I pick it up. Lid hanger thing is useless unless unit is placed on very edge of the table. Overall, not impressed with the product, but it serves its purpose, and cooks well.",
      "rating": 3.0,
      "verified": true,
      "author": "arbrick",
      "helpful_votes": 3,
      "publication_date": 20141006
    },
    {
      "title": "Cooks a Good Turkey",
      "text": "I have made two turkeys in this roaster with great success! Just make sure to read the instructions and keep the lid ON!",
      "rating": 4.0,
      "verified": true,
      "author": "Paul T",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Wish I'd Bought One Sooner",
      "text": "A versatile appliance that took me too long to discover. Have yet to roast a turkey, but have done lots of chickens and pulled pork. You can cook 2 beer can chickens standing upright at the same time. After about 6 hours on low heat, the meat is spoon tender and you can debone in minutes. Great for stocking the freezer for quick meals later. Doesn't heat up the kitchen like a stove. Only drawbacks are it's a large appliance, so it takes up lots of storage space when not in use, and the lid is very thin and bends/warps easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Lodge2",
      "helpful_votes": 0,
      "publication_date": 20111221
    },
    {
      "title": "Instead of a Double Oven",
      "text": "At my son's house there is a double oven but I can never use the top one because I am not tall enough. I always wanted a double oven to make large meals easier to handle. Now I have the answer. A roaster oven does the same job at the least amount of money and leaves my kitchen oven free for other things. Just one word of advice. The roaster oven takes longer to reach the desired temperature and each lifting of the lid makes for even more cooking time so plan accordingly.",
      "rating": 4.0,
      "verified": true,
      "author": "Bideford",
      "helpful_votes": 5,
      "publication_date": 20110926
    },
    {
      "title": "Had one for years. Of all the things the ...",
      "text": "Had one for years. Of all the things the ex took in the divorce, this was it. Had to buy a new one. Only thing I noticed with this one versus the old one , the grate in the bottom used to place food in or lift it out is MUCH thinner than the one I had previously.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew M. Moog",
      "helpful_votes": 2,
      "publication_date": 20161209
    },
    {
      "title": "Love it",
      "text": "So far I've fixed a huge pot of vegetable soup and roasted a chicken. Both turned out perfect. I bought this because crock pots are just too small. This works every bit as good and does not burn at the bottom. This was my main concern and I'm happy it doesn't.",
      "rating": 5.0,
      "verified": true,
      "author": "Fritz The Cat",
      "helpful_votes": 2,
      "publication_date": 20150114
    },
    {
      "title": "Bigger is Better",
      "text": "I have used a 4 Qt Nesco for many years and love it, lets me not have to use my stove oven. But I wanted a larger Roaster to be able to do full size baking as well as the occasional turkey or roast. I have used Rival products for decades and trust the brand. The sale price on this unit was just to good to pass up any longer. It cleans up well and eliminates the use of the big stove oven which wastes heat and energy. I am very pleased with this unit.",
      "rating": 5.0,
      "verified": true,
      "author": "mikef",
      "helpful_votes": 2,
      "publication_date": 20130213
    },
    {
      "title": "Used for Thanksgiving Dinner",
      "text": "I cooked my 12-pound Thanksgiving Turkey in this, and it was ready in 2.5 hours. It was way easier than the oven, and if you leave the lid closed the turkey will basically baste itself. My only complaint was that the skin never got crispy. But it heats up and cooks quickly and was easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Clara Nicole Roberts",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Awesome",
      "text": "made the best pulled pork for 75 people in this... fantastic! all I ever dreamed of having!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ruby0201",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Works great!",
      "text": "Great for large dinners . Frees up the oven for other foods.",
      "rating": 5.0,
      "verified": true,
      "author": "DKR",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Really Big!!!",
      "text": "Wow!! I had heard great things about this roaster and am so pleased that I purchased it. Two weeks after the purchase I cooked a 22lb turkey for my herd and it turned out excellent. I did not however get the browning as other reviewers suggested. So, I basted with a little kitchen bouquet and that satisfied for the browning, plus added a little more flavor to the skin. This was also easy to clean, although awkward. Keep in mind, this is a big appliance to store, but in my case, well worth the investment.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Fritz",
      "helpful_votes": 0,
      "publication_date": 20120213
    },
    {
      "title": "I love this roaster",
      "text": "I love this roaster, I'm not by no means a cook, but I gave it a try and roasted a turkey and came out juicy and delicious.",
      "rating": 5.0,
      "verified": true,
      "author": "MGy0193",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Best Turkey I've had",
      "text": "This made a great turkey in about 2/3rds the time I would have liked a thicker lid. This one feels a little chintzy",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Roaster Oven - Wonderful to have!",
      "text": "I find that I use a roaster oven several times a year for various items. I have not tried to bake anything as I hear others do, but my soups, stews and meat are always great made in these. This is my second Roaster oven as my first one \"only\" lasted about 25 years before the thermostat was damaged in a move. Couldn't live without one for long!",
      "rating": 5.0,
      "verified": true,
      "author": "dmc55",
      "helpful_votes": 10,
      "publication_date": 20111016
    },
    {
      "title": "Roaster oven",
      "text": "I love this roaster oven. This oven is great for small turkeys, to roast a duck, bake rock Cornish hens, and bake chicken too. Great for pasta dishes. Great to heat up food. This oven can be used everyday. I am purchasing a second one to help with holiday cooking. It is easy to clean, and it is light weight.",
      "rating": 5.0,
      "verified": true,
      "author": "cheryl ouidad",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Just Love it",
      "text": "I just received it today. It is very Large & just what I was looking for. It's very nice looking. A wonderful Addition to my kitchen",
      "rating": 5.0,
      "verified": true,
      "author": "Bonney Bee",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "and it works great. There are two small vents in the lid",
      "text": "Using this for sous vide cooking, and it works great. There are two small vents in the lid, one near each side of the handle. Even on a long cook cycle (30 hours) at 160°F, I lost almost no water through those vents. I actually haven't yet used this for its intended purpose, but it seems like it would work.",
      "rating": 5.0,
      "verified": true,
      "author": "RJ",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "Just opened the box! Awful",
      "text": "Just opened the box today as I have a graduation I must cook for. The entire side of the roaster is caved in. because I have no time to go get another I must use it. What a waste of money. Sad part is the box itself was in good condition. Very disappointed!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Kim Cobb",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Wow, does this thing really work. Would give ...",
      "text": "Wow, does this thing really work. Would give it 5 stars, but Rival, even after several years of this product, still hasn't made it compatible with food trays for use as a chaffing buffet. This feature is one of the selling points for the 20 qt model. Guess Rival just doesn't want to sell accessories for this model. Their choice to leave money on the table...",
      "rating": 4.0,
      "verified": true,
      "author": "Chef Amok",
      "helpful_votes": 0,
      "publication_date": 20141215
    },
    {
      "title": "Best money I have spent in a long time.",
      "text": "I actually don't have a lot of pots and pans and no bakeware so I wanted something that I could use for both and it works great because I can control the temperature .",
      "rating": 4.0,
      "verified": true,
      "author": "Leslie A .Lowe",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Best turkey ever!",
      "text": "This roaster made the BEST turkey ever! No kidding. Put onions, celery, carrots & a bay leaf a little water or broth in the bottom, put the turkey breast side DOWN and leave it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. B",
      "helpful_votes": 2,
      "publication_date": 20140920
    },
    {
      "title": "A wonderful product! I recommend anyone who's in need of ...",
      "text": "A wonderful product! I recommend anyone who's in need of this kind of roaster oven, to purchase it! Works great as a warmer too! Thank you again for the timely shipping and handling! :-) Susana",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "performs very well",
      "text": "This is my second Rival roaster. I love the capacity. The temp settings are similar to a full size oven and it is easy to clean. Would definitely recommend. Just be sure to have counter space. The roaster is quite sizeable.",
      "rating": 4.0,
      "verified": true,
      "author": "Gee Gee",
      "helpful_votes": 0,
      "publication_date": 20150710
    },
    {
      "title": "Great purchase on a budget",
      "text": "I took this out of the box thanksgiving morning and used it right away. Cooked my turkey perfectly! I am so happy I bought it. It is nothing fancy, but does the job, but gets extremely hot!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly B",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "Love it!",
      "text": "This is a great little oven. I have had it over a month. I bought it because the oven on my stove went out right before Thanksgiving. I have baked a 21lb turkey, cornbread, peach turnovers and more with great success. It has been a great replacement for my oven.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda W.",
      "helpful_votes": 6,
      "publication_date": 20111212
    },
    {
      "title": "Good product",
      "text": "It worked very well but took a little longer for it to heat the food up then was expected.",
      "rating": 4.0,
      "verified": true,
      "author": "Valerie J. Osborn",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Big size",
      "text": "Great for heating frozen food. It should roast a big bird. Heat is felt outside, be careful. Great alternative to a oven. Love the rack for lifting.",
      "rating": 4.0,
      "verified": true,
      "author": "Hactic Bidster",
      "helpful_votes": 0,
      "publication_date": 20160710
    },
    {
      "title": "Huge",
      "text": "Love this roaster. It came very quickly and is the largest one I could find..",
      "rating": 5.0,
      "verified": true,
      "author": "Terry C.",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Terriic",
      "text": "How did I survive without one of these before? Cooked a turkey in it (TERRIFIC), kept lots of tortillas warm for several hours. So grateful for this extremely useful kitchen \"appliance\"!",
      "rating": 5.0,
      "verified": true,
      "author": "sewgr8nct",
      "helpful_votes": 0,
      "publication_date": 20160125
    },
    {
      "title": "Convenience",
      "text": "It cooked my Thanksgiving Turkey overnight ... when there's no extra room in the oven, \"The day of ... \"",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie-Jean",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Very easy to use. Nice size to cook a large meal.",
      "text": "Worked like a charm! Nice size. I want to buy a second one!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Oviedo",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Cooks a perfect Turkey",
      "text": "The cooking time was impressive compared to a normal oven and the finished turkey was crispy brown on the outside. The oven produced a juicy 18 pound bird in just over 3 hours of cooking time. The turkey was thawed in the refigerator for three days from it's frozen state. The cleaning afterwards was effortless and took less time than it did to eat the bird. Overall a product that performs what it claims.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Wells",
      "helpful_votes": 4,
      "publication_date": 20120121
    },
    {
      "title": "Roaster worked nicely.  Happy with results.",
      "text": "Our family used this to make our Thanksgiving turkey this after I found a few methods to cook it in a roaster. We took the plunge and were very pleased with how it came out. It does cook super fast, so I will likely cook it at an even lower rate next year (325 and it was done about an hour sooner than I projected). I used a probe thermometer and was happy I did that otherwise it may have over-cooked. If you want to save oven space for the sides, I recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Harris",
      "helpful_votes": 0,
      "publication_date": 20131129
    },
    {
      "title": "I love this roaster oven",
      "text": "This roaster oven is deep enough to do a 20 lb. turkey or large enough to do two 10 lb pork butts. I love it. The cook times are true to the recipes I followed and you just can't beat the meat that comes from it. It is easy to clean and store. The cord is short, intentionally, so it doesn't accidently get pulled off the countertop.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie Horn",
      "helpful_votes": 0,
      "publication_date": 20121211
    },
    {
      "title": "Great product, great price!",
      "text": "This is exactly what I needed and for an incredible price! when I ordered these at first I was worried that they'd be cheap, but after using them I think the quality is pretty great. The settings are easy to use and it heats up quicker than I thought it would. Great for a slow cooker and great to heat a meal and serve. I recommend getting this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Openshaw",
      "helpful_votes": 0,
      "publication_date": 20131206
    },
    {
      "title": "Work great.",
      "text": "Makes wonderful food and cooks perfectly! I love it! But beware, after only several uses it started to show a few rust spots. I've started to oil the inside of my cooking well liner now after I wash it.",
      "rating": 4.0,
      "verified": true,
      "author": "Melissa E Morrison",
      "helpful_votes": 0,
      "publication_date": 20140814
    },
    {
      "title": "Burning rubber smell first time i turned it on",
      "text": "Disappointed. After I turned it on for the first time, i started smelling burning rubber. Then I saw a small wisp of smoke rising from the machine. I turned it off and I am now in the process of returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Vabruushka",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Works great! We have a big family and sometimes our ...",
      "text": "Works great! We have a big family and sometimes our main oven is in use, since everyone eats at different times due to work and school. Really handy and easy to use!",
      "rating": 5.0,
      "verified": true,
      "author": "Tammi M",
      "helpful_votes": 0,
      "publication_date": 20150925
    },
    {
      "title": "Five Stars",
      "text": "Bought it as a gift because I have one that they love",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "You get what you pay for!",
      "text": "This is a very flimsey product. I dropped the lid from a height of 3 feet and dented the edge. Now it does not fit tightly, rendering the unit useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Trixieann",
      "helpful_votes": 4,
      "publication_date": 20160118
    },
    {
      "title": "Four Stars",
      "text": "I've cooked a lot of things in it since I've had it since august 2015. It works great and we clean it good but smokes a lot when we remove the lid to check on something, does this happen to anyone else?",
      "rating": 5.0,
      "verified": true,
      "author": "shirley",
      "helpful_votes": 0,
      "publication_date": 20150910
    },
    {
      "title": "Needs a power indicator light.",
      "text": "The cooker NEEDS a light to tell when the power and/or heat is on. We thought about returning it for that reason. Other than that, it works fine.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve Moore",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Great Roaster Oven for Large Meals!",
      "text": "The roaster oven works very well and is pretty easy to use. I like that I can cook large patches of food at one time. The only thing I dislike is that it is bulky and very hard to store.",
      "rating": 4.0,
      "verified": true,
      "author": "Patrick & Emily",
      "helpful_votes": 0,
      "publication_date": 20160312
    },
    {
      "title": "my roaster",
      "text": "I do love this roaster. I use it when I'm making a lot of something for a large group or just for making something to put in the freezer. Especially stuffed cabbage rolls and stuffed peppers. Also a roaster full of lima bean soup to freeze. I usually let it all cook overnight and it's ready the next morning. The roaster is great and so easy to clean after using. I have recommended it to my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula Palone",
      "helpful_votes": 0,
      "publication_date": 20130128
    },
    {
      "title": "BIG BIG BIG, Works GREAT",
      "text": "Was looking for a Crock pot that was big enough for 2 chickens or turkey and found none, I did a Amazon search for 12 quart crock pot and found this, 18 Quart cooker, works great holds 2 chickens, potatoes, carrots, celery, gravy, wine all at once, my wife's new best friend,,, for a family of 5 this works!",
      "rating": 5.0,
      "verified": true,
      "author": "POPMUZIK",
      "helpful_votes": 2,
      "publication_date": 20131228
    },
    {
      "title": "Burning insulation inside",
      "text": "Wow- Really stupid to build the unit with flammable insulation around the roaster pan. We smelled something burning the first time we plugged it in, and immediately unplugged it. We took it apart and found burned insulation all around the pan. We might try to use it now that we removed the insulation, but I doubt it. Update: We returned the item. Even after removing the insulation, it still reeked of burned insulation.",
      "rating": 1.0,
      "verified": true,
      "author": "Avid gardener",
      "helpful_votes": 33,
      "publication_date": 20151126
    },
    {
      "title": "... had a Rival roaster that was black and I loved it. This one is a tiny bit smaller",
      "text": "I had a Rival roaster that was black and I loved it. This one is a tiny bit smaller, but the white has stolen my heart. It's so nice looking in my kitchen! Good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Spicy Mamma",
      "helpful_votes": 0,
      "publication_date": 20150722
    },
    {
      "title": "NICE QUALTIY AND GOOD PRICE",
      "text": "many are expected to a gathering, all ovens are working either cooking or warming. It is wonderful to have the extra roaster for my large turkey. It cooks it evenly. The turkey always comes out juicier and tastier than in the regular oven and without care. The one drawback is that the turkey will not brown. Removing it from the roaster to the oven for 15 min at a high temp will brown it. However, I have found that it is o.k. not to \"present\" the whole turkey to the table, to carve it in the kitchen, and to carry the platters of beautifully cooked meat to the guests.",
      "rating": 5.0,
      "verified": true,
      "author": "AMIN",
      "helpful_votes": 2,
      "publication_date": 20131114
    },
    {
      "title": "Very BIG !",
      "text": "I purchased this to replace my 7 qt. Rival crockpot that was 18 years old ( rip) ... This thing is amazing. It is large ,so I hope you have the counter space .. but it is a great slow cooker or back up oven if ya don't want to heat the whole house in the summer time with your regular oven. Very pleased",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20160605
    },
    {
      "title": "Super Roaster",
      "text": "I am pleased with this roaster. I have baked in and used it for making meals for large groups and everything works as described. I baked rolls at 400 degrees and it worked perfectly without making the outside of the roaster too hot. If I had to fault it I would like to have a heavier lid.",
      "rating": 4.0,
      "verified": true,
      "author": "xrtclarke",
      "helpful_votes": 6,
      "publication_date": 20110823
    },
    {
      "title": "Large and Perfect!",
      "text": "GREAT! Purchased for my husband (who is the cook in the family) and he's in love. He makes whole chickens and veggies in it. It is rather large but that is exactly what we had wanted. Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "MommaT.",
      "helpful_votes": 0,
      "publication_date": 20140820
    },
    {
      "title": "This thing is great. I never use my oven any more",
      "text": "This thing is great. I never use my oven any more. It makes the best roast chicken ever.",
      "rating": 5.0,
      "verified": true,
      "author": "J. K. Anderson",
      "helpful_votes": 0,
      "publication_date": 20160814
    },
    {
      "title": "It is so great to be able to use the entire oven for ...",
      "text": "Bought this for my daughter. She has used it many times and loves it! It is so great to be able to use the entire oven for side dishes, and not have to worry about the turkey or whatever you are roasting....",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Deane",
      "helpful_votes": 0,
      "publication_date": 20150211
    },
    {
      "title": "Just what i need!",
      "text": "I have a small stove and oven...and i had a small get together at my apt for my closest friends. Apart from the dishes I prepared I was out of oven space and this gave me a great pull out in baking a smoked ham while my oven was baking a casserole. Great investment and love it!",
      "rating": 5.0,
      "verified": true,
      "author": "CCall",
      "helpful_votes": 0,
      "publication_date": 20130409
    },
    {
      "title": "Thrilled with this roaster",
      "text": "I shopped and shopped before buying this electric roaster. I read a hundred reviews and worried if I was going to like anything. I finally settled on this one and bought it through Amazon. I did not have to set it outside or in my garage the first time I used it. I just washed it good and cooked a delicious butt ham with no smoking or stinking at all. I have used it several times since. It cleans easily. I like the size. I really don't think you can go wrong with this roaster. Enjoy.",
      "rating": 5.0,
      "verified": true,
      "author": "C. OLSON",
      "helpful_votes": 9,
      "publication_date": 20111209
    },
    {
      "title": "Five Stars",
      "text": "Worked really well and holds a lot of meat or anything else you need to cook in it.",
      "rating": 5.0,
      "verified": true,
      "author": "sarasmiles",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "Rival Roaster Oven",
      "text": "I purchased this oven for my daughter to make the Thanksgiving turkey - the turkey was fabulous - so juicy and tasty. We also used it to make pulled pork - once again the results were outstanding. clean up is easy and cooking is even easier - just put in the food and let it cook.",
      "rating": 5.0,
      "verified": true,
      "author": "Wayne G",
      "helpful_votes": 0,
      "publication_date": 20101229
    },
    {
      "title": "I love it. I cooked this years turkey and a ...",
      "text": "I love it. I cooked this years turkey and a prime roast in it and it turned out great.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20161124
    },
    {
      "title": "Nice Roaster Oven - Cord Too Short",
      "text": "The cord is made way too short so you have to find an outlet that you can get to. Nice roaster, just too short of a cord.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20150801
    },
    {
      "title": "It's okay...",
      "text": "On the second use, the finish inside started to fade and isn't holding up. It did cook the turkey in record time, and it was a little jucier than the oven.",
      "rating": 2.0,
      "verified": true,
      "author": "M. Fisher",
      "helpful_votes": 4,
      "publication_date": 20130627
    },
    {
      "title": "Worth the money",
      "text": "Worked as it should, turkey came out, nice and browned, EZ to clean",
      "rating": 5.0,
      "verified": true,
      "author": "BJ Elliott",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Great roaster! Love the larger size as it comes ...",
      "text": "Great roaster! Love the larger size as it comes in handy when we cook for a large crowd at church on Wednesday night!",
      "rating": 5.0,
      "verified": true,
      "author": "cajungypsy",
      "helpful_votes": 0,
      "publication_date": 20160723
    },
    {
      "title": "works perfectly",
      "text": "This roaster is a good buy. I use it for not only for turkey but also to cook many other things and it is doing the job perfectly. It is big so it is a little bit space consuming and it is a little bit hard to wash if you have a small sink with no spray attached, but i am happy I bought it",
      "rating": 5.0,
      "verified": true,
      "author": "ThatGuy",
      "helpful_votes": 0,
      "publication_date": 20121210
    },
    {
      "title": "Rival Roaster Oven- Like it!",
      "text": "This made Thanksgiving a much easier and enjoyable day. No longer having to jockey dishes around a bird taking up most of the oven, and everything cooks quicker because the oven door isn't opening / closing all morning. The turkey did cook much quicker than anticipated but it was easy enough to lower the temp on the Roaster Oven and not think about it until it was time to slice and serve. Everyone said it was juicy so no worries about it being too dry. Just be mindful of it and check on it.",
      "rating": 4.0,
      "verified": true,
      "author": "AA",
      "helpful_votes": 0,
      "publication_date": 20121203
    },
    {
      "title": "It is great to use for a Crowd cooking",
      "text": "I love this Roaster. I used it to make bbq ribs for a crowd. The came out excellent",
      "rating": 5.0,
      "verified": true,
      "author": "Ann M Vogel",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Its awesome",
      "text": "You can bake and roast in this oven. It has a removable tray inside for easy clean up. This is my second one of these",
      "rating": 5.0,
      "verified": true,
      "author": "Tinna",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "I Love this Roaster Oven",
      "text": "I Love this Roaster Oven, works Amazing! I cooked a turkey for thanksgiving with this oven, AWESOME, everyone didn't believe that this roaster oven cooked that good, with little time or effort!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170615
    },
    {
      "title": "Works great. Added a timer so now it's perfect",
      "text": "Use to heat wraps in treatment room. Works great. Added a timer so now it's perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Kinder Kowalski",
      "helpful_votes": 0,
      "publication_date": 20150902
    },
    {
      "title": "great roaster",
      "text": "I bought this roaster to use for buffets and potlucks at work. I tried it last weekend, I roasted two whole chickens. It did a wonderful job. I'm glad I bought it. I feel like I have a spare oven now. I didn't think the clean up was difficult at all, I sprayed the inside with PAM, things cleaned up nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia J. Nunn",
      "helpful_votes": 0,
      "publication_date": 20110308
    },
    {
      "title": "Great product",
      "text": "I bought 2 we use them at work to cook they are great!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Excellent product!",
      "text": "This was a gift for a dear friend, and he absolutely loved it! Made deer sausage in it, and was surprised at the capacity. Excellent product!",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20150426
    },
    {
      "title": "Five Stars",
      "text": "used it for turkey and then prime rib. Frees up the oven for other dishes",
      "rating": 5.0,
      "verified": true,
      "author": "R. Mommy",
      "helpful_votes": 0,
      "publication_date": 20160206
    },
    {
      "title": "I am soo happy",
      "text": "I love my new roaster oven it is not the one my mom gave that was stolen but it is bigger and does get the job done just as well, I have use more than anything and will find more things to cook in it.",
      "rating": 5.0,
      "verified": true,
      "author": "miatika",
      "helpful_votes": 0,
      "publication_date": 20130806
    },
    {
      "title": "turkey roaster",
      "text": "I bought this last minute, realizing I didn't have the oven space for all that I wanted to make for Thanksgiving. It worked wonderfully, providing us a beautifully prepared turkey/dressing and ample juice for gravy.",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy A. Kennedy",
      "helpful_votes": 0,
      "publication_date": 20101219
    },
    {
      "title": "I put 7 pounds of ribs in it and 6 hours later they were amazing.",
      "text": "This roaster kick it. I put 7 pounds of ribs in it and 6 hours later they were amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20150909
    },
    {
      "title": "fantastic price! works as good as the Nesco",
      "text": "fantastic price! works as good as the Nesco. Use it often and regularly! excellent value",
      "rating": 5.0,
      "verified": true,
      "author": "Diana-Faye L Todd",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "Good value",
      "text": "It had a bit of an odor first time I used it.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Great deal! Great buy! Completely HAPPY!!!",
      "text": "Worked wonderful, easy set, easy clean up.. would buy again.. loved it",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20200201
    }
  ],
  "product_meta": {
    "title": "Rival Roaster Oven, 18-Quart, White (RO180)",
    "description": "Size:18-Quart| Color:WhiteEasily prepare meals on holidays and special occasions with the Rival 18-Quart Roaster Oven. This versatile roaster oven handles a variety of cooking applications, including baking, roasting, and slow-cooking, and it has a large capacity that can accommodate turkeys and roasts up to 22 pounds. The adjustable temperature range from 150 to 450 degrees Fahrenheit makes this roaster ideal for preparing a wide variety of dishes. Additionally, the convenient warming setting keeps your food at an ideal serving temperature. And thanks to its removable rack and roasting pan, this roaster oven is easy to clean.",
    "rating": 4.6,
    "feature_bullets": [
      "Versatile roaster oven designed to roast, bake, warm, and cook",
      "Even heat distribution for perfectly for moist, tender results",
      "Accommodates roasts and turkeys up to 22 pounds",
      "Adjustable temperature from 150 to 450 degrees F",
      "Removable steel rack and pan make cleanup simple"
    ],
    "specifications": {
      "Product Dimensions": "23.5 x 17.5 x 9.8 inches",
      "Item Weight": "14.32 pounds",
      "Department": "Small Appliances",
      "Manufacturer": "Rival",
      "ASIN": "B000G0HPEI",
      "Item model number": "RO180",
      "Customer Reviews": "4.6 out of 5 stars682 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#132,802 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 5, 2003"
    },
    "categories": [
      "Small Appliances",
      "Rotisseries & Roasters",
      "Home & Kitchen",
      "Ovens & Toasters",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}