{
  "website_summaries": [
    {
      "verdict": "A basic pump-driven machine that is highly functional and also compatible with 'Easy Serving' espresso pods.",
      "pros": [
        "Features a substantial 35-ounce water tank that's easily removable",
        "Has an added frother for making cappuccino, latte, and more",
        "The controls are basic and easy to use",
        "A nice and compact design"
      ],
      "cons": [
        "Some buyers find this machine too noisy"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "2 years to breakdown, like clockwork",
      "text": "I like my coffee MY way and this machine gives me the thick crema and steam frothing power the way I want it at a reasonable price. The down side is that this is my 3rd machine of this model in 6.5 years and it just bit the dust again. The first one died a bit faster, but they seem to last on average 2 years. I prefer this model because it has plenty of room under the drip and under the steam wand to use my larger cups. Don't be foolish like I was 2 years ago and skip the 4 yr warranty. I fully expect to get my money's worth on the next one.",
      "rating": 4.0,
      "verified": true,
      "author": "SMP",
      "helpful_votes": 3,
      "publication_date": 20190626
    },
    {
      "title": "capsules and it works great. Considering what is available on the market for ...",
      "text": "I purchased it 4 years ago and have been using it almost every day since, typically twice a day, and never had any trouble. I am from Italy and have high expectations for coffee, and this machine delivers as expected. Even my family visiting from Italy was impressed by the quality of the coffe (note: I live in Miami and I only use espresso coffee, which is readily available here). I typically use ground coffee, but I also tried the E.S.E. capsules and it works great. Considering what is available on the market for expresso machines, I think this is the best quality for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Massimilian Galeazzi",
      "helpful_votes": 3,
      "publication_date": 20171123
    },
    {
      "title": "You have to be prepared to descale it every 3 months",
      "text": "This product from day one has performed poorly were the frother is concerned. After frothing the milk it drips all over your top and is really a bad design. I bought mine August 2018, never descaled it, and am now recycling it at Staples (thank you for your great recycling efforts). The manufacturer directs you to descale the machine every 3 months using a special descaling solution. I have had other machines for years and managed to get away with not descaling them. Very disappointed in this product",
      "rating": 1.0,
      "verified": true,
      "author": "Caroline",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Makes terrible espresso!",
      "text": "Makes terrible espresso! I am really baffled why the manufacturer makes such shallow coffee holders, that cannot provide more than 3 sips decent coffee. On the other hand the water container is the size of regular coffee machines. Complete nonsense! I will be returning this one. It takes me 4 makings to get the coffee I used to get in one with the old EC-5. The manufacturer needs bring back that model, as all the new ones in affordable range are no good.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Short lifespan",
      "text": "This is my second DeLonghi machine. Both worked well for about a year and a half (once-daily use), then the pump lost its ability to generate sufficient pressure, resulting in the coffee dripping slowly one drop at a time instead of flowing from the dispenser. Both machines were descaled regularly. I use coffee pods and clean the filters regularly, so they are definitely not plugged. Since both machines experienced the same problem after a relatively short time, it appears that these machines are cheaply made and not durable.",
      "rating": 2.0,
      "verified": true,
      "author": "Galadriel_123",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Great-tasting espresso in a smaller form...",
      "text": "Great-tasting espresso in a familiar, albeit smaller and somewhat more flimsy, form. We had this machine's predecessor and enjoyed every cup of espresso over 5-6 years, until it finally gave up the ghost! This new machine is smaller (including a smaller water reservoir) and doesn't feel as solidly built, but time will tell whether it can live up to its predecessor...in the meantime, we'll enjoy each and every cup!",
      "rating": 4.0,
      "verified": true,
      "author": "PSG",
      "helpful_votes": 0,
      "publication_date": 20160928
    },
    {
      "title": "Inexpensive for good reason.",
      "text": "Watery shots, no matter the grind size I used, the way I packed with tamper or various beans I tried it with. Nothing I could do worked to get a decent shot and I know how to make an espresso. My Breville finally bit the dust so I figured I would give this inexpensive little machine a shot but really I should have known better...its just not a high quality machine.",
      "rating": 2.0,
      "verified": true,
      "author": "Frederick E. Koch",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Best value espresso coffee maker money can buy",
      "text": "Compact design. Solid materials. Quick operation. What many people need to understand is the type of coffee to use - pick Lavazza Crema e Gusto and press hard before you insert holder into machine to avoid hassle and headache. One more thing to extend life - always clean up the pressure output and the visible part after making your coffee- Enjoy!",
      "rating": 5.0,
      "verified": true,
      "author": "Vladi",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Poor quality",
      "text": "After very little use, it stopped working. Really poor durability. Coffee was ok, acceptable for the price, but durability is unacceptable.",
      "rating": 1.0,
      "verified": true,
      "author": "tbuyer",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Great machine, but doesn't last long enough to justify cost.",
      "text": "At first I LOVED this machine. Replaced my occasional Starbucks, and my home made lattes were better than in the store. However, three months in of moderate use (roughly every third day) it stopped working--no espresso, just a sloooooow drip. I unscrewed the filter, taking apart some of the components, cleaned them and tried again. Mildly better for two brews then again, no espresso. Tried vinegar flush, spent more money on De'Longhi specific cleaner. Nothing has worked. I am very disappointed and I want my money back.",
      "rating": 2.0,
      "verified": true,
      "author": "Dorothy Danforth",
      "helpful_votes": 2,
      "publication_date": 20140802
    },
    {
      "title": "Great Buy",
      "text": "I had another De'Longhi model that worked great, but this is better, sturdier. The entire machine doesn't move when you use the presser thing. The cup doesn't move all over the place when machine is brewing. More room for a taller espresso cup. I wasn't sure I needed a new espresso machine but I'm glad I got it. Makes a great cup of espresso. Came in 1 day, not 2 with Prime.",
      "rating": 5.0,
      "verified": true,
      "author": "Leanne Raley",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Toss away the K cups!  It’s Homemade!",
      "text": "It’s called a retro style. But if you want a Cappuccino or Lattes your way, this is it. And not wasting plastic cups, like K cups!",
      "rating": 5.0,
      "verified": true,
      "author": "Craig D.",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Cheap but effective",
      "text": "Steam wand doesn't move more than an inch side to side so it's hard to steam milk at certain angles, and the machine isn't heavy enough to support the pull needed to Insert the coffee grounds filter, but all in all it's a cheap espresso machine that gets the job done and that's all I wanted!",
      "rating": 4.0,
      "verified": true,
      "author": "Trish Meza",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "A few drops of crema",
      "text": "I give it 3 stars because it foams the milk like you wouldn't believe - BUT - like other reviews said it doesn't produce but a smidgen of crema. It's sad, I was looking forward to trying this machine and I thought I could work my magic and get more crema but no. I watched so many videos because I convinced myself I was doing something wrong and poured over the instructions and still only a few drops of crema. Otherwise the espresso tasted like burnt coffee beans. Going to return this and look for another machine :/",
      "rating": 3.0,
      "verified": true,
      "author": "StarlaBathory",
      "helpful_votes": 0,
      "publication_date": 20141107
    },
    {
      "title": "Does not last - 3 in the last year",
      "text": "I love this product except for one thing - it's lifespan. I've had three in the last year and Amazon replaced them, until now when the latest one, bought in September 2014 stopped working. Now I have to fight with DeLonghi which I gather is not a great idea. I have now had enough of them break to say, don't do it. The problem each time is that after the first few months of good coffee, it starts releasing steam through the seals and then stops making espresso. Milk steamer still works but coffee doesn't. It's an expensive toy at this rate.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20141020
    },
    {
      "title": "it looks nice I replace one I had for few years Capresso ...",
      "text": "it looks nice I replace one I had for few years Capresso but they don't make anymore, it was great and very simple. This one when you put on to warm up it start to leak water in the cup while is steaming the cup, so I have to empty the cup before I start to make the coffee, otherwise the coffee. comes very weak. Too much work in the morning while I am trying to wake up and get my coffee ready. I am trying to see if improve and stops otherwise I have to return.",
      "rating": 2.0,
      "verified": true,
      "author": "Margie",
      "helpful_votes": 0,
      "publication_date": 20150705
    },
    {
      "title": "Thumbs UP!!!",
      "text": "After owning cheaper machines and having bad experiences, decided to invest a little more and made the right choice. I've had it for more than a year now and bought specifically for espressos and works really good! Excellent price for nice espressos. Havent given me any problems. Easy to clean, easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Have used this for a very long time. Love it.",
      "text": "I've been meaning to come back and post a review of this. Love it! I bought it based on reviews I read. There was another model that looked just like this BAR32 Retro Pump Espresso BUT it was not the same model, only looked just like it. The reviews on that model were pretty bad. So I got this one \"BAR32 Retro Pump Espresso\" and it's worked wonderfully for such a long time. It's been so long I can't even remember when I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "P Moore",
      "helpful_votes": 0,
      "publication_date": 20150824
    },
    {
      "title": "Good for one year and then pump pressure falls low",
      "text": "I got this machine and the De'Longhi EC155, one for the office and one for at home. Both were working great for one year, and then the pump lost the ability to generate sufficient pressure, so that now the coffee drips quite slowly, rather than flows from the dispenser. Lime residue (calcium carbonate) is not an issue, as we live in an area with soft water, and as I descaled the machines regularly. I also use the same ground coffee in these machines as when I bought them, so a coffee that is ground too fine is not an issue either. If you want something that lasts, don't buy these.",
      "rating": 3.0,
      "verified": true,
      "author": "JK",
      "helpful_votes": 0,
      "publication_date": 20120402
    },
    {
      "title": "7 Years Later Still Working Great",
      "text": "I love this machine. Clean the lines if you lose water pressure. I cant tell you the value it has added to each and every day. I use Lavazza Creme and its better than anything I get at the store. One of the best investments ever for my kitchen and home.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Marrone",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Nope",
      "text": "From the very first use, the water POURED out of the steam wand while making espresso. Also the handle was difficult to turn into place, and since the whole unit was very light weight, you need to hold the whole thing down while turning the handle to keep it from sliding all over your counter.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura The Music Teacher",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "After a few mods, this $80 machine can perform almost as well as $300 Silvias & Brevilles.",
      "text": "I have a love/hate relationship with this machine. I love that this is a basically a disposable espresso machine, where after a few mods, you can be cranking out shots like a proper Silvia or even $300 Brevilles. The biggest annoyance of mine however, is how inconsistent some shots could be. Having tested for and eliminated operator error, I'm absolutely certain that the pump on this machine isn't consistent shot to shot. It is reasonably acceptable for a machine in the lowest tier of espresso making, but I wish some things were better thought out (spurting frothing wand, useless plastic tamper, water dripping below machine considered normal etc.)",
      "rating": 3.0,
      "verified": true,
      "author": "C. Dang",
      "helpful_votes": 2,
      "publication_date": 20140708
    },
    {
      "title": "Great Coffee Maker",
      "text": "This machine makes great espresso and has taken the place of all of the previous coffee makers I've tried. I add some boiling water to the espresso for an Americano, and can make one cup at a time, which is great since I'm the only coffee drinker in the house. For one or two people it's so much easier than a coffee maker - hardly any clean up - and there's no waste like there is with pods and K-cups.",
      "rating": 5.0,
      "verified": true,
      "author": "Maine Shopper",
      "helpful_votes": 0,
      "publication_date": 20151114
    },
    {
      "title": "Fell flat for me...",
      "text": "The machine I received seemed to work correctly, excepting that it diddnt. The pump seemed very weak, couldn't get a good pull. Having used both steam and BAR pumps.... This may have a pump, but it felt more like a lower end steam machine. This experience drove me to repair my Gaggia color , until I can replace it.",
      "rating": 2.0,
      "verified": true,
      "author": "Ogre",
      "helpful_votes": 0,
      "publication_date": 20150226
    },
    {
      "title": "great coffee. Also",
      "text": "Received on time, packaged well and makes decent coffee. Only thing is you must watch carefully when brewing espresso to stop brew midway, or it keeps brewing thus making more watery and less strong espresso taste. If you watch while brewing and stop flow midway, great coffee. Also, once done keeps dripping so must put napkins so it doesn't make a mess. Overall, great coffe, but with a few user tweeks.",
      "rating": 2.0,
      "verified": true,
      "author": "JustMe",
      "helpful_votes": 0,
      "publication_date": 20150110
    },
    {
      "title": "I almost sent it back due to the poor quality and slowness of getting an espresso or cappuccino",
      "text": "Ive had many espresso maker. This one took a while toward right, I almost sent it back due to the poor quality and slowness of getting an espresso or cappuccino. How ever after finding just the right grind of espresso coffee its working well. The stem jet for making froth takes time to quit putting out hot water and getting to doing steam but when it dose it works great. A little more BAR's on the pump might make a difference. Just a little slow but good.",
      "rating": 4.0,
      "verified": true,
      "author": "Lynn Miller",
      "helpful_votes": 0,
      "publication_date": 20141113
    },
    {
      "title": "Not as convenient/good as expected",
      "text": "Bought as a replacement for a Krups machine that was capable of making 4 cups worth of espresso at once - too bad this machine can only make 2 cups worth at once. The machine is somewhat loud and the resulting brew can be weak. Because there is a reservoir for water, you have to babysit the cycle and stop it manually otherwise it will keep on pumping out water/coffee. The reservoir needs refilling more than expected. Frother works well.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Olivo",
      "helpful_votes": 0,
      "publication_date": 20150117
    },
    {
      "title": "Useless after 3 months",
      "text": "The unit's pump can no longer provide enough pressure to force the water through the espresso grounds. It simply drips now. I've opened up the machine and cleaned everything I could find to see if maybe some grounds are clogging the system. The only part I didn't open up to clean was the heat and pump unit. Since it is a hunk of junk right now, I might as well, can't break what's already broken.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephen Blaising",
      "helpful_votes": 0,
      "publication_date": 20140605
    },
    {
      "title": "Makes a good cup of espresso",
      "text": "This is an excellent espresso maker for the price. My only complaint is the lack of an auto-shutoff. The biggest first-world problem in my life is not the minute I have to wait as the espresso brews, but it also seems like it would have been pretty easy for the manufacturer to include a timer that shuts off the machine after a minute. It does brew a nice, strong cup of espresso and the steamer wand works great, though.",
      "rating": 4.0,
      "verified": true,
      "author": "airon",
      "helpful_votes": 0,
      "publication_date": 20150220
    },
    {
      "title": "Great for the money.",
      "text": "I am just a novice espresso maker, so take this for what it's worth. The machine works as described. The espresso is a bit weak, but it is a $100 machine and not a $2500 machine. I recommend the machine for the price. It looks good on the counter top. The instructions are clear. I think that the only thing that I could complain about is the frother because it is kind of close to the machine and low to the counter surface. Otherwise it is a great machine and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Z. J. Garcia",
      "helpful_votes": 0,
      "publication_date": 20130605
    },
    {
      "title": "Don't buy it and save yourself tons of troubles!",
      "text": "I bought it on Sep, 15, 2017 and received it on Sep, 18, 2017. I started to use it on Sep, 19, 2017 and made 3 cups of coffee per day. It stops working on Jan, 25, 2018. And warranty from AMAZON expires in November. Had to buy a new one. Never trust DeLonghi any more. In conclusion, don't buy it and save yourself tons of troubles.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Very good coffee!",
      "text": "So far, so good - this machine makes excellent coffee and is easy to use and keep clean. I've seen comments about the plastic nozzles through which the coffee comes - might be nice if they were metal, but I can't picture trouble in that area, as it seems like pretty durable plastic. The pump can deliver though pretty tightly-packed coffee, although my grinder doesn't go to ultra-fine, your mileage MAY vary if you grind it to dust and pack it ultra-tight. I'd recommend this espresso machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe B",
      "helpful_votes": 0,
      "publication_date": 20130226
    },
    {
      "title": "It would be great if it lasted longer but",
      "text": "After 4 years of daily use (about 2000 espressos), the pump no longer has enough pressure. It would be great if it lasted longer but, that's about $0.05 per espresso and, while it was working, it make an excellent espresso. I'm replacing it with the exact same product.",
      "rating": 4.0,
      "verified": true,
      "author": "JOEBARNEY",
      "helpful_votes": 0,
      "publication_date": 20160731
    },
    {
      "title": "great little espresso maker for the money",
      "text": "Best espresso maker for the money. When using it with lavaza Rosa espresso ground you get a wonderful creamy espresso. Espresso is better then way more expensive models. It needs to warm up and better, run one empty pull to clean the filter an heat up the machine. Also clean after 200 shots as it otherwise gets to much calzium build up and ruins the machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Ute K.",
      "helpful_votes": 0,
      "publication_date": 20150202
    },
    {
      "title": "Perfect manual pump machine!",
      "text": "I recently purchased the Bar32 through Amazon to replace a worn out machine. For the price this you just can't beat this machine. 1 its self priming 2 this machine could sell for much more. Other competitors price the same machine between $125 to $150 dollars. I just received it today. I've brewed three doubles and have no problems and perfect cream and takes about 25 seconds a shot. This is just an early review and I'll update it later. Update: 8/21/15 Still going strong five years later! Update: 8/31/16 Still working well after six years!",
      "rating": 5.0,
      "verified": true,
      "author": "Ian Matthew Waits",
      "helpful_votes": 0,
      "publication_date": 20100908
    },
    {
      "title": "Very good value espresso maker",
      "text": "Very good value espresso maker. For one person twice a day it is sufficient. The wait time for it to be ready is average 30 mins. Lifespan is around one year. However, I replace with this same one every year. The ones cost way more wouldn't last much longer; only may be a little quicker or hold a bit more steam.",
      "rating": 3.0,
      "verified": true,
      "author": "Bruce S. Wyen",
      "helpful_votes": 0,
      "publication_date": 20150707
    },
    {
      "title": "Great conveniece",
      "text": "i live in a very small town with a coffee shop that is never really open. So we decided to get this for our random cappuccino and frozen coffee cravings. It works great, but it's much louder than I expected. Easy to use, easy to set up. PROBLEM: the milk frother/steamer is very, very, very low to the counter because it's not a large machine. I suggest you buy a separate steamer/frother to use instead of the one included.",
      "rating": 4.0,
      "verified": true,
      "author": "leftfoot",
      "helpful_votes": 0,
      "publication_date": 20140616
    },
    {
      "title": "Worth the Counter Space!",
      "text": "It heats fast, producing good espresso quickly. Nice steam wand for frothing. I did not see that it had a built-in tamper and purchased a separate tamper tool. I'm glad I did so that I can feel good about the pack pressure. The drip flow out of both nozzles is not consistent, so I do not expect to fill two espresso cups at the same time. I'm happy I bought it am really like the reservoir for no fuss drink making!",
      "rating": 4.0,
      "verified": true,
      "author": "JimB",
      "helpful_votes": 0,
      "publication_date": 20150611
    },
    {
      "title": "Works pretty well. However",
      "text": "Works pretty well. However, if you place a traditional espresso fine grind in there, it will take FOREVER to get a few shots. The pup just isn't strong enough to process. I usually grind mine slightly more coarse to make my espresso and that works well. Definitely good enough for home espresso making.",
      "rating": 4.0,
      "verified": true,
      "author": "Sandra L Edinger",
      "helpful_votes": 0,
      "publication_date": 20151120
    },
    {
      "title": "A keeper ...",
      "text": "Hard to believe that I have had this espresso maker for 3 years now. I have used it 3-4 times daily, so that's about 5000 cups of espresso. No problem, still makes a great cup of coffee. De'Longhi is a keeper!",
      "rating": 5.0,
      "verified": true,
      "author": "barry",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "Dead on arrival - Read the 1 star reviews before buying!",
      "text": "This had such a high rating that I assumed it was a good product, however I really wish I'd read all of the negative reviews on here first. The unit turns on and you can hear the pump working, however the water level does not change and it never actually makes espresso. The quality of this model seems to be poor and I wish more people would come back on here to update their reviews once they've actually had it for a while.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Goldstein",
      "helpful_votes": 2,
      "publication_date": 20130107
    },
    {
      "title": "2nd defective DeLonghi machine!",
      "text": "I had another DeLonghi espresso machine that I got for Christmas '14, and 2 months later, it started to leak all over the counter whenever we used it. I called Amazon and they were awesome about it, sent a return label and refunded the card it was purchased on, so we bought another one. This was a \"step up\" and was originally $100 more than the first. It came in the mail yesterday, so I set it up and made an espresso, and IT LEAKED all over the counter again, this time from the gasket where the espresso cup goes in. So disappointed and annoyed to have to keep doing all of this runaround for my coffee!!",
      "rating": 1.0,
      "verified": true,
      "author": "gregg FISHER",
      "helpful_votes": 0,
      "publication_date": 20150218
    },
    {
      "title": "Lost faith in Delonghi quality",
      "text": "This is the second one I have bought. The first one lasted a little less than 2 years before it started leaking. I was happy with the product until it started leaking so I bought another one. This one started leaking after only two months. Will not by another De'Longhi product. I am now shopping for a fully automatic espresso machine.",
      "rating": 2.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 2,
      "publication_date": 20150606
    },
    {
      "title": "Overall very happy with this purchase",
      "text": "Overall very happy with this purchase. My only major rub is that the frother does not get the milk hot enough on the first pass, I always have to do it 2 times if I want my drink piping hot (otherwise it's just warm and then cools off way too fast). It does make very good espresso though and for the price, it was a really good deal IMO :)",
      "rating": 4.0,
      "verified": true,
      "author": "Bellz",
      "helpful_votes": 0,
      "publication_date": 20150204
    },
    {
      "title": "Not reliable.",
      "text": "Used this less than a year and the pump is dead. Made great coffee in the meantime. But really want something that is consistent and will work for more than 9 months. Additionally, when I purchased this machine it was $80 now it's priced over $200. The machine is plastic, don't buy it for $200.",
      "rating": 1.0,
      "verified": true,
      "author": "Angela Boyle",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "This isn't the best coffee, but it's darn good",
      "text": "This isn't the best coffee, but it's darn good! It's a good machine, and easy to use. Just make sure your coffee isn't ground too fine or it might clog the filter piece. I use mine every day, and like it a lot. It's a good way to save money while still enjoying good coffee and cappuccinos everyday.",
      "rating": 4.0,
      "verified": true,
      "author": "JAKE",
      "helpful_votes": 0,
      "publication_date": 20140809
    },
    {
      "title": "Small and efficient",
      "text": "I bought this as a gift for my brother. He is very happy and enjoys fresh coffee every day.",
      "rating": 5.0,
      "verified": true,
      "author": "Mitra",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Very good machine!",
      "text": "I love this espresso machine. I upgraded to this pressure model after having a steam-driven model previously. I love it! It makes a good cup of espresso with good crema. It took a little experimenting to get the tamping and everything just right, but after the slight learning-curve, I'm now consistently making a good espresso. I haven't tried the pods yet, so can't comment on that feature. The machine has been easy to clean and takes up less space than I anticipated. Overall, very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr.Karie",
      "helpful_votes": 0,
      "publication_date": 20110202
    },
    {
      "title": "Completely lost pressure after 1.5 year of use! :((",
      "text": "We have had this machine for about 16 months and now it completely stopped working. No water is coming out. We use bottled water to avoid scaling. And we have tried everything - cleaning all possible parts. Even if I run it without coffee in the filter, the water doesn't go through, so it is clearly a low pressure issue. Too expensive for a 1.5 year of useful life!",
      "rating": 2.0,
      "verified": true,
      "author": "Svetlana Symonenko",
      "helpful_votes": 0,
      "publication_date": 20161124
    },
    {
      "title": "Guaranteed to Fail- JUNK",
      "text": "I can guarantee that this machine will fail. It is poorly constructed and the pump will eventually not pump water.",
      "rating": 1.0,
      "verified": true,
      "author": "aopq",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Works Great for me",
      "text": "Got this almost 3 years ago as a gift to self and no problems at all. No home machine could make a cafe made espresso. I really like the Starbucks PODS but seems that they are no longer available. I tried Illy but was no match to Starbucks (IMHO).I have used Lavazza grinds and they are aweaome but many times I'm too lazy to mess with them. I'm going to try the ESE PODS. I'm sure they are exxcellent.",
      "rating": 5.0,
      "verified": true,
      "author": "K9Cousin",
      "helpful_votes": 0,
      "publication_date": 20131010
    },
    {
      "title": "Liked this but needs a better safety shut off to ...",
      "text": "Liked this but needs a better safety shut off to protect the unit from stupid folks like me. I left the unit running when I was distracted by something happening at home. Next thing I know the pump motor is fried. Blows the electrical circuit when turned on. It was my fault it failed. Some sort of safety device may have saved the unit from me.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20151002
    },
    {
      "title": "No more Starbucks",
      "text": "Love my lattes but tired of the price at Starbucks. I've made do with regular coffee and lots of creamer/milk but nothing beats the taste of expresso and steamed milk. I am very happy with making my own - and this expresso machine has made it possible. Not a true expresso drinker or coffee expert - but I love the lattes I make with this one. Easy to use and is attractive on my counter.",
      "rating": 5.0,
      "verified": true,
      "author": "RE",
      "helpful_votes": 0,
      "publication_date": 20140607
    },
    {
      "title": "A great answer to I just want a little coffee",
      "text": "The greatest aspect of this little brew machine is the water holder in back. My old little espresso machine would only take one cup of water at a time and I had to let the unit completely cool before starting a second drink. I can brew, steam, and brew again with this little machine. I just wish the instructions had been clearer. Now, if they'd come out with a little K-cup adapter, it'd be perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Avid Reader",
      "helpful_votes": 0,
      "publication_date": 20130318
    },
    {
      "title": "Cheap and working!!",
      "text": "For the price very good deal. Four years every day min 4 espresso -no problems!!",
      "rating": 5.0,
      "verified": true,
      "author": "jujuki",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "the steamer tube is too short making it difficult to ...",
      "text": "the steamer tube is too short making it difficult to remove heated milk without spilling. and yes I bought the EP-12 stainless cup not enough room. and after one week water is already dripping out of the steam tube while I am making coffee drips on my hand and the counter",
      "rating": 3.0,
      "verified": true,
      "author": "Gerald C.",
      "helpful_votes": 0,
      "publication_date": 20150127
    },
    {
      "title": "I like it for the price",
      "text": "I've had this for about 6 months now and it's still performing. I like it for the price. Make sure you clean it and take it apart every 6 months or so like you are supposed to. Not the best espresso machine ever, but gets the job done for an apartment. Steamer quality is OK. It works, but not the best. I would recommend this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Mad Scientist",
      "helpful_votes": 2,
      "publication_date": 20150112
    },
    {
      "title": "First Pump Espresso and Cappuccino Maker",
      "text": "So far so good. I am new to this and followed the instructions carefully. Bought ground expresso blend coffee to start and it is delicious. The ESE pods are harder to find. The Keurig cups are all over the place. I like being able to use ground coffee or pods. The creamer is perhaps a little weak, but I am getting the hang of it and made a little heart out of the foam on my third try.",
      "rating": 4.0,
      "verified": true,
      "author": "Sally Olivier",
      "helpful_votes": 0,
      "publication_date": 20130521
    },
    {
      "title": "De'Longhi Bar32 Espresso and Cappuccino Machine",
      "text": "I love it! I love it! It is easy to use even for a novice like me. I was looking for an uncomplicated, inexpensive machine that would be easy to clean and make a cappuccino like we got hooked on in Italy. The De'Longhi Bar32 is it! It is about the size of a coffeemaker, attractive enough to sit on the counter, and can make 4 cups of cappuccino or espresso as quickly as a pot of coffee. My one complaint, if you can call it a complaint, is that my coffee mugs were too tall and I had to buy some really cute cappuccino and espresso cups to fit the machine.",
      "rating": 5.0,
      "verified": true,
      "author": "PJT",
      "helpful_votes": 0,
      "publication_date": 20110714
    },
    {
      "title": "Water not hot enough",
      "text": "I tried to make espresso several times with this but the water never got above 120 degrees, even when following the instructions word for word. You can't make good coffee/espresso if the water doesn't get hot enough to extract the coffee from the bean. I called the De'Longhi customer service number and they are supposed to send me another one. It's been at least 2 months since I've purchased this and have yet to start making the cappuccino I envisioned. Hopefully, I will get the new one soon and it will live up to all the good reviews I read about it.",
      "rating": 1.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 0,
      "publication_date": 20130527
    },
    {
      "title": "Nice",
      "text": "I bought this as a gift for my husband after a trip to Rome where he got hooked on Espresso. It was not difficult to set up and learn how to use, and he now uses it every day. It makes a really good, very hot espresso while giving the maker control over the brewing process - not just inserting a pod like so many of the machines out there, though that is an option. It's a real little workhorse.",
      "rating": 5.0,
      "verified": true,
      "author": "Island girl",
      "helpful_votes": 0,
      "publication_date": 20130802
    },
    {
      "title": "AWESOME especially for the price",
      "text": "Makes a great brew!! Steamer wand is weirdly springy but everything else is superb",
      "rating": 4.0,
      "verified": true,
      "author": "Pen Kayne ",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "it doesn't seem like the seal from the filter fits tightly with the ...",
      "text": "Our just purchased Delonghi Bar 32 espresso maker leaks from both left and right sides and when we use it. We have reviewed the instructions, and tried to use it several times. It leaks every time. We have reviewed the troubleshooting booklet, the Delonghi website and various youtube videos without success. It seems broken to us. To us, it doesn't seem like the seal from the filter fits tightly with the seal inside the unit. The unit also seems to have 'an electric burning smell'.",
      "rating": 1.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Great investment!",
      "text": "We LOVE this machine. Very simple to use and makes excellent expresso. We have also tried the frothing function and were able to make lattes with ease. Great buy and investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Naenaechem",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "The coffee is awesome, it’s simple to use and you can’t beat ...",
      "text": "I’ve ordered 5 of these for family and friends over the last few years. The coffee is awesome, it’s simple to use and you can’t beat the price. I e owned way more expensive expresso machines in the past and this one is by far the best in quality and price.",
      "rating": 5.0,
      "verified": true,
      "author": "Ludlow, MA",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Hands down, the best value for your money",
      "text": "I've had this machine for about a year and it works very well. If you grind Starbucks full grain coffee from Costco and add diluted vanilla concentrate to your coffee it matches very closely the flavor you get at the store. I only used distilled water on the machine to minimize cleaning and prolong the life of the machine. Eventually you will have to clear the pinholes on the stainless steel coffee filter with a pin. Do not go out and buy new filters like I did before discovering this...",
      "rating": 5.0,
      "verified": true,
      "author": "Tony A",
      "helpful_votes": 0,
      "publication_date": 20140321
    },
    {
      "title": "Great coffee. Nice foam",
      "text": "Great coffee. Nice foam. Easy and quick to use. I really don't miss the Keurig!!!!! The little extra work to empty and fill with coffee is really worth it, and it's as quick if not quicker. I've only owned it for a few days, so we'll see how long it lasts, but so far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "mbc",
      "helpful_votes": 0,
      "publication_date": 20150224
    },
    {
      "title": "Quality Espresso Machine",
      "text": "This machine is very easy to use and delivers a great cup of espresso. It is very reasonably priced as well. I love the capability to make two cups at once. I took other reviewers advice and bought a metal tamper. I haven't tried the built in tamper, but it looks like it could be a bit flimsy. Great product!",
      "rating": 4.0,
      "verified": true,
      "author": "S.M.",
      "helpful_votes": 0,
      "publication_date": 20140109
    },
    {
      "title": "Good & fast espresso, with a some minor annoyances",
      "text": "While making espresso is simple & easy with this machine, I really am irritated by the fact that the steam wand doesn't stay in place while steaming milk! Very annoying to have to try and force it back in place to avoid hitting the coffee filter. Also, it seems that a bit too much water gets mixed in with the milk while steaming. Is there any way of fixing this? I just noticed that I can't return this since it's been opened and used, but how would I have found this out without trying it out first????",
      "rating": 3.0,
      "verified": true,
      "author": "Mauiann",
      "helpful_votes": 0,
      "publication_date": 20140131
    },
    {
      "title": "Espresso filter and filter holder contain quite a bit of ...",
      "text": "Espresso filter and filter holder contain quite a bit of plastic. I was very dissapointed since I expected a stainless steal filter. The Espresso filter itself seamed quite small to me. The first time I turned the machine on all the water of the water tray leaked onto the counter top. I tried it again and it leaked again. I returned the Espresso maker to Amazon.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "Great Cappuccino Maker!",
      "text": "If you're a cappuccino maker on a limited budget, this is the machine for you. It's well built, and is very easy to clean. You will need smaller cups for this guy instead of the standard large mug that most of us cherish. Nevertheless, it's a well build machine, easy to clean, and fun to use! I bought a second one this week for my boss, as she is very fond of coffee at the office.",
      "rating": 4.0,
      "verified": true,
      "author": "N Paul",
      "helpful_votes": 0,
      "publication_date": 20110705
    },
    {
      "title": "Best Espresso Maker Yet",
      "text": "This is the best (so far) machine I have owned. It makes great espresso and nice froth. It is a little fussy about using only the \"perfect grind\", but once I figured this out, is good. The frothing wand works OK, but personally, I'd prefer one without the fancy air mixer. I was a little disappointed that a great Italian coffee machine maker would ship their product to PRC (China) for manufacture.",
      "rating": 4.0,
      "verified": true,
      "author": "alkaiserstx",
      "helpful_votes": 0,
      "publication_date": 20121229
    },
    {
      "title": "Other than that it works great..",
      "text": "They need to work on the steam wand. Either it needs to be in a different location or longer so it can accommodate a larger pitcher. Other than that it works great...",
      "rating": 4.0,
      "verified": true,
      "author": "Jon Pulicicchio",
      "helpful_votes": 0,
      "publication_date": 20170518
    },
    {
      "title": "Nice machine, but it doesn't work properly.",
      "text": "Amazon sold this Le'Longhi BAR 32 Retro 15 BAR Espresso and Cappuccino Maker as a reconditioned product, with a guarantee that it works. It doesn't work properly. When you turn the espresso maker on and the ready light turns on, it turns off after less than 10 seconds, resulting in espresso that is lukewarm, not hot. When you use the milk frother, it continues to make espresso, which dilutes the espresso.",
      "rating": 1.0,
      "verified": true,
      "author": "Kent",
      "helpful_votes": 2,
      "publication_date": 20141218
    },
    {
      "title": "Poorly built, only lasted one year",
      "text": "It only lasted one year under relatively low usage (used on average once a day). The water tank disconnects very easily and leaks water. Cheap product that I'd discourage!",
      "rating": 1.0,
      "verified": true,
      "author": "Marco",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Great machine Great price",
      "text": "I have had this machine for about 2 months and am very happy with the mochas I can make at home. The espresso has that beautiful crema consistency, and the steamer for the milk produces great foam. I find the machine easy to use and clean. I am able to make mochas equivalent to the best coffee bars. This is a great machine and a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20091012
    },
    {
      "title": "Makes great creamy espresso!",
      "text": "Machine is compact, handsome and well made despite using had plastic. It delivers a cup of espresso equal to any bar in Italy and having lived there for over 30 years I think that is a supreme compliment to deLonghi. Italian brand coffee is a must; Lavazza, Illy, are my favorites.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Gerard",
      "helpful_votes": 0,
      "publication_date": 20131013
    },
    {
      "title": "Great machine and looks great.",
      "text": "I only use this about once a week so I don't need a heavy duty machine. This machine works perfect and make great coffee drinks. Heats up quickly and makes two cups of espresso just right. Great price. Foams milk just fine. Easy to clean up. I found the machine is made with high quality materials. Fun to use.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Megert",
      "helpful_votes": 0,
      "publication_date": 20140930
    },
    {
      "title": "Four Stars",
      "text": "We have been using it almost every day since Feb 2018. Going strong!",
      "rating": 4.0,
      "verified": true,
      "author": "michael.MM",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "very unhappy annoying when its first thing in morning you have to ...",
      "text": "very unhappy annoying when its first thing in morning you have to go to work and water tank isn't passing the water to your cup. Only had it 2 months. After reading all these reviews shouldn't have to be so complicated yet many are having same problem. Called customer service. They want copy of receipt which I'm supplying and they will send me another water tank but that's really not the problem. Whole product is not to its expectation. Never again",
      "rating": 2.0,
      "verified": true,
      "author": "Janette Kerr",
      "helpful_votes": 0,
      "publication_date": 20151231
    },
    {
      "title": "good product except for the water tank",
      "text": "I like everything about this product except the water tank on the back. It is hard to 'seat' on the water intake, and sometimes it pulls off if I pick up the maker. It then spills water over the counter. Why didn't the manufacturer engineer a closed tank that fits better?",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140109
    },
    {
      "title": "Very nice looking, good enough for the countertop, but not happy with strength of the coffee",
      "text": "I use a De'Longhi steam espresso maker and wanted to switch to a pump machine. De'Longhi is a well known and respected name and I've enjoyed the steam version for years. But, this pump machine does not make espresso as strong as I like it. I can't seem to make it any stronger and think it is due to the fact that you can't put as much coffee grinds into the holder with this machine than you can with the steam version. Also, I bought some pods as the advertisement said you can use them in this machine, and the Krups I bought don't fit. Seems you have to use a smaller version which I've been unable to find.",
      "rating": 3.0,
      "verified": true,
      "author": "william c dodge",
      "helpful_votes": 0,
      "publication_date": 20140102
    },
    {
      "title": "Great machine",
      "text": "Loving it so far! I just use this to make shots for iced lattes but did test the steam arm. Currently using with Illy ESE pods and loving the results considering I am just branching out into making my own espresso at home.",
      "rating": 5.0,
      "verified": true,
      "author": "Marissaaah",
      "helpful_votes": 0,
      "publication_date": 20150629
    },
    {
      "title": "Great machine for the price",
      "text": "I was looking for an inexpensive machine to make latte and this fits the bill. Simple process, and it works like a charm. It gets 4 of 5 stars because I have since discovered that I need a timer to turn the thing off - as I have left in on a couple of times. With a timer it gets a 5. Small issue is having to unscrew the frothing head after each use to clean it. It's easy to do but time consuming if you are in a rush",
      "rating": 4.0,
      "verified": true,
      "author": "Daydreamer",
      "helpful_votes": 0,
      "publication_date": 20121227
    },
    {
      "title": "Not happy with this machine",
      "text": "The lid to water reserve comes apart when opened. The frothing arm is not high enough and it's hard to get frothing pitcher from under without spilling. I even have to use a shorter coffee cup than usual because of lack of height for it. I should have returned this expresso maker but didn't so I will live with it until it breaks.. Wouldn't buy another like it. Hope this helps others.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20111221
    },
    {
      "title": "Five Stars",
      "text": "so far so good, makes great Cappuccino and worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "doodi20",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Really good value",
      "text": "I've had this for about a month, and use it anywhere from 2-10 times a day, depending on the day of the week and who's at the house. Delighted with it, no trouble at all, the frother is fine and easy to keep clean. The water reservoir is easy to keep an eye on, the machine heats up quickly; I've got no complaints at all. Much better value than a more expensive machine I had some time ago.",
      "rating": 5.0,
      "verified": true,
      "author": "slightlyfleury",
      "helpful_votes": 0,
      "publication_date": 20121104
    },
    {
      "title": "Works Great",
      "text": "We've had this espresso maker for over a year now and it's done everything we want it to do. This is our first one and we are not esprsso pros so we feel we made the right choice for the money. One complaint would be that the steam nozle is very low to the counter top, so you have to move the unit to the edge of the counter to get any decent size cup under it.",
      "rating": 4.0,
      "verified": true,
      "author": "robbrue",
      "helpful_votes": 0,
      "publication_date": 20070512
    },
    {
      "title": "Five Stars",
      "text": "Easy to use. Brews the best espresso. Clean up and storage is perfect for a small kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Angie Pfeifle",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Mornings are much better now!",
      "text": "Love this product and the ease of use! I went from never using an espresso machine to whipping up lattes in no time! The milk frother is so easy to clean as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "This is a great espresso maker",
      "text": "This is a great espresso maker. We like to use the Lavazza Gran Crema Espresso single dose pods with it and it works wonderfully with minimal mess and cleanup.",
      "rating": 5.0,
      "verified": true,
      "author": "LJ Veteran",
      "helpful_votes": 0,
      "publication_date": 20150709
    },
    {
      "title": "Broke almost instantly",
      "text": "We had this machine for a week and than had to return it. The cappuccino jet frother just stopped working. It would produce steam but not foam. It was ok while it worked so I'm giving it two stars instead of one. Other cons to consider: - instruction manual is horrible - espresso is very weak; our Krups steam espresso maker made much stronger coffee Pros: - relatively easy to operate, once you decipher the manual - nice crema All in all I would NOT buy this machine again. Going from a steam to a pump espresso maker, DeLonghi BAR32 was a big disappointment.",
      "rating": 2.0,
      "verified": true,
      "author": "coffee-toffee",
      "helpful_votes": 0,
      "publication_date": 20120117
    },
    {
      "title": "Love this little machine",
      "text": "Love this little machine, Cafe is a religion for me and this little machine is very affordable and delivered an amazing fluff with the expresso and the hot side. Note that if the coffee is grounded too powdery and tap to tight the water will have hard time going through. But overall it is an amazing and durable machine for the price, we have had it for over a year and we make many coffee daily... still going very strong. You will love it too!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ganessa",
      "helpful_votes": 0,
      "publication_date": 20141204
    },
    {
      "title": "Tamper is awkward and not useful - best to get a hand tamper",
      "text": "Had this for several months, and while there was a learning curve, it's been a reliable performer. Espresso with crema (though not quite coffee-house quality). Tamper is awkward and not useful - best to get a hand tamper. Steams milk very well.",
      "rating": 4.0,
      "verified": true,
      "author": "SH",
      "helpful_votes": 0,
      "publication_date": 20160317
    },
    {
      "title": "I like espresso but am not a fanatic and I think ...",
      "text": "I have 2 of these, both taken apart in the garage. I like espresso but am not a fanatic and I think this makes pretty good espresso for the price. But beware they are a throw away items both failed after 9 months or so in several ways. Water tank leaks; i fixed that by making a permanent connection at bottom. Pump failed on one; heating element on the other. Not sure about the concept of buying one once a year and tossing it though probably cheaper than buying and replacing an expensive one every 3-5 years?",
      "rating": 3.0,
      "verified": true,
      "author": "Jim Raelson",
      "helpful_votes": 0,
      "publication_date": 20140920
    },
    {
      "title": "Goodbye Starbucks",
      "text": "Love , love , love! So easy to use and no need for damper. Heats up pretty quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Queenie",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "it's been working great. We use the bigger pod holder with fresh ...",
      "text": "After taking some time to figure it all out, it's been working great. We use the bigger pod holder with fresh grounds and run until espresso reaches just under the 4 on a Krups carafe for one 16 oz latte.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150521
    },
    {
      "title": "Will not buy any more De'Longhi products .",
      "text": "This made great coffee for the first 18 months , we loved it. Easy to clean and operate. All of a sudden it quite brewing. We tried all the trouble shooting remedies , called the company for tech help and advice. They offered us nothing but 20% off towards a new one. We expected to get more then 18 months out of it and better customer service.",
      "rating": 2.0,
      "verified": true,
      "author": "KTrep",
      "helpful_votes": 0,
      "publication_date": 20160127
    },
    {
      "title": "Started off ok but didnt last.",
      "text": "After only 7 months of use we are having to replace this machine. The pump is defective and the unit struggles to make 1 good cup of coffee. This was our 2nd try at using De'Longhi and rest assured there wont be a 3rd.",
      "rating": 2.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20150220
    },
    {
      "title": "Good after it woke up",
      "text": "Good little espresso maker after it finally started to draw water. Two hours of tweaking with it, I finally ran vinegar through it and it worked, must have had packaging or factory dust in the line. It works fine now. I wish the frother tip was longer but all in all a good buy",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130105
    }
  ],
  "product_meta": {
    "title": "De'Longhi BAR32 Retro 15 BAR Pump Espresso and Cappuccino Maker,BLACK",
    "description": "Enjoy delicious espresso made your way with De'Longhi's Retro pump espresso and cappuccino maker. Stylish and functional, you can choose to brew ground espresso or E.S.E pods with the unique patented dual filter holder. The choice is yours, making your espresso truly made to order. You can enjoy espresso or cappuccino at the perfect temperature with two separate thermostats. If you prefer cappuccino you'll enjoy using the easy-to-use swivel jet frother, which makes perfect drinks every time. Other highlights include self-priming operation to eliminate pesky start-up preparation, removable water tank and drip tray and a durable, high-quality stainless steel boiler to ensure many years of delicious espresso. Clean the steam wand after each use to avoid the item getting stopped. If it is not cleaned, the steam hole can clog up. make sure that the steam knob is closed to avoid leaking. \n\n\nAMAZON.COM\n\n\nPrepare creamy froth with ease\nSimple to clean thanks to a removable 35-ounce water tank Achieve authentic Italian espresso flavor with the DeLonghi BAR32 Pump Espresso Maker. Use convenient pods or ground coffee with the patented dual function filter holder, making espresso preparation simple and fast. Always brew espresso or cappuccino at the perfect temperature with two separate thermostats, which allow for water and steam pressure to be controlled separately. Easily prepare latte and cappuccino with the built-in swivel jet frother. A stainless steel boiler and 15-bar pump create perfect espresso time after time.\n\nAuthentic Italian espresso, fast SWIVEL JET FROTHER\nEasily prepare latte and cappuccino with the swivel jet frother. Create a rich, creamy froth for perfect drinks every time.\n\nPATENTED DUAL FUNCTION FILTER HOLDER\nWith the BAR32's dual function filter holder, you can use ground coffee as normal, or convenient coffee pods for faster preparation. It makes espresso and cappuccino preparation quick and easy.\n\nSELF-PRIMING OPERATION\nEliminate annoying start-up preparation with the BAR32's self-priming operation. Get to your coffee faster, with less waiting around for the element and boiler to reach the correct temperature.\n\nEASY TO CLEAN\nThe BAR32 is simple to clean with a removable 35-ounce water tank with indicator light, and a removable drip tray. It's easy to disassemble, clean, and reassemble to get back to making drinks quickly.\n\nTECHNICAL SPECIFICATIONS\n * Input Power: 1100 watts\n * Boiler: Stainless Steel\n * Pump Pressure: 15-bar\n * Cup Warmer: Yes\n * Dimensions: 8.74\" x 10.63\" x 12.6\"",
    "rating": 3.9,
    "feature_bullets": [
      "Use convenient pods or ground coffee with the patented dual function filter holder. It makes espresso preparation simple and fast",
      "Easily prepares latte and cappuccino with the swivel jet frother, for perfect drinks every time.",
      "Eliminate annoying start-up preparation with the self-priming operation",
      "Always brew espresso at the perfect temperature with two separate thermostats, which allow for water and steam pressure to be controlled separately",
      "Enjoy delicious espresso for years to come with the durable, high-quality stainless steel boiler and 15 bar pump pressure"
    ],
    "specifications": {
      "Product Dimensions": "10.63 x 8.74 x 12.6 inches",
      "Item Weight": "9.31 pounds",
      "Manufacturer": "Delonghi",
      "Language:": "English",
      "ASIN": "B0002A3S66",
      "Item model number": "BAR32",
      "Customer Reviews": "3.9 out of 5 stars1,139 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#640,581 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 1, 2002"
    },
    "categories": [
      "Semi-Automatic Espresso Machines",
      "Home & Kitchen",
      "Coffee, Tea & Espresso",
      "Espresso Machines",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}