{
  "website_summaries": [
    {
      "verdict": "A sturdy food processor that's large enough and powerful enough to tackle any task.",
      "pros": [
        "Two speed options with pulse setting",
        "Comes with S-blade and shredding and slicing disc",
        "Dishwasher-safe",
        "Internal cord storage",
        "Oversized feed chute",
        "Powerful enough to quickly mince tough vegetables",
        "Suction cups on the bottom to hold the machine in place"
      ],
      "cons": [
        "This machine runs loudly and may chop food into smaller pieces than you intended"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Careful of stressing it too much or it'll break",
      "text": "Owned this food processor for about 5 months and yesterday while shredding cheese, the center shaft busted and the shredding disc bent. There were other times when shredding cheese that the unit would make a burning smell. This food processor would be ok for small jobs but don't or it under too much stress.",
      "rating": 2.0,
      "verified": true,
      "author": "Mark Mattix",
      "helpful_votes": 52,
      "publication_date": 20180617
    },
    {
      "title": "Works great!!",
      "text": "I got this food processor several years ago, for the rental I was living in temporarily. I have used it pretty intensely for years (I make my own nut butters, and chop plenty of food to make patties for my kids etc, also I'm a food writer so I really do cook a lot and put stress on my appliances), it has done a great job and never showed signs of ware. Now I'm back at my own place only to find that my own much more expensive food processor works less well then this one, I came to regret it (actually I think I'll buy a new one and will kick the fancy one to the curb).",
      "rating": 5.0,
      "verified": true,
      "author": "sigi",
      "helpful_votes": 52,
      "publication_date": 20180101
    },
    {
      "title": "Obsessed.",
      "text": "In an effort to become more involved in the kitchen I decided it was time for a food processor. I love the convenience of being able to slice and dice vegetables for dinner, shred cheeses, etc. My only regret is being intimidated by the simple appliance and not doing it sooner! <3 This processor is powerful and easy to clean so that you can move on from one thing to the next. I don't think I spent even 25 minutes on everything in the photo I included and that was with time in between to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Michelle",
      "helpful_votes": 100,
      "publication_date": 20170405
    },
    {
      "title": "Stopped working after 11 months.",
      "text": "I bought this at the end of January of 2017. It worked great. Then, yesterday, it didn't work at all. I tried to clean everything and check all the parts. Nothing. It just stopped working. Now I have to contact the company and/or get a new one. I use my daily.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 41,
      "publication_date": 20171114
    },
    {
      "title": "Cheaply Made Locking Tab on Cover",
      "text": "Unit would not turn on - The cover is loose and does not not lock in place - Found the locking tab on cover is broken off ! So, I read 80% of the reviews and found other customers ended up with the same problem. No more cheap food processors for me.. I will be ordering the Cuisinart Pro Model, DLC-10SY...",
      "rating": 1.0,
      "verified": true,
      "author": "G.M.",
      "helpful_votes": 16,
      "publication_date": 20180802
    },
    {
      "title": "Chop and shred vegetables really fast for soups and salads!",
      "text": "I used mine just on vegetables and it has lasted. This is the 2nd one because the first one has worked so well and still working. My wife needed her own because she kept borrowing mine. According to the 2005 Dietary Guidelines for Americans about 2 1/2 to 6 1/2 cups should be consumed daily. In my diet I eat lots of vegetables and this is able to chop and shred them really fast for my soups and salads making easier to prepare. I like the fact that I have the extra blade because sometimes I want the thinner cut. The dishwasher takes care of the clean up. Good value...",
      "rating": 5.0,
      "verified": true,
      "author": "N. Santos",
      "helpful_votes": 11,
      "publication_date": 20170130
    },
    {
      "title": "Complete junk",
      "text": "This was my first Hamilton Beach product, and it will be my last. This food processor worked but emitted a very strong smell of burning electronics (the sort of acrid smell that emanates when electronics burn out and emit smoke) when the motor was operating, the very first time I used it. Also four of the six rubber suction feet fell off immediately -- they were attached with tiny screws that only tapped 1mm into the bottom of the blender. The power switch felt gimpy and not solidly attached. And the cutting blade trapped a large amount of food inside it, more than I have seen with other food processors, making this food processor need more cleaning than most.",
      "rating": 1.0,
      "verified": true,
      "author": "Luke",
      "helpful_votes": 2,
      "publication_date": 20200305
    },
    {
      "title": "Burning electronics smell when in use",
      "text": "I have used this for soft and hard cheeses, nuts, vegetables etc... There is a mild electronics smell coming from it when it is operating with nothing inside and that smell gets much worse when you put food inti it. Like a mild burning smell. Also sometimes when doing parmesan cheese it gets very sluggish and slows down a lot. The cheese really isn't that hard. I looked online and seen that other food processors operate incredibly with harder items so this is obviously a very low grade processor :( I kids of wish I hadn't purchased it because I get this feeling it will be useless soon :(",
      "rating": 3.0,
      "verified": true,
      "author": "Shaun",
      "helpful_votes": 3,
      "publication_date": 20200201
    },
    {
      "title": "Stopped working 4 months after warranty expired",
      "text": "A small plastic part broke off the lid back in September 2019. Now the motor doesn't turn on. Hamilton-Beach sells replacement parts, including lids, but many of these parts are out of stock and I've been waiting weeks. I need my food processor and am buying a Cuisineart. Annoyed that this food processor lasted about one year. Otherwise, it worked well, when it was running.",
      "rating": 2.0,
      "verified": true,
      "author": "Claudia",
      "helpful_votes": 5,
      "publication_date": 20180628
    },
    {
      "title": "Bowl or lid will warp if put in top level of dishwasher!",
      "text": "I've used this food processor for about two years, and I liked it. Since it claims it's dishwasher safe, I washed the bowl and lid on the top shelf of my dishwasher. This worked for awhile... except recently the lid warped and will NOT fit onto the bowl or the slide that starts the processor. I'm going to have to buy a new lid and avoid putting these parts in the dishwasher (upper level included) in the future. Amazon Prime does not offer these separate replacement parts, so I'm going to have to order from another site that charges $15 or so for shipping. Not happy about that... Four years later, though, I'm still using this food processor.",
      "rating": 3.0,
      "verified": true,
      "author": "ttmadison",
      "helpful_votes": 9,
      "publication_date": 20161015
    },
    {
      "title": "... a chance to use this food processor and I love it. This was a personal purchase NOT a ...",
      "text": "I have had a chance to use this food processor and I love it. This was a personal purchase NOT a free or discounted item for a review. It is as advertised and does the job very well. It is very sturdy and cuts the veggies just as I need. Just have to remember to remove the bottom blade when using cutting discs or things get chopped smaller. That was my mistake, ooops! The motor is very solid and strong, the blades are sharp and sturdy. I like this processor better than my last one, another brand, that costed considerably more and did not do the job nearly as well. I am NOT being paid for this review.",
      "rating": 5.0,
      "verified": true,
      "author": "Antoinette M. StoltzTop Contributor: Pets",
      "helpful_votes": 8,
      "publication_date": 20170107
    },
    {
      "title": "Amazing quality and value",
      "text": "I was worried about buying a food processor online, and for the price I was skeptical that it would hold up to the abuse I tend to put my kitchen gadgets through, but I worried for nothing. This machine is marvelous! Sturdy, holds more than enough food, and processes like a dream. Easy to clean and looks great; small enough it can stay on my counter all the time so I never forget to use it! If it ever breaks, I'd repurchase it no question about it as it's very inexpensive compared to other brands, but I think this may be the last food processor I ever have to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kojibaby",
      "helpful_votes": 8,
      "publication_date": 20170317
    },
    {
      "title": "used one time and container broke",
      "text": "I was excited to finally have a food processor ..... however the first time i used it to grated soft cheese (which did an amazing job) but when i went to hand wash the container the bottom had not one crack but 3...sent email to company and didn't get any response.........so if you want to use more than one time might want to rethink before purchasing this one..... one unhappy mamma",
      "rating": 1.0,
      "verified": true,
      "author": "Weezie",
      "helpful_votes": 4,
      "publication_date": 20190610
    },
    {
      "title": "Happy!",
      "text": "I have had this Hamilton Beach food processor for about a year now. Great value! Not nearly as loud as the Black and Decker I replaced with this. There's no reason to pay substantially more for the other food processors on the market. I use it most often to grate/slice vegetables and to make hummus. The chute is large enough, the unit is easy to clean, and the suction cups on the bottom of the unit keeps it from walking during use. I'm very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 4,
      "publication_date": 20180703
    },
    {
      "title": "Very low price and very wonderful results!",
      "text": "Very low price. Very amazing results. I can prep my Instant Pot veggies in seconds. Saves me a half hour of chopping veggies each time I use it. Quick rinse is all I usually have to do. Love the suction cup base, too. Helps in many ways. Buy this. Don't buy an expensive one unless you're gonna be using it 8 hours a day in a restaurant. I often use it in prep for 2 meals a day. It just yawns and comes on like a race horse. Cool. I got the extended warranty because it's so cheap to add on. I don't think I'll need it though. It is a ravenous beast in the veggie prep world!",
      "rating": 5.0,
      "verified": true,
      "author": "Jim B",
      "helpful_votes": 5,
      "publication_date": 20170830
    },
    {
      "title": "Not a long enough life!",
      "text": "It's 1 1/2 years old. I was grating cheese like I have many times and the center post the bowl spins with shattered into pieces. It's useless. The life of this processor was not long enough. I will add picture eventually.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 8,
      "publication_date": 20171027
    },
    {
      "title": "Okay for some things, struggles with others.",
      "text": "Unit works great for soft foods but struggles with firmer vegetables like lemon grass and galangal. Further the item stains easily. Mine is already yellow from turmeric and red from chilies even after soaking in a bleach solution though I don't know why I bothered, it's going to get stained again. Still it saved me a lot of time in making large batches of curry paste so there's that. I don't know that I would buy it again. Oh yeah, I did make ruffles-like potato chips with it. That was fun.",
      "rating": 3.0,
      "verified": true,
      "author": "Rick S.",
      "helpful_votes": 2,
      "publication_date": 20190714
    },
    {
      "title": "Does not start - Only used a few times.",
      "text": "I really wish this food processor was still working. I only used it a few times, stored it in the pantry, and plugged it in the other day and it will not start. I was in disbelief so I made sure container and lid are locked and tried a different outlet. I've only had it for about 6 months.",
      "rating": 1.0,
      "verified": true,
      "author": "Elena",
      "helpful_votes": 3,
      "publication_date": 20200118
    },
    {
      "title": "Should have purchased a better brand!",
      "text": "I used it less than once per month and it broke last night. I am not hard on any of my kitchen appliances and am extremely disappointed that this food processor has crapped out. The pin in the middle that keeps the lid on has broken and now grinds the plastic off. Buy a better brand and you’ll have it for years! Lesson learned!",
      "rating": 1.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 3,
      "publication_date": 20190928
    },
    {
      "title": "Seems to work well",
      "text": "Works well, but I dont really have another one to compare it too. I would probably buy a bigger one becuase the size job this one does I could do the same with my knife skills and if I include clean up time I really arent saving anything, so thats why I would get a bigger one. My best use is I like my chicken basically ground up when I make chicken salad and this works fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Franco",
      "helpful_votes": 4,
      "publication_date": 20171029
    },
    {
      "title": "Super powerful, gets the job done quick!",
      "text": "I really like it. There is a lot of blades to chose from, very powerful motor makes the machine work very fast, even on the hardest veggies. We have made a large baking tray of sliced potatoes in about 2 minutes. All the attachments work well and the unit is easy to clean. Most of all the price is much better than many other food processors with these parameters. This one gets the job done!",
      "rating": 5.0,
      "verified": true,
      "author": "Michal Olszewski",
      "helpful_votes": 5,
      "publication_date": 20160623
    },
    {
      "title": "Not terribly impressed with this unit",
      "text": "Not terribly impressed with this unit. I've had a year and have probably used it a dozen times. The stem that the blade drops down on has become all cracked and is at the point where it is non-usable. I also don't care for the high profile of the motor housing which is quite high and makes stowing it more difficult because of the vertical room required. The switch is a little cheesy and feels like it has a limited lifetime. My old Sunbeam model lasted the better part of 15 years, was not terribly expensive and did the job better.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Muri",
      "helpful_votes": 5,
      "publication_date": 20170205
    },
    {
      "title": "Poor performance, minimal power, plastic in food.",
      "text": "Picked this up on the treasure truck. To put it nicely it’s junk. The first time I used it the internal shaft that the shredder wheels attach to started strip the shaft down leaving pieces of plastic in the cheese I was shredding. Which leads to the next problem. This processor lacks any power you would hope it has. Even setting cheese on the wheel would stop the motor, this would happen on all settings. I gave up on the wheels and used the blades. Those also had poor performance. Not nearly as terrible as mentioned above but they seemed dull and only “mashed” instead of cut through tomatoes.",
      "rating": 1.0,
      "verified": true,
      "author": "Nick Johnson",
      "helpful_votes": 2,
      "publication_date": 20200116
    },
    {
      "title": "Really good, one small issue",
      "text": "I use this processor almost daily. I love the simplicity of it (not too many buttons or settings, just what you actually need). My only gripe is that the top of the blade attachment, once in the processor, is not covered or completely sealed, which means if you pour a liquid or even flour over the top of the blade, it will run down and get under the clear bowl. Not a perfect design, but it's only a minor inconvenience that is easily solved by simply not pouring at that location. Otherwise, great product",
      "rating": 4.0,
      "verified": true,
      "author": "Kody R. Latham",
      "helpful_votes": 2,
      "publication_date": 20180626
    },
    {
      "title": "I used my daughter’s, then needed to buy my own!",
      "text": "I checked all the reviews, and the ones for this stacked up pretty well on the ‘price/performance’ spectrum. I had borrowed my daughter’s and liked it, even though it seems simplistic compared to the old Oster Kitchen center I was using! LOL (If I’d been able to keep getting parts I would have kept on! LOL The thing had AMAZING torque and a nice sized motor. Was built to last!) This one? Not as much, but it does the job. Won’t chop up ice, or most other things especially finely, and I haven’t tried to make nut butters in it yet! That may be a challenge! For the mixing, slicing and grating I’ve been doing, it has worked fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Amazing for the money!",
      "text": "We make açaí bowls 5 times a week. We’re blending frozen açaí with other frozen berries, fruits, chia, flax and usually a few unfrozen bananas. Although it may take a minute longer than a higher powered machine (this one is 525W and no slouch), this handles the frozen ingredients perfectly and then some. Comes with 2 separate discs for shredding, slicing, grating, etc. FOR THE MONEY THIS IS A GREAT APPLIANCE!!!",
      "rating": 5.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Best bang for the buck!",
      "text": "This is my 4th processor. The first 2 were very heavy hand-me-downs that worked well until they didn't. Then it was impossible to find parts. This one is light enough that you will pull it out to chop an onion. It has a good sized motor & 4 grating/slicing options. It is also made much better than it looks. I dropped my other one on my concrete floor.The food pusher got stuck in the feeding tube. My husband broke the pusher and cracked the tube removing it, but It STILL WORKED! It really requires the pusher to shred a head of cabbage and it didn't pay to just purchase the 2 parts",
      "rating": 5.0,
      "verified": true,
      "author": "Betty A. Chilly",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Great Food Processor--and Inexpensive, too!",
      "text": "I had a Food Processor that was over 20 years old. It had a central stem that held the blades. Unfortunately, I fed the stem to the disposal and it was ruined. I tried to locate a replacement, but the model was so old that it was not a feasible alternative. So I bought this food processor because the cost was low and the reviews were good. Well--it works. And it works really well. I have used it to make dough (pastry) a few times, and have used the grater disc. It really works. I am thrilled with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Anita26",
      "helpful_votes": 3,
      "publication_date": 20171118
    },
    {
      "title": "Very helpful in the kitchen",
      "text": "Our Ninja died and I was in desperate need of a new food processor. I actually love this one much more than the Ninja - it’s very spacious, easy to clean, has great options for slicing & dicing. I love it comes with two plates with different cutting options. It auction cups to the counter so it doesn’t move around! It’s a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca M.",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Broke after a month of light use",
      "text": "From the start, it produced a weird smell when in use, like burning rubber. The processing power was weak, it even struggled to blend chickpeas for a batch of hummus. Then it broke when I added a single, partially defrosted frozen strawberry to a yogurt blend for a smoothie. Even before it broke, it wasn't good for a smooth blend and it was terrible for smoothies. I had bought it because it was the cheapest option with decent reviews, and I wish I had gone for a higher quality option from the start.",
      "rating": 1.0,
      "verified": true,
      "author": "Angela Gunn",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Great food processor",
      "text": "This food processor rocks! I use it often with no complaints. I love that it has suction cups on the bottom to keep it from moving around while in use. The blade is nice and sharp and works very well. I love that it came with extra blades for different purposes shredding, peeling ect. It stores easily and comes apart for easy clean up. I just throw the parts right in the dishwasher. It has a few different speed choices and a pulse option too. Its a nice medium size. Excellent product to buy!",
      "rating": 5.0,
      "verified": true,
      "author": "kayla",
      "helpful_votes": 4,
      "publication_date": 20160402
    },
    {
      "title": "Good value, great food processor",
      "text": "I bought this for a friend last year, and then ended up getting one for myself this month after eating some delicious pesto, hummus, and pizza he had made (yes this will make pizza dough!). It is very versatile and good for chopping, slicing, and pureeing. It can make pizza dough like I said, but I don't think it would make other doughs. Does well with potatoes, carrots, and other tough vegetables. Super pleased with this product and really easy to use in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "I am having so much fun in the kitchen!",
      "text": "Oh man! I am having so much fun with this thing! As a nutritional coach I am recommending it to all of my clients. Slicing, shredding, blending, mixing.... it does it all! I also was debating that I needed this size... I thought I might get a smaller one but I am really glad I got this size! I definitely recommend this for the price as well! Great deal compared to others and great power!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Herrera",
      "helpful_votes": 2,
      "publication_date": 20180705
    },
    {
      "title": "Good performer",
      "text": "This food processor is awesome! So much better than my 20+ year old one. *Large capacity makes doubling a recipe easy. *There is actually a difference in the two speeds--add the pulse feature and you can get the type of chop you want, from coarse to fine. *Two options for the grating/slicing blades. So if you use the one with less holes you get shredded carrot instead of pulp, etc. *Suction cups keep the unit in place. *Reasonably easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Caprice Erickson",
      "helpful_votes": 2,
      "publication_date": 20180514
    },
    {
      "title": "good little machine.",
      "text": "This shreds cheese amazingly well!!!!! When you get to the bottom of the cheese block, use the pulse option to get the rest of the cheese that gets a little stuck. 4 stars because the shoot is a little big for some single items like carrots, but it still works good. The slicing option is a very fine, thin slice. Not great for finger food, perfect for salad toppings though. This is easy to use, easy to clean, easy to move. It is super super fast. I look forward to many meal preps. :)",
      "rating": 4.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 4,
      "publication_date": 20150426
    },
    {
      "title": "Another value for money purchase from Amazon",
      "text": "We purchased this while on a long stay for work in NY to help with food prep. Now, it is NOT a Magimix, which has a much bigger motor and will pulverise anything, but is a tenth of the price and it does most of what you'd need to put a meal together.",
      "rating": 5.0,
      "verified": true,
      "author": "Giovanna",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "... needed to spent a MINIMUM of $100 for a pretty decent one but never felt confident in forking over ...",
      "text": "I've always put off buying a food processor because I always thought I needed to spent a MINIMUM of $100 for a pretty decent one but never felt confident in forking over the money. I finally decided to settle for a moderately priced one because a cheap processor was better than none and i was tired of grating by hand and skipping over recipes that called for using a processor. This has been an AWESOME buy for the money and I'm almost embarrassed at how excited I am about a kitchen appliance. I've used it multiple times already for chopping spinach, cauliflower, blending frozen fruit for popsicles, grating cucumbers, etc. and it has been great every time.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen Baker",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Good stuff",
      "text": "Love this!!! I never had one before and didn't want to spend over $200 for one that I will only use on occasion. This is perfect. Yes, it's plastic, but so is everything. Easy to clean...comes with 2 blades for shredding and crinkle cutting. Cuts veggies like magic! It even has suction cups on the bottom to keep it from slipping. Very happy with this purchase. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "jan tetzlaff",
      "helpful_votes": 6,
      "publication_date": 20160215
    },
    {
      "title": "Bought almost 10 years ago...  Still going strong!!",
      "text": "I was showing a friend my food processor. I told her that i bought it over 5 years ago. I looked up the model number and sure enough it was still being sold on Amazon, i bought this same exact food processor in Nov of 2010, and IT'S STILL GOING STRONG. I use it regularly to make to salsa, hashbrowns, coleslaw etc.. I couldn't be happier with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil M",
      "helpful_votes": 2,
      "publication_date": 20200412
    },
    {
      "title": "Don't try to mix liquids unless you want a mess",
      "text": "I can confirm that, when used according to directions, the food processor leaks. If you're using it to chop up solid food the leaking probably won't be a big deal. But if you're using it to mix liquids, as I had to do as part of one recipe...well, that's not a good idea unless you want a big mess on your counter. The food processor is loud, but not exceptionally so. It's no worse than a typical blender. The blade is sharp but not razor-sharp. This is probably a good thing, since some of the reviews for the Ninja food processor mention people ending up in the emergency room while trying to disassemble or clean that food processor.",
      "rating": 2.0,
      "verified": true,
      "author": "Roland",
      "helpful_votes": 2,
      "publication_date": 20180306
    },
    {
      "title": "Feeding my kitchen appliance addiction",
      "text": "I am in love with this food processor. Very easy to use and to clean, it has a really powerful motor and works great. The little feet have suction cups so it doesn't slide all over the counter when using it. Making pesto is probably the thing I use it for most and I couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew W",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Should have gotten one YEARS ago!",
      "text": "I wish I had bought this YEARS ago! It does a terrific job of grating hard cheeses (no more of that gross pre-shredded stuff for me!), as well as all the other day-to-day chores that one would expect a food processor to handle. I'm no gourmet chef, but this machine gives me confidence to try dishes I've always avoided in the past because it is so easy to use!",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 4,
      "publication_date": 20160423
    },
    {
      "title": "Simple, affordable, useful",
      "text": "I've used it 3 times already since I got it about a week ago. Works great so far. The suction cups on the bottom really help to keep it in place. Easy to use and comes with 2 different blades for the top. I have only used it for normal food processing, nothing special. Will update if anything changes.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "I really Love this machine!!!",
      "text": "Love how this machine works..great power and I love that there are not a lot of extra blades. I have two with this only and yet it does all the stuff I want..shredding(cabbage) and chopping(nuts) as well as pulsating..it worked for me when I tried to make cauliflower rice to make a carbohydrate free cheesy bread just fine! Also, it is very simple and easy to clean and it sticks to the counter with suction cups on the bottom, I love that! Very simple to use. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Lu",
      "helpful_votes": 3,
      "publication_date": 20170420
    },
    {
      "title": "Great Value!",
      "text": "Perfect for my needs. I was looking for a food processor without the food processor expense. I really didn't want the white, but I was willing to cough up an extra $20 for black. I use it several times a week. I make Salsa in it about 3 times a month. I love the the rubber suction grips on the bottom. I have a Hamilton Beach Slow Cooker which I love. This gave me the confidence to go with a Hamilton Beach Food Processor and I don't regret it a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathyrne W.",
      "helpful_votes": 0,
      "publication_date": 20160904
    },
    {
      "title": "Poor quality, breaking after less than 20 uses, and is loud",
      "text": "We bought this in January. We don't use it often - maybe once or twice a month? It's mid-November so let's assume I've used it about 20 times or so. The suction feet are breaking off the bottom and taking the plastic with it. The slicer is super thin - like potato chip thin - but yet the chute isn't big enough for potatoes. The unit is quite loud - loudest of all my mixers and appliances. I wish I had spent more money for better quality.",
      "rating": 3.0,
      "verified": true,
      "author": "LB Keller",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Really poorly made. Broke in under a year",
      "text": "Had this machine for under 1 year with minimal use and the middle column shattered while slicing zucchini. Now it's unusable and I can't send it back. Wish I had spent a little bit more on a better quality machine.",
      "rating": 1.0,
      "verified": true,
      "author": "Rebekah WIlhelm",
      "helpful_votes": 6,
      "publication_date": 20170713
    },
    {
      "title": "Hard working little processor",
      "text": "Have not had any issues with preparing vegan meals - grinding nuts, processing beans and other ingredients, etc. Good purchase in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Admin Girl",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Stopped Working In 50 Seconds",
      "text": "If I could give it zero star, I would. The first time I took the processor out of the box and used it to puree some chopped vegetables, the thing abruptly stopped working in 50 seconds. I was not able to turn it back on no matter how hard I tried. The engine must be defective. Total disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "XL L",
      "helpful_votes": 13,
      "publication_date": 20151116
    },
    {
      "title": "Broken",
      "text": "I was so looking forward to this thing. I followed the directions and plugged it in, tried multiple outlets and nothing. I returned it.",
      "rating": 1.0,
      "verified": true,
      "author": "Britt",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Quick work",
      "text": "I have never liked food processors, but this one is good enough that I am happy with it. It's not as perfect as chopping or slicing by hand, but I think that would be expecting too much. This processor makes quick work of slicing and chopping and grating, which comes in handy because I cook several meals at a time.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "I'm very happy with this",
      "text": "I needed something to grind up heavier items like nuts, etc and this works perfectly. It is easy to operate and to clean. I just rinse it and put it in the top rack of my dishwasher. Easy to assemble and use. It is a nice size and doesn't take up much room in my cabinet, though it only fits in a tall cabinet if you put it away assembled.",
      "rating": 5.0,
      "verified": true,
      "author": "Blue DragonflyTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Thus far, I'm *almost* impressed",
      "text": "So very close to 5 stars. It's great, but you have to work *hard* to *chop* anything with with it. It goes from chop to \"omg this is now paste\" pretty darn quick. Also, the slicing circles need both a thicker and thinner setting than those available. Still...for the price, it's fabulous.",
      "rating": 4.0,
      "verified": true,
      "author": "Yeshua Loves You",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Great food processor for the money!",
      "text": "Absolutely love this food processor. Makes super quick work of slicing, shredding and chopping. I don't know why I didn't buy one sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie V",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Works great, once you glue the feet back on",
      "text": "The suction cups on the bottom are very strong -- stronger than the screws that hold them in place, unfortunately. So most of the feet broke off pretty much right away. But the actual machine is very durable, and has stood up to a variety of tasks over the past year and a half. I'd order it again.",
      "rating": 4.0,
      "verified": true,
      "author": "kms",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Love it",
      "text": "I've never owned a food processor before, so I have nothing to compare it to, but I don't know how I lived without one for so long. It just makes everything so quick and easy. My only wish is that there was a way to store the blades within the unit somehow, but I don't know if any food processors have that feature. I'm very happy with this processor.",
      "rating": 5.0,
      "verified": true,
      "author": "gmu20",
      "helpful_votes": 2,
      "publication_date": 20161003
    },
    {
      "title": "Disappointed",
      "text": "I was so excited to get this processor. It did great the first time i used it to make truffles. I took great care with it. Washed everything. I go to put it back together and the lid won't fit anymore. I worked on that for a good 10-15min and it would not go back on. I'm so disappointed. I took my time to find the right one. Reading all the reviews on several different kinds and choose this one. This is so frustrating.",
      "rating": 2.0,
      "verified": true,
      "author": "Chuck",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "It works great, has nice suction cup feet",
      "text": "It works great, has nice suction cup feet, comes with two different grating blades. Taking a star off because of how much of a pain it is to clean. The nooks and crannies on the lid are very difficult to get into.",
      "rating": 4.0,
      "verified": true,
      "author": "V91-Bleach",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Breaks easily",
      "text": "I've had this a little over a year and have only used it maybe 6 times during this year. The only thing I've every used it for was to shred cabbage for coleslaw and it did great. This past week I tried for the first time to slice cheese and with the least bit of resistance the black spindle that turns the entire unit broke a small piece off. Now the entire thing is useless and no one is answering phones due to the virus. I guess it is good if you use only soft foods or nothing that has any substance with it.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Easy to use",
      "text": "After reading reviews of several food processors, I decided to purchase Hamilton beach chef prep. It is perfect for the price and ease of use. During the holidays I make a number of pies, it was perfect for my pie crust recipe.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathie S. Kirts",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Good basic food processor",
      "text": "Had to replace my 40+ year old food processor. Didn't want to spend a fortune on a new one. this works good. Only 4 stars because it slices very thin. Wish it had a thicker slicing blade Easy to use and clean up. For the $ a decent product.",
      "rating": 4.0,
      "verified": true,
      "author": "Gail ",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "works as you would expect.",
      "text": "I've mainly used the S blade to chop up broccoli and tomatoes. I used a shred/slice disk for carrots, celery, and red cabbage. I've used it maybe 6-7 times, cutting/slicing/shredding several things each time, and it hasn't given me any problems yet. Construction seems stable. It would be nice if the mouth where you feed in veggies was a little larger maybe, but it's not a big complaint. I'll update the review if I try something that it can't handle.",
      "rating": 5.0,
      "verified": true,
      "author": "J & T",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "Unit broke down after three times of using:(",
      "text": "I only used the unit three times and now it won't turn on. I have been trying for four months back and forth with Hamilton Beach online. Finally about two weeks ago they were supposed to send a replacement unit. I still haven't received it! The number to call is disconnected or bad. The email process to them has been horrible and I wouldn't recommend buying this item to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Very good little food processor.",
      "text": "This machine is easy to put together, easy to take apart and easy to clean. It minces decently and shreds and slices alright. It's not perfect every time but it's definitely better than doing it all by hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Great for hummus",
      "text": "I eat a lot of hummus and got tired of going to the store to get it. This food processor makes great hummus. It is easy to combine the ingredients as you go. Very easy to taste and add more of something that might be missing. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Denis J. Alcock",
      "helpful_votes": 4,
      "publication_date": 20150906
    },
    {
      "title": "Must have been a rebuilt model",
      "text": "I used this twice and then it stopped working. It must have been a rebuilt model but I certain it was not indicated a rebuilt, especially for what I paid for it. I had read reviews for this model but could not find in local stores. When searched online, the search brought me to Amazon. When will I learn? Obviously not soon enough.",
      "rating": 2.0,
      "verified": true,
      "author": "njbogush",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Great til it wasn't",
      "text": "I enjoyed using this powerful processor, mostly for making super-fine cauliflower rice. The parts cleaned up easily in the dishwasher. One day I took it out of the cabinet, though, clicked the on switch...and nothing. Nada. Disappointing as it was just a few months old and had been used once a week or so. Won't buy again.",
      "rating": 3.0,
      "verified": true,
      "author": "W H",
      "helpful_votes": 2,
      "publication_date": 20170114
    },
    {
      "title": "Broke in less than 2 years",
      "text": "Purchased in December, 2016. Normal to light use--I'm a snowbird so only use it for 6 mos of the year. Last night the plastic tab that slides the top into the processor fell off. There is no way to fix it and there are no replacement lids. I really liked the performance of this processor. Too bad the tab is so small and flimsy.",
      "rating": 2.0,
      "verified": true,
      "author": "Bookaholic",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "for 45 bucks you cant do better",
      "text": "For the money I really don't think you can get a better food processor. I purchased this for my girlfriend over a year ago we've used it to make salsa's and hummus, chop onions and shred cheeses and numerous other things. I really didn't know how much a food processor would get used until we owned one, and I must say, its quite a bit. Pros: - easy to clean - comes with multiple cutting options - multi speed - seems very solid and well built - suction cups work well - nice enough to leave on a countertop 24/7 Cons: - it is a bit large... but what'd you expect from a 10 cup food processor?",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Downing Heese",
      "helpful_votes": 5,
      "publication_date": 20120112
    },
    {
      "title": "best I have seen in a while",
      "text": "Time will tell, but this seems better made and better designed than my past couple (that's right a couple). I am a heavy user and from what I see the actual design and weight of the plastic components seems better than my past 2. My favorite I ever had was a hand me down cusinart and this seems similar.",
      "rating": 4.0,
      "verified": true,
      "author": "Patricia Poole",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Great for the price",
      "text": "This food processor is really great for the price. I’ve had other food processors and it’s bit as great as a really expensive one I had years ago but for the price I think this is really great! My sister and 2 of my friends have bought one after we cooked together and used it.",
      "rating": 5.0,
      "verified": true,
      "author": "Raelyn Wilson",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Stoken!",
      "text": "Bought for Passover. I was stunned with the power. This was simply to be a once a year appliance we use at Pesach time. I must say...it is better than my Ninja when it come to power. Very nice!",
      "rating": 5.0,
      "verified": true,
      "author": "TS",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Perfect",
      "text": "Love this food processor. Works exactly as it should. Processed cashews in seconds. Makes smooth hummus. For the price, couldn't ask for anything better. Easy to clean and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Funky",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Excellent Value",
      "text": "This is not a high end processor but for what I use it for -- it is an excellent value. I'm a 1-2 time a week user, so if you use it every day you might consider the next level up.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Don't buy this piece of crap.",
      "text": "I used this food processor one time. It worked fine, but I tried it again today and it's dead. It's a total piece of junk. Of course, it's too late to return it, so that was a very expensive chop. Buy something else.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171221
    },
    {
      "title": "but safe yourself from having to buy another one within a year and go with better. Ninja is so much nicer",
      "text": "Not worth the money! After 1 year - total failure. Within a month of normal use the suction cup feet started breaking off. Within 6 months they were all broken off, but that did not really effect performance. Shortly after that, the little clip attached to the bowl that is required to make the unit run (safety feature) broke off. I ended up jamming the clip and tapping it in place. It did function as a low end food processor, but safe yourself from having to buy another one within a year and go with better. Ninja is so much nicer!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150802
    },
    {
      "title": "Chops large items in very short time.",
      "text": "When I purchased this processor I also purchased a small processor since I wanted to chop large amounts in a very short time. This meets all my needs and takes up very little space for its size. I have had Hamilton Beach products in the past and have always been pleased with the way they operate.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth C.",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Food prep is now effortless",
      "text": "This food processor is outstanding for every day use. Makes prep time a breeze! I highly recommend Hamilton Beach products. I have had great luck with this and my bread maker.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda M.",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "A new Kitchen BF!",
      "text": "This is a comfort appliance to quickly facilitate comfort food. Easy to clean, too! I will get another if it wears out! Imagine - toss in big pieces of onion and you've got a dice in seconds! Or also apple, celery, beets,or carrots diced or sliced in seconds!",
      "rating": 5.0,
      "verified": true,
      "author": "Truffle",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Love love love this",
      "text": "Love love love this! I use it to make my salad and guacamole. Decent size for the money. I have a 2 cup one and this one is amazing in comparison. Can't wait to try the slicing blades.",
      "rating": 5.0,
      "verified": true,
      "author": "T.M.F",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "Works good for hummus",
      "text": "We replaced our 1980s food processor with this. It works great for hummus. Haven't tried any other contraptions on it but I can see how the plastic may be too flimsy for the motor if you use alot of force. Still a good purchase for light use",
      "rating": 4.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "great processor.",
      "text": "This thing is not as powerful as my ninja food processor..but i'd take this baby against most anything out there, unless your using a commercial processor. It has a powerful motor for it,s size....by the way don't let the size fool you. This thing can process all the veggies.pizza dough(in small quantities),refried beans,mash potatoes you need to get the job done. I am glad i bought it. MP",
      "rating": 5.0,
      "verified": true,
      "author": "michael pattison",
      "helpful_votes": 3,
      "publication_date": 20141217
    },
    {
      "title": "Easy to use, and easy to clean",
      "text": "Love this!!!, Makes great coleslaw, Grates cheese in seconds. Can't believe I didn't have one of these sooner! I kept buying different non powered models thinking I would need to spend a lot of money for a powered model. This is much easier to use and it cleans up and reassembles with no issues. Bought this very reasonable model and it works great for me. I use it almost every day.",
      "rating": 5.0,
      "verified": true,
      "author": "carla B",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Fantastic value and easy to use/clean.",
      "text": "Absolutely love this food processor. I researched before purchasing and am so glad I settled on this one. I especially like how it stays stable with the suction feet. Fantastic value!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Great value kitchen helper!",
      "text": "This thing is a fantastic helper and does so much for such a low price. I love it, and I resisted getting a food processor for years and years. This one grates, slices, and chops uniformly, quickly, and easily. It really is amazing value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Smith",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "It did seem pretty solid to me and I offered to take it ...",
      "text": "Gave this to my daughter for Christmas, she likes what it does but not the size, thinks it's to big. Oh well you can't have everything. It did seem pretty solid to me and I offered to take it off her hands, but she declined.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Hamilton Beach Chef Prep",
      "text": "This food processor has everything the more expensive processors have, except for a good manual or DVD on how to use the food processor (that is the only reason I deducted a star). After talking with others that own processors, I learned how to use this one, and have not been disappointed with it. Pulse is the magic button, and you do want a food processor that has a pulse button. I would recommend this to people that know how to use a food processor and don't want to pay an arm and a leg for a good one.",
      "rating": 4.0,
      "verified": true,
      "author": "CD4liberty",
      "helpful_votes": 8,
      "publication_date": 20111006
    },
    {
      "title": "Efficient appliance",
      "text": "Easy to use and versatile. Only issue is that there are 2 large round blades and the unit only allows you to store one so the other one sets around loose.",
      "rating": 5.0,
      "verified": true,
      "author": "D. O.",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Still going so far!",
      "text": "This was a good buy and is still working for me months after purchase. The container is a little flimsy so u have to be careful with that. I recommend hand washing when possible. Not sure how long it will last but so far so good.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Reviewer",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "I love it",
      "text": "This thing is pretty awesome. I had a hand me down food processor from my aunt and while that one was okay. This one beats it. The blades are super sharp. It's easier to clean. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dylan Hicks",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Great machine",
      "text": "I bought this to replace my very old Hamilton Beach processor. The only trouble with the old one was that the bottom blade broke and it wasn't worth it to try to get a new one. This is much more powerful and I like the tall style instead of the side by side one. Much better shute and pusher fits great. For the price this thing is amazing. Don't know why anyone would spend more for another name brand???? This thing does everything any other one would do just as well. Maybe better? Don't hesitate to purchase this food processor!",
      "rating": 5.0,
      "verified": true,
      "author": "Lee WagarTop Contributor: Watercolor Painting",
      "helpful_votes": 0,
      "publication_date": 20131216
    },
    {
      "title": "Lack of info on sellers part- only for US / Mexican? Use!!",
      "text": "Product info said it ships to Hk but no info about suitablity for a particular voltage, or any warning that it is only for 110v usage. HK at 220-240V is way over the voltage so I cannot use here w’out a costly, bulky and heavy transformer . Also the plug is an odd ( Mexican?) uneven, flat, 2 pronged plug that wouldn’t fit any international travel adapter and I have 3. I returned it immediately.",
      "rating": 2.0,
      "verified": true,
      "author": "Margot Lane",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Good buy",
      "text": "I've had this for a little less than a year and use it frequently. Very easy to clean, very easy to use, and very easy to store away. I like the grips that are on the bottom too. They come in handy!",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Works like a champ!",
      "text": "I’ve been holding off on my review until I got some good use out of this food processor. I’ve never made guacamole, sauces, salsa, chopped nuts etc so fast in my life. Everything is still sharp, nothing has broken in the almost year that I’ve had this. Looking forward to many more years of use!",
      "rating": 5.0,
      "verified": true,
      "author": "Awideman",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Using it is cuisine \"poetry\".",
      "text": "There is nothing to dislike about this kitchen tool. It is a \"must\" for food preparation. Does what it states. Easy to assemble and clean,",
      "rating": 5.0,
      "verified": true,
      "author": "doris spears",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Easy to use... and break.",
      "text": "Easy to use and have owned these in the past, however, first use on this model and the center main drive spindle broke into multiple pieces. Have tried to use the warranty I purchased and was denied. I’ve reached out to Hamilton Beach and I’m waiting for their reply. Will update once I have heard from them.",
      "rating": 2.0,
      "verified": true,
      "author": "Benjamin Goddard",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Works pretty well for my needs",
      "text": "Works pretty well for my needs. Only thing I don't like is that when it reaches the end of the vegetable you're cutting, the last inch or so just flies down and spins around on the blade. I have to stop the machine, go in, and grab the chunk that it won't cut. Other than that, sharp and fast blades. Not bad for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "Most powerful dependable food processor",
      "text": "The 525 watts of this processor allow you to make nutbutters and the square stem keep the shredder/slicer blades to work longer where other processors with a round design of the stem start to slip with hard usage. I use my processor to conveniently feed my family healthy natural foods.",
      "rating": 5.0,
      "verified": true,
      "author": "BoLo",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Want a good affordable food processor? This is it.",
      "text": "We love this food processor! It's our second one of this kind, we broke the bowl on the first one, one of those kitchen mishaps where you are making dessert and have too much on the counter. Anyway, the first one lasted a few years and would have lasted longer! So we ordered this one again, and its still amazing! We have tried other brands that did not work and only lasted 6 months tops. The motor on this one is much better than other food processors!",
      "rating": 5.0,
      "verified": true,
      "author": "Chillin",
      "helpful_votes": 0,
      "publication_date": 20140725
    },
    {
      "title": "Very disappointed ☹️",
      "text": "Great if you need everything pulverized. Maybe I am doing something wrong because within a second the slices pulverize.",
      "rating": 2.0,
      "verified": true,
      "author": "Pat",
      "helpful_votes": 0,
      "publication_date": 20200113
    }
  ],
  "product_meta": {
    "title": "Hamilton Beach ChefPrep 10-Cup Food Processor & Vegetable Chopper with 6 Functions to Chop, Puree, Shred, Slice and Crinkle Cut, Black (70670)",
    "description": "Product Packaging:Standard PackagingQuickly dice, slice, shred, Crinkle or puree with the Hamilton Beach chef prep 525 watt food Processor. Fast and easy to use, This versatile tool will make food prep a breeze. The dishwasher safe parts bowl, lid, and blades make cleanup a snap.",
    "rating": 4.4,
    "feature_bullets": [
      "Full-size 10 Cup food Processor with powerful 525-watt motor",
      "6 versatile functions: chop, puree, fine shred, coarse shred, slice and crinkle cut",
      "2 reversible slicing/shredding discs; stainless-steel chopping blade.To remove stubborn soil, use a mild non-abrasive cleanser",
      "2 speed options plus pulse for precision results; oversized Feed chute",
      "Dishwasher-safe bowl, lid, blades, and discs; internal cord storage. Bpa free"
    ],
    "specifications": {
      "Product Dimensions": "9.72 x 7.84 x 15.12 inches",
      "Item Weight": "7 pounds",
      "Manufacturer": "Hamilton Beach",
      "ASIN": "B000RJTNFC",
      "Item model number": "70670",
      "Customer Reviews": "4.4 out of 5 stars2,003 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#55,003 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "December 7, 2003"
    },
    "categories": [
      "Home & Kitchen",
      "Food Processors",
      "Small Appliances",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}