{
  "website_summaries": [
    {
      "verdict": "This is one of the toughest golf club travel cases on the market, but the price tag may put it out of reach for some.",
      "pros": [
        "Tough polyurethane case that's dirt-, dust- and moisture-resistant",
        "Locking system for safe transport on planes",
        "Comes with a lifetime warranty and $1,500 club coverage",
        "Has wheels for easy transportation"
      ],
      "cons": [
        "This case may be too expensive for some users",
        "It's also large and heavy"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Wheel broke after one use, can't find anyone to contact",
      "text": "I bough this case to have one case I don't have to buy again (quality vs. quantity). The first time I traveled, the wheel broke. It bent as you see in the pictures. I tried contacting seller but there is no contact seller option anywhere after 30 min. of searching. This seems like the only way to get through the seller. This case has \"Includes SKB’s Million Mile Guaranty, SKB's lifetime warranty\". Good luck trying to get in contact with someone.",
      "rating": 1.0,
      "verified": true,
      "author": "Adam Snopek",
      "helpful_votes": 13,
      "publication_date": 20190129
    },
    {
      "title": "Excellent for transporting PHOTO/VIDEO GEAR!",
      "text": "I use this hard case for transporting all of my camera tripods, monopods, Glidecam, light stands, and other accessories that don't fit into a carry-on bag. Airlines know how to handle golf bags, so they shouldn't give me any trouble when trying to check it.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt WhoIsMatt Johnson",
      "helpful_votes": 15,
      "publication_date": 20171112
    },
    {
      "title": "This travel golf case is great! This hard case provides maximum protection for our ...",
      "text": "This travel golf case is great! This hard case provides maximum protection for our golf clubs as we fly to travel destinations and fits the newer longer drivers & woods with ample room so that no clubs could bend or break in travel. There is extra padding in the \"club heads\" area as well as extra room for shoes & other golf supplies. We have a huge investment in our golf clubs & travel with confidence knowing that our clubs will arrive in perfect condition. The 3 locks on the case are solid & secure.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Fojtik",
      "helpful_votes": 10,
      "publication_date": 20180519
    },
    {
      "title": "Won't Fit Callaway Fusion 14 Golf Bag",
      "text": "It's a great looking case and it looks like it will last a long time. The reason I'm writing a review though is to let people know that it will not fit a Callaway Fusion 14 cart/carry bag. I had to return it. Hoping the SKB Staff Travel Case will be bigger so the plastic top rim handle of the Fusion bag fits inside properly so the case can close without interference.",
      "rating": 4.0,
      "verified": true,
      "author": "Marcos Hazard",
      "helpful_votes": 8,
      "publication_date": 20170503
    },
    {
      "title": "Durable and Lightweight! A must have golf travelers",
      "text": "I went to Florida with this case and survived the trip perfectly. My golf bag (Callaway Chev) fitted like a glove and the inside foam padding protected the club heads. It weighted 35lbs with clubs inside (well within Airline allowance) and comes with one lock (TSA approved) mechanism. You can purchase additional locks for the remaining 2 patches but I don’t see it necessary. Great travel golf case!",
      "rating": 5.0,
      "verified": true,
      "author": "NJ Contributor",
      "helpful_votes": 6,
      "publication_date": 20180224
    },
    {
      "title": "Sturdy hard case that I would buy again.",
      "text": "I used it once and my clubs made the round trip unscathed. It's sized for a standard size carry bag a pair of shoes and not much else. The case is very rigid and well cushioned around the club heads. The latches, handles and wheels are impressively sturdy. The middle latch has a built in TSA lock. It gets heavy pulling it on two wheels, four wheels might be better. Also it would be easier to manhandle in and out of the car if there was a grab handle on the bottom . That said, it's light years better than the soft Samsonite travel case it replaces, I would definitely buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Geedub",
      "helpful_votes": 2,
      "publication_date": 20190917
    },
    {
      "title": "VERY durable. Clubs fit great with bag. Tough to fit in a compact car. Not oversized for air travel",
      "text": "Maneuverability is tricky in a car but I still gave it 5 stars because it has wheels and a handle on top. Walking around is easy but I spent 30 minutes trying to pick a car at the rental lot that would fit this in there! Inside dimensions: 48 11/16” x 10 7/8”. Outside dimensions: 49 3/4” x 13”. 5 stars for travel. Clubs fit like glove in there. Sustained some damage across the front after being handled at the airport (picture attached) and I can only imagine the impact that happened in order to cause that. And yes, the clubs were perfectly intact. I was considering getting the cheap soft case but I’m sure glad I didn’t!",
      "rating": 5.0,
      "verified": true,
      "author": "Pat",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Travel bag for airlines",
      "text": "The SKB bag was ordered with the deluxe version for the Titelist bag with stand. Even though I bought it with extra room it WILL NOT fit the stand bag and have to use a smaller bag and it will never allow a tour or staff bag in it. Other wise it is extremely durable and sturdy, the lock work well and has the center TSA lock already included, no need to buy a separate lock. All in all a very good bag for the price VS shipping it...",
      "rating": 5.0,
      "verified": true,
      "author": "Lou Rain",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Best Golf Case Ever",
      "text": "This is way better than any other option out there. The only thing I don't like, is it doesn't like \"stand bags\", it is really suited for Cart Bags only. This is so durable and tough. I used it for our honeymoon to Jamaica where I played 3 rounds. Not only was I able to fit my bag, we also crammed lots of other stuff in it too. For example, put 2 rolled up paintings in it, golf shoes, and other \"breakable gifts.\" The built in TSA locks are cool and work too. Don't buy any other golf case other than this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Well made and fits my bag with all my clubs, shoes and a few items of clothing.",
      "text": "I bought this case based on the Amazon reviews. It works very well. It hold my stand bag and my driver, which is 1\" longer than standard. It's close fit, but it works. I can fit my shoes into the case, with a few items of clothing. I originally bought a soft side bag, but after reading airline policies and horror stories from other golfers, I realized I needed a hard sided case to protect my clubs. This case is very study and roomy enough for me. It's well made and had three large latches, one of which has a TSA lock. Loaded it weighed in at 40 lbs at bag checkin, well below the 50 lb limit. Highly recommended.",
      "rating": 4.0,
      "verified": true,
      "author": "Ramblin Man",
      "helpful_votes": 4,
      "publication_date": 20160606
    },
    {
      "title": "I’d go with Ship Sticks ...",
      "text": "I bought this item on February 3, 2018 even though I knew I likely would not use it until my buddies golf trip months later — stupid me. A wheel broke the first and only time I used the item and dragging it [as opposed to rolling it] through two airports was not ideal. Also my golf bag was too large to fit inside; I had to use an old, smaller spare bag instead. Because my purchase date was too far from when I called Amazon to report the issue, too much time had elapsed, and Amazon gave me a $30 credit. Far cry from the $174.65 I paid for it — quite the expensive disposable item...",
      "rating": 1.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 3,
      "publication_date": 20180823
    },
    {
      "title": "Extremely tight fit",
      "text": "I travel with my clubs about 2x per year. Ordered this because my old soft travel bag just deteriorated. Construction is good but it's barely big enough to hold most bags. I felt my bag was way to tight and I have an old Sun Mountain. Took it on it's first trip and the airline dented a very protected latch. Great news is it protected the clubs. The airline tried to repair at their repair center and could not. I received a brand new replacement and returned it. Ordered the Staff bag since it is 2\" bigger which should accommodate my new Sun Mountain bag",
      "rating": 4.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "Good for golf, great for swords.",
      "text": "I've only used this for a couple trips so far, but it seems robust enough. The handle is a little awkward to hold sometimes, with the weight of the thing hanging entirely on your fingers. Then again, I have mine filled with swords and martial arts gear, rather than golf clubs, so it may be slightly heavier than the manufacturer intended. :D Next time I use it I plan on attaching a shoulder strap to the handle instead.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew P.",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Definitely worth the cost!",
      "text": "Used this for 4 flights and it’s been great. Sturdy, and has a TSA lock. It is a tight fit so don’t plan to add extra clothes or shoes. Also barely fits in the trunk of the Camry. With a carry bag, a full set of clubs and shoes it weighed in at under 45 lbs. With $3500 clubs it is worth the $200 to protect them when flying.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Great quality",
      "text": "I really like this case. I was a little concerned if my full sized tour bag would fit but it fit fine. Even room left over for some clothes etc. the only problem is that the bag is to large for the conveyor belt in baggage claim. It has to go to the oversized bag room and that can be a pain to find in some airports. But not a problem. The quality is great and should last for years. Very maneuverable, easy to pull. Very impressed",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Did not pass the baggage handlers crush test.",
      "text": "I purchased this for a trip to Scottsdale in February. It is heavy, but rolled easily. On the trip back it was apparently tested by the baggage handlers. They managed to mangle a bottom corner so that the bottom hinge is bent, the metal track is bent and crimped so that it will no longer close or seal properly and it will no longer stand up as the bottom is bowed out. My clubs were not harmed, but this was an expensive purchase to have it last only one trip. Disappointed that I only had 30 days to return an item like this as you can’t test it until you use it. We returned 2 days after the return window.",
      "rating": 1.0,
      "verified": true,
      "author": "Don Howell",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Really bulky but gets the job done",
      "text": "I fly and travel a lot for work and have recently taken up golf. This case is excellent for regular abuse but it is quite large and I have run into some issues with getting it into smaller rental cars. If you are expecting to be flying your clubs around a lot I'd definitely recommend this case.",
      "rating": 5.0,
      "verified": true,
      "author": "ChrisVA",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "So far so good...",
      "text": "Slow to ship, but it seems pretty sturdy. I don't even own golf clubs, but this case happens to hold a universal sex swing stand with the seat, if carefully packed. I probably won't fly with the thing, so I can't say how it would survive the brutality of baggage handlers and TSA, but it has a better fighting chance compared to most other cases I've seen. For my own use hauling in vehicles, I expect this will last practically forever. I do wish the wheels were a bit bigger and heavier, but I'll see how they hold up in real world use.",
      "rating": 4.0,
      "verified": true,
      "author": "Kenofken",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "I love golf travel and as such this is an incredible item",
      "text": "I had a soft cover travel bag for a while. The airlines always made me sign a waiver, so I looked into hard shell. This certainly has fulfilled my needs and expectations. It's sleek, lightweight and strong. Already have thousands of air miles on it with no club damage. You will discover that a more compact bag does a bit better. Very pleased with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "kev",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Strong construction of handles and wheels",
      "text": "Great travel case for the price. Make sure to measure your bags top portion were the clubs go, its the only part that does not fold and can't be adjusted to fit in the travel case. I have a Callaway x2 hot set with bag that fit fine. This set, two sleeves of balls, bag of tees, towel,driver and hybrid weighed about 40 lbs, making this case acceptable for some airlines who have weight restrictions. Strong construction, handles well made and the tires are of good construction. Locking mechanism also good. Was very happy sending my clubs through shipsticks on the way to my trip and also sending them through the airline on the way back. Good product.",
      "rating": 3.0,
      "verified": true,
      "author": "mike diaz",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "The golf travel bag hardcase is too small!!",
      "text": "This hard case container was acquired specifically to travel overseas this coming May. It was advertised as a large, high quality hard case container that would carry a golf bag plus extra golfing equipment. NOT!! It would not fit my regular bag and barely contained an old, beat-up bag with most - but not all - of my other golfing equipment. Forget getting a pair of golf shoes inside with clubs and a bag. I just returned from a golf store looking for a bag that would fit. HA! They told me to send it back and get a bigger hard case. Now I discover it's too late to return it. Stuck with a good-for-nothing bag. Ergo, one star.",
      "rating": 1.0,
      "verified": true,
      "author": "Margaret M. McGuire",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Safest way to travel with clubs!!",
      "text": "Have soft sided travel bags. But wanted a little more protection for those expensive adjustable woods and hybrids. Bags fit great with room for a pair of shoes plus any extras needed, balls, hats and rain gear. Does weight more than soft sided, but airlines can’t brake a shaft that they now have exclusions for their responsibility. Roll very well, easy to stand while in lines. Pretty much dust and rain proof Used on three fights,Az x2 and Maui and no visible damage to the case. Shoes and hats not compressed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Quality Product",
      "text": "Just completed my first trip using this case with no issues. You can easily push or pull the case. The wheels seem to be of high quality. I fit a Sun Mountain C130 cart bag with a full set of clubs in the case, but it's tight. I removed EVERYTHING from my bag except the clubs and head covers, and the case weighed in at 39.5 lbs.",
      "rating": 5.0,
      "verified": true,
      "author": "tcd",
      "helpful_votes": 2,
      "publication_date": 20191216
    },
    {
      "title": "Smaller and Than expected",
      "text": "Too small for most newer golf bags!! So disappointed I can’t use this. Unless you have Smaller walking bag and the top is <12 inches across this will not work. Most of the new stand and hybrid bags are 13. Besides that it is well made.",
      "rating": 2.0,
      "verified": true,
      "author": "capengin11",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Skb Company has great customer service!",
      "text": "Bought this a few weeks ago so I could bring my golf clubs to Mexico. Everything about this case was excellent. The only issue was TSA broke the lock. I called the company (Skb Cases) and they immediately said they would send me a new lock. No further questions asked. This company has outstanding customer service and they “back” their products. Will definitely buy product from them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond B. Bracis",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "Heavy duty protection!",
      "text": "This travel case is expensive and heavy. But if you have $3-4000 invested in golf gear do you really want to quibble about an extra $150 to protect them vs. a soft sided case. I don't. These travel well and I am sure have saved me $$$ (at least the extra $150) over a cheaper model. If you think about the fact that wouldn't hesitate to drop $300 on the newest driver or putter or more.... Get the best out there!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave D",
      "helpful_votes": 2,
      "publication_date": 20160708
    },
    {
      "title": "Perfect fit!",
      "text": "I have 14 clubs all with clubs covers (even the irons) in a Callaway Hyperlite Zero stand bag, everything plus shoes, and extra balls fits perfectly. I also pack my clubs with a bag boy back bone, but that may be overkill. My gear fits snugly and doesn’t leave much room for bouncing around during travel. Happy I spent a little extra to go with the SKB ATA deluxe I’m 100% confident in this case to protect my golf stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin Thomas",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Well worth the cost, very solid construction.",
      "text": "This has worked well. I probably would go for the bigger model if I were to buy it again. It's a little tight to fit my cleats in. Also, the locks are a little tight with the key. But I have to say, it travels real well and I've been real happy with the quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark L",
      "helpful_votes": 2,
      "publication_date": 20170914
    },
    {
      "title": "Did the job,",
      "text": "Did the job, I had to put my bag in upside down though because of the top handle on my Taylormade stand bag",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171003
    },
    {
      "title": "Lifetime Warranty",
      "text": "You really can't go wrong with purchasing SKB products. All of them have a lifetime warranty on them. This is the 3rd case I've bought over the past several years. Between the other 2, only one of them needed warranty work and that was handled quickly and professionally. The warranty case in question was a double SKB case and did a roundtrip halfway around the world and during some portion of the shipment UPS practically tried it's best to destroy it but only managed to ruin one lock and 1 hinge.",
      "rating": 5.0,
      "verified": true,
      "author": "Marc W Hunt",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Excellent",
      "text": "Very Good, used it on my recent flights from US to South East Asia trip for my 2019 The whole set of Callaway Epic Flash. Nothing is damaged inside and outside, I saw some beat up on my hard case. No worry, this case can easily protect ur golf set.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom C.",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Doesn't Fit Standard Bags",
      "text": "I wanted to love this case and was so excited to give to my boyfriend for Christmas. He is a competitive golfer and travels a lot and wanted to stay away from a soft case. His standard size bag would not fit in here. Wanted to love, but it wouldn't work. Thankful we tried out out right away rather than waiting until we needed it.",
      "rating": 1.0,
      "verified": true,
      "author": "Darlene",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Update... (Fixed) Protects clubs ok but handle broke off!",
      "text": "02.22 - Update. Wrote to SKB and they sent me a new handle, free of charge. They were very accommodating , replying to me in a very timely manner and shipping the new handle out within a few days.. As I stated prior, 5 stars! If the handle stayed on,I'd give it 5 stars. First use rolling it from car to airport, the handle came off. Had to carry it both ways instead of rolling it. What a pain. Will the guarantee replace it for free?",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "He's Mostly happy with it",
      "text": "I bought this for my husband for Christmas. It's well made. However, since it's made for travel, I think it should have a place for identification (like luggage has) so when he checks into a hotel with other golfers there's no mix up. It defintatelly will protect the gulf clubs... it's pretty heavy.",
      "rating": 4.0,
      "verified": true,
      "author": "Cathie",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Best golf travel case. Never worry about clubs breaking.",
      "text": "I first purchased a recommended soft bag and was not comfortable with its protection. When I saw this item for few dollars more, it made sense, especially when compared to the price of my clubs. My golf bag fit easily with my golf shoes and I wear a size 13. Doing my airport travel the case was Immaculate and looks like new. This case is strong enough to use for the rest of my life. I do not ever have to worry about my clothes breaking. Great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Zach and Rosa",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Awesome!",
      "text": "I took my clubs from Oregon to Cabo (Mex) and back. This case was perfect. It has TSA locks on it, too...so, go ahead and lock it prior to sending it on a plane. My friend's older case didn't have TSA locks so she was bumming. It is a good looking case...I think the ladies were checking me out as a result. I think you can use the case as a wing-man. There are more expensive cases online...no need for those. I also bought zippered head covers for my irons for $9.99. Case and covers = good combo.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Green",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Great quality but on the small side",
      "text": "Great quality and super durable I hope it keeps holding up over time. The only downside is that I can see many bags not fitting in the case. Small carry bags are fine but everything else may be quationable",
      "rating": 5.0,
      "verified": true,
      "author": "RYN",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Works Well",
      "text": "We were a little concerned that my husband's golf bag would not fit. It took a little trial and error but once it was in you knew nothing would be damaged plus it is pretty easy to manuever",
      "rating": 5.0,
      "verified": true,
      "author": "Deb F",
      "helpful_votes": 2,
      "publication_date": 20170506
    },
    {
      "title": "Travel with confidence.",
      "text": "This case makes it easy to transport my golf clubs. I’ve own 3 of these, as the airlines aren’t easy on our luggage. I wouldn’t buy any other kind for the price. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Disneyfan",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Best on the Market!",
      "text": "Solid construction that worked perfectly on my first flight. I expect it to last for years and would recommend it to anyone. I particularly like the added foam cushioning around the club heads.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim R.",
      "helpful_votes": 2,
      "publication_date": 20170910
    },
    {
      "title": "Best case for traveling with golf clubs",
      "text": "This hard case is great! Extremely durable, lightweight and fits clubs plus two pairs of shoes. Would recommend this case to anyone who travels with their clubs. Much better than a soft case.",
      "rating": 5.0,
      "verified": true,
      "author": "nater",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Too small for many bags",
      "text": "Although it looks well made and has nice latches & locks, it is too small. My Titleist stand bag, which is by no means a larger bag than normal, would not fit in this case. Thinking maybe it was my bag, I took it to my club (we have a winter indoor practice facility) and out of 10 bags, only 3 fit in this case. It is advertised that it is a standard size but is apparently is not.",
      "rating": 1.0,
      "verified": true,
      "author": "gregori s pasqua",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "WELL WORTH THE MONEY",
      "text": "This case is built tough, it was the perfect fit for my clubs...Easy to roll, already took a trip on a plane, no issues with the TSA. The only thing I did add was a couple bungee cords around the top and bottom in case the case was thrown or banged around...I would buy this case again...",
      "rating": 5.0,
      "verified": true,
      "author": "mark janoski",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Zero complaints",
      "text": "First time flying with my clubs and they certainly came home safe and sound. I didn’t know exactly what I was looking for in a case until this trip. Hardcover was substantial and durable. Handles and wheels worked as they should. Lock and keys were present and functional. I was very glad to see the depth of the foamy padding inside the top end of the case. My clubs were snug and secure once closed inside. For the price, I would definitely recommend this product to a friend.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Fits a standard golf bag.",
      "text": "The little bulge in the case allows a standard golf bag to fit inside (as long as your bottom compartment is not overstuffed). Latches work well. Handles are in the correct position and wheels work as they should. I traveled with friends who used “straight” cases and both of them needed to use a travel golf bag inside their travel case.",
      "rating": 5.0,
      "verified": true,
      "author": "BikeRider",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Nice case, check measurements",
      "text": "Very durable, easy to roll, but heavy. My new bag Datrek didn't fit the case, so I have to keep my old bag for when I travel (not a huge inconvenience). The new style bags are actually larger at the top than the main body of the bag which causes the problem with fitting the case.",
      "rating": 3.0,
      "verified": true,
      "author": "Keith Swinson",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Good Buy",
      "text": "Love it thus far. I’ve used it twice with no problems. Clubs and bag fit perfectly, however, I had to put my golf shoes in my checked luggage.",
      "rating": 5.0,
      "verified": true,
      "author": "R.H.",
      "helpful_votes": 2,
      "publication_date": 20171109
    },
    {
      "title": "Solid",
      "text": "Solid! SKB Company has great guarantee and airline approved. Would be perfect if had loop as back up in case a handle(s) broke off so you could rig up something temporary - getting through airports with this Can be a bit of work",
      "rating": 4.0,
      "verified": true,
      "author": "Mare",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Impressive.",
      "text": "When they say there is a lifetime warranty on this they mean it. Broke a wheel and with one 30 second phone call I had a new one in 4 days. Great product",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Bates",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Well made and Durable full size case",
      "text": "Great hard case with room for stand bag. Several trips with this bag and it has held up extremely well. Bag is well made without being too heavy. Room inside for a full set of clubs plus my shoes and a jacket. Padding inside is low quality but has held up well. Wheels work well in and around the airport. TSA opens this case every time I travel.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 2,
      "publication_date": 20150429
    },
    {
      "title": "Durable. Secure. Travel ready.",
      "text": "Own an older version and this update is just as solid and secure. The clasps are hard, durable plastic instead of metal and your clubs won’t get hurt by the airlines in this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "OL",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "5/5 would recommend!",
      "text": "This thing is great, nominal sized standing bag fits perfectly. I was even able to squeeze my size 12 shoes in the club head area with no problems. The clasps are really beefy and have a satisfying click when shut.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Cornish",
      "helpful_votes": 2,
      "publication_date": 20180423
    },
    {
      "title": "Great for Trombone Travel",
      "text": "I use this for my trombones. I place my double cronchite gig bag inside and wrap the trombones with a little extra love. i still have room for mutes and miscellaneous equipment. i have done 6 international flights and the case has held up perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Kellyn",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "This has to be the best golf case on the planet",
      "text": "Super-duty! This has to be the best golf case on the planet. It comes with TSA locks so you can lock it up and only TSA can open. If you value your golf clubs, this will not fail you.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Maurey",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "2019 Titleist Stand Bag Doesn’t Fit",
      "text": "I have a 2019 Titleist stand bag and the case is not large enough on the interior to fit my bag. The top part of the case is the issue...can not close by nearly 6 inches, though the bottom half fits fine. It’s not even just the legs that make my bag too large, even if the leg stand weren’t attached, the top of my bag would be too large to fit in this case. Very return friendly policy just be aware of the sizes and your bag might not fit.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan M.",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Excellent Golf Case 12 Stars",
      "text": "This is a great case for the price. I have used this multiple times on multiple trips and it always worked very well. On the last trip Southwest somehow crushed the case (Which you can see by the pictures was very violent). The case was destroyed, but the clubs came out without a scratch. This is why a hard case is a great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "DW",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Tape foam sponges to hinges locks and latches to protect your case this works exceptionally well",
      "text": "This a super great deal I've use it lot side note to protect the hinges and latches before traveling tape some foam sponges on those to protect them you will than yourself later because airlines beat the hell out of those and that's why you see so many broken hinges and latches",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Anthony harper",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "lives up to it's reputation",
      "text": "I looked at a lot of cheaper golf travel cases and decided to spend the extra $50 and get this case. SKB is known for their durability and this case is no different. It meets the normal travel size so you don't have to spend extra for an oversize bag and has the TSA lock. All the latches and the lock can be purchased from SKB if one ever gets damaged. There is plenty of room for your bag, clubs, shoes, balls, and clothing. Total weight was less than the 50 lb limit.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan B",
      "helpful_votes": 0,
      "publication_date": 20140306
    },
    {
      "title": "Sturdy and should be exactly what I need for my ...",
      "text": "Sturdy and should be exactly what I need for my upcoming golf trip. I'd give it 5 stars, but I've yet to travel with it. Bag fits and I have a large PING bag.",
      "rating": 4.0,
      "verified": true,
      "author": "cld1119",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Too small",
      "text": "I had the previous version and it was bigger, this one only fits small golf bag and there was no room for shoes or anything else.",
      "rating": 3.0,
      "verified": true,
      "author": "golfnut",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "One of the cases is great. One of the cases is pretty difficult to ...",
      "text": "Ordered two cases. One of the cases is great. One of the cases is pretty difficult to make lock. The metal trim doesn’t line up well. With two people we can wiggle it into place to lock it. We thought about returning it but we’re leaving for vacation right away.",
      "rating": 4.0,
      "verified": true,
      "author": "KE2324",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "... \"soft sided\" travel cases in the past and wasn't happy with their performance",
      "text": "I have owned \"soft sided\" travel cases in the past and wasn't happy with their performance, more of a piece of mind thing probably. I used this case traveling to Hilton Head and it performed great. I feel secure in knowing that my clubs are going to arrive in one piece! Only drawbacks are that you can't fold it up and put it away when not in use. Also it is a little on the heavy side when fully loaded. Fully loaded it tipped the scales at 43 lbs at the airport scale.",
      "rating": 5.0,
      "verified": true,
      "author": "William J. Sullivan",
      "helpful_votes": 0,
      "publication_date": 20170404
    },
    {
      "title": "Avoid these if you want to travel on airlines.",
      "text": "I bought these cases for my wife and I to travel with golf clubs. On the second trip with normal airline transport, the wheels broke. One case the wheel broke away and on the second there is a large crack and it will likely fall away if I use it again. They are now just large heavy cases that you must carry instead of pull. I am highly disappointed that Amazon allows sale of such poor quality items.",
      "rating": 1.0,
      "verified": true,
      "author": "Greg Nelson",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Best case",
      "text": "Works good. I travel and play 3-5 days a week. This case protects my clubs. I've seen bag guys drop this while loading and nothing was damaged. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "The Cadillac of Golf Club Cases",
      "text": "Very high quality material used on the manufacturing of this case. Hinges, locks, handles, etc. are solid. You will spend more on this case vs. soft sided or lessor quality hard sided cases but worth the investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Great quality case",
      "text": "Great quality case! HOWEVER, it does not fit my Ogio Ozone stand bag in the normal orientation. Due to the bag having a hard molded plastic handle at the top of the bag, it makes the diameter too wide for the top (skinnier) portion of the case. I was able to close the case with the stand bag upside down though. Will be traveling with it soon.",
      "rating": 4.0,
      "verified": true,
      "author": "love2play",
      "helpful_votes": 0,
      "publication_date": 20170711
    },
    {
      "title": "Awesome case. Tough and fits my bag with clubs/shoes/balls ...",
      "text": "Awesome case. Tough and fits my bag with clubs/shoes/balls with no problems. Further, I usually check it at the airport at around 41 pounds... so there's ~9 pounds of margin on typical weight restrictions. It is large, however, it will fit in the trunk of the bigger full-size rental cars (Taurus/Lincoln/etc). Otherwise, just shove it in the trunk and fold down one of the back seats and it's good to go.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Miller",
      "helpful_votes": 0,
      "publication_date": 20141211
    },
    {
      "title": "Nice travel case!!",
      "text": "Pretty impressed with this hard case!! Its nice and durable! Glad I did my research and went with this one!!",
      "rating": 5.0,
      "verified": true,
      "author": "AE",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Great case",
      "text": "Slightly smaller that I thought....wish it had a bit more room to fit additional golf equipment like shoes and such, but overall an awesome case for the money!",
      "rating": 4.0,
      "verified": true,
      "author": "Justin Johanson ",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Love it",
      "text": "Used it for the first time on my trip to Palm Springs and it works great. The latches keep a tight grip on the case and keeps things from moving around. There is padding on the inside around the club heads that gives additional protection. Fits easily in my car, and no problems with the airlines (and no additional shipping costs). All total with clubs weighed approx. 35 pounds when checked at the airport.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin K Morse",
      "helpful_votes": 3,
      "publication_date": 20130204
    },
    {
      "title": "Super Durable",
      "text": "This is an awesome case and very durable and sturdy. Held up great when shipping the clubs via ship sticks direct through Fedex. Didn’t even need a box, just loaded it, locked it and shipped in the case",
      "rating": 5.0,
      "verified": true,
      "author": "Travel Lady 76",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Size Small",
      "text": "Cons.... Case is very small even for a normal size carry golf bag! As pictured I can’t close the case, not even close! Case is perfect if you remove all clubs from the bag and just store the clubs And store some golf balls. Pros.... Other than the size the case looks great, built solid, light and durable. It’s a shame.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Solid case",
      "text": "I trust this much more than soft sided cases. The latches can be a little picky and I need to push them into alignment to close them. Overall a good travel case.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Well built",
      "text": "Well built, however it does not fit a staff bag as it says . Returned no problem. I ordered a larger size .",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Highly recommended",
      "text": "Traveled to Phoenix from Illinois and back. Came back in excellent condition and protected the golf clubs.",
      "rating": 5.0,
      "verified": true,
      "author": "Caligirl818",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Protect Your Clubs When Shipping!",
      "text": "This case is very affordable and did a great job of protecting my clubs when I sent them FedEx to a tournament in the NE and back to my office in Atlanta. The lock works well along with the other two case closures. No damage to the case or the clubs.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve D.",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "Very Sturdy",
      "text": "Very strudy product that holds up great. Even had luggageman at airport comment on high quality of the product relative to other golf bag travelling cases.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Dowdy",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Fantastic case, well constructed and keeps clubs firmly in ...",
      "text": "Fantastic case, well constructed and keeps clubs firmly in place. Fits in trunk as well as airport shuttle luggage space as is not the case with larger cases. Wheels are excellent, two handles make it a cinch to carry, roll or pick up. Built in TSA lock was a great addition to the overall purchase. Highly recommended, purchased one for the wife as well, she was even impressed, now that's impressive!",
      "rating": 5.0,
      "verified": true,
      "author": "Jay Schutz",
      "helpful_votes": 0,
      "publication_date": 20140909
    },
    {
      "title": "👍",
      "text": "Only used once, but didn’t have/notice a single issue with this. If you’re using a small compact car you may have issues loading it.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith Benedict",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Pretty Good",
      "text": "Sturdy, just a little snug and sometimes the latches are a pain to lock down. But overall it’s pretty solid and gets the job done.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Awesome case!",
      "text": "Awesome case!!!! It has heavy duty hinges and heavy duty latches that are great for travel. I just came from South Korea and not a problem with my clubs or case. Well worth the money. I highly recommend this case for travelers.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat and Andrea Grimm",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Sturdy and roomy.",
      "text": "My previous travel case had exposed buckles and airport baggage handlers destroyed them and they no longer latched. This model has a guard on each side of the closures and should last much longer than the CargoGolf- Golf Guard Deluxe Hard Travel Case.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn G. Price",
      "helpful_votes": 2,
      "publication_date": 20161010
    },
    {
      "title": "It also fit the golf bag and clubs perfect. I wouldn't trade it for nothing else",
      "text": "Thanks for the availablity to purchase this. This case went through the gruesome treatment of luggage handlers of airlines. I have seen the treatment of luggage with airlines and this case took it. It also fit the golf bag and clubs perfect. I wouldn't trade it for nothing else.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170512
    },
    {
      "title": "Expensive but probably worth it",
      "text": "This golf case was expensive but it's the real deal. Hopefully will be the only one I'll ever need unless the airline totally abuses it. Feel very confident with my clubs inside.",
      "rating": 5.0,
      "verified": true,
      "author": "coloradddo",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "... to Mexico and back from the east coast clubs perfect and the case look great also very",
      "text": "One trip to Mexico and back from the east coast clubs perfect and the case look great also very impressed",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Well made",
      "text": "This case seems sturdy. Looking forward to some golfing on my business trips now!",
      "rating": 5.0,
      "verified": true,
      "author": "jack in the hat cat in the box",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Great Case",
      "text": "Case protected my clubs on a trip to FL. Just don't lose the keys like I did, but there are ways of opening the case without them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Too small to fit standard bag with legs",
      "text": "Does not fit my Taylormade lite bag. Good quality construction though. I’ve used SKB cases before and they’re solid. Measure your bag first. If you have a hard carry handle or something that won’t “compress” then it won’t fit. Going to look for something larger.",
      "rating": 3.0,
      "verified": true,
      "author": "JS41",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "met expectations.",
      "text": "case held up great on a flight to phoenix and was able to stuff more items in the case beyond the bags and clubs. very sturdy for its weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Leo D",
      "helpful_votes": 2,
      "publication_date": 20170313
    },
    {
      "title": "golf hard case",
      "text": "I shipped my clubs from Phila to Tampa on ground shipping no problems",
      "rating": 5.0,
      "verified": true,
      "author": "dennis fitzpatrick",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "AS ADVERTISED",
      "text": "I received my new SKB hard plastic for storage and travel case today. I looks and feels great. It's worth what I spent on it. I had to get raid of my old travel case that I won in a tournament. I can't wait to take it on my next trip.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin L. Manuel",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "protection you can count on",
      "text": "Recently traveled to Corpus Christi from Chicago. I had read reviews where customers complained of having to Duct tape their cases because they wouldn't hold up. This one held up!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Blank",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "Quality Product",
      "text": "This is a very high quality product. It's clearly well designed and built, and definitely worth spending a little more money on. Extremely satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonian",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "Withstood Connecting flights round trip: clubs and golf bag intact.",
      "text": "The case withstood the rough handling on 2 connecting flights. Our clubs arrived unharmed and intact. I even packed 2 cases of balls in mine on top of my golf bag. It's the best travel case for your clubs.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Martinez",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "As tough as they come",
      "text": "Outstanding quality. Very durable and held up well to the rigors of travel.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "i LIKED THE CARRIER VERY MUCH OTHER THAN IT IS TOO ...",
      "text": "i LIKED THE CARRIER VERY MUCH OTHER THAN IT IS TOO SMALL TO GRT ALL OF MY GOLF EQUIPMENT , SHOES ECT.. INSIDE. i WAS ALLI COULD DO TO PACK MY BAG AND CLUBS IN AND GET IT CLOSED. i LOOKED TO SEE IF YOU CARRIED A LARGER ONE BUT DID NOT SEE ONE. IF YOU DO LET ME KNOW, iI MAY CAN PASS THIS ONE ON AND GET THE LARGER ONE. OTHER THAN THAT IT IS A QUALITY PURCHASE. GARY. gary.reaves1@gmail.com",
      "rating": 5.0,
      "verified": true,
      "author": "Gary C. Reaves",
      "helpful_votes": 2,
      "publication_date": 20150519
    },
    {
      "title": "Additional Lock",
      "text": "Item is heavy duty, slim. I love this. However I lost key of it. How can I get extra key? How can I use additional lock Other than built in?",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Kim",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Small",
      "text": "Good case but too small. I knew I would have to take my driver out of my bag when i put it in the case but I diddnt realize my new Taylor made golf bag wouldn’t fit in it.",
      "rating": 4.0,
      "verified": true,
      "author": "Gordon Ottem",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Study but small interior dimensions",
      "text": "Seemed to be very sturdy but did not fit my golf bag. Taylormade flextech crossover - a fairly common bag.",
      "rating": 3.0,
      "verified": true,
      "author": "Juhytf",
      "helpful_votes": 2,
      "publication_date": 20180724
    },
    {
      "title": "Excellent!",
      "text": "Great travel case, Much better for me than the soft travel bag!",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20180603
    }
  ],
  "product_meta": {
    "title": "SKB Cases ATA Deluxe Standard Hard Plastic Storage Wheeled Golf Bag Travel Case",
    "description": "SKB deluxe standard ate golf travel case\n\nAMAZON.COM\nRepresenting the latest in SKB quality and innovation, the SKB ATA deluxe golf travel case is ideal for golfers who frequently take their game on the road. The case is molded from ultra-high molecular weight polyethylene--the same material required by the U.S. military for cases and containers--helping keep your clubs secure whether going through the TSA inspection process or getting tossed around by baggage handlers.\n\nThe sculptured, form-fitting design, meanwhile, accommodates the vast majority of today's most popular golf bags, including bags that store drivers up to 48 inches in length. And thanks to the patent-pending industrial-strength latches and TSA locking system, you can apply TSA-approved locks for safe and secure travel. Other details include a Perfect-Match valance bending system; a dirt-, dust-, and moisture-resistant housing; and SKB's unparalleled million-mile guarantee and $1,500 club coverage.\n\nKey Features: * SKB’s Perfect-Match™ valance bending system provides a tight, secure fit to prevent dirt, dust, and moisture from getting inside the case \n * TSA accepted and recognized locking latch system for safe and secure travel, allowing airport security to inspect case contents \n * Sculptured, form-fitting case design accommodate popular standard and staff size golf bags \n * Includes SKB’s Million Mile Guaranty, SKB's lifetime warranty \n * Also includes SKB's $1,500 club coverage",
    "rating": 4.5,
    "feature_bullets": [
      "polyethylene",
      "Made in the USA or Imported",
      "Keep your golf club safe when traveling with a case that is contoured to fit cart bags, carry bags, and drivers up to 48 inches",
      "Molded from ultra high, molecular weight polyethylene and manufactured to meet or exceed ATA 300 Category I",
      "Comes with TSA Locking System for ease of airline travel and SKB's exclusive Perfect Match valance bending system, providing tight, secure fits to prevent dirt, dust, and moisture from getting inside the case",
      "New, patent pending industrial strength latches for superior valence closure and overall latch security",
      "Carton Dimensions (L x W x D): 52 x 13 x 16 inches and weights 19 pounds"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "Yes",
      "Product Dimensions": "47.99 x 14.02 x 10.98 inches; 17.6 Pounds",
      "Item model number": "2SKB-4814W",
      "Department": "Unisex-adult",
      "Date First Available": "July 8, 2007",
      "Manufacturer": "SKB",
      "ASIN": "B000A13PGA",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Accessories",
      "Sports & Outdoors",
      "Travel Covers",
      "Sports & Fitness",
      "Golf"
    ],
    "price": 188.8
  }
}