{
  "website_summaries": [
    {
      "verdict": "A quality carrier with a feature set that can't be beat for the price – offers durability, comfort, and convenience for a budget price.",
      "pros": [
        "Built to stand up to travel with its patented spring wire frame and strong leak-proof material",
        "Sports a no-slip strap and storage pocket"
      ],
      "cons": [
        "The interior runs a bit small, but there are three sizes to choose from"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "KNOCKOFF! \"SHERRA\"",
      "text": "I'm not one for posting reviews. But I was super upset when I realized this was a knockoff. I know I was getting a great deal. But that's kinda how Amazon works.. you can't put a price tag on my puppy so I went to Petsmart and just bought the real Sherpa. I'm attaching photos. The purple is the \"Sherra\" and the black is the official \"Sherpa\"",
      "rating": 1.0,
      "verified": true,
      "author": "The Florida Corgi Mom ",
      "helpful_votes": 513,
      "publication_date": 20170216
    },
    {
      "title": "Bought the large and traveled Southwest",
      "text": "Great carrier. I decided to go with the large, we were able to fit our \"thick\" 27 lb. pug in with no issues flying Southwest. He had space to turn and lie down but I don't think a pet any larger would fit. For reference the little guy is 22 inches long (excluding tail) and 14 inches high. We did start training him to get in a few weeks before travel so that he'd be ok in there for a couple hours, this step is highly recommended. We did not see any zipper failure as some have experienced. The bed was very stiff but seemed comfortable, the carrier held its shape when carrying nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Montoya",
      "helpful_votes": 368,
      "publication_date": 20160601
    },
    {
      "title": "Our cat loves it",
      "text": "The attached picture says it all: our 17lb cat willingly hanging out in his carrier. We decided to order this one because we needed something with a top load option. We used to struggle with getting this strong little guy inside our old plastic carrier, but were able to get him in the first time with minimal struggle. He's a large cat, but fits in perfectly with plenty of room to shift around and switch position. I'm a 5'3\" female and found this much less cumbersome to carry than the awkward plastic carriers, and the shoulder strap is a welcome option.",
      "rating": 5.0,
      "verified": true,
      "author": "Sassafrass",
      "helpful_votes": 266,
      "publication_date": 20160201
    },
    {
      "title": "Bad quality!",
      "text": "The material was noticeably flimsier than the prior Sherpa carrier that I had and the \"fleece\" liner shed everywhere. Then I noticed that the embossed pleather logos on the sides and on the strap spelled \"SHERRA\" instead of \"SHERPA\". I notified Amazon and received a full refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Melody J.",
      "helpful_votes": 68,
      "publication_date": 20170109
    },
    {
      "title": "It's perfect for my 15lb poodle",
      "text": "Petsmart sells this (large) for $85++. It's perfect for my 15lb poodle. No problems with air canada, west jet and Alaska air. Practiced with my dog in it 3nights before the flight and she loved it. Best part is the open-top zipper. And treats/food compartments . I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn",
      "helpful_votes": 43,
      "publication_date": 20160627
    },
    {
      "title": "Best Pet Carrier I have found",
      "text": "Best Pet Carrier I have found. We fly with our 14 lb Llasa/Terrier about 8 flights a year. We have never had an issue, and she fits perfectly in it. It has always fit underneath the seat on Delta, US Airways, American Airlines and Southwest.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Jennings",
      "helpful_votes": 50,
      "publication_date": 20160302
    },
    {
      "title": "The Perfect Carrier For A Cat",
      "text": "This large carrier has met all of my expectations. My cat loves the carrier- even as his new lounge area. It gives him enough room to be comfortable, and he can maneuver in it easily. It feels very sturdy! This carrier even has little feet at the bottom of it. I really like that feature, because then it is raised just a little off the ground so that it doesn't get covered in grime if you set it down. The top loading feature is wonderful. I would highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Elliott W.",
      "helpful_votes": 37,
      "publication_date": 20160623
    },
    {
      "title": "Over all a very good product.",
      "text": "I got the large size carrier and it works really well. We used it to bring back our new kitten on an airplane (Boeing 737). It fits under the seat but it's a little tricky to get the carrier in and out from under the seat. You have to push the corners of the carrier to get it in. Then we have no problem the next day using is to bring our kitten to the vet. Over all a very good product.",
      "rating": 5.0,
      "verified": true,
      "author": "xx",
      "helpful_votes": 21,
      "publication_date": 20160701
    },
    {
      "title": "LOVE THIS BAG!",
      "text": "We have used this twice to fly with our 19 lb. Frenchie, and encountered no issues on Allegiant Air and Southwest. He will fit in this when he is full grown at about 25 lbs. or so. Further, he LOVES it. We can't even take it out unless we are going somewhere because he gets so excited when he sees it. Bag also travels well in the car, and easy to carry with shoulder strap.",
      "rating": 5.0,
      "verified": true,
      "author": "Meyer FL",
      "helpful_votes": 25,
      "publication_date": 20160121
    },
    {
      "title": "Cat got out",
      "text": "The zipper in the front busted open and my cat got out. We were about to head to the vet and he was able to push it or open it with his claw. The zipper is now busted. This has never happened to me before. Case is useless now since it doesn't close. Imagine if it happened on the plane. They need to make sure the zippers teeth match up and are sturdy.",
      "rating": 1.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 9,
      "publication_date": 20171117
    },
    {
      "title": "Unfazed after a 5-hour journey",
      "text": "Phil, a skittish but friendly orange Tabby, is peering out after a flight from Virginia to California. He had one stop along the way. He was always content, able to see his human and have a cuddle when he wanted. He never put up a fuss about getting into the carrier as he did with his hard case. A dose of Gabapentin helped, of course. The Sherpa had \"Delta\" emblazoned on its labeling, so TSA let him right through without any frisking or intrusive questioning. (He wouldn't have talked anyway!)",
      "rating": 5.0,
      "verified": true,
      "author": "Beholden",
      "helpful_votes": 3,
      "publication_date": 20200310
    },
    {
      "title": "Great for air travel",
      "text": "Travel recently with my 15 lb mini labradoodle and she fit perfectly in the carrier. Its very sturdy and easy to carry. I was able to fit the Large Sherpa under the seat on my southwest flight. No one stopped me or gave me a hard time about the size. I didn't have much leg room for myself but she fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Riesenfeld",
      "helpful_votes": 28,
      "publication_date": 20150817
    },
    {
      "title": "Not sturdy!!!",
      "text": "Used twice aboard Southwest. Doesn't fit completely under seat in front of me. My 11 lb yorkiepoo was able to rip the plastic zipper through in two places while on the plane! Steward had a fit as dog got out of carrier! When I was unable to fix it several kind people gave me safety pins. I turned it upside down to keep her in the rest of the flight. Should have other reviews, I am not the only one with this experience.",
      "rating": 1.0,
      "verified": true,
      "author": "JoyBRollin",
      "helpful_votes": 10,
      "publication_date": 20160506
    },
    {
      "title": "It looks exactly like one but the sign on one side says “Sherra” ...",
      "text": "Not really sure if this is an authentic Sherpa product. It looks exactly like one but the sign on one side says “Sherra” Hmmm?",
      "rating": 3.0,
      "verified": true,
      "author": "AmazonAddict",
      "helpful_votes": 8,
      "publication_date": 20180227
    },
    {
      "title": "Highly Adjustable and Durable. Great for Cats.",
      "text": "My cats, the larger of which is 13 lb, can't seem to damage this carrier. It can be shoulder-mounted or hand-held. It opens at the top and at the side. There's a zippered pocket at the back. It folds up easily for storage. Some cats refuse to get into carriers they're not familiar with. Vets often suggest leaving carriers out so that these cats can become accustomed to them. This carrier makes that easy: one of my cats loves sleeping in this. He likes it more than his two cat beds, in fact. It's not complete by itself, however. You'll probably want puppy pads for easy clean-up and a blanket or carrier cover for weather.",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 2,
      "publication_date": 20190406
    },
    {
      "title": "These are well-constructed, but DO NOT buy if your ...",
      "text": "These are well-constructed, but DO NOT buy if your pet is prone to accidents. It is impossible to clean these things thoroughly. There are some nooks and crannies that you simply cannot clean, and the fluffy fleece mat is not machine washable, despite what the product description says. I spent about an hour scrubbing it out with enzymatic cleaner. Still smelled. Then, in desperation, sent the whole thing through the washer. Still smells like pee. Had to throw it away.",
      "rating": 1.0,
      "verified": true,
      "author": "GreatStuff",
      "helpful_votes": 7,
      "publication_date": 20161202
    },
    {
      "title": "Great deal, sturdy, high quality, discreet",
      "text": "Don't hesitate with this carrier! It is great quality! Lots of ventilation for the dog and convenient enter/exit options (top or side). I got the size large for my 22 pound dog and it is perfect. I was very hesitant before ordering if it would be big enough for him but small enough for the plane. It is! It is also sturdy enough to carry him with ease even though he is technically on the heavier side for a carrier like this. I've used this carrier for multiple trips between Europe and the US and it's still like new. Another plus-- it is soo much cheaper on Amazon than at PetSmart!! Very happy",
      "rating": 5.0,
      "verified": true,
      "author": "KG5",
      "helpful_votes": 7,
      "publication_date": 20170426
    },
    {
      "title": "Good Sherpa Quality",
      "text": "After reading some reviews I was a bit hesitant to order, but I've purchased Sherpa in the past and then tried a different brand that had a terrible pet carrier, so wanted to try Sherpa again. The grey medium carrier did not disappoint. Right out of the easy to open box I could tell it was made with strong quality material. I checked all the labels and they all said Sherpa. I'm happy I decided to buy this product and will eagerly toss out the old flimsy different brand one I have stored.",
      "rating": 5.0,
      "verified": true,
      "author": "JacquelineS",
      "helpful_votes": 2,
      "publication_date": 20200812
    },
    {
      "title": "Cat approved",
      "text": "The Delta carrier is perfect for my cat sized cats who are 9 & 11 pounds. They have plenty of room to move around and it's comfortable enough for them to sleep in. However, it isn't big enough for my 17 pound cat (see photo). He is taller and longer than an average cat. I bought him the Original Deluxe carrier in size large which fits him perfectly. I love that you can load them through the top. I'm so pleased with these 2 carriers that I ordered 3 more for my other kitties.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy",
      "helpful_votes": 2,
      "publication_date": 20200517
    },
    {
      "title": "Had one like this before...",
      "text": "I had this same carrier many years ago for another little guy and loved it, It is easy to clean the interior if needed. It is well made, easy to zip open and closed and easy to carry. My little dog is only 5 1/2 lbs, but he is tall. At first, I had to bribe him to get inside, but now he goes willingly. There is enough room for him to stand and to turn around. He looks comfortable. The plan is to use this carrier for air travel. Dimensions are within the limits for AA. Good price for such a well made carrier.",
      "rating": 5.0,
      "verified": true,
      "author": "jon",
      "helpful_votes": 2,
      "publication_date": 20200825
    },
    {
      "title": "Must have.",
      "text": "If you're going back and forth between different carriers - buy this one. I have a 20 pound pug, and this made a 5 hour flight. He has extreme anxiety and this was his first plane ride. He scratched at it for hours, peed in it, chewed on it, and it STILL somehow made it. It fit perfect under the seat of a Southwest Airlines flight.",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla",
      "helpful_votes": 9,
      "publication_date": 20170628
    },
    {
      "title": "Perfect carrier for Southwest",
      "text": "I purchased this for my 20 pound pug for a flight we were taking from Texas to Reno. I was initially concerned that he was too large for the carrier. Southwest Airlines states that the pet must bed a be able to stand and turn around easily. He was not able to...but he was able to lay down comfortably. Southwest accepted my dog as my carry on without any issues. He seemed very comfortable and had a great flight. It fit perfectly.y under the seat and was very easy to carry around the airport. This is a great carrier!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth A.",
      "helpful_votes": 12,
      "publication_date": 20160408
    },
    {
      "title": "Secure, good for airplanes",
      "text": "I bought this to take my cat on an airplane, and still use it as his carrier. It collapses easily, which isn't great for everyday travel, but is helpful when taking it on a plane as it can fit under the seat in front of you. I have used this on Southwest and American Airlines flights. I used it when my cat was 3lbs, and now that he is 14lbs. He hates being confined, so there are scratches on the inside top of the carrier, but he has never managed to pop even his paw out of the bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine J. Singler",
      "helpful_votes": 2,
      "publication_date": 20180821
    },
    {
      "title": "Great carrier",
      "text": "When I tell you I went crazy with all these different airlines dimensions and carriers sizes and if it was going to be accepted or not(I really went crazy)😂 And the thought was even worse...be stuck in airport with my pup because I was denied carrier. Well I finally decided to purchasethis Sherpa in a L for my 9lb female shih tzu. We traveled by Southwest airlines...no questions asked about carrier and it fit perfectly fine under seat. She was scratching up on it because she was a bit nervous...first time flying! But it held up well. The sherpa pad I would say could be a little more thicker if anything but it does the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20180611
    },
    {
      "title": "Knockoff.",
      "text": "Knockoff product, labels on carrier say SHERRA and not Sherpa.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Murch",
      "helpful_votes": 7,
      "publication_date": 20180809
    },
    {
      "title": "Large carrier used on Southwest Flight!",
      "text": "Our pup weighs 17 lbs and she's pretty long. This carrier is fantastic for her! She had room to turn around and no issues with air flow. I bought the large knowing that it was larger that what Southwest airlines \"allows\", but I read a review from someone else saying they used it on Southwest so I gave it a shot. No issues!! They did not measure the bag and the bag fit perfectly under the seat. I even had room for my purse.",
      "rating": 5.0,
      "verified": true,
      "author": "srh5213",
      "helpful_votes": 2,
      "publication_date": 20200102
    },
    {
      "title": "Not reliable! Use with caution.",
      "text": "The case worked fine on a jet blue flight as far as fitting under the seat in front as required. The reason I am giving this a low score is because before we got to the TSA security, the shoulder strap popped off making it useless. Thankfully my boyfriend had quick reflexes to grab the bag. This terrified our cat even more.... before the flight even happened! Will not buy again. If you have one, don’t rely on the shoulder strap. It’s supposed to be for ease but it didn’t last (our cat is 3urs old, 11lbs for reference).",
      "rating": 1.0,
      "verified": true,
      "author": "Lady Hopeful",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Sherpa or Sherra?",
      "text": "Looks good but it says Sherra on the handle supports. I think it is not original.",
      "rating": 1.0,
      "verified": true,
      "author": "Edison Chaves",
      "helpful_votes": 7,
      "publication_date": 20180602
    },
    {
      "title": "Works on Virgin America",
      "text": "We used this twice to move a cat across the US. Both flights were on Virgin America and they had no problem letting us keep our cat securely in this carrier under the seat in front of us (after paying a $100 pet fee) On the second trip our cat threw up on the lining, but it easily came out in the washing machine.",
      "rating": 5.0,
      "verified": true,
      "author": "M Hayes",
      "helpful_votes": 6,
      "publication_date": 20160424
    },
    {
      "title": "Airline approved small dog carrier",
      "text": "I adopted a small dog out of state, and needed to bring her home with me. Thank goodness for Prime delivery. This bag was perfect, there are plenty of flaps to view, and close for privacy. My pup did exceptional on the flight, and the bag slid under the seat in front of me. Although, that will impede leg room. I had the whole row to myself, as I was worried she might cry or bark, but she did neither, and I could check on her. I unzipped the top to let her out. The case is soft for folding and storage, so if pressed enough a side could collapse while a pet is inside, so be careful.",
      "rating": 5.0,
      "verified": true,
      "author": "wilhlin",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Good, basic travel bag for small/medium dog",
      "text": "So far I am very pleased with this purchase. I previously had the amazon basics one that looks just like this. This bag feels like slightly better quality. The strap is a lot more sturdy and comfortable. I also like that this is just a smidge smaller (I think about an inch or so) than the Amazon bag. My Amazon bag broke on my last flight because it didn't fit under the seat (my fault it broke- I was jamming it) but needed it just a tiny bit smaller to fit. I have a 17-lb cavachon. I know it says up to 16 lbs but she fits fine in it. Of course, every dog is different.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika N Huber",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Bought it; sent it back",
      "text": "I owned 2 Sherpa Pet Carriers and was purchasing replacements and I had two issues with the new bags. First, The material was noticeably thinner than both previous Sherpa Pet bags I own. Comparably, the word flimsy comes to mind for the new bag. But I would have lived with the reduced quality of the bag material. Second, and the reason I sent it back, the zipper immediately separated behind the slider the first time I attempted to zip it shut. I sent it back along with the unopened second bag I had purchased. The 2 Stars rating is for the ease of shipping them back and receiving a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "R Dolce",
      "helpful_votes": 2,
      "publication_date": 20190911
    },
    {
      "title": "Too small",
      "text": "I carefully measured my cat, and know how much he weighs. Given this crate is pretty expensive, I wanted to make sure I got the correct size. According to their measurements, I was to order a medium. Sadly, this is ridiculously small for my cat, despite what their calculations were. Basically 95 dollars down the drain. And I’ll also add that the pad that comes in it is extremely thin for the expensive price!",
      "rating": 1.0,
      "verified": true,
      "author": "Bonnie J. Medd",
      "helpful_votes": 2,
      "publication_date": 20181029
    },
    {
      "title": "Cats Love \"Sherpa Large Pet Carrier\"",
      "text": "Sherpa Lining is thick and Velcro attached on bottom Support, Sherpa covers entire bottom support of Carrier. Purchased Large as it gives plenty of room for Cat to hide under towel and move about during transport. Cat cannot break through the heavy mesh type material for ventilation. Has Top Zipper Opening to place Cat down into Carrier. Second option is Zipper Opened front which is also for placing Cat inside Carrier. Must buy another as I've another Cat. Leaving Zipper doors open with Carrier on floor allows for my Cats at Play box when not being transported.",
      "rating": 5.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 3,
      "publication_date": 20170516
    },
    {
      "title": "Top Zipper could not contain Small Dog",
      "text": "Our 6lb chihuahua was able to push her way through the zipper and pop out while in flight. We fixed the zipper - she'd just popped the teeth apart - for the return flight, but out she popped again. The carrier gets a star because our cat likes sleeping in it at home.",
      "rating": 1.0,
      "verified": true,
      "author": "imperial inquisitor",
      "helpful_votes": 6,
      "publication_date": 20170606
    },
    {
      "title": "Good for single pet owners...maybe consider an expanding one for multiples",
      "text": "I initially bought the sherpa because it was highly recommended, and I can see where that comes from. It's an attractive, sturdy bag, with mesh all around so my cats can see out, and a comfortable, removable liner. It's very sturdy and has carried both my 8lb cats in it at once (though it really hurt my shoulder to do so). However, because I have two cats and will travel with them together, I eventually replaced my sherpa with a carrier that expands, so I can bring them on board Southwest flights with me and they'll have a little more room. People with only one pet should find the sherpa a great fit for their day-to-day carrier needs.",
      "rating": 4.0,
      "verified": true,
      "author": "Luca",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Not up to the Sherpa standards I was used to.",
      "text": "This case has 2 stabilizers in the top that will not stay in their place no matter what I do. In addition, my Sherpa bags in the past had nice faux lambswool bottom. This one has a pad that velcros in and the first day, my puppy had the bottom piece dismantled and started chewing on the board. Not a great thing!! I had to buy a bed and put it in the carrier to be able to use it. I am very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Rebecca E.",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "A Feline AirBNB Luxury!",
      "text": "I really love love LOVE this cat carrying case. It's very cozy and comfy for my cat Tiger who slept like a spoiled feline king while on the plane to Phoenix from Pittsburgh (despite its dimensions being slightly above Southwest's size limnit I had no problem bringing him onboard). Due to its bulkier size I was able to put his favorite pillow inside in place of the sheep woolskin pad. A GREAT product overall!",
      "rating": 5.0,
      "verified": true,
      "author": "M. W. Trimble",
      "helpful_votes": 15,
      "publication_date": 20150518
    },
    {
      "title": "Worked great for my Boston Terrier",
      "text": "First time for our little man flying. Worked great for my Boston Terrier, he weighs 22.2 pounds. We bought the medium size. It was small for him but we knew most airlines has the sizing for the medium size bag. He was able to lay comfortably but he was not really able to turn around in the bag. All and all the product was as described and everyone's reviews really helped.",
      "rating": 5.0,
      "verified": true,
      "author": "College Student01",
      "helpful_votes": 7,
      "publication_date": 20170427
    },
    {
      "title": "Quality well made carrier.",
      "text": "Such great quality! My ten pound cat fits in the medium perfectly with a lot of room left. I leave it out and find her sleeping in it quite often. She is a great car traveler, but her first carrier did not have enough ventilation. This has plenty! So happy I invested in this product. It will last her lifetime.",
      "rating": 5.0,
      "verified": true,
      "author": "Gigi S",
      "helpful_votes": 12,
      "publication_date": 20160329
    },
    {
      "title": "My dog and I both like it",
      "text": "I purchased this carrier for our 6 lb Chihuahua and we both love it. She’ll go and sit in it even when we’re at home. I wanted something where she wouldn’t be crammed in and this is plenty of room for her. The bottom is sturdy and does not sag with her in it. It has lots of mesh on the sides so she gets fresh air. This is for car use and it makes me feel better that it has a place for a seatbelt strap.",
      "rating": 5.0,
      "verified": true,
      "author": "MDR",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Love, love",
      "text": "Love, love, love it. We travel a lot with our pets, mostly by car these days, but are not strangers to flying with pets. Bought this bag to replace a similar-style bag we got in Germany many years ago. It is very sturdy, has great ventilation and plenty of room. Love that it can be attached to a luggage telescoping handle and seatbelted into the car. Will update with any issues, but so far it is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "MN",
      "helpful_votes": 9,
      "publication_date": 20160701
    },
    {
      "title": "Exactly the right size",
      "text": "We have an elderly female cat who is not fond of behing handled. Picking her up to put into a kennel for a visit to the vet was something of a challenge. This is front-loading wich meant I could herd her in, without having to lift her up. Sounds like a small thing, but it is really important to us that we keep her stress levels down. We leave it in the dining room with the front open. Once in a while we catcher her sleeping in it. Of course, when she catches us, she sticks her nose in the air and goes to her dry food to eat. Would buy this again i a minute.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard A. Galen",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Horrible",
      "text": "No rating at all Highly disappointed in this product after reading all the hype and how this is one of the best of this kind of product on the market . Not so will return and go a different brand . Should of known when I undid the tape and seem other dog hair in it . Thumbs down . Small carrier. 6lb dog. No pros, plenty cons Cons: Runs small Bottom surface larger then carrier, Ripped multiple places on pad and inside seam of zippered pocket. Pos: Dog liked going in it Color was purple .",
      "rating": 1.0,
      "verified": true,
      "author": "Staci",
      "helpful_votes": 5,
      "publication_date": 20170906
    },
    {
      "title": "It's been he best investment for air travel yet",
      "text": "It's been he best investment for air travel yet. My 12 lbs maltipoo has plenty of room. It looks a lot smaller than him, but surely he fits nicely in it. And it fits right on top of our luggage, even with him inside. Very good qaulity.",
      "rating": 5.0,
      "verified": true,
      "author": "John Truong",
      "helpful_votes": 10,
      "publication_date": 20161109
    },
    {
      "title": "Great carrier for the price",
      "text": "Great carrier for the price! I did quite a bit of research to find a suitable carrier to transport my cat from AZ to MO via car and this was exactly what I was looking for. My cat was comfortable the entire time and the carrier itself is very space friendly yet roomy for the animal. Very happy with the quality and would definitely purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "fvalentino",
      "helpful_votes": 4,
      "publication_date": 20170707
    },
    {
      "title": "Good design - just one flaw.",
      "text": "Love this carrier and it works great for our cat. Problem: the two stays (plastic rods) in the top can be removed and chewed on. I left the carrier out for the cat to get used to it and he managed to pull out both rods, eat the plastic end caps, and chew on the ends. Still usable, but the stays should be permanently sewn in once you get your product.",
      "rating": 3.0,
      "verified": true,
      "author": "Madeline",
      "helpful_votes": 2,
      "publication_date": 20200103
    },
    {
      "title": "Good for Alaska Airlines",
      "text": "The Sherpa Large carrier worked well for us on Alaska Airlines B737-900 for transporting our 11 lb Poodle/Bichon mix cross country. It fits under the sea and sticks out about 1-2\" past the metal box between the center and isle seats. The case is soft and dogs weight causes the case to sag when carried. The top zipper is good for checking on the pooch without opening the main door. I would not recommend this case for long term use due to the soft material, but it should be adequate for occasional travel.",
      "rating": 5.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 4,
      "publication_date": 20170623
    },
    {
      "title": "Perfect",
      "text": "This carrier is great for traveling with my dog. We have a medium Dachshund who is about 15-16lbs and he has plenty of room. The only problem is that Delta now says that this carrier is too large to go under their seats in newer planes that come with the in-seat entertainment. Which is untrue because it fit perfectly fine, but just know they will probably tell you that it can't come on board. I'm not sure about other airlines though. For everyday travel though this is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Shh...One More Chapter",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Great as a cat bed when not needed as a carrier",
      "text": "My cat loves this carrier! I find her sleeping in it all the time. I leave it available as a bed 24/7 — which helps make vet trips less stressful for her & makes it where she is much easier to coax into the carrier. She is a large breed cat so I had to upgrade from the medium when she was a year 1/2 old to the large. The medium should be fine for most cats— as she is 13 lbs and not overweight. She could still fit in the medium but it seemed just a little cramped.",
      "rating": 5.0,
      "verified": true,
      "author": "Will232",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "So glad I chose the Sherpa!",
      "text": "There are tons of dog carriers here on Amazon. Many have great reviews and trying to decide which one to buy can be confusing. That being said, I am so glad I chose this carrier!. It's lightweight, sturdy, and very well thought out in terms of its design. I had no problem flying JetBlue from Medellin, Colombia to New York (JFK) with my 4 month old English Bulldog. It didn't hurt that she pretty much slept the entire way. I attribute that to the comfort of the carrier. After we arrived, she loved using it as a bed/crate until she eventually outgrew it.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan Abrams",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Seems good",
      "text": "I must announce that I am reviewing this without actually having used it for travel. I bought it for my 10-pound senior cat in case we need to go to the vet or I want to take her on a trip. She is especially fearful of new things, so I worried that I would be able to get her into the carrier. But it sits on the kitchen floor now, and once in a while I toss one of her treats inside, and she dashes in with no reluctance. So all I can say for sure is that she is reasonably comfortable with the fit of the space. Once I actually have to travel with it, I will update here.",
      "rating": 4.0,
      "verified": true,
      "author": "Ronald",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "A stellar travel option for pets",
      "text": "I just had the most pleasant flight with my three month old puppy (ten pounds of Australian Shepherd). After spending a week getting him accustomed to it, via treats and putting the removeable pad in his crate at home so it smelled familiar, he now goes in on command and immediately settles down for a nap. It's a little short for him when he stands but he slept the whole way and the top opens so he can stretch in the airport. It's roomy enough for him to stretch out while he naps and have a toy for company.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Zwick",
      "helpful_votes": 13,
      "publication_date": 20150509
    },
    {
      "title": "Perfect!!",
      "text": "I bought this for my fat 16lb cat for when I take him to the vet and he’s actually comfortable in it because of how big it is! He likes it so much that I keep it in my room for him to go lay in he loves it! It’s lightweight (except heavy when my fat cat is in it). The only thing I kinda dislike is the bottom isn’t as sturdy as I expected but it definitely does the job! It comes with a great shoulder strap and it also has handle bars. One thing I dislike about it is that the back of the carrier isn’t also mesh so my cat can only see out on 3 sides.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "It worked, but with some issues",
      "text": "Pros: Big Nice removable fleece flooring Large size fit under the seat on Southwest (just barely, took up all of the available space) Top loading made it easy to get the cat in Shoulder strap, luggage strap, and hand strap helped with carrying Cons: The netting seperated from the frame after the first use One of the feet arrived broken Had a very strong plastic smell when first arrived The little rubber caps for the metal structrual pieces on the inside top of the carrier fell off easily and could've been a choking hazard",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181212
    },
    {
      "title": "Cat loves it, I love it.",
      "text": "This is a serious upgrade from another soft sided carrier that I *thought* was good quality. This is one sturdy bag. I set it open on the floor for my cat to get used to it and it’s been his new favorite sleeping place. Last trip to the vet, I simply zipped him up while he was napping and we were off. The zipper quality, always an issue on previous carriers, feels very well made. My cat feels secure and calm. I’m officially a big fan. So far, it’s been only car rides, but I wouldn’t hesitate to take this on a plane (medium size).",
      "rating": 5.0,
      "verified": true,
      "author": "abitbookish",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Sturdy Bag, But Small",
      "text": "I have a 12 week old toy poodle puppy. We are traveling on Delta from Cincinnati to Florida. I called Delta Airline and they said the bag had to be 15X13X10. That is why I bought this specific carrier. My poodle puppy is 1 pound 13 ounces. I am attaching photos, so you can see that he has room, but not much. He will be 5 pounds full grown. So this carrier will be fine for him. The bag is basic (opening on top and side), small zipped up pouch in back, and sherpa removable bottom (attached to bottom with velcro).",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole L Costello",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Poor quality, cut my leg on wire",
      "text": "I loved my carrier and was so excited with the quality at first. I’ve used it about a dozen times, and a wire started poking out through the fabric. I then cut my leg on it while walking by not realizing it was out.",
      "rating": 2.0,
      "verified": true,
      "author": "Hailey",
      "helpful_votes": 3,
      "publication_date": 20190929
    },
    {
      "title": "Slightly flimsy but happy with this purchase",
      "text": "This pet carryon travel bag is a bit flimsy so picking up my small/medium size dog was kind of awkward. However, I think it’s such a good value. My dog is on the slightly larger side but he had decent room to lay down. He likes to sleep on his side and this doesn’t give him that room to do so, but he slept nonetheless.",
      "rating": 5.0,
      "verified": true,
      "author": "Gia",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Good product",
      "text": "Good size as I have 12 lb cat. Plenty of space, airline approved as I’ve traveled on Alaska air with this bag. Unfortunately I was required to place two cats in one carrier, (had multiple animals) but they were able to turn around somehow even though being squished. I removed the Sherpa liner due to heat concerns. The Sherpa detaches with a button.",
      "rating": 5.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Great product and very happy with performance on recent SWA flight",
      "text": "This was an upgrade for a kitten sized carrier I liked very much last year but he had grown. This Delta Airlines marked Sherpa carrier was impressive and at a fantastic price. Young cat fit in fine, carrier fit under seat in front of me on a 3 hour SWA flight (I put my toes under the carrier to keep a feel) and overall stress less experience traveling during a pandemic. I note the carrier has some reinforcement poles on the edges which felt more sturdy than prior carrier which was reassuring. Thankfully this carrier did well during otherwise difficult times.",
      "rating": 5.0,
      "verified": true,
      "author": "E in Chicago",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Good for small animals like rabbits.",
      "text": "I actually bought the small size for my bunny, to take him to the vet and it works perfectly. He is about 8lbs and it seems very like a really good quality. It arrived as expected. It has one solid side with a zipper to put his leash, etc. In so that was a plus. All other sides are mesh to allow for plenty of air flow. I like that this travel carrier also has a top zipper and an end zipper which both help with getting a bun in and out. The small size would definately not have enough room for any critter over about 10lbs.",
      "rating": 5.0,
      "verified": true,
      "author": "BuckeyeMoJo",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "not leak-proof.",
      "text": "it's pretty but it is NOT leak-proof. cat peed in it on the way to the airport, it soaked through, and the outside of the fabric was damp with pee for the whole journey, got pee on everything it touched (which was mostly me because I'm courteous and put it on my lap instead of getting pee on the airport carpet/seats/etc). also the shoulder strap way of carrying it is kind of weird. I don't know if it's just my posture/gait/strap adjustment, but the weight of the cat plus the walking tempo made the cat kind of rotate/swing left and right while I was walking, bumping into my body, which my cat and I didn't like at all.",
      "rating": 3.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "This is the one you want!",
      "text": "I purchased this for my mom for her first trip flying with her dog. He is a Shih Tzu mix and 13 lbs. As described by other reviewers, it squeezes well under the seat in front of you on the plane as it has a flexible top. It was a little larger than the airline requirements but no one said anything to her and she had no difficulties fitting it under the seat. She flew JetBlue. We hemmed and hawed and were not sure about it. But, we are SO happy we got it. If you are doing the same, then get this one and stop fretting.",
      "rating": 5.0,
      "verified": true,
      "author": "in10sitty",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Very nice, I like it.",
      "text": "Our 16 pound cat fits in it well and it's perfect for taking her to the vet. It's definitely a Sherpa, sturdy and easily folds flat for storage. It holds its shape when opened unlike other carriers I've had in the past. Very pleased and will purchase another soon for our other kitty. I'd like to offer a suggestion as most cats don't like being out of their element. Drape a towel, etc. to cover the mesh sides of the carrier to prevent a freaked out cat from \"sensory overload\".",
      "rating": 5.0,
      "verified": true,
      "author": "K. Dougherty",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Poor quality. Zipper broken and roof collapses.",
      "text": "Bought this to bring home a new puppy. On the flight to pick up the puppy I opened the zipper pouch to put my headphones inside and when I zipped it shut, the zipper split open. Not to mention it won’t stay expanded. it keeps collapsing on itself so the roof will be pushing down on my new puppy’s head when she’s inside. Haven’t even gotten the pup yet and it’s a failure of a product. And once a zipper splits at the seam once, it’s wrecked forever. So I’ll hopefully be able to return this for a refund. What a letdown. Thankfully i got it for around $30. The same exact bag is now $58 on Amazon. Really disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "GM",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Never received the right item",
      "text": "I can’t give this carrier full stars because i never got to try it out fully. I have a very large bodied cat (14lb) who is in need of a new carrier. I have heard great things about this Sherpa carrier and was excited to get in in purple to match my luggage. Unfortunately, I received a maroon and brown carrier which I returned, received another of the exact same color, and had to return again. I really wish I could have used an appropriately sized carrier for our trip today, but unfortunately, he will have to go back in one that is too small until Chewy.com gets theirs back in stock.",
      "rating": 3.0,
      "verified": true,
      "author": "ashleigh",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Best available",
      "text": "If you travel with your pet often, just get this. I have tried a variety of carriers but these are the best. They fit nicely under the airline seat. The pet has plenty of ventilation & room to move around. The trolly strap allows for it to easily fit over the handle of your carry on bag. We use the medium size it for a 6lb pomeranian. It gives plenty of space for her to move around on a long flight. She could fit in the small, but we want her to be able to change positions whenever she wants.",
      "rating": 5.0,
      "verified": true,
      "author": "The Candle Lady",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "No Roll Down Flaps On Deluxe Bag",
      "text": "I liked that the bag would have roll down flaps to keep my cat calm. The deluxe bag I ordered did NOT have roll down flaps, though it is in the description. I am keeping the bag though, as I don't want the hassle of returning it. Other than that it seems to be a good carrier & my cat has slept in it a couple of times (with the front flap open. I haven't used it outside the house yet, so I can't say how well it will hold up for going to & from the vet, which is what I purchased the bag for.",
      "rating": 4.0,
      "verified": true,
      "author": "krafty pixie",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "The best cat carrier Ive used",
      "text": "I used this while moving cross country with my cat. Most carriers are too small for her and its hard to get her in if theres no top entry. She loved this one, I could even check on her from the top entry while driving. She was very comfortable [long haired cat 14lbs] and had the room to stretch out. She even felt comfortable enough to sleep. The lining also comes out and is cleaned easily. The crate itself is sturdy, even the netting parts. I also like the strap to put the seatbelt through to secure the cat during car travel.",
      "rating": 5.0,
      "verified": true,
      "author": "trustworthy human",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Not genuine",
      "text": "This is not a genuine Sherpa product, it serves it’s purpose but it’s not the quality you would expect",
      "rating": 3.0,
      "verified": true,
      "author": "MMG",
      "helpful_votes": 3,
      "publication_date": 20190219
    },
    {
      "title": "Roomy, but not sturdy enough for my cat",
      "text": "This is a really nice carrier. I ordered a large for my 15 lb. cat, after reading others' comments that the medium wasn't big enough, despite the company's claims that a medium could accommodate animals up to 20 lbs. The flight attendant on my United flight let me fly with this carrier, but only after lecturing me that it sticks out from under the seat and therefore isn't up to code. And my cat pretty much ripped it apart during the flight. I had to hold it shut as I carried him off the plane.",
      "rating": 2.0,
      "verified": true,
      "author": "Kerry A Philp",
      "helpful_votes": 13,
      "publication_date": 20140509
    },
    {
      "title": "Scratch proof, won’t tear, comfortable for small/medium sized cat for long flight",
      "text": "This is a great TSA/FAA approved pet carrier. Used for a 12 pound cat. Put it out, open, in the house a month before flying so the cat would get used to it. It stood up to some scratching by the cat. Other models have torn easily leading to terrible flight experiences, trying to prevent the cat from escaping from the bag. Go with this bag if your cat is the right size. Used on a 12 hour flight.",
      "rating": 5.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Our sweet little kitten had to take her first trip to ...",
      "text": "Our sweet little kitten had to take her first trip to the vet this weekend, so I had taken time over the days beforehand to fill this carrier with treats and toys to make it more inviting. She had so much fun playing in this well-made carrier that by the time we actually had to use it for a trip, she was much calmer than she would have been otherwise. The lining of the carrier is soft and easily washed (which came in handy when our scared girl had an accident at the vet) and it's sturdy enough to assure me that she's safe and comfy. A+ all around!",
      "rating": 5.0,
      "verified": true,
      "author": "GinaTop Contributor: Pets",
      "helpful_votes": 2,
      "publication_date": 20170522
    },
    {
      "title": "Perfect for in-cabin travel",
      "text": "I bought this carrier for my dog when she travels on the plane with me. It does the job and fits perfectly under the seat in front of me in regular economy airline seats. The carrier does the job and looks nice! I have a 16lb mini-poodle who is about 16” long and she fit fine. Not necessarily that spacious for her but as I said, I only intend on using this carrier for air travel. I added a picture of my dog just in case anyone wants a size reference.",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "comfortable for pet",
      "text": "I have a 12-14 lb girl chihuahua, a little on the long side - 12\" - 13\" back from shoulders and 17\" chest. I had purchased the medium, and I was worried when I saw the carrier that it was too small. However, it fit her just right, with room for a little blanket and some toys. We had to leave her at the vet for a few hours so this was really important that it was comfortable for her, and it turned out fine. It looks great too. I think this will last us for a few years.",
      "rating": 5.0,
      "verified": true,
      "author": "KLouthan",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Feels safe!",
      "text": "Its really sturdy and the fabric is and stitching is thicker than most I've tried. My cat is 22lbs and I can carry him alot easier than in the huge heavy rattling hard carrier. The bottom floor insert is very thick. I can't bend it and so maybe its made of wood or something. Ut doesn't feel as if the handles will rip off under his weight. All in all I feel he's safe in it. Btw, the brown color is actually a much nicer dark espresso color instead of the carmel tan that is shown, so that was a plus.",
      "rating": 5.0,
      "verified": true,
      "author": "Lvisty",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Really want 2 now.",
      "text": "I was nervous with some of the review I read. I went straight to the Sherpa website and confirmed the bag. It came as described. I thought it looked small but when it was next to my old one was same size just WAY sturdier. Cat fit perfectly. She loved looking everywhere with the mesh. The bag was so easy to carry, didn't buckle or anything. Easy to put struggling cat in and close quickly. Only 1 hair of downside, one of the zippers was a little hard to move. Wax fixed it",
      "rating": 5.0,
      "verified": true,
      "author": "Denise Bertinazzi",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "On the small side but good quality",
      "text": "We bought this for our 16 pound havanese to use while traveling in the car since he won't be still. We went with the medium and he does fit, but it's definitely smaller than I was expecting. For trips that aren't too long, this will work, but I wouldn't want to keep him in there for an extended time. We have only used it on one trip so far, but the actual quality seems to be good and he didn't mind being in there.",
      "rating": 3.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Great Bags to Transport Puppies with Frontier Airline",
      "text": "We purchased two of these Sherpa size Large bags to transport our Boston Terrier puppies, whom are around 7lbs, 9 weeks each, from Oklahoma City to San Diego flying with Frontier. They fit under the sit in front of us, were easy to handle, and Frontier was very friendly and accommodating. If you are flying Frontier, pay the additional $30 and pick an up-front seat with more legroom. You will not regret this decision, unless you’re really cheap or broke, but if that were the case, you wouldn’t be reading my review for one of the higher quality, pricier bags, now would you? Overall, very happy with our purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Sky",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Large with space and adequate viewing for cats",
      "text": "No one cat carrier brand is the ultimate cat carrier but this carrier is well worth the money. I choose the Large Carrier as my cats are usually fidgety and don’t particularly like enclosed spaces that they have been forced into (my last carrier was a gift!). Additionally, I chose it because it has air pockets and allows the cats to view everything in front and to the side. They are naturally curious so satisfying their curiosity usually helps calm them down. I haven’t taken my flight yet but when I do I will update my review.",
      "rating": 5.0,
      "verified": true,
      "author": "Der Adler des Mondes",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Perfect for our CAT",
      "text": "We were a little skeptical about our cat liking this but as soon as we set it out, she climbed right in. I bought it for traveling but because of the national situation, it may be a while before we can test it out, thus no review on the traveling part. Other than that, our Twenty loved it and looks like she may use it to sleep or nap in. Of course, when she finally does travel in it, it may be a different story about how much she will like this. In the mean time, we are really happy about it and am very glad with the money being well spent.",
      "rating": 5.0,
      "verified": true,
      "author": "Tomas",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Love it",
      "text": "Very nice carrier. Only thing I think could be better is the quality of the pad and pad support after owning other carriers but it is ok. Slightly bigger than Alaska Airlines allows but it fit under the seat with room to spare and they didn't question it at check-in. Very nice sized pocket compared to others I tried and the lack of top screening actually works better to keep the dog calm and prevent light flashes that seem to cause my dog to be carsick.",
      "rating": 5.0,
      "verified": true,
      "author": "Gremelly",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Great pet transport",
      "text": "This carrier is heavy duty and fits a 10-lb kitty very comfortably. All the zippered closures and storage make it convenient to get your pet in and out (despite the squirming) and keep all the docs in one place. It folds down but doesn't collapse or bulge when filled with a pet. The construction is very heavy duty, both the nylon shell and mesh windows. The shoulder strap makes for a lighter load in addition to the hand straps. Apparently this company's product is the only one that is automatically allowed through security as well (though haven't tested that yet). All in all, a great product, especially for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "NP",
      "helpful_votes": 0,
      "publication_date": 20170815
    },
    {
      "title": "Medium works great on Southwest Airlines",
      "text": "I took a chance and bought the medium size for my savannah cat even though it says that the small size is the only one that fits for Southwest. After looking at the measurements from Sherpa and Southwest I decided to try it. The flight I flew on was over half empty (50 people) so I had the row to myself. The pictures are of the medium carrier under the middle seat. It fit perfectly under there without pushing the top down and my cat had plenty of room in there and he is a large cat. I will definitely continue to use this on Southwest flights.",
      "rating": 5.0,
      "verified": true,
      "author": "Caleb",
      "helpful_votes": 7,
      "publication_date": 20151203
    },
    {
      "title": "This doesn't appear to be an original Sherpa product as ...",
      "text": "This doesn't appear to be an original Sherpa product as 3 out of the 4 'Sherpa' labels are spelt 'Sherra'! How disappointing!",
      "rating": 3.0,
      "verified": true,
      "author": "salgadoberry",
      "helpful_votes": 5,
      "publication_date": 20180208
    },
    {
      "title": "Just what I was looking for!",
      "text": "I ordered the medium in plum. The color is very pretty! It seems sturdy and is certified as airplane approved for under the seat. It is slightly smaller than I imagined, but should work fine for short trips. I have a 10# cat. She'll be cozy in there, but it works.",
      "rating": 5.0,
      "verified": true,
      "author": "New England Reader",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Didn't even receive Sherpa brand bag - Cheap off brand from China instead.",
      "text": "First off I didn't even receive a Sherpa brand carrier, it was some off brand that I have never heard of from China. Secondly, my puppy (6 lbs) was enough to break both of the support bars within the first 3 uses, so now it folds in on itself (and she wasn't thrashing around, she's very good at laying down and staying quiet while in the bag) Not worth it.",
      "rating": 1.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 6,
      "publication_date": 20171012
    },
    {
      "title": "They Work!",
      "text": "I don't like plastic crates for cats. Mine literally buck them apart. I must augment them with duck tape. Faced with either losing my cats or doing something different, I purchased the Sherpa carriers - nine of them, for my nine cats. The battle for loading was made easier by the top load. I took them the vet, then, two days later, drove them eight hours to our new home. On a hunch, I decided to unzip the side load, and let them use the carriers as a security box while they adapted to the new home. They are still sleeping in them. I can't brag enough about the product.",
      "rating": 5.0,
      "verified": true,
      "author": "SJ Reidhead",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "My dog was comfortable the whole trip",
      "text": "My dog is a 15-yr old 10-lb YorkieChi who flew on his first domestic air travel (within US, 4+ hr direct flight). He was comfortable the whole time. He was able to see us; especially during really bad turbulence so it was important for him to see us and I was place me hand on him for comfort. Bag is sturdy to carry like any other piece of luggage. Also, it was very discreet; fellow travelers did not even realize we were traveling w/a dog. Recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "OM",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Perfect 😻",
      "text": "This is the 4th Sherpa pet carrier I’ve bought, because I have many small animals, and because it’s very sturdy and functional. It has 2 openings (one in front and one on top), so it’s easy to get my pet out of it - at the vet. It’s very durable - my pets can’t shred it like they’ve done with other brands. It’s easy to carry- 2 handles and a padded shoulder strap. The best feature is how I can strap it in the car with the seat belt feature. There aren’t many carriers like it, and I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Saint",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "You don’t get what you pay for",
      "text": "I bought a Sherpa pet carrier a year ago and absolutely love it, it’s nice quality and it fits under the seat of the plane so I decided to order another carrier for my other dog. Instead of receiving the Sherpa Deluxe Pet Carrier that I paid $60 for, they sent me the $27 AmazonBasics carrier. There is a large gap in quality to the carrier compared to a Sherpa carrier I already own. I’m unable to return the cheap carrier as my plane leaves in 24 hours and I won’t be able to get a replacement before then so I’m out the $30 difference and my dog will have to suffer through the plane ride in a smaller bag:(",
      "rating": 1.0,
      "verified": true,
      "author": "Siri",
      "helpful_votes": 3,
      "publication_date": 20171219
    },
    {
      "title": "Sherpa Travel Original Deluxe Airline Carrier",
      "text": "We loved it . We bought it to bring our new puppy home that we had adopted. He was 8 pounds. We bought a Large. It fit him great with a pee pee pad, blanket and a toy with bowl for water . It is so easy to carry. We bought the purple one. They can see out the bottom. Very light weight . Great shoulder strap. Cheaper than the airlines. It fit under my seat on both flights. I would recommend this one to anyone. It is very sturdy too. Made very well. Love the color.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Tartaglia",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "My favorite pet carrier",
      "text": "This is my second purchase of this pet carrier. It's sturdy enough to support my cats (~13 pounds each) and still supple enough that they get a little comfort from being held under stress (such as the vet office). I especially like being able to load/unload them via the top or front. There's a pouch on one side that is nice to tuck a little toy into; at the vet's office I like to stash any paperwork or medicines they hand me in the pouch so I can concentrate on safely carrying my cat out.",
      "rating": 5.0,
      "verified": true,
      "author": "Monica Leone",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Flew American and worked great !!",
      "text": "I have a russel terrier and he is roughly 20 inches long. He's about 9 lbs as well. I flew American and I liked flying with them because they don't require a health certificate for your pet. It was $125 for him to fly with me. I flew the red eye to make it easier for him and that helped. He pretty much slept the entire time. I also had a sedative from my vet which i know is controversial but he did just fine. I did experience having very little leg room for myself, but small price to pay for his comfort",
      "rating": 5.0,
      "verified": true,
      "author": "Addison",
      "helpful_votes": 2,
      "publication_date": 20161124
    },
    {
      "title": "Buy a bigger size than the recommendation",
      "text": "First, I'd recommend ordering a size larger than what's recommended in the description. I ordered a small for a shih tzu puppy quite a bit lighter and smaller than recommended, but I had to exchange for a medium. Second, I'm wondering if this is a knock-off. The brand is \"Sherpa\", yet this plum bag says \"Sherra\" on two of the tags. When I exchanged for the medium in a different listing, all tags correctly read \"Sherpa\". I questioned the product, but, as always, Amazon had stellar customer service.",
      "rating": 3.0,
      "verified": true,
      "author": "Michele R",
      "helpful_votes": 4,
      "publication_date": 20170714
    },
    {
      "title": "Great Carrier",
      "text": "We got the purple and the color is great. I love the softness of the liner, and the cat actually doesn't mind going in it. I was worried about claws getting through the mesh but this hasn't been an issue and it is great that it folds up flat. We bought a medium for our kitten but it was smaller than I was expecting, we may need a large for a full sized cat.",
      "rating": 5.0,
      "verified": true,
      "author": "KatyDidlettes",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "The large fit just fine underneath the seats and no questions asked by the ...",
      "text": "I took my 20lb Cairn Terrier on both Delta and Southwest in the last few weeks. The large fit just fine underneath the seats and no questions asked by the ticket agents or flight attendants. The bottom has a reinforced floor under the Sherpa cover, the zippers and mesh were strong, and the back end of the bag collapses to help go under the seat while allowing ample room for your dog to change positions if so inclined. This was a fantastic purchase and could not have been more pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "lynn rosene",
      "helpful_votes": 4,
      "publication_date": 20170223
    },
    {
      "title": "took a while to find the best one to bring on the plane",
      "text": "took a while to find the best one to bring on the plane. this was it...my dog is a 15 pound chihuahua mix and I purchased the Large. He hates being in any types of crates and I got him used to this before actually going on the plane. He still managed to chew the mesh one day when I left him alone in the carrier for 15 minutes, but all I had to do was purchase some quality screen material at the hardware store and sew it in. worked great with American Airlines...no issues",
      "rating": 5.0,
      "verified": true,
      "author": "Kirstin",
      "helpful_votes": 2,
      "publication_date": 20170710
    },
    {
      "title": "Great so far!",
      "text": "My little girl's bag arrived today, she seems to really like it so far! She can stand up, and turn around inside the medium size with no problem. It looked too small at first, but she's a snuggler, and likes to curl up when she sleeps. We will see how the plane trip goes.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill Friend",
      "helpful_votes": 33,
      "publication_date": 20150121
    }
  ],
  "product_meta": {
    "title": "Sherpa Travel Original Deluxe Airline Approved Pet Carrier",
    "description": "Size:Medium| Color:Delta BlackTravel in comfort and style with Sherpa Delta Carrier. Perfect for traveling by plane or car, for a trip or just to the vet. The official pet carrier of Delta Airlines, the Sherpa Delta Carrier meets all flight requirements and ensures that your pet flies safely and securely under the seat in front of you. Patented spring wire frame allows the rear end of the carrier to be pushed down several inches to conform to under-seat requirements. The carrier has mesh panels for ventilation, roll down privacy flaps, locking zippers to prevent accidental escapes, includes a seat belt security strap which doubles as a luggage strap, and a Delta luggage tag. Top and side entry options make it much easier to comfortably load pets in the carrier. A large side zippered pocket can hold your important pet travel documents and anything else your pet may need. The no-slip shoulder strap is adjustable and features a padded support for comfort. A soft, cozy, removable, and machine-washable faux lambskin liner is included. Sherpa replacement liners are also available and sold separately. Approved for use on most major airlines and included in Sherpa's Guaranteed On Board program. Available in Black and size Medium only. Sherpa Delta Carrier measures 18” L x 11” W x 10.5” H, for pets up to 16 pounds.\n\nHow to Find the Best Fit:\n\nSelect the carrier size based on your pet's measurements below and then by your pet’s weight, making sure not to exceed the maximum weight limits. Note: the carrier is designed for pets lying down, so your pet may not be able to stand.\n\nSmall Carrier: Fits pets up to 13\" in length x 7.5\" in height and up to 8 pounds\nMedium Carrier: Fits pets up to 16\" in length x 10\" in height and up to 16 pounds\nLarge Carrier: Fits pets up to 18\" in length x 11\" in height and up to 22 pounds\n\nHow to Measure Your Pet:\n\nFor pet’s length, start at the front of the chest and measure to the end of the pet's rear. For height, measure from the floor to the top of the back.\n\nAMAZON.COM\n\n\nSHERPA® DELTA® DELUXE PET CARRIER, MEDIUM: FOR PETS UP TO 16 POUNDS\n\nGET THE RIGHT FIT\nThe Sherpa® Delta® Deluxe is 18 inches long and 10.5 inches high.\n\n \n\nGUARANTEED ON BOARD ®\nFlying with a pet is stressful. Every airline has a specific set of rules and regulations and pet parents are often not properly prepared or aware of the requirements. As avid pet lovers and enthusiasts, Sherpa® wants to ensure that pets and pet parents travel comfortably and with peace of mind. Guaranteed On Board ® is the only program that guarantees our carriers are in-line with each participating airline’s rules and regulations and provides all the information needed for an easy, hassle-free trip. Simply go to www.flygob.com, select the participating airline, enter the carrier info, pet info and flight info and print the GOB form. Should you be denied boarding due to your Sherpa carrier, Quaker Pet Group will reimburse you for the cost of your flight and pet fee--Guaranteed!\n\nOriginal Deluxe Element Duffle Element Carrier Delta Deluxe AA Carrier AA Duffle On Wheels Cat Tote Top Entry YES YES YES YES YES YES YES Side Entry YES YES YES YES YES YES YES YES Hand Carry Straps YES YES YES YES YES YES YES YES Shoulder Strap YES YES YES YES YES YES YES Pull Strap YES Wheels YES Number of Mesh Panels 3 4 3 3 3 3 4 3 Number of Pockets 1 2 1 1 1 1 1 3 Roll-Down Privacy Flaps YES YES YES Seatbelt/Luggage Strap YES YES YES YES YES YES YES Available Sizes Pets up to 8 pounds YES YES YES Pets up to 16 pounds YES YES YES YES YES YES YES Pets up to 20 pounds YES Pets up to 22 pounds YES YES Approved on Most Airlines Small YES YES N/A N/A N/A YES N/A N/A Medium YES N/A YES YES YES YES YES YES Large N/A N/A N/A N/A N/A Guaranteed on Board Small YES YES N/A N/A YES N/A N/A Medium YES YES YES YES YES YES Large N/A N/A N/A N/A \n\"APPROVED FOR USE ON MOST MAJOR AIRLINES\" VS. \"GUARANTEED ON BOARD\"\nApproved for use on Major Airlines means that a carrier:\n\n *  Provides adequate ventilation \n *  Is leak-proof \n *  Safely encloses the pet \n *  Conforms to underseat dimensions \n\nMost pet carriers and all Sherpa® carriers are airline approved, however ONLY Sherpa® carriers are Guaranteed On Board®.\n\nGuaranteed On Board® is the only program that guarantees a Sherpa® carrier meets an airline's specific rules and regulations and will be allowed on board. All small and medium Sherpa® carriers are included in the GOB program.\n\n *  Go to www.flygob.com \n *  Select the participating airline \n *  Enter the flight info, carrier info and pet info \n *  Print and sign the forms and present when boarding \n\nShould the passenger be denied due to the Sherpa® carrier, Quaker Pet Group will reimburse the pet parent for ticket and pet fee--guaranteed!\n\nQUESTIONS TO ASK BEFORE TRAVELING WITH YOUR PET:\n *  Is my pet too old or young to handle the stress of traveling? \n *  Is my pet in poor health? \n *  Is my pet recovering from surgery or a traumatic event? \n *  Is my pet pregnant? \n *  Does my pet get motion sickness? \n\nIf you answer \"yes\" to any of these questions, check with your vet if your pet is suited for transport in its current condition.\n\nPREP YOUR PET:\nBe sure to purchase the correct size of carrier appropriate for the weight of your pet. Using a carrier that is too large could result in motion sickness. Your pet should have enough room to stand up and turn around inside the carrier.\n\nPrior to traveling make sure to allow ample time for your pet to familiarize itself with its carrier. We recommend purchasing a carrier at least a month in advance to allow your pet sufficient time to become accustomed to it.\n\nPut the carrier in an open area so the pet can investigate and get used to its scent and shape. Put one of your pet's toys, treats or blankets inside the carrier to entice your pet to enter it willingly. Do not force your pet inside the carrier. Take your pet on short trips in the carrier so they get used to being transported in it. If your pet does not like being inside, or tries to escape from the carrier, we recommend further training prior to travel or considering transporting your animal in a hard-sided carrier.\n\nTRAVELING BY PLANE\n *  Always check your airline's rules and regulations prior to flying. Your pet should be securely in the carrier at all times when aboard the aircraft.\n *  Always supervise your pet. NEVER leave your pet unsupervised or unattended in a carrier. Failure to do so can result in damage to the carrier, escape, or injury to your pet.\n *  Never give your pet sedatives or tranquilizers unless prescribed by your vet. If prescribed, be sure to get clear and precise instructions as to the dosage, the frequency of the dosage and any risks involved with sedating your pet. Follow the instructions exactly. Do not increase the dosage at your own discretion as pets can easily be over-medicated, especially when flying, as increased altitude can cause cardiovascular and respiratory problems. \n *  Do not allow your pet to travel with a choke, pinch or training collar. Cats should travel with a collar that has a quick release or break-away feature. \n *  Leads should not be used when your pet is enclosed in the carrier. \n *  Be sure your pet's collar is secure and clearly displays proof of current vaccinations, your name, address and contact info. \n\nTRAVEL TIPS FOR YOU AND YOUR PET\n 1.   Book reservations for you and your pet early. Most airlines restrict the number of pets allowed on board each flight.\n 2.  Complete and print your Guaranteed on Board® forms, or call your airline for its specific requirements. \n 3.  Research your destination city’s pet rules & regulations, along with those of where you will be staying. \n 4.  Prep your pet for travel. Be sure it has ample time to adjust to its carrier and practice traveling with your pet in the carrier on short trips prior to the big day. \n 5.  Make an appointment with your vet. Acquire a health certificate and ensure your pet is up-to-date with its shots no more than 10 days prior to your departure. \n 6.  Research and create a list of local vets and emergency clinics at your destination. \n 7.  Be sure you have all of your and your pet’s documentation in order. Do you have your pet’s health certificate? Do you have your Guaranteed On Board® forms to show to the gate agent? \n 8.  Have your contact info clearly and securely labeled on both your pet’s carrier and on your pet’s tags. \n 9.  Pack for your pet in advance so you can be sure nothing is forgotten. \n 10. Arrive early on your day of departure and allow ample time for you and your pet to check-in and board your flight. Plan ahead and know various locations at the airport(s) where your pet can relive itself prior to (and between) flying. \n\nTRAVELING BY CAR\n *  Always supervise your pet. NEVER leave your pet unsupervised or unattended in a carrier. Failure to do so can result in damage to the carrier, escape, or injury to your pet.\n *  Secure the carrier in the backseat of the car only. Do not secure the carrier to the front seat - your pet will be the safest in the back. The seatbelt can be secured through the luggage band located on the rear side panel of the carrier. The shoulder strap can be secured around the headrest if applicable. \n * Never give your pet sedatives or tranquilizers unless prescribed by your vet. If prescribed, be sure to get clear and precise instructions as to the dosage, the frequency of the dosage and any risks involved with sedating your pet. Follow the instructions exactly. Do not increase the dosage at your own discretion as pets can easily be over-medicated. \n *  Do not allow your pet to travel with a choke, pinch or training collar. Cats should travel with a collar that has a quick release or break-away feature. \n *  Leads should not be used when your pet is enclosed in the carrier. \n *  Be sure your pet's collar is secure and clearly displays proof of current vaccinations, your name, address and contact info. \n\n\nThe ideal carrier for the jet-set pet, the Delta® Deluxe features top and side entry, a side pocket for storage, roll-down privacy flaps, mesh panels for ventilation, locking zippers, padded hand-carry straps, an adjustable, no-slip shoulder strap, a seatbelt / luggage strap and a Delta luggage tag. Approved for use on most major airlines and included in Sherpa's Guaranteed On Board® program, this carrier is intended for dogs and cats up to 16 pounds and is 18 inches long, 10.5 inches high, and 11 inches wide. The faux lambskin liner is machine washable and the carrier is to be spot cleaned only. All Sherpa carriers are protected by a one year limited warranty against manufacturer defects.",
    "rating": 4.6,
    "feature_bullets": [
      "Perfect for traveling in style and comfort by plane or car, for an adventure or just a trip to the vet",
      "Patented spring wire frame allows the rear end of the carrier to be pushed down several inches to conform to under-seat requirements",
      "Mesh windows for ventilation, roll down flaps for privacy, top and side entry with locking zippers for safety, padded adjustable, no-slip carrying strap, seat belt/luggage strap, machine-washable faux lambskin liner, Delta luggage tag",
      "Side pocket for convenient storage of treats, leash, bags, or anything else your furry friend might need on the go",
      "Approved for use on most airlines and included in Sherpa’s Guaranteed on Board program.Carrier is intended for safe and comfortable travel; the pet will not have excess room to move around",
      "Size medium is for pets up to 16\" L x 10\" H and up to 16 lbs",
      "Carrier measures 18” L x 11” W x 10.5” H",
      "Do NOT select the carrier size based on weight only. Choose the carrier size based on your pet’s measurements first, then make sure not to exceed the maximum weight limit."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "18 x 11 x 10.5 inches; 3.2 Pounds",
      "Item model number": "11721",
      "Date First Available": "September 30, 2004",
      "Manufacturer": "Quaker Pet Group",
      "ASIN": "B000633ZOY",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Carriers & Travel Products",
      "Dogs",
      "Pet Supplies",
      "Carriers",
      "Soft-Sided Carriers"
    ],
    "price": 63.0
  }
}