{
  "website_summaries": [
    {
      "verdict": "A non-latex, budget-priced instrument that is suitable for both veterinary and medical professionals.",
      "pros": [
        "Three bell sizes and two diaphragm sizes",
        "Extremely low price"
      ],
      "cons": [
        "Some complaints of earpiece discomfort",
        "Chestpiece does not include a non-chill ring"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Glad we read the reviews - this really is a good one",
      "text": "Read through a lot of reviews and glad we did. It saved us a lot of money. This really is a great Stethoscope for the price. We bought it for our pets - as recommended by our vet - since we have one pet with a heart murmur. So this works great for us.",
      "rating": 5.0,
      "verified": true,
      "author": "herizondetails",
      "helpful_votes": 8,
      "publication_date": 20190702
    },
    {
      "title": "Uncomfortable ear tips",
      "text": "This particular stethoscope is not bad sound quality wise but the ear tips are terrible. All three of them that come with the stethoscope are extremely uncomfortable and hurt after a few uses. If it came with more comfortable ear tips I would give it a better score. Omron needs to take lessons from MDF and Littmann.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20190321
    },
    {
      "title": "PERFECT STETHOSCOPE WITH GREAT REVIEWS",
      "text": "Outstanding Quality & Value, Wife is Going to School for Nursing, This is a Required Item, Looked online and Checked All the Reviews. This came up as One of the BEST, and for the Price, it was a No Brainer. Under $20, and does the same exact thing as the $300-$400 Ones. Do yourself a Favor, I spent 4 Hours doing all the Research to find the BEST Stethoscope for my Wife, and this Came Up as One of them. I just saved you 4 hours of your Life by doing the Research for You. YOUR WELCOME........Lol Buy One, You won’t Regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chicagobred1",
      "helpful_votes": 5,
      "publication_date": 20191119
    },
    {
      "title": "Same quality as urgent care clinic stethoscope",
      "text": "gifted this to my husband when he completed his Medical Assistant/X-ray Tech license, and he used it constantly at work with no issues. Eventually had to replace after his was misplaced, and the replacement stethoscope that he received from his Urgent Care clinic was the same grade and quality as this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Claudia Cardenas",
      "helpful_votes": 8,
      "publication_date": 20180706
    },
    {
      "title": "Heavy but great sound quality",
      "text": "This is honestly a great stethoscope. The sound quality is great and works as good as the most expensive ones. The only reason my rating isn't 5 stars is because its heavier than most. I can't keep it around my neck all day because it causes me a lot of neck pain. Idk if it's just me or if it really is the weight of this thing. I want to find a clip that'll clip it on to my scrubs instead but it would be more convenient to wear it around my neck.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20200115
    },
    {
      "title": "Good value",
      "text": "I bought this for myself and my 3 year old who was born with Tetralogy of fallot. He sees a cardiologist and likes when they listen to his heart. We bought this to make him more comfortable with all the heart checkups. I am not a nurse or doctor, but I can clearly hear his heart murmur with the stethoscope.",
      "rating": 5.0,
      "verified": true,
      "author": "SAMI",
      "helpful_votes": 11,
      "publication_date": 20170608
    },
    {
      "title": "Better than a toy - heft to it",
      "text": "I could hear my heart and lung breaths. There is a kit where you can replace the head with other listening shapes for different lower sounds for heart for example. I gave 4 stars as it's better than a toy and comes with extra options for an acceptable price. It is taught on the ears but instructions say adjustable but I don't want to stretch it in case go to far.",
      "rating": 4.0,
      "verified": true,
      "author": "RAV",
      "helpful_votes": 2,
      "publication_date": 20180926
    },
    {
      "title": "Not comfortable for the ears, but OK.",
      "text": "Work ok for listening to a dogs heart murmur. None of the ear pads are very comfortable. You can't adjust the stethoscope to make the ear pieces fit better. I certainly don't leave them on very long.",
      "rating": 3.0,
      "verified": true,
      "author": "celticpm",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Not a good product",
      "text": "I am an 'almost' equine veterinarian and have treated many of my own colics. I use a stethoscope a lot and it has to be easy to hear immediately. This one is not. I could barely hear anything with it. I bought it because of the reviews, but I disagree with those reviews. I did not like it and am stuck with it.",
      "rating": 2.0,
      "verified": true,
      "author": "Anniepie",
      "helpful_votes": 3,
      "publication_date": 20170818
    },
    {
      "title": "Sound and overall is pretty good, but the earpiece does not make me feel comfortable.",
      "text": "It arrived very quickly the next time of my payment. The sound and overall are pretty good, but the earpiece does not make me feel comfortable. It is hard, it makes my ear hurt. This is the only thing I dislike, so I will be returning it soon. If you are not sensitive with that, go for it.",
      "rating": 4.0,
      "verified": true,
      "author": "Tay",
      "helpful_votes": 2,
      "publication_date": 20190921
    },
    {
      "title": "Wife loves it!",
      "text": "High quality. My wife works for the American Red Cross and lost the one she was provided by the company. I upgraded her to this one and it is a hit. She said it works much better than the one before and since it is different it stands out as superior in looks and feel. She is very happy with this purchase. The brand \"Omron\" is the same as the less expensive single head version the ARC gave her.",
      "rating": 5.0,
      "verified": true,
      "author": "MM",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Do yourself a favor and do NOT buy these scopes",
      "text": "First off, scopes came in a damaged box. The earpieces on this sope are incredibly tight and small. The sound quality they provide can be described as listening sounds through a paper roll. Sadly, I can't return this scope because they don't accept returns. Amazon should not be selling items of this level of quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark Anthony",
      "helpful_votes": 2,
      "publication_date": 20190113
    },
    {
      "title": "useful standard scope",
      "text": "Sprague Rappaport has been the gold standard for many years, the gold plate on the one I got at graduation from medical school nearly 50 years ago wore off and the rubber was cracking, so I suppose it was time to replace. This one is not gold plated, but otherwise identical... comfortable and like an old shoe it does it's job.",
      "rating": 5.0,
      "verified": true,
      "author": "a cameron",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Painful",
      "text": "Not sure how this got so many great reviews. This thing hurts my ears so bad, even if I tried to switch the different ear pieces. The pain detracts from the functionality, and I find it hard to listen to the sounds well.",
      "rating": 3.0,
      "verified": true,
      "author": "pikapie55",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Clarity",
      "text": "By far, this is the best stethoscope that I have found, and when I say that I am comparing this one to every other stethoscope I have owned since I started practicing over 12 years ago. Initially I fell for the concept that spending more on a stethoscope meant I was getting the best available. That changed when I got my first Omron Sprague Rappaport Stethoscope. After experiencing the clarity I get when I use mine to assess a patient, I can tell you that I will never use any other stethoscope.",
      "rating": 5.0,
      "verified": true,
      "author": "Ritchie Drummond",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Heavy and Unwieldy",
      "text": "Sure, this thing may be cheaper than most of the other stethoscopes you see, but it's heavy and almost unwieldy. The double tubing adds a lot of weight and is more of a pain to maneuver than a nicer stethoscope.",
      "rating": 4.0,
      "verified": true,
      "author": "Blake Roche",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "the best sound - loud and clear",
      "text": "This is the steth I use the most. The sound quality is great and the amplification is strong. I can hear everything loud and clear. I've had it for a few years now and haven't had any issues with it. It is one of the heavier stethoscopes and I like that.",
      "rating": 5.0,
      "verified": true,
      "author": "eaecrd",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Great quality for the price.",
      "text": "Great quality for the price, tubes do rub together but that can be fixed with black gorilla tape. Comes with bells for adult, child, and infant. Extra ear tips for a custom fit. Highly reccomend if you need a scope but don't want to spend a lot. I'm using this for my medical assistant courses. Does not come with a case so I highly recommend you get a case for it if using it for classes. Will update if it breaks soon.",
      "rating": 4.0,
      "verified": true,
      "author": "Maria Canales",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "prague Rappaport Style Stethoscope gets 5 stars and company  supplying should get 10 stars",
      "text": "I have been using it from the day I received it. I am a nurse and frequently am taking blood pressures. It is a reasonably priced instrument with spare parts. It takes accurate readings and looks good. I am frequently looking for new diaphragm or ear pieces as I have a tendency to loose them. I work at health and Wellness Fair and the stethoscopes are always taking a beating. This type of scope is great whether taking blood pressure, listening to breath and heart sounds. Also, can use with pediatric patients. Unit arrived quickly and just what I needed. Lost my previous stethoscope. Thank you for a unit that is accurate and reasonable.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle marie",
      "helpful_votes": 0,
      "publication_date": 20130525
    },
    {
      "title": "Well made!!",
      "text": "Better quality than i was expecting. Glad i purchased this. Asthma in the family. Needed for keeping track of any wheezing. Would definitely buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "E.R.",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "It does the job fine for what I need",
      "text": "I do home health care and have to check every patient's vitals for which this stethoscope seems to be sufficient. Unless one is extremely proficient in detecting anomalous lung & heart sounds, I wouldn't rely on it for more than BP checks and basic chest & neck sounds. It does the job fine for what I need.",
      "rating": 4.0,
      "verified": true,
      "author": "b.k.",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "looks just like picture",
      "text": "great color just as it looked I hear very well with the stethoscope. holding up well others have seen my stethoscope wanted to know where I bought it and have also ordered",
      "rating": 5.0,
      "verified": true,
      "author": "Terri",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Good for their price",
      "text": "That doesn't mean they're good though, just good for the price. The standard ear tips are hard plastic and rough on the ears if listening to breath sounds for too long, or anything for too long at that rate. The additional ear tips provided in the package aren't any better. Honestly, I would just fork out the extra $30/$40 and just pick the Littman Classic. I just picked these up because I wasn't sure how my paramedic school was going to go, and I just needed a quick replacement for the time being. I'm definitely going back, and I'm definitely going to buy a Littman Classic before then because this just doesn't cut it.",
      "rating": 3.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 2,
      "publication_date": 20130110
    },
    {
      "title": "Great performance for the price!",
      "text": "I used to work as a nurse assistant, and my spouse recently became certified. This was the perfect gift, and I could hardly wait for him to try it. This performs well, the sound is clear, and it is comfortable and durable, even compared to much more expensive stethoscopes. While I'm sure there are better stethoscopes on the market, we are certainly not disappointed with this, especially considering the reasonable price!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Storly",
      "helpful_votes": 0,
      "publication_date": 20160225
    },
    {
      "title": "Good stethoscope for the price",
      "text": "I’ve had this for 4 years now and it’s still working really well. The sound quality is also very clear; it’s very easy to pick up sounds. One thing I do not like is that it gets tangled very easily due to the double tube. Otherwise, it’s good value for the quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "it absolutely sucks",
      "text": "its heavy, its hard on the ears, its very low, i can probably hear the beat with my own ears better such a waste. its cheap, yes - but its throwing ur money in the garbage",
      "rating": 2.0,
      "verified": true,
      "author": "Florie1002",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "WASTE OF MONEY CANNOT RETURN",
      "text": "You can hear HEARTBEAT better putting your ear up to a person's chest than with this thing. It does not work and you cannot return it. Amazon tells you to contact Omron and Omron tells you to contact Amazon. What a scam they got going here. Supposed to offer replacement product. Nope, I was just given instructions on how to use it. I kept telling them it doesn't work, I cannot hear anything. Think twice before wasting your money on this junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristine",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "This is actually really good! The quality seems really great too",
      "text": "This is actually really good! The quality seems really great too. I was skeptical at first because of the low price, but it proved me wrong. It fits nicely in my ears, tight enough. The sound is good too. Tested it on my mom :). Edit 6/22/16: Used it more often, and it seems that the chest piece keeps getting loose and I have to keep turning it to tighten it back. A bit annoying but usable.",
      "rating": 5.0,
      "verified": true,
      "author": "Sealed With a Kiss J.",
      "helpful_votes": 0,
      "publication_date": 20160317
    },
    {
      "title": "Good sound, lacking in comfort.",
      "text": "These are a bit of hit-and-miss. I have one I bought for my daughter that has a better stem to head seal, thus having better volume and clarity. My blue one has more of an air leak around the stem, but its still decent for blood pressure and simple heart sounds. The earpieces are not nearly as comfortable as even a $15 prestige medical set. The ring that holds the large diapham on mine strips if its tightened too much. Its heavy and unweildy, but it works and has better sound than more expensive scopes that I have purchased.",
      "rating": 4.0,
      "verified": true,
      "author": "TheCADman99",
      "helpful_votes": 0,
      "publication_date": 20130927
    },
    {
      "title": "Great value.",
      "text": "Great price....bought these as they are the same used by our Vet to listen for heart problems with our dog. Have another pair from a 'medical device company' that costs over $100....these are just as good or better acoustics. Save the money and buy these.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Fantastic for the price",
      "text": "This thing is barely a step below the \"Cardiology 3\" which costs 10x more. If you want a high quality stethoscope and aren't making the money a doctor makes, here's your buy!",
      "rating": 5.0,
      "verified": true,
      "author": "T-Dubbs",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Great Value",
      "text": "Wanted to listen to my lungs had double lung transplant What a great product for inexpensive price Hurts my ears not use to using... Very Happy would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "David Powell",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Loud heart beat sound easily heard",
      "text": "Used this to detect irregular heart beat on my little poodle. This picks up dog heart EXCELLENT!!! Read lots of reviews on scopes saying not for dog— feel CONFIDENT- this one IS",
      "rating": 5.0,
      "verified": true,
      "author": "trevor jones",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Good - But Heavy",
      "text": "Recently bought this as I needed an inexpensive scope to use with an aneroid BP cuff at home. It is a very good unit for basic work. It is very heavy compared to more expensive units. As someone else mentioned it is also a bit on the stiff side. Overall though I really don't think you'll find a more high quality unit for the price. In my opinion, you won't find a higher quality unit until you spend at least 50 bucks or more. And if you need a low priced stethoscope for use with a Blood Pressure cuff there is nothing better.",
      "rating": 4.0,
      "verified": true,
      "author": "Bingo",
      "helpful_votes": 2,
      "publication_date": 20110418
    },
    {
      "title": "Great for kids dress up/costume",
      "text": "Purchased this for my goddaughter as part of a 'real' Doc Mc Stuffins dress up costume--I figure why not get her the real deal She apparently plays with it almost daily and was fascinated to listen to her own heart vs mommy and daddy and also their pet cat. I think it's appropriate with supervision for kids older than 5 and a great way to get them excited about medicine and science can't say how good it would actually be in a clinical setting",
      "rating": 4.0,
      "verified": true,
      "author": "Cookie Dr",
      "helpful_votes": 0,
      "publication_date": 20150112
    },
    {
      "title": "Nice and basic . . .  but I'm not a doctor.",
      "text": "Very affordable. Seems to work well. Bought it to listen to my old sick dog's heart and lungs.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Great Device, Bargain Price",
      "text": "Quality stethoscope at a very fair price! I asked an opinion of the stethoscope of several friends that are nurses. They each, independently of each other, said it was a very good device. Well built, excellent sound transmission, professional quality. One nurse commented it was superior to the stethoscope she was supplied at nursing school that had a significantly higher price. A quality instrument at a bargain price.",
      "rating": 5.0,
      "verified": true,
      "author": "Flyboy",
      "helpful_votes": 0,
      "publication_date": 20150620
    },
    {
      "title": "Great Value",
      "text": "Nice and solid, I use it in my large animal practice, and so far so good. Great value for my money.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Downes",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Cheap crap",
      "text": "Doesn’t work cheap material basically only good for kids to play with",
      "rating": 1.0,
      "verified": true,
      "author": "SB",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "As Advertised",
      "text": "It's a Stethoscope. The price was right. The delivery was as requested. That's what I was looking for. Simple.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Zaccaria",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Good sound quality, nice assortment of accessories",
      "text": "I'm a state certified first responder, and only occasionally need to use these devices for taking BP and lung sounds ... So I am not a stethoscope expert ... But for what I bought it for (stocking my personal emergency kit and vehicle go-bags), they exceeded the requirements. The tubes don't feel like they will pull off like some uber-cheap ones I have used, and they pick up faint sounds well ( e.g. ped brachial pulses ). The rubber also doesn't look like it is going to rot. Good assortment of ear plug replacements, etc.",
      "rating": 4.0,
      "verified": true,
      "author": "mini_hakr",
      "helpful_votes": 0,
      "publication_date": 20110708
    },
    {
      "title": "Many pieces missing",
      "text": "This product was supposed to come with a number of accessories: Two plastic diaphragms, two pair of your tips and different bell sizes. None of those were present. It looks like somebody returned the stethoscope - threw it into the ripped box and send it back to the seller. I would not buy this product from this seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Captain Dave",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Great sound!",
      "text": "This stethoscope is ten times better than the one I received for my nursing class. The sound is fantastic. I can hear everything! On my previous stethoscope, the sounds were muffled and sometimes an apical pulse was difficult to hear. With this, sounds are crisp and clear! It also came with second set of ear buds, rubber ones, along with bell covers, diaphragms, and other things. A very good value for the price. I would highly recommend this for students!",
      "rating": 5.0,
      "verified": true,
      "author": "clarinetdan",
      "helpful_votes": 0,
      "publication_date": 20130111
    },
    {
      "title": "but I for to hear my ferrets heartbeat instead which was fun. Now it works with my infant",
      "text": "I bought this to listen for my baby's heartbeat when I was 6 months pregnant and it didn't work for that, but I for to hear my ferrets heartbeat instead which was fun. Now it works with my infant. Includes different size pieces which is nice",
      "rating": 4.0,
      "verified": true,
      "author": "anna",
      "helpful_votes": 2,
      "publication_date": 20160103
    },
    {
      "title": "Great instrument.",
      "text": "Great value for the money. Sturdy, heavy enough to stay in place, light enough to be comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy668",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Multiple attachments for scope",
      "text": "This is a great stethoscope with multiple attachments so you can change the diaphragm (receiving end of the scope). There are both large and small diaphragms that are easily changed out. The scope comes with multiple ear pieces and are also easy to change. However I have tried all of the ear pieces and find that most of them are uncomfortable. But the scope itself works well even though the ear pieces are uncomfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley J Reed",
      "helpful_votes": 0,
      "publication_date": 20130623
    },
    {
      "title": "Great for cheap stethoscope",
      "text": "I have been using this over a month and am very satisfied 'for a cheap stethoscope'. The ear pieces block out noise so well I can't hear anything else except lung/ heart/ bowel sounds. The tubing does not rub together and make noise. Comes with extra pieces to fit you. Only issue is other stethoscopes I've used are more loud compared to this one.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170428
    },
    {
      "title": "Bought it as a fun toy for my girls",
      "text": "Bought it as a fun toy for my girls. Same price as a toy stethoscope and they can actually use this to learn something. The only downfall? My kids think it's funny to talk into it which will probably eventually lead to some sort of hearing damage.",
      "rating": 5.0,
      "verified": true,
      "author": "Briana",
      "helpful_votes": 0,
      "publication_date": 20170606
    },
    {
      "title": "Was ok",
      "text": "Was ok couldn’t hear too well with them kind of heavy",
      "rating": 3.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Works",
      "text": "Still working after buying in 2016. Great entry level scope. I recommend for first and second year med students. You don't need one until after you graduate really.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "I like it",
      "text": "I like this item, but I had never used this item without it being attached to a blood pressure cuff and I was unable to hear my pulse and it didn't come with instructions...so wasn't quite sure what to do....I took it to my next doctors appoinment and they instructed me on how to use it. Now that I know how to use it I am very happy and satisfied....also it doesn't come with the cuff so you will need to purchase it, but this is doctor quality equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "whimpy12",
      "helpful_votes": 0,
      "publication_date": 20130831
    },
    {
      "title": "I was impressed with the quality of the stethoscope",
      "text": "I was pleasantly surprised with the quality, and it was everything I was expecting and more!",
      "rating": 5.0,
      "verified": true,
      "author": "RL",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Medical profession quality! And great quality for the money!",
      "text": "A surprisingly nice stethoscope for the money! Great to have on hand for everything from pool leak plumbing detection, horse gut sounds (when sick) and finding engine knocks (touch a screwdriver to the diaphragm). I was even able to prove that I am not 'heartless' like the wife says!",
      "rating": 5.0,
      "verified": true,
      "author": "NancyP",
      "helpful_votes": 0,
      "publication_date": 20160408
    },
    {
      "title": "Dual mode works fine",
      "text": "Have visiting nurses come to the house five times a week PA, Therapist they were impressed. Dual mode works fine",
      "rating": 5.0,
      "verified": true,
      "author": "Bear3000",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "this was exactly like my old one",
      "text": "i lost the earpieces to my old stethoscope, so i ordered this one. this was exactly like my old one, and it also came with a selection of different earpieces, so i added one set to my old one and another for this, so now i have two :) cheap and simple but works like a charm! i can hear just fine with them on the ambulance.",
      "rating": 5.0,
      "verified": true,
      "author": "blackbearcabin",
      "helpful_votes": 0,
      "publication_date": 20150727
    },
    {
      "title": "Just got as a prop, but tried it out ...",
      "text": "Just got as a prop, but tried it out and works really well. First time i heard my own heartbeat compared to when i was in grade school and just pretend i heard it but couldn't.",
      "rating": 5.0,
      "verified": true,
      "author": "Kei",
      "helpful_votes": 0,
      "publication_date": 20170806
    },
    {
      "title": "Great stethoscope at an affordable price!",
      "text": "Use it at home to observe my father's breathing. Excellent quality at an affordable price. I dock one star because of the discomfort I feel when I put them in my ears. Other than that, very pleased with the functionality!",
      "rating": 4.0,
      "verified": true,
      "author": "Willie",
      "helpful_votes": 0,
      "publication_date": 20160606
    },
    {
      "title": "Astonishing for the price",
      "text": "Granted, Omron has a terrific reputation for their products, but this represents a truly astonishing value. Along with the low price, you get extremely robust construction and performance quality here, along with a large assortment of useful \"bells and whistles\" (actually bells and adapters for different purposes). The highest recommendation.",
      "rating": 5.0,
      "verified": true,
      "author": "NCBreeze",
      "helpful_votes": 0,
      "publication_date": 20140316
    },
    {
      "title": "A Very Disappointing Purchase",
      "text": "Although very sturdily constructed, this thing just doesn't work properly. I can't hear very much through it at all. I called the company, and they offered no troubleshooting help whatsoever. I'm returning it. And yes, everybody who complains about the earpieces being uncomfortable are correct. This was a very disappointing purchase",
      "rating": 1.0,
      "verified": true,
      "author": "RNArizona",
      "helpful_votes": 6,
      "publication_date": 20150523
    },
    {
      "title": "Great item",
      "text": "It's a great stethoscope for its price. Does what its supposed to do. Lightweight, easy to carry around neck and its loud",
      "rating": 5.0,
      "verified": true,
      "author": "Ricky",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Keep coming back",
      "text": "So I've tried all kinds of different stethoscopes in my 8 years as a emt and I always come back to this design. I'm now in paramedic school and there are plenty of people in my class with high price littmans and this scope has done just as good a job for me, also great build quality for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Stebe",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "A good stethoscope for school use.",
      "text": "Stethoscopes grow legs frequently and walk off. This is a great stethoscope for a student. It is fairly inexspensive so if lost, it can be replaced quick and cheap. This model does not come with the soft ear buds that I like. And the sound quality compared to a Litman is lacking. That is the reason for the 3 stars. If you are in school and don't want soft ear buds (and you will) this is for you.",
      "rating": 3.0,
      "verified": true,
      "author": "Mad_Dog",
      "helpful_votes": 0,
      "publication_date": 20120904
    },
    {
      "title": "Quality item at a great price",
      "text": "Having never purchased a stethoscope before I was pleased with how sensitive it is when listening to the heart and lungs. I don’t need a professional model for my use. I would recommend this item! It’s nice that it has replacement parts should damage occur. Priced great and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Inquisitive Seeker",
      "helpful_votes": 0,
      "publication_date": 20150418
    },
    {
      "title": "Good sound",
      "text": "Easy to hear out of, a bit uncomfortable in the ears. However, for the price its great!",
      "rating": 5.0,
      "verified": true,
      "author": "Fabian Aguilar",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "The instruction booklet said there were add on pieces to listen to soft sounds like this, but they weren't included in order",
      "text": "I ordered this to be able to listen to my babes heart beat in utero. The instruction booklet said there were add on pieces to listen to soft sounds like this, but they weren't included in order. Also, the adult ear pieces were too big for me, so I switch to the medium size and they are extremely uncomfortable (hard plastic). Couldn't image wearing them for more than half a minute at a time.",
      "rating": 2.0,
      "verified": true,
      "author": "ktina",
      "helpful_votes": 0,
      "publication_date": 20150427
    },
    {
      "title": "It's fine for blood pressure",
      "text": "Works fairly well for a cheap Stethoscope when taking blood pressure. But be warned on people with bigger arms or heavier set body's it pretty hard to hear the systolic and dystolic if you can at all.",
      "rating": 3.0,
      "verified": true,
      "author": "D.R.A.R.",
      "helpful_votes": 0,
      "publication_date": 20170406
    },
    {
      "title": "Cool!",
      "text": "I wanted to purchase a kids model of stethoscope for my grandson for Xmas. I read many complaints of ear pain on the one model sold on Amazon. So I spent a few more dollars on this full size version. It's great. He loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie F",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Great quality!",
      "text": "Shipping was very quick. I am new to stethoscopes but for school they provided a \"kit\" and I couldn't hear well when checking blood pressures. I read the reviews for this one and the price was right. i just tested it out and I can hear so so so much clearer. Wow what a difference!! The ear pieces hurt my ears but it came with extras, I need to try out. Very happy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Katy",
      "helpful_votes": 0,
      "publication_date": 20160226
    },
    {
      "title": "good cheap stethoscope for checking on murmurs",
      "text": "good cheap stethoscope for checking on murmurs. Just google what you should be listening for and where. It's easy to get caught up on a noise in the wrong spot and cause a panic.",
      "rating": 4.0,
      "verified": true,
      "author": "David Cianchetta",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "Very nice stethoscope.",
      "text": "Nicely constructed and a great value for the price. Overall I am very happy with this stethoscope.",
      "rating": 5.0,
      "verified": true,
      "author": "K9 Cop",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Exactly what i wanted",
      "text": "I'm kinda the \"your cat is pregnant\" person in town so I'm carrying this around to do little wellness checkups on cats. Works well on mine so I'm pleased so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "1 year in service and no problems",
      "text": "Honestly the only problem I have with this stethoscope is that I'm always afraid I'll lose it because everyone's scope looks like this one. I haven't had any problems with it breaking or not being able to get a pressure or breath sounds. Maybe you need to pay ten times as much for the littman if you're looking for heart murmurs, but I'm just an EMT and this is good enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Collins",
      "helpful_votes": 0,
      "publication_date": 20121227
    },
    {
      "title": "for holloween",
      "text": "I bought this to complete a halloween costume. The price was excellent. At the halloween party a girl walk up to me and asked if it was real. She told me she was starting nursing school and was looking for an inexpensive stethoscope. After the party I gave it to her and she has told me that it is perfect for school but she will buy a better model when she graduates.",
      "rating": 3.0,
      "verified": true,
      "author": "John Young",
      "helpful_votes": 0,
      "publication_date": 20130712
    },
    {
      "title": "decent quality scope",
      "text": "A pretty good quality stethoscope. I brought it to the doctor's office the other day to prove that I could take my own blood pressure manually, and the nurse pointed out how it was better than the one the office furnished hers... I don't like the ear pieces though. It came with a couple, but all were too hard too small.",
      "rating": 4.0,
      "verified": true,
      "author": "B-row",
      "helpful_votes": 0,
      "publication_date": 20150119
    },
    {
      "title": "this stethoscope works great.",
      "text": "I'm a mom who likes to know what's happening with the kids when they're sick. This enables me to listen to their lungs if they have a cough that hangs on for awhile. I can't speak for an experts opinion, but for my purpose and for the price, this stethoscope works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Donaldson",
      "helpful_votes": 0,
      "publication_date": 20150104
    },
    {
      "title": "it works and sounds perfectly fine. The sound is okay",
      "text": "I needed a backup stethoscope for one of my jobs. On the bright side, it works and sounds perfectly fine. The sound is okay, not nearly as good as my littmann. The bell part is a bit loose and has twisted itself off several times. For the price, it's fine. If you need a cheap one or a back up stethoscope I would suggest it. If you need a primary stethoscope, I would not purchase this.",
      "rating": 3.0,
      "verified": true,
      "author": "Kalley White",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "I needed one of these for medical school and wanted ...",
      "text": "I needed one of these for medical school and wanted something that wouldn't break the bank, so I sort of lucked out in finding this. It's really high quality and stands up well to a lot of use, but it also isn't as expensive as some of the other options out there. Everyone at my school loves it, too.",
      "rating": 5.0,
      "verified": true,
      "author": "LC",
      "helpful_votes": 0,
      "publication_date": 20141216
    },
    {
      "title": "Omron Sprague Rappaport Stethoscope really is a damn good one and a best buy. It really works great!",
      "text": "I bought this to listen to my own heart and such. I am not a doctor nor RN or anything in the medical profession but I know a good product when I see one and this Omron is a great buy compared to all the more expensive ones out there. It just works and works great. I recommend it for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "Not reliable",
      "text": "Ive had thing for about 2 months and one of the sides already blew out. This product is not too reliable.",
      "rating": 1.0,
      "verified": true,
      "author": "Zulema Ruiz",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Omron Stethoscope",
      "text": "Kinda tight on the ear holes...have to listen very closely...maybe it's my ears! They do work, I don't think for professional use...",
      "rating": 3.0,
      "verified": true,
      "author": "Grandma Judy",
      "helpful_votes": 0,
      "publication_date": 20170506
    },
    {
      "title": "Tight",
      "text": "I love it but only one issue: it hurts a bit so i can't keep it in my ears a minute. I need to loosen the metal centerpiece but not sure if i can do it without bending it too much. I have left it as is. There are several attachments as described in the ad which are extras for me. As far as quality goes i guess it is very good (i am not a nurse or doctor).",
      "rating": 4.0,
      "verified": true,
      "author": "moon510",
      "helpful_votes": 0,
      "publication_date": 20131124
    },
    {
      "title": "Waiting For My Heartbeat",
      "text": "Never seem to give me the sounds clearly or loud enough. Might take it to my doc and see what they say. Hard to image there is much Im not doing correctly.",
      "rating": 2.0,
      "verified": true,
      "author": "R. S. Hazzon",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "Great Beginner Stethoscope",
      "text": "I bought this for nursing school to use until I could afford to buy the Littmann II they require us to have. This one is actually really great. It has a bell for both peds and adults and the double tube makes it really easy to hear. I'm really impressed with how this one sounds. I'm going to hang on to it for sure. I really thought this would be a piece of crap that I couldn't hear anything on but I hear as well out of it as the expensive ones. Maybe better, due to the double tubes. My nursing instructor commented today on how well made it is and how great it works.",
      "rating": 5.0,
      "verified": true,
      "author": "Anna H.",
      "helpful_votes": 0,
      "publication_date": 20130918
    },
    {
      "title": "Five Stars",
      "text": "this one has the double barrel which means you can use it on adults and kids",
      "rating": 5.0,
      "verified": true,
      "author": "Elise Atwood-youngstrom",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "It is also not priced like one. As a surgeon",
      "text": "For the money, you cannot go wrong with one of these. No, it's not a Master Cardiologist. It is also not priced like one. As a surgeon, I find these quite adequate.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr.Hess",
      "helpful_votes": 0,
      "publication_date": 20170328
    },
    {
      "title": "excellent sound transmission",
      "text": "This is a big improvement on my 50 year old Sprague Rappaport stethoscope!",
      "rating": 5.0,
      "verified": true,
      "author": "fotoguy",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Excellent for breath and cardiac sounds. Has some weight to it",
      "text": "Rt student here. Its great for clinicals and sturdy . Just a bit heavy and adds on to the preexisting shoulder pain i have :) but other than that i have no trouble deciphering different breath sounds A+ cheap steal !",
      "rating": 5.0,
      "verified": true,
      "author": "Faryal",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Nice and better than expected!",
      "text": "I purchased the Omron Sprague Rappaport Stethoscope, in Black to use for our Bee Removal Business to listen and determine where Bees are located inside of walls. It works better than I expected for the price I paid! Probably going to buy a second one just have on stand by because of the price!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Moody",
      "helpful_votes": 0,
      "publication_date": 20140423
    },
    {
      "title": "Good quality",
      "text": "Very cool, purchased when I was 38 weeks pregnant because my baby was flipping around so much. I could use this to get a general idea of where her head was. It had to be completely silent in the room to hear the baby's heartbeat but I definitely could if I got it in the right spot.",
      "rating": 4.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20151026
    },
    {
      "title": "Works great!",
      "text": "Thankful I was able to listen to my tribe lungs as they battled RSV. I was able to catch the wheeze in my sons breathing and take him back to the doctor to get him on antibiotics before it turned into pneumonia. Works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Cory Kemak",
      "helpful_votes": 0,
      "publication_date": 20160222
    },
    {
      "title": "Good product at a good price!",
      "text": "I needed a stethescope for a project I'm working on and of course thought of Amazon that has everything. I was surprised at the quality for the low price. At first I didn't think it worked and realized I just didn't know how to use it. If you didn't go to medical school and don't know, you have to put the large side of the instrument against the chest or you won't hear anything.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael L. Williams",
      "helpful_votes": 0,
      "publication_date": 20100607
    },
    {
      "title": "dual ear tubes is a great plus",
      "text": "nice scope, dual ear tubes makes it top of the line",
      "rating": 5.0,
      "verified": true,
      "author": "pvalnes",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Great",
      "text": "I'm not in the medical field, but needed to keep an eye on a pet that was having some trouble with fluid getting into his lungs. Worked great for my purpose, was able to hear very clearly. Sounds were amplified great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160324
    },
    {
      "title": "Good Choice",
      "text": "Got me through a few years of nursing and 2 years of med school. You don't need to spend more. I eventually ended up buying two of them. This was my second (and 3rd) stethoscope and my first one was a basic one, more for chest sounds for LPN assessment. I would say this a good intermediate one. I eventually did get a Littmann which is clearer for discerning subtle splits, is slightly lighter, but is also much more expensive and if you leave it somewhere it may \"disappear.\" Not so with this one.",
      "rating": 5.0,
      "verified": true,
      "author": "DominicSlyfield",
      "helpful_votes": 0,
      "publication_date": 20140130
    },
    {
      "title": "Good condition. It works",
      "text": "I purchased to listen to my cats heart as the vet thought it was too elevated. Good condition. It works, can hear my heart as well as my cats. Seems to be made well, no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda",
      "helpful_votes": 0,
      "publication_date": 20161023
    },
    {
      "title": "Very Faint for Healthy Adult",
      "text": "I'm not sure how this stethoscope compares to others but heart beat is VERY faint. We thought it could work to hear baby's (fetus' at 34 weeks) heartbeat in womb and there's no way. A strong adult heartbeat is faintly heard through this stethoscope.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 2,
      "publication_date": 20140315
    },
    {
      "title": "Great performance and well made",
      "text": "Wanna listen to your heart? Someone elses heart? Keeping track of missed heartbeats. lol. Really, though... for sure. Great performance and well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "clearly",
      "text": "Accuracy is high and even a small voice can be heard clearly.",
      "rating": 5.0,
      "verified": true,
      "author": "Che Cai",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "This is not the most comfortable thing in the world but",
      "text": "This is not the most comfortable thing in the world but, hey, it's a stethoscope... it's good quality and it does it's job and you can't ask for much more than that.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Wolford",
      "helpful_votes": 0,
      "publication_date": 20161007
    },
    {
      "title": "Does everything I need it to do..",
      "text": "I actually bought this to listen to electronic components - ie., one of these hard drives is clicking, which one is it? - and it does fine for that. It wasn't too expensive, which is fine - I'm not using it for anything where lives are at stake - just computery stuff mostly, and it's fine for that.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Such",
      "helpful_votes": 0,
      "publication_date": 20130408
    }
  ],
  "product_meta": {
    "title": "Omron Sprague Rappaport Stethoscope, Black",
    "description": "Color:BlackSprague Rappaport Style Stethoscope, Black",
    "rating": 4.4,
    "feature_bullets": [
      "Latex FREE tubing and chrome plated chestpiece",
      "Includes: three sizes of open bells, two sizes of diaphragms, and two pair of eartips",
      "Comes with three sizes of open bells"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "9.5 x 4.75 x 1.75 inches; 1.54 Pounds",
      "Item model number": "416-22-BLK",
      "Date First Available": "November 8, 2005",
      "Manufacturer": "Omron",
      "ASIN": "B000FERLKI",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Professional Medical Supplies",
      "Diagnostics & Screening",
      "Stethoscopes",
      "Industrial & Scientific",
      "Health, Household & Baby Care"
    ],
    "price": 33.78
  }
}