{
  "website_summaries": [
    {
      "verdict": "While some customers love these shoes, others say they start coming apart within months. If you are feeling sticker shock, the Shark sandal might be a safer choice.",
      "pros": [
        "Water-repellent leather uppers are perfect for boat shoes",
        "Genuine moccasin stitching and side lacing",
        "Comes in several colors",
        "Leather lining and leather-covered padded footbed with arch support.Padded tongue",
        "Razor-cut traction bottom for grip and water removal"
      ],
      "cons": [
        "May run wide",
        "Some customers say the shoe soles came apart much sooner than expected"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Poor quality - Not expected given past experience",
      "text": "I have 2 other pairs of Mephisto. Great shoes. Little large, but comfortable and well made. This pair, not so much so. I just put these back on today, and wondered why I hadn't worn them since last fall. Then I looked down and remember that after wearing them a few times, the right shoe began to roll. (no, not my foot :-). The right shoe is just poorly made. Since I had worn them, I felt I couldn't return. I will be much more careful next time. Will examine closely upon arrival. You should do the same.",
      "rating": 1.0,
      "verified": true,
      "author": "Just an Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Each of them conformed to the shape of my feet quickly and provided comfortable, utilitarian service",
      "text": "This is my fourth pair of Spinnaker/Hurrikan boat shoes. My first pair I wore primarily sailing. The second pair I wore sailing and on the street. The two current pairs I wear primarily as summer street casual shoes. Each of them conformed to the shape of my feet quickly and provided comfortable, utilitarian service. Mephisto lasts are great for my feet. I am a firm Mephisto consumer, having purchased my first pair of \"walking shoes\" 30 years ago (and several pairs of walking shoes, cap toes, boat shoes, sandals & GoreTex boots since). The shoes are well constructed, provide good rough service over time, and can be re-soled through the mail. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Lochrider",
      "helpful_votes": 3,
      "publication_date": 20160716
    },
    {
      "title": "Anomalous problem BUT SOLVED QUICKLY BY AMAZON",
      "text": "The shoes showed up on time, and fit fine. They're the typical extraordinary quality of Mephisto products. However, after about two weeks, my right shoe had untied, I went to tie them back up and the leather \"shoelace\" (which, on these boat shoes, are complicated bits that run through the entire shoe) broke right in my hand. I'm sure this is an anomalous situation and doesn't reflect the general quality of Mephisto shoes. However, it did happen. Amazon response was extraordinary, volunteered to take back these shoes and replace them, even sent a URL to create a shipping doc. Just great.",
      "rating": 3.0,
      "verified": true,
      "author": "Ron Berti",
      "helpful_votes": 13,
      "publication_date": 20130418
    },
    {
      "title": "I have a pair of similar loafers that fit fine, the shoes are well constructed and I have ...",
      "text": "I have 4 pairs of Mephisto's these were the first that were just too wide for my foot. I have a pair of similar loafers that fit fine, the shoes are well constructed and I have never had any problems with them. I hope this is not some new manufacturing issue as I like Mephisto's style and workmanship.",
      "rating": 4.0,
      "verified": true,
      "author": "A. J. Esposito",
      "helpful_votes": 4,
      "publication_date": 20160920
    },
    {
      "title": "Have a 2 year old pair that are just great. Size 10",
      "text": "Have a 2 year old pair that are just great. Size 10. Ordered 10 in this shoe and they are just gigantic. Tried 9.5 and I think they're going to be to large as well. It's the width. I wear a D width and these are like a EE width. Not sure what to try next.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170619
    },
    {
      "title": "Wonderful shoe",
      "text": "Hurrikan is well designed, constructed appropriately priced shoe. It will last a very long time and still look good. Very comfortable, but that is expected from Mephisto. Definitely my favorite no socks casual shoe... So glad Amazon.com sells it now.",
      "rating": 5.0,
      "verified": true,
      "author": "ALY",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Best Shoes You Can Buy",
      "text": "This is about my 6th or 7th pair. I wear them every day for 4-5 years until I wear them out, then buy a new pair. Every time I take them to my shoeshine parlor, the guy tells me what great shoes they are. And he ought to know.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Mills",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Fell apart after 3 wearings",
      "text": "I've been wearing Mephisto Hurrikan Boat Shoes for years and finally decided to retire my old pairs and get a new one. After less than 3 wearings while walking around town, the souls cracked and disingrated, with large chunks falling off around the edges. You would think that a pair of $329 shoes would last a while, as my old ones did. We'll see if I can have these returned and my money refunded. Stay tuned..... I guess I'm going to be looking for a better, and far less expensive pair of boat shoes, I'm so dissapointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 12,
      "publication_date": 20140628
    },
    {
      "title": "Could be better for the price",
      "text": "Cons include a high price, a slightly small fit, and slight issues with durability of the leather and the rubber sole. That being said these are my everyday shoes and they are incredibly comfortable and functional. Mephisto will refurbish any durability issues as far as I know, which is a nice touch especially considering how much they cost.",
      "rating": 4.0,
      "verified": true,
      "author": "Z",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Greatest shoes in the world",
      "text": "I have probable had 20 plus pairs of Mephisto's sence I started wairing them years ago. After putting on my first pair, I through away my custom orthotics and have not needed them. That about says it all. I have had dress shoes,match walking shoes many,sandels several and these boat shoes in different colors. Most tend to be a little large but not enough to order down a half size but I use heavy socks.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Greene",
      "helpful_votes": 3,
      "publication_date": 20140129
    },
    {
      "title": "Disappointed",
      "text": "very disappointed with these. I have the exact pair that are years old and these are much wider,and just don't fit as well. Also, doesn't seem up to former mephistos quality These are made in turkey; could that be the reason?",
      "rating": 3.0,
      "verified": true,
      "author": "Yosefaaron ",
      "helpful_votes": 3,
      "publication_date": 20150730
    },
    {
      "title": "Treat yourself well.",
      "text": "After a few days, I can unequivocally state that these are fantastic. Expensive, too, but as expected, you often get what you pay for.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Binder",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "Mephisto sizing is irregular.",
      "text": "I needed more casual shoes caused by our current way of life.",
      "rating": 5.0,
      "verified": true,
      "author": "Niles02",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Two Stars",
      "text": "Shoes were way too large, ordered size 9D, must have been at least a full size larger.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170501
    },
    {
      "title": "leave me alone",
      "text": "No i don't work for you. I will check a box but no mor ever. get a grip i don't want a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "dan",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Expensive, but good.",
      "text": "As expected. Expensive. But is 6th pair i have bought , and plan to continue.",
      "rating": 5.0,
      "verified": true,
      "author": "patrick jones",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Great boat and everyday shoes.",
      "text": "Wonderful shoes! My old pair have lasted well over five years and are still going strong. Expensive but well worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Swaine",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "well-made but a bit uncomfortable (and oddly sized)",
      "text": "A beautiful replacement for the Timberland boat shoes I've owned for the last decade (a model which, sadly, is no longer made). I don't have any known ankle or foot problems, but--after wearing this shoe only 2-3 times (for no more than a couple of hours at a time), I find the outer ankle/lower leg and instep of one foot is a bit sore (which I find odd, since the footbed is clearly well-padded). The pain may be unrelated to the shoe--we'll see. But one warning to anyone who buys this Mephisto model: it runs extremely large (I normally wear 11D (11.5 in New Balance), and had to drop down to 10.5 on this Hurrikan.",
      "rating": 3.0,
      "verified": true,
      "author": "customer",
      "helpful_votes": 0,
      "publication_date": 20130411
    },
    {
      "title": "These are replacements for ones I had for more than ...",
      "text": "These are replacements for ones I had for more than 10 years and I expect the same wear and comfort from these that I had from my previous ones. The problem with the old ones was that the rubber sole at the heel cracked and separated, not something I would have expected.",
      "rating": 4.0,
      "verified": true,
      "author": "Judith M. Shade",
      "helpful_votes": 0,
      "publication_date": 20150414
    },
    {
      "title": "ENJOY IT... after paying attention to the right fit!",
      "text": "SIZES DO NOT MUCH ACCURATELY USA MEASUREMENTS. OTHERWISE, GREAT SHOES.",
      "rating": 5.0,
      "verified": true,
      "author": "Luiz H.S.de Vasconcellos",
      "helpful_votes": 0,
      "publication_date": 20170329
    },
    {
      "title": "You get what you pay for",
      "text": "Quality is apparent if you’re used to Sperry. Exceptionally comfortable and durable shoe. Maybe a bit bulky looking.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Best ever boat shoes!",
      "text": "The best ever boat shoe. Seems the shoes run large and 8 fits even though I am 8.5 for all other shows.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Wright",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Great Shoes",
      "text": "I have had 6-7 pairs and it is the only one I will buy. You pay a little more,but they are worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "McCourt",
      "helpful_votes": 0,
      "publication_date": 20160601
    },
    {
      "title": "Very comfortable. I wish I could get them in black",
      "text": "Very comfortable. I wish I could get them in black.",
      "rating": 5.0,
      "verified": true,
      "author": "Carole Perl",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "Great Shoes",
      "text": "nice to receive products that meet or exceed your expectations",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160225
    },
    {
      "title": "Five Stars",
      "text": "Loved the shoes but they were just a shade to small this was my second pair",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170201
    },
    {
      "title": "Great quality.",
      "text": "Repeat customer of Mephisto shoes. Worth the money. 4th pair. Different styles",
      "rating": 5.0,
      "verified": true,
      "author": "Chris ",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Classic - Comfortable",
      "text": "This was a replacement for an old pair. Excellent shoe - always looks nice - very little upkeep.",
      "rating": 5.0,
      "verified": true,
      "author": "MA",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Five Stars",
      "text": "I've been wearing Mephisto for many years and never disappointed .",
      "rating": 5.0,
      "verified": true,
      "author": "Len K",
      "helpful_votes": 0,
      "publication_date": 20150629
    },
    {
      "title": "Good ole shoes",
      "text": "This is my second pair of this particular shoe. Mephisto now calls it the Hurrikan boat shoe, but it is still the \"Spinnaker\" model to me. In fact the new pair has this name on its' insole. I bought the first pair about 12 years ago and had them refurbished once by Mephisto. I still wear them doing gardening etc. The new ones are identical and every bit as comfortable......just shiney new! They are expensive, but will last thru 3 pairs of similar shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20120525
    },
    {
      "title": "Great Shoes",
      "text": "Completely satisfied, high quality, looks great, extremely comfortable. I would highly recommend these boating shoes. Terrific casual shoes that can even be worn with slacks and a tie",
      "rating": 5.0,
      "verified": true,
      "author": "mike koen",
      "helpful_votes": 0,
      "publication_date": 20140601
    },
    {
      "title": "My favorite shoes",
      "text": "I have worn these for a number of years. Although very expensive, they are very comfortable and last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "JonW9",
      "helpful_votes": 0,
      "publication_date": 20140607
    },
    {
      "title": "Five Stars",
      "text": "My husband is very happy with these shoes - his second pair! Very comfortable all day.",
      "rating": 5.0,
      "verified": true,
      "author": "Auntie Deb",
      "helpful_votes": 0,
      "publication_date": 20150407
    },
    {
      "title": "Favorite boat shoes!",
      "text": "Have worn these for years-- if you can get at the right price- these are great and will last you years-- very comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Bell",
      "helpful_votes": 0,
      "publication_date": 20130820
    },
    {
      "title": "... problem with width was solved very efficiently with the wonderful assistance of Jane from customer care",
      "text": "Initial problem with width was solved very efficiently with the wonderful assistance of Jane from customer care. Have worn Mephistos for many years. Can't say enough about quality workmanship, excellent fit, comfort, good looks.",
      "rating": 5.0,
      "verified": true,
      "author": "hl",
      "helpful_votes": 0,
      "publication_date": 20150501
    },
    {
      "title": "highest quality?",
      "text": "high quality workmanship and materials ... fourth pair and all have been great in every respect",
      "rating": 5.0,
      "verified": true,
      "author": "John P. Shelton, Jr.",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Four Stars",
      "text": "Mephisto shoes last for a long time. Looking forward to wearing them out.",
      "rating": 4.0,
      "verified": true,
      "author": "SixF7",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "Excellent product",
      "text": "I have used Mephisto shoes for many years and they are the very best past and present without question !!",
      "rating": 5.0,
      "verified": true,
      "author": "ken from kelowna",
      "helpful_votes": 0,
      "publication_date": 20130114
    },
    {
      "title": "These are the only shoes I've worn for the last ...",
      "text": "These are the only shoes I've worn for the last 17 years. They were made in France originally, then in Portugal, and now in Turkey - but the quality hasn't changed.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Brown",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "Beautiful shoes...Highly recommended.",
      "text": "I've tried lots of boat shoes (no boat...but love the style) but Mephistos provide the support and comfort I need. Expensive but long lasting and super comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20131109
    },
    {
      "title": "Overall Quality Disappointing",
      "text": "My current Hurrikan boat shoes are worn out, so I ordered a new pair online. My original pair were made in Portugal and the new ones are made in Turkey. While I like Turkey a lot, I don't think the overall craftsmanship is a good as the Portuguese. I will keep the new shoes, but any future purchase will not be on-line, unless the country of origin is clearly indicated on the web-site.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephen S. Spigel",
      "helpful_votes": 8,
      "publication_date": 20130919
    },
    {
      "title": "Very comfortable. This is my third pair of the same ...",
      "text": "Outstanding shoes. Very comfortable. This is my third pair of the same model. Hope I live long enough to buy another pair. My only complaint is they are horrible in wet or icy conditions. Boat shoes? Forget it. No longer wear them raining or during winter months.",
      "rating": 4.0,
      "verified": true,
      "author": "Edward A. Onderick",
      "helpful_votes": 0,
      "publication_date": 20150702
    },
    {
      "title": "nice - I like the shoes",
      "text": "nice - I like the shoes. I have a high instep and most slip-ons don't work for me. These are relaxed on the top of my arch.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "Three Stars",
      "text": "Same size as my ten-year-old mephistos, but are considerably larger.",
      "rating": 3.0,
      "verified": true,
      "author": "Edward I. Barrick",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "great",
      "text": "Have another pair, but they are getting a little beat up from constant wear . Love them - most comfortable Can wear them for dress or casual.",
      "rating": 5.0,
      "verified": true,
      "author": "John Candor",
      "helpful_votes": 0,
      "publication_date": 20130501
    },
    {
      "title": "too big",
      "text": "good shoe but size is one size too big fomr all my other shoes..i sent back my normal size 11-tried to get 10 only had a 10,5 still too big unfortunately",
      "rating": 1.0,
      "verified": true,
      "author": "gerald d overaa",
      "helpful_votes": 2,
      "publication_date": 20131209
    },
    {
      "title": "great shoes",
      "text": "Most comfortable shoes I have ever had, look somewhat dressy and are very durable. Second pair I have owned. Will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "M. T. Meaney",
      "helpful_votes": 0,
      "publication_date": 20131217
    },
    {
      "title": "Narrow Toe area",
      "text": "The shoe was too narrow in the toe area. I am sending them out to see if they can be stretched and made larger in the toe area. Weel seee!",
      "rating": 1.0,
      "verified": true,
      "author": "Michael B Stewart",
      "helpful_votes": 0,
      "publication_date": 20150712
    },
    {
      "title": "birthday gift for our sone",
      "text": "The shoes arrived very soon. He usually wears a size 11, but they were a little too large. Returning and reordering them couldn't have been easier -- he had his shoes very soon after his birthday and he likes them very much.",
      "rating": 5.0,
      "verified": true,
      "author": "Joan M. Dent",
      "helpful_votes": 2,
      "publication_date": 20110518
    },
    {
      "title": "Take the time to go to a local shoe store ...",
      "text": "Take the time to go to a local shoe store to buy these shoes. My $325 Mephistos fell apart after 5 months and I have no way to return them.",
      "rating": 2.0,
      "verified": true,
      "author": "Broadcaster",
      "helpful_votes": 5,
      "publication_date": 20160405
    },
    {
      "title": "Returned for change of size; Replacement NOT received",
      "text": "The size 10 that I received were too large so I returned to the Amazon returns address in KY. This was a couple of weeks ago. I have not received my replacement (size 9) or heard anything from Amazon. Please let me know what is going on. /s/ EV Snotherly, Jr.",
      "rating": 1.0,
      "verified": true,
      "author": "EVERRETTE V SNOTHERLY JR",
      "helpful_votes": 2,
      "publication_date": 20130625
    },
    {
      "title": "Watch for sizing",
      "text": "It runs large. I am a 9.5 and should have ordered a 9 for this shoe. I returned the shoes using the online return form but haven't been able to figure out if Amazon has received them. Some warning about sizing would have helped avoid this hassle.",
      "rating": 1.0,
      "verified": true,
      "author": "Miami Shopper",
      "helpful_votes": 5,
      "publication_date": 20120318
    },
    {
      "title": "Great shoes",
      "text": "These are the only shoes that my husband will wear. Really comfo0rtable and this is an excellent color. Extraordinary price from Amazon - the best ever.",
      "rating": 5.0,
      "verified": true,
      "author": "jcisok",
      "helpful_votes": 0,
      "publication_date": 20130711
    },
    {
      "title": "Major Dissapointment",
      "text": "I have worn Mephisto Hurrikans for years and have loved them. However, I purchased a new pair in November 2011 and have just worn them a few times and the heels on both shoes have deteriorated and are falling apart!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Shelby Nussbaum",
      "helpful_votes": 10,
      "publication_date": 20120229
    }
  ],
  "product_meta": {
    "title": "Mephisto Men's Hurrikan Moccasin",
    "description": "Internationally known for their outstanding craftsmanship and lasting comfort, MEPHISTO footwear makes tired feet a thing of the past. Our revolutionary SOFT-AIR TECHNOLOGY is the innovation behind this exceptional comfort. The flexible SOFT-AIR midsole minimizes the shock from walking, offering protection to your feet, relief for your joints, and proper care of your back. The breathable nature of this exclusive midsole also enhances air circulation to ensure a healthier environment for your feet.\n\nMephisto makes some of the finest walking shoes on earth. Their comfort, support and durability are recognized wherever people are serious about walking. For more than three decades, Mephisto has been on the forefront of walking-shoe innovation. Mephisto’s natural products are handmade of leather, latex, cork and rubber.",
    "rating": 4.4,
    "feature_bullets": [
      "100% Leather",
      "Imported",
      "Rubber sole",
      "Soft-Air Technology and Removeable insole Provide Comfort. The SOFT-AIR midsole is flexible and soft, reduces the shock from walking, protecting your feet, joints and vertebrae.",
      "Protection for your feet, joints and vertebrae.",
      "Made In Europe",
      "Removeable Insole",
      "Handmade by master shoemakers"
    ],
    "categories": [
      "Shoes",
      "Men",
      "Loafers & Slip-Ons",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 349.89,
    "specifications": {}
  }
}