{
  "website_summaries": [
    {
      "verdict": "This is a decent router, with a good software package. But before you can get to the software, you've got to get past the frustrating installation wizard. While it does \"n\" only in the 2.4-GHz band, performance is adequate, and it's available at a good price, considering all the features it offers.",
      "pros": [
        "Nice price",
        "Full-featured router management",
        "Attractive case"
      ],
      "cons": [
        "2.4-GHz band operation only",
        "Buggy installation wizard"
      ],
      "aspects": {},
      "publication_date": 20140226,
      "rating": 6.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good price, great performance",
      "text": "I've had this router for over 8 months and it works great. I have one computer (Windows XP) connected with a cable, one (Windows XP) connecting wirelessly, a Wii, Playstation3, and blu-ray player all using the router. For my internet connection, I have a cable modem. The reason I bought this model was because I needed to VPN to work from my wired computer while the other one was still connected to the internet; my previous router, the Linksys WRT54G2, wouldn't do that. This router supports multiple tunnels which solved my problem. The main setup up was easy and I was online in no time; using the multiple tunnels required using some advanced settings.",
      "rating": 5.0,
      "verified": true,
      "author": "Davewise",
      "helpful_votes": 0,
      "publication_date": 20091124
    },
    {
      "title": "Very easy to set up. Flawless performance.",
      "text": "My first-ever wireless router. Setup could not have been easier, and performance is glitch-free and much faster than I expected, on both wireless and wired connections. The movable antennas and a little clip-on stand allow the router to stand upright in a one-inch wide space beside my TV, sending a strong signal everywhere in my house even in low-power mode. It's been a while since I was this happy with any product, which is even more remarkable considering how troublesome wireless routers evidently can be. I was surprised and delighted. I'd recommend this router without hesitation even to tech-challenged friends.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Martin",
      "helpful_votes": 2,
      "publication_date": 20090618
    },
    {
      "title": "Bought this for wireless access to an already existing gigabyte network",
      "text": "The feature are impressive, but even after (repeated) firmware re-installs for lost connectivity issues, it turns out that there's no update for it. They've killed the product so we are monkeys eyeing our footballs, folks. Stars at two. 'Waste not thine time... edited 8-20-2014 So as an access point, it drops connectivity very often, 4-5 times a day. As a router, it works very well, and never drops signal. And there you go.... raised the stars back up to four.",
      "rating": 4.0,
      "verified": true,
      "author": "Gwaltney",
      "helpful_votes": 0,
      "publication_date": 20140424
    },
    {
      "title": "Virtually problem free out of the box",
      "text": "I bought this wireless router at the suggestion of an online review. The review said this was a very good router for those who don't need extreme gaming capabilities, though the specs on this router indicate that it can be configured for high end games. I set it up in about ten minutes using the semi automated configuration guide. It was easy and the router has performed very well. I have one older laptop that has dropped the connection a few times, only to reconnect a few seconds later. The newer laptops in the house have not dropped the connection. I am very pleased with this router.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20090807
    },
    {
      "title": "TrendNET Worth the Price",
      "text": "A perfect wireless router for personal use. I had it connected to my computer, wireless laptop, wireless printer, and wireless PS3 without any flaws or drops in service. It may cost a little more than standard Wirless N routers but the extra price comes with a wide range of adjustable network properties, multiple channels for older networks, and a certain quality the product exudes just by standing there. I feel like this is the BMW of routers and I would recommend this product for any PC user or even small businesses/office. The price may be a little more, but you'll be more than satisfied with the quality and comfort of a problem free router.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Lising",
      "helpful_votes": 0,
      "publication_date": 20090910
    },
    {
      "title": "Great wireless N Router!!",
      "text": "I've used two of these routers--one at home and one at my office. Set up was fairly easy with or without the CD set-up disk, the security features/firewall are excellent, the range of signal is very good, and I've never had a \"dropped connection\" since I've owned this router. TRENDnet got this one right!!",
      "rating": 5.0,
      "verified": true,
      "author": "KenZen",
      "helpful_votes": 0,
      "publication_date": 20100126
    },
    {
      "title": "OK w/VoIP phone",
      "text": "I bought this router primarily for its QoS hardware capabilities, hoping it will solve some of my VoIP problems. It got better, but I still have to reboot the router and the ViaTalk VoIP box a couple of times per month to prevent it from dropping calls. More tweaking needed...",
      "rating": 4.0,
      "verified": true,
      "author": "pardos",
      "helpful_votes": 0,
      "publication_date": 20090912
    },
    {
      "title": "Great Product!",
      "text": "Previous wireless router was having issues with home network setup and could not connect to the new Nintendo Wii. I'd read a few online reviews about a few issues with this router (i.e. CD software did not work etc.), and had Network Engineer (family member) on speed dial for any issues... The installation was very easy! (No need for \"family member\" at all) Home Laptops no longer lose connection or DNS issues! The internet speed increased! The Nintendo Wii easily connected! Very Happy! Great Product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew G. Moss",
      "helpful_votes": 2,
      "publication_date": 20090418
    },
    {
      "title": "Good value on a good router",
      "text": "The prior reviews on this router pretty much cover everything already, so I'll just add that after nearly two years of service this thing has been nearly bulletproof. I bought this as a replacement for an aging Nexland Wavebase and have not been disappointed.",
      "rating": 4.0,
      "verified": true,
      "author": "Billy Suratt",
      "helpful_votes": 0,
      "publication_date": 20101111
    },
    {
      "title": "No real issues...",
      "text": "I've been running with this router for a month now with little to no issues. Setup was mediocre, the average user may need some assistance but its not too difficult. Distance is far superior to my previous D-Link, I'm able to walk 3 houses down without losing a connection (whereas before I wouldn't be able to reach the middle of my driveway). The only problem I ran into was interference with a cordless phone running the same signal, pitched the phone and I've been error free since.",
      "rating": 4.0,
      "verified": true,
      "author": "BSD",
      "helpful_votes": 5,
      "publication_date": 20080210
    },
    {
      "title": "Very nice router",
      "text": "I have 3 computers connected to this router and have never had a problem since installing it. It was easy to install and is very reliable.",
      "rating": 5.0,
      "verified": true,
      "author": "Ted",
      "helpful_votes": 0,
      "publication_date": 20140427
    },
    {
      "title": "Unit was flaky",
      "text": "The unit would power on when you plugged it in, but if you looked at it wrong, or breathed on it, or changed its position, or touched it, it would power off and all of the lights would go out. It would power up again if you unplugged it and plugged it in again. I hope this is just a sample defect and not a symptom of a larger problem. I don't see other reviews like this, and I'm glad. I am asking for a replacement unit.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20090904
    },
    {
      "title": "Excensive but worth it",
      "text": "Got the TRENDnet for the first time based on a friend's suggestion to replace my NetGear router and this impressed me right away. The 300Mbs is awesome with additional encryption options. Even though its a bit expensive, it's worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "E. C.",
      "helpful_votes": 0,
      "publication_date": 20090602
    },
    {
      "title": "Longest range WIFI",
      "text": "This wireless router has enough power to use wireless devices from 200 feet away...it's the best router I ever owned.",
      "rating": 5.0,
      "verified": true,
      "author": "David Bechtold",
      "helpful_votes": 0,
      "publication_date": 20140224
    },
    {
      "title": "Works great - reliable and great signal/speed quality",
      "text": "This replaced a Linksys router that was getting flaky where my signal kept dropping and throughput speed was horrid. The Trendnet got overall great reviews and it has been working great for the last 6 months. Signal strength and throughput is awesome and it was a breeze to set up.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Chang",
      "helpful_votes": 3,
      "publication_date": 20090402
    },
    {
      "title": "How Easy This Was",
      "text": "I thought I would need help setting this up. I did not want to wait so I tried it myself. I was amazed how easy it was. I was done within a half hour. I am sharing on a wi, an exbox and two laptops with no problem. I am happy I picked this product.",
      "rating": 5.0,
      "verified": true,
      "author": "K. starbuck",
      "helpful_votes": 0,
      "publication_date": 20090818
    },
    {
      "title": "Great product",
      "text": "This router works great. Many settings to choose. Wired gigabit is flawless. Wireless N has good range and stays connected. Technical support is slow but good when you finally get it. It took them a week to answer an e-mail.",
      "rating": 4.0,
      "verified": true,
      "author": "James G. Fuller",
      "helpful_votes": 0,
      "publication_date": 20090118
    },
    {
      "title": "OK",
      "text": "WORKS PRETTY WELL, RANGE NOT FOR CRAP. SETUP GETS TO BE A BIT OF A PAIN WHEN TRING TO WET UP WEP.",
      "rating": 3.0,
      "verified": true,
      "author": "BOBBY HUMPHREY",
      "helpful_votes": 0,
      "publication_date": 20140226
    },
    {
      "title": "Nice Router",
      "text": "This router is very easy to set up and is much faster than my previous wireless router. I was up and running with an hour.",
      "rating": 4.0,
      "verified": true,
      "author": "Jerry Helsing",
      "helpful_votes": 2,
      "publication_date": 20080729
    },
    {
      "title": "Terrific!!!",
      "text": "I love this router. I had an older Linksys Wireless router that was giving me problems. This one works great. I don't get dropped every 10 minutes when I'm on my laptop.",
      "rating": 4.0,
      "verified": true,
      "author": "Mrs C",
      "helpful_votes": 2,
      "publication_date": 20080520
    },
    {
      "title": "love trendnet",
      "text": "never heard of this company, before i bought it, since it was inexpensive. tried it.. Impressed.. i live in 2 storey home. this router in basement and i get great wifi in 1st floor. and decent in 2nd floor. I would buy trendnet again if their price remains competetive. bye bye to cisco and big brand names",
      "rating": 5.0,
      "verified": true,
      "author": "Madhu Ramachandran",
      "helpful_votes": 0,
      "publication_date": 20120421
    },
    {
      "title": "Dont Buy This",
      "text": "Ok I bought this since it looked like a deal. I'm running Vista home Premium on a New HP desktop. I worked for hours trying to get this device to connect to the internet. I could create a local LAN but nothing could get it up on the net. Their customer service was poor and didn't even know this product! I ended up with a Linksys 610N and it is great!",
      "rating": 1.0,
      "verified": true,
      "author": "W. Breeding",
      "helpful_votes": 4,
      "publication_date": 20080909
    },
    {
      "title": "No problems a year later",
      "text": "This thing is fast; the wireless is flawless and speedy, setup was a breeze, the gigabit switch is helpful, and it is still a great bargain. I've rebooted it once in the last year (and I don't know if that was necessary). Works in the attic here in Salt Lake City - often subzero in the winter and I'm sure it gets hotter than 120F in the summer (poor venting up there). I'd buy it again in a second. [update] have now owned this router for 4 years; it is still kicking. I reboot it occasionally (maybe once every few months). Would still buy again.",
      "rating": 5.0,
      "verified": false,
      "author": "cim",
      "helpful_votes": 0,
      "publication_date": 20090105
    },
    {
      "title": "Finally an easy router.",
      "text": "I finally ditched the old Netgear (I'll never buy another) and replaced it with the TRENDnet TEW-633GR. Setup was easy as pie, the wizard transferred my existing router without a problem. It took me about a half hour of poking around through the menus to set security and filters. Interface is very intuitive. Signal strength is far superior to the Netgear at 5.9 Mbps wireless. This is at a distance of around 75 feet and through several walls. I like and recommend this router.",
      "rating": 5.0,
      "verified": false,
      "author": "Sunshine_Fisherman",
      "helpful_votes": 3,
      "publication_date": 20081119
    },
    {
      "title": "Simply the Best",
      "text": "Pros: Rate, Range, Features. Cons: None really - only GIG WAN port is useless at this time. I only have 802.11g clients at this time - getting full 54 Mbps (all the client can do) with 75% signal at 50 feet and 1 floor away while I was getting half of the rate and signal with old 802.11g router at the same location. WISH Feature is cool and it works.",
      "rating": 5.0,
      "verified": false,
      "author": "LongTimer",
      "helpful_votes": 7,
      "publication_date": 20071102
    },
    {
      "title": "Great Router",
      "text": "I review many routers for the problems others had. I had problems with my old b router from linksys. I would have to reset it every week or ten days. This TRENDnet TEW-633GR has been running so well I forgot about doing the review on it. Well, it is top notch. I will definitely buy future products from this company. NO problems!! Even though I did not upgrade my laptop, the range is much better and no slow downs.",
      "rating": 5.0,
      "verified": false,
      "author": "ARMIDA",
      "helpful_votes": 0,
      "publication_date": 20090906
    },
    {
      "title": "So far, so good",
      "text": "Working well with no issues. Good speed, good features. I am going to add another and set it up as a bridge and connect my xbox to it: better speed than Xbox wireless add-on and more reliable I hope.",
      "rating": 4.0,
      "verified": false,
      "author": "Navid",
      "helpful_votes": 0,
      "publication_date": 20081224
    },
    {
      "title": "Great Router",
      "text": "Just bought a new laptop that has a Wireless N card so I decided I needed a router to make use of it. This router has been great, no downtime, easy to setup, and always have full strength. The amount of features that the user interface has is quite numerous as well. Overall Great Buy, would recommend.",
      "rating": 5.0,
      "verified": false,
      "author": "B. Keller",
      "helpful_votes": 0,
      "publication_date": 20090508
    },
    {
      "title": "Great Router found cheaper combo w/8GB Jump drive.",
      "text": "I Found this cheaper as a combo at NewEgg!! only $99.00 and included an 8 GB jump drive. Sorry Amazon is not always the cheapest. I love this router, I never get connection disconnects like I used to with my D-Link. It is fast and easy to set up. Using with win xp on desktop and win vista home edition on laptop.",
      "rating": 5.0,
      "verified": false,
      "author": "Angel",
      "helpful_votes": 3,
      "publication_date": 20080316
    },
    {
      "title": "tew633gr Trendnet router",
      "text": "I'm going to make this very short. Best router i've ever had bar none. The good reviews that are already posted are nothing but the truth. As far as the bad reviews go i don't know what there problem is. Buy this router you won't be sorry!!!!!!!!!!",
      "rating": 5.0,
      "verified": false,
      "author": "Dennis",
      "helpful_votes": 0,
      "publication_date": 20100401
    },
    {
      "title": "DO NOT USE THE INSTALLATION DISK!",
      "text": "DO NOT UNDER ANY CIRCUMSTANCES USE THE INSTALLATION CD-ROM. It will cause your computer to become unstable with BSOD (blue screen of death) and you'll have to reformat your hard drive to fix it. You'll find the router at 192.168.10.1 and from there you can connect and configure it.",
      "rating": 4.0,
      "verified": false,
      "author": "M",
      "helpful_votes": 7,
      "publication_date": 20080903
    },
    {
      "title": "XBOX Gamers Delight!",
      "text": "I just got this for the \"N\" technology but my inlaws brought over their XBOX 360 and they hooked it to the router -- WOW! It has a game setting that you can select XBOX LIVE (you can even specify the game!), and it assigns the setting to the IP of the XBOX and it is keeping the game lag-free and fast! I am very impressed so far!",
      "rating": 5.0,
      "verified": false,
      "author": "Brandon W. Peterson",
      "helpful_votes": 2,
      "publication_date": 20090418
    },
    {
      "title": "Great",
      "text": "Very easy to get up and running, installation was a breeze. Works exceedingly well, laptop w/o Trendnet adapter picks up at 54 Mbps, with adapter 130 Mbps.",
      "rating": 5.0,
      "verified": false,
      "author": "C. Ross",
      "helpful_votes": 0,
      "publication_date": 20081222
    },
    {
      "title": "Excellent wireless speed and range",
      "text": "I've used this router for over a month, and so far I've experienced no dropped wireless connections. The range is excellent. I'm glad I switched from my existing Linksys router. Easy to configure.",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20081222
    },
    {
      "title": "There are better ones out there",
      "text": "Well this about the average router for Your buck but very easy to install and working well for the first 6 months then kept dropping the signal and laggy online games. I just replaced it with a Netgear so much better",
      "rating": 3.0,
      "verified": false,
      "author": "I. Flores",
      "helpful_votes": 0,
      "publication_date": 20090508
    },
    {
      "title": "Excellent Product!",
      "text": "Easy installation, works well with Linksys WPC300N Wireless N Notebook adapter @300 MBPS & ENCORE ENUWI-N USB 2.0 802.11n Wireless USB Adapter @130 MBPS.",
      "rating": 5.0,
      "verified": false,
      "author": "Anil Kumar",
      "helpful_votes": 0,
      "publication_date": 20090106
    },
    {
      "title": "Good stuff!",
      "text": "I get a great signal from this little box. It was easy to hook up and syncs with all my LAN and Wireless Products. Highly recomended!",
      "rating": 4.0,
      "verified": false,
      "author": "Morgonzo",
      "helpful_votes": 3,
      "publication_date": 20080405
    },
    {
      "title": "Same featureset as routers twice its price",
      "text": "Fast, simple, and feature rich; its most important feature....it's 100 dollars less than routers with the same features.",
      "rating": 4.0,
      "verified": false,
      "author": "Bryan Bishop",
      "helpful_votes": 0,
      "publication_date": 20090103
    },
    {
      "title": "Good wire, very bad wireless",
      "text": "Pros: Relativity cheaper. Getting max 14 MByte/Sec on wire Lot of user setting Cons: No JUMBO .... ( some say its there but I think NOT) Wireless service unavailable after a day or so. Getting max 14 MByte/Sec on wire. Antennas are fixed No wall mount User setting are not grouped well",
      "rating": 2.0,
      "verified": false,
      "author": "Ben Shaw",
      "helpful_votes": 0,
      "publication_date": 20081112
    }
  ],
  "product_meta": {
    "title": "TRENDnet 300Mbps Wireless N Gigabit Router TEW-633GR (Piano Black)",
    "description": "The 300Mbps Wireless N Gigabit Gaming Router incorporates the latest wireless and Gigabit networking technology to increase speed, range, security and reliability. The router provides unsurpassed gaming and network experience and performance. Advanced antenna and 802.11 N technology increases wireless data range and coverage. Enjoy lag-free gaming and file transfers on your wired Gigabit computers via the built-in Gigabit switch. This router features a powerful firewall and advanced wireless encryption for secured transmissions. Quality of Service (QoS) prioritization provides a seamless gaming and multimedia streaming experience. Increased speed, throughput and range make it the perfect solution to fulfill your gaming needs.\n\nAMAZON.COM\n\n\n\n\nFROM THE MANUFACTURER\n\n\nThe 300Mbps Wireless N Gigabit Gaming Router incorporates the latest wireless and Gigabit networking technology to increase speed, range, security and reliability. The router provides unsurpassed gaming and network experience and performance.  Advanced antenna and 802.11 N technology increases wireless data range and coverage. Enjoy lag-free gaming and file transfers on your wired Gigabit computers via the built-in Gigabit switch. This router features a powerful firewall and advanced wireless encryption for secured transmissions. Quality of Service (QoS) prioritization provides a seamless gaming and multimedia streaming experience. Increased speed, throughput and range make it the perfect solution to fulfill your gaming needs. \n\n Additional Features\n\n\n * Wi-Fi compliant with IEEE 802.11n and IEEE 802.11b/g standards \n * 4 x 10/100/1000Mbps Auto-MDIX Gigabit LAN port and 1 x 10/100/1000Mbps Gigabit WAN port (Internet) \n * Supports Cable/DSL modems with Dynamic IP, Static IP, PPPoE, PPTP, L2TP and BigPond connection types \n * Supports Router AP mode and Bridge mode \n * Built-in 3 external antennas support 300Mbps high speed performance and great coverage \n * Firewall features Network Address Translation (NAT), and Stateful Packet Inspection (SPI) protects against DoS attacks \n * Traffic control with virtual servers, special applications, gaming services and Ubicom StreamEngine feature \n * UPnP (Universal Plug and Play) and ALGs support for internet applications such as email, FTP, gaming, remote desktop, NetMeeting, telnet, and more \n * Provides additional security of enable/disable wireless SSID, internet access control (services, URL and MAC filtering) \n * Supports multiple and concurrent IPSec, L2TP and PPTP VPN pass-through sessions \n * Supports Static Routing – RIPv1 announcer \n * Easy management via web browser (IE 6.0 or above, Firefox, Opera, Netscape) and remote management \n * Supports 64/128-bit WEP (for 11b/g), WPA/WPA2 and WPA-PSK/WPA2-PSK \n * Compliant with Windows 95/98/NT/2000/XP/2003 server/Vista, Linux and Mac OS \n * Coverage up to 150 meters (500ft.) indoor (depending on the environment) \n * Coverage up to 400 meters (1300ft.) outdoor (depending on the environment) \n\n Networking Solutions \n\n \n\nSee more",
    "rating": 3.2,
    "feature_bullets": [
      "14x the speed and 6x the range of wireless g",
      "Seamlessly stream video, download files, talk online and play games",
      "Quality of Service technology prioritizes gaming, Internet calls and video streaming",
      "Advanced wireless encryption and a firewall provides robust security",
      "Supports AP mode and Bridge mode"
    ],
    "specifications": {
      "Product Dimensions": "6.4 x 1 x 5.9 inches",
      "Item Weight": "11.8 ounces",
      "ASIN": "B000VIT0G6",
      "Item model number": "TEW-633GR",
      "Customer Reviews": "3.2 out of 5 stars72 ratings3.2 out of 5 stars",
      "Best Sellers Rank": "#581,052 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "July 7, 2004",
      "Manufacturer": "TRENDnet",
      "Language:": "English"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Routers",
      "Networking Products"
    ],
    "price": ""
  }
}