{
  "website_summaries": [
    {
      "verdict": "Light and efficient saw that cuts a 4 x 4 more quickly and precise than most.",
      "pros": [
        "Top reviews for cutting large boards and making precise cuts",
        "Features comfortable side handles in base",
        "Comes with a carbide blade, dust bag, and blade wrench"
      ],
      "cons": [
        "Some customers received bent and bowed parts"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "A robust, accurate tool with a high price.",
      "pros": [
        "Great for cutting large-section lumber",
        "Folds down for easy carrying"
      ],
      "cons": [
        "Expensive",
        "Few extra features"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "As others have said, check the fence. Mine is bowed. And their customer service is not the best by a long shot.",
      "text": "Check the fence!!!!!!!!!!!! Update: Dewalt did send a replacement fence. However, dealing with their customer service agent was like talking to someone with alzheimer's - anything I said was forgotten in two seconds and had to be repeated over and over.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard B",
      "helpful_votes": 75,
      "publication_date": 20171113
    },
    {
      "title": "More time for me!",
      "text": "So far so good. I bought this to assist in helping my wife with her never ending quest to recreate everything she sees on Pinterest! I can now cut boards at a record pace, thus spending less time in the realm of etsy type projects. This allows for more time for man things............making Jerky, eating bacon, and wrestling grizzly bears!",
      "rating": 5.0,
      "verified": true,
      "author": "Karl Eric Wheatley, Jr.",
      "helpful_votes": 172,
      "publication_date": 20160408
    },
    {
      "title": "Very happy clean cuts",
      "text": "My first miter saw!!! Very happy clean cuts, an fortunately I didn't get my blades but I went to Home Depot and bought one for fine cuts because it comes with one but it is only to cut 4x2 or 4x4 well I'm not an expert so if this review helps someone out there or if you guys have any suggestions I appreciate it. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Henry S.",
      "helpful_votes": 18,
      "publication_date": 20170606
    },
    {
      "title": "I am very happy with the overall quality",
      "text": "I just received this saw, and did some serious close inspection of the construction... I work in design, and also am a journeyman toolmaker, so I am very picky about quality... This saw will be used for home projects only. I am very happy with the overall quality, and build of the saw. I checked the initial cuts for squareness, and straightness... I was impressed with the performance. I added a couple pics for closer looks at the mechanics... I would recommend this saw to a friend... Happy building!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 11,
      "publication_date": 20180408
    },
    {
      "title": "A Great Deal",
      "text": "If you're looking for a good basic Miter Saw, this is it, I moved up from a 10\" secondary brand that I bought about 10 years ago and this is definitely a huge upgrade, it serves just the basics, but that's all I'll need 95% of the time, gave it a test run on a few pieces and everything works great. I checked the fence etc. like other comments suggested and everything is in good shape. I don't give 5 stars much but this saw should last many, many years and for the price I am very satisfied. The shipping was also great, I ordered it on the 24th, it arrived on the 26th.",
      "rating": 5.0,
      "verified": true,
      "author": "JTurn",
      "helpful_votes": 3,
      "publication_date": 20190426
    },
    {
      "title": "Pretty happy with this saw",
      "text": "Pretty happy with this saw...definitely an upgrade from my 10\" Ryobi. The 12\" saw makes cutting larger baseboard a lot easier, and this saw has very nice power (it slices through a 2x4 like butter). I like the taller fence, the ease of adjustment (I had to square my blade up to the table as it was 1/2 degree off out of the box), and the smooth movement of the miter deck. I didn't realize that the saw came without the table extensions (need to buy separately) as I think they should be included.",
      "rating": 4.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 7,
      "publication_date": 20160801
    },
    {
      "title": "Works great, but it seems a hit or miss to ...",
      "text": "Works great, but it seems a hit or miss to guess if Dewalt’s dust bag hoses on their equipment will fit the standard shop-vac. I recently bought a Dewalt wood planer whose tube fits perfectly with my shop vac hose. Now I buy this Dewalt and the damn hose is a different size - just a couple of mm too large. Now i have to try to locate some converter to connect the two hoses and do so in a manner that they are a sug fit. Is it so difficult for the Dewalt product designers to settle on one size??",
      "rating": 3.0,
      "verified": true,
      "author": "zMan",
      "helpful_votes": 3,
      "publication_date": 20180507
    },
    {
      "title": "Buddy let me tell u... she WILL CUT!",
      "text": "It’s so badass. Chuck Norris could saw Wolverine in half with this thing. Even Steven seagal is too scared to touch it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Brown",
      "helpful_votes": 8,
      "publication_date": 20180616
    },
    {
      "title": "dependable saw for everyday use",
      "text": "12\" compound miter is the way to go. If you are planning on getting a chop saw spend a couple more bucks and get a 12\" - the extra money is worth it in the long run. This is my second Dewalt chop saw. My first one lasted 12 years - then I accidently dropped it & broke it. They are heavy - around 55 pounds - not fun to move from place to place, however that weight comes in handy when cutting lumber, it keeps the saw in place, less vibration, easier cutting. The saw is great, the compound miter makes easy work of a 2\" x 8\" at 90 degrees. and is great for crown molding",
      "rating": 5.0,
      "verified": true,
      "author": "Will Bean",
      "helpful_votes": 2,
      "publication_date": 20180831
    },
    {
      "title": "Excellent, high quality, heavy duty saw for homeowner or professional use at a price less than the big box stores !",
      "text": "Excellent saw with typical high quality and workmanship typical of DeWalt products. My last one lasted over 25 years. The dust bag is kind of useless as it still blows sawdust everywhere when you use it. It has very precise demarcations for making bevel and angle cuts. It was also more than a hundred twenty five dollars less than the same exact saw at Home Depot !",
      "rating": 5.0,
      "verified": true,
      "author": "TheVermontStooge",
      "helpful_votes": 3,
      "publication_date": 20180117
    },
    {
      "title": "Love this thing",
      "text": "Love this thing! I'm a total woodworking noob, and this has been a great option! My boyfriend figured out how to use this pretty easily, and even my clumsy self has found it to be pretty great. We just built a bookshelf thanks to this wonderful thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Lexie D.",
      "helpful_votes": 2,
      "publication_date": 20180609
    },
    {
      "title": "Rock Solid and Smooth",
      "text": "This is my first compound miter saw and I am impressed! easy to set up and get to know. It is portable but I like it on my roller table to move around. The fence was aligned right and so was the blade. I've cut lumber up to a 4X4 so far and it had no lag issues. I see what everyone recommends a finer blade to prevent the cutting edges from chipping but that isn't because of the saw. This summer I'm rebuilding my yard fence and this will be my saving grace.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Breeding",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "a quality mitre saw by DeWalt.",
      "text": "I rely on this saw for my business and it is used extensively. I have come to trust in DeWalt tools over the years- there aren't many out there that are as durable and long-lived. It is complimented by the DeWalt rolling miter saw stand. I bought them together to make transport easier and am very pleased with both.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Must have.",
      "text": "Rebuilding my docks and decks after hurricane Irma this miter is a must cut 2x6 at 45 perfect saved a ton of cash DIY. Great saw powerfull however, 45 cuts lacked power, other than that excellent. Straight cuts just like cutting butter !! Great price and free shipping. Thank you Amazon ;-)",
      "rating": 5.0,
      "verified": true,
      "author": "Jay & Josh",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Excellant Meter Saw",
      "text": "Have been using my new Meter Saw for a while now and I'm very happy with the product and it's quality. Precise high-end finish quality cuts. Have been a high end carpenter for 30 + years",
      "rating": 5.0,
      "verified": true,
      "author": "Don Miles",
      "helpful_votes": 2,
      "publication_date": 20180601
    },
    {
      "title": "Great Saw! The blade thats included has worked great ...",
      "text": "Great Saw! The blade thats included has worked great on wood and pvc pipes. The only issue I had is no Vacuum attachment. I was able to convert my shop vac using the following item:  and going to local hardware store and purchasing a 1\" rubber hose coupler in the plumbing section.",
      "rating": 4.0,
      "verified": true,
      "author": "Duweeee",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Worth every penny!",
      "text": "Hands down one of the greatest things we've bought for our home renovation. My husband uses this all this time, and says it's much nicer than the one he was borrowing from a friend. The only con: at 15 Amps, we have to use it out in our garage, and not upstairs where we are currently renovation, because the 15 AMP breaker upstairs would overload when we used it. At least we're getting our exercise.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily W",
      "helpful_votes": 3,
      "publication_date": 20161201
    },
    {
      "title": "I made good decision for once",
      "text": "It was a perfect buy. I have read about other brands and how you had to align the angles up. When I got mine it did not need anything adjusted. Made a few cuts and I love everything about it. Words do describe how it feels when you pull down the handle and every cut is on. I worked on the farms for years and am a custom to having to do everything myself.I feel with a little practice I can master more jobs than before. Good buy and worth every penny it cost me.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray56_32223",
      "helpful_votes": 2,
      "publication_date": 20160705
    },
    {
      "title": "Blowing my 20 amp fuse",
      "text": "This saw replaced a 10 year old dewalt of the same size. I like the way it cuts and came set up perfectly out of the box. It, however, is blowing a 20 amp fuse when I first start it about 20% of the time. Nothing else is plugged into this circuit so I'm concluding that this motor is drawing well over its 15 amps at start up. Not sure what next steps are to fix but will have an electrician check the fuse.",
      "rating": 3.0,
      "verified": true,
      "author": "agingeyes",
      "helpful_votes": 2,
      "publication_date": 20180101
    },
    {
      "title": "surprisingly accurate out of the box",
      "text": "Very impressed with this saw. I use a delta made in 1997 I the wood shop, and got this saw to use on site, figuring it wouldn't be as clean cutting, but good enough. I was surprised to find that the miter gauge is nearly perfect on arrival, and the stock blade is even acceptable. I work with a lot of oak and walnut, so smooth cutting is very appreciated. The notches at 22.5,45,&90 are kind of handy when youre working on perfect corners, and the lockdown system is handy for the rest of the time. Amazing value in my opinion, and powerful for its surprising light weight",
      "rating": 5.0,
      "verified": true,
      "author": "Krisp",
      "helpful_votes": 2,
      "publication_date": 20150523
    },
    {
      "title": "and they both work like a champ",
      "text": "My father in law let me borrow his for a couple months. His is several years old, and they both work like a champ. This one has a better angle adjustment. It loses a star, however, because changing blades is unnecessarily difficult. Annoying when you just want to make a couple quick cuts with a finish blade, and it takes a little bit to switch them out.",
      "rating": 4.0,
      "verified": true,
      "author": "Jared J.",
      "helpful_votes": 5,
      "publication_date": 20150723
    },
    {
      "title": "Moulding up to 6-1/2-Inch vertically against the fence - Not really",
      "text": "Bought this saw specifically to cut 6 1/2 inch baseboards however to support DeWalt's claim of supporting cuts of \"base moulding up to 6-1/2-Inch vertically against the fence\" the only way you can do this is to manually lift up the blade guard manually at the start of the cut. Otherwise, the blade guard will hit the wood first. Seems like a dubious specification if you have to manually intervene with the blade guard. The Dewalt manual is a bit lame and wish Dewalt would have more instructional videos for newbies. The instructions to mount the work stand mounts were especially kludgy. Otherwise, a pretty solid machine.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeff B",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Great saw, great price...I don't think the redesign created any problems",
      "text": "I got really nervous when I saw that this had been redesigned at some point and that the \"most helpful\" reviews were pre-redesign...but we got this saw and we love it. It is our first miter saw--we bought it so that we could install baseboards throughout our house, and it has been perfectly accurate and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "GnJ",
      "helpful_votes": 5,
      "publication_date": 20150606
    },
    {
      "title": "Perfect size for 4 x 4s",
      "text": "We love this saw. It's great quality with the functions we needed at a great price. We only do simple angle cuts and still have plenty of exploring to use to see how fancy we can get. We wanted a larger blade to be able to cut through 4 x 4s as opposed to having our lumber store cut everything for us or having to do a two-swipe pass on a table saw. Its near impossible to find such a quality saw with this size blade at a reasonable price. We are very pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Davidson",
      "helpful_votes": 0,
      "publication_date": 20160603
    },
    {
      "title": "Great saw!",
      "text": "I own an older Milwaukee 10\" and a Ryobi 10\" sliding miter saw, both disappoint me when I've trying to cut 4x4s and I've been doing more of that lately. The feel of this saw at least to me is so much better and feels more solid than either of my other miter saws, wishing I would have bought one of these a long time ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Pink Runner",
      "helpful_votes": 3,
      "publication_date": 20160907
    },
    {
      "title": "Saw works great and is durable",
      "text": "Saw works great and is durable. Got this for cutting baseboards and crown molding. Mitre stops are very accurate and lock into position. Bevel stops are easy to set up too. The only issue we have is that the motor will hit moldings taller than 4-1/4 inches when the cut is angled to the left (as shown in the photo). DeWalt makes another miter saw that uses a blet drive to avoid that issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert R Bennett",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Simple, no-frills perfection!",
      "text": "Love, love, love, love! I upgraded/downgraded to this saw from a borrowed orange-brand compound double-bevel saw; unlike the tortuous orange monster, this one came almost dead square out of the box in every dimension - even the angle detents are pretty close I don't cut crown, and I have other tools to cut wide boards - what I need is something that cuts a pretty darn close to perfectly square edge however you measure it.",
      "rating": 5.0,
      "verified": true,
      "author": "The Browns",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Strong Saw",
      "text": "I have recently been renovating my house replacing the flooring and molding. For the first room I did I borrowed a friends 10\" miter saw and determined I needed one for myself. I decided to purchase the Dewalt model due to the brand name, size, and price. I have since completed 2 other rooms in my house using the saw to cut flooring, shoe molding, and crown molding. This saw has never skipped a beat. The blade included does a great job everything i have cut with it thus far. I am far from a carpenter but for me this is a great saw for a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "JLT79",
      "helpful_votes": 4,
      "publication_date": 20130716
    },
    {
      "title": "Powerful motor, used it they day it arrived.",
      "text": "I have been using a much smaller saw for years and didn't know what I was missing out on till I used a friends 12\" Dewalt saw. I came home and ordered one for me, plus the smaller of the stands offered. I already have a couple projects planned. No more placing the saw on the ground for me.",
      "rating": 5.0,
      "verified": true,
      "author": "KenFish",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "Dewalt Winner - accurate cuts and easy to adjust",
      "text": "This is a heavyweight, large saw that does a really clean cut. I bought a pair of extra blades - more teeth and less teeth - but I haven't opened them yet because the standard blade is great, It's a little heavy moving it around but I gladly put up with that in return for the solid, safe feel. I built a queen size bed frame with bookshelves and found the miter cuts were perfect. I think I'm going to love this saw in 10 years as much as I do after 6 months. This saw replaces a 10\" miter saw and the 12 inch blade is really worth the extra.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy Bee",
      "helpful_votes": 3,
      "publication_date": 20140103
    },
    {
      "title": "High quality meets good value.",
      "text": "High quality saw if you don't need the cut capacity of a sliding saw. It is single bevel but in the years I had my old saw I never used it once to cut compound miters. Also the non-sliding feature allows you to place the saw closer to a wall. Dust collection is good but not great.",
      "rating": 5.0,
      "verified": true,
      "author": "T. McGrew",
      "helpful_votes": 2,
      "publication_date": 20180117
    },
    {
      "title": "great saw",
      "text": "As with all things Dewalt it's a quality tool. I use the higher end models all the time at work and decided it was time to get one for home use since I finally purchased a house. The casting is a little rough in a fee places so 4 stars but other than that I can't complain.",
      "rating": 4.0,
      "verified": true,
      "author": "mrtdrew",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Nice saw.",
      "text": "Not to anyone buying this unit, it is now the version 3 unit, it will not accept the Dewalt laser line adapter kit. but there are others that will fit it, for less money I might add. Nice saw.",
      "rating": 4.0,
      "verified": true,
      "author": "shopperNE",
      "helpful_votes": 3,
      "publication_date": 20170813
    },
    {
      "title": "Nice quality saw.  Easy to use once I got over the intimidation of it.",
      "text": "I'm a woman in my 50s and installed crown molding in six rooms myself with this. Very quick and easy to adjust. Heavy and bulky to store, but great for a shop. Buy a dust hood with a dedicated 2 gallon shop vac with an additional extra long 6-8' hose. Still dusty but hood captures 80% of the dust. Without it - it's like the 1930s dust bowl!",
      "rating": 5.0,
      "verified": true,
      "author": "M. McCabe",
      "helpful_votes": 4,
      "publication_date": 20150523
    },
    {
      "title": "A super good saw",
      "text": "This is a beast of a cutter. Cuts so easy through all the pieces we tried. Wasn't easy to switch out the blade though, unclear instructions didnt hep that. Little vacuum bag helps a little but you are still going to have dust everywhere",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie L. Mills",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Wrong product",
      "text": "I purchased this and sent it back because it was not the one I wanted. I needed one that would slide to cut a true 12\" and do 45 degree on both directions. The product is good just didn't fit my needs.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris Elliott",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Awesome, Simple, Long-Lasting Saw",
      "text": "This is my second Dewalt compound miter saw, and I couldn't be happier with their saws! I've used them to cut just about everything under the sun, from small trim work to siding to fencing to larger framing pieces. While Dewalt (and other brands) offer dual-bevel saws and sliding compound miter saws, I'm still fond of this simpler compound miter saw without the sliding rails. In the rare moments when I need to cut a very wide board -- and this doesn't happen to me that often -- I simply flip it. Same thing with miter cuts -- I just move my work around to work with the saw. Again, this saw is a workhorse. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Spencer in Seattle",
      "helpful_votes": 0,
      "publication_date": 20140929
    },
    {
      "title": "SUPER happy with this saw",
      "text": "I bought the saw because the cost to rent a similar one for a weekend was only a little less but with this saw, I ended up cutting and installing nearly 300 linear feet of baseboards in one day. Now I have a line of neighbors wanting to borrow it. Easy to set up and attach to your stand. Easy to operate. I love the 5-second brake feature and it comes with a little bag you can place over the exhaust to help control dust.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Rebello",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "I now have three off these it is a fantastic saw! I have used the to build 1 ...",
      "text": "I now have three off these it is a fantastic saw! I have used the to build 1 house and to finish 2 others. May have to retire the old one I used this one to cut stone siding and it was not made for that. I have many Dewalt tools and can't say anything bad about any of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Nettie",
      "helpful_votes": 2,
      "publication_date": 20170106
    },
    {
      "title": "Wont cut 1x6 standing against fence right 45",
      "text": "Saw cuts great. I bought the 12 inch specifically to cut 1x6 base. The issue I have is that it wont cut a right 45 with more than 2 inch waste without bottoming out on the motor. It cuts left 45 1x6 base no problem standing against the fence it may cut narrow molding at 6 inches but not 1x6",
      "rating": 3.0,
      "verified": true,
      "author": "Mat",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Good value for the money",
      "text": "Miter saw is well designed and does the job as expected",
      "rating": 5.0,
      "verified": true,
      "author": "Zain",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Outstanding multi-use durable saw.",
      "text": "Just as advertised! Durable, flexible & eliminated the need for a chop saw as well. Handy and easy to move & use. Multi-purpose saw.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Horton",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "A+",
      "text": "It’s a dewalt. I’ve taken pics and had visitations to se it. Most of all the all aluminum frame is easy to move, it’s still a bit heavy but if you’re in this trade y’all will manage.",
      "rating": 5.0,
      "verified": true,
      "author": "Rochell Czigler",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "No problem just happy.",
      "text": "This is a great machine it is fast easy to move while working. I am not a professional carpenter just a home owner that likes to do things myself. Was working on my deck which is quite large 2x4 2x6 and 4x4 no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill K",
      "helpful_votes": 4,
      "publication_date": 20150923
    },
    {
      "title": "Left handers -- a saw for you!",
      "text": "a little cumbersome, but the only one I found for left handers",
      "rating": 4.0,
      "verified": true,
      "author": "Marianne Matacale",
      "helpful_votes": 3,
      "publication_date": 20170524
    },
    {
      "title": "Great saw for the money",
      "text": "This being my first miter saw I am very happy with it. It came dialed in with perfect 90 degree cuts and I have used it a lot doing semi custom furniture. Everything was in the box as expected. The power of the motor is very good and cuts with ease. In the future I think I need to upgrade the blade but so far so good. I did have to re tighten the blade because it came loose after awhile.",
      "rating": 5.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "Good bang for the buck.",
      "text": "I researched several saws, and although I am not an expert, I have been able to complete all my \"to do\" projects with this. It makes cutting easy, and I feel safe using the saw--I like the safety features. I ended up anchoring the saw into my workbench in the garage and have used it to install baby gates, build a fence gate, and cut molding.",
      "rating": 5.0,
      "verified": true,
      "author": "mercuryvalTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "I am very happy with the power the saw has",
      "text": "My review can be taken with a grain of salt, as I don't have much Miter Saw experience. That being said, I am very happy with the power the saw has. Cuts wood with remarkable ease. I was a little surprised how much of a mess it made still with the sawdust, even the with the bag, but with the way miter saws are designed, I don't think it's completely avoidable. I think the sawdust bag collects about 50/50 of what the saw throws behind it. The miter gauges move with ease and I have zero complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170428
    },
    {
      "title": "The saw works great.",
      "text": "I have been making furniture for years, but I was using by table saw for everything. This is much easier to use when cutting off long boards. I have used this for several projects already, and I can't believe that I didn't buy a compound miter saw before.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "SAW DIED AND SMOKED first time i used it!!!",
      "text": "I used this for the first time, (mind you I am a skilled carpenter)... and it smoked and stopped working!!!! There is a default for sure... Please help!!",
      "rating": 1.0,
      "verified": true,
      "author": "Toddv",
      "helpful_votes": 2,
      "publication_date": 20190202
    },
    {
      "title": "DeWalt quality",
      "text": "I am biased, I will typically only buy DeWalt and have done so for years. Made a few adjustments to get it perfectly square. Cuts very smooth, plenty of power",
      "rating": 5.0,
      "verified": true,
      "author": "10thmountainman",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Definitely a nice work in tool",
      "text": "Before this one I had a Ryobi it worked pretty good and held up very nice but the accuracy wasn’t there anymore so I bought this dewalt been very very happy works great",
      "rating": 5.0,
      "verified": true,
      "author": "Joey",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "DEWALT DW715 15-Amp 12-Inch Compound Miter Saw",
      "text": "Never owned a Miter saw, and did a lot of research before purchasing this particular make and model. Love everything about it. Solidly built, ease of adjustment and use are outstanding, and dead on accurate right out of the box, with no adjustments necessary. Should last this lifetime and into the next.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert M",
      "helpful_votes": 4,
      "publication_date": 20140607
    },
    {
      "title": "Solid Saw",
      "text": "It works. Fairly clean cuts. Good saw if you are just getting into wood working and you want something new.",
      "rating": 4.0,
      "verified": true,
      "author": "Grant",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "It does what it is supposed to do.",
      "text": "It should come with hold down clamps for the premium price and reduce feature sets that the competitors provide. I do like the fact you just pull the trigger to run the thing. No secondary safety actions needed.",
      "rating": 4.0,
      "verified": true,
      "author": "SA",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Inaccurate",
      "text": "Very inaccurate. Had base fence replaced and still the same issue of it not being square to the fence all the way through a cut. Dewalt is impossible to deal with. They want you to send the saw to them for a 2-3 week service turnaround. Never again.",
      "rating": 1.0,
      "verified": true,
      "author": "brandon s.",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "... saw to cut crown molding and it worked with fantastic results. The built in stops for the angles ...",
      "text": "I bought the miter saw to cut crown molding and it worked with fantastic results. The built in stops for the angles make cutting crown easy. The bag does a great job collecting the saw dust making clean up a snap. The only compliant with the tool is the back fence on the right side not being the same as the fence on the other side. I am not sure if there is a reason for the design but I couldn't figure it out. The cuts from the saw are clean and it inspired me to take on other tasks around the house. The build quality is solid and should last me for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Conrad",
      "helpful_votes": 2,
      "publication_date": 20140729
    },
    {
      "title": "Perfect",
      "text": "I love the Dewalt brand! This is a great saw. I'm gearing up to finish our basement so I will do a full review when that is finished. I've done a few little projects with it. Cuts like a hot knife through butter.",
      "rating": 5.0,
      "verified": true,
      "author": "Nate Kobs",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Great saw for the price.",
      "text": "Good purchase. Saw works great, has a good miter box that is accurate and easy to use. Blade brake is a little weak, takes about 3 seconds to stop the blade.",
      "rating": 5.0,
      "verified": true,
      "author": "Best Diner in America",
      "helpful_votes": 0,
      "publication_date": 20170701
    },
    {
      "title": "NO REGERTS!",
      "text": "Great saw. I mounted a Oshlun LG-M01 laser guide in about 5 minutes and now its perfect. Highly reccomend. NO REGERTS! (I was eating a milkyway)",
      "rating": 5.0,
      "verified": true,
      "author": "TheGoat",
      "helpful_votes": 3,
      "publication_date": 20160422
    },
    {
      "title": "I like it",
      "text": "One of my better buys. If you need a straight cut, this gives one every time. From cutting small angled pieces to level out my front porch steps, to cutting dowels to length to repair, a clothes rack. Any wood working job you do is helped by this tool. I just mentioned two jobs, but really can't count the good use I got from this tool. Worth it's weight. Might be better versions out there, even from DeWalt, but for the price it does great work.",
      "rating": 5.0,
      "verified": true,
      "author": "wrygrass",
      "helpful_votes": 0,
      "publication_date": 20140520
    },
    {
      "title": "Yum",
      "text": "When people slice a hot knife through butter, they say \"It's like a DEWALT DW715 15-Amp 12-Inch Single-Bevel Compound Miter Saw through wood.\" This thing is a dream. I'd buy two if I had any good reason to.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Gershman",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "I looked and compared to many other brands up to ...",
      "text": "I looked and compared to many other brands up to $1000.00 and the rating for this dewalt made my choice for me .",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Davis",
      "helpful_votes": 2,
      "publication_date": 20170207
    },
    {
      "title": "Saw is really nice, the blade that comes with should basically only ...",
      "text": "Saw is really nice, the blade that comes with should basically only be used for pine in my opinion. If you're cutting hard wood do yourself a favor and get a blade with more teeth per inch",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Quality",
      "text": "My hubby swears by this brand. It is high quality and sturdy",
      "rating": 5.0,
      "verified": true,
      "author": "sallee decker",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Great saw",
      "text": "Just the saw I was looking for and a good value. I use for home use but I suspect that if used for heavy duty contracting it might not be sturdy enough to last a long time.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Great saw for home reno projects and crafts",
      "text": "This is the best all in one saw for household projects. The kids did all the baseboards with this saw, making both straight cuts and angled cuts precisely. Very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "chantaldespoir",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Love this saw",
      "text": "Cannot beat the price and has all the features I need. Top quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Bwana Dave",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Best saw under 400",
      "text": "Hands down the best saw at this price point. It doesn't have any fancy features, but if you just need a solid saw this is the one!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "12 inch dewalt miterbox",
      "text": "These saws have been around for a long time and this is my third over 16 years. Moving them around and others mistreating them is the only reason I had to replace a few.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly R. Timmerman",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "Very happy customer",
      "text": "Good, solid, well constructed tool. Item is exactly as described. Comes with the construction blade, I ordered a finish blade for the more delicate cuts. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "J287B153",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Perfect! I'm somewhat of a tool snob",
      "text": "Perfect! I'm somewhat of a tool snob. I grew up working with my dad on many different projects and you learn quickly that only the best tools hold up well. He has always used a Dewalt miter saw (although bigger than the one I bought) and we have always had excellent results from his Dewalt tools. This saw is no different. When I went in search for a miter saw for my husband, Dewalt is where I started looking. My husband loves it, works perfectly, measurements are so exact. Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Lord",
      "helpful_votes": 3,
      "publication_date": 20141228
    },
    {
      "title": "Using this is WAY better than cutting by hand",
      "text": "Using this is WAY better than cutting by hand. Powerful, fast, and functional. I am not a carpenter or anything, but as a homeowner, I am finding good uses for this, and most assuredly it paid for itself with its first job (I purchased it to replace my back deck myself... purchasing materials is always less than materials plus labor!).",
      "rating": 5.0,
      "verified": true,
      "author": "i like to fish and hunt",
      "helpful_votes": 0,
      "publication_date": 20150702
    },
    {
      "title": "great price",
      "text": "great product, built great Very durable easy to use and not to heavy. and all attachments fits great well built lone it",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel J Newpower Jr",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "For the price it is a great saw. I've used it to cut boards for ...",
      "text": "For the price it is a great saw. I've used it to cut boards for all sorts of 'outdoor-grade' projects. From gardening benches to concrete forms. If you want a cleaner cut then buy a better blade. The design details are better than the Bosche and Makita competition that charge much more. The ability to extend to 48 degrees means you won't waste as much wood when your measurements are less than perfect. Alot of thought went into this saw. The motor is smooth and the action is easy. Very very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "craig Erickson",
      "helpful_votes": 0,
      "publication_date": 20141001
    },
    {
      "title": "Great product and value",
      "text": "Excellent saw. Wish I had bought it years ago. Easy to set up and use. Would like to buy a 12 inch 80T blade",
      "rating": 5.0,
      "verified": true,
      "author": "Uni Dog",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Worth the money!",
      "text": "Wow. I was going to buy the top rated Hitachi 10\" saw. I went to Lowes to check out both saws. GLAD I bought the Dewalt. Lowes price was $299, Amazon $239. No kidding. It came UPS, I opened the box, put the dust collector on, plugged it in and started cutting!!!! More solid than the Hitachi, cuts taller baseboard, 12\" vs Hitachi 10\". Yes, it cost another $100, but it's well worth it in the long run.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark S.",
      "helpful_votes": 2,
      "publication_date": 20150303
    },
    {
      "title": "Dewalt is probably the best miter saw on the market and has been for ...",
      "text": "Dewalt is probably the best miter saw on the market and has been for many years. I have used about every brand there is over the past 20 years. They just keep on cutting if you take care of them . You will get many years of percision cuts if you keep a sharp blade on it and keep it blown off after use.",
      "rating": 5.0,
      "verified": true,
      "author": "sam",
      "helpful_votes": 0,
      "publication_date": 20150811
    },
    {
      "title": "Quality product!",
      "text": "Like my experience with other Dewalt products this saw is great for the price point.",
      "rating": 5.0,
      "verified": true,
      "author": "Goodneighbor",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Dewalt is awesome",
      "text": "I swear by Dewalt! I bought mine a while back and it still works great",
      "rating": 5.0,
      "verified": true,
      "author": "kevin scarbrough",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Good saw",
      "text": "Been very HAPPY with saw good bargain for the price",
      "rating": 5.0,
      "verified": true,
      "author": "kristine hart",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Great saw",
      "text": "I love this saw-very handy for moulding / trim work. Glad I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Geary Buchanan",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Five Stars",
      "text": "Upgraded from my harbor freight miter saw and it is a world of difference! Much more accurate!",
      "rating": 5.0,
      "verified": true,
      "author": "FoShuo",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "DW715 12 in Miter saw",
      "text": "I'm a plumber and this miter saw is excellent for pipe cutting applications",
      "rating": 5.0,
      "verified": true,
      "author": "phil",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Great saw",
      "text": "Great saw. It easily handles anything that I throw at it. It is the perfect addition to any workshop.",
      "rating": 5.0,
      "verified": true,
      "author": "dustin vaughan",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Cuts Wood Like Butter",
      "text": "I chose to get the single bevel compound instead of the double and invest in a very good portable stand (DeWalt DWX726). Even before replacing the standard saw blade with an 80T blade, it cut with minimal effort. It also stops almost instantly which I like. The dust collection could be better (VERY small bag) but I expect to get and adapter and attach to my wet/dry vac.",
      "rating": 4.0,
      "verified": true,
      "author": "Lex Ink",
      "helpful_votes": 2,
      "publication_date": 20131229
    },
    {
      "title": "Quality tool and easy to use",
      "text": "Quality tool and easy to use. It's best to remove the blade guard altogether. It almost impossible to change the blade or see what you are doing with it attached.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenton D Miller",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "great saw",
      "text": "My first saw. I am not a pro, but believe in buying what I can afford and jumped when this went on a brief sale. Accurate out of the box and delivered w/o a problem. Making some saw horses now and it is nice to finally be able to make accurate straight cuts! I got the rolling miter saw stand and cannot stress enough to get that over the fixed one. Setting this up a breaking it down are a snap and it can be stored upright.",
      "rating": 5.0,
      "verified": true,
      "author": "horase",
      "helpful_votes": 2,
      "publication_date": 20130711
    },
    {
      "title": "Amazing Customer Service!!",
      "text": "I had an issue with the item (not functional) and Amazon and DEWALT offered customer service way beyond what was expected. I will be a lifelong DEWALT customer! Thank you!!",
      "rating": 5.0,
      "verified": true,
      "author": "SPB",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Super high-quality",
      "text": "This is an amazing saw. I believe it outperforms any of its competitors that I have used in the past. I would highly recommend this tool over any brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Martyn",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Wish I had it Earlier",
      "text": "I wish I had it last year! Making job a lot easier!",
      "rating": 5.0,
      "verified": true,
      "author": "Reiley",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "Always like Dewalt",
      "text": "I have 2 - 10' compound miter saws and 1 - 12\" double bevel slide saw. The slide saw is a bit bulky to take to jobsite each day and the new 12\" will work great for doing tall baseboards. Others on crew have to constantly bevel for miters and then stand back upright for straight cuts where I can just turn the table. All 4 of my Dewalt saws are still working and all are still being used. Would not even consider another brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Stc2581",
      "helpful_votes": 0,
      "publication_date": 20140108
    },
    {
      "title": "What’s not to love!",
      "text": "This is an awesome saw! I’m using it to build a storage unit and I used it for movie light boxes. Don’t think just click buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony P.",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "and I'm glad I did",
      "text": "After spending WAY too much time researching this purchase, I would up buying this one, and I'm glad I did! It was between this and a 10\" slider. I wanted the ability to cut big crowns, and both saws did, but given the price difference, I decided on the DW715. It truly is a beautifully built workhorse, and I'm sure I'll get years of use out of it",
      "rating": 5.0,
      "verified": true,
      "author": "Rhythmking",
      "helpful_votes": 0,
      "publication_date": 20160505
    },
    {
      "title": "LOVE",
      "text": "LOVE my new saw! I just finished redecorating my home office. I had lowes rip the plywood but used my new saw to cut the lengths!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Suter",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "impressed with this saw, features that I needed works ...",
      "text": "impressed with this saw, features that I needed works well, bought the stand for it at Homedepot and the Crown stops from Amazon.com. I was hesitant at first because of the low price (you get what you pay for) however, I was convinced my very first day of using the saw.",
      "rating": 5.0,
      "verified": true,
      "author": "Art Adams",
      "helpful_votes": 0,
      "publication_date": 20170202
    },
    {
      "title": "Better than my 12 year old Ryobi ever did",
      "text": "Cuts wood very well. Better than my 12 year old Ryobi ever did, even before the ryobi fell off my saw horses and broke.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Consumer",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Works great",
      "text": "I use this to cut down my wood for the stove, getting too old to use the chainsaw",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Great saw - easy to use!",
      "text": "I used this saw to build a gate and have many future projects. Easy to use! Delivered to the front door!",
      "rating": 5.0,
      "verified": true,
      "author": "Two Five One",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "... month while finishing a basement and it has worked amazing paired with the Dewalt miter saw stand DWX724",
      "text": "I have been using this for about a month while finishing a basement and it has worked amazing paired with the Dewalt miter saw stand DWX724.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180319
    }
  ],
  "product_meta": {
    "title": "DEWALT DW715 15-Amp 12-Inch Single-Bevel Compound Miter Saw (Discontinued)",
    "description": "Adjustable stainless steel Miter detent plate with 11-positive stops delivers repeatable accuracy and worksite durability. Tall sliding fence supports crown molding up to 5-1/4\" nested and base molding up to 6-1/2\" vertically against the fence while easily sliding out of the way for bevel cuts. 0-48 degree to the left and 0-3 degree to the right for increased capacity. 0-50 degree left and right Miter capacity for greater versatility. Cam lock Miter handle with miter detent override deliver Quick, accurate Miter angles. Hardened steel bevel stops at 0, 33.9, 45 and 48 degrees. Lightweight with built-in carry handle for easy portability. Standard equipment: carbide blade, extension kit, dust bag, blade wrench. Specifications: 15.0 amps, 4, 000 RPM No load speed, 12\" blade diameter, 5/8 or 1\" Arbor size, 6-1/2\" vertical capacity baseboard against fence, 5-1/4\" vertical capacity crown molding vertically nested, 8\" horizontal capacity baseboard lying flat, 6-1/2\" horizontal capacity crown molding lying flat, 2 x 8\" for 45 degree bevel cut capacity (dimensional lumber), 2 x 8\" for 90 degree cross-cut capacity (dimensional lumber), 2 x 8\" Max width for 90 degree cross-cut capacity, 4 x 6\" dimensional lumber Max height for 45 degree miter cut capacity, 2 x 6 dimensional lumber Max width for 45 degree miter cut capacity, 42 lbs. Tool weight. 15 amp motor, 4, 000 RPM delivers extended power and durability. Stand not included.\n\nAMAZON.COM\nWhether you're cutting baseboards or crown molding, the DEWALT 12-Inch Single-Bevel Compound Miter Saw provides quick, accurate cuts for the job. Thanks to a powerful motor and convenient features, this compound miter saw is ready for a range of crosscutting and miter-cutting applications. In addition, it comes with a durable carbide blade, a blade wrench, and a convenient dust bag.\n\n\n\nSmart, Powerful Design for Quick, Accurate Cuts\nThis DEWALT single-bevel compound miter saw's 12-inch blade is backed by a powerful and dependable 15 amp motor. Offering a no-load speed of 4,000 rpm, it makes quick work of cutting framing or molding, as well as other crosscutting and miter-cutting jobs.This sturdy saw is designed to deliver both a versatile setup and excellent accuracy to handle a variety of applications. The precise miter system's adjustable stainless steel miter detent plate features 11 positive stops for easy setup and improved productivity. An easy-to-adjust cam-lock miter handle delivers quick and accurate miter angles, as well as allowing for detent override--which allows you to adjust the miter setting without the saw slipping into the miter detents. The saw's wide miter capacity--0 to 50 degrees to the left and the right--adds versatility.\n\nIn addition, a tall fence supports 5-1/4-inch crown molding nested vertically, as well as 6-1/2-inch base molding set vertically against the fence. This fence slides out of the way easily when it's time to make bevel cuts.\n\nIncreased Bevel Capacity and Convenient Stops\nThis DEWALT saw is designed to deliver quick, accurate bevel cuts. Ideal for a range of applications, the saw can deliver clean, 45-degree bevel cuts through dimensional lumber that measures up to 2 by 8 inches.\n\nIt also allows you to setup for bevel cuts that measure between 0 degrees and 48 degrees to the left and bevels that measure between 0 degrees and 3 degrees to the right, providing increased capacity for big jobs. Plus, with hardened steel bevel stops at 0, 33.9, 45 and 48 degrees, this saw delivers versatility and makes finding and setting the most common bevel angles a quick and easy process.\n\nPortable and Easy To Transport\nThis lightweight compound miter saw weighs just 42 pounds and features a built-in carry handle, so you can move it around the jobsite easily and lift it comfortably when it comes time to stow the saw at the end of the day.\n\nThis 12-inch single-bevel compound miter saw also comes with a DEWALT warranty package that includes a three-year limited warranty, a one-year free service contract, and a 90-day money back guarantee.\n\nWhat's in the Box\nDEWALT 12-Inch Single-Bevel Compound Miter Saw, carbide blade, dust bag, and blade wrench.\n\n\n\n\n\n\n\nFROM THE MANUFACTURER\nThe DW715 is powered by a 15 Amp motor and comes equipped with a 12-inch carbide blade which spins at 4,000 rpm. Accuracy is a critical component for a solid miter saw and the DW715 delivers. The DW715 incorporates an adjustable stainless steel miter detent plate with 11 positive stops for the most common miter cuts. The saw features a miter detent override which allows the user to override the miter stops and adjust to the miter setting desired without the saw slipping into the miter detents while the new precise miter system delivers more repeatable and accurate miter angles. The cam lock miter handle eliminates the need to twist the miter handle to lock in on the miter angle and delivers a quick and solid miter lock. The innovative machined base fence design delivers long term fence straightness by providing additional support to the fence. The DW715 delivers the capacity to cut up to 6-1/2-inch base molding against the fence when mitered to the left and crosscut capacity up to 2 x 8 dimensional lumber.\n\nSee more",
    "rating": 4.8,
    "feature_bullets": [
      "Includes: a carbide blade, dust bag, blade wrench and comfortable side handles in the base",
      "Miter detent override that allows you to override the miter stops and adjust to the desired setting without the saw slipping into the miter detents",
      "Adjustable stainless steel miter detent plate with 11 positive stops",
      "Tall sliding fences that support crown moulding up to 5-1/4-Inch. nested and base moulding up to 6-1/2-Inch vertically against the fence while easily sliding out of the way for bevel cuts",
      "Crosscut capacity up to 2x8-Inch dimensional lumber",
      "Bevels to the left up to 48° and to the right up to 3°, with positive stops at 0°, 45° and 33.9° for cutting crown moulding laying flat",
      "4 hardened steel bevel stops at 0°, 33.9°, 45° and 48° that delivers versatility at most common bevel angles",
      "Cam lock miter handle with miter detent override that eliminates the need to twist the handle to lock in on the angle"
    ],
    "specifications": {
      "Manufacturer": "Dewalt",
      "Part Number": "DW715",
      "Item Weight": "47 pounds",
      "Product Dimensions": "26.1 x 19.6 x 17.2 inches",
      "Item model number": "DW715",
      "Is Discontinued By Manufacturer": "No",
      "Size": "1\", 5/8\"",
      "Color": "Discontinued model",
      "Style": "Discontinued model",
      "Material": "Steel",
      "Power Source": "Electric Powered",
      "Item Package Quantity": "1",
      "Measurement System": "Metric",
      "Included Components": "Power Miter Saw, Construction - Power Saws, Miter Saws",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "90 Day Money Back Guarantee, 1 Year Service Contract, 3 Year Limited Warranty",
      "ASIN": "B000ASBCK4",
      "Customer Reviews": "4.8 out of 5 stars964 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#152,353 in Tools & Home Improvement",
      "Date First Available": "September 14, 2004"
    },
    "categories": [
      "Saws",
      "Power Tools",
      "Miter Saws",
      "Tools & Home Improvement",
      "Power & Hand Tools"
    ],
    "price": ""
  }
}