{
  "website_summaries": [
    {
      "verdict": "Canon's i70 provides the best, and most expensive, marriage of speed, design, and print quality that we've seen in a portable printer.",
      "pros": [
        "Fast and quiet",
        "prints high-quality text and graphics",
        "well-rounded software bundle",
        "very compact",
        "great instructions"
      ],
      "cons": [
        "Unimpressive photo printouts",
        "USB cable not included",
        "battery and cradle costs make it expensive",
        "high ink cost"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 7.0,
        "Performance": 8.0,
        "Support": 9.0
      },
      "publication_date": 20030313,
      "rating": 7.9,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Very disappointed. My Canon i70 had a driver problem ( ...",
      "text": "Very disappointed. My Canon i70 had a driver problem ( ratatatattattatatat ) The printer I got from the seller (on time) has the same rattattatatatt. I had high hopes. When this printer works, it does a good job. I don't know what to do now. Can you help me? Sharon Lower",
      "rating": 1.0,
      "verified": true,
      "author": "sharon c. lower",
      "helpful_votes": 0,
      "publication_date": 20150418
    },
    {
      "title": "Simply Amazing",
      "text": "I have a 12\" G4 PowerBook and wanted a portable printer for the cabin and other remote locations. Saw the i70 at the Apple Store and knew I had to have it. Tried it out this weekend and am VERY impressed with it's speed and quality of print. Also amazed at the minimal size and weight...about the size of a hardcover book. All in all, it seems like the PERFECT portable printer for a laptop owner.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Matson",
      "helpful_votes": 5,
      "publication_date": 20030727
    },
    {
      "title": "My experience with my I-70 printer.",
      "text": "The machine was shipped to me with no power or printer cables in the box. Also, although the Amazon web site represented the printer as being new, there were used ink cartridges already installed. Fortunately, as I was replacing my existing I 70 that I have had for over 7 years, the same cables worked. It would be nice to receive an adjustment from Amazon. Gary Skelton",
      "rating": 1.0,
      "verified": true,
      "author": "Lee Childs fan",
      "helpful_votes": 0,
      "publication_date": 20131104
    },
    {
      "title": "The printer is defective",
      "text": "I am returning the item. Hopefully I will get a refund. These items are best purchased brand new. thank you",
      "rating": 1.0,
      "verified": true,
      "author": "Anand Devadas",
      "helpful_votes": 0,
      "publication_date": 20140218
    },
    {
      "title": "I 70 PRINTER",
      "text": "SMALL, COMPACT, PRINTS OUT PERFECT. GREAT RESOLUTION IN PHOTOS. WOULDN'T HAVE ANY OTHER. DOES THE JOB RIGHT. YOU WOULD BE VERY PLEASED WITH THIS PRINTER'S PERFORMANCE.",
      "rating": 5.0,
      "verified": true,
      "author": "LQDPRZC",
      "helpful_votes": 0,
      "publication_date": 20100722
    },
    {
      "title": "Its a real dog",
      "text": "It only lasted a few months then it crapped out. Not even long enough to have to replace the ink.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard Motter",
      "helpful_votes": 0,
      "publication_date": 20130501
    },
    {
      "title": "Perfect replacement",
      "text": "I had a Canon i70 stop working on me and to get it repaired would cost much more than getting a new printer. I found this item online to replace my dead one and have been happy with it ever since!",
      "rating": 5.0,
      "verified": true,
      "author": "tkbanks1",
      "helpful_votes": 0,
      "publication_date": 20120413
    },
    {
      "title": "Doesn't work properly",
      "text": "This printer won't print in black - I replaced the ink cartridge and it helped a little but not enough",
      "rating": 1.0,
      "verified": true,
      "author": "Fyfer",
      "helpful_votes": 0,
      "publication_date": 20130322
    },
    {
      "title": "Doesn't include a connection cable",
      "text": "I bought this printer based off the reviews here and the magazines reviews that I read this would be a great buy. Upon purchasing this I was amazed that printer didn't included a cable to connect to the computer or any of the hardware that they talk about being able to connect. So I had to go out and purchase my own USB cable just to finish install this piece of hardware to my computer. After that this thing worked like a champ! No major complaints. So if you are seriously intrested in purchasing this you should consider purchasing a USB cable to connect to this to your computer.",
      "rating": 3.0,
      "verified": false,
      "author": "Charles B.",
      "helpful_votes": 6,
      "publication_date": 20030815
    },
    {
      "title": "CHEAP Ink Cartridges",
      "text": "In addition to all of the other \"Kudos\" awarded to this printer by the other reviewers, I want to add the following. While the price of \"Genuine Canon\" ink cartridges may (does) border on outright robbery, you DON'T have to buy them. Compatible cartridges are dirt cheap at places like \"inkquik.com\". If you buy a refill kit from say, \"abcink.com\", you can refill your own for pennies each. I do, they are VERY easy to refill, work as good as new, and canon even gives you a \"Reset Ink Level\" option under the print driver \"maintenance\" section. YAY Canon -- DOWN for HP !!!!",
      "rating": 4.0,
      "verified": false,
      "author": "Al Jenke",
      "helpful_votes": 0,
      "publication_date": 20070907
    },
    {
      "title": "VERY PORTABLE - INK RUNS DRY FASSSSSSSSTTTTTTTT",
      "text": "I am a real estate agent and use this printer to print out contracts from my laptap. It fits in the front flap of my carrying case, hence negating the need for another bag. Slick, prints fast and easy to set up. Here are some cons: - Infrared sometimes does not \"connect\" as fast - Ink dries up FAST!! Granted my contracts are lengthy, but I can't get thru one complete contract (about 25 pages) without it drying up on me. Besides the two complaints listed above, it is great.",
      "rating": 4.0,
      "verified": false,
      "author": "S. Chin",
      "helpful_votes": 16,
      "publication_date": 20030519
    },
    {
      "title": "Very, Very Good",
      "text": "I love this printer for photos, it prints so well that you can't tell they aren't from a photo developing store.",
      "rating": 5.0,
      "verified": false,
      "author": "Moses on the Hill",
      "helpful_votes": 0,
      "publication_date": 20081212
    },
    {
      "title": "Small Printer-Big Success",
      "text": "I needed a small portable printer for my laptop, and after researching them, I chose the Canon i70. It has all of the attributes I needed-lightweight,super easy to use, fast as the office rumor mill, and a great print job. I highly recommend this product to anyone fortunate enough to have purchased it.",
      "rating": 5.0,
      "verified": false,
      "author": "Marilyn Smith",
      "helpful_votes": 5,
      "publication_date": 20040614
    },
    {
      "title": "Great little printer",
      "text": "I've had this printer for 9 months and its been great. 2 complaints: it runs out of ink quickly and the ink for this printer is expensive; 2) there is no paper catch.",
      "rating": 5.0,
      "verified": false,
      "author": "LifeasJoanna",
      "helpful_votes": 5,
      "publication_date": 20040909
    }
  ],
  "product_meta": {
    "title": "Canon i70 Color Bubble Jet Printer",
    "description": "MODEL- I70 VENDOR- CANON COMPUTER SYSTEMS INC FEATURES- i70 Color Bubble Jet Printer The Canon i70 Color Bubble Jet Printer delivers a remarkable combination of high-performance and portability. Its capable of printing up to 13 ppm in black and up to 9 ppm in color while achieving a resolution of up to 4800 x 1200 color dpi. Try finding that speed and resolution in another portable printer. Plus Canon advanced MicroFine Droplet Technology uses a revolutionary nozzle system that ejects consistent prescribed-volume droplets in microscopic sizes with incredible accuracy.\n\nAMAZON.COM\nA versatile mobile color printer, the Canon i70 Color Bubble Jet sports an attractive price tag and is ideal for a wide variety of home and office uses. A 600 x 600 dpi resolution (black) and 4,800 x 1,200 dpi resolution (color) combine with a total of 704 print nozzles, resulting in bright, crisp, and detailed prints. Print speeds are an impressive 13 ppm black and white and 9 ppm color, while photo-quality 4-by-6-inch prints take as little as 90 seconds.\n\n The i70 connects via USB, parallel port, or CompactFlash Type II slot for easy interfacing, and can print from supported Canon digital cameras and camcorders, with or without a PC. Both Windows and Mac drivers are included; and for PCs only, wireless infrared IrDA printing is available with Windows-compatible devices.\n\n Truly mobile, this lightweight printer (4 pounds) fits nicely into most briefcases, measuring just 12.4 by 6.9 by 2.0 inches when closed. You can run the i70 with the included AC power adapter or buy the optional Portable Kit, which includes a lithium ion battery rated for 450 pages per 2-hour charge and a battery holder to charge the battery while attached to the printer.\n\n A wide variety of paper types are supported, including envelopes, glossy photo paper, matte photo paper, transparencies, T-shirt transfers, and more, as well as paper sizes from 4 by 6 inches to A4. The software bundle helps users get the most out of their prints with Easy-PhotoPrint, Easy-WebPrint, PhotoRecord, ZoomBrowser EX, ImageBrowser, and PhotoStitch. Epson also provides a one-year limited warranty. \n\n What's in the Box\nPrinter, sheet feeder, paper tray, power supply and cord, BCI-15 black ink tank, BCI-15 color ink tank, software and driver CD-ROM, instructions, setup and warranty information",
    "rating": 3.1,
    "feature_bullets": [
      "Up to 4,800 x 1,200 color dpi resolution",
      "Up to 13 ppm black, 9 ppm color; true borderless photos",
      "Direct printing from select Canon digital cameras",
      "USB interface; PC and Mac compatible; wireless IrDA for Windows",
      "Supports optional battery for fully portable operation"
    ],
    "specifications": {
      "Product Dimensions": "15 x 5.6 x 9.8 inches",
      "Item Weight": "7.2 pounds",
      "ASIN": "B00008CMU9",
      "Item model number": "I70",
      "Customer Reviews": "3.1 out of 5 stars30 ratings3.1 out of 5 stars",
      "Best Sellers Rank": "#475,453 in Office Products",
      "Is Discontinued By Manufacturer": "Yes",
      "Date First Available": "February 3, 2003",
      "Manufacturer": "Canon"
    },
    "categories": [
      "Printers & Accessories",
      "Office Products",
      "Electronics",
      "Printers",
      "Office Electronics",
      "Inkjet Printers"
    ],
    "price": ""
  }
}