{
  "website_summaries": [
    {
      "verdict": "If you can get past its large size, Panasonic's DMC-FZ50 is a decent choice for a superzoom.",
      "pros": [
        "Fast, 12X optical, image-stabilized zoom lens",
        "raw capture",
        "sensitivity to as high as ISO 1,600"
      ],
      "cons": [
        "Big camera body",
        "auto white balance is bad with tungsten lighting",
        "relatively expensive"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 8.0,
        "Performance": 8.0,
        "Image quality": 7.0
      },
      "publication_date": 20061020,
      "rating": 7.4,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Better than Canon Rebel XS or XSi",
      "text": "Quick Review. This is for the intro photographer to RAW and Manual Settings. Why? Cause you dont have to give up the big zoom of other panasonic cameras (this is 12x-21x depending on resolution). Also, this one has RAW capabilities, and a free RAW editor (wiki it if you dont know what it is, its amazing). Also, the Video with zoom and sound, make this a HD widescreen camcorder (800x450 pixels). Canon Rebel, yeah, its $700, and yeah, its another $200-300 for lenses, which already puts it double the price of this. You think these pics arent as amazing, check out my customer images.",
      "rating": 5.0,
      "verified": true,
      "author": "Urban Pharmer",
      "helpful_votes": 2,
      "publication_date": 20090509
    },
    {
      "title": "It broke after years of hiking and back packing in ...",
      "text": "It broke after years of hiking and back packing in the rain pacific northwest. I was surprised by its lifespan given the activities it was used for but it severely lacked the highly desired features of an actual DLSR.",
      "rating": 2.0,
      "verified": true,
      "author": "Catt.E.Whompus",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "\"The Legend\"",
      "text": "FZ50S is the \"Legend\" machines of Panasonic & one of the best examples of \"what they can do, if they want!\" Leica lens on this Legend FZ50S is just superb. The depth & clarity of the photos are unbelievable... last but not least the limited silver edition FZ50S is a beauty! The later models from Panasonic tried to follow the steps of FZ50 but... Well, u know what happened. It's still one of the most desirable machines around and I'm not surprised that people want this \"Legend Back\" Even DP review mentioned the FZ50 in Panasonic's latest FZ1000's review which clearly indicates it's \"Legend\"",
      "rating": 5.0,
      "verified": true,
      "author": "Boorock",
      "helpful_votes": 0,
      "publication_date": 20150606
    },
    {
      "title": "great product",
      "text": "I have been looking for a good DSLR like camera for a while. FZ50 is the best that I can find in the market today. Many reviewers point out noise problems which I also found annoying. But if you can not wait for another 6 months or so, this is the best you can get. Fujifilm's S9000 may have lower level of noise, but it doesn't come with image stablization, which is more of an issue for me. In sum, if you need the camera now, FZ50 is the \"best\" available. If you can wait till July, then look for Panasonic's new release around that time.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Zhang",
      "helpful_votes": 10,
      "publication_date": 20070429
    },
    {
      "title": "great camera",
      "text": "I have always been a fan of Nikons and recently purchased a new D40X with two lenses. My wife loves photography but the technical aspects of the DSLR were a bit daunting. Still wanting a camera that gave the options of an SLR, manual, aperature settings was a goal. After discovering the possibilities of the DMZ-FZ50 we thought it might be a great compromise. It has been great photographic addition, and the results have been stunning.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas C. Campbell",
      "helpful_votes": 8,
      "publication_date": 20071001
    },
    {
      "title": "I REALLY like this camera",
      "text": "I have been using my mother's DMC-FZ50S camera for a couple of years. Recently, I decided to buy one of my own. I chose to not update to the newer FZ70 or other models because the FZ50 has a receptacle for remote wireless shutter release not available on newer models. Also, even though newer versions have greater zoom capabilities, the FZ50 can be adjusted by 2x - 4x the listed lens; and great macro, too. This is such a strong zoom that a tripod and remote shutter are pretty much necessities -- even with and-shake reduction. I love this camera. Easy to use at all levels of technical competence.",
      "rating": 5.0,
      "verified": true,
      "author": "Jocelyn Mims",
      "helpful_votes": 0,
      "publication_date": 20150417
    },
    {
      "title": "What a great camera",
      "text": "Excellent Leica lens, great optical zoom and many choices for resolution, focusing, etc. I've owned a number of digital cameras and believe me, this one is very nice indeed! The image stabilization works very, very well. I did purchase the add-on Panasonic flash for extra range for night and wildlife photography - however the normal use the built-in flash works nicely. You wont regret buying this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "L. N. Bell",
      "helpful_votes": 8,
      "publication_date": 20070109
    },
    {
      "title": "Panasonic camera.",
      "text": "This was purchased to replace an earlier model. I love the features and it takes nice sharp pictures. There are internal options to enhance the photos with different color treatments right in the camera!! Nice SD card with it too! Prompt shipping as communicated by vendor!!",
      "rating": 5.0,
      "verified": true,
      "author": "MMrFixit",
      "helpful_votes": 0,
      "publication_date": 20150303
    },
    {
      "title": "worth every penny",
      "text": "this camera takes great pictures for travel and outdoors. If you intend to take family photo's indoors you will need a large room for group shots as it's 35-420 zoom. Having said that I am very happy with this camera and it's long list of functions. The software is better than some I've seen. The camera is easy to use right out of the box. Make sure you buy a memory card. The battery ahs a very long life but I bought a spare so I wouldn't be caught without my camera. My only complaint is photo's load slowly to my computer compared to other cameras.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Robert Young",
      "helpful_votes": 0,
      "publication_date": 20070406
    },
    {
      "title": "Awsome camera",
      "text": "Wow, I love this camera. The shutter speed with manual focus is almost nothing. Even less with the flash off. And with automatic focus it's still really good. At the moment, I still haven't figured out how to use all the functions of this camera, but leaving it on automatic works ok enough. Taking 640x480 movies is awesome, I might not need to ever buy a video camera.",
      "rating": 4.0,
      "verified": true,
      "author": "John Duncan",
      "helpful_votes": 0,
      "publication_date": 20080107
    },
    {
      "title": "Panasonic DMC-FZ50 1.1 Mp digital camera",
      "text": "I purchased this camera to take photos of wild birds, it exceeds my expectations. It is an extraordinary camera with a Leica lens. Photos are sharp, clear and true to color.It is very user friendly. With the built in stabilizer feature it is difficult to take a blurred photo. I am exceptionally pleased to own this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Mims",
      "helpful_votes": 5,
      "publication_date": 20071031
    },
    {
      "title": "Perfect for me",
      "text": "I have had this camera for 3 years now and absolutely will not trade it for anything. The picture quality is amazing, and I love not having to deal with lenses like on a DSLR. For the regular person that is looking for a little more from their camera, this is it.",
      "rating": 5.0,
      "verified": true,
      "author": "DJ Stumpy",
      "helpful_votes": 2,
      "publication_date": 20110412
    },
    {
      "title": "GREAT camera",
      "text": "I'm still learning -- this camera does A LOT -- but what I've done with it so far, I love! I've pretty much only used the \"auto\" setting but I've taken some great pictures! Even at night -- with and without the flash -- I've gotten some great pics. The zoom is awesome. We were in the mountains over the Christmas holidays -- I was taking pictures and was able to zoom in on houses that were barely noticeable with the naked eye. The picture quality is awesome. I'm very pleased with this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronnie L. Compton",
      "helpful_votes": 6,
      "publication_date": 20070103
    },
    {
      "title": "Panasonic DMC-FZ50 Camera",
      "text": "This was a replacement for a similar camera purchased approximately eight years ago. I literally wore out the first one taking thousands of photos over the years. It is exactly the camera I need. Major features for me are the lens, stabilizer, thru the lens view finder and flip LCD. The lens is 12x optical zoom (35mm equivalent 35-420) with stabilizer for expert point-and-shoot. I am not a professional but an avid photographer that has used many cameras for many years.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Hendrickson",
      "helpful_votes": 0,
      "publication_date": 20140503
    },
    {
      "title": "One of my better purchases!",
      "text": "Great deal on this camera. It offers so much in control, and yet will still take a snapshot. It arrived on time, in good order, just as advertised. I was hesitant as it was a third party vendor (Adorama), but it was an excellent deal and completely as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara Smiles",
      "helpful_votes": 2,
      "publication_date": 20080624
    },
    {
      "title": "Great Camera!",
      "text": "It's my first Panasonic Camera, I have a 2 Sony Cybershot and one Olympus. This is a very good camera, has a lot of features. Takes nice pictures. One bad feature is the small LCD, I would like a bigger one (perhaps a 3\"). The zoom is great, and when you use a tripod your photos are better. I'm thinking to buy the external flash because the built-in is not very good. But instead of all I recomend this nice camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Agreda",
      "helpful_votes": 2,
      "publication_date": 20070918
    },
    {
      "title": "Five Stars",
      "text": "Great working camera that still performs cheaper than the name brands!",
      "rating": 5.0,
      "verified": true,
      "author": "CShannon1077",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "So far...",
      "text": "I've had the camera for 5 days now. It's worked perfectly. The zoom is something really impressive, the definition on the pictures with 10.1MP it's just outstanding. it's a great camera and really easy to use. So far the only thing i've disliked is the flash. Will review some more later.",
      "rating": 4.0,
      "verified": true,
      "author": "Xavier Palacios P",
      "helpful_votes": 3,
      "publication_date": 20071124
    },
    {
      "title": "Panaxonic DMC-FZ50",
      "text": "This is a great camera! I reviewed digital cameras for months before deciding on this camera. I bought it for it's zoom power and high MP. I have yet to learn most of the features, but I've been doing great using the auto mode. It's a large camera, not one you can stick in your purse or pocket. But if you want a high zoom camera that takes great shots, it's worth the bulkiness!",
      "rating": 5.0,
      "verified": true,
      "author": "Jean B.",
      "helpful_votes": 0,
      "publication_date": 20080208
    },
    {
      "title": "Panasonic camera",
      "text": "A great camera. It takes just about any kind of picture you want it to take - from landscapes to portraits. The light and the colors come through much better than most digitals.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Twain",
      "helpful_votes": 2,
      "publication_date": 20090422
    },
    {
      "title": "Great Camera",
      "text": "Using the same camera since 2006. Has all the right functions and take super fantastic photos. I don't have a single problem with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Alicea",
      "helpful_votes": 0,
      "publication_date": 20140114
    },
    {
      "title": "Panasonic DMC-FZ50 10.1MP digital camera",
      "text": "I read a review on this camera in Businessweek and decided to buy it immediately. Good camera so far. The technology appeared overwhelming initially but after spending time reading the manual, I had no problem using it. Great performance. One problem I have with it is how fast the battery runs down. Another, is the type of battery it uses. For somebody like me that intends to use it abroad (West Africa), my powershot that uses convectional battery is still better.",
      "rating": 4.0,
      "verified": true,
      "author": "UEnyi",
      "helpful_votes": 5,
      "publication_date": 20070127
    },
    {
      "title": "Best available!",
      "text": "This is the best \"near\" SLR on the market. Great pics and features. Can be as easy as one-click to use or you set any of the photo settings manually for the desired affect.",
      "rating": 5.0,
      "verified": true,
      "author": "J. LaFreniere",
      "helpful_votes": 2,
      "publication_date": 20070628
    },
    {
      "title": "Panasonic DMC-FZ50 10.1MP Digital Camera",
      "text": "This camera does it all and very well at that! I purchased this camera to do a wedding photo shoot, had a week to practice and the pictures came out very nice. Anyone who has ever shot a wedding is well aware of the differences in lighting, depth of field and action changes that go on throughout the day. I found the ability to adjust white balance, lock focus, use a fast auto focus option and adjust both zoom and manual focus using lens mounted rings instead of buttons a major advantage with this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "John W. Fink",
      "helpful_votes": 3,
      "publication_date": 20070802
    },
    {
      "title": "Best yet.",
      "text": "This camera is great, I have used a Cannon AE1 for over 25 years now. Have tried several digital cameras with out satisfaction. Always using the AE1 for quality pictures. This camera performs neck and neck with my AE1. The extended zoom is awesome, the high sensitivity mode is great for low lighting. Often indoors I do not use the flash. I recomend a second battery for taking a lot of pictures or for using camera all day. If you want a great camera and do not want a SLR I recomend this camera highly.",
      "rating": 5.0,
      "verified": true,
      "author": "Daslider",
      "helpful_votes": 9,
      "publication_date": 20070109
    },
    {
      "title": "Excellent Camera",
      "text": "Why would anyone buy a more expensive camera? Everything you need in a camera is built into this one. With a 12X Optical zoom who needs extra lenes to carry around. This camera is a bargain with excellent quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy Arrowmaker",
      "helpful_votes": 2,
      "publication_date": 20071118
    },
    {
      "title": "Five Stars",
      "text": "The lens on this camera is magnificent, and I wish it were detachable for use on my other cameras.",
      "rating": 5.0,
      "verified": true,
      "author": "David L. Kellett",
      "helpful_votes": 0,
      "publication_date": 20150424
    },
    {
      "title": "My best camera!",
      "text": "I love the camara, it is parabelum! great for outdoors!",
      "rating": 5.0,
      "verified": true,
      "author": "AlfredoValle",
      "helpful_votes": 0,
      "publication_date": 20150618
    },
    {
      "title": "Best Macro Pictures",
      "text": "I purchase this camra to take macro pictures of roses and could not be happier. Takes all other types of pictures with the same quality. I have only taken point and shoot pictures with great results. During bloom season I will use a tripod and cable shutter release. I purchased a Sony A-100 a few months ago and this camera out performs the A-100.",
      "rating": 5.0,
      "verified": true,
      "author": "Rinahugo",
      "helpful_votes": 10,
      "publication_date": 20070118
    },
    {
      "title": "LUMIX DMZ50",
      "text": "THIS IS AN AWSOME CAMERA YOU CAN CONTROL IT FROM FULL MANUAL TO FULL AUTO. JUST BE CAREFUL WHEN YOU ARE DOWNLOADING. THE CABLE AND THE FEMALE CONNECTION ON THE SIDE OF THE CAMERA ARE VERY SENSITIVE AND IF YOU PUSH OFF CENTER OR TWIST THE CABLE IT WILL DAMAGE THE WIRE FINGERS IN BOTH THE CABLE AND CAMERA...I'M VERY GLAD I WAS UNDER WARRENTY....I SENT THE CAMERA BACK TO THE VENDOR\"EXPO ELECTRONICS\" IN N.J. AND THEY SENT ME A BRAND NEW REPLACEMENT.... AS FOR THE PICS...THEY ARE GREAT. WITH THE LEICA LENS AND ZOOM ON THE LENS INSTEAD OF ZOOM TOGGLES, THE CAMERA IS A DREAM TO OPERATE...",
      "rating": 4.0,
      "verified": true,
      "author": "S. A. MUNOZ",
      "helpful_votes": 3,
      "publication_date": 20070911
    },
    {
      "title": "Panasonic DMC-FZ50 Review",
      "text": "Great Camera the only down side is buy a 2gb memory SD CARD. The one it comes with only lets you take 1 picture then it's full so buy the 2gig sd card. Other then that it's a great camera. No complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Pieman16",
      "helpful_votes": 0,
      "publication_date": 20080108
    },
    {
      "title": "Great camera",
      "text": "For the price paid, this is a great camera. Should last me for a long time. Debated buying a SLR, but this seems to have all the features of an expensive SLR (actually it is a SLR, just no interchangable lenses) and a lot easier to use.",
      "rating": 5.0,
      "verified": true,
      "author": "R. MORRIS",
      "helpful_votes": 0,
      "publication_date": 20070410
    },
    {
      "title": "Great Camera",
      "text": "I'm working to master photography and this Camera is definitely helping. Great steady shots all the way for a very good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Ethar Zaher",
      "helpful_votes": 2,
      "publication_date": 20071212
    },
    {
      "title": "Good Camera",
      "text": "This is the first digital camera I bought...and I'm very happy. I used canon,sony and olympus..all borrowed from friends and this camera is at par with all these. Looks big but easy to carry and snap pictures.Learners/beginners can use the auto mode untill they learn how to use other options standard in all digutal SLR cameras.I liked the swivel LCD display and easy to use menu too. Good camera..worth buying..",
      "rating": 5.0,
      "verified": true,
      "author": "Shiva",
      "helpful_votes": 2,
      "publication_date": 20070807
    },
    {
      "title": "Excellent camera",
      "text": "I had the previous model and loved that. This just has added benefits. Excellent for the price It does a thousand times better than my iPhone. Highly recommended. .",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel S. Jerdin",
      "helpful_votes": 0,
      "publication_date": 20130514
    },
    {
      "title": "Great camera for a great price.",
      "text": "Everyone seems to be shocked when I say I bought a Panasonic camera. But believe me it is good, not only good but excellent. With 10 MP and 12X zoom what more do you want. YOu can attach lenses if you feel the need of it. I really like the camera a lot and i rate it A+",
      "rating": 5.0,
      "verified": true,
      "author": "Chitrak Gupta",
      "helpful_votes": 14,
      "publication_date": 20061130
    },
    {
      "title": "great buy",
      "text": "I bought this exactly 1 year ago & find it really a great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "ch81",
      "helpful_votes": 0,
      "publication_date": 20070312
    },
    {
      "title": "Good  Product",
      "text": "Excellent in all respects except buttonology is not intuitive. Lots of manual use to learn to use properly",
      "rating": 4.0,
      "verified": true,
      "author": "jcrnorf",
      "helpful_votes": 5,
      "publication_date": 20070104
    },
    {
      "title": "Excelent Camera",
      "text": "The only problem that i see , its that the LCD screen dont have a good resolution when using the Zoom, but is Good. I think is normal , the high resolution add the high zoom .result in a bad resolution of the LCD screen . But I am happy with the camera. I love this camera...",
      "rating": 4.0,
      "verified": true,
      "author": "Francisco Li",
      "helpful_votes": 3,
      "publication_date": 20070103
    },
    {
      "title": "A novice trying to learn.....",
      "text": "I got the camera for Christmas thinking it would be all that I needed to shoot action shots at my son's basketball games. So far they are mostly blurry and nothing Sports Illus. would be interested in. I don't know what I am doing wrong and have read the manual backwards and forwards a half a dozen times. I need help! Anyone with tips on how to shoot indoor, action shots please email me Darren967@aol.com Thank you!",
      "rating": 3.0,
      "verified": true,
      "author": "PennyD",
      "helpful_votes": 0,
      "publication_date": 20080123
    },
    {
      "title": "Dead after less than 2 months  :(",
      "text": "This camera went dead on me less than two monts light use. Sent to Panasonic Service Center last August 22nd(received there) and until now(Sept 7th) they are still waiting for the part from Japan being shipped by boat!! I can not believe that Panasonic does not have this critical part in stock. Be very careful with this camera. At any rate, i was not also really totally satisfied with the quality of the pictures due to its over-bearing noise reduction system. I will just be happy if they can not be repaired as promised and just give me a refund. I think this will be my 2nd and last Panasonic camera.",
      "rating": 2.0,
      "verified": true,
      "author": "Kaizen Way",
      "helpful_votes": 11,
      "publication_date": 20070907
    },
    {
      "title": "Too noisy",
      "text": "Great camera - awesome handling. Too bad noise, even in bright daylight at ASA100 is excessive. This is not even CLOSE to a DSLR subsitute.",
      "rating": 2.0,
      "verified": true,
      "author": "joe-maryland",
      "helpful_votes": 4,
      "publication_date": 20080106
    },
    {
      "title": "Pana Fz50",
      "text": "I think, this Pana. FZ50 is the best camera that you can get, if you do not want to own a SLR. I gave it a three stars, because it does not take AA battery.",
      "rating": 3.0,
      "verified": true,
      "author": "cameraman",
      "helpful_votes": 2,
      "publication_date": 20080512
    }
  ],
  "product_meta": {
    "title": "Panasonic DMC-FZ50S 10.1MP Digital Camera with 12x Optical Image Stabilized Zoom (Silver)",
    "description": "Color:SilverFROM THE MANUFACTURER\nThe new 10.1-megapixel Panasonic Lumix DMC-FZ50, successor to the popular DMC-FZ30, features a powerful f2.8 Leica DC lens with 12x optical zoom. The lens focal length is equivalent to 35-420mm on a 35mm film camera and is enhanced by Mega O.I.S., Panasonic's exclusive Optical Image Stabilizer system.\n\n The DMC-FZ50 boasts a 10.1-megapixel high resolution CCD for its image sensor and Venus Engine III for the image processing LSI, making it possible to record a image at maximum ISO 1600 high sensitivity setting at full resolution. Furthermore, by dramatically reducing the noise levels that challenged its predecessor, the DMC-FZ50 is able to capture 10.1-megapixel full resolution images even in high sensitivity recording.\n\n To fight against the major cause of blurred images, Panasonic invented the Mega O.I.S. system taking advantage of its superior lens technology to compensate for handshake--a feature which has long been incorporated into the Lumix range of cameras. In addition, to also compensate for the other major cause of blurred images--movement of the subject--the FZ50 is also equipped with the world's first Intelligent ISO Control (hereafter I.I.C.) and maximum ISO 1600 high sensitivity recording capabilities within the advanced image processing LSI Venus Engine III. When set to the I.I.C., the Venus Engine III detects the subject's movement and adjusts the ISO setting and shutter speed to best suit the subject movement and the light condition automatically. Panasonic's excellent image stabilizing system allows users to take clear, crisp images in any situation automatically, leaving everything to the camera.\n\n From a point of view of further improving the usability of its predessor, the DMC-FZ50 is equipped with a new Function Button which serves as a shortcut to quickly set frequently-used settings such as recording image size, light metering, AF area, white balance, and ISO sensitivity. Also, thanks to the newly incorporated custom setting function, your frequent setting patterns can be memorized and it can be instantly applied by simply selecting this function with the mode dial. The 2-inch LCD flips out to 180 degrees, making it easier to view even when shooting from high or low angles. As for optional accessories, the DMC-FZ50 is now compatible with TTL external flashes. Finally, the battery life is greatly extended by approximately 29% compared with its predecessor allowing the FZ50 to shoot approximately 360 images on one charge (CIPA).\n\n The Lumix DMC-FZ50 faithfully inherits the well received basic specifications from its predecessor FZ30 such as the manual focus ring and manual zoom ring, yet enhances the image sensor up to 10.1-megapixel. Noise is drastically reduced with this new FZ50 achieving a rendition of even higher quality images.\n\n 10.1-Megapixel CCD and f2.8 12x Optical Zoom Leica DC Lens\nThe DMC-FZ50 includes a 10.1-megapixel high resolution CCD and the f2.8 Leica DC Vario-Elmarit 12x optical zoom (equivalent to 35mm to 420 mm with a 35mm film camera) lens. The lens unit is comprised of fourteen elements in ten groups including three aspherical lenses and an ED lens, All these are incorporated to generate low distortion and high optical performance while preserving the compactness of the unit. The Extended Optical Zoom, made possible by using the center part of the 10.1-megapixel high resolution CCD, further extends the powerful 12x optical zoom to up to 21x for 3-megapixel image recording (17.1x for 5-megapixel and13.4x for 8-megapixel recording). High resolution images with richer gradation are always assured with these Leica DC 12x optical zoom lens and the 10.1-Megapixel CCD.\n\n Lumix's Image Stabilizing System Evolves\nTaking advantage of its superior lens technology, Panasonic invented the Mega O.I.S.(Optical Image Stabilizer) system to fight against the major cause of blurred images. It compensates for handshake and is now featured on the entire Lumix range, and has been highly evaluated and appreciated by the users across the world. Every slight hand-shake movement is detected accurately with the sampling frequency at 4,000 times per second and will be compensated to render clear, sharp images. In addition, movement of the subject, the other major cause of blurred images, is suppressed by the advanced image processing LSI Venus Engine III with the Intelligent ISO Control (hereafter I.I.C.) and maximum ISO 1600 high sensitivity recording capabilities. The world's first incorporation of this I.I.C. allows the automatic adjustment of the suitable ISO setting and shutter speed that best suits the situation by analyzing the speed of subject movement. If the subject is moving, the ISO setting would automatically rise to allow high shutter speed. On the other hand, if the subject is still and no movement is detected, you can take beautiful natural images with a low ISO setting.\n\n Accordingly the new Lumix automatically takes the best countermeasures against any causes of blurred images with Mega O.I.S. compensating for hand-shake and the I.I.C. compensating for movement of the subject. Image stabilizing system is further evolving with Lumix.\n\n Dramatically Reduced Noise with Venus Engine III\nThe DMC-FZ50 adopts the Venus Engine III to realize high sensitivity recording at maximum ISO 1600 at full resolution. The noise reduction system is greatly improved by removing noise at the processing stages in series. First, critical noise is roughly undraped and the chromatic noise and the luminance noise are separated to respectively go through the supplemental noise reduction process so that the remaining noise is appropriately minimized. In addition, chromatic aberration is also reduced so beautiful images are assured even in telephoto shooting.\n\n Despite the significantly increased performance of the camera, the Venus Engine III consumes only 80% of the power utilized by the Venus Engine II and is able to achieve a longer battery life of approximately 360 pictures (CIPA) on a single charge. With its multi-task image processing capability, the Venus Engine III also boasts outstanding response time with an industry-leading level of shutter release time lag of as short as 0.009 seconds. minimum and the shutter interval of 0.8 seconds. Together with the fast startup time of approximately 0.7 seconds, the quick response of DMC-FZ50 enables easy capture of those spur-of-the-moment shots. The DMC-FZ50 also allows unlimited consecutive shooting up to the capacity of the SD/SDHC memory card.\n\n In Pursuit of Full Manual Control\nThe DMC-FZ50 succeeds the high operational ease and the good design that have been highly acclaimed with its predecessor DMC-FZ30. Two exclusive rings on the lens barrel provide manual control of zooming and focusing, allowing quick and fine control that cannot be achieved with button or lever operation. This feature will be highly valued by high-end users not only for its precise controllability but also for the feeling of manual operation. With the two dials located under the index finger and the thumb, you can compensate the exposure directly in addition to the shutter speed and the aperture smoothly and naturally. The newly added Function Button serves as a shortcut exclusively for the commonly used settings such as recording image size, light metering, AF area, white balance, and ISO sensitivity, allowing them to be set easily.\n\n For further improvement, your frequent setting patterns can be memorized and can be instantly applied by just selecting the newly incorporated custom setting function. White balance now can be finely adjusted with a reference to the horizontal axis for amber to blue and vertical axis for green to magenta. Furthermore two composition guideline patterns can be overlaid on the normal shooting screen.\n\n Free-Angle LCD and High-Resolution EVF to Extend Shooting Potential\nThe 2.0-inch flip-out 207K high-resolution LCD is adjustable to 180 degrees both vertically and horizontally. This assists smooth shooting even in high- and low-angle shooting positions. The pixel-mixed readout method performed at the CCD achieves high sensitivity to offer sufficient brightness for easy shooting even in low-light situations. The Power LCD function boosts the brightness level by 40% to secure clear view even in sunny outdoors. The DMC-FZ50 is also equipped with a 235K-pixel high resolution EVF to encourage active shooting. EVF can provide the benefit of being able to check white balance, real-time histogram, and the DOF (depth of field) before shooting.\n\n Faster Autofocus\nThe AF mode can be selected according to the shooting situation: 9-point, 3-point high speed, 1-point high speed, 1-point normal speed, and spot. In the 1-point and 1-point high speed AF mode, the AF area is selectable from the nine focusing areas with the joystick to best fit the composition of the subjects. Also, the AF assist lamp facilitates quick, accurate focusing in situations where focusing is difficult due to the lack of light.\n\n Clear, Bright, Wide VGA Motion-Image Recording for Viewing on a Wide-Screen TV\nIn addition to standard VGA (640 x 480) at 30 frames per second (fps) motion image recording, the DMC-FZ50 also records stunning full-size movies in wide-aspect VGA (848 x 480) at 30 fps. Shooting is one thing but viewing is another, and you will be suitably impressed by the 16:9 moving image when it is displayed on a wide screen TV. The brightness level of these motion images is also enhanced as a result of the pixel-mixed readout method performed by the CCD. Zooming in while recording motion images is also possible with the manual zoom ring, while image clarity is secured by the Optical Image Stabilizer.\n\n Included Software and Optional Accessories\nTo edit and develop RAW files, the Silkypix Developer Studio 2.0SE software application is bundled with the DMC-FZ50. Using this software, you can freely adjust various setting such as exposure, white balance, and so on afterward with the RAW files.\n\n The DMC-FZ50 is compatible with all the same accessories as the FZ30. In addition to those, the DMC-FZ50 is also compatible with the TTL external flash GN50 or GN36 (not included--must be purchased separately). This expandability enhances the potential of shooting to make DMC-FZ50 a true high-end camera.",
    "rating": 3.8,
    "feature_bullets": [
      "10.1-megapixel CCD captures enough detail for photo-quality 18 x 24-inch prints",
      "12x image-stabilized optical zoom; 2.0-inch free-angle LCD display",
      "Intelligent ISO Control (I.I.C.) reduces image blur from subject movement and low light",
      "Records full-size movies in wide-aspect VGA (848 x 480) at 30 frames per second",
      "Stores images on SD memory cards (32MB card included); powered by li-ion battery pack (battery and charger included)"
    ],
    "specifications": {
      "Product Dimensions": "5.55 x 5.59 x 3.39 inches",
      "Item Weight": "1.62 pounds",
      "ASIN": "B000GHTGES",
      "Item model number": "DMC-FZ50S",
      "Customer Reviews": "3.8 out of 5 stars198 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#42,948 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 2, 2001",
      "Manufacturer": "Panasonic"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": ""
  }
}