{
  "website_summaries": [
    {
      "verdict": "This harness showcases a simple design that packs some serious punch, making it comfortable and convenient to wear and use binoculars.",
      "pros": [
        "Attachment rings are sturdy",
        "Elastic straps take little adjusting to find comfort",
        "Harness naturally positions binoculars in ideal position for frequent use",
        "Straps possess attachments to prevent tangling",
        "Harness fits range of body shapes and sizes"
      ],
      "cons": [
        "Zip ties that harness comes with are not as reliable as included attachment rings"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Better Than Manufacturer Carry Strap",
      "text": "This strap holds the binoculars in a nice steady position on the chest. The bands are elastic and there are couple of ways you can attach the straps to your binoculars. They are well made and comfortable when worn. Very easy to install on your binoculars and this strap puts the binoculars in a ready to use position. The straps do not dig in my shoulders. I really like these and would highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Work-of-heart",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Nice product",
      "text": "Works as advertised. Needed something to hold my binoculars when out kayak hunting for geese. Only recommendation I have would be to use a better clip for the straps to the binoculars. I bent the rings up just trying to get them on. It'll stay on just doesn't \"look\" the greatest anymore.",
      "rating": 4.0,
      "verified": true,
      "author": "Brett",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Nice",
      "text": "These are a must have for your binoculars. They keep them at the front of your chest where they're easy to use and access. You dont have to worry about dropping and damaging your spectacles!!! We have 2 of these for 2 different binoculars and love them both. A good purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "geotraxmaniac",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Perfectly useful and hard to beat for price.",
      "text": "I bought this to replace a Butler Creek bino harness I had lost. It is pretty much the same thing, only 1/3 the price. Seems well made and plenty sturdy enough for my Bushnell H2O 8x42 binoculars. I’m a pretty big guy and they adjust enough to fit me comfortably. Can’t really go wrong for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "TN Dad",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Must have for hunting",
      "text": "These are a must have for hunting. Been using for a few years, will never go back to a neck strap. I have a different brand that is more comfortable, but these arent bad at all, especially for price.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "The same a brand costing 3 times as Much",
      "text": "These are almost identical to the Vortex Optics Binocular Harness Strap that sell for much more. Very nicely made very secure",
      "rating": 5.0,
      "verified": true,
      "author": "DavidTop Contributor: Woodworking",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Would not carry my binoculars without it",
      "text": "It helps tremendously! I used it to carry my medium size binoculars for a multi-day hike. I remember I used to have neck pain for a few-hour hike carrying just a camera (which is a lot lighter than the binoculars). The strap helped distribute the weight to my shoulders and upper back. I barely felt the weight at all! FYI, this works perfectly for both guys and girls (even with their different chest shapes). The only thing is that it's a little harder to put on and take off and sometimes the strap may tangle around your body. As long as you pay attention, it's not a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "The ONLY way to carry good binoculars!",
      "text": "This strap system is excellent for using binoculars in the field. My husband and I both have a pair, and we never take them off of the binoculars! They are quick to put on and off of your body, and so handy no matter what the birding situation is. A very good investment in ensuring that you don't drop your binoculars, too!",
      "rating": 5.0,
      "verified": true,
      "author": "PFNature",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Super comfortable in the field",
      "text": "Really love these! The price is excellent, these straps work like they're supposed to with my binoculars and they're very comfortable. I'm going to buy 2 more - one for my camera and another for my husband's binoculars. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Garden Girl",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Best bino strap",
      "text": "I have used this product on my hunting binoculars for severtal seasons. It is easily attached and the straps have swivals that help to prevent tangling. I recently purchased two more units for my grandsons. It allows one to keep the optics readily accessable when needed but out of the way when mounting a firearm. The weight of the binoculars is distributed across the wearer's back instead of the neck. The sales price through Amazon makes this an even better bargain and the delivery was fast.",
      "rating": 5.0,
      "verified": true,
      "author": "James S. Ford",
      "helpful_votes": 18,
      "publication_date": 20110315
    },
    {
      "title": "Great for the money",
      "text": "I used them all turkey season. Walked untold miles in 4 different states. They were comfortable and kept my glass where I could use it.",
      "rating": 5.0,
      "verified": true,
      "author": "foster4mom",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Great price",
      "text": "This harness for my camera makes it much easier to carry - will be able to keep it with me more often to take lots more pictures! And it was about $12 cheaper than one I got for my husband's binoculars.",
      "rating": 5.0,
      "verified": true,
      "author": "kayinwyo",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "I LOVE THIS STRAP!",
      "text": "This thing is awesome! I should've bought one a long time ago. As a bowhunter, it's a problem when your binoculars hang down off a strap and get caught up in your bowstring or cables. This keeps them close to your chest and actually helps stabilize them when in use.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam Porter",
      "helpful_votes": 0,
      "publication_date": 20170412
    },
    {
      "title": "Looks identical to the famous name brands - hope they last just as long",
      "text": "These straps were purchased for an avid birder who carries a heavy pair of binoculars all day. Except for the name embossed on the leather hub, they look identical in form and function to the Audubon straps purchased from Eagle Optics that lasted 15 years of heavy birding use before the elastic gave out. Let's hope that the Allen brand lasts for 15 years also.",
      "rating": 5.0,
      "verified": true,
      "author": "Sidd",
      "helpful_votes": 0,
      "publication_date": 20160817
    },
    {
      "title": "Excellent product!",
      "text": "This style of binocular strap is absolutely essential if you use your binos often while hunting, fishing or birdwatching. When you let go of them they are held close to your chest and out of the way. The strong stretchy material keeps them from bouncing around and it is very comfortable to wear. The only issue that I have had with them is that they can get caught in the ladder for my tree stand while I am climbing up and down, but that is user error, not a defect in workmanship.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 2,
      "publication_date": 20121127
    },
    {
      "title": "Nicely executed",
      "text": "Works nicely. Has both upper and lower adjustments which the wife likes. (My other brand only has one.) Use is with a medium set of binos - Vanguard 8.5x45 Wife was using neck strap. I convinced her to try my harness and she decided to switch. She likes the adjustment of these even better than mine.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Marshall",
      "helpful_votes": 0,
      "publication_date": 20170408
    },
    {
      "title": "These are the best!",
      "text": "If you are looking to carry your binos and don't want to use the cheap strap they come with then this is the affordable option for you. It does the exact same thing those other more expensive straps do but at a fraction of the price. Perfect for carrying your binos on your chest while hunting, walking in the woods bird watching, hiking or whatever you choose to do while toting binoculars with you. You will not be disappointed unless you like to pay premium prices for similar quality and functionality.",
      "rating": 5.0,
      "verified": true,
      "author": "SAnderson",
      "helpful_votes": 0,
      "publication_date": 20121231
    },
    {
      "title": "Purchase connections for $5 and save time and hassle. Excellent choice",
      "text": "Very good quality. Easy to use. I purchased connectors for added stability and wear. Great choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne M. Smith",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Keeps your Binoculars Alway Ready",
      "text": "I use these for hunting. Bought these to replace the exact same item purchased 14 years ago. Straps were finally wearing out on the old ones. Good value.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Stauffacher",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Cheap Snaps.",
      "text": "Cheap Snaps. One of them broke the first time I tried to use the clip.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Gray",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Good Strap, Cheap zip ties",
      "text": "Bottom line... For 10 bucks, this is a good deal. Just a word to the wise, don't even waste your time with the cheap plastic zip ties they include. I broke 2 immediately, and ended up just attaching the ring to my binocular strap hook. As another reviewer noted, they are very elastic, and wouldn't be my first choice for anything heavy. I have 2 pair of binocs. This will be for the lightweight cheap ones. I'll find another better quality for the others. I still got what I paid for, so I'm okay with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "OC Birder Trish",
      "helpful_votes": 21,
      "publication_date": 20111229
    },
    {
      "title": "It fits!",
      "text": "The multiple adjustments means this was easy to fit to my 5' female form. Compared to my spouse's (2 adjustment points) other brand name harness there is no comparison!",
      "rating": 5.0,
      "verified": true,
      "author": "Scooter",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Awesome bino harness.",
      "text": "This replaced my original, that lasted 19 years. Wouldn’t go hunting without this! Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "james mccloskey",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Good product",
      "text": "I used some Adapt-its to be able to put these on my bins quickly. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "NorEsBo",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Buy it",
      "text": "For the price a bargain. Use it on long walking bow hunts. Never notice it. No brained purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Johnstone",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Comfortable",
      "text": "It is a bit too elastic for me. The adjuaters don't stay tight for long and require an adjustment about once a trip. It may not be a big deal for most, but about 3 months out of the year I live in my binos. It could be that I'm suing them with Zeiss RF binos, which are very heavy.",
      "rating": 3.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "Binocular harness",
      "text": "Keeps your binoculars close to your chest yet it's easy to raise them for use. But I don't like the attachment clips, they are clunky and I don't find them quick and easy to use. It's hard to get your bino straps into them. This isn't what the ad describes and it isn't visible in the images on the site here.",
      "rating": 2.0,
      "verified": true,
      "author": "Bob Laybourn",
      "helpful_votes": 0,
      "publication_date": 20150507
    },
    {
      "title": "Cheap",
      "text": "Not impressed at all. The clips are cheap and very large. They would nto fit properly in the rings for the bino's I had. They supply zip ties for attachment. Really..... zip ties. The harness itself has very liittle adjustment. It is elastic so it will stretch some.",
      "rating": 2.0,
      "verified": true,
      "author": "CBGill",
      "helpful_votes": 0,
      "publication_date": 20151209
    },
    {
      "title": "needs less bounce and more strap",
      "text": "was good just found it a bit to bouncy with the elastic needs to be a bit less strechy and mor like a strap firm and stable you can fit to your specific need to use at a 49ers game as they kick the rams but 38 to 11 again and the dallas cowboys any day but for the most part it w8ked like it says just if some8ne had tried to snach them it would have been a bit awiward besides the fact they where tring to steal them it would be like snaping a womans bra strap only the return would hurt a lot more",
      "rating": 4.0,
      "verified": true,
      "author": "RedDe",
      "helpful_votes": 0,
      "publication_date": 20131009
    },
    {
      "title": "I took these out of the box and return them ...",
      "text": "I took these out of the box and return them immediately I'm not very picky and I don't return many items but I can't see attaching $120 pair of binoculars with a zip tie that is how you attach your binoculars to be with a zip tie",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151201
    },
    {
      "title": "good strap, affordable",
      "text": "agree with the others. good strap, affordable, allen offers a good price to value for its products including broadheads. However, the zip ties are not the good answer, they break easily and it is definitely the weak point of this system.",
      "rating": 4.0,
      "verified": true,
      "author": "knifetogo",
      "helpful_votes": 0,
      "publication_date": 20160327
    },
    {
      "title": "I would buy again",
      "text": "Keep binoculars in place on my chest within easy reach and out of the way while keeping hands free, I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "JMW",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Great strap!",
      "text": "I hang a pair of vortex crossfire binoculars off these out duck hunting. They work great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Decent",
      "text": "Had a older one that was made better but for this price you can’t complain",
      "rating": 5.0,
      "verified": true,
      "author": "chris m.",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Nice harness, but ...... come ALLEN whats with the ...",
      "text": "Nice harness, but ...... come ALLEN whats with the cheesy zip strips. I could not would not trust my binos with a little zip tie. If some of you do trust that good luck. The harness is good but I used the little split rings and secured them to bino and then the Allen strap.",
      "rating": 4.0,
      "verified": true,
      "author": "Kathlyn W.",
      "helpful_votes": 0,
      "publication_date": 20151007
    },
    {
      "title": "Works Fine",
      "text": "Good elasticity and adjustability. I'm 5'-11\" at 190 lbs. and this fits well. Materials seem well made. I use this with a pair of Simmons 10x42 (see other reviews) for bird and deer viewing. Does not bind or snag on clothing. Very light and not encumbering. Plastic connectors seem just ok.",
      "rating": 4.0,
      "verified": true,
      "author": "Ensoniqman",
      "helpful_votes": 0,
      "publication_date": 20131114
    },
    {
      "title": "Great for Meter Readers",
      "text": "I work for a Natural Gas company in Texas and I read gas meters. I usually walk around neighborhoods holding a fairly large electronic device to input gas reads and usually a stick to fend off dogs. I use binoculars to read over fences and hard to reach meters. This strap helps me be hands free, and keeps the binoculars from swinging around. I have a similar model to the Bushnell Powerview. I have the straps stretched out to the max and is a perfect fit for me. I am 5.9, weight 225 LB, and I Weight train every other day. I attached my own zip ties to my binoculars and did not use the small one's included.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20131107
    },
    {
      "title": "Great product - Neck saver!",
      "text": "This is a great product for hunting. I don't know how I ever lived without one. My neck is a million times better as the constant pressure of a neck strap sitting in the stand for hours will make your hunt miserable. This product is quiet and very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "HR",
      "helpful_votes": 0,
      "publication_date": 20140811
    },
    {
      "title": "Have you seen my binos?",
      "text": "Works great when compared to the neck strap. I have an old pair of Jena 7x30 binos for stalking in the woods and sure gets the job done. No more fatigued neck muscles and freed my hands as well when climbing.",
      "rating": 4.0,
      "verified": true,
      "author": "Skeeter",
      "helpful_votes": 0,
      "publication_date": 20151223
    },
    {
      "title": "Great for heavier (better) binoculars",
      "text": "I decided to opt for the stronger 10X50 binoculars, despite a bit more weight. But this strap pretty much negates the weight I added, and leaves me hands free when hiking or climbing. Not too hot to wear on a warm day. Strongly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn D. Bougie",
      "helpful_votes": 2,
      "publication_date": 20140610
    },
    {
      "title": "Makes my girlfriend laugh, but hey, the thing WORKS",
      "text": "Except for the fact that my gf says it looks like I am wearing some sort of man-bra, and can't stop laughing, the thing is actually quite effective. In fairness, I am a somewhat large chap, and so it does look a bit odd on me. But it works well, and I give it high marks.",
      "rating": 4.0,
      "verified": true,
      "author": "Speaker to Animals",
      "helpful_votes": 0,
      "publication_date": 20120926
    },
    {
      "title": "This is a nice strap but I would not recommend to zip ties ...",
      "text": "This is a nice strap but I would not recommend to zip ties and ring that attaches to your binoculars. They will breaks I would upgrade which is not expensive at all. But other then that works really good.",
      "rating": 3.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20151105
    },
    {
      "title": "Good Strap but Better Values Out There",
      "text": "This is a very fine strap. But Academy sells something nearly identical and just as fine for about $4. I'd probably go that route next time.",
      "rating": 4.0,
      "verified": true,
      "author": "Wilkins",
      "helpful_votes": 0,
      "publication_date": 20170606
    },
    {
      "title": "Best way to secure your binoculars",
      "text": "This is a great way to secure your binoculars and ensure that they're not in your way. The fact that it fits very large people and very small people speaks to it's design. They were quite easy to mount, and I didn't have to use the zipties that came with them.",
      "rating": 5.0,
      "verified": true,
      "author": "b105h4ck3r",
      "helpful_votes": 0,
      "publication_date": 20140104
    },
    {
      "title": "Great Value",
      "text": "This is great value for the price. Adjustable binocular strap, quality construction. Comes with attachment options in case your binoculars do not have the split rings attached. These were the least expensive straps I could find and did not expect the quality to be so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130701
    },
    {
      "title": "Very happy",
      "text": "Exactly like other versions of this type of product i already own at half the cost. Included 2 sets of rings to attach binos. .",
      "rating": 5.0,
      "verified": true,
      "author": "S. Davis",
      "helpful_votes": 0,
      "publication_date": 20170205
    },
    {
      "title": "Great product",
      "text": "I have another one of these from crooked horn outfitters and when this arrived I found it to be exactly the same except for the graphic. Easy to attach and will fit over a heavy jacket if let all the way out, I am a 6'1\", 230lb guy and it fits very well. Will keep you binoculars against your chest with minimal swinging and does not get in the way of a gun.",
      "rating": 5.0,
      "verified": true,
      "author": "FL Goat",
      "helpful_votes": 2,
      "publication_date": 20120720
    },
    {
      "title": "These do a great job.",
      "text": "They really take the weight off your shoulders from Binos or a camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Molsonice",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "excellent value, well made product",
      "text": "this is a good product at about half price of the completion. I have one of these on both of my binoculars. These help protect your binoculars and they allow you to wear the binoculars.",
      "rating": 5.0,
      "verified": true,
      "author": "John M. Beasley",
      "helpful_votes": 0,
      "publication_date": 20151121
    },
    {
      "title": "Five Stars",
      "text": "Very firm elastic holds heavy binoculars close to my body with no bounce when walking fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Rlew",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "Solid",
      "text": "Came as advertised. Was easy to install on my second pair of binoculars in the field. Doubling up on the zip ties, or getting heavier duty ones seems to be the way to go. Overall, comfortable and easy to adjust. Wore for a couple of full days in the field with no fatigue.",
      "rating": 4.0,
      "verified": true,
      "author": "Bryan Donaldson",
      "helpful_votes": 0,
      "publication_date": 20151005
    },
    {
      "title": "They work!",
      "text": "I'm glad I bought this harness to go along with the Barska Atlantic binocs I bought for hunting. After hiking around the woods all day, this harness prevented neck strain. Would work for a camera too. Highly recommended! INCLUDES * Harness * Rings and zip ties",
      "rating": 5.0,
      "verified": true,
      "author": "Herbie W.",
      "helpful_votes": 0,
      "publication_date": 20111026
    },
    {
      "title": "Bino Straps",
      "text": "The system works as advertised. For the price there is little to complain about. Make carrying your Bino's all day considerably more comfortable and doesn't interfere with any shooting I may be doing. I am going to pick up another set for my DSLR in the near future.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonzzen",
      "helpful_votes": 0,
      "publication_date": 20120223
    },
    {
      "title": "just what I needed.",
      "text": "This harness met all of my needs at a good price. It holds my binos close to the chest and easy to move into viewing position. Very comfortable for long hours in a treestand..",
      "rating": 5.0,
      "verified": true,
      "author": "Indy",
      "helpful_votes": 0,
      "publication_date": 20151016
    },
    {
      "title": "Five Stars",
      "text": "Fits all my friends, big and small. Shipped quickly. Included rings fit my binoculars well.",
      "rating": 5.0,
      "verified": true,
      "author": "David M. Spencer",
      "helpful_votes": 0,
      "publication_date": 20160608
    },
    {
      "title": "Excellent Binocular Strap",
      "text": "This is an excellent product that is both practical and functional. I liked it so much that I ordered two, one for my range finder and one for my binoculars. I'm very pleased at the speed that the binocular straps were shipped to me. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "W. Carrier",
      "helpful_votes": 0,
      "publication_date": 20130114
    },
    {
      "title": "would recommend them",
      "text": "I have these on my leupold Acadia bx2 I like them a lot I have used them in 2 3 day hunts. I would recommend them to anyone they are a good price and work well. They are nicely made",
      "rating": 5.0,
      "verified": true,
      "author": "California Doberman",
      "helpful_votes": 0,
      "publication_date": 20150608
    },
    {
      "title": "well worth it",
      "text": "Good value. May not seem like it is worth the money but it makes carrying binos, etc way more functionable and enjoyable. Not restricting at all, actually a lot less restrictive than a neckstrap.",
      "rating": 4.0,
      "verified": true,
      "author": "Joel King",
      "helpful_votes": 4,
      "publication_date": 20121024
    },
    {
      "title": "Affordable straps",
      "text": "Nice affordable binoculars straps. Works well with several different brands of binoculars.",
      "rating": 5.0,
      "verified": true,
      "author": "love2surf",
      "helpful_votes": 0,
      "publication_date": 20160509
    },
    {
      "title": "Great accessory for your Binoculars.",
      "text": "Words exactly as it should for binoculars. I can't believe I struggled for all those years with a plain strap. It also works for a compact camera, as full sized, heavy body reflect camera may be too heavy for the stretch in the straps.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert T.",
      "helpful_votes": 0,
      "publication_date": 20130918
    },
    {
      "title": "One of the plastic hooks broke, luckily I caught ...",
      "text": "One of the plastic hooks broke, luckily I caught my bins before they hit the ground. You need to replace the plastic clips with metal rings, from your local hardware store.",
      "rating": 2.0,
      "verified": true,
      "author": "Highlandbird",
      "helpful_votes": 0,
      "publication_date": 20150516
    },
    {
      "title": "Better than neck strap",
      "text": "I bought these for a recent Elk hunt, and was pleased with the function of the strap, keeps binoculars from swinging while walking, but in a ready position. Not sure of the long term durability, This was the best value I found.",
      "rating": 4.0,
      "verified": true,
      "author": "JimBow",
      "helpful_votes": 0,
      "publication_date": 20120917
    },
    {
      "title": "Excellent value for money",
      "text": "This shoulder holster replaced my old Swaro strap, a companion of 15 years. I recently went on a long birding trip, and found this to be an able replacement. It costs less than other similar straps, and seems to as durable and capable so far!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20110424
    },
    {
      "title": "Not durable",
      "text": "Bracket that joins at the binos broke in a storage case before i used it one time. Diasappointing on the front end of a week long fly out hunt. Do not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20141106
    },
    {
      "title": "binocular",
      "text": "I bought this to use with my Outland binoculars. The straps adjusted well, and felt good to the shoulders and back, they did not bind. This was a good price and I am sure they will holdup under hunting use.",
      "rating": 4.0,
      "verified": true,
      "author": "c.sewell",
      "helpful_votes": 0,
      "publication_date": 20130816
    },
    {
      "title": "Great item for the price",
      "text": "This item is solid. It comes with zip ties and metal ring to attch to your binoculars. The harness attches to the rings. Its it confortable. I am about 6' and 215lbs and it has room to go bigger.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos",
      "helpful_votes": 0,
      "publication_date": 20150618
    },
    {
      "title": "Good design except poor attachment",
      "text": "The straps are nice and wide and work well. But the attachment is by hooks. Hooks are bad, won't fit lots of hangers, including those on my binocs. Also hooks easily twist and snap loose.",
      "rating": 3.0,
      "verified": true,
      "author": "Murray Brockman",
      "helpful_votes": 0,
      "publication_date": 20131030
    },
    {
      "title": "Cant beat the price!",
      "text": "Just pulled the strap out of the box, tried it on and it works like a top. Nothing fancy and the strs are pretty easy to adjust. The package comes with a strap 4 small key rings and 4 black small cable ties. I have leuopold 10x42 binocs and the rings slip on with plenty of space to move around when in motion. Im 6'1 215 lbs. with a about a 43 inch chest and 36 inch waist. I could adjust the 4 straps out 3 more inches around the shoulders and 5 more inches around my rib cage for what its worth. Satisfied!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20121229
    },
    {
      "title": "Exactly what I expected",
      "text": "I chose this product for the quality and tradition of the brand in the market. I recommend everyone to buy because besides come within the promised time, my expectations were confirmed with the quality and finish.",
      "rating": 5.0,
      "verified": true,
      "author": "Luiz Roberto Xavier",
      "helpful_votes": 0,
      "publication_date": 20130213
    },
    {
      "title": "Good stuff",
      "text": "For $10 you can't ask for more. Easy to use, elastic is sturdy, comes with 4 small key chain loops.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20160821
    },
    {
      "title": "Five Stars",
      "text": "This is an awesome addition to my camera accessories. Makes it much more comfortable to carry our camera.",
      "rating": 5.0,
      "verified": true,
      "author": "ldw",
      "helpful_votes": 0,
      "publication_date": 20160620
    },
    {
      "title": "ok don't like that the straps are elastic",
      "text": "Does adjust well very easy to put on and off of anything even a camera. Its ok for starters I got them when they were a little less but you can get more sturdy ones from many places for 10.00 more.",
      "rating": 3.0,
      "verified": true,
      "author": "twotravel",
      "helpful_votes": 0,
      "publication_date": 20140221
    },
    {
      "title": "Was a sceptic, now a believer.",
      "text": "I was always skeptical whenever I saw these type binocular straps on the hunting shows. I am so glad that I gave it a try. The strap holds your binoculars in place and they are always there when needed. I highly recommend this strap!",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Wilson",
      "helpful_votes": 4,
      "publication_date": 20121214
    },
    {
      "title": "Good product",
      "text": "Works well. Don't care for the chunky plastic closures where it hooks to the binos - which they where smaller and metal. But it came with 2 sets of nice small keyrings so you can attach those to the binos, and then plastic clasps to those. So, works well.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonShopper",
      "helpful_votes": 0,
      "publication_date": 20131018
    },
    {
      "title": "Great price for nice quality.",
      "text": "The plastic clip makes these a four. If the clips were metal, they would be a five.",
      "rating": 4.0,
      "verified": true,
      "author": "Swamphunter",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "and a friend had recommended using a binoculars harness",
      "text": "This binoculars harness is just what I was looking for! I am a novice birder, and a friend had recommended using a binoculars harness. It keeps the binoculars in a comfortable position on my chest and leaves both hands free while walking. This harness is definitely better than just a strap that hangs around your neck.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory A. Harpst",
      "helpful_votes": 0,
      "publication_date": 20160503
    },
    {
      "title": "Big man...works just fine",
      "text": "8x42 bino's are just fine for these. They sag some but they all do..I shoot lots of 3D archery and would buy these again. If I was going on a $4000 Moose hunt I would upgrade..",
      "rating": 5.0,
      "verified": true,
      "author": "UbenSlayed",
      "helpful_votes": 0,
      "publication_date": 20140418
    },
    {
      "title": "Five Stars",
      "text": "Worked great. Kept my Vortex binos handy comfortably during a weeklong elk hunt.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Davis",
      "helpful_votes": 0,
      "publication_date": 20161029
    },
    {
      "title": "Works great",
      "text": "Got his for my old set of binoculars. Use them while deer hunting. Keeps the binoculars in an accessible location and helps to stabilize your view because of the tension.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Christ",
      "helpful_votes": 0,
      "publication_date": 20140310
    },
    {
      "title": "Works great. Use it when birding all the time",
      "text": "Works great. Use it when birding all the time. Takes the weight off my neck so I love it big time.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20160226
    },
    {
      "title": "Perfect for hunting and scouting",
      "text": "I don't know why I haven't had one of these for ever. They are great. Perfect for hunting and scouting.",
      "rating": 4.0,
      "verified": true,
      "author": "BrettS",
      "helpful_votes": 0,
      "publication_date": 20160105
    },
    {
      "title": "Bino Strap",
      "text": "Holds my Bushnell Bino positively and will be bringing this on all my hunts. No more dangling binos to get in the way. Highly recommended if you walk a lot while looking for the game.",
      "rating": 5.0,
      "verified": true,
      "author": "Rott boy",
      "helpful_votes": 0,
      "publication_date": 20120618
    },
    {
      "title": "Wife Approved.  Your Results May Vary",
      "text": "Purchased for my wife for her birthday to go with the 30lb binoculars I bought her. This works well, is made well, and she is happy. In life, isn't that all a husband can ask for?",
      "rating": 4.0,
      "verified": true,
      "author": "C. Dean Waterman",
      "helpful_votes": 0,
      "publication_date": 20130901
    },
    {
      "title": "4 way bino strap",
      "text": "this is a great product for much less than many others i have seen. as a hunter , binoculars on a neck strap tend to swing around , sometimes tapping on my rifle. this product keeps them tight up to my chest thus eliminating the problem.",
      "rating": 5.0,
      "verified": true,
      "author": "hunter john",
      "helpful_votes": 0,
      "publication_date": 20120917
    },
    {
      "title": "Five Stars",
      "text": "They perform quite well and for a reasonable price. They certainly make field trips with binoculars much more enjoyable.",
      "rating": 5.0,
      "verified": true,
      "author": "mike",
      "helpful_votes": 0,
      "publication_date": 20150706
    },
    {
      "title": "Junk!",
      "text": "Total junk. Came with broken clip. Kludgy mechanism for securing to binocular. Cheap materials. Attempt at customer service with Allen for replacement parts ludicrous. Totally ignored. Go elsewhere,",
      "rating": 1.0,
      "verified": true,
      "author": "Cerius Photobug",
      "helpful_votes": 2,
      "publication_date": 20131120
    },
    {
      "title": "It makes carrying my binoculars so much easier as I ...",
      "text": "It makes carrying my binoculars so much easier as I usually have my camera along. It's always where I want it.",
      "rating": 5.0,
      "verified": true,
      "author": "David F. Rice",
      "helpful_votes": 0,
      "publication_date": 20151003
    },
    {
      "title": "Works fine.",
      "text": "The strap makes it much easier to carry binoculars for extended periods of time. Makes bird watching more enjoyable. Highly recommended if you plan on carrying binoculars around for a while.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Fiddle",
      "helpful_votes": 0,
      "publication_date": 20130717
    },
    {
      "title": "Just what I needed for a sightseeing trip.",
      "text": "Good product that compares to more expensive harnesses. It works well for a camera as well as for binoculars.",
      "rating": 5.0,
      "verified": true,
      "author": "RockDoctor41",
      "helpful_votes": 0,
      "publication_date": 20150702
    },
    {
      "title": "Fantastic Fit",
      "text": "Fits great, easy to use. the binoculars won't pull on your shoulders & back like with a neck strap. The clips were a little too large for my binoculars so I had to improvise to get them to fit, but they work great. Wouldn't trade them for anything.",
      "rating": 5.0,
      "verified": true,
      "author": "Beeg",
      "helpful_votes": 0,
      "publication_date": 20131213
    },
    {
      "title": "excellent product",
      "text": "My wife and I both have used these binocular straps on many trips for over a year, and find them to be very comfortable (so much better than having strap around neck), easy to use, and of quality materials.",
      "rating": 5.0,
      "verified": true,
      "author": "td50",
      "helpful_votes": 0,
      "publication_date": 20131104
    },
    {
      "title": "Seems very Comfortable",
      "text": "I have not used them in the \"field' yet, but I suspect from wearing them around the house they will do just fine. Meets description and seem easy to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Dennis Tracy",
      "helpful_votes": 0,
      "publication_date": 20130217
    },
    {
      "title": "Five Stars",
      "text": "The straps fit well and it holds the binoculars steady.",
      "rating": 5.0,
      "verified": true,
      "author": "rpronesti",
      "helpful_votes": 0,
      "publication_date": 20160505
    },
    {
      "title": "its works well",
      "text": "i have two of these straps ,they work very well and does a go job for the price. I used them while scouting and hunting, they hold the binoculars to my chest",
      "rating": 5.0,
      "verified": true,
      "author": "LSHAM",
      "helpful_votes": 0,
      "publication_date": 20140112
    },
    {
      "title": "allen bion strap",
      "text": "I'm happy with the price but I got what I paid for at this time. I do not think they will hold up to the weight of my swarovski 10x50",
      "rating": 5.0,
      "verified": true,
      "author": "Steve J.",
      "helpful_votes": 0,
      "publication_date": 20140115
    },
    {
      "title": "Make sure you have meatal",
      "text": "Good product for the money, the only problem I had were the fastening clips that attach to the binos , make sure the binos you purchase have metal connection , the plastic ones will break. But the product does a good job",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Garetson",
      "helpful_votes": 0,
      "publication_date": 20140618
    },
    {
      "title": "Great idea, takes the weight off your neck",
      "text": "Great idea, takes the weight off your neck! After a long day hiking or birding, this is much better on the body!",
      "rating": 5.0,
      "verified": true,
      "author": "ReTired",
      "helpful_votes": 0,
      "publication_date": 20140904
    },
    {
      "title": "Nifty Strap",
      "text": "I bought these while a similar product continued on backorder from another company as deer season drew near. This strap was half the price and preformed just as I expected on my hunting trip. I expect to try to use this on my camera when summer and warm weather return.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Weispfenning",
      "helpful_votes": 0,
      "publication_date": 20131208
    },
    {
      "title": "Four Stars",
      "text": "Works as advertised to keep binoculars closed to body but ready to use instantly.",
      "rating": 4.0,
      "verified": true,
      "author": "nipmong",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "Stable and supportive.",
      "text": "Very nice and a quality piece. This will be great for hiking and such. the product is well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin C",
      "helpful_votes": 0,
      "publication_date": 20150119
    }
  ],
  "product_meta": {
    "title": "Allen 4 Way Adjustable Deluxe Binocular Strap, Black",
    "description": "The Allen Binocular Strap is constructed of an elastic body harness that comfortably holds binoculars against your body to distribute the weight off your neck and free up your hands. Great for hunting, birdwatching, and fishing, and it also works for keeping cameras and other items close by. Easily attaches to most binoculars with quick ties, and the harness is adjustable to fit almost anyone. Includes an extra ring and ties to use with a second pair of binoculars.",
    "rating": 4.7,
    "feature_bullets": [
      "Comfortably holds binoculars against body",
      "Distributes weight off of your neck",
      "Great for hunting, birdwatching, and fishing",
      "Can also be used for cameras or other items you need to keep close at hand",
      "Includes an extra ring and ties"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4.05 x 4.85 x 1.7 inches; 3.21 Ounces",
      "Item model number": "199",
      "Department": "Womens",
      "Date First Available": "June 12, 2007",
      "Manufacturer": "The Allen Company",
      "ASIN": "B000RWNEVS",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Sports & Outdoors",
      "Hunting Accessories",
      "Sports & Fitness",
      "Hunting",
      "Hunting & Fishing"
    ],
    "price": 11.99
  }
}