{
  "website_summaries": [
    {
      "verdict": "Earns top marks for its drip-free foam formula and streak-free cleaning action. Ideal if you're looking for a heavy-duty glass cleaner that doesn't contain ammonia.",
      "pros": [
        "Foam clings to glass surfaces, eliminating splashes, drips, and puddles",
        "Professional grade formula delivers thorough, streak-free cleaning",
        "Leaves glass sparkling and clear",
        "no residue",
        "Suitable for all glass surfaces",
        "Ammonia-free",
        "Fresh and pleasant scent",
        "Generous bulk pack lasts for ages"
      ],
      "cons": [
        "Some users feel the scent is overpowering"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "SPRAYWAY HAS CHANGED!!!!!",
      "text": "Been using Sprayway Glass cleaner over 30 years this is the first time I've gotten Sprayway that doesn't clean it just streaks, won't clean at all, used an old can that has been in my truck for years and it cleaned like it should, this new batch has something wrong in the ingredients Batch # 8059A44 11591531 UPDATE Review, got new Sprayway Customer service at Amazon sent it out ,This Spray way had different Batch Number from the one I mentioned in First 1 Star review, this reassures me again why I buy Sprayway Glass cleaner, It cleans streak free as it has done for 30 years Bad batch I guess it happens,",
      "rating": 5.0,
      "verified": true,
      "author": "Gene T",
      "helpful_votes": 47,
      "publication_date": 20180611
    },
    {
      "title": "where have you been all my life?",
      "text": "For years, I've used natural methods to clean my windows and mirrors. I finally had it with hard water stains, dirt smeared on the sills, and a lot of physical effort. This glass cleaner has changed my life! I can't stop cleaning! My house is so bright and sparkly now that the windows are so clean. I now realize how dirty my windows have been all this time. It would be nice if the cleaner was unscented. But that's minor.",
      "rating": 5.0,
      "verified": true,
      "author": "brady @ fresh face skin studio",
      "helpful_votes": 14,
      "publication_date": 20180913
    },
    {
      "title": "Great on various applications",
      "text": "This stuff definitely warrants its high ratings. Sprayed lightly on windows, mirrors and car windows, it removes dirt and grease with ease and does not require repetitive wiping to remove smears. I have used a lot of products over the years and this one truly is heads and shoulders above anything else, including expensive auto glass cleaners that I have used. The foam sprays well but be careful not to apply too much. I have also found other applications for this product, including stainless steel, granite and as a carpet cleaner. I applied it to some heavy, and established, stains on the carpets and it removed them with ease without fading the color at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 9,
      "publication_date": 20190128
    },
    {
      "title": "Great item, priced right and fast shipping.",
      "text": "I purchase the glass cleaner based on recommendations of the shop who installed the tint in my truck due to the fact that it doesn't contains ammonia. The shop was charging $9.99 + tax for one can. Great price and fast shipping. Will definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "187",
      "helpful_votes": 11,
      "publication_date": 20180610
    },
    {
      "title": "Best Value",
      "text": "Great find! I used to buy these at Costco in a 4 pack for much more it seems. Also this set of 12 is way cheaper than the residential use containers. I think the labelling and the cap are the only differences. The smell, consitency, and effectiveness are all the same as the other bottles of the same product. Use these on all of my countertops as they are ammonia free and keep the seal in tact. I also use it on stainless steel as well - works really well. Glass...and mirrors too. Works great with no streaks.",
      "rating": 5.0,
      "verified": true,
      "author": "Carmen",
      "helpful_votes": 5,
      "publication_date": 20190614
    },
    {
      "title": "Best I've ever used...and I've tried and used quite a few",
      "text": "What I like...it cleans really well and does't take a lot of elbow grease. It smells okay, not bad. It seems to leave the glass, for lack of a better term, lubricated, but there doesn't appear to be any smudgeable film. Quite the opposite, it keeps the windows of my car cleaner, longer, inside and out. What I don't like...it is easy to get overspray on adjacent surfaces, despite this being a foam. It is a spray foam. Simple solution is to spray your rag. I use the blue paper shop towels. They work great.",
      "rating": 5.0,
      "verified": true,
      "author": "Simply Stated",
      "helpful_votes": 3,
      "publication_date": 20190425
    },
    {
      "title": "Great glass and all around cleaner",
      "text": "Great glass and all around cleaner. I don;t know if they redesigned the product or what but the previous can that I had did not spray out as hard as this one does. When I spray this, the spray ends up in a wide diameter so I have to be careful where I spray as it will get everything wet. Other than that, it is a great product for cleaning everything. I stopped using Windex and my stainless steel cleaners and have been using this for the past year.",
      "rating": 4.0,
      "verified": true,
      "author": "Ellen M.",
      "helpful_votes": 12,
      "publication_date": 20160611
    },
    {
      "title": "Amazing",
      "text": "If you want a glass cleaner that leaves no streaks or residue this is the cleaner for you! My sister in law was telling me about the new windows she just has installed but was frustrated that no matter what she used to clean them she would see streaks when the sun shone on it. I told her to try SprayWay glass cleaner. She ordered a bottle and tried it out. The next day after seeing the window with the sun shining on it she threw away every single other glass cleaner she had. This stuff really is amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Amazing one step clean and shine",
      "text": "I had fairly high expectations for this stuff based on reviews but it exceeded my expectations. Not only does it leave glass/mirrors streak-free, it actually cleans and removes grime (toothpaste and soap splatter, little greasy handprints, etc.) better than regular glass cleaner and better than most all purpose cleaners. The one tiny down side is the strong smell (not a big deal for me and something I'm more than ok with based on amazing performance and the fact that the smell is not unpleasant).",
      "rating": 5.0,
      "verified": true,
      "author": "novabs",
      "helpful_votes": 7,
      "publication_date": 20170121
    },
    {
      "title": "Best glass cleaner and more - hands down",
      "text": "A friend of mine told me about Sprayway to clean glass. Cleans flawlessly - no streaks and minimal effort. I have discovered that Sprayway is great on many other solid surfaces. Great cleaner on bathroom surfaces and with the alcohol content, disinfects too. Cleans polyurethane finished surfaces well. Good on some plastics, but be careful and test first! Great product and good value. My go to cleaner wherever I can use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Horrible smell",
      "text": "Just my humble opinion as we have been using vinegar and water for most of our glass cleaning, this smells awful. Cleans excellent. The smell lingers for a long time and if you are used to non-toxic, essential oil cleaning, you may want to skip this product. 11 out of the 12 cans came with a cap to cover the nozzle. Do open windows if you use this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Hands down, the BEST GLASS CLEANER AROUND!!!",
      "text": "Especially for cleaning INTERIOR car windows. Does not streak when used as directed. When I use it on my interior winshields of both of my cars, I lay a plastic trash bag over the dashboard just for MY piece of mind. It is sold in places like Auto Zone, but Amazon beats their price! Keep in mind that this is NOT a glass wax. Rain-X is...I recommend you use both on the exterior of auto glass. SprayWay for cleaning and Rain-X for protection and to cause water to bead away when your driving.",
      "rating": 5.0,
      "verified": true,
      "author": "Devout Patriot",
      "helpful_votes": 15,
      "publication_date": 20140106
    },
    {
      "title": "Horrific toxic odor",
      "text": "Had to abandon house after first use. Snells like sone sort of insecticide, made me and my wife feel sick. Very dissappointed and we have 12 of thes suckers! Need to come with large warning emblem not for indoor use. Reslly, Windec is much better.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 2,
      "publication_date": 20190219
    },
    {
      "title": "No ammonia, Cleans bugs easily, Streak Free",
      "text": "Best glass cleaner ever. No ammonia. Streak free. Cleans almost every surface, not just glass! Aviation trusted and used daily. Cleans matte black painted vehicles and aircraft perfectly leaving no spots!",
      "rating": 5.0,
      "verified": true,
      "author": "JUSTBUZZNBY",
      "helpful_votes": 3,
      "publication_date": 20190403
    },
    {
      "title": "Great stuff!",
      "text": "My auto glass installer used this stuff to clean my new windshield that he had gotten fingerprints all over, and it cleaned perfectly! Got me hooked! It cleans off any normal grossness you find on glass, fingerprints, e-cigarette residue, dirt, and general day to day grime. It's a solid product. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Shaun P.",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "This is the stuff to use!",
      "text": "I had trouble finding this in stores a couple times, so bought a case. I know what I like! This stuff really works well. Windows on the house, windows on the cars, mirrors, shower doors, glasses on my face, any kind of glass shines when treated with this stuff. I do recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Lightning1",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Spray away those finger prints and more.",
      "text": "This product will change your life. I love cleaning glass and having that smudge and squeaky clean look and feel. My law office uses this product as well to clean all the various glass surfaces, especially the conference room table. I've also used SprayWay on my car windshield with great results. I would really recommend this to anyone. Pro tips: No much is needed. Actually spraying less can leave a cleaner surface. Less does more. Also, this product works great with micro fiber cloths.",
      "rating": 5.0,
      "verified": true,
      "author": "Konrad",
      "helpful_votes": 4,
      "publication_date": 20150704
    },
    {
      "title": "Great cleaner",
      "text": "Buy this if you use Solar Guard tint on your vehicle. No Ammonia in this cleaner, which is perfect for car tint. Also good for mirrors and windows in the house. Leaves no streaks behind, but smells pretty gross and lingers in your house if you do not open a window (minus 1 star for the smell).",
      "rating": 4.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Leaves a streaky film all over your windshield",
      "text": "I really can't believe all the good reviews for this product. The only reason I gave it 2 stars is because it does clean mirrors very nicely with out streaking. On my windshield? Holy crap! I have never used a worse product. It leaves a cloudy film all over the windshield that is hard to remove",
      "rating": 2.0,
      "verified": true,
      "author": "Bobby D",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "Great glass cleaner, just don’t inhale it",
      "text": "My husband purchased this and loves it. It works really well but I suggest only using it outdoors or on cars, it’s highly toxic with liquid petroleum gas— my husband used it indoor and the scent/chemicals were really hard to air out — not good when you have two kids in the house",
      "rating": 4.0,
      "verified": true,
      "author": "diane",
      "helpful_votes": 2,
      "publication_date": 20180827
    },
    {
      "title": "Very good product",
      "text": "This is the best window clean I’ve used. Gets windows very clean and even makes cleaning car cup holders easy as well. This also got car dealer/auction window paint off windshield. Way better than having to scrape it off",
      "rating": 5.0,
      "verified": true,
      "author": "m",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "The cleaner to use to clean car windows efficently",
      "text": "This the only cleaner to use to clean automobile windows inside and out. I keep a can in each car and in the detail kit. We have to have clean windows in our cars and this cleaner cuts through the bugs and grime.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Bogdon",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "works wonders",
      "text": "this product works really good. not good for people with breathing / asthma problems as it has a very strong chemical odor. But regardless I will buy these again and just wear a mask because it works beautifully",
      "rating": 5.0,
      "verified": true,
      "author": "Esther",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Streak Free Windows & Glass",
      "text": "Sometimes it is necessary to pay a little more for a better quality product. For years, I have been disappointed with the popular glass cleaners that are available everywhere. When I was having a new mirror installed, I asked the technician if there was a preferred glass cleaner. He recommended that I go to the hardware store to buy SprayWay. I found it on Amazon and decided to have it sent. I usually prefer not to use aerosol products. I chose to overlook this fact since the quality far surpasses any of the spray bottle glass cleaners. If you are not using SprayWay glass cleaner, I suggest that you try it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 2,
      "publication_date": 20140908
    },
    {
      "title": "This is by far the best glass cleaner I have ever used and was happy ...",
      "text": "This is by far the best glass cleaner I have ever used and was happy to find it in bulk! I fist discovered it a few years ago as it is safe for tinted windows, I soon found it to be an essential tool in cleaning my motorcycle windshield, really takes off the bugs and does not scratch with a micro fiber cloth (unlike most other cleaners), it is just really good at lifting dirt and grime while being gentle, now I use it to clean everything! It is really amazing stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "wesley Barbosa",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "Works on most everything",
      "text": "I started using this product about five years ago. It's especially handy for stainless steel and glass, but I have been known to use it on the cabinets, which are MDF with a sprayed on finish application (BUT NOT WOOD). It works wonders just about everywhere ... I even clean my bathroom tile floors with it. No sticky residue. I take advantage of Amazon in November and buy a year's supply because you ship it free and it is always ... always less expensive than buying it at Lowe's, Ace, Home Depot. A GREAT product.",
      "rating": 5.0,
      "verified": true,
      "author": "R. D. Sorensen",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "The best glass cleaner available anywhere.",
      "text": "I've been using this same window spray cleaner for a half century on show cars and although I have tried other cleaners in a pinch, SprayWay is by far the superior cleaner. It never leaves any streaks. If it sprays onto the paint of your car, it does not affect the paint and does not damage your wax finish. Fantastic stuff. Here on Amazon the price is great. It is less than half the cost of that charged at \"discount\" stores and a fraction of the cost charged at glass shops.",
      "rating": 5.0,
      "verified": true,
      "author": "Cook & Collector",
      "helpful_votes": 4,
      "publication_date": 20150102
    },
    {
      "title": "The best glass cleaner possibly ever",
      "text": "When I bought my car, the dealership accidentally left a can of this in the back seat. I figured there must be something to it, so I continued to use it. It is probably the best glass cleaner I've ever used, and easily takes off pitch and bug goop on windshields and headlights. I've even used it to take off wax spots left on the car's finish after going through the carwash. One can lasts quite a long time, too. I have used it on mirrors and windows in the house, and it works equally as well. It's definitely a keeper.",
      "rating": 5.0,
      "verified": true,
      "author": "KFLady",
      "helpful_votes": 2,
      "publication_date": 20150801
    },
    {
      "title": "They are not 19 oz.",
      "text": "I bought this product before from Amazon and also from a different factory. The cans are the same and well as the brand. After using the spray 10 times, the can gets empty. It seems like the factory did not fill these cans fully, but instead they are filled with air.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 2,
      "publication_date": 20181003
    },
    {
      "title": "Best window cleaner ever",
      "text": "I've used Windex for years until I got irritated with the constant streaks. My husband actually recommended this to me because he uses it for work. It smells a little weird but it's easy to use. I sprayed on the glass and wipe clean with a microfiber towel. No streaks, clean windows. Very happy with my case purchase should last at least a year",
      "rating": 5.0,
      "verified": true,
      "author": "MamaX3",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Awesome stuff",
      "text": "I was given a free sample at a car show to try out on my car windshield, I was surprised to find the best glass cleaner EVER. Heck I even started using this on other surfaces too, found that it works awesome on plastic and vinyl. I used it to clean my golf cart seats, I forgot how white they used to be. I actually hid it from my wife because I knew if she got it she would snag it from me and I wouldn't have my secret weapon anymore. Well she found it, loved and sent me on a mission to find more. So I bought a case, I wont be without it now.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "I love this stuff. Been using for years.",
      "text": "This is my favorite glass cleaner ever! My friend turned me on to it years ago as he owns a glass company and bought cases of the Sprayway branded for his business. It's great on glass and stainless, gives everything a polished look. I use it for my entire interior of my cars, in between wipe downs of my Harley and to keep everything in the house polished and shiny Not for really messy clean up. use a more aggressive cleaner for grimy messes but do the final touches with this.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil of all trades",
      "helpful_votes": 0,
      "publication_date": 20160105
    },
    {
      "title": "Sprayway glass cleaner",
      "text": "The best glass cleaner I've ever used. Because I have UV protective film on a number of windows ,it is the only glass clear recommended by window cleaning professionals. I also use it on my shower glass enclosures and stainless steel appliances.",
      "rating": 5.0,
      "verified": true,
      "author": "E. R. White",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Packing could be better",
      "text": "Best glass cleaner around. Unfortunately 2 caps were shattered, and one nozzle was broken off rendering that can unusable. Not worth returning a case for 1 can though...",
      "rating": 4.0,
      "verified": true,
      "author": "Chad Peterson",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Best Glass Cleaner Period",
      "text": "Best Glass Cleaner Period,. Been using this product for over 10 years and i use it on everything, cleaning home and auto windshields, Cleaning Car Dash, Cleaning the porcelain in the bathroom, sinks, sink counters. Mirror's, Love the stuff",
      "rating": 5.0,
      "verified": true,
      "author": "TeslaCoil",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Best glass cleaner",
      "text": "Was introduced to this glass cleaner by a glass company when they were installing some mirrors. They went on about how good it was at cleaning and not streaking. I got some and he was right. Only thing I use now. The only thing I’m not crazy about is the smell, but it dissipates and doesn’t linger too long.",
      "rating": 5.0,
      "verified": true,
      "author": "Aquinski",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Excellent and it's not the best window cleaner",
      "text": "I do windshield repair for a living. I use this only in my business. I've tried Safelite I've tried different brands and always end up using this. Results of excellent. Plains windshield with no streaks fast. I use it my home as well. The foaming works well.",
      "rating": 5.0,
      "verified": true,
      "author": "B.m",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "I'm never using anything else.",
      "text": "This is the best glass cleaner I have ever used. For the price, you can't beat it. I purchased a pack of 12 19oz aerosol cans. I will never use anything else. That's how impressed I was after using it. No film, wipes off quickly. It's the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Mister B.",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Did not get what I ordered!!",
      "text": "I ordered a case and only got 8 went in to get help fixing the problem and it is not returnable. That is fine but I want what I paid for.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Best windows in town!",
      "text": "I own a luxury vacation home that is used for weddings that require prestine windows. there are dozens of floor to ceiling windows. this product is easy to use and leaves no streak when used with the proper towels.",
      "rating": 5.0,
      "verified": true,
      "author": "liza",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Leaves streaks - used to be better.",
      "text": "I used to love this product for cleaning windows. However, something is off with this “batch”. I have some to my sister and both she and I found it to be streaky and left smears. It never did that before. I used it also before the sun hit the window and before temps outside were too warm - but still streaky. Not happy with it. Not sure if formula changed or if the batch is a problem.",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Missing and Damage",
      "text": "The product overall is good. Clean window. No streak at all. Pleasant smell. I order 12 cans but only received 11 cans in the box. Also the packing was really poor, only a few air bubbles inside, 1 can got damaged and leak the gas everywhere inside. Now I only got 10 cans. Amazon should be more careful with packing any liquid or gas can type.",
      "rating": 1.0,
      "verified": true,
      "author": "Realbuyer711",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "great for home and vehicle windows",
      "text": "I used on home and vehicles with great results. I would spray on and let set for30 seconds and then wipe off using two or three paper towels and the windows were perfect. Be careful and not overspray takes a few minutes to learn then no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "James Woods",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Great value this stuff works on everything",
      "text": "Great value this stuff works on everything. Not just a glass cleaner I have used it to remove stains from the carpet clean interior dash etc. The spray cans seem to work pretty well good pressure",
      "rating": 5.0,
      "verified": true,
      "author": "djtrob",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Boy does it stink!  I had to open up all the windows for 30 minutes after washing just one windows",
      "text": "Everyone one in the family thought the smell was toxic.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Superior streak free window cleaner for home & vehicles!",
      "text": "This is the best window cleaning product I have ever used! I wish I would have known about this when I lived in my last house which had a slider to the deck. My brother actually told me about this product because he swears by it for his over 5000 square foot home with tons of enormous windows! This is a great product for windows in your vehicles. It will remove film left by cigarette smokers on the inside of the windows also. I bought the Amazon microfiber cloths to use with this and they work perfectly together. A+ products!",
      "rating": 5.0,
      "verified": true,
      "author": "TeleKawaru@centuryinter.net",
      "helpful_votes": 0,
      "publication_date": 20150709
    },
    {
      "title": "Very good ammonia free glass cleaner!",
      "text": "Very good ammonia free window cleaner. Excellent for new shower glass doors that require ammonia free cleaning. Really good for car windshield particularly the interior.",
      "rating": 5.0,
      "verified": true,
      "author": "RxKing",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "The best!!!!!",
      "text": "The best spray glass cleaner out on the market. I’ve used this brand for 15 years. I use it to clean any shiny surface, not just glass (including wood floors for polishing). Be sure to shop around as it took me a while to find this seller at this price.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher T.",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "A Very Effective and Convenient Window Cleaner",
      "text": "Sprayway is very good for windows and mirrors, but it has some streaking problems with windshields. I think this is because one only rarely looks through windows directly into the sun, whereas that's a frequent occurrence with windshields, and that's when you'll notice the streaks. With the sun at your back or to the side, everything is fine. One star off for the windshield streaks and because one of the twelve cans arrived with a broken and unfixable valve. This may have been a very unusual happening, but I just don't know.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob W.",
      "helpful_votes": 2,
      "publication_date": 20131125
    },
    {
      "title": "Best glass cleaner",
      "text": "My office is my car and this stuff is the best cleaner I have ever used. Very easy to get a streak free clean window with this stuff. I use terry towels or paper towels and it works with either one. I don't even use a clean towel every time and it still does a great job.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Swartz",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Streak free drip free!",
      "text": "I was a former Hope’s perfect glass user until I found this! The foam is perfect bc it never drips. You don’t have to rush to chase dripping liquid as the foam stays put. Perfect for inside cars. Spray on inside sunroof and no dripping on your head! Glad I could order in bulk on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Martha Schachinger",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "This spray is MAGICAL! Worth every dollar!",
      "text": "This spray is MAGICAL! I work in a building with more glass surfaces than you can possibly imagine. After 20+ years of using Windex, the discovery of this spray is changing our lives. It used to take us 30 to 45 minutes every morning to clean all our glass showcases with lots of elbow grease. Now? A quick 15 minute spray and wipe and our glass looks better than it ever did! I cannot recommend this enough! Try it and see for yourself!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Best Glass Cleaner",
      "text": "This gives glass an amazing shine. I use it on chrome and it brings it back to life. The scent is fresh and light. Honestly the price doesn't matter because it is priceless.",
      "rating": 5.0,
      "verified": true,
      "author": "Camille",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Worked well to clean car windshield",
      "text": "Got a recommendation from a friend who works in the auto glass industry to try SprayWay, as they use it at their shop. Was happy I did, these seem to clean really easy and does a great job. Also no ammonia smell, which is a plus, especially when doing the interior windows.",
      "rating": 5.0,
      "verified": true,
      "author": "Andries Engelbrecht",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "THE BEST!",
      "text": "This stuff is the best! It smells good and doesn’t have the typical chemical for window cleaner. The foam makes all the difference and cleans your glass until it shines. I have even convinced my place of work to switch to this cleaner. Try it, you won’t go back.",
      "rating": 5.0,
      "verified": true,
      "author": "TL",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Great value great product",
      "text": "I love this product cleans surfaces without smearing works great. Great value in this quantity",
      "rating": 5.0,
      "verified": true,
      "author": "Nerake0",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Love it!  Excellent product for glass!",
      "text": "My housecleaners recommended this product and they were right! It’s great on windows, shower doors, and other glass surfaces. I now keep one in each bathroom.",
      "rating": 5.0,
      "verified": true,
      "author": "E Coop",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "My Favorite Glass Cleaner.",
      "text": "Love this glass cleaner. No ammonia does not streak. I get a really looking clean on mirrors and glass with this product. Have been using for a number of years. I have tried many different glass cleaners and this is far superior to the others. My favorite glass cleaner.",
      "rating": 5.0,
      "verified": true,
      "author": "Val C",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "No streaks!",
      "text": "This is the only glass cleaner I buy. We used it at a company I worked for over twenty years ago. I still use it. It cleans quickly without streaking making it last longer. A great product.",
      "rating": 5.0,
      "verified": true,
      "author": "David L. Emrick",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Favorite!!!",
      "text": "Love this glass cleaner. I will not use anything else this package allowed one in every room with backups.",
      "rating": 5.0,
      "verified": true,
      "author": "Escape",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Awesome",
      "text": "I love the cleaning power for my car windows, for mirrors and even my stainless appliances. Does a great job on windows without all the runny mess that other cleaners produce.",
      "rating": 5.0,
      "verified": true,
      "author": "Gene",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Best care !",
      "text": "For windows to delicate ARTS Museum Glass, this is IT ! Does the job easily without harm.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce ",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Really works!!!",
      "text": "Wow! This stuff is awesome! We have given to daughters and neighbors to try! Everyone is amazed by how well it works! Just remember to use microfiber cloths for best results!",
      "rating": 5.0,
      "verified": true,
      "author": "Penny W.",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Works great",
      "text": "Love this foaming glass cleaner. No streaks and actually cleaned the windows my dog dirties daily",
      "rating": 5.0,
      "verified": true,
      "author": "J. Mitchell",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Cleans great",
      "text": "Great cleaner. Goes on easy, comes right off with a few wipes. Doesn't leave streaks.",
      "rating": 5.0,
      "verified": true,
      "author": "goldwing guy",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Quick, clean, streakless windows",
      "text": "Have a automobile detail shop and this is all we use. There are lots of concentrates that are cheaper we have tried over the years. But, time is money and this is the quickest way to get clean windows without streaks",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "... Glass Cleaner for years and this multi-pack was a great price. It is the best glass cleaner we ...",
      "text": "We have been using SprayWay Glass Cleaner for years and this multi-pack was a great price. It is the best glass cleaner we have found and we use it for other hard surfaces as well. I always keep a can in my car. Very easy to use and it leaves no streaks. Excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Cubby",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "Best brand!",
      "text": "Been using this brand for years! I would give it 10 stars if I could.",
      "rating": 5.0,
      "verified": true,
      "author": "Justine G.",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "The best glass cleaner",
      "text": "By far the best glass cleaner . It smells great and doesn’t streak at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "The Shiniest Window Cleaner On The Market!",
      "text": "We use Sprayway for our windows, car, and mirrors. It just can not be best by any other product out there!",
      "rating": 5.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Streakless shine.  Love it",
      "text": "This is the only glass cleaner we use. No streaks. We use it on mirrors, glass , cars windows and our granite counters.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn DiFlori",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Definitely would recommend!",
      "text": "As much as I would like these to be cheaper they are one of the best glass cleaners out there and I vain the cleaning all my windows with them and they look really good.",
      "rating": 5.0,
      "verified": true,
      "author": "tonbo",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Use with the blue Scott paper towels for amazing results!",
      "text": "Best ever! Have been using for thirty years. Cuts through built up grime easily. On really dirty windows that have paint speckles I use a straight edge razor and scrape the glass while wet with cleaner.",
      "rating": 5.0,
      "verified": true,
      "author": "tonybazz",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Professional Grade, Bargain-bin Pricing",
      "text": "This stuff is amazing. It removed water spots and leaves the windows not only looking good, but smelling good too! I just can’t get over the price! I purchased a 12-pack for cheaper than I could purchase a two-pack of similar products that don’t work as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Love this window cleaner!",
      "text": "Best product! No streaking. Love the foamy type application and fresh, clean smell. Works wonders on windows (I pair with newspaper for best clean).",
      "rating": 5.0,
      "verified": true,
      "author": "OC97045",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "My go to household cleaner",
      "text": "My absolute go to house hold cleaner. I used it for everything and love the finished product. Will continue to use it for my cleaning needs.",
      "rating": 5.0,
      "verified": true,
      "author": "SVA",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Sparkling Results",
      "text": "Best glass cleaner on the market. I will never buy any other glass cleaner ever. Worth every penny..leaves such a clear,streakfree finish.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna cho kiever",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Keeps Car Windows Clean",
      "text": "Cleans car windows without streaks. Use with old kitchen towels for best results. The case price beats buying individual cans at the store by more than 50%.",
      "rating": 5.0,
      "verified": true,
      "author": "cathytalking",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "happy camper",
      "text": "Got what i paid for, its glass cleaner. No damage to the cans or shipping box. Thank you. Will buy from again.",
      "rating": 5.0,
      "verified": true,
      "author": "gary j.",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Great product",
      "text": "I love this scary it is easy to use and it cleans really well. No streaks.. I even use it for my counter tops and it get all the stains off..",
      "rating": 5.0,
      "verified": true,
      "author": "April  Leyden",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Best cleaner ever",
      "text": "Best cleaner ever. I use it for sinks, the toilet and tub exterior, all fixtures, counter tops, stove tops, glass. It dries streak-free, it removes stickiness and grease. There is no better way to clean a cook surface or splash guard than this. It makes things gleam. I love this cleaner and won't let myself run out. I appreciate being able to buy it by the case, but occasionally I do find individual cans for a dollar cheaper per unit from Home Depot.",
      "rating": 5.0,
      "verified": true,
      "author": "Verdadian",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "Streaky mess",
      "text": "This must be a bad batch. I've been using this product for years and have always been pleased, but these cans leave a streaky mess. Super unhappy.",
      "rating": 1.0,
      "verified": true,
      "author": "Bonnie Rolin",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Works wonders",
      "text": "This product is amazing, I bought it to clean the inside of my car's windows but ended up using it for the house as well. It also cleans well with regular paper, not just with microfiber cloths. And it smells good, too! The 12-pack is very convenient price-wise.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorenzo L.",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "Find product excellent product",
      "text": "I kept five and gave the rest out as Mother’s Day presents",
      "rating": 5.0,
      "verified": true,
      "author": "LeeAnnMorris",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Great bulk price Amazing glass cleaner",
      "text": "As a professional cleaner and cleaning service owner this is my favorite glass cleaner ever! Spray is perfect streak free looks amazing and this is a fantastic bulk deal. Will be subscribing",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn Holdren",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Best glass cleaner",
      "text": "I've used this product for years, I use to use Windex but SprayWay is far more superior over many other brands out there and the scent is very pleasant",
      "rating": 5.0,
      "verified": true,
      "author": "Michael L.",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Great glass cleaner!!!!",
      "text": "As far as I’m concerned this is the best glass cleaner out there. I detail cars and this is absolutely the best product!!",
      "rating": 5.0,
      "verified": true,
      "author": "James Smith",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "No drip glass cleaner!",
      "text": "I was tired of buying glass sprays that drip upon spraying on the glass! I spent most of the time racing to catch the drips before the cleaner landed on the floor! I tried one bottle of the SprayWay cleaner and I was hooked! Not only does the spray stay put on the glass, it also doesn't streak! Love this product! 5 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonlady",
      "helpful_votes": 0,
      "publication_date": 20171123
    },
    {
      "title": "Wife says this is the best glass cleaner she's ever see/used and loves this. We use it at home and in our rental houses.",
      "text": "Wife says this is the best glass cleaner she's ever see/used and loves this. We use it at home and in our rental houses.",
      "rating": 5.0,
      "verified": true,
      "author": "Erik Okerholm",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "I will never buy liquid glass cleaner again!",
      "text": "I have a friend who cleans for a company. She knows about the best cleaning products and recommended this foam spray cleaner. You don't have to worry about streaks like you do with liquid spray. I will be buying more of this!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Springer",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Amazing best cleaner",
      "text": "Amazing best window cleaner ever will clean windows with a wet cloth without needing to keep spraying",
      "rating": 5.0,
      "verified": true,
      "author": "JAMES P MEDENDORP",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "Best glass cleaner out there",
      "text": "By far the best glass cleaner out there. Use it for my store where we have a lot of display cases and lots of glass doors which means a lot of kids fingerprints and adults too!",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel S.",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Great Product",
      "text": "I own a Karate School and this is our go to glass cleaner between professional cleanings!",
      "rating": 5.0,
      "verified": true,
      "author": "B. Maben",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Cant say enough good things about this product",
      "text": "This is my go2 for cleaning marble and glass back splashes. Cant say enough good things about this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Julian",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Great product! Works better than expected.",
      "text": "I used This for cleaning a car before painting it. I also Used it on my mirror at home. This stuff is awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "MKM",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Great cleaner",
      "text": "I love this glass cleaner! It does not streak, unless your cloth is already too wet. I use it for more than glass, like an all purpose cleaner.",
      "rating": 5.0,
      "verified": true,
      "author": "paigezmum",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Love Sprayway. As a professional housekeeper",
      "text": "Love Sprayway. As a professional housekeeper, I try to have it on hand. Thanks for the GREAT product (& price).",
      "rating": 5.0,
      "verified": true,
      "author": "KrazayKougar1975",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Best glass cleaner EVER",
      "text": "This is the best stuff to clean windows leaves no streaks and cleans great. I have tried lots of different glass cleaners and this one is the best",
      "rating": 5.0,
      "verified": true,
      "author": "ca",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "True, one-pass, non-streaking, economical cleaner forall glass and other smooth surfaces.",
      "text": "Don't know how they do it when there are a million products out there that have some streaking or other issues, but these folks have a perfect product for shower doors, mirrors, windows, ceramic, gloss-painted furniture, you name it. I'll bet this is what they use in hotels, it's that perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "RF Winans",
      "helpful_votes": 0,
      "publication_date": 20161208
    },
    {
      "title": "Grat Product",
      "text": "This cleans much better than other window cleaners. It does not streak. Will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Derrick",
      "helpful_votes": 0,
      "publication_date": 20200210
    }
  ],
  "product_meta": {
    "title": "SprayWay SW050-12 Glass Cleaner, 19 oz, Pack of 12",
    "description": "Size:12 PackSprayway® Glass Cleaner cleans and polishes glass, mirrors, windshields, and windows. This easy-to-use, fast-acting product uses a clinging foam to break up soils and hold them-even on vertical surfaces. There is no dripping, running, or streaking. With its exclusive formula, using denatured alcohol and no ammonia, it cleans thoroughly, dries quickly, requires no rinsing, and leaves a pleasant, fresh aroma. 12/Case.",
    "rating": 4.8,
    "feature_bullets": [
      "Heavy-duty foam clings to vertical surfaces",
      "Guaranteed to leave no film",
      "Contains perfume-grade alcohol for best performance",
      "Ammonia free",
      "Spray and wipe clean",
      "Excellent for windows, mirrors, windshields and other glass surfaces",
      "Heavy-duty foam clings to vertical surfaces",
      "Contains perfume-grade alcohol for best performance",
      "Guaranteed to leave no film, streak less shine",
      "Ammonia-free with a clean fresh fragrance"
    ],
    "specifications": {
      "Manufacturer": "Sprayway",
      "Brand": "Sprayway",
      "Model": "050-12PK",
      "Item Weight": "1.43 pounds",
      "Product Dimensions": "2.7 x 2.7 x 10 inches",
      "Item model number": "SW050-12",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "SW050-12",
      "Folding": "No",
      "Cover Included": "Kkk",
      "Special Features": "Sprayway 50 is a foam aerosol spray glass cleaner- it will not run, drip, or streak and is ammonia free. It removes fingerprints, dust, dirt, lipstick, smoke film, and other common soils from most surfaces with ease. Perfect for cleaning and polishing glass, mirrors, windshields, and windows. Fast acting and easy to use product! Great for professionals, car detailing, and home use!",
      "ASIN": "B000BQPIGY",
      "Customer Reviews": "4.8 out of 5 stars1,452 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#3,766 in Health & Household",
      "Date First Available": "February 15, 2006"
    },
    "categories": [
      "Glass Cleaners",
      "Household Supplies",
      "Automotive Parts & Accessories",
      "Health & Household",
      "Household Cleaning"
    ],
    "price": 37.62
  }
}