{
  "website_summaries": [
    {
      "verdict": "These clogs have the classic Birkenstock sole and a solid all-leather front.",
      "pros": [
        "Very comfortable slip on shoe",
        "Awesome arch support",
        "Good looking",
        "Relief for aching feet",
        "Leather is sturdy",
        "Buckle helps you adjust fit for your arch",
        "A good shoe for men and women"
      ],
      "cons": [
        "Like all Birkenstock shoes, there is a breaking in period for the sole before it becomes its most comfortable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Dress up or dress down, either way super cute!",
      "text": "These are super comfortable. I was a little worried how I would wear these but they are cute with just about anything. I can wear them with my scrubs or dress them up for the office. I usually wear a size 7.5 so I went with the size 38.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy S. Pile",
      "helpful_votes": 29,
      "publication_date": 20170813
    },
    {
      "title": "... because I developed Planter Fascitis which can be very painful. I wear these Berkies just about everywhere now ...",
      "text": "I had to get these because I developed Planter Fascitis which can be very painful. I wear these Berkies just about everywhere now except at work. The built in arch is a perfect fit for my flat feet and they feel great! A bit expensive but well worth the investment for my feet.",
      "rating": 5.0,
      "verified": true,
      "author": "JDan the Amazon man",
      "helpful_votes": 18,
      "publication_date": 20180916
    },
    {
      "title": "The most comfortable shoes for hospital & lab!",
      "text": "This is my first pair of Birkenstocks and I absolutely love these shoes! First off, they came a day earlier than expected and when I tried them on I couldn't take them off! Second, the soft bed feels like a dream and walking around the hospital and doing bench work in the lab all day is way more comfortable than my usual Nike sneakers or my no-namebrand pair of clogs (see photo for comparison). These shoes were also water resistant as I noticed after stepping in a puddle. Overall, I am impressed!",
      "rating": 5.0,
      "verified": true,
      "author": "Future MD",
      "helpful_votes": 27,
      "publication_date": 20160930
    },
    {
      "title": "Many Counterfeits!",
      "text": "I've boughten several pairs. This is from a 'authorized seller', see the mold! I bought another pair from an 'Authorized Seller' from Germany, the fakest of fakes. That seller manufacturers shoes, and also sells \"Birkenstocks\". I would Strongly suggest you go directly through the Birkenstock exchange for any Birkenstock purchase. The 3 pairs I have bought from Amazon were either Damaged or Fake. If you buy the real deal, WONDERFUL Shoes! you buy fakes for the same price, ugh, not even close.",
      "rating": 1.0,
      "verified": true,
      "author": "JustKnow",
      "helpful_votes": 8,
      "publication_date": 20190619
    },
    {
      "title": "My favorite shoe",
      "text": "I have the Arizona sandal and it's helped tremendously with my foot pain and hip pain. I put them away for winter and wore boots and noticed my hip pain return. So I purchased the clogs to wear during winter. The cork bed forming to the shape of your foot is so beneficial. By BIrkenstock sizing I should wear a size 39 for my size 8 foot. However, I have short toes so the 39 are way too long for me. The 38 fit perfectly. Keep trying until you get the right fit. It's worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bronte",
      "helpful_votes": 19,
      "publication_date": 20170209
    },
    {
      "title": "One Great Shoe",
      "text": "I was recently diagnosed with Achilles tendinitis and a calcaneal bone spur on the back of my right foot. To say this is a painful condition is to minimize the depth of the pain. The orthopedist suggested wearing shoes without backs and I had worn Birkenstocks many years ago. I ordered this pair of unisex Boston soft footbed Habana and they arrived today, August 18, and I just love them. It's the best my feet have felt in a very long time. So, today, I am ordering them in a different color. High praise for a well-made and comfortable shoe. Thank you, Birkenstock!",
      "rating": 5.0,
      "verified": true,
      "author": "L. P. Zuber",
      "helpful_votes": 10,
      "publication_date": 20170818
    },
    {
      "title": "extreme caution - a horrible design that cost me a toe (amputated)",
      "text": "I bumped my foot and I might as well have worn wooden clogs. The impact of the front of the shoe on my toes was extremely hard. In a normal shoe this can't happen, because the foot won't have space to slide/slam very hard against the front of the shoe, and if the front of this shoe had been softer it wouldn't have been a problem either. Because of this idiotic shoe design, my toe was heavily bruised, became infected, and finally had to be amputated... If my toe had not been amputated in time I could have lost my foot. The ordeal took almost a year...",
      "rating": 1.0,
      "verified": true,
      "author": "J.D.",
      "helpful_votes": 6,
      "publication_date": 20181124
    },
    {
      "title": "Not suitable for competitive clogging.",
      "text": "As a competitive clogger I'm always on the lookout for the perfect clog. The clog that will help me go from your average Joe clogger to the kind of clogger your wife and kids would be proud of. While this Birkenstock Boston Clog is not the clog that will make me rival the clogging great like Hans Offmee and Jorgen Flugenflorgen, it is quite comfortable to wear around the house and saunter out in when not in a competitive clogging environment. Again, if you're looking for a competitive clogger, keep looking and consult your local clogging professional. If you want a truly comfortable slip on shoe, buy this.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Grady",
      "helpful_votes": 12,
      "publication_date": 20161228
    },
    {
      "title": "TERRIBLE TRY BEFORE YOU BUY EXPERIENCE",
      "text": "RIP OFF $150 Product arrived in a filthy destroyed box that was obviously a return. Product had factory string and hair on it. My hands were black after touching box and product. I had to pay $8.00 to ship it back immediately after opening it. This was by far the worst shopping experience... What a rip off.",
      "rating": 1.0,
      "verified": true,
      "author": "student",
      "helpful_votes": 3,
      "publication_date": 20200114
    },
    {
      "title": "Wow --- actually worth the price.",
      "text": "I was hesitant because ... well ... the price. I have horribly flat feet and I can rarely wear any clog or sandle that won't allow inserts. But I must say, the arch supports on these clogs are INCREDIBLE! I mean, these are now the most comfortable shoes I own! So, if you are delaying because of the price, I recommend you just take the plunge. You will get a great pair of clogs that will likely last a couple of years.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory",
      "helpful_votes": 2,
      "publication_date": 20200224
    },
    {
      "title": "Proper support and foot positioning",
      "text": "Upon receiving I was concerned with fit of clog. It takes a while for clog to adjust to one's foot as well as for the foot to correctly reposition itself. After a couple week of wearing several hours a day I absolutely enjoy these clogs and my foot problems are all but gone. While they appear a bit more expensive that alternatives, all considered they are not. I had been wearing Merrill clogs with Superfeet - the combination of the two are a bit more expensive than the Birkenstocks with less overall foot support. Both options are good, but Birkenstocks are better.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Schneider",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Beware!!! It says Soft footbed but the item I received is NOT!!",
      "text": "I ordered this back in August to get ready for fall/ winter season. I just started to wear them noticed their foodbed is hard. I only wear soft footbed Birkenstock so this hurt my feet and looked it up the order to make sure I ordered the correct item. The listing says soft foodbed but I received the regular footbed..... now I am trying to call the vendor and see if I can exchange them out. I am so disappointed...",
      "rating": 1.0,
      "verified": true,
      "author": "Gee Kim",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Love these shoes",
      "text": "I love these shoes so much. I have a myriad of neck, back and hip problems, and Birkenstocks are my go-to shoes to provide the stable support I need. I ordered these in my regular Birkenstock size and they fit just as well with socks as without. I was worried that they'd look clunky (I'm in my early 30s and still want to look a little stylish) but they look cute with some patterned socks and jeans. And of course they are so ridiculously comfortable! I've ordered from the Birkenstock website before, but returning was such a hassle, I was so happy to purchase these from Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "MissMae",
      "helpful_votes": 3,
      "publication_date": 20170818
    },
    {
      "title": "Kind of pricey but well worth the comfort !!",
      "text": "I usually wear a size 13 in running shoe. I got the size 45 because that’s what my other birk sandals were. They fit perfect. They were a little incompetent for about a week and a half. One i started to break them in they felt like heaven. They are amazing on my feet and they are my go to shoes when I come home from work. The quality is good and looks like they will last a long time. The price was high but it’s worth it. Don’t pay less for imitation sandals. The price is worth the quality. (After the break in period )",
      "rating": 5.0,
      "verified": true,
      "author": "Daddy Bear",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Love these! I am a dental hygienist and was ...",
      "text": "Love these! I am a dental hygienist and was wearing crocs to work - they have no support and my feet and knees were killing me. So I got these for the support, they are great, broke them in in one day. My knees & feet don't hurt anymore!! I'm a size 5 so these in a 36 were a little big, but I like that because I hate wearing tennis shoes - too hot! I can wear socks with these and they are roomy, so my feet don't get so hot.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 5,
      "publication_date": 20170806
    },
    {
      "title": "Disappointed severely.",
      "text": "Something is wrong with these Birkenstock’s. Or they are knockoffs being sold on Amazon as real ones. I have owned to many pairs to count and never have I had a sole peel away from the leather in just over a month of owning them. Very disappointed if you want Birkenstock’s order them from Birkenstock.",
      "rating": 1.0,
      "verified": true,
      "author": "beatnik",
      "helpful_votes": 3,
      "publication_date": 20190923
    },
    {
      "title": "... a pair of Birkenstocks before and they are highly recommended by several people I work with so I decided ...",
      "text": "So I've never had a pair of Birkenstocks before and they are highly recommended by several people I work with so I decided to give these a shot. The first week I hated them. The soles were painful and I dreaded putting them on. I persevered to break them in, adjusted the straps a bit, and after a solid 6 weeks of wear they are perfect. The soles softened up and are now form fitted to my arch. I think it was just a little too much arch support at first. The leather looks beautiful as well. When I wear through these you can bet I'll buy another pair!",
      "rating": 5.0,
      "verified": true,
      "author": "joecool862",
      "helpful_votes": 2,
      "publication_date": 20171125
    },
    {
      "title": "Amazing",
      "text": "Birkenstocks products are the best ever made. I have three different pairs of sandals and I decided to buy these clogs for my work. I work at the hospital. They fit perfectly, very comfortable and don’t slide off. They do hurt a little by the end of my shift but they usually take me about 2 weeks to break in. If the hurt, give them sometime and they will eventually mold to your feet. I also love the oiled leather as they are easy to clean. Amazing company",
      "rating": 5.0,
      "verified": true,
      "author": "Sydney Welbaum",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Made my toes numb. Had to return.",
      "text": "These hurt my feet and made my toes numb. The raised toe bar inside the shoe was really hard. (I read somewhere that these can take a year to properly break in) I still believe that these shoes deserve a 5 star rating because they were obviously very well made with high quality materials and they looked awesome. Really thick solid leather. Buckles and connections more secure than the White House. Returning these was easy and I asked for my refund to be placed on an Amazon gift card balance. My money was there super fast. These just weren't the right shoes for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Jillithid",
      "helpful_votes": 4,
      "publication_date": 20160814
    },
    {
      "title": "Nothing else comes close",
      "text": "This my second pair of clogs. I've worn the first pair for about five years and noticed these on Amazon at a good price reduction. So I thought it's time for another pair. I've worn birkenstock sandals for many years and nothing else comes close. I first started wearing them about twenty years ago when I had planters faciaitis. A podtliarist recommended them so I decided to try them. They worked wonders for my feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Don",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Consistently perfect",
      "text": "Birkenstocks are always perfect! True to fit, feels perfect from the first step to 3 years later (wearing them 4-5 days a week)! I get compliments and my feet are so happy! I am a nurse and a Nurse Practitioner, so I am on my feet constantly. After trying hundreds of brands, I have learned to always go to Birkenstock...they are always comfortable and my feet and back are always happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Birkenstocks are perfect.",
      "text": "I have very wide feet, and the normal width fits well. This is my first time getting the 'soft footbed', and it's pretty amazing. Subtle, but definitely adds to the comfort. The black leather is very nice, and I can wear this shoe to the office without feeling casual. Birkenstock, in general, is the only shoe I can wear that doesn't hurt my feet in any way. Even Dansko's Professional in wide is perfect in every way except the width; it's a smidge too narrow and makes my feet ache and go numb.",
      "rating": 5.0,
      "verified": true,
      "author": "Emmy W.",
      "helpful_votes": 3,
      "publication_date": 20170623
    },
    {
      "title": "He was always gently pointing out he would like them as a gift",
      "text": "I got them as a present for my fiancée. He was always gently pointing out he would like them as a gift. I finally made his wish come true LOL and he loved them. Exactly as pictured and the fit is true to size. Be sure to convert your US size using their conversion table and consider the shape of the sandal and add a size. For example, my partner is US size 12, so I got him size 13 equivalent to 46. They fit perfect. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Orangeandbananas",
      "helpful_votes": 2,
      "publication_date": 20171218
    },
    {
      "title": "This is a big shoe...",
      "text": "I like this shoe and wear on a daily basis with thick wool socks. I do not anticipate being able to wear in the warmer months. Closed toe shoes are a requirement for work and will be purchasing another, smaller pair for warmer months. The sole appears to be wearing faster than previous pairs. It is a very wide shoe. I have average width feet but, do not like my toes to feel \"bunched up\", so this is not a problem. My arches are very high. I wouldn't consider the support to be extraordinary, but I stand comfortably, for twelve hour shifts.",
      "rating": 4.0,
      "verified": true,
      "author": "OK Amy",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Can't live without my Birkenstock shoes",
      "text": "I have tried all kinds of shoes. I am a Nurse and work on my feet non stop. I have suffered with plantar fasciitis. I have had three different foot surgeries. These keep me from being in pain. The shoes I recieved dont appear to be cheap knock offs and are leather. Happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Skymom",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "I like the shoes however it's very hard to get the ...",
      "text": "I like the shoes however it's very hard to get the size right. Have returned two pairs so far starting at size 41, then a 42, and now Im up to a 44 and can only hope they fit this time. I used the chart provided to order. I have a 9 1/2 foot. I ordered a 10 1/2, then a 11 1/2 and now 2 sizes bigger than that and Im guessing they'll finally be right if not a little big which I want. So good luck getting the fit right. Christo",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Starrett",
      "helpful_votes": 2,
      "publication_date": 20171107
    },
    {
      "title": "junk, do not hold up to easy wear",
      "text": "these are not leather uppers. the upper part cracked and broke within one year. i hardly wore them and I am easy on shoes.",
      "rating": 1.0,
      "verified": true,
      "author": "BettyR",
      "helpful_votes": 5,
      "publication_date": 20180517
    },
    {
      "title": "Comfortable from day one",
      "text": "Super comfortable shoes right out of the box. Especially for leather, which usually requires some breaking in. Wore them for an eight hour work shift, mostly standing on cement, the day after I got them, without issue. And they stay on my feet better than other “clog” type shoes I’ve had - while I couldn’t run in them, they stay in place perfectly during normal walking and driving. Very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon L Lovejoy",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Not Thrilled",
      "text": "Own many pairs of Birkenstock sandals and LOVE them. I was quite surprised with how narrow these were and the leather is very stiff. The first day I wore them to work they made this loud bizarre squeaky noise caused by air getting under the arch of my foot and then expelling it out the back of the shoe as I walked. My co-workers thought it was hysterical...I did not find it amusing. It does not happen when I wear stockings in them. I am going to work on wearing them more around the house to break them in.",
      "rating": 4.0,
      "verified": true,
      "author": "J. SCHATZMAN",
      "helpful_votes": 4,
      "publication_date": 20160210
    },
    {
      "title": "Arch support feature",
      "text": "Love these. Amazing arch support. Adjustable strap for easy customization. Smooth easily cleaned finish. Not dingy like suede gets.",
      "rating": 5.0,
      "verified": true,
      "author": "Allie Skillern",
      "helpful_votes": 19,
      "publication_date": 20151025
    },
    {
      "title": "Love the shoes should have gotten N instead of W",
      "text": "The soft footed is great! I have a lot of Birks but this is my first soft footed. I'm sold! The size 38 fits perfectly for woman's 7 to 8 but I should have gotten narrow. Will have to wear with thick socks. Took so long to get here I'm not going to send them back. Must have been some kind of unusual delivery problem. I like the style even better than i thought i would. The leather is beautiful.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171124
    },
    {
      "title": "happy feeters",
      "text": "I have worn these twice the second time being for most of the day with no significant discomfort. I know time will soften up the leather and the shoes will better conform to my feet. I like the fact these are real leather not a man made fiber. I got these because SAS no longer makes a brown shoe in this style. The brown color is a bit darker than I expected but I know leather is hard to have consistent coloring from hide to hide so I'm ok with the shade of dark brown shoes I got.",
      "rating": 4.0,
      "verified": true,
      "author": "CLPS",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "Love my new Birkenstocks",
      "text": "Love my new Birkenstocks. Fit like a comfortable slipper. My last pair were Arizona Birkenstocks that I actually wore year round with heavy socks. It is now 12 years and I am still wearing them; they have been re-soled a couple of times. I figured it was time to get a closed toe, now that winter is approaching again. Needless to say, I do love my Birks. By the way, I am 75 years young. But a reminder for Newbies: you must get the right size, and you must break them in. See comments by other members on this site who are more knowledgeable in this area than I am.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ann",
      "helpful_votes": 9,
      "publication_date": 20130911
    },
    {
      "title": "Finally a good fit",
      "text": "I got these after my physical therapist recommended for plantar fasciitis. I had tried them before but they were always too wide. So now I know why- they are actually sized for men! But these are perfect with the N width. They are not narrow-just the right amount of narrow for a womens foot. They were new in box in perfect condition. I am wearing for short periods to get my feet used to them. Some people say no break in but I think they are used to the arch support. Love the silver color. Very happy with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "RG3",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "High arch support, deep heal cup",
      "text": "I was beginning to have pain where my heal and arch meet particularly at work on hard flat floors. I purchased several other shoes and cheap insoles but none seem to help. These shoes were a little rough the first two days on my feet. Just over all making them sore and tired. But after break in period the support is right on. Feels like these shoes were custom fit just for me. Very pleased with them and no more pain!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Men's Birkenstock clog",
      "text": "I purchased these men's Birkenstock, black oiled leather clogs, for my fiance for his birthday. He is a Birkenstock fan. He LOVED them. They fit like a glove and he said that they are very comfortable. They look good too! They shipped quickly and got to me in time to wrap and present to him for his birthday. I would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill Johanson-Thackray",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Wrong description for the footbed",
      "text": "The shoe itself is awesome, but it was advertised as the \"soft footbed\" version. It is not - just the regular one. Kept it anyways, because the are comfortable, but if you are looking for the soft version, this is not the one...",
      "rating": 3.0,
      "verified": true,
      "author": "Michael R. Magnolia, TX",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Pricey, but easy on plantar fasciitis",
      "text": "I wish someone would either: duplicate this in the US and pay American workers, or manufacture in china and really bring the price down. The size chart is a bit weird with euro sizes, Google and verify your US size just to be sure. Arrived fast and good packaging. I'm a school teacher so I really need these to make a small monetary check, only reason I sacrifice my budget for these shoes. Cheaper than the foot doctor.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20161202
    },
    {
      "title": "My husband loves it!",
      "text": "I bought this shoe as a Christmas gift for my husband. I thought he was not going to use it 'cause he is so classic but it was a wonderful surprise that he loves this shoes and uses all the time. He is diabetic and needs a loose shoes so it worked perfect, true to size, so comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Caution. Not soft foot bed. Traditional hard foot bed.",
      "text": "The clogs I was sent are not the soft foot bed type as the heading and description says. They were the normal Birkenstock hard foot bed. I had to return them and get some straight from Birkenstock so I could trust they would be as described.",
      "rating": 2.0,
      "verified": true,
      "author": "Gloaming",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "So, what's Boston about these things?",
      "text": "I've had several pairs of Birk sandals over the years and these fit basically the same, which is to say, very well. Personally, my size is between a US 9.5 and 10, so the size 43 is a bit large, but better than a bit small. That I'll be wearing these clogs with socks makes that no real issue. As with any Birkenstock product, there's a break in period to be endured, but well with the effort.",
      "rating": 4.0,
      "verified": true,
      "author": "Tim Crane",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Soft footbed",
      "text": "I wear Birkenstocks for my sad feet. I've got plantar fasciitis and neuromas. These have solved my problems better than any insert or orthopedic shoes I have tried in the past. Soft footbed is essential when ordering.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Birkenstock Boston Clogs",
      "text": "Love this Birkenstock Boston Clogs, this is my second pair, On my regular shoes size is 8.5 w I bought Size : 40 Eu size, I wear thin sock, so fit perfectly, but if you like to wear thick sock, recommend you go one size bigger.",
      "rating": 5.0,
      "verified": true,
      "author": "bluestar329",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "love these",
      "text": "Took me 4 tries to get the right size but this seller has a pretty good listing. I love my birks. These were a nice color to. They were so dry when I recieved the. I had to use a home remedy to listen them up.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott Webster",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Birkenstocks are the best clogs ever !!!",
      "text": "I love these new BIRKENSTOCKS clogs. I wanted the Amsterdam style but since you have to get wide or regular size. So, I got a great pair of Boston style Birkenstocks that fit great. So, my size 40 M EU/ 9 W USA/ 7 W UK.Still , wearing my 22yrs old Anthacite Amsterdam suede clogs. they get better with age. Highly recommend Birkenstocks.",
      "rating": 5.0,
      "verified": true,
      "author": "RACHAELKELLYCOHEN",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Firm, Comfortable FootBed.",
      "text": "Birkenstocks are some of the only shoes I can count on to be consistently comfortable and durable. I am a student, and I do a lot of walking around my campus and city. These shoes keep my feet happy all day. This is my second pair of Bostons (the first pair was stolen, not worn out), and I highly recommend them to everyone. The standard footbed may seem hard at first, but it's secretly not. There's this subtle spring to the sole that supports your foot in unimaginable ways. After some time your foot and the shoe sort of become one, and it's kind of like how I'd imagine being a hobbit feels.",
      "rating": 5.0,
      "verified": true,
      "author": "Bea",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "Run big and boxy",
      "text": "Nice looking, just way to wide at toe area and overall. Feet looked like very big duck feet. My old women's birkeys aren't as wide as these, perhaps because these are unisex.",
      "rating": 4.0,
      "verified": true,
      "author": "DCM",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Good shoes and a better option than Crocs",
      "text": "I bought these to replace Crocs, which I won't wear again because of trip/slip hazards and ack of support. The Birkenstocks, while great, don't have the same comfort as Olukai or I'd rate them a 5star. Still they are comfortable and very good quality. They stay on the feet well and mold to the foot after a day or so of wearing. Overall a good quality , easy to wear shoe for casual wear.",
      "rating": 4.0,
      "verified": true,
      "author": "Turp",
      "helpful_votes": 2,
      "publication_date": 20161008
    },
    {
      "title": "best shoes ever!",
      "text": "I love my Birkenstock Boston Clogs. I have owned several pairs of these shoes since I was in high school and I keep coming back to purchase more. These are the most comfortable all weather slip-ons that I have ever owned. If you are on the fence, don't hesitate. You will love them forever. Here's a tip I wish someone would have told me years ago. In general, women should purchase the narrow size while men should purchase the regular size. I normally wear a size 8.5 (regular width) in women's flat shoes, and the 39N fits me perfectly. Try this classic style. The comfort and quality will not disappoint.",
      "rating": 5.0,
      "verified": true,
      "author": "Seamoss",
      "helpful_votes": 2,
      "publication_date": 20131208
    },
    {
      "title": "So comfy!!",
      "text": "Cork insole shoes are amazing! I had a pair for nearly 7 years and finally decided to get rid of them (the cork wasn’t soft feeling anymore). So I find these and they are heaven to put on when I get home from work where I’ve been standing for 11 hours at least. They molded to my foot in two days of wearing them. I was a little concerned with getting them as some reviews had major damages on the shoes but I’m glad I took the risk.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Comfort Zone",
      "text": "I wear a true size 9. I ordered a 8-8 1/2. I find burkenstoks run big. The price was right so I went for it and so glad I did. Got them for work but have a feeling I will be wearing them everywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Debo",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Hiding my piggies, but my feet feel so good!",
      "text": "This is my first pair of Birks with a closed in toe...but with the issues I have with my feet and ankles, I decided to give them a try...plenty wide for thick socks or to wrap my foot/ankle....love them!",
      "rating": 5.0,
      "verified": true,
      "author": "shari l hanson",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "It will still mold to the shape of your foot but will be comfortable while doing so",
      "text": "Little to no break on time needed with this shoe because of the soft footbed lining. It will still mold to the shape of your foot but will be comfortable while doing so. I have multiple pairs and styles of Birks and those with the soft footbed are my unquestionable favorites. I like to wear thick socks with my clogs abd when coupled with the soft footbed, I feel as though I have on cushy house slippers.",
      "rating": 5.0,
      "verified": true,
      "author": "tina williams",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Great shoe, slightly larger than typical for other shoes at the same size",
      "text": "I wear a 9.5 or 10, depending on the shoe brand and width--though rarely a 9.5. The Birkenstock US 10/10.5 or EU 43 is too large. Even the 42 (9/9.5) seems large, but they need room for the bending of the sole when I walk. So, whereas I size up for my running shoes, I have to size down slightly for my Birks. BTW, I prefer wide shoe sizes, and the Birkenstock \"M\" (medium) is plenty wide.",
      "rating": 5.0,
      "verified": true,
      "author": "Ethical Science",
      "helpful_votes": 2,
      "publication_date": 20170811
    },
    {
      "title": "No. Don't buy. Wrong sizing.",
      "text": "This was advertised WRONG, WRONG, WRONG. I had to send them back and pay international shipping! I even ASKED, because I know Birks sizing and they said i ordered the right ones....BUT THEY WERE NOT. Just frustrating having to pay international shipping.",
      "rating": 1.0,
      "verified": true,
      "author": "Kate K.",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "the shoe is great i needed a winter shoe that gives me support",
      "text": "I have been looking for a shoe to wear that gives me great support as I am having trouble with my feet. I wear Birkenstock sandals all summer but never had a shoe. I have degenerative joint disease in my feet. One has been and now there are 7 screws holding the bones in place. I am waiting for the other to be done in the future. I hope this gets me through a few more years.",
      "rating": 5.0,
      "verified": true,
      "author": "susan berg",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Authentic",
      "text": "I have many many pairs of Birkenstock’s these are true to size, color and quality",
      "rating": 5.0,
      "verified": true,
      "author": "Christi Kreft",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "I love that I can quickly slip these on and off",
      "text": "I'm an anesthesia provider and therefore on my feet for long hours. The solid cork soles are exactly what I was searching for. Since I purchased these my feet and legs feel less tired at the end of the day. Also, I love that I can quickly slip these on and off, which is nice during long over night call shifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Groovy, yet professional!",
      "text": "I freely admit that I am a Birkenstock aficionado. As a child of the 60s, Birkenstocks are in my DNA, and for good reason. They support my feet, are comfortable, and come in styles for all occasions. The Boston clog is one of my favorite styles; it has a classic hippie vibe, yet works when I am in my professional dress mode. I have tried other \"comfort shoes\", but none meet the quality and feel of Birkenstocks.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Blanchard",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Snug then broken in and comfortable",
      "text": "Bit snug at first but once it was broken in, which didn't take long, it was all good vibes from there.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul M Rigby",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "They're BIRKENSTOCK what more needs to be said?",
      "text": "Just as expected these shoes are masterpieces of modern footwear. Fit is perfect, feel is perfect, color, suede and cork footbed are all perfect. If you don't own or have never owned a pair of Birkenstock shoes do yourself a favor. Shipped fast and arrived on time and without any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "ATX_Ween-er",
      "helpful_votes": 2,
      "publication_date": 20170511
    },
    {
      "title": "Great shoe",
      "text": "We were really nervous to order these online because they were a gift. I feel like Birkenstock’s fit everyone a little different. We tried so hard to find them in store but no one had them in stock. I’m so glad we ended up ordering them because they were perfect!! The price is the same you will find pretty much anywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah ",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Great Birkenstock mules",
      "text": "This is my second pair of the Birkenstock mules. I love them. I have planters fasciitis and these are the only shoes I can wear. These were a perfect fit. I wear a 38 in German sizes and they fit perfect the day I got them. Thank You!",
      "rating": 5.0,
      "verified": true,
      "author": "Sherrie Hanes",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Best shoes ever!",
      "text": "Nothing works better for a bad back & sore feet than birkenstocks. In average US shoes I'm a women's 10. In Birks I'm a 9/9.5. Definitely best to try on a pair at a store before buying online or at least know your euro size.",
      "rating": 5.0,
      "verified": true,
      "author": "sara berns",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "At first these shoes were not comfortable at all",
      "text": "At first these shoes were not comfortable at all, my feet were painful after 7 hours on shift as a nurse. After a few days they molded to my feet, and I haven't had any pain since. They are very comfortable now. I wear them 2-3 times a week for 12 hour shifts, and they are so comfortable. I would definitely recommend them. I wear a 12 or 13 normally, depending on the shoe, and purchased a 46, which works perfectly. The leather is amazing, even though I don't normally like brown. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Snackary",
      "helpful_votes": 0,
      "publication_date": 20151215
    },
    {
      "title": "Never disappointed - super footwear",
      "text": "Birkies always take a bit of time to do their natural forming to the foot, but they are outstanding and last for years. Always worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "Holly P",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "I love Birkenstocks and I already have a pair of brown ...",
      "text": "I love Birkenstocks and I already have a pair of brown Boston clogs. I was surprised at how much larger these are than the brown ones. They are at least 1/2\" wider at the toe, though the length is the same. I decided to keep them because they will be fine with heavy winter socks, but they look so big compared to the other pair. I don't know if this is a permanent change in the sizing or just an aberration, but it was disappointing.",
      "rating": 4.0,
      "verified": true,
      "author": "KZ",
      "helpful_votes": 0,
      "publication_date": 20161124
    },
    {
      "title": "So supportive",
      "text": "I have all kinds of foot issues. This is due to being a teacher and a moderate hiker. Birkenstocks give my feet the support they need. They are wide so where I am really an 8 1/2 in length in normal shoes I wear a 9 for width. With Birkenstocks I wear my 81/2 and they are perfect. I wear my old pair as slippers around the house and my new ones out. My daughter and husband said they would move out of I bought a pair (never mind two) of Birkenstocks have stayed put and actually don't mind them much. My teenage daughter even wants a pair now.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan W.",
      "helpful_votes": 0,
      "publication_date": 20150302
    },
    {
      "title": "Pleasant Surprise...",
      "text": "I had been looking to replace my trusty Bostons that I bought over a decade ago and was sad to see them go, but when I saw a deal on this, I jumped on it and have been pleasantly surprised by the ease of breaking in and care despite the fact that I had not been aware that they were the suede covers.",
      "rating": 5.0,
      "verified": true,
      "author": "PopCProf",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Perfect right out of the box",
      "text": "These clogs are a must for my husband who spends a great deal of time on his feet everyday. The look great, are comfortable and give him the support his feet need. We bought him his first pair of Birkenstock's 10 years ago as a gift. He's worn out many pair since then and is a die hard fan.",
      "rating": 5.0,
      "verified": true,
      "author": "C.M.",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Not comfortable",
      "text": "The leather is so hard that it was painful to just take a few steps before realizing there's no way I could walk any sort of distance without getting blisters. Maybe would be okay with thick socks. But I'd prefer not to wear these with socks. I returned them. :(",
      "rating": 2.0,
      "verified": true,
      "author": "SueK2411",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Perfect for cooler Cali weather",
      "text": "I am getting where I can't wear flip-flops anymore (Yay for getting older!) since they don't support my feet very well. I fell in love with my Birk Mayari sandals this summer and needed something for the cooler weather. I loved the Bostons from day one. They support my feet, keep my toes warm, can be worn both with and without socks, and they don't have a back (I HATE backed shoes; I avoid them as much as possible. Clogs are my lifeline.) If you can wear regular Birk sandals, try Bostons too... ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Jenni & Mike Jordan",
      "helpful_votes": 0,
      "publication_date": 20150923
    },
    {
      "title": "Can't go wrong with Birkenstocks",
      "text": "I work in a bakery, and have been wearing Birk clogs since very early 90's. Up until then, I had worn your typical non-slip shoe, and my feet and back always hurt. The chefs I worked with at the time all wore these, the long hours on their feet never bothered them. I bought my first pair then, and have never looked back. They are a well made shoe, they fit perfectly, and no matter how many hours I work, my feet and back never hurt. I go through about a pair a year, and they are used and abused for that year! Don't try the imitation ones, they don't even come close. These are well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Barkley",
      "helpful_votes": 0,
      "publication_date": 20140103
    },
    {
      "title": "Comfy shoe",
      "text": "This is my third pair of Bostons in 30 years. I love them, but finding the size that works for you can be a challenge without trying them on in a store first. I wear a women's 9 shoe, so I need a 38 Narrow and still have to add an additional hole to the strap to make the shoe tight enough for me (after all it's a unisex shoe). Tried the mocha color for the first time and really like it. I have plantar fasciitis and these shoes are so comfy for my achy arches.",
      "rating": 5.0,
      "verified": true,
      "author": "zoso babe",
      "helpful_votes": 0,
      "publication_date": 20160329
    },
    {
      "title": "Fit as expected",
      "text": "Didn't realize how much my old ones had broken down support-wise until I got this new pair. very pleased. Fit as expected. - still in the breaking-in period. they arrived on time - and all was well. Quite pleased",
      "rating": 5.0,
      "verified": true,
      "author": "Auntie Em",
      "helpful_votes": 3,
      "publication_date": 20170207
    },
    {
      "title": "comfort!",
      "text": "Love this leather color, it's black but a light one so will look ok with navy. I need a knee replacement but am stalling, these really help my knee!",
      "rating": 5.0,
      "verified": true,
      "author": "Keith Mercer",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "My very favorite shoes!!",
      "text": "OMG! I'm in love!! I literally wear these everyday! They are so comfortable and offer good support. I'm going to purchase more in different colors. My feet have a wide bridge and the round bridge and adjustable buckle offers me a great fit even as the leather has stretched a bit and the cork footbed has imprinted in my feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "big fiasco",
      "text": "first orderd pair ,left shoe defective.Return and replaced ,old box strapped with rubber band and wrong color in box with no tags plus used looking shoes. anything else to say?",
      "rating": 1.0,
      "verified": true,
      "author": "G",
      "helpful_votes": 2,
      "publication_date": 20190404
    },
    {
      "title": "Sizing off",
      "text": "Ordered this shoe 3 times. And none for. The first 2 I ordered in a men’s 12 and they were too small. The outside of box actually said 10 on both boxes Then I ordered a 13. It was too big. Ended up just returning the shoe",
      "rating": 2.0,
      "verified": true,
      "author": "deborah robinson",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Support phenomenal",
      "text": "These shoes are so comfortable and the support is terrific. They were shipped quickly. So, if you're on the fence with these let me push you over....",
      "rating": 5.0,
      "verified": true,
      "author": "Betsy L.",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Do your feet a favor and try them!",
      "text": "These are my all time favorite shoes. I wore them when I worked as a nurse and now I wear them as a massage therapist. In the beginning, the leather across the top of my foot was a bit stiff, but give them time, once you break them in they will be your favorite pair of shoes. The other thing I love about them is they last! My last pair I had for over 7 years of pretty frequent use before deciding to replace.",
      "rating": 5.0,
      "verified": true,
      "author": "LMT.MAA",
      "helpful_votes": 2,
      "publication_date": 20150713
    },
    {
      "title": "Love the oiled leather, sold out most places",
      "text": "These are great, exactly what I was expecting. The ones I received have the yellow interior labeling, meaning they are not the newest production shoes, but that doesn’t matter. They are great and I am very happy with the oiled leather. I would recommend spending the extra $10 to get the “soft footbed” because the sandals I have previously are great, there’s no “breaking in” period",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "They just caress my wide feet all day!!!",
      "text": "I'm a size 12 wide usually so I went with the 45's. Perfect fit and they are comfortable. I'm on my feet all day standing for procedures and these are great. Love the color too. Glad I ditched the cheap looking crocs and upgraded to these.",
      "rating": 5.0,
      "verified": true,
      "author": "Chad",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "The size 39 are perfect, I wore them all day",
      "text": "I originally ordered size 40, but they felt a little large and the Birkenstock website said there should not be a space between the back of my heel and the back of the shoe. I ordered size 39 , keeping the size 40 to compare. The size 39 are perfect, I wore them all day , right out of the package. My regular shoe size is 9 - 9.5. I have high arches, narrow heels and wide ball of the foot.",
      "rating": 5.0,
      "verified": true,
      "author": "piper",
      "helpful_votes": 4,
      "publication_date": 20151202
    },
    {
      "title": "They are definitely Birkies!!",
      "text": "If you are used to Birkenstocks then these are what you want. I have to wear a larger size because I have foot problems. These are very comfortable and I love the arch and the rounded toe. They are what I need for my feet to be happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Rocque B.",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Item not as described",
      "text": "These are not the soft footbed as advertised. Disappointed that amazon is increasingly seeking items that don’t fit the description.",
      "rating": 1.0,
      "verified": true,
      "author": "Xtina w",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Details on pictured product is not what I received",
      "text": "Product is not what was pictured. The details of stitching and braided strap is not what I received. I also ordered the same size I have always ordered in Birkenstock for the past 20 years, but these did not fit.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Disappointed!",
      "text": "I received these and they were to be a soft footbed but they were not. Just cork. Also didn’t have the original blue or gold logo. I felt these were a knock off shoe. Informed Amazon of my concern. I returned them. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Margaret R. Spruill",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Comfy",
      "text": "Have wanted a pair for years and finally bought them. Great for slipping on and going out the door.",
      "rating": 5.0,
      "verified": true,
      "author": "jo from VA",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "You've got to love that German engineering!",
      "text": "Grace price for an outstanding product. This show fit right from the start. I think Americans are so used to wearing Chinese-made shoes that run small, that the match for sizing here is just a 1/2 size too large. I read other reviews before ordering and was glad I did. I wear a size 8W and ordered size 38 regular. The fit is perfect. It did take a few days, less than a week, to become accustomed to the shoe, but now, they fit like a glove...with socks or without. The color here is a nice golden oak brown and does not appear to be the orangish color depicted online. You will be happy, I'm sure.",
      "rating": 5.0,
      "verified": true,
      "author": "jvangord",
      "helpful_votes": 0,
      "publication_date": 20130401
    },
    {
      "title": "These clogs are great!",
      "text": "They're comfortable, just like the sandals. They're perfect to slip on and off easily. I haven't worn them a lot yet as it's hot so I prefer wearing sandals now but they'll be great in the fall & when the air is cooler.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Nice, just not right for me...",
      "text": "These were comfortable, nicely made, but not right for me. I felt like my feet looked huge. I know it was the square toe box, but I knew I wouldn't feel comfortable wearing them. Sadly, I returned them.",
      "rating": 4.0,
      "verified": true,
      "author": "New Englander",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Best of Best",
      "text": "Perfect size, perfect shoe. These are by far the best non-custom shoe one can buy for support and foot pain. These allow my feet to fully rest naturally in the footbed of the clog. Been wearing a Birk for 20+ years now, my feet cannot put into words their gratitude for doing so.",
      "rating": 5.0,
      "verified": true,
      "author": "swisswiss",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Workmanship and quality is beyond compare!",
      "text": "I love everything about this shoe. So comfortable and they last forever! I still have my first pair which is 25 years old and I wear for yard work now. Workmanship and quality no can compare.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "for the rest of my life",
      "text": "I've worn Birkenstock Maderas and Floridas for about 20 years, because I was born with not so great feet that have hurt all my life. Then I got sucked into the fake Birki-Footprints Maderas and decided Birks were not what they used to be. I was so crippled up after wearing cheap shoes this winter that I decided to give regular, old Birkenstock Bostons a try. Now I remember why I used to wear ONLY Birkenstock shoes. I will continue wearing ONLY original Birkenstocks for the rest of my life.",
      "rating": 5.0,
      "verified": true,
      "author": "GC",
      "helpful_votes": 0,
      "publication_date": 20150224
    },
    {
      "title": "Prefect!",
      "text": "Got these for my daughter and during the summer it's hard to get her out of them!! She loves them!! Fits just like a pair of Birkenstocks should!!",
      "rating": 5.0,
      "verified": true,
      "author": "bigbootiejudy2002",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Very Happy",
      "text": "An attractive Birkenstock. High grain leather. Very comfortable foot area. The buckle is effective in decreasing or increasing the hold on the foot itself. They give your calves, front and back, a nice workout.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Great Quality and Fit",
      "text": "I have with my feet and have difficulty finding footwear that doesn't hurt my feet. These slippers fit as expected and are comfortable to me even with problem feet. I'll be buying several additional pair to keep as replacements. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "EK",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Comfy",
      "text": "While these are larger than I had anticipated (the size is a 6-6.5, and I’m generally on the small size of the six range), they’re super comfortable and supportive! I have a high arch, so it’s amazing finding a shoe that actually has adequate stability in that area! Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Better than a doctor's appointment for sore feet",
      "text": "My feet were hurting. I wear birkenstock sandals all summer and then started wearing tennis shoes and my feet were aching. So, I bought these and that was it. No more pain. I wear them with socks; at this point they are not comfortable without socks.",
      "rating": 5.0,
      "verified": true,
      "author": "Thankful",
      "helpful_votes": 0,
      "publication_date": 20171015
    }
  ],
  "product_meta": {
    "title": "Birkenstock Unisex Boston Soft Footbed Leather Clog",
    "description": "Birkenstock BIRK-0060463-TaupeNARROW-45(12-12.5)WUS Birkenstock Boston Sandal Mens Style",
    "rating": 4.5,
    "feature_bullets": [
      "100% Leather",
      "Imported",
      "Synthetic sole",
      "Contoured cork footbed supports all arches of the foot",
      "Soft footbed adds a layer of foam on top of the cork footbed for added cushioning",
      "Adjustable buckles for a custom fit",
      "Oiled leather upper gives the leather a bright, shiny look",
      "Birkenstock since 1774"
    ],
    "categories": [
      "Women",
      "Shoes",
      "Mules & Clogs",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 144.9,
    "specifications": {}
  }
}