{
  "website_summaries": [
    {
      "verdict": "This small 10-megapixel shooter can produce great shots if the scene is well lit, but watch out for noise at about ISO 200.",
      "pros": [
        "Decent image quality at low sensitivity",
        "helpful low-light features"
      ],
      "cons": [
        "Noisy at high sensitivity",
        "distinct purple fringing",
        "sluggish",
        "burst and high-ISO modes only shoot at half-resolution or lower"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 7.0,
        "Performance": 6.0,
        "Image quality": 7.0
      },
      "publication_date": 20061120,
      "rating": 6.8,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Camera but watch out for Beach Cameras",
      "text": "I love this camera it is the best. I have used other digital camera's and other brands and none compare to this one for me. the only time i have ever had a probelm is when the battery is running low then it takes longer to capture the image. My warning is to watch what you buy from this vendor (Beach Camera's) they neglect to tell you that they ship via FED-EX and that they require a signature in order for you to receive the product and they are very unhelpful when you contact them.",
      "rating": 5.0,
      "verified": true,
      "author": "puggsie's mom",
      "helpful_votes": 0,
      "publication_date": 20071105
    },
    {
      "title": "Very pleased. Lives up to its' promos.",
      "text": "I have several cameras, including a Nikon. I wanted something that would take quality shots, quick, easy, dependable. I checked Consumer Reports, read many reviews, talked to other folks. The pick of the litter was the Stylus. Long battery life, compact, plenty of options if you want them. Or easy point and shoot. Great shots, easy to use, and compact. I can give it to my daughter (who knows nothing about cameras) for a trip, or an evening, and she makes the shots look like a pro did it. And I love the weather proof (or resistant, what ever) feature. I don't think you can go wrong with this camera, and the price is unbeatable.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl V. Carson",
      "helpful_votes": 0,
      "publication_date": 20070215
    },
    {
      "title": "Only worked for a week",
      "text": "I bought this camera to replace my cannon camera. I thought the picture quality was excellent, but the menu and options were cumbersome to get to. Also, the charger was huge and very irritating to use. I bought this camera specifically for a vacation and it stopped working during the actual vacation. Needless to say, I was really upset. On a positive note, amazon refunded all my money and even paid for the return shipping.",
      "rating": 2.0,
      "verified": true,
      "author": "A. Ellis",
      "helpful_votes": 6,
      "publication_date": 20070121
    },
    {
      "title": "This is a great camera~",
      "text": "I love this camera. It's very quick when taking multiple pictures. It's small and stylish, and very user friendly. I like how it has all those different settings to take pics in all type of settings (pun intended lol. I'm def finding plenty of occasions to try them all out. My friends have even threatened to take my camera away, lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Voracious Reader",
      "helpful_votes": 0,
      "publication_date": 20070512
    },
    {
      "title": "olympus stylus 1000 camera",
      "text": "This is a great camera for me.. it does all i want and even more. I would highly reccommend this camera to everyone",
      "rating": 5.0,
      "verified": true,
      "author": "Richard G. High",
      "helpful_votes": 0,
      "publication_date": 20140222
    },
    {
      "title": "Cool",
      "text": "I bought one to gift it to one of my relatives and I can see this is still working perfect after almost 5 years.",
      "rating": 4.0,
      "verified": true,
      "author": "SS",
      "helpful_votes": 0,
      "publication_date": 20121218
    },
    {
      "title": "great job",
      "text": "it replaced the one i had already when it quit working. thanks",
      "rating": 5.0,
      "verified": true,
      "author": "lance d cease",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "excellent pictures",
      "text": "details in pictures are awesome. Like all camera's you have to remember to pick the correct settings. Easy to use, compact, and alway ready.",
      "rating": 5.0,
      "verified": true,
      "author": "Lydia Ellen",
      "helpful_votes": 0,
      "publication_date": 20070314
    },
    {
      "title": "great camera",
      "text": "I love this camera, nice and small, yet a large screen to see the pictures and takes very nice pictures, Very powerful zoom , I have only had it a short while, but so far it's great.",
      "rating": 5.0,
      "verified": true,
      "author": "Pauline S. Berry",
      "helpful_votes": 2,
      "publication_date": 20070109
    },
    {
      "title": "Problem with refurbished camera, Olympus 1000.",
      "text": "I received this Olympus Stylus 1000 digital camera, but unfortunately, it does not work. Now waiting for the seller to contact me. Finally received resolution and Larry was a great help. So, at the very least, GREAT customer service!",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20101114
    },
    {
      "title": "Great purchase. You won't be disappointed",
      "text": "Great purchase. You won't be disappointed. Had mine for years and still having fun. But watch it. The XD chips are obsolete. They don't make them anymore.",
      "rating": 4.0,
      "verified": true,
      "author": "Carl Sylvester",
      "helpful_votes": 0,
      "publication_date": 20141011
    },
    {
      "title": "Great Camera",
      "text": "Love this camera---Great pictures, easy to carry in purse, has all the bells and whistles I would ever need in a camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Elsie B. Cook",
      "helpful_votes": 0,
      "publication_date": 20070513
    },
    {
      "title": "Olympus Stylus 1000 10MP Digital Camera",
      "text": "Everything I was looking for in a small, compact, great quality camera.",
      "rating": 5.0,
      "verified": true,
      "author": "James Foley",
      "helpful_votes": 0,
      "publication_date": 20070109
    },
    {
      "title": "Olympus S1000",
      "text": "This is an excellent little camera it has many features and I have already recommended it to many friends and co-workers",
      "rating": 5.0,
      "verified": true,
      "author": "L. Vigil",
      "helpful_votes": 3,
      "publication_date": 20070203
    },
    {
      "title": "Very content customer",
      "text": "I've been taking picture with this little fella for a few weeks now. My snapshots taken at the highest resolution meant for poster size prints are receiving rave reviews from family and friends. For sharing images on the internet I reduce their size using 'The Gimp' a free photo software. Image stabilization takes a second to focus your image. Difficult to compose using the viewscreen in bright outdoor light (sunlit snowcover). I'll consider another Olympus model with built-in TTL and a much higher zoom for more demanding applications. Due to it very compact size this camera is a constant companion. Available on a moments notice. Just what I was looking for.",
      "rating": 5.0,
      "verified": false,
      "author": "odobit",
      "helpful_votes": 4,
      "publication_date": 20070403
    },
    {
      "title": "Awesome pictures",
      "text": "Olympus Stylus 1000 works great for me--I feel like these people who wrote bad reviews must have had a totally different camera. I was thrilled with my pictures--only a few blurry ones early on. And you know right away and can retake the picture. I used this camera to document summer reading programs for a library--so lots of kids moving around--indoor pictures, outdoor pictures, low light levels in the museum--all pictures came out great. A number of the pictures were even printed in area newspapers. A higher optical zoom would have been nice but at 10 megapixels I could enlarge the pictures on the computer and practically show finger prints and still have a crystal clear image. I love it.",
      "rating": 5.0,
      "verified": false,
      "author": "Ceil",
      "helpful_votes": 0,
      "publication_date": 20071021
    },
    {
      "title": "Awesome Camera! Love it!!",
      "text": "I bought this camera last May, 2008. I have absolutely loved it from day one out of the box. It is very easy to use. Now almost a year later, I am still finding new goodies to use on this camera. The pictures are far superior than my friends cameras. I love the 10pixel. Awesome. I love the video quality too. It's very good for a camera. Love the options such as making a Year Calendar, makes great gifts for the grandparents & such. I can go on & on about this camera. It really is a top of the line product.",
      "rating": 5.0,
      "verified": false,
      "author": "honorsgrl",
      "helpful_votes": 0,
      "publication_date": 20090129
    },
    {
      "title": "War Survivor",
      "text": "This little camera is an absolute champ. I purchased one before deploying to Iraq. I disarm Bombs for a living, so this camera has been exposed to a lot of over-pressure. I've been involved in Two direct hits from IEDs and while other electronics in my vehicle (some issued by the Army) couldn't handle the concussion inducing shock this guy has. Oh yeah and besides taking abuse it takes amazingly detailed pictures.",
      "rating": 5.0,
      "verified": false,
      "author": "DodgeBall",
      "helpful_votes": 0,
      "publication_date": 20071130
    },
    {
      "title": "Grainy",
      "text": "I am very disappointed with this camera. I can't seem to get decent pics from it. They all come out grainy. Using the \"scenes\" mode works OK. You have to take a lot of pics to get a few good ones. I am shopping for something else. Good battery",
      "rating": 1.0,
      "verified": false,
      "author": "Jimbo",
      "helpful_votes": 0,
      "publication_date": 20091110
    },
    {
      "title": "Worst camera I have EVER owned.  Pathetic.",
      "text": "I have nothing to say. This camera is utterly pathetic. One of the few items I deeply regret buying. \"XD card\" makes it extremely inconvenient to upload pictures. I know this isn't a \"snapshot camera\" but there's no excuse for it to take forever to take a shot, so I always miss picture moments. Camera often takes very blurry photos so I must almost always retake photos. Utter failure by Olympus. Do not buy it.",
      "rating": 1.0,
      "verified": false,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20120716
    },
    {
      "title": "great camera",
      "text": "I bought the camera from Adorama, great pricing, Also, bought from best buy the 1gb memory, so it gave me the opportunity to film a meeting for 35 minutes, of course If I had a tripod the film would have come better. So far I love taking pictures of the clouds, good resolution, still pending to review the CD instructions that came with the box. I would highly recomend the camera.",
      "rating": 5.0,
      "verified": false,
      "author": "Mirna D. Fernandez",
      "helpful_votes": 0,
      "publication_date": 20070619
    },
    {
      "title": "Easy use digital",
      "text": "Olympus Stylus 1000 Excellant entry level camera for new user in the digital area. Simple to use and understand, my wife who said she would never use one, loves it in just a couple weeks.",
      "rating": 5.0,
      "verified": false,
      "author": "Al Smith",
      "helpful_votes": 0,
      "publication_date": 20070902
    },
    {
      "title": "Good camera - Poor Basic Manual",
      "text": "This is a very good camera but I'm not too crazy about the software that is used to download it to my computer. Also, when I looked in the basic manual for instructions on how to format the 1 gig xD picture card, there was no information. I spent some time looking for the menu for formatting the card and eventually found it. Why can't people write manuals worth a damn?",
      "rating": 4.0,
      "verified": false,
      "author": "Mike Killingsworth",
      "helpful_votes": 0,
      "publication_date": 20070115
    },
    {
      "title": "very good camera for the price",
      "text": "This was a gift to my brother and I have to admit that I myself had a lot of fun using it in his name. I did not want to hand it back to him. Due to high mega pixel, the quality of the pictures taken is really good. Plus it is really easy to use and good as an introductory camera for people who are just getting into digital cameras.",
      "rating": 5.0,
      "verified": false,
      "author": "Prateek Garodia",
      "helpful_votes": 0,
      "publication_date": 20070525
    },
    {
      "title": "A Good Catch",
      "text": "I actually wanted to buy this camera for me and I asked my Godfather to buy it for me as a present. The first time I used it is when we went to a vacation. I really love the quality of this camera and its features. I was able to take photos with good quality and right lighting.",
      "rating": 5.0,
      "verified": false,
      "author": "Cheryll G. Padua",
      "helpful_votes": 0,
      "publication_date": 20070609
    },
    {
      "title": "Sending it back!",
      "text": "Don't let the 10 Megapixels fool you. This camera does not take great photos. Like the previous reviewer, I saw better photo quality from my old 3MP Fuji. If I want grainy photos, I can accomplish that with a less expensive camera.",
      "rating": 1.0,
      "verified": false,
      "author": "Amanda Lamb",
      "helpful_votes": 2,
      "publication_date": 20070103
    },
    {
      "title": "don't believe the specs",
      "text": "I am sure this camera operates well in a laboratory environment, but in a field environment--not so much. I think I will buy a Nikon next",
      "rating": 2.0,
      "verified": false,
      "author": "B. Duvall",
      "helpful_votes": 0,
      "publication_date": 20070308
    },
    {
      "title": "Excellent",
      "text": "I bought this camera in January, and now I am buying the second one. Is excellent, good quality in the pictures, easy to use and a very good price for quality.",
      "rating": 5.0,
      "verified": false,
      "author": "Gustavo Rodriguez",
      "helpful_votes": 2,
      "publication_date": 20070719
    }
  ],
  "product_meta": {
    "title": "Olympus Stylus 1000 10MP Digital Camera with Digital Image Stabilized 3x Optical Zoom",
    "description": "FROM THE MANUFACTURER\nFrom the Manufacturer The Stylus 1000 is Olympus' first compact, 10-megapixel digital camera. The 10-megapixel CCD image sensor provides superior resolution for great pictures, even when printed in formats 15 x 20 inches or larger. This elegant, slim, yet durable, all-weather camera is packed with features, including: \n\n * A 10-megapixel image sensor, which is coupled with Olympus' exclusive TruePic Turbo image processor, produces crisp, high-quality photos even when printed in large-size formats; \n * Digital Image Stabilization Mode and Digital Image Stabilization Edit ensure crisp, sharp images both before and after a photo is taken; \n * A large 2.5-inch LCD and Bright Capture Technology guarantee clear, bright composition, capture, and review of images even in low-light situations; \n * An all-weather body design resistant to rain, snow, and dust.\n\n10-Megapixel Image Sensor for Superior Image Quality \nThe Stylus 1000 offers the highest resolution in a compact digital camera resulting in superior quality images that are consistently sharp and vivid even when printed in large formats-up to poster sizes of 15 x 20 inches or larger. Digital Image Stabilization Mode and Edit \nThe Stylus 1000 includes a Digital Image Stabilization Mode, which boosts ISO sensitivity and shutter speed for capturing crisp, clear pictures--free from the blur sometimes caused by camera shake or moving subjects--in virtually any shooting situation. For unanticipated blurry images, Digital Image Stabilization Edit presents an easy solution for retouching a blurry image right in the camera after the image has already been captured. An electro-gyro sensor embedded in the camera tracks the vertical and horizontal movement of the camera, then uses this information to revert the image back to its original position to sharpen and reduce blurs in the image.\n\n All-Weather Durability \nTypically, moisture and photography are a bad combination, limiting outdoor photography options when rain, snow, or sleet are involved. However, the compact, all-weather Stylus 1000 can go virtually anywhere. The metal body construction is durable and lightweight with rubber gaskets throughout the interior to ensure that rain, snow, or dust won't get in the way of great photos.\n\n Bright Capture Technology for Easy Low-Light Photography \nThere are times when you want to photograph subjects in low light without having to use a flash, for example, when trying to capture the softness and warmth of a candlelit dinner or natural skin tones in subdued lighting. Olympus' Bright Capture Technology makes it possible to clearly compose subjects on the LCD in low light. The versatile manual ISO settings and specific scene modes enable users to increase the ISO sensitivity up to 6400. Also, with rapid autofocus, even fast-action photos can be captured under low levels of available light. Plus, Bright Capture Movie enables users to record the moments in the dark even after the candles are blown out!\n\n Bright Capture Technology in Action \n\n High-Quality Olympus Lens Elements\nOlympus lenses are known worldwide for sharp, vibrant image quality. This is achieved through a number of key technologies, such as Olympus' super high-refractive-index lens elements and exclusive optical designs. The Stylus 1000 features a bright f2.8 speed lens and a 3x optical zoom lens (equivalent to 35-105mm focal length, f2.8-f4.7 in 35mm photography) plus a 5x digital zoom for a total seamless zoom of 15x. In addition, the Super Macro Mode captures details from as close as 3.9 inches.\n\n Large 2.5-Inch LCD\nThe large, bright 2.5-inch LCD with 230,000 high-resolution pixels makes it easy to see images clearly both when shooting and sharing photos with friends without having to download to a computer.\n\n TruePic Turbo for High-Speed Response\nOlympus' exclusive TruePic Turbo Image Processor enhances image quality and delivers faster overall processing speeds for rapid start-up, shutter release, and playback. TruePic Turbo enables the Stylus 1000 to capture information from all 10.0 million pixels with pixel \"micro-smoothing\" that delivers clearer and more color-accurate photos. The fast start-up of less than one second and nearly instant shutter release time ensures a high-speed response so the camera is always ready to take great pictures.\n\n 24 Selectable Shooting Modes\nWith 20 pre-programmed scene modes such as Sport, Available Light Portrait, Sunset, Cuisine, and Candle Light, the Stylus 1000 makes it easy to capture beautiful images in a variety of lighting and shooting situations. Plus, with QuickTime Movie Mode, the camera can also record VGA-quality videos with sound.\n\n Perfect Fix for Perfect Photos\nOlympus' new Perfect Fix feature offers quick solutions for unanticipated image quality issues caused by several adverse conditions occurring at once: Digital Image Stabilization Edit can be used to reduce the effects of blur; Lighting Fix can be used to adjust underexposed areas; and Red-Eye Fix can be used to reduce the effects of red-eye sometimes caused by direct flash. Additional in-camera editing functions can be quickly accessed right in the camera with the touch of a button: features such as resizing, trimming, frames, text options, color brightness, and saturation adjustments.\n\n Built-In Help Guide\nEach feature is easily accessible, even to novice users, thanks to the Built-In Help Guide function. By simply holding down the Guide button on the back of the camera, users can access brief descriptions of each of the camera's functions and scene modes. An improved auto-set Shooting Guide provides users with an explanation of which features to use in a given situation, and then sets the camera automatically for the selected feature in the Guide.\n\n One-Touch Easy Print--No Computer Necessary\nThe power of PictBridge technology enables photos to be printed directly from the camera to any PictBridge-enabled printer without using a computer. The one-touch \"Print\" button makes printing a single-step process. Printing and sharing images has never been easier!\n\n Olympus Master Software\nOlympus Master Software provides the ultimate in digital imaging management. An intuitive user interface makes downloading images to your computer quick and simple; and images are searchable by date or keyword in the Calendar View. Also, with one-click editing tools, such as red-eye removal, images can be touched up before printing or e-mailing. Online support, templates, firmware upgrades and other user services are just a mouse-click away.\n\n What's in the Box\nOlympus Stylus 1000, wrist strap, WIN/Mac USB cable, audio-video cable, LI-12B Li-Ion rechargeable battery and charger, quick start guide, basic instruction manual, warranty card, (2) CD-ROMs with Olympus Master software, and an advanced manual.",
    "rating": 4.1,
    "feature_bullets": [
      "10-megapixel CCD captures enough detail for photo-quality 18 x 24-inch prints",
      "3x optical zoom; 2.5-inch LCD display; compact, all-weather body",
      "Bright Capture technology; 24 selectable shooting modes; built-in Help guide",
      "Perfect Fix feature includes Digital Image Stabilization Edit, Lighting Fix, and Red-Eye Fix",
      "Stores images on xD Picture Cards; powered by Li-Ion battery (battery and charger included)"
    ],
    "specifications": {
      "Product Dimensions": "3.82 x 0.91 x 2.2 inches",
      "Item Weight": "6.9 ounces",
      "ASIN": "B000H7ECKK",
      "Item model number": "225855",
      "Customer Reviews": "4.1 out of 5 stars51 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#528,599 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 2, 2001",
      "Manufacturer": "Olympus"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": 69.95
  }
}