{
  "website_summaries": [
    {
      "verdict": "One of the least expensive training collars for dogs, and it uses a unique prong design that some owners like.",
      "pros": [
        "Works nicely for dogs that need more of a gentle style of correction",
        "Makes use of a polymer in the collar's materials to deliver a high level of durability",
        "Available in 2 sizes, and you can add more links as needed to perfectly resize the collar",
        "Effective for those just starting obedience classes"
      ],
      "cons": [
        "Not intended to be used as a primary collar",
        "Design not as effective as others for heavy pullers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Quality Control missed this one.",
      "text": "We bought the large, 21\" collar. First of all, the ring you attach the leash to is sewn on the wrong side (inside) and the nylon was twisted. Both of these issues cause unwanted friction when our dog pulls. I think these issues are really negligent, given the nature of the product. Additionally, the pictures in the instructions on the package are very different. 1 of the pictures show the thin nylon to be sewn through each collar end and don’t utilize the lobster clasp. See pics for clarification. So disappointed and returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 22,
      "publication_date": 20171126
    },
    {
      "title": "Best $9 I ever spent",
      "text": "The collar arrived this morning. I had to take out two links which is much easier if you wear gloves. Easy to put on and comes with a safety slip collar in case the actual collar should come apart. I had to correct my dog 6 or so times when we first started walking and after that he just walked nicely next to me with no pulling. Best two mile walk we've ever had and the collar didn't bother him in a negative way. So glad I found this collar after trying two different no pull harnesses that didn't work for my dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Irlacher",
      "helpful_votes": 18,
      "publication_date": 20170328
    },
    {
      "title": "Didn't work for us",
      "text": "My mom had 2 bulldogs in expensive behavior training & had used similar training collars to this product w/ her dogs. So she recommended getting this for my 65 lb lab who pulled hard on her leash/collar during walks. I was excited to try this product. Unfortunately it did nothing to curb her pulling. She pulled so hard she was short of breath & sounded like a squeaky toy. This collar's sharp points didn't phase her at all! We since tried the gentle lead & have found it to work much better. This star mark collar might work better on different breeds, but I wouldn't recommend for labs.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20170912
    },
    {
      "title": "It KILLED my dog.",
      "text": "This piece of crap snapped (after a month of use) while my husband was walking out beloved dog Buddy. He was struck and killed by a car on CHRISTMAS DAY due to this cheap garbage. My young children are crying hysterically and I will never get the vision of my sweet puppy's head crushed and bloody. Buy this if you want your dog to be killed.",
      "rating": 1.0,
      "verified": true,
      "author": "Tana Noonan",
      "helpful_votes": 6,
      "publication_date": 20191225
    },
    {
      "title": "This was to be my third one of these and its woefully short of proper construction",
      "text": "As seen in the picture the blue/grey one is my previously purchased Triple crown collar. As is easily seen the cord is sewn in place. However the newer one (in black) Is sewn but not within the second eyelet of the collar. Even in the posted advertisement you can seen how its affixed. Sadly I bought this as a back for when my present one became too frayed. Just a day ago I removed the packaging and found this issue. So I am outside my satisfaction window. Shame on the quality control at Triple Crown and the seller.",
      "rating": 1.0,
      "verified": true,
      "author": "NephillimsWing",
      "helpful_votes": 6,
      "publication_date": 20190223
    },
    {
      "title": "Works immediately!",
      "text": "I have a 2 year old very strong pitbull. He was pulling me down the street lately so I was looking for a solution. Got this and the first walk we went on no pulling! I couldn't believe it. I've tried different harenss but he was simply to strong. Also the other older metal prong version of training collars looked cruel and painful I would never do that to my dog. This collar looks great and works great. Others can't even tell it's a training collar from the outside.",
      "rating": 5.0,
      "verified": true,
      "author": "Estevan",
      "helpful_votes": 5,
      "publication_date": 20181015
    },
    {
      "title": "Good collar for training , when you receive the correct parts!",
      "text": "Having had experience using this collar on two dogs, I purchased this because the price had dropped. Unfortunately I did not open the box until recently, many months after my purchase, and found that it was not functional. Anyone familiar with this collar knows that it is a useful device to train your dog. However if you look at the photo you can see that I cannot connect the two halves of the collar together because both ends are female connectors, one needs to be male. Maybe that's why the price was low????",
      "rating": 3.0,
      "verified": true,
      "author": "GMakTop Contributor: Pets",
      "helpful_votes": 8,
      "publication_date": 20170624
    },
    {
      "title": "A huge difference!",
      "text": "I never thought I’d get a collar like this, but it was a really good move. After a back injury it became painful to walk our dog, who is a real tank and occasional puller. This collar has made it so much more enjoyable to get out and get exercise with my bud. It curbs some of his wilder tendencies, but he doesn’t seem to hate it like the Gentle Leader we tried. In fact, he gets super excited when I put it on.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190111
    },
    {
      "title": "Made a huge difference",
      "text": "We were directed to purchase this collar from our trainer. My pup was pulling extremely hard; 10 months old and weighs 90 lbs!! So, you can imagine how hard it was controlling him. We originally borrowed one from our trainer before making the purchase. Within about an hour of working with him, he realized that if he pulled, he received a little \"nip\" as mama dogs do to their young. It made such an impact we immediately made the purchase, then ended up buying two more for our other furbabies. This collar has been such a lifesaver for me and for my fur babies. It took no time for them to understand the correcting that the collar was doing.",
      "rating": 5.0,
      "verified": true,
      "author": "GatorBait",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Great for training a strong willed puppy",
      "text": "Works like it should, not sharp like metal. At first I was like no I don't want to use this, but then I find myself jerking my dogs neck all the time with the collar. So I used a harness, well he is bred from some cattle farming parents, so I strap that on him and all listening leaves and he pulls and pulls. I don't leave this on him in the house, I pt it on him when I plan on using a leash. So for formal training, walks, and going out in town. All it takes is a small pull and he looks right up at me waiting for the next command.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190212
    },
    {
      "title": "Save your dogs life with this collar, it's not as aggressive as metal links but it works well.",
      "text": "The StarMark Training Collar is very sturdy and will not unhook like cheap metal link pinch collars. It is gentler than metal links. It can be easily shortened or extra links and be purchased for growing dogs or large breeds. Save your money, don't purchase a so called \"Springer\" from other sellers. They are cheap imitation knock offs. Spend the money and buy a real HERM SPRENGER: Made in Germany. You should always use a regular collar to as a back up incase the links un hook.",
      "rating": 5.0,
      "verified": true,
      "author": "James Covey",
      "helpful_votes": 3,
      "publication_date": 20190114
    },
    {
      "title": "OK quality-size is misleading-breaks easily.",
      "text": "Sizing in the description is incorrect and collar is larger than stated. The inside of the collar spike is the size so it will fit larger dogs than it would appear. Not an issue but you likely will not require the extension links. The main concern is that the nylon loop and clip that secures the collar is very lightweight and broke quickly. It's probably ok for lighter dogs that don't pull too hard but for a 60-70 pound puppy it didn't hold up. It's enough of an issue that they include a separate (duplicate) collar that you use with the training collar for safety in case the collar breaks.",
      "rating": 3.0,
      "verified": true,
      "author": "Ernest H",
      "helpful_votes": 2,
      "publication_date": 20180831
    },
    {
      "title": "Don’t hurt your dogs with this thing",
      "text": "My pitty pulls very hard and me as a 100lbs girl, he would drag the heck out of me whenever I walk him. Read some reviews and finally ordered it. This thing work better than choke chain but broke after 2mos of use while he was chasing a lizard outside. Good thing he didn’t ran away and I grabbed his other collar quickly. I would not recommend this thing and I feel bad buying this because it hurts your poor thing’s neck. I decide to buy the easy walk harness. God send!. He still pulls but I have a better control because the thing is wrapped around your dogs chest and body. Will not going to hurt them at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah Mars",
      "helpful_votes": 2,
      "publication_date": 20190423
    },
    {
      "title": "good for arm pulling dogs",
      "text": "this works well for 2yr husky dog. she almost rips my arm off normally to the point of choking herself with metal chain. I lift her straight up with this about 10sec or less she sits down then we continue. if she moves before I say walk I lift up again and she usually picks this up by 2nd time. she's a very smart dog , so it might take longer for other breeds. This doesn't hurt the dog or leave marks at all. It's a hard plastic but not pointy enough to puncture or pierce like the metal ones. I couldn't walk the 2 dogs together before now it's easier. Still working on interaction. with other dogs using this",
      "rating": 5.0,
      "verified": true,
      "author": "beth",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Bernese Mountain Dog",
      "text": "My boy is pretty well-trained and well-behaved, but after an injury I like the extra insurance this gives me. This collar makes giving corrections much more effective with much less physical effort. I rarely have to engage the collar, but when I do I don't have to put much pressure into it at all. This collar holds up really well, as opposed to your normal prong collar. I don't really worry about it falling apart at all, as the links are pretty hard to undo. Speaking of the standard prong, I love that this doesn't look like one at all. You won't get weird looks with this.",
      "rating": 5.0,
      "verified": true,
      "author": "onyxignite",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Freakin' Magic",
      "text": "We use this for our 70-lb Shepherd mix, and when we picked up a rambunctious 2-year old 85-lb mixed breed at the humane rescue shelter last week, we slipped this collar over his neck. The effect was instantaneous. With no extra effort on my part, the rescue dog immediately settled down and was not just manageable, but actually a lot calmer. Since that time, we've been using the collar every time we take him out, he's a runner by nature and - for the time being, until we can do consistent training - we need this kind of control. It's worked wonders for our other dog, but what it did for this rescue pup was just amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "drjmetz",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "It works!",
      "text": "This is one of the best purchases I have made on Amazon over the years. I noticed a difference on the first use. My dog's pulling and jumping toward passing cars has been dramatically reduced. With my particular dog (a pittie mix), I don't even have to pull hard on the collar. I think just the feeling of it around his neck calms him down. I would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Not a fan",
      "text": "This product seemed to work a bit at slowing my dog from pulling, until it popped open - twice. My dog is a 60 lb. Beagle / Hound mix and so he follows a scent instinctually. If we're both walking and I can tug on the collar to guide him, he seems to slow down a bit (it doesn't \"automatically\" stop the behavior). However, on two occasions I was stopped and he just leaned into the collar hard and it popped right open. After the second time it occurred, I just tossed it aside and bought a Herm Sprenger.",
      "rating": 2.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Great Dane walks nicely now, really!  No kidding!!!",
      "text": "OMG! Amazing! Our Great Dane/Lab mix can get unruly on walks. Sometimes it would take all our strength to pull him on walks. Today we used this StarMark Training collar and he walked nicely the whole time. A gentle pull and he responded very well. I’m sold! Does not hurt him. Best item for unruly dog.",
      "rating": 5.0,
      "verified": true,
      "author": "girlimpressed",
      "helpful_votes": 2,
      "publication_date": 20190110
    },
    {
      "title": "I can actually walk my dog!",
      "text": "I have a very excitable 2yr old great dane. I wasn't able to walk her because any time she saw another dog she would lunge and pull and it was embarrassing and I'm sure scary for the person with the other dog. She is weird towards other dogs when she's on a leash but once she's off it she totally fine. This collar has made it so I can actually walk her, she still gets a little crazy but not half as bad as before, she's learned if she pulls it's uncomfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie hamaker",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Works well",
      "text": "I do really like this collar, it's easy to use with the snap and seems of good quality. It does offer a much softer correction than something like a herm sprenger, so if you have a more sensitive pup that you still need extra control of this would definitely be worth a shot. I can see these prongs getting kind of lost in longer or fluffier fur, so that's something to keep in mind as well. And be sure to still size it properly! High to mid neck, not hanging around like a necklace.",
      "rating": 5.0,
      "verified": true,
      "author": "Bri",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Recommended for Labrador Retriever Puppy from 10 weeks.",
      "text": "I have bred and trained Labrador Retrievers for the past 25 years. Utilized this collar to start training a Labrador puppy at 10 weeks old. Most of my pups did not require a pinch collar, but I am glad to have found this particular collar as this current Labrador definitely benefited from early utilization. I have since resized the collar twice to accommodate for growth. Follow good training consistency and technique and use this collar to reinforce and correct appropriately.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "I'm sure they'd work ok for most dogs but they are not the modern equivalent of prong collars: they are less effective",
      "text": "I was surprised that these didn't work as well as my regular prong collars which are awkward and prone to opening, so I was looking for a similar product without that problem. They do stay intact in use but are much less effective at communicating with tough-necked dogs like mine. They simply don't notice these. I'm sure they'd work ok for most dogs but they are not the modern equivalent of prong collars, therefore producing less communication (I'm not talking of pain or hurting the dogs, I'm simply talking of communication: if they dog cannot feel they are pulling or the corrections, they don't know they are not behaving as requested and do not train/learn).",
      "rating": 3.0,
      "verified": true,
      "author": "G-man",
      "helpful_votes": 3,
      "publication_date": 20160330
    },
    {
      "title": "Didn't work for my Doberman",
      "text": "Didn't do much for my 100 lb Doberman. He's not that bad of a puller but the feeling helps discourage it and keeps him a little more under control when there's a prairie dog nearby. The regular prong collar works on him just fine but it makes him look aggressive when he's not at all so decided to try this since it doesn't look so intimidating. Unfortunately, I feel like he started pulling even more than usual when using it. Returned.",
      "rating": 3.0,
      "verified": true,
      "author": "Dianna",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Links broke when adjusting the collar",
      "text": "It's a good idea, but not very durable. Links broke while adjusting the collar (by removing links per instructions). I like the idea, but I do not trust my dog (a Dutch Shepherd) on it now after links being broken. There are four nibs on each link, and 1 to 2 broke on each link I took off. Disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "G V.",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Works on Hyper Golden Retriever Youth",
      "text": "I have an out of control golden retriever who can knock me down and drag me. This really helped me control him when nothing else would work without hurting him. That's a hard find it just doesn't dig but it gets his attention. It also only tightens so much, so he can't choke or anything horrid either. He's not a bad dog, he just gets so excited about whatever dog thing he wants to go do. This collar gets his attention.",
      "rating": 5.0,
      "verified": true,
      "author": "RO",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Great design, but too gentle",
      "text": "We had used an all metal standard prong collar for training our Springer, the type where the metal “vertebrae” links must be pried apart and forced back together any time we wanted to walk our dog. This type was just too much force on my hands and I was looking for an alternative, and I was sure this collar’s much better designed attachment method would be better. Unfortunately, the prongs on this are too gentle. My dog proceeded to drag me around and the prongs, unlike metal points, were useless. This company was professional and took the product back.",
      "rating": 3.0,
      "verified": true,
      "author": "E. Hay",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "For me, it is a life saviour.",
      "text": "I never write reviews for anything, even if it is the worst. But this collar is my life saviour. I have a 6 year old German shepherd/Malinois rescue. In the beginning, she was very aggressive with everyone, except for a few people, she even attacked my other dogs and killed a kitten. On the walk, she was dragging around like a rag-doll. My dog's trainer recommended it and at first I was a bit worried that it would hurt my crazy dog or it would break down because of her strength. Boy, I was wrong. From the first minute, she stopped pulling and listened to every command. She even walks beside me now. I am very pleased with the collar.",
      "rating": 5.0,
      "verified": true,
      "author": "katerina xenaki",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "LOVE!!! Very helpful training collar!",
      "text": "Great product!! I saw instant improvement with first use with a very routy, hyper pup. She had previously slipped out of \"no pull\" harnesses and other collars and constantly pulled when being walked. Her first reaction to this collar was of course not happy. But I continued because I saw her learning to submit. This easily and quickly helped trained her to walk with me and to have boundaries outside. Especially when walking past people or other dogs. The links are great. We got a bigger size and removed some links to fit. Now we just add links as she grows. (Remember you dont want it too loose but also not too tight on them.) Over all great training collar.",
      "rating": 5.0,
      "verified": true,
      "author": "Anita ",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "These work great for our two golden retrievers",
      "text": "We have two Golden Retrievers who are pretty strong pullers! Each of them will walk fine if it is just one of them walking, but if they are walking together, they have this thing where they are trying to be first or something. So, we have resorted to using a training collar, and this one is the best that we have used so far. They both get the point that pulling hard is not going to do them any good and it has definitely made it reasonable to be able to take both of them for a walk at the same time.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Murphy",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "So glad I found this",
      "text": "I have a 100lb rescue mix that pulls on a leash and every harness I have tried. I couldn’t bring myself to use the metal pinch collar so I had to have someone else walk with him because I am handicapped. I seen this and thought I might as well give it a try. After the first pull he hasn’t pulled since. Amazing! He walks with me and I don’t have to have someone else handle him. He is such a sweet huge teddy bear.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Privette",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "too small, worthless!",
      "text": "UPDATE: Gave this to a young malamute for training. He broke it in 45 minutes! Cord ripped off and dog was running wild in heavy traffic. What a piece of junk! The sizing is way off and not worth buying. never could get the extender in. Sad that I had to order it. I bought a metal one at Walmart and had to take links out. bought extra links and could not get them on. now I have wasted my money.",
      "rating": 1.0,
      "verified": true,
      "author": "gruene queen",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Worth every penny and then some!",
      "text": "We adopted a 2 year old German Shepherd/Rottweiler mix a few months ago. She was somewhat leash trained but walking her and a toddler in a stroller by myself has always been a power struggle! She pulls to be the lead and set the pace for our little pack. Today I walked her with this collar and it was like walking a completely different dog! She went at our pace, calmly along side the stroller. No excessive force put in to drag us along. She pulled twice to sniff some bushes, quickly realized and corrected her behavior! God send! I would have paid three times the price for this result!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather VanderSanden",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Don’t waste your money!",
      "text": "I’m disappointed in this collar. It does not is my great Dane at all! She pulls extremely hard and this collar does not affect her even a little bit! Didn’t work on our English bulldog either. Don’t waste your money... It’s not a good product. And the pieces are very hard to put on and takeoff! My fingers were killing me afterwards. I give it a D minus",
      "rating": 1.0,
      "verified": true,
      "author": "SUGARSKULLY ",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "I like the lower profile",
      "text": "I purchased this after seeing it on a Doberman Facebook page. The person who had it on their dogs said she liked the way it looked and worked - so I decided to give it a try myself. I liked the lower profile \"prongs\" and the fact it came in black. The links are relatively easy to remove and put back together (you will need a strong grip to hold them tight while doing so). I also like the martingale feature of this collar and it comes with a \"slip\" collar for added protection should something happen to prong collar while using it.",
      "rating": 5.0,
      "verified": true,
      "author": "ButterBean6536Top Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "AMAZING!!!! Never leave the house with out!",
      "text": "An amazing collar! We got this for our golden retriever who pulled like crazy and as soon as we put it on it was like magic. I wasn't being drug across the sidewalk! We now use it on our pittie as well and she does wonderful on it! Great collar I recommend it to anyone I see having issues walking their dog!",
      "rating": 5.0,
      "verified": true,
      "author": "Saurey08",
      "helpful_votes": 61,
      "publication_date": 20151220
    },
    {
      "title": "Does the job instantly",
      "text": "I recently adopted a lab puppy who has crazy amounts of energy especially around others. I use this product when I go to the farmers market to prevent him from jumping on the table of other people. I immediately noticed a difference when I put the collar on. Walking became a lot more pleasurable for both of us. My puppy was comfortable enough to still explore on his own but learned quickly not to tug the leash. I did notice that his old habits returned after transitioning him back to the classic collar. Despite that, I would still recommend this product for any puppy owners!",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Szu",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Works Phenomenal!!  Huge improvement after 1 Day Of Training!!",
      "text": "I have to say I was skeptical this collar was going to work. I read alot of reviews and watched a few you tube videos before purchasing. I am so Happy I Bought This. I have a 2 year old PitBully and he is a beast. Very strong and super stubborn. This collar is the best on the market. After training for one day, I was able to walk him without all the pulling. He's not walking side by side yet, but definitely a huge improvement. I definitely recommend getting this collar for training. Make sure you watch the videos so you understand how to use it properly. You do that and you won't be disappointed!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jules25",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Good not great",
      "text": "I bought this as an alternative to a traditional prong collar. To the casual observer, doesn't look like a prong which was my primary reason for the purchase. Turns out for my labrador, I needed a prong (Herm sprenger collar). I need much less force (almost non at all) compared to the StarMark collar. I went with the black Herm sprenger collar since I have a chocolate lab, and it hardly gets noticed.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Perfect for my needs!",
      "text": "I have a large Boxer who is typically placid and calm however to ensure I have control over him at all times it is great to have this collar. It does not have that heavy \"scary\" looking metal prongs, but looks like a thick black collar. My boxer is such a sweet baby and typically loves everyone and I don't want him to look \"mean\" but as I am responsible for him I need to be in control of him at all times. This helps and I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "GloriaTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "I wish I had found this sooner",
      "text": "I have a great dane that is amazing on a leash never pulls but when he sees his pals he lunges out of my hand. I have a great dane which is as strong as an elephant and the collar is great nothing like the metal ones. This is a slight discomfort that he feels o ly when he pulls. This collar saved my dog I was frustrated before. I hiley recommended this collar even though I have never agreed with prong collars I totally agree with this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Good training collar for the price",
      "text": "So far so good, price was right, link material looks durable (not so much for the nylon that connects the link to the closer) and collar even has a cool look to it. My pit was a bit pulling when seeing other dogs wanting to play with them, I tried shock collar which freaked him out, than after a reader has I found this one and after 2 weeks I'm quite happy, pulling the leash decrease and this collar allows you to correct your dog and control his/her neck from environmental distractions. They should have make the Naylon part that connects to the lease a bit more durable lets see how long it will last.",
      "rating": 4.0,
      "verified": true,
      "author": "s.c",
      "helpful_votes": 2,
      "publication_date": 20170221
    },
    {
      "title": "Teaches respect and listening",
      "text": "Love it, my lab pup still pulls just not dragging me the whole walk and he comes when I pull on the leash, completely different demeanor. He used to pull so hard that he would hold his breath and not breath and my arm couldn’t handle it. Not the leash is taught but both of us are comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Roxy",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Awesome alternative!",
      "text": "Awesome alternative to traditional prong collar. Not concerned about accidentally exerting too much pressure or if he acts stupid! It was very difficult to take links out tho. I'm a Senior and thumbs are not strong so it was like fighting with Rx kidproof caps! Then a prong on each of the two I took off, broke off! I love the collar tho and wish everyone would try them in lieu of metal ones.",
      "rating": 4.0,
      "verified": true,
      "author": "LOCOJRT",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Great Alternative to Face Harness!",
      "text": "I have a 60 lb pit bull mix who is very strong- especially if he sees a squirrel. I usually use a gentle leader or canny collar but he really does not like anything on his face. I like how this collar helps me control him and gives an immediate correction if he is acting up, something the other collars didn’t do. They just added resistance. Highly recommend! He still will pull occasionally for squirrels but we have made great training progress because of this collar. We can now sit and look at squirrels instead of pull :)",
      "rating": 5.0,
      "verified": true,
      "author": "c_jstc",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Can easily hurt your dog. Be gentle.",
      "text": "Be veeeeeery gentle when using this collar. it will put the pinch on your dog if you're not careful. It just takes a very light Tug for the dog to know that this collar means business.Can easily hurt your dog. Be gentle. We had a king standard poodle that hated baths. I was injured in a car accident and have pinched nerves through my neck and arms that prevent me from lifting or tugging to get him into the tub. But gently pulling him with this caller he would walk right into the tub .",
      "rating": 5.0,
      "verified": true,
      "author": "darla",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Had a regular pinch collar, argh",
      "text": "This collar adjusts easily, goes on easily, but plus. My dog responds to it easily and gently. She is a rescue Catahoula leopard mix. Strong, bold, and we'll goofy too. This collar is a breeze for my arthritic hands to adjust. And easy on is great and less painful for her. Love this training device. No pulling, heel is easily enforced. Also great for restraint when she wants to bark back at dogs. While she is technically a medium dog, she is strong and fit. Buff, would describe her. So this collar scores a win for us",
      "rating": 5.0,
      "verified": true,
      "author": "Denise Mullarkey",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "DIDNT WORK",
      "text": "If your dog/breed has a higher pain tolerance then average this isn’t the right collar. Doesn’t stop either of our 6 month old working line German shepherds from pulling if they really want too. Especially when walking together. I do prefer to use it over fbe traditional flat collar for our one and one walks. If you have a determined dog, the pressure from pulling will not phase them as with mine. We are going to be getting an actual prong collar. We tried both this starmark and a head lead and neither of them provides enough correction",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin Flagg",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Easy to use, may be difficult to remove links, works well.",
      "text": "I have used similar collars from other brands. This paricular one does work for the price and I like the strength it seems to have. The only drawbacks, I had to use vise grips to remove links because neither I nor my wife could remove links by hand (and I’m a pretty big guy). The links didnt break so they seem durable but they are very tight. The safety link provided is very light, I used it once but threw it away shortly after. Otherwise, it works as its supposed to and after our pup got used to it, he responds better to commands and it makes training easy.",
      "rating": 3.0,
      "verified": true,
      "author": "Max",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "great for my german shepard",
      "text": "the links are tricky to get on and off for sizing, but its a good thing because i guess you don't want the collar just falling apart. I have found that it really is almost too gentle of a correction collar because my dog has a very fluffy coat on him, which works like a cushion against the prickly plastic, i have to yank the heck out of it for him to feel anything at all. Its durable though, we use it as his everyday collar for walks now.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Not sure exactly who this collar would work best for...",
      "text": "Not as easy as the make it look. Plus although I got the size recommended, it was easy too big for my dog. Ended up with half the collar being 'tightener' vs 'prong' part of the collar. The concept is good but I'm not sure exactly who this would be good for...we ended up getting a sprenger collar (2.25) & it's been an instant improvement.",
      "rating": 2.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Works great!",
      "text": "I'm very pleased to report it works! I have a 8 month female Siberian Husky who was pulling so much with a harness it was painful in my hands, back, neck, etc to walk her so I tried this cuz it had great reviews and omg now she hardly pulls if not at all! I can finally was her with ease. What a game changer! I definitely recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Aimee Menzie",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "A little to big and chunky for my dog",
      "text": "Although this may work great for some, it was way to chunky and bulkey for my medium sized Poodle-Chihuahua mix (I did get the smaller sized version). I really like the idea of this. I might try 3d printing something a bit thinner and smaller. Until then, I'll have to stick with the metal pinch collar with the little rubber ends.",
      "rating": 3.0,
      "verified": true,
      "author": "B. Price",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Amazing!",
      "text": "Walks were always such a struggle with my German Shepherd. This collar does not totally fix the tugging problem, but it is sooo much better for both of us (my shoulder doesn’t feel like it’s coming out of its socket, I’m more in control to keep us both safe, and I don’t worry about Opal choking herself). The chains are hard to detach and reattach - I had to have my husband put it back together for me. Update: we rescued another dog, and also got this collar for her. It corrected her pulling instantly! She walks on a loose leash now.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Jensen",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Great",
      "text": "Works great for our 70lb boxer. He is strong as a bull but easily walkable with this collar. Better for him than the harsh metal prong collar. Although my friend with a German Shepherd says this wasn’t enough and his dog needs the metal prong.",
      "rating": 5.0,
      "verified": true,
      "author": "Max Headroom",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Gamechanger!!",
      "text": "What a difference this has made when walking my 13 month old Doberman. She is quite the puller and so strong. I have a broken wrist and surgery scar to prove it. A little training with this collar and everything has changed. So much better. Was hoping that I would not have to resort to a true prong collar and now I won't have to.",
      "rating": 5.0,
      "verified": true,
      "author": "paedae 249",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "May work for some",
      "text": "Good concept collar except a few flaws. Firstly the strings are a little feeble. I'm not sure how they would hold up over the long term for a large dog. Secondly I would definitely caution for use on a furry dog. Because the stubs get stuck in the fur and prevent the collar from being able to freely rotate thus pulling on there skin. Overall it was a good start but never really provided enough correction for my 7 month German Shepherd.",
      "rating": 3.0,
      "verified": true,
      "author": "PGS",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Great customer service, immediate results, but fatal flaw — durability.",
      "text": "I have a shepherd mix with strong leash pulling behavior, so we got this to try to curb that. We saw immediate results, but this product has a fatal flaw. One day our puppy chewed through the loop in minutes while we weren’t looking. I called customer service, which was fantastic — they sent a replacement without any questions. But then she chewed through the second loop again. Since we stopped using this leash, her behavior has returned, proving that this leash is more of a bandaid than a solution. (Always opt for training in the long run, which we still aim to do nevertheless.)",
      "rating": 2.0,
      "verified": true,
      "author": "David Zhou",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Perfect for our naughty rescue Pit/Boxer",
      "text": "So surprised at how well this is working out for the price. We have a very naughty rescue Pit/Boxer that we have been working with to learn manners on a leash. I ended up using this and a cinch halter and double reining him! It's not as harsh as the prong, but still gets his attention when the martingale collar I began with did not. I was nervous about him busting the clip and breaking free, but he has done his best to do so far not succeeded. Thanks for a good product and a very reasonable price",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce and Nina",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "I have a very powerful service dog, who is a protection dog as well, this helps tame the pupy in him",
      "text": "A 90 pound American Staffordshire Terrier is an imposing sight, especially when he is in protection mode. This collar which works on the same principles as a Mother dog picking up her pup with her teeth to reprimand him or teach him right for wrong. While my dog knows his place, I sometimes get nervous in public and have a collar that can telegraph and help me get my point across with ease is an awesome asset to me and my dog.",
      "rating": 5.0,
      "verified": true,
      "author": "JJ P.",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Great training tool",
      "text": "Wow. This is an amazing training collar. I did not want to buy the traditional metal prong collars but my German Shepherd likes to pull when we are on walks. Instantly she was walking right on my hip and was not getting distracted by other things. I highly recommend a short leash for large breed dogs, so that they can learn to walk right next to you.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Charpentier",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Yaaay!",
      "text": "I’ve had this for my baby for about three weeks now. I’m not sure if I’m using this properly, the directions threw me off a bit haha, but it worked with the first use! She would pull so consistently that her belly would almost be on the ground smh. Now she starts to pull and stops right away. Sometimes she still tries to pull through it, but not often. I’m so happy because we can finally go one nice long walks together! I also love how discreet it is. We had been using two brands of no pull harnesses. Let me tell you, they work nowhere near as well as this.",
      "rating": 5.0,
      "verified": true,
      "author": "Quinesha S. Farmer",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "took some getting used to but works great",
      "text": "our golden puppy likes to PULL! I didn't want to do a metal prong collar and this seems like a more humane way to stop the pulling on walk. It works so well. he didn't like it at first but quickly got used to it after a few walks. he now is a model citizen on his walks and doesn't drag us across the neighborhood.",
      "rating": 5.0,
      "verified": true,
      "author": "John C",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Nice product, but not for rottweilers",
      "text": "I bought this for my rottweiler to train him not to drag me on our walks. This is well made and would probably work great for a lab or retriever....however not so great for a 109 lb rottie. It helped some but his neck is so thick that the collar just annoyed him more than anything else. The collar seems super durable, my only complaint is I didnt feel the instructions were very clear so it took some finagling to rig it together.",
      "rating": 4.0,
      "verified": true,
      "author": "Tasia Kunhardt",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "For those who don't like metal prong collars",
      "text": "A decent \"prong\" collar - it's by no means as effective as a metal prong collar, but also not a cruel. I've had walks that left my dog with small \"bites\" to her neck after she's being a little aggressive with other dogs. This seems to help over a standard collar, but if you have a dog, you know if they're completely focused on something ... it's a crapshoot if you can break the focus enough to gain control, but again it doesn't make me feel cruel to use like a metal prong collar. Bonus - so much easier to get in and off over the metal prong collars.",
      "rating": 4.0,
      "verified": true,
      "author": "bakaDOH!",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "Great for gentle yet effective traning when walking",
      "text": "I have 3 of these, one for each of my dogs. You do have to size them appropriately for your dogs neck to get the full proper effect. As it cant be to small or to loose or it doesn't have the right effect. Luckily this works for all medium to large dogs as it starts large and you can take off links to make it fit. It takes a few moments to figure out the links, but its not impossible. I have my regular pet dogs I love and we also train service dogs and so this collar offers corrective training when walking, but not harsh. Definitely more humane than the metal prongs, which I do not like!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebekah1234",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "Bought It Again",
      "text": "I've been using this collar for about 4 years. It was first recommended by the trainer I hired to help me manage my German Shepherd's reactivity to dogs while on the leash. I simply love it! I recently misplaced his fist collar and have not been able to find it, so I got him a second one. This time, it came with an additional safety loop that stays in place in the event the prong collar snaps out of his neck. I have an idea of how to use, but wish the instructions were more clear. Overall, this is an amazing, discrete collar and once again, I am very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "KZ & Jo",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Worked first time!",
      "text": "My little pit mix is a puller and as he gets bigger it was getting too hard for me to control him from pulling me around once he got on a scent. First time putting it on it worked. He wasn't pulling and i knew it wasn't hurting him which was huge for me. Its more sleek than a chain prong leash and more incognito as well. Some people see a prong collar and are scared away here you cant tell that's what it is. Very pleased would buy again should something happen to this one",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Great control for training on leash",
      "text": "This collar is great! It stays in place better than anything I've used (and I've tried choker chains, another name brand collar from a trainer, and slip leads). It gives the proper pressure to get the dog's attention, and I've had so much more success with it than any other collar on my 9.75 year old Boxer! She is actually getting the hang of walking next to me, instead of in front of me. It's easy to take the extra links out and size it for your dog. I recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "M W",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "This training collar works and the dog responds without hurting the dog",
      "text": "This training collar worked instantly the trainer put it on my 50 lb dog. Before the collar my puppy would pull me over when walking and my arms felt like they were getting ripped out of their sockets. Once the collar was on it was a totally different walking experience.",
      "rating": 5.0,
      "verified": true,
      "author": "Cunningham S,C",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "I don’t know",
      "text": "It didn’t even phase my dog. He’s half boxer half malinois so while sweet and awesome guard dog he’s one stubborn hyperactive pup. I cannot tell the difference vs. regular collar. He’s not a “dominant puller” but scent driven and if he catches something interesting it will change direction in a flash and attempt to remove your arm from the body if not ready and braced.",
      "rating": 3.0,
      "verified": true,
      "author": "Cristian Aron",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Buy a size larger than you think you need",
      "text": "Not \"large.\" Was too small for our 70 pound Labrador and had to buy the add-a-link set to make fit. Does NOT leave gray marks on his fur like the traditional metal pinch/prong collars do, which is great. Doesn't provide as strong a \"pinch\" so is best for a dog that is already somewhat trained and who just needs a reminder when excited.",
      "rating": 4.0,
      "verified": true,
      "author": "Bonnie",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Works",
      "text": "Easy, helps hold back real strong dogs , with out choking, they just do not pull, one time they just think, nope, not chasing that cat or squirrel... I put it on my arm does not hurt, but remo ds big dogs , not to pull. again not checking involved , the dog chooses to walk easy no tension at all on leash...",
      "rating": 5.0,
      "verified": true,
      "author": "Jee",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "This type of collar was recommended to us by a dog trainer for one of ...",
      "text": "This type of collar was recommended to us by a dog trainer for one of our large dogs. It has made a significant difference in the pulling and obedience while on leash. It is not an everyday collar, but used for training only, has been an effective tool. It is easy to adjust and the snap on ability makes it very easy to put on the dog. We use it every time we train and there have been no marks on the dog's neck.",
      "rating": 5.0,
      "verified": true,
      "author": "MOMiss",
      "helpful_votes": 3,
      "publication_date": 20161002
    },
    {
      "title": "Effective at preventing dog from pulling when walking",
      "text": "I think this product is fantastic. I much prefer it over the metal training collars where the metal spikes seem like they can be very painful against a dog's skin. This plastic collar has removable links, so we started off using this with our German Sheppard puppy and we were able to add links in as she grew. Now transitioning over to her regular collar she does not pull when we walk. Our trainer at pet smart recommended this product and I recommend it as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashsmash12",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Miracle collar!",
      "text": "This collar is amazing and a miracle for us! We have a 95lb black lab that we had tried front vest to be able to walk him. He is super strong and unable to walk. With this collar we were able to walk with our son and have control, not being afraid that he would drag me. I amazed. Highly recommended!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nubia C. Forero Jaramillo",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Hard to figure out how to size it properly and use it",
      "text": "It’s tricky to know the sizing and how to use it. I bought mine from Warehouse and they came without instructions or video. To humans it looks like a torture device though I know it’s not. These are recommended by lots of trainers but I think you need a Trainer to demo the thing for you.",
      "rating": 3.0,
      "verified": true,
      "author": "E. Constable",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Don’t listen to bad reviews",
      "text": "Bought this for our german shepherd puppy who is in training. We have adjusted the size multiple times without any issue and it is not cheap like others are saying. The reason so many bad reviews have issues is because this is not a tool to “punish” your dog or hurt them so they don’t pull. It simply acts as a “tap” to get their attention, in a sense. You should only have to tug quickly and let go, not letting your dog continually pull. Works great and stays up unlike many other training collars. I guess if your dog is continually pulling hard then it might not last long (and then you should contact a trainer for help)",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Great!",
      "text": "Perfect for leash training a dog that loves to pull. My baby grew up on a farm (needless to say we didnt leash her), but when we moved she needed some reminding that when shes on a leash she isnt free to roam. This was perfect, didnt hurt her, and she was very responsive, shes had it on for 6 months now and it hasnt broken!",
      "rating": 5.0,
      "verified": true,
      "author": "BRITTNEY R.",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "isn't as noisy and in general is a great option for those that are properly trained on using ...",
      "text": "These are one of the types of training collars that our dog trainer recommends. She was jealous even because she hadn't seen the blue before! They work similarly to a prong collar but don't get you the same judgments from uneducated animal owners with these as you do with the prong collars. It corrects well, isn't as noisy and in general is a great option for those that are properly trained on using a training collar appropriately. As always, this is only meant to be used for training (short periods of time), so don't be one of those people who leaves it on their dog 24/7 causing injuries.",
      "rating": 5.0,
      "verified": true,
      "author": "Elsie Lodde",
      "helpful_votes": 0,
      "publication_date": 20160427
    },
    {
      "title": "Game changer",
      "text": "My dogs are well behaved and listen to commands pretty well, but we just moved to an apartment complex with a lot of other dogs. They get overly excited and tune out any and every thing else. Their harnesses weren’t doing much to dissuade them, but literally the first walk with these collars was a million percent better. They’re pups, so they do still get excited, but they are able to snap out of the trance little lady dogs put them in while we’re walking, and I’ll never go back to a regular harness.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Do not buy this.",
      "text": "The choker portion could snap with about 10lbs of force. The measurements are not accurate, it barely fit around my bullies neck. Is he swallowed too vigorously he would be jabbed by the points. This might work for a small and passive breed, but then you wouldn't even need this type of collar then. I purchased a metal prong collar with rubber ends for $12 and it worked like magic. My pup doesn't mind wearing it and he figured out that he needed to walk at my pace after the second use and i never had to pull on it once. Spend an extra 10 bucks and get a legit prong collar. Don't waste your money on this.",
      "rating": 1.0,
      "verified": true,
      "author": "sean",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "BEST TRAINING COLLAR",
      "text": "I have a very hyper pitbull who loves to pull on her leash. I’ve spent $$$ trying to find a collar that works for her with no luck. We tried a metal prong collar but it only worked for a few days. I purchased this as a last stitch effort and I am sooo glad I did. The hard plastic still provides pressure so that my dog knows to not pull. It was very easy to adjust to her fit and after watching a couple training videos on how to use it properly, my pup has never walked better! I can now enjoy a stroll without my arm being pulled from the socket!",
      "rating": 5.0,
      "verified": true,
      "author": "Antoinette",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Works super well!",
      "text": "This is a life saver. After one correction, my dog has never pulled again. Works perfectly for dogs that like to pull when they see other animals. Watch the video to see how you should put it on and on and how loose it should be to make sure it isn't causing any pain. My dog is 80 pounds and a great dane/pointer mix",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Good product, worked on my 45lb hound.",
      "text": "Within the first two uses she stopped dragging me down the road. I got this because I dont like the metal ones, they look to aggressive, this one is thick but sleek. Easy to use and easy to put on. Its sturdy. I have a 45lb hound that likes to catch a sent and drag me. But now shes learned patience.",
      "rating": 5.0,
      "verified": true,
      "author": "Tasha LaFond",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "a big help to control my Dog",
      "text": "The collar is easy to put on and remove. It really helps stop her from pulling (she's a doodle with thick hair). I didn't want to use the metal one and glad I bought. This is my second one. She chewed up the first one teething but they have extra links you can purchase. It was just easier for me to buy a new one. If anything happens to this one will definitely be buying a third one!!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth Etheridge",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Very well made",
      "text": "I purchased this collar to attempt to replace his pinch collar. I like that the collar clips off and on; unlike the pinch collar that goes over his ears. This collar works well, but isn’t as effective as his pinch collar. It is sturdy and very well made. My dog is very strong and very stubborn and this collar just doesn’t control him like the pinch collar.",
      "rating": 4.0,
      "verified": true,
      "author": "kdjkmiller",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "GREAT !!!!",
      "text": "I had lost all hope in ever having a nice walk with my dog Melvin(Pitbull/Hound Mix).He is a great dog,but also a strong and persistent puller.Nothing I tried seemed to work.I had stopped walking him as much due to his pulling,(and my bad back!).First time I used this it was like a a NEW DOG..Stopped yanking on leash immediately.Was able to focus on commands ..walking is such a pleasure now..I would highly recommend this product.Wished I had found it earlier Sincerely,Karen g",
      "rating": 5.0,
      "verified": true,
      "author": "karen G",
      "helpful_votes": 6,
      "publication_date": 20140905
    },
    {
      "title": "Perfect for loose leash training",
      "text": "Nice collar for walking my 8 mo. boxer pup, he would always pull so hard but now after a couple days with the collar he walks loose on the leash. It's been a real lifesaver, (the dogs not mine) lol. It seems pretty durable and I like the fact it doesn't look intimidating like the chain type.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Almazan",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Stopped pulling almost immediately",
      "text": "Great product. Love walking my German Shepherd and husky, but hated getting \"dragged\" the whole time. Husky quit pulling IMMEDIATELY....took the Shepherd a few walks, but finally quit pulling. And, they aren't as \"mean looking \" as the metal spiked collars.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray Robertson",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Best training collar",
      "text": "My German Shepherd has a problem with pulling when we go on walks. I have tried harnesses, which were doing very little (he is 90 lbs of of pure muscle), tried gentle leader (which was producing some favorable results but my dog hated it). After a dog training session, trainer recommended StarMark collar and results were almost immediate. Definitely recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "PDXDUCK",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Rounding up to 4 stars",
      "text": "I would say this is a good alternative AFTER you've trained your dog with a standard prong collar first. 3.5 stars but I'll round it up to 4 for the good idea. My only concern is how the rope attachments will hold up for the long haul. It's not held together by chains so every now and then when my dog has a hard pulling moment I can hear a noise as if the stitching is breaking little by little. The last thing I need is for it to snap and I'm running after my dog > squirrel!",
      "rating": 4.0,
      "verified": true,
      "author": "chris l.",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Followed all instructions and directions and this collar did NOTHING!",
      "text": "As I said, I followed all package instructions and used it EXACTLY how I was instructed and my dog pulled like she was on a regular collar. This thing is a piece of plastic garbage and if I were you I'd save my money and try something else. Horrible experience!",
      "rating": 1.0,
      "verified": true,
      "author": "Jack Denver",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "this didnt help our dog",
      "text": "We have a labradoodle that is about 55 pounds. he pulls on the leash. this didnt stop him from pulling on the leash. It was easy to put on him, much easier than the Gentle Leader we have, but it didnt work. The Gentle Leader one works so i guess we will stick with that type.",
      "rating": 2.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Great for 50 pound pitbull",
      "text": "I have two 50 pound pit bulls and bought this for my dominant dog. She always pulls because she’s trying to lead the pack and nearly takes me to the ground. This has made a huge difference on a leash for her. Would definitely recommend if you have big dogs that needs some help remembering their manners on a leash.",
      "rating": 5.0,
      "verified": true,
      "author": "Callie 713",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Better alternative to prong collar",
      "text": "I prefer this corrective collar 100% more than the traditional prong collar. It is everything you'd want in the correction department with a less bulky, less abrasive, and less extreme look. Only con is a HUGE learning curve and difficulty in removing/reattaching links... After about 10 minutes, a lot of frustration, painful fingers, and a few YouTube tutorials, I finally figured it out. Once you learn how to reassemble it is very easy to do. I have had it on my 65lb puller for about 6 months with no durability issues. Recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Keira Lopez",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Did not help with pulling on leash",
      "text": "I bought this for my very strong pit bull and American bulldog mix. She pulls like crazy and lunge runs on leash. Got this hoping it would make her stop! We used it today for the first time and she wasn’t even fazed. Still pulled and choked herself the entire walk.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephanie B.",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Great Training Collar!",
      "text": "I've used this product for training my dog. She loves to jump up to people to give them kisses a lot. All other collars have not worked until I tried the StarMark Training Collar. It was easy to adjust the links for her size of neck. As she grew bigger I added a couple more links. Very durable product and I have no issues so far. I have been using this product for over three months and everything is still intact.",
      "rating": 5.0,
      "verified": true,
      "author": "Jorge Banuelos",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Not Very Effective for my Particular Breed",
      "text": "I have primarily a Basset Hound and Labrador mix, and he has a little bit of extra skin. It seems this collar does not bother him very much. It keeps him in check, however he still pulls like a freight train on our walks. I would say the effectiveness of this collar depends entirely on the breed of the pup, as well as the temperament.",
      "rating": 3.0,
      "verified": true,
      "author": "Mo",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Size issues but otherwise works great.",
      "text": "I would give this 5 stars if large meant large. My 1 year old lab was a bit large for the base model and needed three extra links. - meaning wait for a second order. Some sizing guidance guys? Anyway, it works great. My dog hated harnesses but gets excited to go out when I pick up his collar. Very satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "Lynn Pollock",
      "helpful_votes": 0,
      "publication_date": 20200601
    }
  ],
  "product_meta": {
    "title": "StarMark Training Collar, Large, Black",
    "description": "Size:LargeTraining collar for dogs with patented humane design.",
    "rating": 4.2,
    "feature_bullets": [
      "Quality and performance driven products for your pet",
      "Tested for safety and health",
      "Provide a better quality of living for your pet with Starmark",
      "Age Range Description: All Life Stages",
      "Special Features: Adjustable",
      "Helps train your dog gently and effectively",
      "High-strength link design fits together in watchband pattern",
      "20-inch circumference fits larger dogs",
      "Links can be removed or added (additional links sold separately)",
      "Created by certified experts at Triple Crown Dog Academy, Inc."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "8 x 3 x 11 inches; 1 Pounds",
      "Item model number": "TCLC",
      "Date First Available": "August 18, 2004",
      "Manufacturer": "Triple Crown",
      "ASIN": "B000A6BD5K",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Training & Behavior Aids",
      "Dogs",
      "Pet Supplies",
      "Training Collars"
    ],
    "price": 10.06
  }
}