{
  "website_summaries": [
    {
      "verdict": "Hoop design is as decorative as it is useful. Looks great beside a fireplace.",
      "pros": [
        "An elegant design that works indoors and outdoors",
        "When you don't need to store a large amount of firewood, this is a good choice"
      ],
      "cons": [
        "Assembly is challenging, can be wobbly when fully loaded",
        "Does not store large amounts of firewood"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Awesome!  Holds a ton, sturdy, great price!",
      "text": "i looked and looked for something to put on our porch to hold wood. We store our cord behind our shed so we needed something just outside the door so we didn't need to trek out back for each fire. Line up your holes before screwing and you will do fine with putting it together. We thought we were a screw short but only one screw on top. Can't believe the price of this; was ready to spend 4x for something less decorative. Can't say enough about this!",
      "rating": 5.0,
      "verified": true,
      "author": "Merrie Beth Nauman",
      "helpful_votes": 50,
      "publication_date": 20150301
    },
    {
      "title": "Can't beat the price!",
      "text": "Would have paid 90 bucks for this same log holder anywhere else. My son and I put this together. Huge! This is about the same height as my 4 year old. I didn't run into any problems putting this together. Very lightweight but sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Ivon G.",
      "helpful_votes": 29,
      "publication_date": 20150418
    },
    {
      "title": "Great deal",
      "text": "Great price and overall pretty sturdy, especially if you are using indoors. We are using for a fire pit and it holds a lot while looking nice. It was easy to put together but without detailed instructions we had to use the Amazon photo to know which way to attach two pieces.",
      "rating": 4.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 20,
      "publication_date": 20151128
    },
    {
      "title": "Absolute junk!",
      "text": "This was extremely poorly manufactured and only two of the screw holes lined up correctly. Every other screw hole needed to be drilled out so the holes lined up perfectly. What should have been an easy 5 minute assembly ended up taking nearly an hour of hard labor and modification to make work. I would strongly recommend choosing a different company with better quality control.",
      "rating": 1.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 6,
      "publication_date": 20180511
    },
    {
      "title": "HORRIBLE DIRCTIONS TO ASSEMLE!",
      "text": "The end product is decent, maybe a little flimsier than I thought it would be, but the dirctions to assemble it are the worst. I've posted close up pictures of the final assembly in the hopes that it will help others...",
      "rating": 4.0,
      "verified": true,
      "author": "LS",
      "helpful_votes": 13,
      "publication_date": 20161030
    },
    {
      "title": "Sturdy. Simple to assemble.",
      "text": "Holds a lot of wood! The 40” hoop I assembled is used indoors and tidied up a pile of logs scattered on the floor next to my fireplace. It was easy to assemble. Took 45 minutes. Tools needed: One Phillips head screwdriver, a pliers or wrench to hold the nut as you tighten the bolt and an awl or thick nail to help line up the bolt holes. It is rock-solid sturdy after tightening the bolts. The instructions could be a bit better but, not to worry, the large clear photo of the hoop on the box shows you everything you need to know. Excellent price. Delivered on the date promised.",
      "rating": 5.0,
      "verified": true,
      "author": "Frumious",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "I love this thing!",
      "text": "While seemingly junky, which it is in a way, it looks AWESOME. Its larger than I expected in my mind despite totally accurate measurements. With the wood filling it up it's totally 100% great, no problems what so ever. The circular design is great bc most everything we all live in and decorate with is predominately square/rectangular so this circular item really stands out bc of its shape alone. Totally recommend.... I will add one caveat... mine has been mostly decorative as I got it toward the end of using the fireplace season.",
      "rating": 5.0,
      "verified": true,
      "author": "NYC WDSTK JENNIFER",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "These directions are the worst I have ever received from an Amazon purchase",
      "text": "These directions are the worst I have ever received from an Amazon purchase. A 10 min assembly turned into an hour to unassemble due to the very first instruction being wrong. It is a very low quality product that I expect to only be usable for 1 season. It will rust and it will loosen all the time. There are a million nuts and screws to tighten that came loose just as we moved it to the back yard. But something that the ring is a one piece circle and no rustable parts. I have written on the directions what should have been there in order for the final step to actually work.",
      "rating": 1.0,
      "verified": true,
      "author": "Randy Fletcher",
      "helpful_votes": 2,
      "publication_date": 20180602
    },
    {
      "title": "Not well constructed for the price",
      "text": "I purchased the Panacea fire rack for indoor use and easy access to eliminate excessive trips hauling firewood into the house. The package arrived timely as expected. I was disappointed with the size of metal pieces which are thin. This is not a heavy duty metal and its very plain and straightforward for function, not aesthetics. Assembly was fairly quick, but two screw holes on round metal pieces used to support the stand hadn't been drilled. The wood rack is able to support wood if you don't move the rack once filled, as the support legs are flimsy. The price would be fair if it were better made. Photo does show rack leans. Hope this helps you.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Sturdy wood holder",
      "text": "The only issue I had with this unit was putting the top screw in to hold the hoops together. The holes were not drilled accurately enough and I need someone with stronger hands to wiggle the two hoops together so the screw would go through both the hoops all the way. However, once together, it seems to be quite sturdy and I was able to fill it up with wood. Make sure your wood is at least 16\" long though, or it would reach across the hoops on the bottom and will fall through. It was suggested that using a cut piece of thin wood that can be molded to the bottom would solve this problem for wood size.",
      "rating": 4.0,
      "verified": true,
      "author": "Shayleia",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Great product, stores a lot of wood pieces!",
      "text": "This circular wood holder fit perfectly near our fireplace and holds over 45 pieces of wood. We will not have to go outside at night to get more wood for the fireplace from backyard. (When I state we I mean my husband lol.) After reading other reviews, my husband did not tighten any bolts until the end of the assembly, the top of the circle had a whole that had to be pushed into place so that bolt can enter. Overall, it was easy to put together and took around half hour. The design of holder is very clean & sturdy. The price is very affordable and worth your investment. Great buy, we highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Robinson Edison ",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "I love this wood management system",
      "text": "love love love!!! Oh my gosh. This is the best wood storage ever. I put it together myself and due to a comment I read that said it was wobbly; I re-tightened screws once all screws were in place. It holds 30-40 pieces of wood and fits. Absolutely perfect in the house.",
      "rating": 5.0,
      "verified": true,
      "author": "TheDawnAmber",
      "helpful_votes": 16,
      "publication_date": 20150120
    },
    {
      "title": "Great product for the cost!",
      "text": "Excellent. As others stated, larger (40\") is a great size for my front porch! Just pay attention to the bottom bar being on the outside of the \"U\" shaped ends and the hoop being inside of that bar. I had zero trouble putting this together in 10 minutes. Tightened nuts with players and filled it up.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 4,
      "publication_date": 20170821
    },
    {
      "title": "Poorly made item",
      "text": "This product is poorly constructed. First of all, the number of bolts was short and one of the nuts was mismachined and did not fit the bolt (they were black in color, so not possible to match at the hardware store). Secondly, the bolts provided were all the same size, when some should have been shorter to account for different sized pipes to attach. Lastly, the pipes should have matched up where they came together, but did not do so. Poorly constructed item!",
      "rating": 1.0,
      "verified": true,
      "author": "Michael V. Accettura",
      "helpful_votes": 3,
      "publication_date": 20170508
    },
    {
      "title": "Easy to assemble",
      "text": "Awesome experience. Delivered EARLY and had adequate instructions. I wonder if the distributor improved the instructions after some of the reviews. I was prepared for a struggle but it was super straight forward and easy. Here’s a picture of my holder loaded with a 1/8 cord of seasoned wood. I’m shocked it can hold this much. I’m anxious to see how the unit weathers and supports this weight long term. But for now, and for the money, I’m THRILLED. And it looks so stylish. That is important to me.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Buy if your looking at this review.",
      "text": "Directions lacked. Make sure B circle faces down. You will know because of one pre-drilled hole goes into center of bottom. Took me three tries to see the instructions do kind of ahow tht. Loved all hardware was one size screw and nut- phillip bit and 5/16. Amazingly, it holds about 55 pieces of wood or 1/4 face cord, depending on size of splits. I should only have to stack living room wood once a week. Unit is very sturdy so far. All in all, Im very happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Swanson",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Poor Manufacturing",
      "text": "This was difficult to put together as the holes are not aligned. I have tried every single thing I could to hold the hoops together, but nothing worked. I ended up using it without the hoops being joined at the top. I wonder how long it will hold up that way.",
      "rating": 1.0,
      "verified": true,
      "author": "Humbleheart",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Blanket Holder",
      "text": "I saw a picture somewhere where someone used it to hold their quilts. Brilliant idea! I got it for that. My blankets don't match but it serves the purpose. Could be used for pillows too, stacking them sideways so they don't have to be far from the wall. Love this thing! I use it in the bedroom but lap blankets/pillows in a living room for easy access would be great too:)",
      "rating": 5.0,
      "verified": true,
      "author": "happygirl",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "good value and sturdy",
      "text": "For some reason this 40 inch wood holder was cheaper than a smaller one I also saw on Amazon, this holds a lot of wood and it's pretty sturdy. We have a wood burning indoor fireplace and if this circle is completely full we can get at leaset 4 nights of fires out of it. Definitely worth it, nice and simple design too.",
      "rating": 5.0,
      "verified": true,
      "author": "noky64",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Second one wasn’t 40” - it is 35”",
      "text": "We ordered two of these. The first one was great (albeit the assembly instructions are ridiculous). We ordered another one to go along side the first one. It is NOT 40”. It is 35” - so they look ridiculous next to each other as they are 5” difference in height. It was clearly made incorrectly - but I don’t want to risk returning it and getting another 35” one - so we will deal with it",
      "rating": 1.0,
      "verified": true,
      "author": "Paul Norris",
      "helpful_votes": 2,
      "publication_date": 20181130
    },
    {
      "title": "Not going to return it, but wouldn’t recommend to a friend",
      "text": "I was trying to save a few buck over Home Depot’s version. It is a cheap import with very poor tolerances. It is not the worst thing I have purchased and I am not going to go through the trouble of returning it. I wouldn’t buy it again and wouldn’t recommend it to a friend, but I am hoping it will last a couple years.",
      "rating": 3.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Poorly Made",
      "text": "Holes did not line up. When I got it together, the bottom did not sit flat on the floor. It rocked back and forth because the holes did not line up. This is a complete ripoff.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Worth it for the money.",
      "text": "This sis not rugged wrought iron - it is tubular. The former is more than I wanted to spend, so I'm happy with this. It arrived missing a piece (one of the hoop sections) so I called the company direct (as instructed), was able to talk to a (very nice) person, and they shipped the missing piece lickety split, no questions asked. Would recommen.",
      "rating": 4.0,
      "verified": true,
      "author": "KAllen",
      "helpful_votes": 2,
      "publication_date": 20170811
    },
    {
      "title": "Solid product",
      "text": "Purchased several years ago and it is still going strong. I store mine on the front porch where it is covered but still occasionally rained on. Holding up well and still looks great! A little difficult to assemble, just a bit awkward.",
      "rating": 3.0,
      "verified": true,
      "author": "@TheDryja",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "What the hell Panacea! You are ignoring simple things that could make this a decent product. Major oversights.",
      "text": "I'm assuming the reason they sell this so cheap on amazon is because the equipment assembly is GOD AWFUL. 3 of the nuts I received were stripped before I even screwed them and even the tubes don't fit together super well. The instructions were convoluted and even if they weren't the design left the top joining without a shorter screw to hold it together tighter. Un-freaking-believable. The product itself is okay. IF you go to the hardware store yourself to correct their mistakes. And who doesn't include at least one extra screw, nut, or washer? Come on.",
      "rating": 2.0,
      "verified": true,
      "author": "Adam A.",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "I thought this would look nice in the living room next to the fireplace but ...",
      "text": "I thought this would look nice in the living room next to the fireplace but it turned out to be way too big so I also purchased the smaller one and placed this one on the porch. This holds plenty of wood for us for a weekend and longer. I have a feeling maybe they updated the instructions in the month before I purchased as I had no issue in assembling this. I realized this was the biggest complaint and carefully looked at it and how it would be assembled however it only took me about 30 minutes along with unpacking and throwing the box away.",
      "rating": 5.0,
      "verified": true,
      "author": "David Wright",
      "helpful_votes": 0,
      "publication_date": 20151214
    },
    {
      "title": "This was sort of easy to almost put together I was shorted 1 nut ...",
      "text": "This was sort of easy to almost put together I was shorted 1 nut and bolt. But I had one that would fit so I didn't need to reach out to the seller. Took me a little over 20 minutes to put together correctly because I don't read directions very well and put the bottom backwards the first time. Since the bolt I found was twice as long I can just hang my bucket from it and make this a all in one holder and no need to have parts in different spots. Perfect for my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina",
      "helpful_votes": 0,
      "publication_date": 20160819
    },
    {
      "title": "The seemingly simple instruction manual is missing a vital step ...",
      "text": "The seemingly simple instruction manual is missing a vital step : step 1. pop a few tranquilizers For sure read the 5 simple steps several times because you will get it wrong. The tubes slide together under tension so it is very tricky to align the holes. Overall flimsy product and the paint will come off as soon as the first log hits it. Guess it's cheap so should be managing my expectations. (at least the tranquilizers are kicking in now)",
      "rating": 2.0,
      "verified": true,
      "author": "marc0061",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Attractive, stylish and practical",
      "text": "Exactly what I was looking for for my breezeway. Great price too. Perfect to hold a weeks worth of evening fires come winter. May look for a larger one to put on patio now. Easy to put together. Was Initially worried about sturdiness but surprisingly sturdy when loaded with wood.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracee_w",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Nice to have",
      "text": "I had been looking for one of these for a while to put some wood on to have by our firepit. It's nice to be able to have would close and not stuff that's just laying on the ground. It's pretty sturdy & was easy to put together. It's actually pretty big.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Fills completely and holds up.",
      "text": "I'm buying it again! I got this 4 years ago and getting another for more capacity. It sits under the porch out of direct rain and snow but is still exposed. It goes in the shed in the summer. The only complaint is that it's easy to overtighten and bend during assembly",
      "rating": 4.0,
      "verified": true,
      "author": "Infiltraitor Chin",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Looks great, easy to put together.",
      "text": "I'm not sure why everyone else had so many problems with this, unless Panacea recently updated the instructions. I had it together in under 10 minutes. There are literally only 4 different shapes of tubing: U shaped, straight, curved with 3 holes, and curved with 2 holes. Connect the straight ones to the U ones. Connect the curved with 3 holes to these. Add in the curved with two holes and screw them in. Done! I will say the one thing the instructions didn't say is to put the straight pieces on the outside of the U shaped ones, but that's easy to figure out. If you can make a peanut butter and jelly sandwich you can put this together.",
      "rating": 5.0,
      "verified": true,
      "author": "Just Dave",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "Not heavy duty but works",
      "text": "It's easy to put together if you are slightly handy. Looks good and the 40inch holds a lot of wood. It's not exactly heavy duty as it is constructed of hollow tent like tunes. Glad I bought it. Took10 minutes to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Looks good. Tough to assemble.",
      "text": "This did the job as advertised. Held a lot more wood than expected. It looks good on my patio. Assembly was tough as the parts did. It come together easily. A lot of bending and flexing required. Price is reasonable. I would buy again on looks and functionality.",
      "rating": 4.0,
      "verified": true,
      "author": "LoMan",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Pretty much what you would expect",
      "text": "Pretty much what you would expect.... Pros: * Inexpensive * Looks nice from afar * Holds wood Cons * Assembly instructions are vague but not that bad. Took 10 mins to assemble, alone. The best tip is not to tighten everything down until you get everything lined up. \"B goes down\". * Wobbles once fully assembled (goes away once loaded up a bit) This is all about the cost. I think at $25 this would be 5 starts. For closer to $40, it's 3 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "S \"I'll tell you what I think\"",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "Very nice BIG log rack!",
      "text": "I love it. I ordered the big one, but somehow I didn't know it would be so huge but it works out perfect to keep wood out on my covered front porch. I thought it would be small enough to keep in the house but it is way too big to have inside for my living room. It worked out better for me to have it just outside on the porch so I am happier then I thought I would be with it. It was also very easy to put together. It is light weight to move empty but sturdy to hold a big load of logs. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161102
    },
    {
      "title": "Very nice and strudy!",
      "text": "Very happy! At first this is a little confusing to put together. But once it's clear on how it comes together it's easy. It's really nice and is perfect for our indoor wood stove area. We had a small space but I wanted something that the wood looks pretty in. I know who cares but if your going to look at it day in and day out it might as well be eye pleasing and this one is. I just love it and so does my husband.",
      "rating": 5.0,
      "verified": true,
      "author": "Muddy Mindi",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Sturdy and holds a ton of wood",
      "text": "After buying pretty indoor wood holders that over time bent out and broke, I found this. My parents had one this size and shape outside and it lasted forever!! Looks great inside too and holds a ton of wood!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather E",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "I am disappointed with the quality",
      "text": "I am disappointed with the quality. It seems very lightweight for all the logs this thing could potentially hold (I got the 40”). I would worry that this won’t support the logs. My other major complaint is that the holes did not line up. It took a lot of work to finally get it together. Because of the pushing and twisting needed to finally get the bolts through, I am a bit concerned about the structural integrity of it even more so. We shall see.",
      "rating": 2.0,
      "verified": true,
      "author": "BKCO14",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "A CAVE MAN COULD DO IT!!!",
      "text": "The reviewers of this item with the exception of those who had no problem getting these together should NOT be allowed to have an open fire in their house.. I bought 2, I had them together and the boxes they came in burned in less than a half hour. No super human strength is needed. No problems with holes lining up. Seriously, A child could put these together. They hold a good amount of wood, Look decent and I expect to get more than a few years of use out of them",
      "rating": 5.0,
      "verified": true,
      "author": "The Bear",
      "helpful_votes": 8,
      "publication_date": 20130823
    },
    {
      "title": "No bolts or assembly instructions",
      "text": "The description said \"Small cosmetic imperfection on top, front or sides of item. Small cosmetic Imperfection(s) on bottom or back of the item. Item will come in original packaging. Packaging will be damaged.\", but the truth is it came with no bolts or assembly instructions.",
      "rating": 1.0,
      "verified": true,
      "author": "Rebecca or Michael Parmley",
      "helpful_votes": 2,
      "publication_date": 20170819
    },
    {
      "title": "Wrong size in picture",
      "text": "I ordered the 40 inch because of the picture with the wood placed in it. When I assembled it, it came up to about my waist/stomach. I then realized that the photo must be the smaller 20 inch version. I exchanged it and I'm satisfied with the smaller version that can fit next to my fireplace.",
      "rating": 3.0,
      "verified": true,
      "author": "stEv",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Good for the price",
      "text": "This was fairly easy to install, the instructions could be better but easy to figure out what they leave out. Seems a tad wobbly but once I loaded it with wood it got better. Overall happy.",
      "rating": 4.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Functional but disappointing quality control.",
      "text": "A little disappointing quality. Hardware bag was not properly secured and arrived with nuts/bolts loose in box. Several were missing. Resolved with a quick trip to local hardware store, which was easier than dealing with returns. Easy to put together but the end of the hoops are poorly machined so a little brute force is required to get things into place.",
      "rating": 2.0,
      "verified": true,
      "author": "Pilar Otto",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Good item for the money",
      "text": "It came with photo/directions which outlined how many units of each were suppose to be included, and they were, this diagram was sufficient to my putting the item together, it was not step by step, but if you think about what you are doing this item is easy to put together. I'm not sure why others had concern. It did need a shim under one corner which was not ideal to have to do and the box had a hole in it large enough when I received it for one of the pipes to fall out as I moved the box- mostly FED EXP fault, thankfully everything was complete. I would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "reviewer",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Love this to display next to my fireplace",
      "text": "I wanted something that pretty to sit beside my fireplace all winter. I bought this and it was easy to put together by myself. It was about 3 or 4 feet tall and wide. It is a dull metal with no shine. That is what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Kandra",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Beautiful addition to our fireplace",
      "text": "This is bigger than I expected, guess I should have paid better attention to the size! We love it though, it is exactly what we wanted and holds a lot more logs than the others we had looked at which means less trips outside in the cold! This is a beautiful addition to our fireplace and living room. It was easy to put together and I would highly recommend it. Just make sure you have room for it, luckily we did!",
      "rating": 5.0,
      "verified": true,
      "author": "aleblanc",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "Easy to put together!",
      "text": "This is an inexpensive but good looking way to store firewood just outside from the woodstove. It does exactly what I needed it to do and it was a good purchase! I would definitely recommend one of these to a friend if they need one.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken D.  West Virginia",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Looks good and stands up well.",
      "text": "Okay, I’m always great at assembling things but this one gave me a tough time. Trust me, have a friend or family member help. Follow the directions and have an extra pair of hands and it’ll be fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Rae-Ann Stillwagon",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Poor Manufacturing",
      "text": "Very difficult to assemble. Parts would not fit together in the hole made. I think some people got lucky with a good product and others didn’t. I will be returning this item.",
      "rating": 1.0,
      "verified": true,
      "author": "AlexMom",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Sturdy and attractive!",
      "text": "I’m very pleased with this rack. It is very sturdy and attractive. It is much bigger than I expected but that is good. It keeps the wood neat and up off the porch floor. I would definitely refer it to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ladylea",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Meh.",
      "text": "Not impressed. Was missing pieces to keep it connected in the top/middle area, and in general feels pretty flimsy. Bummer because it was a gift for my fiancé!",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa Tufano | THINK LIKE A BOSS LADY",
      "helpful_votes": 2,
      "publication_date": 20171201
    },
    {
      "title": "You get what you pay for",
      "text": "This is a clear example of you get what you pay for. The instructions leave a bit to be desired. You are better off looking at the picture on Amazon and zoom in to see what side for step one. The hoop sections that slide into anoyher section needed to be made round with a pair of pliers so they fit into the mating part. The holes did not line up at the top of the hoop. I had to widen the hole a bit so the bolt wouod fit all the way thru. Once assembled it does hold the logs well.",
      "rating": 2.0,
      "verified": true,
      "author": "Jim W",
      "helpful_votes": 0,
      "publication_date": 20161127
    },
    {
      "title": "Perfect size and fit for our needs.",
      "text": "The only reason it didn't get a 5 was because the instructions said once you have the circles put together, the tension should hold them in place - that was not the case with my assembly. The pieces kept coming apart before I could put the screws in place. I needed assistance to hold the pieces together in order to assemble.",
      "rating": 4.0,
      "verified": true,
      "author": "V",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Great little log rack",
      "text": "I bought this to use for patio/backyard fire pit bonfires, but having it setting in one place was kind of difficult. I got a little 'moving trolley' (small wood platform and four wheels) from a local discount place. I attached the trolley to the bottom of the log rack, with some metal plumbing bracket straps that I got from the hardware store for 50 cents each. Now the log rack is portable and I can roll it into the garage to protect the wood from the rain, or move it closer to the fire pit. Took about 15 minutes and works like a charm. Seems like it will be sooooo awesome, especially as it is movable now.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelica Sidious",
      "helpful_votes": 0,
      "publication_date": 20131011
    },
    {
      "title": "Rickety, wobbly, poorly made rack that gets the job done",
      "text": "This rack is poorly made: the connections aren't perfect, the instructions are vague, the holes are *almost* lined up just right, and it wobbles a bit when you set it down on a flat surface. If I had to do it over again, I'd buy something else. That said, once assembled and stocked full of wood it does hold a decent amount and it isn't a total eyesore. The 2 stars are for being functional.",
      "rating": 2.0,
      "verified": true,
      "author": "D. Rappo",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "These hoops are PERFECT for hanging florals!!!!",
      "text": "We needed strong (but not overly heavy) hoops to make wedding florals. These worked out perfectly using command hoops & strong fishline. Sometimes thinking outside the box works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 4,
      "publication_date": 20170103
    },
    {
      "title": "Looks great!",
      "text": "Great addition to our back porch, looks nice and hold a fair amount of wood! Great for backyard burning, our keeping a little wood closer to back door at winter time!",
      "rating": 5.0,
      "verified": true,
      "author": "Whoa Babe",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Cheap and resold!",
      "text": "This must have been a returned item at one time. The box was tapped up as it had been opened once before. Two screws the heads were busted off, replaced with an additional nut (not a new screw). The entire piece won’t sit flat, readjusted it a few times with no luck. Loaded it with wood about half ways and it started to bend. Not impressed l!!",
      "rating": 2.0,
      "verified": true,
      "author": "Chad",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Pretty good",
      "text": "It's pretty good, holds lots of wood, we use a cart now to move it. It's a little wobbly when low on wood and seems a little cheap but the price was good and it looks good and holds wood.",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Very happy for the price",
      "text": "I am pretty happy with this wood rack for the price. I wanted something like this (smaller wood rack) to compliment my 8 footer. I believe the legs are curved so the weight distributes. I could see this as an issue if you have a toddler.",
      "rating": 4.0,
      "verified": true,
      "author": "Timothy Monahan",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "POORLY MADE!!!",
      "text": "I guess you get what you pay for. The metal pieces were warped and did not fit together properly. I got it to the point where it's standing and (surprisingly) holds the wood. Two of the sections aren't even screwed into anything because the pieces did not fit into one another. One of my sets of screws was missing a bolt to go along with it. Would NOT recommend. Spend the money to get a higher quality holder.",
      "rating": 2.0,
      "verified": true,
      "author": "Marissa",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Nice buy",
      "text": "This was much larger than I had anticipated, much too large to be inside, but it works great outside. It is very sturdy and is currently filled with wood and holding up superb. It's also attractive.",
      "rating": 5.0,
      "verified": true,
      "author": "LA",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Doesn’t fit together as it should",
      "text": "Circular pieces don’t fit together well, some holes don’t line up. Would require modifications to even assemble. Not worth trying, just sending back. Poor quality. Obviously the company can’t be bothered with quality control.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "disappointing",
      "text": "There is no good way to put this together. I bought two, and putting the second one together was every bit as hard as putting the first together. The directions are atrocious, and the pieces are not machined to make the loops connect at the top correctly. It just looks and feels flimsy, made of 3/4\" aluminum tubing. The outside diameter of the loop is almost 40\" and it stands about 43\". It should look fine once it is full of fire wood, but I don't expect it to last.",
      "rating": 2.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 0,
      "publication_date": 20151201
    },
    {
      "title": "Great for indoors!",
      "text": "It looks great indoors! Only downfall is it’s a little wobbly on carpet. Otherwise, it holds a lot of wood and looks good as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Jax D",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Very functional",
      "text": "First one had one bent hoop and one bolt that didn't screw in so it made the entire thing unusable. The second one was perfect. Truly does hold about 1/8 cord, is sturdy, has a small and un-clunky (dare I say stylish compared to my alternative wood holders) footprint. A little too large for where I intended it for, but have no regrets. Amazon/Panacea had stellar customer service for the replacement which arrived sooner than expected. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellis Dee",
      "helpful_votes": 0,
      "publication_date": 20160104
    },
    {
      "title": "Easy to Set Up and Sturdy",
      "text": "This was not hard to set up. Just focus and read the instructions throughly before you begin (maybe put some sticknotes to label each part of the circles to avoid confusion) but I'm definitely not an engineer and I did not struggle. I was shocked at how easy it was to assemble after reading the reviews. This thing holds loads of firewood and it's pretty cute so we love it. Feels very sturdy/durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Audrey",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Cute but larger than expected.",
      "text": "So this is really cute and actually worked out for our space despite the fact that we did not realize how large it was. Its large enough to be used indoor or outdoor. We can store a lot of wood in the house now lol",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie Priddy",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Sturdy",
      "text": "Bought this to store some wood for the winter. It's very sturdy, and holds a lot more wood than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Elbeef",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Study the Amazon pics before/during assembly",
      "text": "I had to laugh at myself putting this together because I had to undo parts of the simple assembly a couple times! I am very handy and usually find assemblies pretty easy and straight forward. The directions for putting this together are not wrong but they could be more elaborate. Just simple stuff... Anyhow, I ran in to the house and took a 30-second peek at the pics on Amazon and was off to the finish line. I'm happy with the ring and love the aesthetics of have the logs stacked this way. When loaded with the logs, it is quite sturdy. I bought the 40\" and it holds about 1-1/2 wheel barrels worth of logs.",
      "rating": 5.0,
      "verified": true,
      "author": "jennifer moura",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "We liked it",
      "text": "Beautiful wood rack that holds ALOT of wood! Looks nice in the house and we don’t have to refill it every single day!",
      "rating": 5.0,
      "verified": true,
      "author": "MTwomen",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Sturdy",
      "text": "Iv been using mine for a photo prop every study hard to tip over with weight on it perfect for what I am using it for.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Florczak",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Good size rack for several days of firewood",
      "text": "Easy assembly. Holds enough wood for 3-5 days of burning depending on wood stove. Exactly what we were looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Watson",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "4/5",
      "text": "Awesome for Photography prop with wreaths around it! but lopsided every time i tried to put it together and start over.",
      "rating": 4.0,
      "verified": true,
      "author": "Haley L.",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "This product was better than expected",
      "text": "This product was better than expected. I bought this for my mother's home and when I put it together for her at my house, which took about 15 minutes, it was much bigger than she thought and was disappointed that it was too big to go in her living room. I took her home and brought it in the house and it fit perfectly next to the fireplace. She was shocked! I loaded it halfway with wood and she couldn't have been more pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Newman",
      "helpful_votes": 0,
      "publication_date": 20151227
    },
    {
      "title": "slightly tricky assembly, somewhat light feel to steel, but it's holding up great",
      "text": "It takes a few hands and some bending to get everything lined up to screw together. it seems at first that the thing is a little flimsy, but we've loaded it to the brim with wood and it's holding well.",
      "rating": 5.0,
      "verified": true,
      "author": "Tabitha Johnson",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Easy to assemble",
      "text": "Easy to assemble, aesthetically looks good, and holds a fair amount near the house or in my case on the porch that you don't have to go off to the wood pile al the time. Pretty much looks as pictured when loaded.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Borisow",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Cheap materials, unstable, dangerous",
      "text": "Round bottom makes it easy to tip over. Stacked full of wood. Ring tipped screw snapped now ring is bent and useless. Went into the dumpster. Thank god my kids weren’t near it when it fell!",
      "rating": 2.0,
      "verified": true,
      "author": "Sammie Jo",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "we bring up enough wood to burn for a week at a time and it's nice to be able to keep it right outside the ...",
      "text": "had this on the porch for a year now...we bring up enough wood to burn for a week at a time and it's nice to be able to keep it right outside the door in a decorative piece like this as opposed to just a pile against the wall...keeps wood up off the ground and lets it breathe!",
      "rating": 5.0,
      "verified": true,
      "author": "micah",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Great product, highly recommend it!",
      "text": "I put this together my self. It was an easy and quick set up. I love the way it looks on my porch too. It holds a lot of wood.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry ",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "great price and fits the bill.",
      "text": "Love this. Holds a lot more than you'd think and looks nice. Great for the price and from a few feet away looks great. You can, however, really see the bolts, and there's certainly no fooling anyone that this is real iron.",
      "rating": 4.0,
      "verified": true,
      "author": "Ronan Doyle",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Don’t pass this up",
      "text": "Yes, it was a pain to put together but it was totally worth it. Took my husband about an hour to assemble. Great quality and beautiful design. We get so many compliments on it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "I’m very usful and decorative",
      "text": "We bought this to keep wood on the porch for the winter. Last year we would go to our pile to get the wood through the snow. It takes 1/4 of a cord. Wood is dry, it’s simple and sturdy. Great price can’t beat it.",
      "rating": 5.0,
      "verified": true,
      "author": "A N S Plastics",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Nice firewood holder",
      "text": "Nice holder, however, the one pole came detached after a short amount of time. It's still 100% functional, I just wish the pole would be able to fit back together again.",
      "rating": 4.0,
      "verified": true,
      "author": "Megan Leigh",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Nice rack",
      "text": "It is decently priced for what you get. We will see how it holds up over time.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Yerby",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Holds a lot of wood, attractive design",
      "text": "We have filled the whole stand with wood. No problems. Looks better full but we tend to be lazy on getting the wood inside.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Deery",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Pleased.",
      "text": "Easy to assemble. The round shape makes stacking the wood easier and it looks nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelli L.",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "A bit of a task to put together",
      "text": "I love the design. It was a bit of a task putting it together and didn’t come with instructions. The over all sturdiness was ok a bit wobbly without the wood in it. Loaded with wood it was much better. But a good deal for the price. I would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa jacobs",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Solid firewood holder , does the job easy to set up !",
      "text": "Good study pieces , they work well and easy to put together.",
      "rating": 4.0,
      "verified": true,
      "author": "Family first",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Sturdy, perfect gift",
      "text": "Son-in-law had it filled up with wood first day he got it",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Does its job",
      "text": "This thing is awesome basic but sturdy and does precisely what it was designed for. Instructions are a little different to figure out but overall very satisfied",
      "rating": 5.0,
      "verified": true,
      "author": "Jared ",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "A little chinsey",
      "text": "Overall this is a decent and decorative holder. It has not fallen over yet! It serves its purpose for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Heather L.",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Directions for assembly are a Horror",
      "text": "I like it and was able to assemble, but the directions were terrible. I couldn't have done it without the Amazon photos. Worst directions I've had to use in a really long time. Panacea could learn a lot from Weber grill - who provides the best directions I've ever used.",
      "rating": 4.0,
      "verified": true,
      "author": "TG",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Good product, well built, tolerances of bolts, very good",
      "text": "Indoor log rack, good, price on amazon was Half the cost of retail",
      "rating": 5.0,
      "verified": true,
      "author": "tonygreco",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Shoddy craftsmanship",
      "text": "My first one got lost in transit, Amazon kindly re-sent it free of charge. It arrived with poor instructions and is missing holes for the bolts. Several places the pre-drilled holes were messy and I had to bend the edges with a screw driver to be able to get a screw in. Not great. Still not fully assembled as I'm waiting on my hubby to drill the missing holes",
      "rating": 2.0,
      "verified": true,
      "author": "shenae copeland",
      "helpful_votes": 0,
      "publication_date": 20161118
    },
    {
      "title": "Great",
      "text": "Looks great and holds alot of wood! Exactly what I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "madie",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "seems to work as described, decent quality for price",
      "text": "im not sure the reason for all the negative reviews about the instructions....i looked at the paper 1 or 2 times and its pretty straight forward from there took 10 or 15mins. holds quite a bit of wood. i fit around 60 or so split pieces on it",
      "rating": 4.0,
      "verified": true,
      "author": "reviewer",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Oh yes, this one is perfect!",
      "text": "Oh my gosh, this thing is huge and beautiful and so STRONG! We just fill it up and it's actually an asset to our covered patio, it looks so nice! We have the big wood stack out at the shed, and then we bring in enough to fill it, and that way we stay dry while stocking the fire. PERFECT!",
      "rating": 5.0,
      "verified": true,
      "author": "Gramma Cheri",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "Built solid great value !",
      "text": "A well built firewood rack at the best price anywhere !",
      "rating": 5.0,
      "verified": true,
      "author": "John F.",
      "helpful_votes": 0,
      "publication_date": 20200806
    }
  ],
  "product_meta": {
    "title": "Panacea Tubular Steel Log Hoop 40in",
    "description": "Panacea Tubular Steel Log Hoop Stack your firewood in style with the Panacea Tubular Steel Log Hoop. This log hoop will store your firewood 3-inches off the ground to prevent it from sitting on a wet, muddy, or uneven surface. Quickly assemble the item by simply snapping the attached bottom brackets on to the frame. This loop is made from heavy gauge, 0.375-inch diameter steel to ensure durability and will fold flat for seasonal storage. The powder coated black finish not only makes it an attractive addition to your landscape but a long lasting one as well. Store your firewood off of the ground with this Log Hoop. Some assembly required Features: Easy to assemble Keeps wood dry and displayed Made from thick tubing Powder coated to withstand the elements Stores flat Item Specifications: Size: 20in 40in Dimensions: 23\"H x 15.5\"Deep with a 20\" diameter hoop 43\"H x 15.5\"Deep with a 40\" diameter hoop Material: Steel Color: Black",
    "rating": 4.4,
    "feature_bullets": [
      "UPC: 093432152096",
      "Weight: 10.700 lbs"
    ],
    "specifications": {
      "Product Dimensions": "42.13 x 14.13 x 0.67 inches",
      "Item Weight": "8.36 pounds",
      "ASIN": "B000HHLW30",
      "Item model number": "15209",
      "Customer Reviews": "4.4 out of 5 stars1,236 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#9,100 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "July 16, 2008",
      "Manufacturer": "BFG Supply Company"
    },
    "categories": [
      "Stove & Fireplace Accessories",
      "Home & Kitchen",
      "Log Carriers & Holders",
      "Electronics",
      "Parts & Accessories",
      "Heating, Cooling & Air Quality"
    ],
    "price": 38.82
  }
}