{
  "website_summaries": [
    {
      "verdict": "A practical women's wrist watch from Timex with a more luxurious appearance at an affordable price.",
      "pros": [
        "2-tone metal design is rust and weather-resistant to preserve the exterior look",
        "Easy to strap on and off throughout the day if necessary",
        "Large Arabic numbers are easy to read"
      ],
      "cons": [
        "The lack of proper waterproofing makes the watch susceptible to damage when submerged or in wet weather"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I now have a very pretty Timex that I can't wear",
      "text": "The watch itself is a 5 star, but you need to tell people that it's very large. I got an expansion band 'cause I figured it would fit. It fits lovely - at my elbow. I'm a size 12 woman, not tiny at all. Okay, so I figure it;s going to cost me more money to get links taken out, but no choice. I've now been to 3 jewelry stores & they won't do it, said they used to but the bands have changed making it difficult so they stopped doing it. I now have a very pretty Timex that I can't wear.",
      "rating": 3.0,
      "verified": true,
      "author": "Bonnie",
      "helpful_votes": 13,
      "publication_date": 20170125
    },
    {
      "title": "Nice Style, NOT WATERPROOF !",
      "text": "I was disappointed in this watch because it is not waterproof​ and it has stopped twice in the 3 months I have worn it. The description does say it is NOT waterproof. Please take note of this before you buy. My crystal is completely fogged and I have no warranty to return it.!! I have been a loyal Timex fan for 25 years and will continue to be. The style and size are great!! Also, no indiglo which I knew before purchasing. Great price!",
      "rating": 3.0,
      "verified": true,
      "author": "outoftheboxdavid",
      "helpful_votes": 6,
      "publication_date": 20180420
    },
    {
      "title": "Lovely Watch",
      "text": "Very stylish watch, but the band is quite large for my 6-1/4” wrist. Since it is not very stretchy, the watch tends to “spin” on my wrist. However, I am happy with the purchase. I did not appreciate that the watch was already running when I received it using up the battery life.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon L. Heyer",
      "helpful_votes": 6,
      "publication_date": 20180110
    },
    {
      "title": "Very Nice.",
      "text": "Came quick w/no problems. I love the look, I always go with multi colored jewelry so everything will always match, plus its fun for me. Fits nice (I have small wrists), love that I can move it up my arm easily so I can wash my hands w/o hurting the watch. It's comfortable. I don't have to wear it daily, so, I pull out the stem/knob, which stops the battery from running & when I go to use it, I just reset time. Keeps time very well. Once again, Amazon.com offered me the type of watch I've been hunting for, it was the only 1! Yeah!",
      "rating": 5.0,
      "verified": true,
      "author": "raymond c. kirschmann",
      "helpful_votes": 11,
      "publication_date": 20130420
    },
    {
      "title": "Perfect to wear with gold or silver jewelry",
      "text": "This is my 4th or 5th Timex two-tone wrist watch over many. many years. Always reliable and easy to find batteries for operation. My only negative comment would be that eventually the band stretches out and the links separate. This usually takes 4 -5 years. Be sure to measure your wrist to assure the 7.5 inch diameter won't fit too tightly.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Kerrin",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Bought for Elderly Mom who Loves It!",
      "text": "My elderly Mom has lost much of her finger dexterity and could no longer use a watch with a buckle or clasp. She also didn't like the look of most watches that came with a \"stretch\" band. This was the perfect gift for her. The watch and the band are attractive and with the removal of three links, fit her perfectly. This watch would not be great for a person with poor eyesight since the dial and hands have little visual contrast.",
      "rating": 5.0,
      "verified": true,
      "author": "Agent 19",
      "helpful_votes": 43,
      "publication_date": 20110620
    },
    {
      "title": "Pretty and serves the purpose — tells me what time it is.",
      "text": "This watch looks nice and is easy to read. I have a small wrist and the watch tends to slide around. I often have this problem with watches and am used to it. The watch face is usually facing down but I don't mind this because it looks like a bracelet. My husband who rarely notices what I'm wearing actually commented on how nice it looks.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "My favorite watch",
      "text": "This is my favorite watch. I’m actually on my third one of this style, and I’m so glad they continue to make it. I like the clean lines and the way the watch flows into the band. I do like an expandable band because I hate trying to put on a watch that I have to fiddle with with buckling a band.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Hammer",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "I am disappointed that the watch is too big for my wrist",
      "text": "I am disappointed that the watch is too big for my wrist. I have a normal small wrist & the watch can flip around causing the case to be on the underside of my wrist where it can get easily scratched & where I can not see the time. I do not see any way of removing links. This watch should be good for a person with a medium wrist. Also, I measured the watch face, and it is 18mm wide, not 9mm! I was hoping for a dainty watch for a small wrist size.",
      "rating": 3.0,
      "verified": true,
      "author": "Joyce",
      "helpful_votes": 7,
      "publication_date": 20140818
    },
    {
      "title": "Not like the old Timex quality that’s for sure!",
      "text": "Not even a year old and doesn’t keep time anymore....even with a new battery. I think the says of Times being a durable, dependable watch are over! It’s very hard to set the time because the stem is extremely tough to pull out! When you do set the time within a few weeks it’s running at least an hour behind! Timed has gotten cheap like everything else! Too bad!",
      "rating": 2.0,
      "verified": true,
      "author": "H. Ellis",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Stopped working after one week.",
      "text": "Less than a week, the watch stopped working. Upon opening the box, I noticed that the watch was \"on\". Therefore, I questioned the condition of the battery. Well... it lasted just a few days, so I returned it. I've owned this brand and similar style for years. Wished it worked; I like the style, weight, and visibility.",
      "rating": 1.0,
      "verified": true,
      "author": "Octothorp",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "I like it very much",
      "text": "This was a replacement for the first watch, which was too tight. This one I lucked out on as it fits perfectly. I like it very much. I'ts a perfect size, looks nice ( I love 2-tone metal jewelry), it's easy to read and set the time, I like that it has a second hand - and appreciate the price, of course. I also appreciated that it's a Timex.",
      "rating": 4.0,
      "verified": true,
      "author": "Peggy Lambert",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "quality watch, reasonable price",
      "text": "My wife likes the dial size for easy reading without being too large on her wrist and the band is very good looking",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Feminine-looking, versatile, comfortable watch",
      "text": "I wanted a two-tone gold-silver watch for traveling so I could take either gold or silver jewelry but only one watch. I also wanted an expansion band for convenience. This watch is feminine-looking but the numbers are large enough for me to read without glasses. My wrist measures 6\". I had one link removed (one piece silver, one gold) from the band. The local jeweler did it in three minutes while I waited and charged me nothing. Even if he had charged, I would have been happy with the watch. The band is still a bit loose but I can push it up my arm some. In all, I am very pleased with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy C.",
      "helpful_votes": 5,
      "publication_date": 20140708
    },
    {
      "title": "It pinches!",
      "text": "The band is really very tight. I have bought Timex watches for years and based on the other reviews I thought this would fit but it is not only tight but pinches. I thought I would unusual look of the band but as pretty as it is, it is not worth the pain. So it’s a hard fit and I would recommend NOT buying this watch.",
      "rating": 1.0,
      "verified": true,
      "author": "Kas",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Dependable, attractive watch.",
      "text": "You cannot go wrong with Timex! This watch is small/dainty, the band is stretchy/flexible but doesn't look like the typical twisty-band, the face is easy to read and looks great with most casual or business clothing. Timex keeps great time...I do minor watch repair professionally and they're hearty timepieces. Would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Attractive watch though not readable in all lights",
      "text": "This is a very attractive watch and the size of the watch face is great. The two-toned band is attractive and the numbers are easy for me to see without my glasses. However, the gold-on-white of the arms makes it hard for me to see the arms in office lighting - I have to move my wrist back and forth to see them. This might (again) be because I'm near sighted, but that's a deal-breaker for me. The band is perfect for my medium-to-small wrist; the first watch in years that I wouldn't have to get the jeweler to remove links. However, if you have a large or athletic wrist, this will possibly be too tight.",
      "rating": 4.0,
      "verified": true,
      "author": "Cambridge JD",
      "helpful_votes": 0,
      "publication_date": 20140608
    },
    {
      "title": "Box delapidated",
      "text": "Watch appears not damaged but box was torn and crushed. I believe box had been carelessly opened and returned to seller. First time experienced an order whose container appeared to have been “run over by a truck”!",
      "rating": 5.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Excellent deal for the $$$!",
      "text": "I wash my hands frequently, and need a watch I can push up out of the way. I also do a lot of strenuous work, so I destroy watches! I needed a watch that I could \"ruin\" and not regret it. This watch fits the bill for everyday use--it's attractive, durable and stands up to rough use. For the price--you can't beat it!",
      "rating": 5.0,
      "verified": true,
      "author": "MizzMary",
      "helpful_votes": 21,
      "publication_date": 20121205
    },
    {
      "title": "Here today, gone tomorrow.",
      "text": "Bought this watch this summer about 3 months ago. worked fine, then it just up and died. Took it to Jewelry store, they couldnt fix it. Battery is permanent so it couldnt be replaced. Dont know why it stopped, nothing happened to it. But its dead as a doornail, what a waste of my money. Now Amazon says can't return after 30 days. But a new watch should last longer than a few months.",
      "rating": 1.0,
      "verified": true,
      "author": "Roz",
      "helpful_votes": 0,
      "publication_date": 20161116
    },
    {
      "title": "Timex T26301",
      "text": "I've long been a fan of Timex watches and this one does not disappoint. Needing a new everyday casual watch, I was delighted to find this on Amazon. Since I switch between gold and silver neckchains and earrings, I wanted a two-tone watch that goes with everything. This watch is simple yet elegant looking - if I forgot to change to one of my dressier watches, I doubt it would matter. It is very comfortable - my wrist is on the smaller size so I'm not sure if someone with a larger wrist would find it as well fitting. I typically have to remove a link or two but not with this one. I highly recommend this watch.",
      "rating": 5.0,
      "verified": true,
      "author": "wellwater",
      "helpful_votes": 56,
      "publication_date": 20111230
    },
    {
      "title": "That it is a nice watch.",
      "text": "I like the watch clear numbers also love the two tone colors. The band is a little big. But a nice watch. One thing I did notice is the button to set time is very easy to get caught and will pull out to stop time.",
      "rating": 5.0,
      "verified": true,
      "author": "deborah henson",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Love it!",
      "text": "This is a nice watch. I love that it is 2 toned and will match anything. It can be worn with a dressy or casual outfit. I have had this watch for almost a year now and wear it almost daily. Still works great and no tarnishing of the band. Still looks like new. Fits my smaller wrist comfortably. I would definitely buy this watch again.",
      "rating": 5.0,
      "verified": true,
      "author": "J. M. Matusak",
      "helpful_votes": 0,
      "publication_date": 20160404
    },
    {
      "title": "Didn't work.  Looked great, though!",
      "text": "Loved the look. It did not keep proper time straight out of the box. I should add the Timex box it was delivered in was mangled. Don't know if that happened while in shipping... or if the box was already mangled.",
      "rating": 1.0,
      "verified": true,
      "author": "Nancy Johnson",
      "helpful_votes": 0,
      "publication_date": 20180202
    },
    {
      "title": "My mom loved this watched so much when i gave it to ...",
      "text": "My mom loved this watched so much when i gave it to her as a gift. Its a beautiful and good quality watched and i will be getting one for myself as well as i also loved it when i saw it.",
      "rating": 5.0,
      "verified": true,
      "author": "lizanie",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "Watch Was Ticking When Package Opened",
      "text": "First of all, I like the watch. It's attractive in 2-tone which I prefer, comfortable on my wrist and easy to read. However, when I opened the package the watch was already ticking. I have purchased several Timex watches from Amazon and my primary criticism is that the battery wears out quickly. Since this one was already at work I'm concerned that I'll soon need another or have to get a new battery. It's often more cost-effective to purchase a new watch than pay for a new battery which in my experience dies within a few months anyway.",
      "rating": 4.0,
      "verified": true,
      "author": "emd5542",
      "helpful_votes": 0,
      "publication_date": 20130714
    },
    {
      "title": "Love it with extra links!!",
      "text": "I love this watch!! It was a little tight on my wrist so I called Timex (1-800-448-4639) to request extra links for this T26301. No charge for the links but $4 for mailing. The face is a little harder to read than my usual \"Easy To Read\" Timex watches but I still love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Betty A. Massengill",
      "helpful_votes": 2,
      "publication_date": 20151202
    },
    {
      "title": "To large for a small wrist.",
      "text": "Actually it was very big and I have to take four links out It does not fit a very small wrist.",
      "rating": 4.0,
      "verified": true,
      "author": "perky",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "This Watch is great!",
      "text": "This is such a lovely watch and very comfortable. I prefer it to others because it has no clasp to catch on my clothing! It is absolutely great for me and I highly recommend it to women who are looking for a watch like this one. Thank you!",
      "rating": 1.0,
      "verified": true,
      "author": "Jan",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Fit is looser than expected",
      "text": "I love the watch! It's very attractive. However, it's quite large. I am 5' 8\" and 170 pounds so I'm not petite by any measure. The watch just dangles on my wrist. I have to wear it halfway up my forearm. Also, the links are not removeable as far as I can tell.",
      "rating": 3.0,
      "verified": true,
      "author": "Toes",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Band is too big.",
      "text": "I like the watch, very stylish BUT the band is too big and slides down my arm. There is no way to make it smaller, sad tosay.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "loved this watch",
      "text": "Very pretty and great quality. Sadly I only owned this watch for 2 days and it disappeared when I went through security at Mpls airport!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin Holloway",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Looks great. Easy to read",
      "text": "Looks great. Easy to read. Fits okay. If I lose weight, I may need to have a link or two removed. Does just what I need it to do. I've had this type of Timex before and really liked it. Wore it until it died and even new battery couldn't get it going again. Perfect nice-looking everyday watch.",
      "rating": 5.0,
      "verified": true,
      "author": "L. S. Madl",
      "helpful_votes": 0,
      "publication_date": 20160614
    },
    {
      "title": "It's difficult to wind and doesn't keep very good time. I'll look for another watch and this ...",
      "text": "If the band is 'women's standard', it must be for pixie women. It came with the shortest band I've ever seen. Had to change the band to wear the watch. Also, didn't realize it was a wind up watch. It's difficult to wind and doesn't keep very good time. I'll look for another watch and this time will make sure that it is battery operated.",
      "rating": 2.0,
      "verified": true,
      "author": "cnec",
      "helpful_votes": 2,
      "publication_date": 20151023
    },
    {
      "title": "Sturdy for every day wear and pretty for evening wear",
      "text": "Fits well without being too tight. Easy to read dial. Beautiful gold and silver stretch band",
      "rating": 5.0,
      "verified": true,
      "author": "WaWoman",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "nice",
      "text": "Was very hard to shorten for small arms! But very attractive!",
      "rating": 5.0,
      "verified": true,
      "author": "Di",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "and looks great. Very comfortable",
      "text": "fits my wrist well, a little loose but I have small wrists, and looks great. Very comfortable!",
      "rating": 5.0,
      "verified": true,
      "author": "Arnold A. Huyghebaert",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "Dignified yet casual",
      "text": "This watch is dignified looking, not quite elegant, and yet casual for every day wear. The oval face looks lady-like and dressier than what I would expect from the traditional Timex. I like the expansion band for easy on and off, and is so much \"faster\". Overall a very attractive, clean-casual yet dignified watch that I'm glad I found after careful searching.",
      "rating": 5.0,
      "verified": true,
      "author": "Moretime",
      "helpful_votes": 16,
      "publication_date": 20101129
    },
    {
      "title": "Great looking watch.",
      "text": "I never used to have any luck with Timex watches. It has been decades since I had one. But maybe since I don't have to wind it, it will last. Love the look of it and the pretty expansion band.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra Diggs",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Band big",
      "text": "Very pretty watch but band is on the bigger side and can’t figure out if there is a way to make it smaller.",
      "rating": 3.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Five Stars",
      "text": "I love the elastic band, and they are not easy to come by. Attractive. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Eliza",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Great looks",
      "text": "The watchband is stretching but a little tight for my wrist and I don't have a huge wrist. A few more links wouold mke it more comfortable. I wear it for dress up time.",
      "rating": 4.0,
      "verified": true,
      "author": "Bunny",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "classic timex",
      "text": "nice looking watch with expanding band. looks more like a bracelet than a watch. very pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne T",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "A Watch both Attractive and Practical",
      "text": "the watch I slide on everyday. I particularly like the watch band which combines goldtone and silvertone and is still plain enough for everyday sportswear. Donot worry about it as I wash my hands--a nice touch.",
      "rating": 5.0,
      "verified": true,
      "author": "eyecon :/ vvv vv7",
      "helpful_votes": 0,
      "publication_date": 20160504
    },
    {
      "title": "My Mom Loves It!",
      "text": "She moans, complains, then looks at her new watch and Loves It!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Timberman",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Band is very small",
      "text": "I have purchased several Timex watches in the past and have usually been very happy with them. Not so much with this one. The band is small and pinches my wrist. I have a larger wrist (7.5 inches), but most Timex watch bands tend to be too big, needing to be adjusted. I may end up returning this watch or giving it to my niece who has tiny wrists. I wish there was a better measurement of the band on Amazon's site, instead of just \"Women's sizing\".",
      "rating": 3.0,
      "verified": true,
      "author": "Laura Moster",
      "helpful_votes": 0,
      "publication_date": 20140528
    },
    {
      "title": "A reliable timepiece.",
      "text": "A good looking easy to read timepiece with a very comfortable expansion band, keeps very accurate time.",
      "rating": 5.0,
      "verified": true,
      "author": "Veronica Birk",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Attractive Watch",
      "text": "This is an attractive watch that can be worn with both casual and dressy outfits. I especially like the smaller-sized face and band. The band fits comfortably on my wrist. Great deal for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "TX Peach",
      "helpful_votes": 0,
      "publication_date": 20170612
    },
    {
      "title": "Band is complicated.",
      "text": "The watch is attractive and I love it, but the band is too large. The local jeweler would charge nearly as much as the cost of the watch to remove the links. So we have returned the watch. Sorry.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "Lovely, Feminine Watch with Very Attractive Price Tag",
      "text": "This is a very attractive, feminine watch, which looks a lot more expensive than it is. I ordered it for my mother, all of whose watches had died, and she loves it! Everyone who saw it oohed and ahhed over it. I did have a hard time finding someone to adjust the band, but eventually found a person with the needed expertise in a mall kiosk where they sell watches and bands.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth ATop Contributor: Baking",
      "helpful_votes": 0,
      "publication_date": 20150325
    },
    {
      "title": "Watch running when I got it",
      "text": "The watch is pretty and runs a little small wrist size which was good for me but I was disappointed that the watch was running when I got it! So I’m sure my battery will die soon",
      "rating": 3.0,
      "verified": true,
      "author": "James Kelly",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "High 5 star",
      "text": "I just can't explain how much I love this watch! This watch has gorgeous design with 2 tones..the face of the watch is perfect..can see the time very well..also I have a small frame wrist..fits great! But had to take out only one link.Thank you Amazon for having this watch online! I recommend this watch for those who have small wrists. I'm happy with it!",
      "rating": 5.0,
      "verified": true,
      "author": "hound 2",
      "helpful_votes": 2,
      "publication_date": 20140410
    },
    {
      "title": "I love this watch",
      "text": "I have really enjoyed this watch. It's attractive, has an easy to read face and great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Dahlberg",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "Better than expected",
      "text": "Ordered two Timex watches on the same day.... tired of paying more for fancier watches that were totally unreliable. When I wear a watch I NEED to know the time and I NEED it to be accurate. So this Timex was supposed to be more of a dress watch. It ended up being better looking than I expected...AND it is a TIMEX so \"it keeps on ticking!\" Great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Bhlee",
      "helpful_votes": 0,
      "publication_date": 20130815
    },
    {
      "title": "It'll make a good first \"big girl\" watch",
      "text": "purchased as a gift for my 11 year old niece. It'll make a good first \"big girl\" watch. It is easy to use and right for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "Style and elegance in one package.",
      "text": "This was bought as a replacement for the same style watch that was broken. I love the elegance. I'm so happy to have the watch that I liked the most back.",
      "rating": 5.0,
      "verified": true,
      "author": "Milkbones",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Classy looking watch!",
      "text": "Very classy looking. I love an expansion band, but this one does not look like a cheap expansion band. No one will know by looking at it that it is an expansion band. It is very small, though, so if you don't have small wrists like me, it won't fit you. No extra links came with the order.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Rubright",
      "helpful_votes": 0,
      "publication_date": 20150911
    },
    {
      "title": "Beautiful watch",
      "text": "The watch is beautiful and dressy however it is not tight around my wrist",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Timex watch for women",
      "text": "Timex watch for women elevated classics is wonderful. It keeps perfect time and I love the elastic wrist band. I would order this type of watch again. The shipping and packaging were great as well.",
      "rating": 5.0,
      "verified": true,
      "author": "sapphire77",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "Good watch for everyday",
      "text": "Timex watches are dependable. This watch has an expansion bracelet, which is easier for me to wear every day. I wish the numbers on the dial were darker. It is hard to read in the daylight. Otherwise a good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "good for someone with small wrist elegant looking",
      "text": "I have a very small wrist and it fits good. Exactly what I was looking for and expecting and price was even better.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 2,
      "publication_date": 20190129
    },
    {
      "title": "Although I like the appearance and style of this watch",
      "text": "Although I like the appearance and style of this watch, it slides around my wrist; a bit larger than expansion band watches I have had in the past.",
      "rating": 3.0,
      "verified": true,
      "author": "Marilyn C.",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Looks great",
      "text": "I like the easy to read face, and band fits pretty good. Have one very similar to this from Walmart for less money, so yes a bit disappointed. Some things are better seen in person.",
      "rating": 3.0,
      "verified": true,
      "author": "Patricia Popelka",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "classy watch at a bargain price.",
      "text": "bought this as a gift for my mom who is in her late 70s. She said she gets compliments on it regularly so I guess it's a nice watch for someone older (and classy).",
      "rating": 5.0,
      "verified": true,
      "author": "Travelling Nomad",
      "helpful_votes": 0,
      "publication_date": 20161102
    },
    {
      "title": "Expansion Band did not expand....",
      "text": "The watch was returned as the band was too tight and it did not come with any additional parts to expand it. The face was also hard to read without putting on my reading glasses. It wasn't a bad looking watch for the price but do not buy unless your wrist is under 7 inches.",
      "rating": 2.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20140627
    },
    {
      "title": "Love the watch",
      "text": "Love the watch. I like the two tone and I can wear with almost anything. The only issue I have is the band is a little too tight and would have preferred a slightly longer band. I can wear for short periods of time and then have to take off.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer W.",
      "helpful_votes": 0,
      "publication_date": 20150624
    },
    {
      "title": "Beautiful watch",
      "text": "Love everything. So pretty. Comfortable to wear. Easy to read.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Great watch",
      "text": "This is a great gift for any woman wanting a smaller watch with an Easy-to-Read dial. It is as beautiful as it is functional.",
      "rating": 5.0,
      "verified": true,
      "author": "Christy Dowling",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "I'm trying to like thiswatch",
      "text": "I'm trying to like this watch, but it's really tight! Perfect for a petite size 4, which I am not! I think it's pretty so I haven't sent it back yet, but I haven't worn it either. Trying to decide!",
      "rating": 3.0,
      "verified": true,
      "author": "SJWhit",
      "helpful_votes": 0,
      "publication_date": 20150902
    },
    {
      "title": "Nice watch",
      "text": "I have had this watch for about 2weeks now and so far it seems to be working fine. I'm very happy with it",
      "rating": 5.0,
      "verified": true,
      "author": "susie",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Quit after 6 weeks",
      "text": "I purchased this watch on March 20, 2017. In less than 6 weeks it was no longer working, in spite of me paying to have the battery changed. It's a beautiful watch, and I'm hoping to exchange it for one that works better. But I'm deeply disappointed that such a highly rated watch worked for fewer than 6 weeks.",
      "rating": 2.0,
      "verified": true,
      "author": "Beth M.",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "She loved it!",
      "text": "My wofe loved this bracet watch, especially the two-toned band...........only caveat for potential buyers. My wife has very thin wrist (about 5 1/2\" in circumference) but she still had to have a jeweler remove two links to fit properly. She feels was worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Wilbur0776M",
      "helpful_votes": 2,
      "publication_date": 20131106
    },
    {
      "title": "Great watch",
      "text": "fits my wrist perfectly and is very comfortable. I've always liked the Timex watches!",
      "rating": 5.0,
      "verified": true,
      "author": "DL",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "I'm happy with my purchase",
      "text": "I'm happy with my purchase. Timex watches have proven to be very reliable and available at a very reasonable price. I have a 6.5\" wrist and the expandable band fits great. The watch face is big enough to read easily but with the oval shape is still just feminine enough for me. I also like the two-tone silver and gold band so it goes with the other jewelry I wear. Overall a great choice!",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry DeSanto",
      "helpful_votes": 0,
      "publication_date": 20141116
    },
    {
      "title": "Nice Looking",
      "text": "I really liked the look of the watch, but when I went to wear it, the safety plastic thing was missing from the stem. When I tried to set the time, the stem came out. I sent it back. Really a shame, because I really like the look of the watch.",
      "rating": 1.0,
      "verified": true,
      "author": "Uffdaostr",
      "helpful_votes": 0,
      "publication_date": 20140525
    },
    {
      "title": "... reading the reviews stating that this watch was a perfect fit for people with small wrists",
      "text": "I bought this watch after reading the reviews stating that this watch was a perfect fit for people with small wrists. Well it is too big for me! I love the watch, so I will remove two of the links to make it fit. A bit disappointing!",
      "rating": 4.0,
      "verified": true,
      "author": "Lyndal",
      "helpful_votes": 0,
      "publication_date": 20150302
    },
    {
      "title": "Five Stars",
      "text": "Elegant & Classy, I know this costs $20 more at Macys",
      "rating": 5.0,
      "verified": true,
      "author": "Ezio",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "The watch was a dud did not work, thought ...",
      "text": "The watch was a dud did not work, thought the battery was dead had a new one put in and no go.",
      "rating": 1.0,
      "verified": true,
      "author": "Todd Franz",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "sold as woman's watch would fit a childs wrist",
      "text": "Good looking watch and I'm sure it would keep time however the band is way too small for an adult woman's wrist as an everyday watch. Would be excellent for a young small girl",
      "rating": 1.0,
      "verified": true,
      "author": "Mr. Ed",
      "helpful_votes": 2,
      "publication_date": 20130828
    },
    {
      "title": "Bad batteries in both watches",
      "text": "I ordered this for my girlfriend for Christmas. It came but the time wasn't correct. So I went out and bought a battery. It only worked for a little bit. Thankfully, Amazon has a great return policy. So I'm only out the battery and the box it cost to send it back. They sent another one right away. I also had to replace that battery and so far it's working just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Kathy Lynn",
      "helpful_votes": 0,
      "publication_date": 20150209
    },
    {
      "title": "This is the second one I have purchased and highly recommend this Timex watch",
      "text": "Classy-looking and fits perfectly! This is the second one I have purchased and highly recommend this Timex watch.",
      "rating": 5.0,
      "verified": true,
      "author": "Nora Stone",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "I thought the watch was quite good-looking. However, ...",
      "text": "I thought the watch was quite good-looking. However, I have large hands and the expansion in the band was insufficient to even get the watch over my hand. Had to be returned.",
      "rating": 3.0,
      "verified": true,
      "author": "Colorado Hi",
      "helpful_votes": 0,
      "publication_date": 20170924
    },
    {
      "title": "... really likes the style and the face makes it easy to tell the time",
      "text": "My wife really likes the style and the face makes it easy to tell the time. I think it looks nice with her formal wear or her casual wear. Very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "The Coach",
      "helpful_votes": 0,
      "publication_date": 20160525
    },
    {
      "title": "Attractive, good value",
      "text": "Wanted a replacement for an identical one I had owned for several years. So happy to find the exact same watch. Love the two-tone look and the band is perfect size for my wrist.",
      "rating": 4.0,
      "verified": true,
      "author": "Marilyn Seerup",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "I am very pleased with this",
      "text": "I am very pleased with this watch. It can be worn for every day use and also for dressier occasions. I have a narrow wrist and did not have to remove any links to make it smaller. I had checked store sales elsewhere and just about bought one but with higher price and having to pay postage and handling I would have ended up paying approximately $30 more than on amazon. I would definitely recommend this watch.",
      "rating": 5.0,
      "verified": true,
      "author": "Just Me - Alice",
      "helpful_votes": 0,
      "publication_date": 20150215
    },
    {
      "title": "This is a great watch. Had one very similar to this Timex ...",
      "text": "This is a great watch. Had one very similar to this Timex several years ago and I was glad to find this one. Fits perfectly and keeps perfect time.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Major",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "I looked everywhere for one just like it with no luck",
      "text": "I had an identical watch in the past! IWhen it stopped working,I looked everywhere for one just like it with no luck! I should have known I'd find it again on wonderful Amazon! Thank You! Sharlene Buchanan",
      "rating": 5.0,
      "verified": true,
      "author": "Granny",
      "helpful_votes": 0,
      "publication_date": 20150210
    },
    {
      "title": "Love it.",
      "text": "Forgot how helpful wearing a watch was, as opposed to using my phone to tell the time. This has an old style face; no digital directions to have to fool with. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "jane van",
      "helpful_votes": 0,
      "publication_date": 20150801
    },
    {
      "title": "Can't say anything bad about the watch",
      "text": "Can't say anything bad about the watch. I liked it initialy for the gold and silver color making it easy to wear with any of my jewelry. The band fit exactly. I am 5'6\" and weigh 170 pounds. I recently lost 50 lbs and this band would have been to tight at my former weight of 220 lbs. That was then and this is now and I love the watch.",
      "rating": 5.0,
      "verified": true,
      "author": "Joy Moore",
      "helpful_votes": 0,
      "publication_date": 20140727
    },
    {
      "title": "Nice watch for the price.",
      "text": "Very pretty watch, I have skinny wrists and it's almost a perfect fit. Glad I ordered it.",
      "rating": 5.0,
      "verified": true,
      "author": "roberta j noah",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "I love this watch",
      "text": "I love this watch. It is very stylish without being over the top. I have very small wrists and this watch fits very nicely. The only drawback is that this watch is a little bit bigger in size than I was expecting. I thought the face would be a little bit smaller than what it turned out to be, but I cannot complain. This is a beautiful watch that will fit easily into my daily wardrobe. It can be dressed up or down and it will still look nice! Wonderful purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaclyn",
      "helpful_votes": 0,
      "publication_date": 20140811
    },
    {
      "title": "Hard to please.",
      "text": "I purchased this Watch for my 88 year old mom who lives in an ALF. She is very particular and doesn't like anything. Needless to say, I was very hesitant about buying this for her. I hit a home run! She loves it! It is the perfect style, fit, size and easy to read. What a tremendous relief. I would definitely recommend this watch to any one, especially those with a hard to please mother.",
      "rating": 5.0,
      "verified": true,
      "author": "Rona B.",
      "helpful_votes": 0,
      "publication_date": 20141031
    },
    {
      "title": "Nice looking watch",
      "text": "So far Really like the watch. The wristband fits and is comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Strole",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "Don't trust what you are actually looking up as true.",
      "text": "Liked the wrist band. Very disappointed as I looked up Timex luminous face and this watch showed up but upon receiving it there is no luminous face.",
      "rating": 2.0,
      "verified": true,
      "author": "Patricia Hultman",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Five Stars",
      "text": "Was easier to replace watch than find a band for the old one",
      "rating": 5.0,
      "verified": true,
      "author": "Mark A. Fisher",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "Easy to put on!!",
      "text": "I like this watch! It looks classy and is accurate. Best of all, it has a stretchable wristband and I don't have to mess with any clasps. It fits my wrist perfectly and I didn't have to add or remove a section of the band.",
      "rating": 4.0,
      "verified": true,
      "author": "Good readers' mother",
      "helpful_votes": 0,
      "publication_date": 20130805
    },
    {
      "title": "Nice looking",
      "text": "I love it! It didn’t need any adjustments and is nice looking",
      "rating": 5.0,
      "verified": true,
      "author": "Idaho",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Great purchase.",
      "text": "Just what I wanted. Had to have some links taken out, now it fits perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat Asquini",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Five Stars",
      "text": "my mother will love this watch it is very pretty",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170610
    },
    {
      "title": "Very stylish",
      "text": "I have a very small wrist, 5\". I took it to our local jeweler, two links where removed and it now fits perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191213
    }
  ],
  "product_meta": {
    "title": "Timex Women's T26301 Kendall Circle Two-Tone Stainless Steel Expansion Band Watch",
    "description": "Our Main Street Collection is designed with simple elegance in mind and crafted with the quality you expect from Timex.\n\nThe sophisticated use of color patterns in the Timex Women's Classic Two-Tone Expansion Band Watch will add a refreshing element to your business and casual wardrobes. The timepiece is constructed with a stainless steel case, a gold-tone stationary stainless steel bezel, and a comfortable two-tone-stainless-steel expansion bracelet. A durable mineral window shields the silver-tone dial face, which features gold-tone hour indexes and Arabic numerals at three, six, nine, and 12 o'clock. The face also includes gold-tone watch hands and complementary minute indexes. This timepiece is powered by analog-quartz movement.\n\n\n\nCasioWith the launch of its first watch in November 1974, Casio entered the wristwatch market at a time when the watch industry had just discovered digital technology. As a company with cutting-edge electronic technology developed for pocket calculators, Casio entered this field confident that it could develop timepieces that would lead the market.\n\nToday, Casio is focusing its efforts on solar-powered radio-controlled watches: the built-in solar battery eliminates the nuisance of replacing batteries, atomic timekeeping means the users never have to reset the time. Recently, Casio launched a series of Bluetooth watches that sync to the users cell phone to automatically update the time. Casio is always moving time forward.\n\n\n\nSee more \n\n\nPRODUCT DETAILS\n * Is Discontinued By Manufacturer :No\n * Product Dimensions :3.5 x 3 x 2.6 inches; 0.96 Ounces\n * Item model number :T26301\n * Department :Women\n * Batteries :1 Lithium ion batteries required. (included)\n * Date First Available :May 2, 2004\n * Manufacturer :Timex\n * ASIN :B0007GHCT4\n * \n * Domestic Shipping:Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.\n * International Shipping:This item can be shipped to select countries outside of the U.S. Learn More\n\n * .zg_hrsr_item {list-style : none};\n * Amazon Best Sellers Rank: #142,418 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry)  *  #490 inWomen's Wrist Watches \n   \n   \n\n * Customer Reviews:4.3 out of 5 stars435 ratings Our Main Street Collection is designed with simple elegance in mind and crafted with the quality you expect from Timex.\n\nThe sophisticated use of color patterns in the Timex Women's Classic Two-Tone Expansion Band Watch will add a refreshing element to your business and casual wardrobes. The timepiece is constructed with a stainless steel case, a gold-tone stationary stainless steel bezel, and a comfortable two-tone-stainless-steel expansion bracelet. A durable mineral window shields the silver-tone dial face, which features gold-tone hour indexes and Arabic numerals at three, six, nine, and 12 o'clock. The face also includes gold-tone watch hands and complementary minute indexes. This timepiece is powered by analog-quartz movement.\n\n\n\nCasioWith the launch of its first watch in November 1974, Casio entered the wristwatch market at a time when the watch industry had just discovered digital technology. As a company with cutting-edge electronic technology developed for pocket calculators, Casio entered this field confident that it could develop timepieces that would lead the market.\n\nToday, Casio is focusing its efforts on solar-powered radio-controlled watches: the built-in solar battery eliminates the nuisance of replacing batteries, atomic timekeeping means the users never have to reset the time. Recently, Casio launched a series of Bluetooth watches that sync to the users cell phone to automatically update the time. Casio is always moving time forward.\n\n\n\nSee more",
    "rating": 4.3,
    "feature_bullets": [
      "Two-tone 9mm stainless steel expansion band fits up to 7.5-inch wrist circumference",
      "White dial with partial Arabic numerals",
      "Oval gold-tone 22mm brass case with mineral glass crystal",
      "Quartz movement with analog display",
      "Not Water Resistant"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3.5 x 3 x 2.6 inches; 0.96 Ounces",
      "Item model number": "T26301",
      "Department": "Women",
      "Batteries": "1 Lithium ion batteries required. (included)",
      "Date First Available": "May 2, 2004",
      "Manufacturer": "Timex",
      "ASIN": "B0007GHCT4",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S."
    },
    "categories": [
      "Women",
      "Watches",
      "Wrist Watches",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 37.05
  }
}