{
  "website_summaries": [
    {
      "verdict": "Small size, excellent image quality, and a solid, though not extensive, feature set make the SD1000 a great choice for a compact camera.",
      "pros": [
        "Excellent image quality",
        "solid build quality",
        "speedy performance",
        "optical viewfinder",
        "face detection"
      ],
      "cons": [
        "No manual exposure controls"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 7.0,
        "Performance": 8.0,
        "Image quality": 8.0
      },
      "publication_date": 20070313,
      "rating": 7.8,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Pretty good vintage late 00's digital camera!",
      "text": "I'm glad to find this kind camera which I did look for like a vivid colors. I got it in a good cost to brought one. I liked Canon camera because I had a DSLR one for near five years. Liked to have a simple pocket camera like this model camera. :) Got impression on this vintage camera. :) Good camera! I did order another model in different color which I got silver one because another black model got died on me a few days ago. Glad to have it and did test and worked so well!",
      "rating": 5.0,
      "verified": true,
      "author": "Jjdeeredude",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Great point and shoot, but now hopelessly outdated",
      "text": "Pretty redundant to leave a review for this type of camera now – it's wildly outdated and a common smartphone would offer a superior experience. A great product for its time, but that time has now passed.",
      "rating": 4.0,
      "verified": true,
      "author": "Keith Mander",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Nothing small about this Elph!!",
      "text": "I purchased one of these babies and absolutely fell in love. Small!! Versatile!! Powerful!! Crystal Clear photo's in all lighting conditions. This is simplicity perfected. Point. Shoot. Done. Canon has found a way to fit a larger than life photographic super hero into this little case... FANTASTIC!!! I dropped mine from my Harley at 70 miles per hour and shattered it into a million pieces... NO it is NOT shatterproof, doggone it... But, I knew that. Needing a replacement, I immediately bought the identical camera! No question of shopping for a different one. This is IT! And... I promise to actually use the handy dandy wrist strap this time!!! (Oops!) Thanks, Kevin",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin P.",
      "helpful_votes": 0,
      "publication_date": 20080428
    },
    {
      "title": "You won't believe the movies",
      "text": "This is a nice little camera. PROS: It's great to have a camera you can carry in your pocket. The pictures are fairly sharp. I am amazed at the excellent quality of the movies. They are smooth, sharp and the colors are very true to life. I did not expect to use the camera for movies. The quality, however, is so good that I keep taking movies. CONS: Ease of use is only fair since many of the menu functions are too deeply buried. If you enable zoom for movies, you get no warning when it switches to digital zoom. The quality of the digital zoom is very bad. There is no aperture priority.",
      "rating": 4.0,
      "verified": true,
      "author": "Kenpalmcoast",
      "helpful_votes": 5,
      "publication_date": 20070517
    },
    {
      "title": "Easy, good quality little pocket camera",
      "text": "This is a great little camera to keep in your purse or car to have when you need it. I guess now with everyone having camera phones most may not need it, but for Luddites such as myself, this fits the bill nicely. Good quality photos, quick shutter, and battery drain is very slow. I have a huge Nikon dSLR, but this is so handy to keep on me all the time. Fits nicely in a pocket. The flash is adjustable and the macro feature is nice for such a small, inexpensive camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Mindy Keys",
      "helpful_votes": 0,
      "publication_date": 20140531
    },
    {
      "title": "I love my Camera",
      "text": "I love my Camera. I actually bought this one because I owned the same one before and i lost it in Spain. Simple enough to use, small, great image quality. Has a view finder in addition to the viewing screen. This camera was recommended by a photography professor of my daughter when she was in school. . Oh yes and the price was right. I would get the same one again if I had to but Canon doesn't make it anymore, not that model.",
      "rating": 5.0,
      "verified": true,
      "author": "Caval3",
      "helpful_votes": 0,
      "publication_date": 20150205
    },
    {
      "title": "Great Camera",
      "text": "I love this camera. It is so light and small that I carry it everywhere so I'm ready for any picture. The picture quality of very good - we took pictures on our vacation inside and outside. The display screen is large (for such a tiny camera) and it has view finder for the extremely sunny days (and for the us \"old folk\" who are used to peering through a view finder. The buttons are large enough for big fingers and the basic functions were very easy to learn. I recommended this camera to my family and friends. Just be sure to keep the wrist strap on (as recommended) because it is tiny and could slip out of your grasp.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20070513
    },
    {
      "title": "Worth every penny",
      "text": "This is a wonderful little camera. Every picture comes out beautifully. And I can't stress this enough...IT PERFORMS GREAT IN LOW LIGHT! That's almost impossible to find in a point-and-shoot camera. I have only 2 complaints: it takes a while to get through all the menus to get the settings you want (but that really can't be avoided, since it's so small); and the \"fireworks\" setting is bad (the pics come out blurry). I did a lot of research before buying this camera, and all the great reviews it got were accurate. It's a great product, and I'd recommend it to anyone. Canon has found a customer for life!",
      "rating": 5.0,
      "verified": true,
      "author": "Em",
      "helpful_votes": 2,
      "publication_date": 20070612
    },
    {
      "title": "Good Camera",
      "text": "I've now used this camera for over three years. It has served me well. Last year I went on a trip with the camera and took over 600 photos. I barely thought about charging the battery it lasted so long. I wish the model had IS, but decided that a lighter thinner model was more to my needs. I'm now looking at new Canon digital Elphs, and came back to this page to see how people rated my current camera. It's amazing the varied reactions. People say the new models aren't as good as the old ones...so maybe I shouldn't go to a new one.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Bob",
      "helpful_votes": 0,
      "publication_date": 20101126
    },
    {
      "title": "An all-time favorite",
      "text": "Wonderful camera. Out of production now, but you can look for a used model. This is the camera that made me a Canon fan. Easy intuitive menus, plenty of pixels, great features, very good zoom range and excellent videos for YouTube etc. The camera finally stopped working after my wife kept operating the power button while the camera was in a tight bag and could not extend the lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Naz",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "A Great Camera",
      "text": "I love my Canon Power Shot SD1000. The resolution is excellent. Though, I didn't care about using the movie mode, I am so impressed with the sound and smoothness that I expect that I will use this feature. This is an added plus. I bought this camera because I wanted a camera that was small and operated with ease and which had a view finder. It is everything I wanted and more. I zoomed in on a pileated woodpecker from inside my house today. The zoom capacity is another big plus. Buy this camera if you want a good camera for this price. You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "A. J. Reed",
      "helpful_votes": 0,
      "publication_date": 20080323
    },
    {
      "title": "Lens Retraction Problem",
      "text": "Its been a fine camera for the first 18 months I've had it, but I'd started to get the odd barrel error, and then on a trip to Muir Woods its stuck in the open position completely. It appears to be a common complaint about Canon cameras, but who knows. I am just annoyed it wont let me upload my photos in this broken mode, and there is no way to reset it. So I guess I'm stuck with a 1-200 dollar repair. I think I'll get a Nikon next time. I probably should have the first time. If the iPhone would improve its awful camera, I'd be using that by itself.",
      "rating": 1.0,
      "verified": true,
      "author": "Gruntette",
      "helpful_votes": 0,
      "publication_date": 20090518
    },
    {
      "title": "I love this camera",
      "text": "I love this camera, it is the same model as my first camera. There is a mark in all of the pictures and I thought at first it was just screen burn on the camera. After uploading the pictures however they all have the mark and after close inspection I found this is because the lense if scratched. The battery lasts a few hours if turned off between use, which is the main reason I bought this one because the battery on my old one stopped charging.",
      "rating": 3.0,
      "verified": true,
      "author": "Paula R",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Reliable, good picture quality",
      "text": "This camera has been a reliable workhorse for more than two years. Great pictures, movie function is of decent quality. Still works after a few careless drops. Plenty of photo options, lets you turn the flash off manually. Easy to use menu. 3.5\" wide, 2.25\" high, .75\" deep. Customizable operation sounds, self-timer, red-eye function, digital zoom, macro mode, quick ISO function. Camera slows as the battery gets worn down, so be ready for a pause when you least want a pause! This seems to be typical for compact point-and-shoot cameras.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20101231
    },
    {
      "title": "A great little camera",
      "text": "I purchased this camera for a recent holiday I was taking in Maui. Given baggage restrictions, I wanted a small camera that took both great stills and video. This Canon Power Shot SD1000 did not disappoint. It's relatively easy to use and takes really great stills and video. The only criticism I have is that extreme distances the zoom becomes somewhat fuzzy....but it only happens at extreme distances, so it can be controlled. I've blown up some of the stills to 8\" x10\" and they still retain a crisp focus. Highly recommend this camera for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Franc Martarella",
      "helpful_votes": 2,
      "publication_date": 20070512
    },
    {
      "title": "Canon PowerShot SD1000 7.1MP Digital Elph Camera with 3x Optical Zoom (Black)",
      "text": "I purchased this camera for my husband as an anniversary present. He's extremely choosy in his technological ventures. He wanted a compact camera that would fit easily in his pocket (he doesn't like bulky cases), would turn on and be ready to shoot quickly, and yet something that would take great pictures. We found it all in this camera and have been very pleased. The picture quality is great and there are multiple photo settings so that you can take pictures of fast action, low lighting, portraits, landscapes, fireworks, snow, macro, etc. The price through Amazon.com is very reasonable, too!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Jones",
      "helpful_votes": 8,
      "publication_date": 20070805
    },
    {
      "title": "Best compact camera for the price!",
      "text": "I bought this for myself as a Christmas present last year and it has worked great since. The only thing I would like to have on the camera would be the image stabilization that the newer more expensive models have. Otherwise this camera is great because it is so compact, I just carry it in my purse and snap away at a moment's notice. The megapixels are just right and all the images come out clear and crisp (that is, if they or I am not moving at the time of the shot - again image stabilization would help here). Overall I am very happy with this camera.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Rapp",
      "helpful_votes": 0,
      "publication_date": 20080529
    },
    {
      "title": "Would be 5 stars except for one aggravation",
      "text": "I could write tons of stuff on this excellent product. But it's easier to say everything is great EXCEPT that it does not have battery charge meter. You have no way of knowing, when you pull the camera out of your drawer, if it has 100%, 50%, or only 2% of the battery charge left. A serious problem. For me, an annoyance. Other than this problem (which could be solved if you own a second battery and always keep one of them 100% charged), it's perfect. Great flexibility, great quality, compact, easy to use, display and viewfinder, etc....",
      "rating": 4.0,
      "verified": true,
      "author": "metzmatt",
      "helpful_votes": 0,
      "publication_date": 20090418
    },
    {
      "title": "Great Camera!",
      "text": "What a great camera! Canon makes and intuitive, quality product that produces excellent results. The small size of cameras in this line means that you can take the camera anywhere you go without the annoyance of bulky equipment. I've been very happy with my purchase. I bought ato go along with this, which is very helpful for getting the photos from the SD card onto your computer. Also, be sure to pick up a case to protect the LCD screen on the back of the camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank G.",
      "helpful_votes": 0,
      "publication_date": 20081108
    },
    {
      "title": "Amazing Camera",
      "text": "This is by far the best camera I had -digital one I meant. It is perfect for those who want to take great pictures, easy to used. Camera for those who want to click and get it. My fast review list 1. Perfect size 2. Great and bright display 3. Takes pictures quickly - press and shot. 4. Take amazing videos -this is not the main feature but I didn't expect those great videos from a small camera -not professional but great to be shared. 5. Easy to use 6. Accelerometers included -means camera detects the photo direction -you don't have to rotate them.",
      "rating": 5.0,
      "verified": true,
      "author": "Alberto Dominguez",
      "helpful_votes": 0,
      "publication_date": 20080328
    },
    {
      "title": "Good camera for nice price",
      "text": "I was really looking for a camera that was small, did not take too long to startup, and did not take too long to recover from shoot with flash .... my old camera suffered from all of the above. This camera met all of my expectations and more. I liked the good video it produced when operating in recording mode. Also the variety of scenes \"Kids and Pets\", \"Night\", etc make for good photo for any occasion. The customizable \"self-timer\" is good for those family photos where all members can be in the shoot ... no one has to be behind the camera to press the button.",
      "rating": 5.0,
      "verified": true,
      "author": "A. J. Lex",
      "helpful_votes": 0,
      "publication_date": 20071112
    },
    {
      "title": "great upgrade",
      "text": "I have owned a lot of the canon cameras, all have been great buys. last one was the 450, which was a nice camera, but this is an amazing upgrade, all the features the 450 needed, much better double zoom, color saturation is great, still some trouble with low light, but the auto focus really snaps the picture tighter and cleaner. this camera is bringing all the fun back in to shooting , pets and outdoors, great buy with the one gig card, I have a video camera, so never use that feature. thanks amazon for amazing shipping once again!",
      "rating": 5.0,
      "verified": true,
      "author": "Vintage PowerReader",
      "helpful_votes": 0,
      "publication_date": 20070824
    },
    {
      "title": "Great portable camera",
      "text": "We already had a nice digital camera, but wife wanted something smaller and more portable she could easily carry in her purse for more impulse-style picture taking. After some research online, we ended up with the SD1000 and couldn't be happier with it. Camera is quite small and light, easy to use and takes great pictures. Battery holds up very well - wife works at a school and has spent all day taking pictures at school programs without running it down. Has some fun additional picture modes for when you're bored or feeling creative.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20080324
    },
    {
      "title": "As expected from a Canon Compact Camera",
      "text": "I've had about 3 or 4 SD line cameras. This is as expected and for a sub $200 price you're doing well. The face chasing feature is pretty neat. It can even recognize faces in the background and bring them into focus. I do not believe this camera is SDHC compliant yet which could hurt it when using it as a video camera. Works well in low light, the flash is good enough for bringing to a party or a club. The rear screen is nice and easy to read. It's also a very good size. Nice and small and easily can fit in your pocket.",
      "rating": 5.0,
      "verified": true,
      "author": "Bubbles-Desmo",
      "helpful_votes": 0,
      "publication_date": 20071228
    },
    {
      "title": "Good Camera for the Price",
      "text": "I bought this camera and was not overly pleased with it. I would have given it 2 maybe 3 stars. Then it got soaked in Gatorade (yes, I have kids!) and I had to replace it. I did get the same camera again and this time the photos are MUCH better. There must have been a defect in the first camera. After having the camera for about 5 months and using it daily for photos and video clips I have found that the best setting is Kids & Pets. For some reason all of my photos come out really good using this setting during the day.",
      "rating": 4.0,
      "verified": true,
      "author": "Mom to 6",
      "helpful_votes": 0,
      "publication_date": 20080530
    },
    {
      "title": "Great camera",
      "text": "This awesome gadget is a favorite it's Ine of the few investments you will keep forever",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Takes a lickin' ...",
      "text": "I bought one of these for hiking - on my FIRST hike with it, I climbed up on some rocks, took 2 pictures, started to put it away - and DROPPED it! As I saw it bounce 2 or 3 times on the rocks, and the battery and and SD card popped out, I figured it was a goner. But I picked it up, brushed it off, put the battery and SD card back in - no scratches on the camera at ALL, powered it up, took some more pictures, pictures were perfect when I got home - unbelievable! I am now completely a believer in Canon quality.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Kronstadt",
      "helpful_votes": 0,
      "publication_date": 20080427
    },
    {
      "title": "Great, economical digital",
      "text": "I have owned 4 Canon Elphs (beginning with the S100, their first). This one embodies the feature I admire in the series: durability (except watch out for breaking that back screen, which is why I had to replace my last one). The ISO settings can go as high as 1600 on this model, enabling me to take many shots without a flash (the flash is disturbingly harsh on these cameras). Great lens, too. Nice clear images. This is te right price, too, since I will probably break the screen on this one in the next 2 years. Optimism, right?",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Corrigan",
      "helpful_votes": 0,
      "publication_date": 20071116
    },
    {
      "title": "Great point & shoot!! Great features at a great value!",
      "text": "I was looking for a compact, yet full-featured digital camera to record my recent trip to Thailand... the Canon PowerShot was a GREAT little camera! Held up to packing around Thailand, as well as performed great indoors & out. LOVE the different color/film settings! The only \"con\" is that I had to keep turning on & off the flash in auto mode (although there may be an easier way I did not realize in how to do this more easily)... For the money, you can't beat this little workhorse!",
      "rating": 4.0,
      "verified": true,
      "author": "aloha jules",
      "helpful_votes": 0,
      "publication_date": 20071119
    },
    {
      "title": "Very practical, poor performance.",
      "text": "I bought this camera because I needed one and it was #1 on Amazon at that time. Very compact, easy to use and it has some nice feature. When I took an open-daylight picture at full 7.1 MP, the file was that size, but not the expected quality. Using a zoom function on Photoshop to compare details, a picture taken with my old Sony Cybershot 5.0 MP got far way more details. Every time I use the no-flash function, even with enough light, the resulting picture is a low quality one. The pets-children function (theoretically, this function allow the camera not to be affected by suddenly movement) is practically useless; very nice product otherwise. Ideal for amateur-low exigent users.",
      "rating": 3.0,
      "verified": true,
      "author": "R B",
      "helpful_votes": 0,
      "publication_date": 20071121
    },
    {
      "title": "Compact and easy to use!",
      "text": "This is a great digital camera. It is very easy to use, unlike an Olympus that I gave my husband last year. The pictures are excellent and the resolution is sharp. I like using the rechargeable lithium battery that comes with it. Buy an extra battery if you are disorganized about keeping a spare battery charged. The camera is sleek looking to and fits well in any pocket. Definitely a goodie! I have bought 2 others, one for each of my grown daughters and they LOVE them.",
      "rating": 5.0,
      "verified": true,
      "author": "V. Alston",
      "helpful_votes": 0,
      "publication_date": 20071109
    },
    {
      "title": "Canon PowerShot SD1000",
      "text": "The camera is perfect. The vendor, not so much. The product came via surface shipment. I would have paid for fast shipping but don't remember being given that choice. It barely got here in time for the birthday for which it was a gift. The outer packaging was severly crushed making me very concerned about the product inside. (We took photos of the packaging). I would never trust this NYC vendor again. The product's inner packaging looked really old as though this was a used product. But, we bought the camera assuming it was a new camera. No packing slip enclosed. Very bad!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Music Mari",
      "helpful_votes": 0,
      "publication_date": 20090928
    },
    {
      "title": "Great Camera",
      "text": "I bought this camera a few years ago. When my ex girlfriend moved out she stole it. In order to buy it new it would cost $300-$399 dollars. I bought used it off of this seller for under a $100 bucks. The seller was great and included a nice case. It might not have all the bells and whistles of newer cameras like HD video ability but it gets the job done for under $100 bucks. I am grateful to this seller. Great camera.",
      "rating": 4.0,
      "verified": true,
      "author": "+MF+",
      "helpful_votes": 0,
      "publication_date": 20120313
    },
    {
      "title": "Great Buy  - Good Picturers",
      "text": "The camera is very good .. I bought with it the 2GB SD memory, so I can take thousands of pictures!! I especially like the fact that it is very small, and I got a good deal on it. If you're a professional photographer, or are looking for professional quality pictures, this is not the camera for you, but if you're looking for a good day-to-day camera that takes great pictures and you can carry with you wherever you go, this is the camera for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Madaba",
      "helpful_votes": 0,
      "publication_date": 20071231
    },
    {
      "title": "What I enjoyed the most about it was the manual mode",
      "text": "I had this camera forever. Until I stopped using it and then it somehow died. What I enjoyed the most about it was the manual mode. Also its compact size and design.",
      "rating": 4.0,
      "verified": true,
      "author": "Joel Ramirez Aguirre",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "I'm taking good pictures consistently for the first time",
      "text": "What an amazing camera. I had a Konica-Minolta, about 2 years old, that was not bad. Well, it was damaged so I tried this camera. The automatic face recognition is amazing, while not perfect as noted elsewhere. That and the other great qualities of this camera noted elsewhere here allow me -- a poor photographer -- to take consistently good (and sometimes beautiful) pictures. I no longer have to take a lot of pictures to get one that is good.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Dobbs",
      "helpful_votes": 2,
      "publication_date": 20070906
    },
    {
      "title": "Cannon does it again!",
      "text": "Very happy with this sleek camera. It fits neatly in a pocket or purse and goes everywhere. Pictures are very sharp and the shutter time is fast. You can take pictures quickly without waiting for the camera lag. We encountered a problem with the LED screen initially, it died....however, the camera kept taking great pics with the viewfinder which was wonderful since we were on vacation and did not have another camera. When we returned we were able to get a replacement very quickly through Amazon and we are thrilled with the performance.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Cardullo",
      "helpful_votes": 3,
      "publication_date": 20070813
    },
    {
      "title": "I'm a complete dummy, but...",
      "text": "This camera is great - a friend who is a photographer recommended the elph series to me a few years ago because he knew I was quite ignorant about cameras. I bought one for my daughter and when I turned 50 this year bought this as a birthday present for me. It takes great pics, so easy to use and I haven't yet had time to discover how to use the bells and whistles. I would certainly recommend it to anyone who isn't an expert, like me.",
      "rating": 5.0,
      "verified": true,
      "author": "Bat Babe",
      "helpful_votes": 0,
      "publication_date": 20070920
    },
    {
      "title": "She loves it!",
      "text": "I bought this camera for my daughter's 18th birthday, and she absolutely loves it. For some reason, the feature where you can pick just one color to show and have the rest be black & white has been considered very cool by the high school senior crowd. So far, I haven't heard a single complaint, and she loves how it fits easily into her purse or pocket. My daughter is very critical and picky, so I consider this a major mom victory!",
      "rating": 5.0,
      "verified": true,
      "author": "B. Clark",
      "helpful_votes": 0,
      "publication_date": 20071031
    },
    {
      "title": "BEST CAMERA!",
      "text": "By far one of the most compact and well design camera I ever own for my first time. I have own it for so long...maybe 5 or so years...and my brother snd sister still take photo and movie with it. I love the macro mode and video recording. I recently bought a fuilj camera and it will never be the same.. I will def buy a upgrade verison of this camera in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Hmoobthor",
      "helpful_votes": 0,
      "publication_date": 20110831
    },
    {
      "title": "Another great little Canon",
      "text": "This is my 3rd Canon Digital Elph camera. They are great little point and shoot cameras. The metal case makes them feel \"substantial\" not cheap and I have had great luck and great results with all of my Canons. This one is the smallest one so far, it doesn't need to get any smaller and they changed the position of some of the buttons, etc., making the camera easier to use. I would definitely recommend this camera and will probably replace it with another when I need to.",
      "rating": 5.0,
      "verified": true,
      "author": "Trixie",
      "helpful_votes": 0,
      "publication_date": 20070904
    },
    {
      "title": "I love this camera",
      "text": "I bought this camera for myself just before the holidays since mine had broke. I love this camera, it's easy to use, takes great pictures, small enough to carry in my purse, on the motorcycle and is always handy. I am really having a great time with this camera, I NEVER miss anything anymore. Pictures are easy to download off the camera to computer. I have never had any problems with this camera.. I just love it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "E. Scalzi",
      "helpful_votes": 0,
      "publication_date": 20071225
    },
    {
      "title": "Old School Elph",
      "text": "Great retro, \"square\" design but still maintains the diminutive size. Same great pics as my previous Canons (SD-200, SD-10, SD-300). Nice big, sharp LCD screen (get a screen protector even though it has a scratch coating already on it). Only complaint that the menu and navigation buttons are all flush with each other so you have to watch what your pushing. Other than that, satisfied as usual. Can't beat a Canon.",
      "rating": 4.0,
      "verified": true,
      "author": "eman",
      "helpful_votes": 0,
      "publication_date": 20070513
    },
    {
      "title": "The Canon that Converted Me",
      "text": "Prior to picking up the SD1000 I had been a Sony fan. After owning several Sony's and getting tired of the soft pictures I decided to try Canon again. I am so glad I did. This camera takes great pics and fits perfectly in the pocket. It even takes good pics in less than perfect lighting which is something none of my sub-compact Sony's could do. This is the one camera which can do it all for me. The only gripe I have is why no battery meter Canon? It's inexecusable that they can't include this feature but by no means a deal breaker. Btw-I saw the new SD1100 and all I have to say is ewww[...]",
      "rating": 5.0,
      "verified": true,
      "author": "ha-evolution",
      "helpful_votes": 0,
      "publication_date": 20080405
    },
    {
      "title": "So far so good",
      "text": "I upgraded to canon sd1000 from sd300 because my flash stopped working. I am so happy I bought this camera, it takes great pictures and great for traveling. Amazon is the best, always get my shipments super quick. I received my camera exactly one week from the day of purchase. With free shipping and only $163 for a canon 7MP. This is user friendly as well. I recommend getting the SanDisk 2GB, I got mine at Circut city for $20 and holds well over 1500 pics (depending on the settings of your camera) and 15 minutes of video. You can find it here on amazon for about $7-8 with cost of shipping.",
      "rating": 4.0,
      "verified": true,
      "author": "Oceans",
      "helpful_votes": 2,
      "publication_date": 20080321
    },
    {
      "title": "Very satisfied!!",
      "text": "I love this camera. It is small and compact enough to carry without a lot of weight. I have experimented with a lot of different lights and distances. It does not take the place of my Pentax long distance lenses, but for the price and size it does a surprisingly great job. I love the true colors it captures and the various quality settings. I have not been disappointed with the quality of pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "aklittlered",
      "helpful_votes": 0,
      "publication_date": 20070826
    },
    {
      "title": "The Workhorse of Our Family",
      "text": "I have been a freelance photographer for over 20 years now. I got this camera for my wife several years ago so that she could play around and leave my expensive DSLRs alone. She uses nearly every function including the video with our daughter. In fact I find myself grabbing this camera when we want to travel light and leave all my equipment behind. It can't do everything a DSLR can (not even close), but I have captured some amazing shots with it. In all a great buy, the battery lasts a long time and menu is simple to use.",
      "rating": 5.0,
      "verified": true,
      "author": "A Kumnick",
      "helpful_votes": 2,
      "publication_date": 20121217
    },
    {
      "title": "Canon Powershot SD1000",
      "text": "This is a great camera. I read reviews on both Amazon and CNET. I've had the camera about a month now and love it. I was hesitant to by a camera with a rechargeable battery but the battery life is great. I'm still running off the initial charge and take pictures almost daily. By no means am I technologically savvy but this camera is a great buy. Easy to use, understand, AND takes great pics.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Horne",
      "helpful_votes": 0,
      "publication_date": 20080609
    },
    {
      "title": "Handy Little Guy!",
      "text": "I have a Kodak Easy Share \"Z\" series for regular traveling, a Nikon D40 w/zoom for sporting events/activities but never had a little one to keep with me all the time \"just in case\". Bought this so I would always have one in my purse and WOW - takes amazing pictures. Incredibly easy to use. Shutter speed isn't as fast as I would like it to be, but for everyday use, it is more than enough.",
      "rating": 5.0,
      "verified": true,
      "author": "MiMiVanV",
      "helpful_votes": 0,
      "publication_date": 20071225
    },
    {
      "title": "Love this camera",
      "text": "I wouldn't consider myself an avid photographer. In fact this camera has many bells and whistles that I will likely never use. But as a simple point-and-shoot auto-focus camera, this one is excellent. I had been looking for a camera with a quick shutter that would help me catch those precious moments with my kids that my other digital always seemed to miss. This one is fantastic. Takes beautiful crisp photos, and does so one after another so that I feel like I never miss a shot.",
      "rating": 5.0,
      "verified": true,
      "author": "egghead23",
      "helpful_votes": 24,
      "publication_date": 20070724
    },
    {
      "title": "Mostly a great camera",
      "text": "I bought this a few months ago and it is a great little camera except for one thing. A lot of times when I go somewhere and need to take pix the battery seems to die. It might just be my ignorance why I never notice when the battery will die but so far I can't tell if there is an indicator or not. Maybe I need an extra battery or something but my old camera used energizer lithiums and it indicated when the battery was losing power. This camera just waits to the last minute to tell you need a charged battery which is kind of hard at an amusement park. Other than that I have no other complaints!",
      "rating": 3.0,
      "verified": true,
      "author": "Cinful",
      "helpful_votes": 0,
      "publication_date": 20080206
    },
    {
      "title": "Very Impressed",
      "text": "This is my first camera. I wanted something so small, I would actually carry it with me on hikes instead of forget it. Since it's as small as my cell-phone, it does beautifully in that regard. I won't bother reviewing the rest, this camera simply packs more features than a casual photographer like me could possibly want. Bottom line: great camera, no problems\\issues\\regrets.",
      "rating": 5.0,
      "verified": true,
      "author": "Denis Dube",
      "helpful_votes": 0,
      "publication_date": 20071021
    },
    {
      "title": "wonderful camera!",
      "text": "relatively easy to use UI, great long exposure facility (up to 15 seconds,) compact size. Image quality is very good at the high resolution, (3Kx2K) shoots reasonable 640x480 video. with a 4GB add on sd memory card, the capacity is enormous, (over 1200 of the largest size image.) shoots very quickly, very little wait between shots. only down side is proprietary battery, it does come with an external charger, so having a spare is not difficult. full charge takes around 90 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "peter sgouros",
      "helpful_votes": 5,
      "publication_date": 20070816
    },
    {
      "title": "Dad loves his camera",
      "text": "We purchased this camera for our dad to replace one just like it that we bought new a couple years ago. It is great that he doesn't have to learn how to use a new model and he still had all the accessories for this one. We are glad we found one at a good price and he loves it. His had either been stolen or misplaced and he really missed using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Susieshopper",
      "helpful_votes": 0,
      "publication_date": 20110319
    },
    {
      "title": "happy to have my favorite camera back",
      "text": "Loved this camera but got it wet and now cant see viewscreen. Replaced it with canonpowershot A2600, which was very slow, took blurry puctures, and color was off. Very happy to find this camera used/refurbished and purchased again. Used camera in excellent condition and works great",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Conner",
      "helpful_votes": 0,
      "publication_date": 20150517
    },
    {
      "title": "Canon ... the Camera of PartyReptile.com",
      "text": "For 5 years and 30,000 pictures Canon has been my product of choice for PartyReptile.com. The SD1000 has been in my pocket for the past couple years and helped me capture 1000's of digital picture for my web site. The quality is great, as well as the Canon service department, when I need them. The Canon PowerShot, Amazon.com, and PartyReptile.com make a great team!",
      "rating": 5.0,
      "verified": true,
      "author": "Run-A-Way Bill",
      "helpful_votes": 0,
      "publication_date": 20090306
    },
    {
      "title": "Perfect family digital!",
      "text": "This thing is a great little camera!! pictures are bright and clear. the thing really adjusts itself for user shortfalls! I took a picture of the Christmas tree in a VERY dimmly lit room to see what happened, and it looked like noon, outside, in the pic. Very impressed. I'm no tech camera geek, but I would say for the money, this is the camera! NO bad pictures yet!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Peterson",
      "helpful_votes": 0,
      "publication_date": 20080106
    },
    {
      "title": "compact & clear",
      "text": "i wanted a small pocket sized camera to take on trips. i have 2 other cameras that take great pics, however, they are big and bulky. this camera fits in one of my cases for the mp3 player!! it takes very clear pics for the size, pixels, and price. also very simple to use: just turn it on, point and shoot. i also like the battery charger.",
      "rating": 5.0,
      "verified": true,
      "author": "Red 4rd",
      "helpful_votes": 0,
      "publication_date": 20071109
    },
    {
      "title": "tried and true for a long time",
      "text": "Had one of these before.... got it wet (a lot)...and was so happy to see that it was available for a reasonable price on amazon. It arrived ahead of time and packaged well. I still had the t.v., computer, cables from my old one. All compatible. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "tigger",
      "helpful_votes": 0,
      "publication_date": 20140605
    },
    {
      "title": "Great camera with lots of features!",
      "text": "I bought this camera for my son's Birthday and since he is a very good photographer I was looking to impress him and at the same time to get him something he'll really love. I accomplished both! He loves his new camera and boasts about its features that he discovers anew every time he uses it. Now, I have to get one for my daughter. Excellent purchase and the price was amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "MLM",
      "helpful_votes": 2,
      "publication_date": 20080405
    },
    {
      "title": "Great Camera, Great price",
      "text": "Haven't found one flaw, though I do recommend purchasing a 2nd battery to keep on hand. you only get a few picture warning about the battery being dead before you're stuck dead in the water. Best point and shoot I've had yet, and actually have two now so we always have one on hand. Been dropped from 3' high (camera closed-not on) and still works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Weller",
      "helpful_votes": 0,
      "publication_date": 20080327
    },
    {
      "title": "Excellent little camera",
      "text": "We haven't totally explored it's full potential but for the money it is a perfect size with ease of operation. It fits comfortably in a pocket or a lady's purse. It has quick shutter speed, which made the decesion for us. It is our second digital camera and the first was the top of line for it's day, this has so much more! Very pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mello's Ma",
      "helpful_votes": 0,
      "publication_date": 20070927
    },
    {
      "title": "Good Compact Digital",
      "text": "Fun camera, nice and small so it easily fits in my purse so I can bring it everywhere with me. Turns on quickly but taking a picture can be confusing if you haven't used it before (you need to make sure you push the button down all the way). Takes good pictures even in low light the flash is decent. Overall a good camera, would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "AliRae",
      "helpful_votes": 0,
      "publication_date": 20080515
    },
    {
      "title": "A classic, well designed pocket camera",
      "text": "I had this camera and gave it to my brother. Then I missed it so much I searched for another one. I found it here and love more than ever. It fits in the smallest pocket and does so many things. This is the perfect back-up camera. Well done Canon. Again.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy H VanderVeen",
      "helpful_votes": 0,
      "publication_date": 20130809
    },
    {
      "title": "Great Pics; Easy to use; Very small",
      "text": "I researched the Canon, Casio, and Sony. This little camera takes amazing pictures for a tiny snap & shoot. Plus it is so small you always have it with you (not much bigger than a cell phone). The LCD screen is slightly smaller than the tiny Sony, but it makes up for it because it has the buttons you are used to on the back (where the new Sony requires more use of on screen commands). Pick up a bigger memory stick (the one in the box holds about 15 pictures at the standard settings). Price on Amazon was right.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristine",
      "helpful_votes": 0,
      "publication_date": 20070514
    },
    {
      "title": "Canon PowerShot SD1000",
      "text": "As others have indicated the flash is a bit weak for indoor pictures that are over around 12-15 feet. I wish the flash was more powerful but with the small size of the camera it might be difficult to provide more power. However, the pictures can be enhanced with programs like Picasa 2 that will make them very good. All the outdoor pictures I have taken in outdoor lighting conditions are excellent. I particularily like the small size of this camera--very convenient to carry. I consider this to be a very good purchase based on cost, size, and quality of pictures.",
      "rating": 4.0,
      "verified": true,
      "author": "AFColonel",
      "helpful_votes": 0,
      "publication_date": 20071202
    },
    {
      "title": "Best Point and Shoot for the quality and Value",
      "text": "Bar none this is the best Point and shoot I have ever owned. After being a sony fanboy since the intro of digital photography I recently switched to Canon because the pictures I was getting from the sony's just wasnt up to par. For the money the canon is perfect for nights out (or any situation) since its so pocketable. Good materials, solid feel, ease of use make this a camera that you dont mind taking with you everywhere!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Yu",
      "helpful_votes": 0,
      "publication_date": 20080306
    },
    {
      "title": "What a bargain!",
      "text": "I have two friends with this camera that couldn't stop blabbing about how great it was. Meanwhile, I was shooting with my digital Rebel (much bigger, \"fancier\", more expensive). And downloading THEIR photos of events because mine were never as good. I always thought it was me, but I finally got one too. Now I'm bringing a camera EVERYwhere and taking great shots. I love this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Eva Raposa",
      "helpful_votes": 0,
      "publication_date": 20080613
    },
    {
      "title": "Beautiful pics from tiny camera",
      "text": "When I first opened the box I was surprised at how small this sd1000 is, even after reading all about it. This is an upgrade from the sd400 for me which I loved, but was getting old. It's very light as well. I find that the battery lasts through filling up my 1gig card. I do wish there was a battery strength indicator. If there is one that I don't know about, please enlighten me. A cool feature that it has is in the review mode. If you are reviewing a picture and you are holding the camera horizontally the picture will view horizontally. If you turn the camera vertically the picture will rotate itself as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Gimmeniz",
      "helpful_votes": 3,
      "publication_date": 20070714
    },
    {
      "title": "perfect for daily use",
      "text": "I bought this as a replacement for a canon powershot 200 camera. It is slick and perfect for daily use. I like especially that it is possible now to take arbitrary long movies and that one is not restricted to 30 second clips. Both the picture and movie quality is great for such a slim camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Oliver",
      "helpful_votes": 3,
      "publication_date": 20071019
    },
    {
      "title": "everything you can ask for",
      "text": "stylish and user friendly.....this camera is excellent. the stills are almost perfect..nothing a lil editing cant fix as long as you know what you are doing. if you love photography as much as me...(and if you buy this camera you probably do) get a 4gig sd memory card to with it...and spare batteries too. THIS CAMERA IS THE BEST EVER. THANK YOU CANON",
      "rating": 5.0,
      "verified": true,
      "author": "KA",
      "helpful_votes": 0,
      "publication_date": 20071017
    },
    {
      "title": "So far I love it!",
      "text": "I updated my bigger Canon digital camera for this small one with video. I love that I can put it in my pocket or purse and not have extra bags to carry around. The pictures are great! The video is a little shaky as you zoom out but is to be expected with no image stabilization. Will work for short videos close up great though.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Townsend",
      "helpful_votes": 4,
      "publication_date": 20070907
    },
    {
      "title": "Canon's warranty is great",
      "text": "I recieved this camera as a gift for xmas and liked it so much I ended up buying one as a gift for the person who gave it to me. One day however, the camera would simply not power on. I called Canon, sent it in and it was back repaired in about a week. You just can't go wrong by going with Canon for digital cameras.",
      "rating": 4.0,
      "verified": true,
      "author": "c wolfley",
      "helpful_votes": 0,
      "publication_date": 20080421
    },
    {
      "title": "Not as good as SD600",
      "text": "Nicer looking and smaller but does not take automatic photos as nice as previous model which I owned previously. For outside shots with sunlight most automatic photos come out too bright even when adjusted to the sunlight setting. I would trade this for the larger SD600 Powershot which took better pictures.",
      "rating": 4.0,
      "verified": true,
      "author": "Jay Johnson",
      "helpful_votes": 4,
      "publication_date": 20070814
    },
    {
      "title": "Good Deal!",
      "text": "I bought this camera for my wifes birthday and she absolutely loves it. The pictures are clear and crisp. The viewing screen is much larger than our old PS camera. I guess putting in the right memory card helps too. I bought her an Extreme III 2 GB card which has a super fast transfer speed. For the price though of this camera, you can't beat it. We also use this same camera at my company to take on the road for field work pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "Chad E. Fehr",
      "helpful_votes": 0,
      "publication_date": 20080506
    },
    {
      "title": "Darn good little camera",
      "text": "The camera is very small and light weight but it still takes very high quality photos under almost any condition. The battery is rechargeable and takes a surprising number of photos between charges. The menus and features are easy to use. I also like the black trim. My other camera is a Nikon D50 with four lenses but I carry the Elph everywhere I go.",
      "rating": 5.0,
      "verified": true,
      "author": "David A. Wilson",
      "helpful_votes": 2,
      "publication_date": 20071018
    },
    {
      "title": "Nice size, ok pictures.",
      "text": "This camera is an overall ok product. It is easy to use, sleek, small and has a few pretty cool features, but as far as picture quality - don't expect anything great. The pictures tend to come out too light - almost as though there is a white film over it. Its not so bad, doesn't \"ruin\" the pictures, just a little annoying.",
      "rating": 3.0,
      "verified": true,
      "author": "Tara Cason",
      "helpful_votes": 0,
      "publication_date": 20080502
    },
    {
      "title": "Great little camera",
      "text": "I had an old Canon S200 and wanted to upgrade to a smaller, better camera. I love this. It is very small and light. I end up taking it with me a lot more often. The pictures are good. We still get red eye, but it's easy enough to correct that in our software. At $166, I feel like it's an amazing deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20080326
    },
    {
      "title": "Great little camera...",
      "text": "I love the size. Have to say that the quality of the photos isn't the best, but it's fine for taking travel photos and is much better than using a cell phone for snapshots. The small size and weight makes it easy to carry with you anywhere.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon reader",
      "helpful_votes": 0,
      "publication_date": 20140503
    },
    {
      "title": "Excellent",
      "text": "I've had this camera for about 5 months now and have had no problems whatsoever. It takes great pictures and has all the features you need in a digital camera. Once you get use to it, it is very easy to use. You can start taking great pictures right out the box, given the battery is charged. I'd recommend buying a 2GB SD card to go with your camera as the one they include will fill up pronto.",
      "rating": 5.0,
      "verified": true,
      "author": "Rusty Metal",
      "helpful_votes": 4,
      "publication_date": 20071004
    },
    {
      "title": "The seller is amazing. He kept his part of the bargain by maintaining his/her promise",
      "text": "This seller will definitely be referred to others who shop on Amazon. The camera was just as advertised and it arrived very fast. Congrats to this seller and I hope he/she keep doing the good work he has started. (S)he should always remember that good name and trust is better than riches.",
      "rating": 4.0,
      "verified": true,
      "author": "Napoleon K. Sefordzi",
      "helpful_votes": 0,
      "publication_date": 20100418
    },
    {
      "title": "Great camera",
      "text": "Only flaw is that it doesn't have good enough redeye reduction... almost all shots of people result in redeye. That must be why Canon included built-in redeye editing software right in the camera... that feature works pretty well, too! Excellent size, convenient, very smart camera!",
      "rating": 5.0,
      "verified": true,
      "author": "T. Geery",
      "helpful_votes": 0,
      "publication_date": 20071222
    },
    {
      "title": "Good at what it does",
      "text": "I upgraded from canon SD10. This camera is very familiar, works well. My SD10 died (after several years). I picked this up (for 1/2 of what i paid originally for the SD10!) as a replacement pocket camera when i didn't want my SLR lugged about. Eats up cards though, buy bigger ones, my 512M goes quickly! I recommend this camera. It's a good price point, easy to use, nice pictures.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve S.",
      "helpful_votes": 0,
      "publication_date": 20071228
    },
    {
      "title": "Died a slow death over a year",
      "text": "Over one year it deteriorated. It started out good. Then some snaps came out blurred with the auto focus on. Then most of the snaps came out blurred with the auto focus on. Then all of them! I had to switch to the highest ISO setting. Then the screen stopped working. No image. Nada. Rest in peace sweet sweet camera, we hardly knew 'ye.",
      "rating": 1.0,
      "verified": true,
      "author": "jawahar antao",
      "helpful_votes": 0,
      "publication_date": 20090521
    },
    {
      "title": "Excellent camera, no complaints",
      "text": "It works extremely well. You can easily take pictures at low/med/high resolutions depending on whether you want to print them in large formats or not. I really have no complaints at all about the camera. It's very easy to use, very light to carry, and refreshes fairly quickly assuming you get a decent memory card for it.",
      "rating": 5.0,
      "verified": true,
      "author": "G G",
      "helpful_votes": 0,
      "publication_date": 20091002
    },
    {
      "title": "Best Camera Ever",
      "text": "Hand down the best of the 4 Canon Elphs I have owned. It replaced the 950 which was too bulky. This camera is very small, very solid, and has a great feature set. The LCD is not recessed, it is completely flat with the back of the camera which I like. Could not recommend highly enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20080524
    },
    {
      "title": "The best little camera ever.",
      "text": "We now have 3 of these canon SD1000 cameras in our family, they are perfect. They make nice movies and take great photos. Simple to operate and the battery lasts a very long time and charges so fast. From empty to full in about 90 minutes. I recommend the Canon SD1000 to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Iser",
      "helpful_votes": 0,
      "publication_date": 20071108
    },
    {
      "title": "Easy to use and good quality photos",
      "text": "This is my third digital camera and by far the most compact and easiest to use of all my previous cameras -- including the point and shoot box cameras of my youth as well as more advanced SLR cameras with interchangeable lenses and the two earlier digital cameras. The instructions are detailed but understandable It actually does fit in a shirt pocket since it is no bigger than a deck of playing cards. I particularly like its battery pack with supplied charger.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph H. Thomas",
      "helpful_votes": 0,
      "publication_date": 20080717
    },
    {
      "title": "I have found this camera to be so much better than the newer versions that have come out",
      "text": "I have found this camera to be so much better than the newer versions that have come out. It's much more user friendly and always takes great pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151224
    },
    {
      "title": "Wow",
      "text": "I bought this to replace a Canon A20. Boy have they changed, and for the better. Easy to handle, shoot, charge, export and just the right size. Am wondering about how scratch resistent the lcd display is, but will have to wait and see. So far, the perfect camera for the family.",
      "rating": 5.0,
      "verified": true,
      "author": "JFG",
      "helpful_votes": 0,
      "publication_date": 20080106
    },
    {
      "title": "Terrible shutter lag",
      "text": "There is no sports (action) setting on this camera, so if you plan to take a picture of anything that moves, be it your child's football game or even your pet, forget it. You can expect a 2-3 second delay -- just enough to miss the shot you wanted. It doesn't matter which setting you use. I suppose the camera is fine for pictures of buildings and flowers, but don't you want to fill your albums with more than that?",
      "rating": 2.0,
      "verified": true,
      "author": "What are we buying today",
      "helpful_votes": 3,
      "publication_date": 20071114
    },
    {
      "title": "Perfect camera for our needs",
      "text": "The camera is small, the screen is large and bright. The photos we've taken have turned out very good regardless of the lighting condition. It works well for stills and action shots, and fits in my pocket. If you're looking for a small camera that packs alot of photo-power, this is a great choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Ted Boone",
      "helpful_votes": 0,
      "publication_date": 20080213
    },
    {
      "title": "My wife loves it",
      "text": "I purchased the camera as a Christmas gift for my wife. She was very excited when she opened it because since it's so small she can carry it around with her all the time and not miss a photo moment(that was the whole idea). Personally I'm very impressed with the quality of the pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Arthur Osterude",
      "helpful_votes": 0,
      "publication_date": 20080111
    },
    {
      "title": "Got this one to replace it and it is a great point and shoot camera",
      "text": "Had one before but I smashed the screen on it. Got this one to replace it and it is a great point and shoot camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy",
      "helpful_votes": 0,
      "publication_date": 20160628
    },
    {
      "title": "Slim and tuff",
      "text": "I take this camera everywhere, I have left it in my car in Texas heat. I have dropped the backpack in which I had this camera. It still works. Only problem with this is that it does not indicate when battery is about to run out...",
      "rating": 5.0,
      "verified": true,
      "author": "Amer",
      "helpful_votes": 3,
      "publication_date": 20070912
    },
    {
      "title": "Love this camera",
      "text": "Purchased this camera several months ago for my daughter. Read all the reviews and was quite sure I was making a good purchase. Ended up buying another one for my wife. Very impressive pictures. Nice features. Simple operation. PC Magazine has recommended this camera for quite some time now. Very happy with both of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick J. Stohler",
      "helpful_votes": 0,
      "publication_date": 20071226
    },
    {
      "title": "Small in size takes Jaw Dropping pictures. Buy it",
      "text": "Crystal clear pictures. Surprised pictures of moving cars had very little blur to them. Even the wheels looked still going at 45 mph. Closeup shot of text able to zoom in clearly for single word on a page. Distance zooming was equally astounding.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken ",
      "helpful_votes": 2,
      "publication_date": 20080323
    },
    {
      "title": "Great camera",
      "text": "Easy to learn, takes great shots, big enough to grasp easily and small enough to fit in most pockets. You can't go wrong with this Canon and their on-line support is five star.",
      "rating": 5.0,
      "verified": true,
      "author": "Vintage Racer",
      "helpful_votes": 0,
      "publication_date": 20121227
    },
    {
      "title": "Good Camera",
      "text": "It's a good camera, and takes great picture that doesn't require zooming. If you have to zoom, then it can only zoom very little. For $170 and sometime $150, this a good camera for that price. The sofware is such a hassled since it's not plug-and-play on vista or window xp. Basically, you would need to install the software on different computer to transfer the picture. To get around this stupid requirement, I had to buy a card reader so I don't have to worry about any kind of software installation.",
      "rating": 4.0,
      "verified": true,
      "author": "RemoBrian",
      "helpful_votes": 0,
      "publication_date": 20080210
    },
    {
      "title": "Small and quick",
      "text": "I love how small the camera is and it feels very sturdy, too. It starts up quickly which is a feature my last Nikon did not have. I'd definitely recommend it, especially the black model so it stands out from all the other silver ones in this world.",
      "rating": 5.0,
      "verified": true,
      "author": "HLB2016",
      "helpful_votes": 0,
      "publication_date": 20070506
    }
  ],
  "product_meta": {
    "title": "Canon PowerShot SD1000 7.1MP Digital Elph Camera with 3x Optical Zoom (Black) (OLD MODEL)",
    "description": "Color:BlackCanon PowerShot SD1000 7.1MP Digital Elph Camera with 3x Optical Zoom (Black)\n\nFROM THE MANUFACTURER\n\n\n Canon looked to the very first Elph for inspiration when designing the PowerShot SD1000 Digital Elph, and came up with a quintessential iteration of the icon: slim, clean-lined and fully flat. Inside, the SD1000 Digital Elph looks only to the future: 7.1 megapixels, a 3x optical zoom and advanced DIGIC III ensure top-quality images, while focus is fast and sharp and red-eye is automatically corrected. The large and more colorful LCD screen now has a tough, anti-reflective coating that makes it as durable as it is beautiful. \n\nPowerShot SD1000 Highlights \n\n\n\n1x zoom/3x zoom Slim, stylish 7.1-megapixel digital Elph with 3x optical zoom Great design is just part of the PowerShot SD1000 Digital Elph story. Inside is all the power you need to capture the moments of your life - beautifully. \n\nThe 7.1-megapixel CCD records a wealth of detail - enough to let you enlarge and crop at will. Images are rich and sharp with lifelike depth. The camera's Genuine Canon 3x optical zoom not only gets you in close, but performs with all the clarity and brilliance you'd expect from the world's leader in advanced optics technology. \n\nDIGIC III image processor with improved Face Detection and Red-eye Correction With DIGIC III, you get images of superior quality, the camera functions at top efficiency and battery life is significantly enhanced. What's more, DIGIC III enables Canon's newly improved Face Detection Technology and Red-eye Correction to give you better, more true-to-life people shots. Simply press the Shutter Button halfway down, and the PowerShot SD1000 Digital Elph automatically pinpoints the faces in the scene and chooses the ideal focus point. To keep every face looking bright and natural - without scary red eyes - the camera controls exposure settings and flash, so every shot is just what you were shooting for. \n\nFace Detection AF/AE finds multiple faces in the frame and sets the most suitable focus point, when the shutter button is pressed halfway. And an additional feature, Face Detection FE adjusts the flash, based on a person's face on the screen. Exposure and flash are controlled to ensure proper illumination of both the faces and the overall scene, eliminating the common problem of darkened or overexposed faces. Face Detection in action \n\nRed-eye Correction detects and automatically corrects red-eye during playback for both regular and flash photography. In unusual cases where red-eye is not automatically detected, it can easily be corrected manually during playback mode from the LCD screen. \n\niSAPS Technology is an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the fast DIGIC III Image Processor to improve focus speed and accuracy, as well as exposure and white balance. \n\nVivid, high-resolution 2.5-inch PureColor LCD The camera's 2.5-inch LCD screen gives you the big picture, whether you're shooting, reviewing or showing off your images. This extra-durable, high-resolution screen with tough scratch-resistant coating on the anti-reflective, PureColor LCD screen offers a crisp, clear picture to make shooting, playback and using the camera's menu functions especially convenient. Clear and bright, it also features Night Display for easy viewing in low light. \n\nISO 1600 and High ISO Auto to reduce image blur and expand low-light shooting capability The PowerShot SD1000 Digital Elph features new ISO 1600 and High ISO Auto settings that reduce the effects of camera shake and sharpen subjects in low-light situations, giving you greater flexibility for shooting. \n\nFive movie modes including 30 fps VGA, Time Lapse and Fast Frame Rate With a highly flexible movie mode, you can create the movie that's perfect for any application. Select from VGA (640 x 480 pixels) and QVGA (320 x 240 pixels), with frame rates of 30 fps and 15 fps for recording up to 1 hour or 4GB. Also choose from Fast Frame Rate (QVGA; 320 x 240 pixels) recording at 60 fps for up to 1 minute, Compact Movie Mode (QQVGA; 160 x 120 pixels) recording at 15 fps for up to 3 minutes, and Time Lapse (640 x 480) recording at 1 or 2 sec. intervals. The PowerShot SD1000 Digital Elph supports the USB 2.0 Hi-Speed standard, so you'll enjoy the fastest possible data transfer speeds when using a USB 2.0 Hi-Speed compatible computer. \n\nPrint/Share button for easy direct printing and downloading The PowerShot SD1000 Digital Elph's Print/Share button makes direct printing easier than ever. Simply connect the SD1000 Digital Elph to a Canon CP, Selphy or Pixma photo printer or any PictBridge compatible photo printer, press the lighted Print/Share button and print! Also use the Print/Share button to transfer images to a computer (Windows and Macintosh). \n\nPrint your own ID photos in 28 different sizes or use the Movie Print function to output multiple stills from a recorded movie on a single sheet with a Canon Selphy compact photo printer. \n\nDirect photo printers For desktop large-format printing, try one of the direct photo printers that allow you to print without a computer in one of two ways: plug your compatible PowerShot camera into the direct photo printer using the supplied USB interface cable, or simply insert a memory card into the supplied adapter. You can also connect the printer to your computer for more options. Print high-resolution, borderless images as postcards or 8.5 x 11-inch sheets within minutes. \n\nCompact photo printers Compact photo printers let you produce versatile, fun 4 x 6-inch postcards, 4 x 8-inch wide greeting cards or credit-card size prints in just two easy steps: connect and press print. Control the printer right from your camera's LCD screen. You get durable, dye-sublimated prints quickly with or without borders. Assorted paper types let you create mini or credit card size labels. You can even take select compact photo printers to a party or an outdoor picnic using an optional rechargeable battery.",
    "rating": 4.3,
    "feature_bullets": [
      "7.1-megapixel CCD captures enough detail for photo-quality 15 x 20-inch prints",
      "3x optical zoom; ISO 1600 and High ISO Auto",
      "DIGIC III Image Processor; Face Detection AF/AE",
      "Selectable shooting modes and special scene modes",
      "Print/Share button makes direct printing simple"
    ],
    "specifications": {
      "Product Dimensions": "3.39 x 0.75 x 2.13 inches",
      "Item Weight": "4.4 ounces",
      "ASIN": "B000NK8L6W",
      "Item model number": "1861B001",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.3 out of 5 stars967 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#222,417 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 25, 2003",
      "Manufacturer": "Canon"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": 59.95
  }
}