{
  "website_summaries": [
    {
      "verdict": "Excellent basketball for indoor use, but it does cost a bit more than much of the competition.",
      "pros": [
        "One of the highest-quality indoor basketballs available",
        "The microfiber composite leather cover has an outstanding grip that gives players the control they need for handling and shooting",
        "Available in both official and intermediate sizes"
      ],
      "cons": [
        "Expensive"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Best ball for indoor rec - but can get slippery.",
      "text": "Best ball for rec indoor basketball hands down. I've played with an NBA ball, the TF-1000 and the evolution. Everyone prefers the evolution although I prefer the NBA ball when things get sweaty. Reason being - When this ball gets wet, it gets wet. It will be slippery. You may want to get a towel to wipe it down if you have a few extra sweaty fellows.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 22,
      "publication_date": 20170709
    },
    {
      "title": "Check your quality Amazon - the folks at Wilson gave you a bad batch of balls.",
      "text": "I bought this ball recently and was extremely disappointed because it's not the same ball. The feel doesn't seem right when compared with the other evo balls at the stores. I've read the other negative reviews and thought maybe they had bad luck with it, but after trying it out myself, someone over there at Wilson definitely made a bait and switch. This feels like a cheap $15 ball.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20170918
    },
    {
      "title": "Poor quality",
      "text": "The seams are horrible. The leather is laid poorly and uneven. I’m sure I just got a bad apple but where as I’m in Iraq and it took a month to get here I’ll just have to buy another. There’s no good basketballs here so this one is above and beyond what we have. But definitely not inspected correctly as you can feel the leather and see it uneven along the seams.",
      "rating": 1.0,
      "verified": true,
      "author": "Regi",
      "helpful_votes": 6,
      "publication_date": 20180907
    },
    {
      "title": "Not impressed",
      "text": "Item came to me with multiple issues. Ball was not glued properly, so pieces of the corners were coming up. Valve wasn't properly seated in the ball... it was coming up out of the opening and it made the ball uneven. The ball barely holds air. I have to rump it at least once a week. I'm sure I received a defective ball because I've played with a ton of Evos and they've never been this bad. I finally went to a store near me and bought a different one - that one is near perfect.",
      "rating": 1.0,
      "verified": true,
      "author": "Sfojc",
      "helpful_votes": 4,
      "publication_date": 20190621
    },
    {
      "title": "Don’t get deal w/app.",
      "text": "Buy ONLY basketball. Run and hide from “free” 30 day app, which is a lie. I bought deal w/free app. for nephew. He never downloaded app., wasn’t interested. Amazon takes it upon themselves to turn free app. Into auto renew and charge your account/card every month, whether you downloaded it, wanted it or until you notice a $7.99 monthly subscription being charged. You have to figure out cancelling on your own. There are 100% free basketball apps in app stores-no fee and no subscriptions. Amazon, that’s what free is.",
      "rating": 1.0,
      "verified": true,
      "author": "SmoknU",
      "helpful_votes": 2,
      "publication_date": 20200207
    },
    {
      "title": "This ball will disappoint you. Mark my words",
      "text": "Beware! This ball is different than the ones that I have used before. The feel is different and does not bounce as well. Check the print by the valve. It is different from the original. Chex just get it from the store. You know what you are getting. You are paying more for this basketball because of the feel and bounce. This ball will disappoint you. Mark my words.",
      "rating": 1.0,
      "verified": true,
      "author": "Antenor Ostine",
      "helpful_votes": 8,
      "publication_date": 20171211
    },
    {
      "title": "Best basketball ever, until it gets stolen...",
      "text": "Best basketball there is... And everyone knows it, so make sure you write the owner's name all over it, in huge letters, with a phone number. My son's name was on it, but fairly small, and didn't seem to matter. It was stolen during a basketball game (probably from a disgruntled member of the team we beat). They should put a GPS tracking device in these things, or module like a \"Tile\" or \"Cube\" inside, so that you can activate it and make it start beeping loudly. I'd pay another $10-20 to have that (and I would appreciate some royalties from Wilson when they do it). :-) Great ball... just keep your eyes on it at all times!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian in The Tuke",
      "helpful_votes": 3,
      "publication_date": 20180404
    },
    {
      "title": "It was a poor value (in hindsight)",
      "text": "This ball never held air oversight since I bought it. I reluctantly kept it and continued to fill it up with air because it seemingly was a pain to send it back, but I am so irritated with the ball at this point. It was a poor value (in hindsight). I intend to send a letter to Wilson to see if they will replace it.",
      "rating": 1.0,
      "verified": true,
      "author": "Safety Guy",
      "helpful_votes": 5,
      "publication_date": 20180603
    },
    {
      "title": "Feels like a rock, tbh",
      "text": "Played college point guard and I can instantly tell the difference between a symmetrical ball and one that is lopsided. This one was STILL slightly lop-sided. Additionally, I've played w/ other wilson balls that had an amazing feel--this one felt like a rock, very hard, didn't have that sort of nice malleable feel to it. (The leather felt \"cheap\"--that's the best way I can describe it). It was \"okay\" but for the price I was expecting much better ($60.00). I also bought the spalding ball for $30 and this one has a way better feel--despite it being slightly lopsided as well. But I'd rather two spalding balls at $30/piece than one wilson at $60.00--so I'll be returning this one.",
      "rating": 3.0,
      "verified": true,
      "author": "NN",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Best Ball",
      "text": "Has insanely good grip on the ball and I really like the way the gold stand out against the black background. Overall would purchase again in a second. After handling this ball I really enjoyed it more than any other I've used. Baden's for me have been slick at the beginning and take a while to break in. Nike was also slick and was too hard. I am not trying to put the other products down but am simply comparing them to my experience with this ball.",
      "rating": 5.0,
      "verified": true,
      "author": "2Bueno",
      "helpful_votes": 3,
      "publication_date": 20171211
    },
    {
      "title": "Don’t bother picking a color.",
      "text": "Our boys play travel basketball, rec and school ball. We needed another outdoor ball and evo has always been our go-to. However, we ordered this ball in green and got blue. So my brother-in-law ordered one and had it delivered, in green, and AGAIN we got blue. So I can’t give any higher of a rating. If anyone that is looking to get a ball in their team color or one that stands out from your standard ball bouncing around the court, you won’t get that here. Two different Prime accounts and both with the same disappointment. The ball is still an evo so there’s that.",
      "rating": 3.0,
      "verified": true,
      "author": "Can7",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "I got a good one",
      "text": "I see reviews of people that get one from a bad batch, that wobbles or doesn't feel right. I would have preferred a ball with a different highlight color to make it easy to identify but there appearied to be a higher incidence of imperfect reviews. I'm very happy with the one I recieved.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel",
      "helpful_votes": 2,
      "publication_date": 20190204
    },
    {
      "title": "Write your name on this one, it's a great ball!",
      "text": "This is a great basketball. I bought it for my sons for Xmas. They played with it regularly at the YMCA in Charlottesville until it was stolen from there. A kid brought a Sharpie, crossed out my last name (written too small by my son) and wrote all sorts of other stuff on the ball. The guy at the Y refused to review the tape, choosing rather to cover for thieves. Write your name BIG on this ball if you'll take it anywhere thieves play.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael S.",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Quality ball.",
      "text": "Best ball in the game. I coach high school varsity and hold lots of workshops as well, so these balls get a lot of use from me and my boys. They hold up great with heavy daily use. That's important since I end up buying the balls myself for the school use.. Meant for indoor use only, and I have seen several reviews complaining they don't hold up outdoors. Please dont expect this to work on rough concrete!",
      "rating": 5.0,
      "verified": true,
      "author": "jonno",
      "helpful_votes": 2,
      "publication_date": 20200312
    },
    {
      "title": "I put my name on this one.",
      "text": "Looks, feels and plays like a Wilson. I have been hooping with this ball since I received it a few weeks ago and the feel of the cover just seems to get better and better each day. I may have lucked out considering all the complaints from some reviews. Just remember to not get it wet and only play with this ball indoors so it can last a long time. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "H3N S0L0",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Don’t feel the same as the one in store the leather coming out ready. I haven’t even  played on it",
      "text": "I bought this ball recently and was extremely disappointed because it's not the same ball. The feel doesn't seem right when compared with the other evo balls at the stores. I’m so Upset I paid $60 for this I could go and just put academy and spend less for a better quality and for better ball this is not right Amazon these balls are fake Check your product before anything plus shipping came in late so I am very upset about the fact I had to spend so much money",
      "rating": 2.0,
      "verified": true,
      "author": "adib",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Not the Wilson you know",
      "text": "I love Wilson evolution basketballs. They have been my ball of choice since I was 12. This experience was not typically what I expect from them. My ball is of poor quality as it is peeling at the seems and air hole is slightly elevated cause you to feel it when you shoot. These defects show more brightly after trying to play with this thing.This the first evolution ball I have brought that didn't last at least a couple of years. May have to move to Spalding or FIBA",
      "rating": 2.0,
      "verified": true,
      "author": "Jaylen Young",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Perfect",
      "text": "My son (13) loves this basketball. He says the coach always wants to use it for the game ball. However, his advanced skills coach says the most important thing to consider when buying a ball is buying one you're willing to use anywhere (indoors and out). He emphasizes the most important thing you need to do to get better is to practice. Inside, outside, everywhere you go. Get a $5 ball, wear it out and get another one. Having said that, I'm glad I got him the great quality ball for indoor bragging rights.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Campbell",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "It’s the best",
      "text": "My husband has played basketball since high school then college then on teams. He is now 75 and he plays 3 times a week at a gym with 25 yr old on up . He’s the oldest. And he will only use this ball. It’s the best",
      "rating": 5.0,
      "verified": true,
      "author": "Janine",
      "helpful_votes": 3,
      "publication_date": 20191114
    },
    {
      "title": "A great ball without breaking the bank",
      "text": "Overall this is a very good basketball and I am very satisfied with it. It is not as soft as I expected and as I have felt with other basketballs but still soft enough to give it a very nice feel compared with most other basketballs. Also, I have felt other evolution balls that were softer than mine so it is possible it will break in some more and get even softer (I have played with it about a dozen times already). Grip is great even with sweaty hands and has a great bounce to it (i.e. doesn't have that abnormally high bounce you sometimes get with other balls when driving fast down the lane). Definitely recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Zack",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "One of the best indoor basketballs ever.",
      "text": "Yes. Good ball. Best ball. Don't know how it is outdoors because I'm not the sultan of Agrabah and I don't have the riches of a nation to waste such an amazing high quality ball on the dirt filled floors of outside. Roadkill is found outside, why would you bring this ball to areas where roadkill happens? I heard that a plane crash outside. Not going to bring my 'Wilson Evolution Game Basketball' to a plane crash. NEVER EVER play with this ball outdoors. It is way too nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Cedric Dizon",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "The best game ball out there",
      "text": "The evolution has been around since I was in high school and I’m 38, now they’ve made the ball more appealing by having color options, making it easier not to lose when you use as a game ball. Great quality and came as described",
      "rating": 5.0,
      "verified": true,
      "author": "Julio Gallardo",
      "helpful_votes": 3,
      "publication_date": 20191021
    },
    {
      "title": "Do not recommend",
      "text": "I guess this ball has poor quality comparing other evolution BB balls. That is why it is a bit cheaper. It not very bounce and the leather is less comfortable. I do not recommend the colorful evolution balls to friends.",
      "rating": 3.0,
      "verified": true,
      "author": "Song Wu",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "When people want to use your ball during a game",
      "text": "I go to a gym that always has horrible basketballs laying around. I took an hour to research what I needed and found this ball. I needed something that would be indoor only, feel great in my hands, and not lose grip quickly. I don't ball too well, but it's really helped better my shot! Best part is other people wanting to use my basketball during pickup games.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Love the Colored Wilson",
      "text": "I really like the Evolution balls. We always use them in pickup/morning ball. I bought the colored blue one so I would be able to quickly Identify which ball was mine - works perfectly and everyone knows which ball is mine right away! Great buy. Would recommend! Red was out of stock when I bought it but Blue is a really nice royal blue color.",
      "rating": 5.0,
      "verified": true,
      "author": "Cpt. Blitz",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Definitely authentic. Great ball! Love the blue!!",
      "text": "I've owned three or four evolutions over the years. This one feels perfect. I always forget they feel a little stiff right out the box. Especially if the delivery was sitting on your front porch in dead of winter. But one day on the court and it feels just like it should. Shoots with sweet touch. And I actually like that it feels less marshmellow-like than they used to in the early 2000's. Great ball!! Love the bright blue logo!!",
      "rating": 5.0,
      "verified": true,
      "author": "Daddy of Twins",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Not the oringal?",
      "text": "This basketball is my favorite ball so I bought more. The ones I received are not as soft and even feel as if they are made out of a different material. I am confused and wonder if what they sell on Amazon are the defects that do no meet quality standards.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "They leak.",
      "text": "I love the ball I purchased 2 of them the past couple of years after a few months air leaks from the ball. You have to pump up every few days. Probably made in China now. I will now try to find an American made ball.",
      "rating": 1.0,
      "verified": true,
      "author": "Randy",
      "helpful_votes": 2,
      "publication_date": 20190724
    },
    {
      "title": "Probably the best ball I have ever owned",
      "text": "**update 5/26/17** Even better after being used for a while. It's now broken in and is the ball that is used for all pickup games at the YMCA. People get mad when I leave and they have to use a different ball! Just played with it for the first time. Probably the best ball I have ever owned. Excellent grip, very soft, came inflated to the perfect amount. If you don't mind paying a little for an indoor only ball - this is the one!",
      "rating": 5.0,
      "verified": true,
      "author": "EP4444",
      "helpful_votes": 3,
      "publication_date": 20170228
    },
    {
      "title": "Great ball, very bad durability and quality control",
      "text": "This is a great ball, don't get me wrong, it is by far the best indoor basketball I've laid my hands on. However, it is either low durability or bad quaity control, my ball has two peeled seams already. I only use it for indoors, and has never abuse it in anyway. I play about 2~3 times a week, around 90 minutes each time. The quality is just unacceptable for a ball like this. I would love to buy another one but if the quality is like this, i would stay away.",
      "rating": 2.0,
      "verified": true,
      "author": "James Li",
      "helpful_votes": 8,
      "publication_date": 20150606
    },
    {
      "title": "Okay Quality",
      "text": "Love the look of this ball, but the seams and quality were so much lower quality than their orange standard ball even though they are both a similar composite. Plus it costs the same amount, so I'd expect similar quality. If the build quality was the same, I'd give it 5 stars for sure.",
      "rating": 3.0,
      "verified": true,
      "author": "seanryan11",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Best indoor basketball",
      "text": "Great basketball. If you want the best indoor basketball around buy this. I love that they have different colors now. Bought these green ones because my daughter just going to high school and green is the main school color.",
      "rating": 5.0,
      "verified": true,
      "author": "Terri Wirgler",
      "helpful_votes": 3,
      "publication_date": 20200703
    },
    {
      "title": "Good design; Poor construct",
      "text": "I bought this because I liked the feel and handling ease when using my friend's evolution. The ball still works and I don't plan to return it, but the workmanship is off along several of the seams. Compared to my friend's ball, this one seems to have been poorly made. It still bounces well and isn't lop-sided, but I'm a bit disappointed in the quality as some of the seams protrude and will likely peel off soon.",
      "rating": 3.0,
      "verified": true,
      "author": "Stevoo",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Noticeably different from the Orange Evo.",
      "text": "I was really hoping the reviews were wrong and that this is the exact same ball as the orange one, but it is not. I can palm this ball much more easily than the orange one, and so that makes me think it is slightly smaller and stickier. I'm hoping to return this one for the orange one. The plus is the ball looks really cool, however it just is not the same quality and feel as the orange evolution.",
      "rating": 3.0,
      "verified": true,
      "author": "julian nunally",
      "helpful_votes": 3,
      "publication_date": 20180425
    },
    {
      "title": "One of the Best Basketballs, Period.",
      "text": "I’ve used so many balls but for some reason every time I play with an Evo I thought to myself I really wanted one but didn’t want to spend 50+ on a ball. Finally pulled the trigger and I’ve never been happier! If you ball, you know this is the coveted game ball when playing pick-up. Its got great grip and so far I’ve had no problems with it. Note: I do not recommend this for outdoors since I’ve played with one outside before and it picks up dust like CRAZY! Anyways if you ball indoors GET THIS BALL!!",
      "rating": 5.0,
      "verified": true,
      "author": "ibuytoomuchthings",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "I compared the Spalding WNBA and FIBA to Wilson Evolution.",
      "text": "love this ball over the others. Spalding WNBA, FIBA. The FIBA is the worst feel for me, felt cheap, yet it says leather but need to be broken in. The Spalding WNBA is second. Not as soft as Wilson, but close. The WNBA was $$$$$ compared to Evolution. The cover is nice and soft. Great for price.",
      "rating": 5.0,
      "verified": true,
      "author": "lisa spears",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Scarlet Red is NOT Scarlet Red, but DARK PINK",
      "text": "I ordered the scarlet red color for my son. The lettering is actually a dark pink and probably better suited for a girl. Its also made in Mexico, whereas the black lettered one (I bought in the store) is made in China. Funny as it may seem, the one from China seemed to be better quality than the one made in Mexico. Being that my son is more in touch with his masculine side, I had to return the PINK one and keep the black one I bought in the local store.",
      "rating": 2.0,
      "verified": true,
      "author": "DHicks1",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "I received the ball in the plastic bag",
      "text": "I have purchased this before but this time when I opened the package the ball was in the plastic bag. I am highly doubting if this is legitimate genuine Wilson basketball. It looks like its a cheap knockout from Chinatown.",
      "rating": 1.0,
      "verified": true,
      "author": "young",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Make sure you measure or compare with an official size. If that is what you paid for.",
      "text": "The ball was not official size. Ball was smaller than official size. Noticed it while compared with another ball that was official size. Also shoot around with the ball seemed different then. Past my 3 months return and realized too late for return...",
      "rating": 1.0,
      "verified": true,
      "author": "Momma meems",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Great basketball",
      "text": "Handling with the Wilson Evo is a pleasure because it is so soft and forgiving on your fingers. Other composite balls can be really tough on your hands and some balls can even scrape and cut your fingers. Not with the Evo, which is a pleasure to dribble and shoot with this beautiful blend of grip and accurate bounce characteristics. Your grip does change with additional sweating either, as the ball wicks moisture away from the seams. BTW, i love the way the seams are laid into this ball. It is perfect. This is a great ball and I highly recommend it even with the slightly higher cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Kanishka Ray",
      "helpful_votes": 0,
      "publication_date": 20161105
    },
    {
      "title": "still works great, I keep my ball indoors and take very ...",
      "text": "I have had this ball for over a year, still works great, I keep my ball indoors and take very good care of it. The ball has never had any leak problems , never developed lumps or had any leather peel off. Again, I keep it pretty protected but overall is a very nice tough ball. This basketball is a very good quality ball and feels nice to dribble and shoot. When I need to get a new basketball there is a very good chance I will buy this again, or another of the same brand. I recommend for players of any skill but suggest the use of it indoors for it to last a very long time.",
      "rating": 5.0,
      "verified": true,
      "author": "PointGuard23",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "Great ball",
      "text": "Needed a decent ball for my 4th grade son. Everyone tries to take this one at practice, including the coach lol I was super pumped to see it as a Black Friday deal (or Cyber Monday...one or the other). He keeps ending up on the ‘Celtics’ team so the green has been fitting. I didn’t necessarily want green but the sale was too good to pass up! It’s a great ball.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Grip isn't very good",
      "text": "I purchased 3 of these for my teenagers and they just aren't very easy to use... the grip isn't good at all. The ball is always slipping out of the player's hands on the court (all of the kids, not just mine). I was disappointed the grip wasn't easier to handle - especially for kids.",
      "rating": 3.0,
      "verified": true,
      "author": "Magnum",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Shades of color.",
      "text": "The basketball itself is amazing. Never new about the different colors. Decided to go with the Scarlet but turns out the pictures are not a direct representation of the actual color, silly me. The Scarlet is closer to pink than to red, much closer (think NFL breast cancer pink but matte), so it will be going back. As far as the value for money, Walmart has it for $10 cheaper.",
      "rating": 4.0,
      "verified": true,
      "author": "Sacred310",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "It's an Evo what can I say?",
      "text": "Needed another ball for indoor and looked at Walmart and here for the best price. Saw the blue lettering and the price at $30 and pulled the trigger. The delivery was quick and it came in the original packaging. Has help up nicely for the past year while playing 2 or 3 times a week.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Cantrell",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "My ball was sent lopsided.",
      "text": "When I first got the ball it felt lopsided so I thought I just needed to break it in. So I played with it for about 4 months now and it still feels the same. I’ve put air in it and deflated it like Tom Brady, but still the same results feels lopsided. I’ve played with other Wilson’s and they feel soft and they bounce right back to me. Kinda disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Kobe G",
      "helpful_votes": 2,
      "publication_date": 20190822
    },
    {
      "title": "Better than sanctioned NBA and NCAA balls",
      "text": "Best indoor ball, period. Widely used in HS leagues, it has the right amount of grip and \"soft\" texture without costing too much. We use it in pickup games at the gym roughly 5x/wk. Even as it wears down, it doesn't turn into junk. There were a couple of Spalding balls that I've come across and maybe a Baden that were decent, but it wasn't worth the effort to track them down when this is available.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil @ Amazon",
      "helpful_votes": 2,
      "publication_date": 20160819
    },
    {
      "title": "Good ball but not for everyone",
      "text": "Good quality ball. Bounce feels great when dribbling. Very easy to handle because of the soft, tacky cover. However for those who grew up loving the old Spalding TF (not the new one posing as a TF), the Wilson ball will feel a bit mushy. Most people like the ball but almost everyone comments about how soft it is. Some love it, and some hate it. I think it is a good ball, but you will always find someone in the gym or on the courts who make a comment about how they loathe the soft, mushy feel.",
      "rating": 4.0,
      "verified": true,
      "author": "Edwin Kim",
      "helpful_votes": 2,
      "publication_date": 20160126
    },
    {
      "title": "MUCH better than cheaper versions!",
      "text": "I don't know why, but you can tell a cheap basketball from a good-quality basketball easily. I originally bought my husband a basketball for his birthday that I got from Target for $25. Now, I love Target and normally love everything I get from there, but my husband didn't seem satisfied with it when I gave it to him. He told me to get this specific basketball instead and when it arrived, it was VERY obvious that this is a good basketball in comparison to the cheap one from Target. My husband plays basketball every morning and he LOVES this one! Would highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Britney B.",
      "helpful_votes": 0,
      "publication_date": 20161104
    },
    {
      "title": "Nice ball but Red (Scarlet) looks more Pink",
      "text": "I love these basketballs. It's the only ones I used and mostly everyone else too. I wanted a custom color to help distinguish my ball from others. I write my name on it too but the color helps prevent anyone else from accidentally taking it. However, the red looks more pink. Everyone that sees the ball, refers to it as the \"pink ball\" and not the red ball. Someone even called it the 'Breast Cancer Awareness ball\" lol. I wish they had a purple one since it was my school color. The quality of the basketball is as good as you'd expect, just be aware if you're getting the Scarlet color.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin W.",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Best basketball...hands down!",
      "text": "My husband has always gotten the Spalding TF-1000 basketballs but after shooting around with his friend's Wilson Evolution ball he had me go on Amazon to pick one up for him. It feels really nice in your hands when you shoot it and my husband swears all his shots are \"money\". Get the ball on Amazon because it's at a great price compared to getting them in the stores!",
      "rating": 5.0,
      "verified": true,
      "author": "mama227",
      "helpful_votes": 2,
      "publication_date": 20170112
    },
    {
      "title": "pathetic",
      "text": "What a joke. The ball comes in oblong, nothing even close to round. Highly recommend NOT buying this product. Ended up going to local sports store and buying replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "Rodney B Green",
      "helpful_votes": 2,
      "publication_date": 20190308
    },
    {
      "title": "Good basketball.",
      "text": "Very good basketball with a good feel. Only issue was the color is more like pink. Was looking for closer to red. The ball was for my daughter and she loves the ball, But she did make comment the emblem looks more pink (which she is not a fan of)",
      "rating": 4.0,
      "verified": true,
      "author": "Stu",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Watch out for fakes",
      "text": "After having this ball for over 2 years, this version isn't the same as the other evolution basketballs. It's slippery, harder and quality is not the same as other Wilson basketballs. I can only say this might be a fake one. The pic is a version of a real one that actually feels grippy and soft and nice. Sad that I got a knock off, you can def tell by feel.",
      "rating": 1.0,
      "verified": true,
      "author": "Donald",
      "helpful_votes": 2,
      "publication_date": 20191019
    },
    {
      "title": "Great ball but problem with valve.",
      "text": "Have to change my review to 1 star. I can no longer inflate the ball. Always properly stored inside and indoor use only. The needle goes in fine but cannot add air.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan Deer Park, IL",
      "helpful_votes": 6,
      "publication_date": 20170227
    },
    {
      "title": "Hard for others to steal",
      "text": "My 12 year old son loves this ball. After having two other evolution balls stolen I needed a different option for him. It stands out from all of the other evolution balls on the court so it’s easy to spot and harder for others to steal. Feels the same and performs the same as the orange evolution ball.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "So disappointed!",
      "text": "Seemed like it was going to be perfect for my son. We wanted a quality ball as he is getting now serious about basketball. I was reluctant to spend so much on a ball but did so because it seemed like it was going to be a great purchase. The ball was only used a handful of times and always needed pumped up. During tryouts for the travel team, the ball went flat and wasn't holding air. Nothing could be done. My son was so embarrassed and frustrated. He couldn't even complete tryouts because they aren't allowed to share balls due to COVID. Very disappointing!",
      "rating": 1.0,
      "verified": true,
      "author": "Marathon Mama",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Best Basketball",
      "text": "Other than an actual official NBA basketball, this is hands down the best basketball you can buy. I have had mine for many years now and it is still in great shape. It is strictly for indoor so do not take on the streets or the soft leather surface will be damaged. It has good feel, grip, seams, and durability. This is the ball everyone wants to use in a rec league or pickup game. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Trusted Reviewer",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "perfect",
      "text": "The evolution is a great indoor ball that has become more popular in the local gyms. I seem to have to get a new one every year from playing 3-4 times a week. I ordered the ball with the Yellow lettering. The yellow makes it easy to identify my ball at the gym, it looks cool when you shoot, great overall ball.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Walker",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Super awesome!",
      "text": "This is by far the best basketball for your money. It's not as cheap as some other ones, but when you play with it you'll know where your money is going. Takes some time to break in, but when it gets broken in it gets so nice, feels so nice and natural against your hands. Definitely helps with ball handling / touch for shooting. I used to use the Spalding TF-1000 and swore by it, but they have since changed the material and the ball is not as nice. Wilson Evolution has become my go-to ball for indoor use(don't use this outdoors). I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Yong L.",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "The best indoor and outdoor ball in the market",
      "text": "This ball is labeled as indoor ball, but it is actually the best outdoor basketball too. I am organizing an outdoor pick-up basketball social group; we bought different balls for testing. This ball blow all the others into the water for outdoor games. It is most durable, better than all others designed for outdoor balls; and offering great grips. Maybe a little expensive but worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry L.",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Quality basketball",
      "text": "I bought this to use in an indoor gym where I play basketball 3-4 times a week. It is a very quality basketball with amazing grip, and I like the color combinations as well. Everyone always wants to use this basketball to play",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Lacy",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Evo users are brain washed by the orange ball and cringe when they see the special edition thinking it’s a plastic ball.",
      "text": "I love the ball feels good and has perfect grip. It’s my new baby . I have to explain almost every time I play with it “It’s not plastic it’s the same composite material” some people won’t even try it. But that’s cool I know my ball from everyone else’s and I love Wilson Del Negro",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180203
    },
    {
      "title": "Terrible quality - very disappointed",
      "text": "I don't normally leave negative reviews but I spent a lot of money for a high-quality basketball and the quality was nothing near what it should be. The ball is hard and doesn't have much grip, I've compared with other Evolutions and they're very different than the one I got. I think it's true what other reviewers said that not all the basketballs are of the same quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190401
    },
    {
      "title": "Real deal, awesome basketball!!",
      "text": "Awesome basketball, got it for $42 but tbh I was kind of scared because it seemed that every review claimed the ball was “defective” or a “Bad batch” but as I received it I can confirm the ball is 100% authentic and great quality but keep in mind I got it directly from Amazon.com as the seller",
      "rating": 5.0,
      "verified": true,
      "author": "Jesus Sandoval",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Great Feel and Consistent Grip",
      "text": "The Evolution is a great ball. Anyone who plays indoors knows this ball. The grip is great. The bounce is great. Honestly the biggest problem I have with the ball is fear of it being stolen. ha ha. Obviously it's made for indoor use. But A good ball is totally worth the money if you don't abuse it. Haven't noticed any major issues with holding air or anything.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael C. Morgan",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Wilson Evolution basketball",
      "text": "This basketball is well worth the price. The grip, construction, and bounce of this ball are exceptional and better than expected. The feel and play of the ball off the floor and rim while dribbling and shooting is far above average enhancing the experience of playing the game of basketball. Would recommended this basketball for anyone looking for a high quality basketball without breaking the bank. Having used several different brands and types of basketballs in the past 35 years, I find this one to be the best I have used. We have used this basketball daily for about one month now and it still remains just like new.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 3,
      "publication_date": 20130107
    },
    {
      "title": "Great choice",
      "text": "I bought this basketball during the winter season last year to use for an indoor game for a rec league. Definitely lasted me the whole season, has a great amount of bounce too it and you're able to get a firm grip",
      "rating": 5.0,
      "verified": true,
      "author": "Durrell gresham",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Poor.",
      "text": "This deserves 0 stars. It is unfortunate to leave this review as previous wilson balls i have played with have been great, however, both balls I received, the original order and a replacement were both poorly put together. The seams were uneven or were off and the outter rubber or leather was coming off. I had to glue it back down.",
      "rating": 1.0,
      "verified": true,
      "author": "primetime",
      "helpful_votes": 5,
      "publication_date": 20170825
    },
    {
      "title": "The ball still looks like new. The grip is excellent",
      "text": "I've had this ball for a little more than a year. We play indoor with it 2 to 3 times a week for about 2 to 2.5 hours each. The ball still looks like new. The grip is excellent. Does a fairly good job at maintaining ball pressure. Definitely worth the extra money.",
      "rating": 5.0,
      "verified": true,
      "author": "T. West",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "Lopsided and defective or replica.",
      "text": "Pretty sure my ball is defective or a replica. I thought i was just overthinking it but in my league there’s at least 10 others with the same exact ball and all of them feel different and better than mine. Mine is lopsided and doesn’t bounce evenly, also seems a little heavier than the others.",
      "rating": 1.0,
      "verified": true,
      "author": "Jasraj",
      "helpful_votes": 3,
      "publication_date": 20180303
    },
    {
      "title": "The Best Ball",
      "text": "My local rec center uses these for their basketball program and will check them out to members during free play. Great ball, I hit more shots with it. Love the soft and grippy feel of it. I got the green one to stand out from the stock black letter ones at the rec center.",
      "rating": 5.0,
      "verified": true,
      "author": "Fer Jr.",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Great indoor men’s basketball!",
      "text": "This is the main basketball used at pick up leagues and gyms. 29.5 is the men’s version. If you shop around you can find less than retail but I wanted the ball now and didn’t want to wait. This ball is INDOOR only!",
      "rating": 5.0,
      "verified": true,
      "author": "Brett",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Indoor basketball should play indoor at the court for the longevity purpose",
      "text": "Indoor ball. The best use is indoor play. Played once in the park basketball court, I noticed the each edge connection(black area) has some wore. It’s not good for outdoor play. Don’t recommend play on the cement or hard surfaces.",
      "rating": 4.0,
      "verified": true,
      "author": "WannianGhost",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "The Best Indoor Ball IMO",
      "text": "This is my favorite indoor ball and is the gold standard in my gym. Occasionally we will use The Rock but I don't like it, the grip is not as good and I don't like the feel of it in my hands. I have also tried the Baden Elite - the grip on that is essentially too good, it feels sticky and does not release as well when you shoot. The Evolution is soft with the right amount of grip, and feels great to shoot. Of course, it does tend to get stolen way too much....",
      "rating": 5.0,
      "verified": true,
      "author": "An Amazon User",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "Best indoor basketball",
      "text": "Really the best ball there is for indoor basketball. It’s soft to touch, and retains air well. No Spalding can hold a candle to it. This made me a fan of Wilson balls. We typically bring this ball for shoot around, and somehow it always ends up as the game ball.",
      "rating": 5.0,
      "verified": true,
      "author": "Ross ",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Don’t get the color evolutions.",
      "text": "If you’re gonna buy this ball make sure you get the black one. If you get colored versions it’s cheaper quality and the edges peel. I felt the ridges and it wasn’t glued we’ll enough. I bought the black with gold version lettering instead and they are perfect.",
      "rating": 1.0,
      "verified": true,
      "author": "Roddy",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Indoor use only!!",
      "text": "This ball is perfect for indoor use only. Wears out tho after about 4-6mo if you play ball at least 3x a week. It will start to lose grip. At that point just get another one and donate the old one to a ymca or somn.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Best basketball on the market.",
      "text": "Better than the tf 1000. very good grip, do no pump the ball too much in the beginning. This will need to break in a little bit. A piece along the groove started getting loose after 4 weeks however it does not seem like a common issue. Indoor hooping is recommended. This is the ball everyone uses when playing pick up games, everyone who plays indoors knows about this specific ball. Sorry tf1000, during your hiatus in producing the original full leather ball, these have surpassed you as the preferable choice in basketball.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Tan",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "My favorite basketball, with custom colored lettering!",
      "text": "Most of the boys on my son's basketball team have Wilson Evolution balls -- all with the standard black lettering. Since our school color is green, I got him the ball with the green lettering, so he his stands out (and doesn't get accidentally picked up).",
      "rating": 5.0,
      "verified": true,
      "author": "Bohemeth",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Good ball",
      "text": "I'm very happy with this ball. Used it only indoor about 10 times, and still feels like its brand new. It feels super nice in hands, easily grip-able, and very light. You notice it quickly when you pick up another cheap ball on the court.",
      "rating": 5.0,
      "verified": true,
      "author": "Aleks",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Can’t beat it",
      "text": "I have yet to actually use the ball I received, but I have used Wilson Evolution balls before and they are the top of the top when it comes to indoor balls. I bought the yellow on discount and like that I will be able to use that to tell my ball apart from others.",
      "rating": 5.0,
      "verified": true,
      "author": "Christa Johnson",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Wilson Evolution - Buy it",
      "text": "Ball has a great grip to it whether or hands are all sweaty or not! I suggest this to the new Spalding TF 1000's by a long shot, and so do all my friends, as whenever I brought it to school, all the players on my team wanted to play with this for practice. I wouldn't suggest using it outside, as if dust gets onto it, it's impossible for you to grip the ball and dribble/shoot. Also it will wear down the materials faster. Great indoor ball, probably the best one, as it is always picked for game ball either in League games or Rec games.",
      "rating": 5.0,
      "verified": true,
      "author": "TheRightAnswer",
      "helpful_votes": 0,
      "publication_date": 20140814
    },
    {
      "title": "Great Basketball!",
      "text": "This basketball was recommended to us by our daughters basketball coach and we couldn't be happier with it. My daughter loves how it feels and performs for her in the gym and on the court.",
      "rating": 5.0,
      "verified": true,
      "author": "Radgear",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Authentic?",
      "text": "I have owned many basketballs over the year and many evolutions. His looks great but it is not as soft as the other evolutions I have had. The green has smeared on a couple of the letters and some of the panels seem to be coming up (very slightly). I’m not sure that this is authentic and would not buy again.",
      "rating": 3.0,
      "verified": true,
      "author": "Timothy C.",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "If you’re serious about basketball, get this ball",
      "text": "Wilson Evolution should be the only ball allowed into any gym.... and with the different color writing, I can now easily identify my ball alongst everyone else’s with the black letters.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon Mendez",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Black evolution is significantly lighter than the other color ways.",
      "text": "Bought the evolution because of past experience. Figured I buy the black edition so it doesn't get mixed up with people who have the standard colorway. For some reason this ball is significantly lighter than it's counter part. It also appears to be a bit smaller despite stating it is a 29.5. Would not recommend this product .",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Mostly Satisfied",
      "text": "Bought this ball and have loved playing indoor basketball with it so far. However, the stem has already started protruding. It hasn't caused any big problems yet that I have noticed but for the price of the ball, that should not happen. Other than that, I love the ball!",
      "rating": 4.0,
      "verified": true,
      "author": "Karen P.",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Very nice grip and worth every penny",
      "text": "I've never bought any other ball. Very nice grip and worth every penny. I'm usually skeptical when it comes to buying a good basketball and used to go to wal mart to get a cheap one. But I would have to say that every Wilson Evo ball I've ever purchased has never gone wrong. This is an inside court ball so obviously don't use it outside or it ruins the material. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan H",
      "helpful_votes": 2,
      "publication_date": 20161003
    },
    {
      "title": "Great Feeling Ball !",
      "text": "The ball has a great feel to it and is soft on the rim. I liked that I could select a color for the writing to have it stand out more in the gym since it's a popular brand I see out there in black text.",
      "rating": 5.0,
      "verified": true,
      "author": "Melky",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "A great indoor only basketball",
      "text": "My 14 year old son played with the Evolution for 3 years until he left it at our local YMCA. Bought this one with blue writing to make it more easily identifiable. Aside from durability it has great grip and is excellent for indoor courts.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Delivery",
      "text": "Says \"delivered today - handed directly to a resident\". Once we read that - we went to our front door and looked -- found the box sitting on our porch. Ball is great.",
      "rating": 3.0,
      "verified": true,
      "author": "Blanko",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Great Basketball",
      "text": "Very high quality. Plus, the fact that it's blue, I get people commenting on it all the time. And, I don't have to write my name or initials on the ball because everyone knows it's mine based on the color.",
      "rating": 5.0,
      "verified": true,
      "author": "philly the kid",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Great Ball -- Hard to Find Elsewhere",
      "text": "I purchased this ball from Amazon because it's practically impossible to find a good 28.5\" ball at the major retailers. Everyone else sells indoor-outdoor (I/O) balls that just don't cut it for competitive play for girls our boys 12 and under. I have used several full-size Wilson Evolutions, and they are the ball of choice at almost all courts. They bounce well, have a good feel, and great grip. They don't have the \"plasticy\" feel of I/O balls. If you're looking to purchase your daughter (or young son) an inexpensive basketball, go get an I/O ball for $20. However, if you want something that is enjoyable to use, the Wilson Evolution is absolutely the best bet.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Payne",
      "helpful_votes": 0,
      "publication_date": 20131227
    },
    {
      "title": "Love it",
      "text": "I chose green lettering to stand out at my gym from the other Evolution balls. Best decision ever, this ball is a staple, incredible for indoor gym use, after you use it a couple of hours it softens up and becomes perfect. My ball ends up getting chosen for literally every game played at the gym now.",
      "rating": 5.0,
      "verified": true,
      "author": "mgramz",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "The best indoor basketball you can get!",
      "text": "The Wilson Evolution is hands down the best indoor basketball I have ever used. I have played in a gym multiple times per week for years using this ball and it's still as good as the day I bought it. It has a fantastic grip that doesn't worsen over time and I rarely have to add air. If you're looking for a great basketball, spend the extra and get the Wilson Evolution, you'll be extremely glad that you did.",
      "rating": 5.0,
      "verified": true,
      "author": "MinifigFX",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Four Stars",
      "text": "Not exacly like the brown Wilson evolution ball but works almost as nice. Has more grip",
      "rating": 4.0,
      "verified": true,
      "author": "DLove",
      "helpful_votes": 3,
      "publication_date": 20180207
    },
    {
      "title": "Best Indoor Basketball EVER!!",
      "text": "This is by far the best indoor basketball! I've owned many of these Evolution b-balls. The composite feel is amazingly soft, especially after it has been broken in. Can't go wrong with the Wilson Evolution basketball!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tom V.",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Good basketball",
      "text": "Arrived on time and looks great is a good ball",
      "rating": 5.0,
      "verified": true,
      "author": "Larry Burns",
      "helpful_votes": 2,
      "publication_date": 20190428
    },
    {
      "title": "This ball doesn't hold air.",
      "text": "Nice ball, but needs to be pumped up each day. My boy takes it to the rec center to shoot hoops and four hours later is needs air again. I would send it back, but he doesn't want to be without a basketball while he is going to rec center.",
      "rating": 1.0,
      "verified": true,
      "author": "maryam wade",
      "helpful_votes": 0,
      "publication_date": 20180713
    }
  ],
  "product_meta": {
    "title": "Wilson Evolution Game Basketball",
    "description": "When you focus on getting better, and not just on getting results, success takes care of itself. That is why the Wilson Evolution Game Ball is the preferred basketball in high schools across the country. Every part from the moisture-wicking composite cover to the laid-in channels provides exceptional performance for those who aren't satisfied with being satisfied. Suited for indoor use, the Evolution is approved for play by the National Federation of State High School Associations (NFHS).",
    "rating": 4.7,
    "feature_bullets": [
      "THE #1 INDOOR BALL: The Evolution is the #1 indoor game basketball in America, on more courts than any other basketball",
      "SIGNATURE EVO FEEL: The soft feel that the Evolution basketball is famous for is due it’s Cushion Core Carcass, making the ball softer to the touch and easier to grip around the rim",
      "GRIP & DURABILITY: The Premium Evo Microfiber Composite Cover provides grip that players love and durability to last all-season and beyond",
      "ULTIMATE CONTROL: Laid-in Composite Channels create a consistent feel and texture over the entire surface of the basketball to provide unparalleled control",
      "NFHS APPROVED: Approved for play by the National Federation of State High School Associations (NFHS)"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "July 24, 2015",
      "Manufacturer": "WILSON",
      "ASIN": "B07NGZ74GJ",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Basketball",
      "Sports & Outdoors",
      "Team Sports",
      "Sports & Fitness",
      "Basketballs"
    ],
    "price": 64.99
  }
}