{
  "website_summaries": [
    {
      "verdict": "One of the best mid-range MIG welders on the market, with a reliable arc, fast setup, and strong welds.",
      "pros": [
        "Creates a solid, strong weld, particularly when repairing or installing auto body panels, owners find",
        "Wire feeding speed and temperature are easy to set",
        "Welder arcs “every single time,” owners find",
        "Fast setup out of the box"
      ],
      "cons": [
        "A few reported problems with the core wire feed",
        "Included welding shield is flimsy, users find",
        "Some reports of welder failing completely after a few uses"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It's perf",
      "text": "Solid welder. Body panel replacement, custom fabricating, roll cages, bumpers are something this welder can handle. You don't need another welder for simple DIY jobs than this. Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "John F",
      "helpful_votes": 94,
      "publication_date": 20150918
    },
    {
      "title": "Sparked a new delight!",
      "text": "I have always wanted to MIG/TIG things! Breaking a mount off my mower deck gave me the opportunity. But I never thought it was affordable or even accessible at my skill level. After a bunch of research on YouTube I went with this LE Handy Welder. Perfect for a beginner and this kit give you everything you need (I'd buy gloves and a better helmet for additional safety). Great product from a great company. Looking forward to breaking something else so I can practice my skills!",
      "rating": 5.0,
      "verified": true,
      "author": "FlyingArmy",
      "helpful_votes": 7,
      "publication_date": 20190619
    },
    {
      "title": "Everything you need in a box. Don't get me ...",
      "text": "Everything you need in a box. Don't get me wrong, the mask is a joke, but it still works.",
      "rating": 5.0,
      "verified": true,
      "author": "Bernit",
      "helpful_votes": 11,
      "publication_date": 20180426
    },
    {
      "title": "Great DIY welder",
      "text": "I am not a welder, but I always wanted one. I purchased this brand because a buddy that owns a welding shop, recommended this manufacturer. It is very simple to use and is pretty much a plug and play product. I was making my first welds in minutes after unboxing it. Presently, I have made a couple small items and a rack to store steel bar. The welds do not look great, but they hold. The welder works as advertised and for the DIY person looking for one to have in the garage, it is a great purchase...",
      "rating": 5.0,
      "verified": true,
      "author": "Hunter",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Good Little Welder",
      "text": "With a spool of good wire, this thing has the capability to make some good welds, however, it came with a spool of 0.030 wire, which is fine, except for the fact that the machine is only rated for 0.025 wire, but it came with 0.030. So it would have gotten 5 stars had it came with the right size wire and prevented me from buying a 10 pound roll of 0.030 wire. Other than that little hiccup, with 0.025 it works good, and is a great addition to any small shop or anyone who wants to get into welding",
      "rating": 4.0,
      "verified": true,
      "author": "Louis Choppy",
      "helpful_votes": 3,
      "publication_date": 20190918
    },
    {
      "title": "Great little Welder.",
      "text": "I bought this for my GF for Christmas and she loves it. Works great for small projects.",
      "rating": 5.0,
      "verified": true,
      "author": "Raserei777",
      "helpful_votes": 8,
      "publication_date": 20180228
    },
    {
      "title": "Good Welder",
      "text": "Haven't mastered the machine with nice beads yet but in time as I weld more feel it will happen. Had a couple adjustments which was able to figure out and really like this welder for the price ....I am sure the more I spend the better the welder would be but this one will do what I need to get done ..small around the house and body work type jobs. Did have the trigger stick which feed the wire out non stop and had to take the gun apart but it fixed itself it seems and works fine at this point. Very happy with the product at this time . thanks",
      "rating": 5.0,
      "verified": true,
      "author": "randy haller",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Not made in the USA !",
      "text": "This came damged which is gonna happen. I get that. The reason for the low review is because its made in poland and not in the usa like the description says. Its deceptive and needs to be changed.",
      "rating": 1.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 3,
      "publication_date": 20190806
    },
    {
      "title": "Unit is great, the extras ...not so much .😐",
      "text": "Unit works fine for it's size, the accessories are cheap novelties, they will work but you'll need to get some real equipment to use the unit properly. ie; helmet, adj. regulator, and of course a gas bottle. Then build yourself a nice welding cart... and life will be good 👍😎",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Awesome machine, works perfectly right out of the box!",
      "text": "Im a first time welder, i watched videos and read extensively on “how to” and I pulled this welder out of the box, installed the wire, and welded like ive done it all my life! Excellent machine, couldn’t be happier with how easy it is to set up and use right out of the box, its dummy proof and thats perfect for me !",
      "rating": 5.0,
      "verified": true,
      "author": "Richard C.",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Works well",
      "text": "Works great just wish duty cycle was a little better I suggest putting on it's own breaker and switch 20 amp breaker for 30 amp single pole",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Amazing",
      "text": "Amazing amazing welder for the money. Used it to weld in a new floor on a car I'm restoring. It's amazing!!!",
      "rating": 5.0,
      "verified": true,
      "author": "kim francis",
      "helpful_votes": 5,
      "publication_date": 20170725
    },
    {
      "title": "Great little welder",
      "text": "Ive had this welder for a few months now and love it. Better for small jobs aroind the garage, not meant to the pros. Plan on the gas conversion!! This really makes the welder fun to use.",
      "rating": 5.0,
      "verified": true,
      "author": "m j",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Made well",
      "text": "Works great easy to use and set up... Add said made in USA BUT it's really made in Poland .. At least it's not China",
      "rating": 5.0,
      "verified": true,
      "author": "paul long",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Decent",
      "text": "Welding with this unit is decent, but not a great welder little temperamental.",
      "rating": 3.0,
      "verified": true,
      "author": "Joseph H. Hallinen",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Worth the investment!",
      "text": "Amazing welder for the money! Bought a different $99 welder but needed to weld thinner steel and needed the welding gas connection on the Lincoln! Works perfect and easy to drag to small jobs!",
      "rating": 5.0,
      "verified": true,
      "author": "MH",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Love It",
      "text": "Bought this as my first welder. great price great product and easy to use for beginner. Product comes with everything needed to start welding.",
      "rating": 5.0,
      "verified": true,
      "author": "SuperNova",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Not to good performance on using step down transformer",
      "text": "This MIg weld is 110v, unfortunately don't have 110v power supply in my place so I used 5kva step down transformer it came not to good the performance.",
      "rating": 4.0,
      "verified": true,
      "author": "Rey",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "definitly worth the money",
      "text": "For a budget, entry level 120 volt welder, this little guy works excellent. I have a large wire feed mig that I use in my shop, but cannot move it around very easily for small jobs. this little Lincoln works better than I expected. I have only used it as a mig and not with flux core wire.",
      "rating": 5.0,
      "verified": true,
      "author": "Robb Z.",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "great for simple jobs",
      "text": "I purchased this welder for car body work and home projects. It is easy to use and solid. I built a stand for the welder out of an old bed frame in a few hours. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "axeman",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Grate machine",
      "text": "It is awesome Works well on everything I weld to include horse shoes and some 1/4” miled steel for the barn",
      "rating": 5.0,
      "verified": true,
      "author": "lori",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Great welder for the price!",
      "text": "The welder works great! I’m trying to figure out how to load the wire so it doesn’t come a little loose off the spool. I’m not sure if I’m doing something wrong or it has something to do with a little piece of it being broken off during shipping. The front of it got a ding in it to. It still works fine, but it is pretty obvious that there was some damage sustained during shipping.",
      "rating": 4.0,
      "verified": true,
      "author": "Gregory E.",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Recommend upgrading your helmet",
      "text": "The only thing I didn't like was the handheld helmet. Other then that works great for a variety of projects. Light weight easy to move around if needed. Doesn't take up much space and still works for everything I need. Great price compared to other products similar to it.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "110v with plenty of power.",
      "text": "Out of the box a good welder. Plenty of power for a 110v. No rush to get gas, the flux core works just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike B.",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "weld",
      "text": "works good helmet /face thing stinks got a good one .It paid for itself in all my exhaust work alone NICE BEAD GOOD WELDER",
      "rating": 5.0,
      "verified": true,
      "author": "scott b.",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Enjoying my welder",
      "text": "This is the perfect welder for my DYI projects. I have went through the first roll of wire with no issues. I did purchase a new welding hood (I like to weld with both hands free) Easy to set up and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Don D",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "electric welder",
      "text": "this was what I was looking for, does a great job got here fast",
      "rating": 5.0,
      "verified": true,
      "author": "Terry DePriest",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "I would recommend this to anyone who likes to weld",
      "text": "I would recommend this to anyone who likes to weld.and it will weld a lot more than it says on the ad...",
      "rating": 5.0,
      "verified": true,
      "author": "jackie dean",
      "helpful_votes": 5,
      "publication_date": 20150520
    },
    {
      "title": "great little welder",
      "text": "work good for around the house, it will weld up to 1/8 plate if prepped correctly",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "it welds",
      "text": "metal. very beginner level, wouldn't suggest use for thinner metals",
      "rating": 5.0,
      "verified": true,
      "author": "John Blewitt",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Great For the price.",
      "text": "I love it works great great for home use hobby. Works great on galvanized metal.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Love it for my jeep",
      "text": "I love this welder it's amazing I've had it for 3 years now and have burned at least 20 rolls of wire now still works great no issues ever",
      "rating": 5.0,
      "verified": true,
      "author": "Erik mullner",
      "helpful_votes": 2,
      "publication_date": 20160329
    },
    {
      "title": "Lincoln wire feed welder",
      "text": "No dislikes very nice machine. For what I will be doing this welder is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry Masoner",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Good value for the price",
      "text": "Works as advertised, still learning the finer points of welding and this is good value for the price. I would recommend getting a good welding mask, the one supplied is hand held and a bit cumbersome to say the least",
      "rating": 5.0,
      "verified": true,
      "author": "Erik Knapp",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Learning the. Hard way how to operate it.",
      "text": "Learning the . Hard way how to operate it. Very satisfied",
      "rating": 5.0,
      "verified": true,
      "author": "Benz",
      "helpful_votes": 0,
      "publication_date": 20161116
    },
    {
      "title": "Five Stars",
      "text": "Works like a champ and the guide on the door is spot on",
      "rating": 5.0,
      "verified": true,
      "author": "                         K",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "doesn't come with tank",
      "text": "Only piece not part of it is the argon cannister",
      "rating": 4.0,
      "verified": true,
      "author": "Forrest Martin",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Great home garage welder!",
      "text": "What can I say it's a Lincoln...Very nice for home use.",
      "rating": 5.0,
      "verified": true,
      "author": "Patti G.",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Four Stars",
      "text": "It's a good welder but its hard to set right.",
      "rating": 4.0,
      "verified": true,
      "author": "cole bishop",
      "helpful_votes": 3,
      "publication_date": 20151226
    },
    {
      "title": "Good quality",
      "text": "This mig welder is perfect for a garage welder for repairs, crafts, and projects. it welds very nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie M. Bair",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Five Stars",
      "text": "the best deal on a quality 120 volt mig welder",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas Ginoza",
      "helpful_votes": 3,
      "publication_date": 20150216
    },
    {
      "title": "Great deal.",
      "text": "Simple and easy to use. Some extra parts needed to make things easier. But totally worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan C Baker",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Excellent first welder",
      "text": "I LOVE THIS THING. Excellent baby's first welder. Ive used mostly flux core with it because idgaf about spatter. Even runs stainless flux good at the higher settings. Using this welder I recently welded subframe connectors under my car. The duty cycle is rated pretty low but I was zapping well well well beyond it with no breaks on the 3/4 setting. Throw the face shield away.",
      "rating": 5.0,
      "verified": true,
      "author": "Cole",
      "helpful_votes": 2,
      "publication_date": 20180625
    },
    {
      "title": "Love this welder",
      "text": "I read all the reviews on this product before I bought it. There weren't any really bad ones and you won't get one here. I am restoring a 1960 MGA and needed something to weld automotive sheet metal. I will be able to do more than that. Glad I decided to go with Lincoln. What a smooth easy to use welder. I thought I would have to get a lease and use co2 or argon for MIG welding the sheet metal but the inner shield works fantastic. This is a super little unit!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory J. Marler",
      "helpful_votes": 36,
      "publication_date": 20110615
    },
    {
      "title": "This is a nice little welder but the hood is a joke as ...",
      "text": "This is a nice little welder but the hood is a joke as well as the chipping hammer. Come on Lincoln, throw a guy a bone.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 9,
      "publication_date": 20160326
    },
    {
      "title": "Price, easy to use",
      "text": "Everything was i had expected. Very easy to use. I used to weld on my tractor, parts that had broken.",
      "rating": 5.0,
      "verified": true,
      "author": "Pete Antulov",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Good delivery time",
      "text": "Perfect machine for my needs, personally I do recommend 100%",
      "rating": 4.0,
      "verified": true,
      "author": "Greg Ramirez",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "awesome welder, setup was easy",
      "text": "awesome welder, setup was easy, the welding mask it comes with is flimsy, spend the extra money and pick up an auto darkening mask at the same time you order this. included everything beside the bottle of shielding gas.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff M.",
      "helpful_votes": 5,
      "publication_date": 20170205
    },
    {
      "title": "Great for auto restore",
      "text": "Love this mig..with a little practice you can weld like a pro",
      "rating": 5.0,
      "verified": true,
      "author": "Glen Baugher",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Is the best accuracy machine in 120v",
      "text": "Is the best accuracy machine in 120v. I'm love that little machine for weld mufflers exhaust and other thin materials",
      "rating": 5.0,
      "verified": true,
      "author": "Raphael Rondon",
      "helpful_votes": 0,
      "publication_date": 20170516
    },
    {
      "title": "beauty.",
      "text": "This little welder works like a dream. I fixed a couple of problems on my truck with it, and plan to build a portable saw mill this summer. It's perfect for the job.",
      "rating": 5.0,
      "verified": true,
      "author": "JT Sather",
      "helpful_votes": 5,
      "publication_date": 20140611
    },
    {
      "title": "works great! my first time welding since high school ( ...",
      "text": "works great! my first time welding since high school ( i am 23) bought it so i can weld some body panels in my ae86 after a hit and run.. ready to go out of the box with flux core.. i bought some different wire to see the difference but the lincoln wire it comes with works great! no complaints at all.. gunna need a welding mask and some gloves (got my mask at home depot for 99$ and got lincoln gloves on amazon for 7.99$ cheaper than home depot!)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20160303
    },
    {
      "title": "I at ready used this machine is very good and powerful and easy to use thanks very much ...",
      "text": "I at ready used this machine is very good and powerful and easy to use thanks very much Amazon making me very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Rafael Brenes",
      "helpful_votes": 0,
      "publication_date": 20150729
    },
    {
      "title": "couldn't be happier..",
      "text": "Wow... couldn't be happier.... this is my first welder, and glad I did my research... I am in the finish stages of welding up my own BBQ smoker pit!!!! This thing will do 1/8\" steel ALL day long. If your looking for a 110v/20a welder Super happy... PS, the welding shield sucks... find a mask UPDATE After 2 years and a ton of projects. (Probably 30 pounds of wire used) still going strong. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 2,
      "publication_date": 20160425
    },
    {
      "title": "NICE cheap welder for light jobs",
      "text": "LOve the welder now, got a little thing tweaked and it is a great little portable welder!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Is my other ride",
      "helpful_votes": 0,
      "publication_date": 20111127
    },
    {
      "title": "Five Stars",
      "text": "Great Machine, set up quickly, no issues welding SCH 40 pipe. Awesome, good job Lincoln!",
      "rating": 5.0,
      "verified": true,
      "author": "michael a gauthier jr",
      "helpful_votes": 3,
      "publication_date": 20160306
    },
    {
      "title": "Husband was really excited when surprised with this.",
      "text": "My husband is so happy to have his first welder at home. The shield pictured is a joke though, you have to hold it in front of your face, not sure how you weld and hold that, but we bought helmet for him to use. Welder works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsee",
      "helpful_votes": 11,
      "publication_date": 20170612
    },
    {
      "title": "Five Stars",
      "text": "great welder does everything I want todo. would recommend to anyone great vendor too.",
      "rating": 5.0,
      "verified": true,
      "author": "ted johnson",
      "helpful_votes": 0,
      "publication_date": 20151024
    },
    {
      "title": "Five Stars",
      "text": "Works Awesome !!!!!!Tacking Exhaust Leaks,Snugging up Shock Mounts, real Versatile....",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy Bonz",
      "helpful_votes": 0,
      "publication_date": 20161106
    },
    {
      "title": "UNBELIEVABLE!!!!!!!",
      "text": "All I can say is unbelievable. It will weld anything no problem plenty of power. It runs real smooth with the Lincoln .035 gasless wire. This is the best 115 volt welding machine I have ever used. Very, very pleased. Exceeded expectations. If you use a extension cord it must be A 10 Gauge 115 Volt 25 amp Cord On A 20 Amp breaker or you will keep tripping your breaker. I made a little video on YouTube to show how good it welds. Just search for Lincoln Electric Handy Mig. and find the video by Steve Medsker. You will be pleasantly surprised.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve M",
      "helpful_votes": 9,
      "publication_date": 20150425
    },
    {
      "title": "Four Stars",
      "text": "Extremely handy tool in our small equipment repair shop. Thanks for the quick ship.",
      "rating": 4.0,
      "verified": true,
      "author": "doug buss",
      "helpful_votes": 2,
      "publication_date": 20150824
    },
    {
      "title": "Five Stars",
      "text": "Works great, have u see it several times so far",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "Great little welder.",
      "text": "Everything I expected. Does a great job for what I use it for. Never had a problem with Lincoln products.",
      "rating": 5.0,
      "verified": true,
      "author": "alton allen",
      "helpful_votes": 0,
      "publication_date": 20151104
    },
    {
      "title": "This is the best thing since sliced bread",
      "text": "This is the best thing since sliced bread. I have a stick welder and have done a lot of welding mostly for myself. But this is probably the easiest welder do make a nice weld with that I have ever used.",
      "rating": 5.0,
      "verified": true,
      "author": "pat",
      "helpful_votes": 2,
      "publication_date": 20150317
    },
    {
      "title": "Awesome!",
      "text": "Bought for my fiancé for his birthday ... he loves it! It's simple enough for an amateur welder but his experienced buddies said they would love to own it too! I definitely did good with this gift!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20161115
    },
    {
      "title": "Must Have Must Get Welder.....lasts for years!",
      "text": "Husband was surprised but I had to make sure it was a surprise....thankfully I was at home when this was delivered. It was a Christmas Present....UGH...but he LOVES LOVES LOVES this welder and our son who has one stated this was an awesome deal for this welder. So happy they are happy and great service. Came pretty quick. Only suggestion would be if this is a gift that you allow for that choice and maybe send in brown wrapper or box?? Otherwise..thanks for an awesome welder!",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki",
      "helpful_votes": 3,
      "publication_date": 20150402
    },
    {
      "title": "Great welder",
      "text": "I bought this welder, and after a few hours practice was able to really get the hang of it. it is reliable, strong and easy to use. My first welder but am now doing what I wanted, which is making garden art, doing odd jobs around the shop, built a welding cart..etc. I recommend this product. I have bought a welding helmet as the hand held shield they provide is not really practical as it is hard to weld one handed.",
      "rating": 5.0,
      "verified": true,
      "author": "Melody Parr",
      "helpful_votes": 8,
      "publication_date": 20110904
    },
    {
      "title": "Highly recommend",
      "text": "Been through 3 tanks of gas already and the MIG works great! Forget about the face shield and buy a good auto darkening helmet, and you're set! LOVE IT!!",
      "rating": 5.0,
      "verified": true,
      "author": "Joey L.",
      "helpful_votes": 0,
      "publication_date": 20150104
    },
    {
      "title": "Pretty Lukewarm",
      "text": "I have loved everything that I've ever used that was from Lincoln Electric in the past. I'm going to be honest though, I just like this. A poor craftsman blames his tools, I know, but seriously, I cannot get this thing to run really nice beads. No particular thing that I can think of that seems off, it just refuses to weld consistently and cleanly on any surface that I've tried. I think it's fine for doing a little tinkering around in the shop, but I would never use this if the welds had to show and look good.",
      "rating": 4.0,
      "verified": true,
      "author": "Drewbles",
      "helpful_votes": 3,
      "publication_date": 20171208
    },
    {
      "title": "Review",
      "text": "Very good for the price. Wish it could handle thicker gauge but what do you expect for this. Used it for sheet metal repair and was very good. Didn't seem to get a good feed w the smaller gauge wire tho. I used the .035",
      "rating": 4.0,
      "verified": true,
      "author": "Mike waschenko",
      "helpful_votes": 0,
      "publication_date": 20171007
    },
    {
      "title": "Good quality welder for light weight jobs",
      "text": "shipped within 2 days std. shipping. Good quality welder for light weight jobs. I haven't welded with a wire welder before.. Refurbished an old smoker. Spent $100 on metal, thermometer, and paint. Like new. Saved $150 by redoing someones junk. Yep, I'm satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "mark magnani",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "Great welder. So far I have done only light ...",
      "text": "Great welder. So far I have done only light steel fabrication but it has been very easy to use and reliable. Practice. Practice is the key. Wire speed is key also. Take you time nd hractical",
      "rating": 5.0,
      "verified": true,
      "author": "The Schaf",
      "helpful_votes": 5,
      "publication_date": 20140821
    },
    {
      "title": "Five Stars",
      "text": "great price for a Lincoln welder!! does exactly as it should",
      "rating": 5.0,
      "verified": true,
      "author": "missy4366",
      "helpful_votes": 0,
      "publication_date": 20141226
    },
    {
      "title": "Took about 2 minutes to set up and once I got the temp and fees right it works perfectly just what I wanted i couldn't be happie",
      "text": "So I purchased this welder and it arrived to my home faster then any package I've ever ordered. Took about 2 minutes to set up and once I got the temp and fees right it works perfectly just what I wanted i couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl Johnson",
      "helpful_votes": 0,
      "publication_date": 20150610
    },
    {
      "title": "Highly recommended for first time welders like me",
      "text": "I was up and making my first welds in minutes. Highly recommended for first time welders like me.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 2,
      "publication_date": 20140825
    },
    {
      "title": "Five Stars",
      "text": "Awesome welder. I use it mainly for sheet metal welding, it does a great job.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Fawcett",
      "helpful_votes": 0,
      "publication_date": 20150616
    },
    {
      "title": "Great buy",
      "text": "Every thing it says it is welded my brothers rocker panels on his jeep and repaired my exhaust works great",
      "rating": 4.0,
      "verified": true,
      "author": "Charles Rickey",
      "helpful_votes": 4,
      "publication_date": 20140611
    },
    {
      "title": "Four Stars",
      "text": "It does the job that I need it to do very well.",
      "rating": 4.0,
      "verified": true,
      "author": "CT",
      "helpful_votes": 0,
      "publication_date": 20150830
    },
    {
      "title": "freak-en sweet!",
      "text": "One word, \"AWESOME!\" as described and everything you would expect in a name from Lincoln, Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170806
    },
    {
      "title": "welder",
      "text": "easy to use. easy to move. Works great, just what I was looking for. Would recommend it to anyone looking for a welder. fast shipping too",
      "rating": 5.0,
      "verified": true,
      "author": "G. Champion",
      "helpful_votes": 4,
      "publication_date": 20120716
    },
    {
      "title": "Big bad little engine that could.",
      "text": "This has got to be one of the best deals for price, workability, everything; it is awsome you can do whatever big heavy stuff, little thin stuff, and body and fender work E-Z, welding up exhaust systems perfect..... i was supprized, i made my own cart for mine and bought a different mask, the only thing you need is your wall socket (buy a tank use the gas way better welds) a few practice runs BOOM your a PRO. They wanted $480 for this welder at a PRO shop $359 shipped is a steal.",
      "rating": 5.0,
      "verified": true,
      "author": "joyce kahn",
      "helpful_votes": 17,
      "publication_date": 20110917
    },
    {
      "title": "Three Stars",
      "text": "Did not come with everything shown. Only the actual welder.",
      "rating": 3.0,
      "verified": true,
      "author": "sunnysaja23",
      "helpful_votes": 7,
      "publication_date": 20151102
    },
    {
      "title": "Great quality and power",
      "text": "First timer welder, this has been a blast to teach me some basics coupled with YouTube. Great quality and power.",
      "rating": 5.0,
      "verified": true,
      "author": "THEBOUNCEHOUSE",
      "helpful_votes": 10,
      "publication_date": 20170807
    },
    {
      "title": "Dont waste your money",
      "text": "My unit arrived, a friend who is welder help set it up. And bought me my argon/co2 gas cylinder. He started to to weld and it would not run a bead. He went through all the settings iaw with manual and trouble shooting section. Still no luck. Am in process of returning for refund.",
      "rating": 1.0,
      "verified": true,
      "author": "kevin",
      "helpful_votes": 12,
      "publication_date": 20170212
    },
    {
      "title": "Worked great 5 times then died.",
      "text": "Worked good for a short period of time then died. The control board went bad and haven't been able to find another. Replacement parts for this unit are impossible to find.",
      "rating": 2.0,
      "verified": true,
      "author": "Ronald Byron",
      "helpful_votes": 8,
      "publication_date": 20150305
    },
    {
      "title": "Three Stars",
      "text": "I'm still trying to figure out the settings on this one so far no lock",
      "rating": 3.0,
      "verified": true,
      "author": "Armando",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "\"Almost Perfect\"",
      "text": "Have not used it yet. Everything arrived as promised, Although, the only issue was; \"One of the plastic spools that the rolled welding wire comes on was broken. I'm hoping this won't be a issue and will turn and feed the wire smoothly enough when used.\"",
      "rating": 4.0,
      "verified": true,
      "author": "jack alvarez",
      "helpful_votes": 2,
      "publication_date": 20150428
    },
    {
      "title": "Where do I get parts?",
      "text": "Spool that holds wire broke the first time I added wire.",
      "rating": 3.0,
      "verified": true,
      "author": "c02398",
      "helpful_votes": 2,
      "publication_date": 20160831
    },
    {
      "title": "Becareful of shipping.",
      "text": "The item was ordered as a prime item however it took a week to come in. That wouldn’t really be a big deal for me if the welder didn’t come in smashed. I don’t recommend this product, I will be returning this.",
      "rating": 1.0,
      "verified": true,
      "author": "Brenden",
      "helpful_votes": 6,
      "publication_date": 20180729
    },
    {
      "title": "Five Stars",
      "text": "very poor welder can only weld for about 2 minutes then shuts down or trips the breaker",
      "rating": 5.0,
      "verified": true,
      "author": "ronald paugh",
      "helpful_votes": 0,
      "publication_date": 20151002
    },
    {
      "title": "great welder",
      "text": "Great little welder I'm just beginning to dabble in welding so I don't know a whole lot on the matter but so far what I can tell is the welder works great I've had other welders that were not as good I only rate four stars because I have yet to connect gas to it but I'm sure with the gas it will perform even better and be worthy of a five star rating",
      "rating": 4.0,
      "verified": true,
      "author": "kevhart",
      "helpful_votes": 5,
      "publication_date": 20120329
    },
    {
      "title": "Traded for Millermatic",
      "text": "Traded it for a Millermatic. No fine adjustment and can't weld over 16 g. Poppers 20 amp breaker way too often.",
      "rating": 1.0,
      "verified": true,
      "author": "Phillips Project Management",
      "helpful_votes": 8,
      "publication_date": 20141230
    },
    {
      "title": "Damaged welder",
      "text": "Unpack the welder today and notice a big dent and scratches on the front panel",
      "rating": 1.0,
      "verified": true,
      "author": "Tim Mahaney",
      "helpful_votes": 17,
      "publication_date": 20170413
    },
    {
      "title": "No power, bought a year ago and have used ...",
      "text": "No power, bought a year ago and have used 2-3 times. Motor is out on it and I'm out $400. Don't buy it.",
      "rating": 1.0,
      "verified": true,
      "author": "Jodi",
      "helpful_votes": 8,
      "publication_date": 20150315
    },
    {
      "title": "SUCKS!",
      "text": "this welder was well below my expectations! It will barley even weld sheet metal. If I could get my money back I would!",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick hoeltge",
      "helpful_votes": 9,
      "publication_date": 20140908
    },
    {
      "title": "Good quality welder",
      "text": "Good little welder for small jobs around the shop. Light weight and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan Calhoun",
      "helpful_votes": 0,
      "publication_date": 20190419
    }
  ],
  "product_meta": {
    "title": "Lincoln Electric K2185-1 Handy MIG Welder",
    "description": "This Lincoln Electric Handy Mig Portable Welder is a compact, lightweight welder that makes a great choice for home repairs and hobby projects on light gauge mild steel. Amps 70, Cart Sold separately, Clamp Cable Length ft. 8, Power Cord ft. 8, Regulator and Gas Hose Included No, Shielding Gas Required Yes, Weld Thickness in. 1/8, Mig Ready Yes, Welding Wire Diameter in. 0.035, Wire Feed Speed Control Adjustable, Weldable Metals Mild steel, Dimensions L x W x H in. 12 3/4 x 8 3/4 x 18, Volts 115, Duty Cycle 20 @ 70A. Welds up to 1/8in. mild steel Operates off any 115V, 20 Amp household outlet Amperage output 35-88 20 duty cycle @ 70 Amps Cold contactor safety feature keeps welding wire electrically cold until gun trigger is pressed Adjustable wire feed speed control Welds both MIG shielding gas sold separately and flux-cored 6 ft. power cord and 8 ft. clamp cable 12.8 in. L x 8.8 in. W x 18 in. H Includes welding gun and cable assembly, work cable with clamp, gasless nozzle for flux-cored welding, gas nozzle, gas regulator, hose for MIG welding, 1-lb. spool of 0.035 in. flux-cored wire, 2-lb. spool of 0.025 in. solid MIG wire, three 0.035 in. contact tips, three 0.025 in. contact tips, welding handshield and chipping hammer/brush Factory shipped see order form\n\nFROM THE MANUFACTURER\nInterested in welding? Ready to try your hand at wire welding? Have we got the welder for you - the Handy MIG from Lincoln Electric! This compact, portable and lightweight wire feed welder plugs into a 115V, 20 amp outlet and is user friendly. Four voltage settings and continuous wire feed speed adjustment allow you to weld mild steel from 24 gauge to 1/8\" thick. And, it's easy to get started since practically everything you'll need to MIG weld is in the box - gun and cable assembly, work cable and clamp, gas nozzle, gas regulator and hose, spool of solid wire, contact tips and hand shield with filter plate and lens. Just add a cylinder of shielding gas. But that's not all - there's also a spool of self-shielded, flux-cored wire, contact tips and chipping hammer/brush so you can use your Handy MIG to weld with gasless, flux-cored wire too.",
    "rating": 4.5,
    "specifications": {
      "Is Discontinued By Manufacturer": "Yes",
      "Product Dimensions": "18 x 10.3 x 16.75 inches; 26 Pounds",
      "Item model number": "K2185-1",
      "Department": "Unisex-adult",
      "Date First Available": "April 29, 2004",
      "Manufacturer": "Lincoln Electric",
      "ASIN": "B000QFNZ74",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}",
      "GTIN": "618119680022 , 031112514819 , 015082774350 , 031113147931 , 100069774062 , 782386239785"
    },
    "categories": [
      "Welding Equipment & Accessories",
      "Tools & Home Improvement",
      "Welding & Soldering",
      "MIG Welding Equipment",
      "Industrial & Scientific",
      "Welding Equipment"
    ],
    "price": 447.48
  }
}