{
  "website_summaries": [
    {
      "verdict": "The HP Deskjet 6940 isn't a top-of-the-line inkjet, but with its affordable price, networkability, and decent print quality, it's a good choice for students in a dorm room and budget-conscious home office users.",
      "pros": [
        "The HP Deskjet 6940 is network ready, has a PictBridge port for PC-free photo printing, is compatible with both Windows and Mac PCs, and is backed by generous support options"
      ],
      "cons": [
        "An autoduplexer and a larger input tray will cost you extra, and the HP ink is expensive",
        "If you switch often between document and photo printing, you'll spend a chunk of time changing out ink tanks, too"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 7.0,
        "Performance": 7.0,
        "Support": 8.0
      },
      "publication_date": 20060802,
      "rating": 7.1,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Compact & inexpensive color printer",
      "text": "Bought this to replace a Dell 810 all-in-one printer that malfunctioned after less than two years. I would have given the product 5 stars except that the installation instructions for Windows XP are unclear and we encountered problems because we used the CD that came with the unit (CD was for Vista--that little devil of an operating system). Once we figured out that the CD was not necessary for Windows XP all went well. We had excellent technical support from HP in helping us resolve the initial problem. Bought this HP as the third desk side printer in our office when color printing is wanted. We have three of them now and so far, so good.",
      "rating": 4.0,
      "verified": true,
      "author": "The Gabster",
      "helpful_votes": 0,
      "publication_date": 20081116
    },
    {
      "title": "Best ink jet printer I have used",
      "text": "This is a workhorse of an ink jet. I have never be disappointed with the quality of the color printing this HP does. I like it that it is not an all-in-one. It's a printer and I don't have to worry about some other part of the equiipment - like a copier or a fax - decides to die. It's a little thing but the flat top makes this thing easy to place on a flat surface and then is a flat surface for putting another piece of equipment on top. I have used more expensive printers at work but the color this one produces is better.",
      "rating": 5.0,
      "verified": true,
      "author": "Grace O",
      "helpful_votes": 0,
      "publication_date": 20121110
    },
    {
      "title": "Have to return",
      "text": "I ordered this printer becaurse it was the same one I had before that I liked. It arrived all taped up and had obviously been returned before It was missing the quick start poster and went installed to my computer would not print no matter what I did. The printer stated it was not compatible with my computer even though I had used this same printer for years. I think HP printers are fine, but this one was a \"reject\" that must have been used before . Pages were ripped from the reference guide, and the product registration card was missing also.",
      "rating": 1.0,
      "verified": true,
      "author": "Niki Niksa",
      "helpful_votes": 0,
      "publication_date": 20130127
    },
    {
      "title": "Not a good purchase",
      "text": "I am very frustrated with this printer and support from HP. If I had kept the original packaging, I would have sent it back long ago. The printer doesn't \"pull\" the paper properly so every sheet has a trail of black marks which renders it useless for anything you want to hand out. Secondly, the black ink blobs on the page. When I went to HP for help all they could say was, \"use another cartridge\". Since I was using a new cartridge straight from their manufacturer this also frustrated me. I've changed cartridges with no change in quality. If I were you, I'd look at another printer.",
      "rating": 2.0,
      "verified": true,
      "author": "Wayne Hastings",
      "helpful_votes": 3,
      "publication_date": 20081126
    },
    {
      "title": "Quite expensive for a used printer",
      "text": "Quite pricey for a used printer, but works really well. No issues so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Awesome!!!",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Very Pleased",
      "text": "I'm a history buff so I print out multi-colored pages of text and photos, B&W as well as color. This printer does a good job, spits out the pages quickly, with good tonation. I like the B&W photos, with an excellent gray scale. HP makes good printers (although Canon & Kodak seem to have a good reputation amongst computer people). It's very quiet and starts printing almost immediately. (My old RX500 used to resentfully groan whenever I told it to print.) It sets up with a CD, very easy to do. The price is quite nice for the quality. Because it's an ink jet printer, I give it 4 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Casan",
      "helpful_votes": 0,
      "publication_date": 20080815
    },
    {
      "title": "An Honest Mistake",
      "text": "The order for this printer was delivered in good time and good condition. However, my wife, who ordered the product realized, on delivery, that she wanted an all-in-one printer instead. We simply rebundled the printer in its original box, obtained a return label through Amazon's web page and dropped the parcel off at the mail store. Within a few days our Visa account was credited with no questions asked. I will never worry about ordering through Amazon again, honest mistakes may be made in ordering and Amazon understands this. Amazon are good people to do business with. We have since ordered and had delivered a different all-in-one printer that more suits our needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter G. Elston",
      "helpful_votes": 0,
      "publication_date": 20090401
    },
    {
      "title": "printer",
      "text": "This has got to be the deal of the century! The 6940 is a work horse and one of the best printers HP ever built. Sadly they have replaced it with a \"NEW UPGRADED\" better one (and we all know what that means - new design on the outside - fewer features on than what you had - cheaper mechanicals and software that won't give you what you used to have). So this is the best deal I have ever seen with an HP. (Coulda been packed better but nothing was broken so no complaining).",
      "rating": 5.0,
      "verified": true,
      "author": "GK",
      "helpful_votes": 0,
      "publication_date": 20130708
    },
    {
      "title": "Works great",
      "text": "Works great. A little more scuffed up than expected, but works great which is more important. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry A. Marchewka",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "HP Deskjet 6940 Color",
      "text": "I received this order today 1. It had no power cord, 2. The lid that lifts to put in the printer jets Hing was broken 3. No setup disk. 3. The box it was shiped in had no protection inside. Parts of the printer was all loose inside the box. The printer was used,but very good. West Electronics sold this printer I can not use this printer. I`m not going to return the Printer. But from now on Anything I order from WEST Electronics that I see on AMAZON I dont not touch. I know its not your problem because I orded the Printer Used. Thank you George Bell.",
      "rating": 1.0,
      "verified": true,
      "author": "George Bell",
      "helpful_votes": 0,
      "publication_date": 20121122
    },
    {
      "title": "Great product & fast print jobs!",
      "text": "I purchased this printer for my parents after my 10 year old HP Desktop printer finally quit working. I love this printer! So fast, great quality, not that my old printer wasn't good, it was, but the new one is soooo much better! Yay, technological advances! The only downside is the power button. I have to press it very firmly, three times for it to go off! I don't understand the logic in that, but that is the only defect. I would recommend this product for even the semi-pro users who need a crisp, quality print out.",
      "rating": 4.0,
      "verified": true,
      "author": "G. Jernigan",
      "helpful_votes": 0,
      "publication_date": 20090604
    },
    {
      "title": "this is the best home printer available",
      "text": "IMHO .. this is the best home printer available. Hook it up to your PC via Parallel, USB, or BlueTooth. Easy to change ink cartridges.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward Shaw",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Great printer for the price.",
      "text": "Durable and trustworthy. I used it for about 2.5 years while working out of my car. Never had an issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Stallcup",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Great Printer",
      "text": "I've owned 3 of these printers and they are all great. My first one lasted ~5 years and it was used daily. My second one is in it's 3rd year and my 3rd one is in my office. Easy to hook up, quick and good print quality. Not something with a lot of different features which is an added bonus. I like a printer to be a printer, not a gadget that does 15 things. You can;t go wrong with this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul W. Borden",
      "helpful_votes": 0,
      "publication_date": 20130308
    },
    {
      "title": "Wish they still made these",
      "text": "2 2 of HP Deskjet 6940 Color Printer (C8970A#B1H) Sold by: Amazon.com LLC $105.99 Condition: New Loved these printers so much we bought all we could find before they all left the shelves. these two particular ones are the last ones we could find, back in 2012.",
      "rating": 5.0,
      "verified": true,
      "author": "Chucker53",
      "helpful_votes": 0,
      "publication_date": 20170525
    },
    {
      "title": "solid, basic HP printer",
      "text": "Basic printer, solid features and well made as are all HP printers.. Software is fine for 'family stuff' too bloated for me to bother with, I just install drivers, works fine without all that stuff HP includes. For well under $100 I have never had a complaint with HP printers and the print quality on this one is much better than I would expect for the price. As for Amazon service; if it comes from Amazon directly and not a vendor, the delivery time is fantastic and quick.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20090829
    },
    {
      "title": "Junk!",
      "text": "You cannot count on HP quality. If you get a good one, this product is fine (or so I assume based on positive reviews). I wasn't so lucky and just completely wasted my money. Pro's: easy to set up as network printer Con's: print quality is horrendous (even at the highest print quality settings), almost unreadable; it's exceptionally slow too. This printer is not usable! Very frustrating.",
      "rating": 1.0,
      "verified": true,
      "author": "JH",
      "helpful_votes": 10,
      "publication_date": 20090207
    },
    {
      "title": "used but in good condition. Some of the \"blemishes\" mentioned in the ...",
      "text": "The printer is exactly as advertised, used but in good condition. Some of the \"blemishes\" mentioned in the description cleaned off with some 409 cleaner, it setup with no problems, and and it operates just like a new one, so I am very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Ranchero_Dave",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "HP6940 Versatile",
      "text": "I bought this printer (6940) as a future back-up machine to a workhorse 6540 that is still going strong after 5+ years of moderate-heavy use. I've also previously purchased two others of this same model (6940) for family members, because it uses the same ink cartridges as my old machine and I've found reloading the ink cartridges myself fairly easy and very economical, using ink purchased online. With all family members on the same cartridges, it's easy to have extras ready to go. The printer is a real bargain, and I use an HP Wireless Printer Upgrade Kit to use it wirelessly.",
      "rating": 5.0,
      "verified": true,
      "author": "David J. Katterhenrich",
      "helpful_votes": 4,
      "publication_date": 20100719
    },
    {
      "title": "super  color  printer",
      "text": "We bought two...one to replace our home printer when it died...and another to have on hand when it or the office when goes. Great color quality...fast black printing...and a very functional slot for printing envelopes. I like that it is not an \"all in one\"...less things to go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "teamminsky",
      "helpful_votes": 0,
      "publication_date": 20140203
    },
    {
      "title": "Great printer",
      "text": "Great printer with built in networking. But certainly not worth the absurd high price for a new one, find a good used one and you will pay a lot less.",
      "rating": 5.0,
      "verified": true,
      "author": "paulywogTop Contributor: Model Airplanes",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Love this printer!",
      "text": "I had an Epson Stylus printer that was an absolute ink guzzler. My husband had this HP Deskjet 6940 and rarely had to replace his ink cartridges even though he used his printer more than I did!!! So I got myself one and have loved it. It puts out quality copies (both B&W and color), is easy to use and it even produces great photos even though that is not what I normally use it for.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Mancarella",
      "helpful_votes": 0,
      "publication_date": 20110420
    },
    {
      "title": "It works!",
      "text": "It is used but works great! It was only one of a few that would work with the machine I hook it up to, so I'm very happy. They even included ink. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Pauline Weichler",
      "helpful_votes": 0,
      "publication_date": 20161108
    },
    {
      "title": "HP Deskjet 6940 printer",
      "text": "I believe this is one of the best work horse printers for the value. This is the second one I have had, I purchased the first one four years ago and it had worked perfectly untill the end of June 2010. It is also hooked into my home network thru the \"network connection built into the printer\", so all the computers can access and print. I also purchased the add on so you can print on both sides of the paper, which I transfered to the new printer with no problems. I give this product \"five stars\" and as long as they are available, I will use this printer.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim L.",
      "helpful_votes": 3,
      "publication_date": 20100718
    },
    {
      "title": "This model is one of the few that you can ...",
      "text": "This model is one of the few that you can refill ink cartridges . Performs well...I have 2 of these units that are over 2 years old no problems at all. I print over 1000 pages per month .... It's a real work horse",
      "rating": 5.0,
      "verified": true,
      "author": "HJC",
      "helpful_votes": 0,
      "publication_date": 20141115
    },
    {
      "title": "Wouldn't print!",
      "text": "It did NOT work, I had a xcomputer tech hook it up and it would not print. I had bought 2 brand new ink cartridges from HP ($88.00) and the printer would not print. The shipping CO busted the box all up, and I am having to get a new box to return it. Since I rarely get out of the house, I am trying to get someone to gat me a box to return it. I belive the shipping co messed it up, they had the box sitting on it's end when I got home and the box was all crushed!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20141127
    },
    {
      "title": "Broke after less than 1 year of very casual use",
      "text": "God help you if you need warranty repair from HP. The wait is 4 hours long. I like HP products, but that is not a way to treat customers. My printer broke 5 days before warranty expired. HP had warranty date based on when they shipped the printer to Amazon! A nightmare to get service.",
      "rating": 1.0,
      "verified": true,
      "author": "E. Kaufman",
      "helpful_votes": 4,
      "publication_date": 20091116
    },
    {
      "title": "This item arrived with one cover missing, did not ...",
      "text": "This item arrived with one cover missing, did not connect to printer ever, on/off switch was defective, and finally the return policy is that you pay for the return shipping. Lousy deal !",
      "rating": 1.0,
      "verified": true,
      "author": "Jorge G.",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Nice looking printed page but temperamental in network mode.",
      "text": "Prints a high precision page, but will goes into standby when cartridges are replaced. Disconnecting power cord does not help. The next day it will reset. Also, occasionally, this printer locks up and can only be reset by again disconnecting the power cord.",
      "rating": 2.0,
      "verified": true,
      "author": "Fledermaus",
      "helpful_votes": 0,
      "publication_date": 20121230
    },
    {
      "title": "Like an Old Friend",
      "text": "I had an HP 6540 for over five years when it quit working. Cost me approximately $20 per year including the first set of cartridges. I found the HP 6940, discovered it was nearly identical, and bought it. I connected it to my Windows 7 PC and before I could check on anything a box popped up telling me my printer was ready to go. And it really was. I print documents and some photos and am satisfied with the quality.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Harding",
      "helpful_votes": 5,
      "publication_date": 20100819
    },
    {
      "title": "normal printer",
      "text": "Simple printer, normal print quality, not good for color print, noisy and slow. not convenient for double-sized print. I would prefer a printer with scanner. The wireless function is great, but must attach with the router, it limits the printer location.",
      "rating": 3.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 0,
      "publication_date": 20111204
    },
    {
      "title": "deskjet printer",
      "text": "this is the third 6940 printer I've bought for my business since i really like 'em - the ink cartridges are VERY affordable - it's not the fastest printer out there but very good quality & all we use is black - very seldom do we need to print color",
      "rating": 5.0,
      "verified": true,
      "author": "Roadking",
      "helpful_votes": 0,
      "publication_date": 20130227
    },
    {
      "title": "This printer soon developed a leak in the ink trays ...",
      "text": "This printer soon developed a leak in the ink trays that made a huge mess and I ended up throwing it into the trash soon after getting it. A piece of junk , do not buy.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20151019
    },
    {
      "title": "HP printer",
      "text": "Was looking for a light duty printer to work with Vista and would fit in a small space. This HP does both. Came with disk for Vista drivers although HP rep said they would have to be downloaded. Set up easily and ready to print. I don't plan to use network capability but this one does it easily. Some confusion when printing envelopes as you get an error message but ignore and it prints fine. Quiet and efficient for limited jobs. Have not changed ink yet the lower the price the faster the ink goes!",
      "rating": 4.0,
      "verified": true,
      "author": "Harold L. Heidmann",
      "helpful_votes": 0,
      "publication_date": 20080303
    },
    {
      "title": "Review of HP 6940 Printer",
      "text": "The 6940 is a very good printer. It does jobs quickly and reliably. In fact, I now have a total of four (4) 6940's hooked up with my different computers. It is my standard printer, and the bonus is that I only need one set of cartridges to purchase, because they will fit any one of them when needed. Surprisingly, HP has kept the 6940 in production for several years which is very unusual. In the past I was forced to buy a different printer every time one had to be replaced. The 6940 is really good at its job and I am gratefull that HP is keeping it available so long.",
      "rating": 5.0,
      "verified": true,
      "author": "Uncle Mike",
      "helpful_votes": 0,
      "publication_date": 20081122
    },
    {
      "title": "HP Deskjet 6940 - Excellent Value",
      "text": "Excellent value for around $125. Multiple quality settings. \"Best\" quality more than suitable for professional business proposals, etc. Black & color cartridges, easy to install. Reliable - Daily use for 2 months and have not yet experienced a paper jam. Recommended!",
      "rating": 4.0,
      "verified": true,
      "author": "Jeffrey C. Fegely",
      "helpful_votes": 0,
      "publication_date": 20070627
    },
    {
      "title": "This is a great printer. Received in great condition box to product",
      "text": "Is exactly the same as the ancient one we had that died. This is a great printer. Received in great condition box to product.",
      "rating": 5.0,
      "verified": true,
      "author": "noname",
      "helpful_votes": 0,
      "publication_date": 20150118
    },
    {
      "title": "Will not fully work with Windows 7",
      "text": "Watch out if you have Windows 7. You can download the drivers from HP for Windows 7 and it also has a Windows 7 update too. Thing is is that the toolbox is not part of the Windows 7 and you can't align or clean the print heads at All! Don't know what HP is thinking?!",
      "rating": 2.0,
      "verified": true,
      "author": "Michael McLoughlin",
      "helpful_votes": 3,
      "publication_date": 20110523
    },
    {
      "title": "Deskjet Color Printer",
      "text": "Love this printer... easy to use... great for printing greeting cards and envelopes... reasonable price. I had an earlier model for a few years, and when I needed to replace it, I was happy to find a newer model of the same printer.",
      "rating": 5.0,
      "verified": true,
      "author": "Palm Breeze",
      "helpful_votes": 2,
      "publication_date": 20101018
    },
    {
      "title": "baaaaaad product",
      "text": "HP used to make a good printer. now we have an hp graveyard in our office of four pritners less than 2 years old and each each broke within a few months. two were expensive -- then we switched to the cheap models. the cheap printers last for two years, now it is months. one never worked. getting hp to stand behind it is a problem. now we buy canon. sadly, it is not double sided but at least it runs.",
      "rating": 1.0,
      "verified": true,
      "author": "Cat Smiles",
      "helpful_votes": 2,
      "publication_date": 20081023
    },
    {
      "title": "HP Deskjet Printer",
      "text": "Can't give a review because I can't get it to work. I followed the instructions and it will print out a page from the printer itself but not from the computer. I have to find time to investigate and try to resolve this problem.",
      "rating": 3.0,
      "verified": true,
      "author": "bonita gomez",
      "helpful_votes": 0,
      "publication_date": 20110627
    },
    {
      "title": "works great and the price was excellent",
      "text": "Came on time, as advertised, works great and the price was excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "J Omalley",
      "helpful_votes": 0,
      "publication_date": 20160301
    },
    {
      "title": "I would buy this again.",
      "text": "The price was great and this printer performs very well for my needs. The color is excellent and the ink cartridges which came with the printer are lasting a long time considering the amount of printing that I have been doing. Putting in the two ink cartridges is very easy. I wanted a printer that did not have the five or six cartridge set-up.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie Griffin-Woodring",
      "helpful_votes": 23,
      "publication_date": 20070307
    },
    {
      "title": "Good cheap printer.",
      "text": "Set this up on my network with ease. It works fine, I got it from the new and used section for about 65 bucks, not bad. Also, to save money I suggest the refurbished or refilled ink cartridges.. much cheaper.",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20080307
    },
    {
      "title": "We have two other same model printers and were looking ...",
      "text": "We have two other same model printers and were looking for one to give to our daughter. It's very reliable.",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20150502
    },
    {
      "title": "Perfect",
      "text": "I am not tech savvy so I was looking for easy set up and use. This fits the bill. No problems at all. Good clean printing and copying. I didn't even need the directions to figure out how to use it, the screen is easy to read and follow directions",
      "rating": 5.0,
      "verified": true,
      "author": "Gavelgirl",
      "helpful_votes": 0,
      "publication_date": 20130416
    },
    {
      "title": "HP Deskjet 6940 Color Printer (C8970A#B1H)",
      "text": "i thought i already did a review hav ehas it now a couple of years a great printer as its my 3 hp printer th eother 2 were warn out.",
      "rating": 5.0,
      "verified": true,
      "author": "Louise N. Raymond",
      "helpful_votes": 0,
      "publication_date": 20130704
    },
    {
      "title": "Great printer",
      "text": "Overall-great printer...which is why I ordered the same exact kind that I had before. Thought that one quit working...but turns out it wasn't the printer, it was the cord I think...not sure yet. Three years of lots of printing and no problems. Works great. The other one will go with an older pc in the office, as it still works. Uses two cartridges. One color, one black. Haven't tried the camera print feature yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie G Rumer",
      "helpful_votes": 0,
      "publication_date": 20111222
    },
    {
      "title": "HP Deskjet 6940",
      "text": "So far, this printer has worked flawlessly. Print quality is very good. It engages the paper sheets properly, so when printing 3-to-a-page checks, everything is properly aligned. I have used it for printing label sheets, and again it grabs the heavy sheet properly so the labels are printed nicely. As with all printers, the ink cartridges are overpriced.",
      "rating": 4.0,
      "verified": true,
      "author": "D Evenson",
      "helpful_votes": 0,
      "publication_date": 20071006
    },
    {
      "title": "Great Printer",
      "text": "This is a good economical printer. Purchased as a gift and still going the distance. Always counted on HP and they deliver.",
      "rating": 5.0,
      "verified": true,
      "author": "EBC",
      "helpful_votes": 0,
      "publication_date": 20130614
    },
    {
      "title": "HP Deskjet 6940",
      "text": "Had a problem getting the printer on line. Also, information for setting up the printer was not included. I have had to call HP 3 times to get the printer working properly.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert Warder",
      "helpful_votes": 2,
      "publication_date": 20090713
    },
    {
      "title": "Very pleased.",
      "text": "It is my second HP DeskJet printer, and I have always enjoyed using them. The quality is excellent and they last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon L. Crowder",
      "helpful_votes": 0,
      "publication_date": 20130808
    },
    {
      "title": "Thanks!",
      "text": "The printer was easy to install and works like a charm. Our tech support was very pleased with the ease of handling. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "HerbnBet",
      "helpful_votes": 0,
      "publication_date": 20120702
    },
    {
      "title": "Network Printer",
      "text": "Needed a networked printer, found this one at a great price. Very happy with all aspects of this printer, would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20111012
    },
    {
      "title": "Great printer",
      "text": "This is one of the best printers I have ever owned. It is quiet, tough, does a great job and was inexpensive. I now own three of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary L. Bieler",
      "helpful_votes": 0,
      "publication_date": 20100612
    },
    {
      "title": "Get one while they last",
      "text": "My old HP DeskJet 6940 finally reached the end of its useful life and I found there was nothing comparable on the market with which to replace it. HP has discontinued them and they are no longer in the stores, but available on-line. I purchsed another new one from Amazon and am very happy with its perfornmance. Don't hesitate to buy one if you can still get it.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred",
      "helpful_votes": 0,
      "publication_date": 20100219
    },
    {
      "title": "HP6940 Deskjet",
      "text": "This is an excellent printer for office workstation use. I just hope this model is available in the future when we need to replace other obsolete printers. The HP5600 is a wonderful printer too, it's just that you cannot get them anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Harris",
      "helpful_votes": 0,
      "publication_date": 20070831
    },
    {
      "title": "Good value",
      "text": "Not the most expensive, not the cheapest - A good, solid value for its middle-of-the-road pricing. Easy to use, easy to set up. No complaints after one month of use.",
      "rating": 4.0,
      "verified": true,
      "author": "PA shopper",
      "helpful_votes": 0,
      "publication_date": 20081203
    },
    {
      "title": "printer",
      "text": "Love this printer. I bought one and my sister bought 3 of them. Great price for a nice printer for household use.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20090904
    },
    {
      "title": "printer mania",
      "text": "We had need of printing sheets of labels in a pharmacy. This printer model works well for this ad hoc printing. And the ability to color coordinate our labels has made life easier with less human error!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Parkinson",
      "helpful_votes": 0,
      "publication_date": 20110927
    },
    {
      "title": "Printer",
      "text": "Nice printer that didn't include a USB connector but otherwise a good price at less than $100",
      "rating": 4.0,
      "verified": true,
      "author": "Gary R. Salisbury",
      "helpful_votes": 0,
      "publication_date": 20100502
    },
    {
      "title": "Awesome printer",
      "text": "Awesome printer for the price! Great quality printing compared to some much more expensive printers.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Frey",
      "helpful_votes": 0,
      "publication_date": 20090205
    },
    {
      "title": "HP DeskJet 6940 Color Printer",
      "text": "I'm very satisfied with the printer. Excellent print quality in both black and color. Easy to set up and use. Excellent overall quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed W.",
      "helpful_votes": 0,
      "publication_date": 20070823
    },
    {
      "title": "HP Deskjet 6940",
      "text": "Excellent product for the price. Easily installed and operation has been perfect to date. Would definitely purchase again, but since my last HP deskjet lasted for so long I probably won't have to.",
      "rating": 4.0,
      "verified": true,
      "author": "Dick T.",
      "helpful_votes": 0,
      "publication_date": 20090406
    },
    {
      "title": "Great printer",
      "text": "A wonderful printer. Setup was easy and fast. Prints with good color and resolution. A little work horse.",
      "rating": 5.0,
      "verified": true,
      "author": "Geraldine A. Hegeman",
      "helpful_votes": 3,
      "publication_date": 20080729
    },
    {
      "title": "HP6940 Printer (WORK HORSE)",
      "text": "I use several HP 6800-6900 Series printers. They have been very reliable for past 5 years. Print everyday at work. I finally gave up on the cheap department store models. Got this HP6940 for home and it works great. Only regret is not doing it 5 years and 7 printers ago.",
      "rating": 5.0,
      "verified": true,
      "author": "GB-BDFL",
      "helpful_votes": 0,
      "publication_date": 20110908
    },
    {
      "title": "Great Printer",
      "text": "This is a great printer. It is a little slower in printing the page than I thought it would be. But it is solid as a rock. No trouble so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Malinda H. Lowrance",
      "helpful_votes": 0,
      "publication_date": 20080831
    },
    {
      "title": "Fast printer for business documents",
      "text": "This is a great printer which prints fast in normal mode. It will also print on very small envelopes and note cards (as it can handle small photographic paper as well). I do not use it for photographs/photo paper, so I cannot comment on those features.",
      "rating": 5.0,
      "verified": true,
      "author": "Madness",
      "helpful_votes": 2,
      "publication_date": 20070118
    },
    {
      "title": "HP Deskjet 6940",
      "text": "Purchased used and re-furbished. Was in the same condition as my original and everything works great... Delivery was a little slow, but other than that all was good...",
      "rating": 4.0,
      "verified": true,
      "author": "Giles Turgeon",
      "helpful_votes": 0,
      "publication_date": 20140310
    },
    {
      "title": "Good printer but wireless problems",
      "text": "Printer works fine but I constantly have problem with wireless connection. I do not use wireless feature at all any more.",
      "rating": 4.0,
      "verified": true,
      "author": "Jure Marijic",
      "helpful_votes": 0,
      "publication_date": 20131013
    },
    {
      "title": "Printer is Great!",
      "text": "Product as advertised. No problems on delivery. Very satisfied! Would recommend to anyone desiring a printer that will print banner letter paper.",
      "rating": 5.0,
      "verified": true,
      "author": "Texas Bluetick",
      "helpful_votes": 0,
      "publication_date": 20140401
    },
    {
      "title": "Frustrated...",
      "text": "I currently have two of this particular printer in my office. I know that the printer works well and is exactly what I need. This printer, however, has worked just one day since I've had it out of the box. I've gone through various steps to try troubleshoot but without success. I purchased my other printers from Staples which I could easily make a return to if I had problems. I feel stuck with the non working printer with no real way to return it. In the future I would think twice. I guess I'm just frustrated.",
      "rating": 2.0,
      "verified": true,
      "author": "Savy Shopper",
      "helpful_votes": 0,
      "publication_date": 20101221
    },
    {
      "title": "Slow print speed... everything else is good",
      "text": "Great value if print speed is not too important... much slower than previous model. But overall it works fine & save $$",
      "rating": 3.0,
      "verified": true,
      "author": "Jonathan Duong",
      "helpful_votes": 0,
      "publication_date": 20111015
    },
    {
      "title": "HP Deskjet 6940 Color Printer (C8970A#B1H)",
      "text": "Really rue the day I bought this printer. The print quality is cheap. No way to adjust or clean the heads. It is constantly running out of ink. I bought this for the little printing I do at home. Total waste!",
      "rating": 3.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20110504
    },
    {
      "title": "HP Deskjet 6940 Printer",
      "text": "We do outdoor events and this printer is a workhorse. I own 7 of these and I highly recommend it for anyone wanting a robust printer that prints fast.",
      "rating": 4.0,
      "verified": true,
      "author": "Alan Harding",
      "helpful_votes": 0,
      "publication_date": 20121228
    },
    {
      "title": "Great printer!",
      "text": "We were looking for a printer that used the same inkjet refills as other printers in our office. The 6940 fit the bill. It's easy to set up and use and has proven itself quite dependable.",
      "rating": 5.0,
      "verified": true,
      "author": "F. J. Silva",
      "helpful_votes": 3,
      "publication_date": 20100318
    },
    {
      "title": "NOT WINDOWS 7 COMPATIBLE",
      "text": "I purchased this printer because the specifications online indicated it was Windows 7 compatible. It is NOT. I intended to replace a HP 960 Deskjet, which worked, but had limited functionality with Windows 7. This 6940 printer won't even give me a test page. Given the cost to return it, I will likely eat the cost. This is the last time I will purchase a printer from any Amazon reseller. !@#$%",
      "rating": 2.0,
      "verified": true,
      "author": "Reallytuff",
      "helpful_votes": 0,
      "publication_date": 20110829
    },
    {
      "title": "My 2nd one",
      "text": "I purchased this printer 5 years ago and I needed a new printer, so I purchased this one. Does a great job for what I use it for, like letters and labels.",
      "rating": 4.0,
      "verified": true,
      "author": "Friends Church",
      "helpful_votes": 0,
      "publication_date": 20120117
    },
    {
      "title": "HP Deskjet 6940 from Computer Geeks",
      "text": "Just now received my new HP Deskjet Printer from Computer Geeks, bought thru Amazon, opened the package and found that it was missing the Power Cord, Ethernet cord, CD Software and Set-up guide!! Called Computer Geeks and they were helpful in sending me a return label and said another printer would be shipped soon. When it gets here, I'll update this review. Right now, this Printer makes a poor paper weight. Gotta go and get this printer shipped back to the C Geeks. Bo",
      "rating": 2.0,
      "verified": true,
      "author": "Nobody0",
      "helpful_votes": 0,
      "publication_date": 20111228
    },
    {
      "title": "Good printer",
      "text": "Researched all over for what I wanted, lower profile, fast print with color, to replace my worn out HP 870Cse. This is it! Faster, with great color.",
      "rating": 5.0,
      "verified": true,
      "author": "InstrctrPilot",
      "helpful_votes": 0,
      "publication_date": 20071212
    },
    {
      "title": "Printer did not work, had to return both of them",
      "text": "I ordered an HP 6940 ( New ) printer, they sent a used beaten up HP 6980 printer that only worked with the black ink, the color ink did not work. I contacted the seller and he sent a new looking HP 6940 printer. Looked good except the printer would not be recognized by any of our PC's. Tried everything, Googled all types of solutions for the problem of the PC's not recognizing the HP 6940. Nothing worked. I had to send them both back. We do have a old HP 6940 that works with the PC's we have here, just need another one. Unfortunatly we could not get one from the seller. Mike B.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike Bergeron",
      "helpful_votes": 0,
      "publication_date": 20140605
    },
    {
      "title": "HP Printer",
      "text": "The service to receive this product was great. The printer itself is just rather large, otherwise, I'm happy with the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "musicami",
      "helpful_votes": 0,
      "publication_date": 20090830
    },
    {
      "title": "Design flaw",
      "text": "As noted by others, there is a design flaw that results in the printer breaking when replacing the cartridge. Had it break after replacing cartridge a few times. DO NOT BUY.",
      "rating": 1.0,
      "verified": true,
      "author": "NC Techie",
      "helpful_votes": 0,
      "publication_date": 20110630
    },
    {
      "title": "Fills our need",
      "text": "This printer works fine. I don't like the way you have to hold the button for 3 seconds to turn it off... what's up with that?? But, this is a 2nd printer in the office used for just certain things. No heavy use, but it does what we ask of it.",
      "rating": 3.0,
      "verified": true,
      "author": "T. Parks",
      "helpful_votes": 0,
      "publication_date": 20101114
    },
    {
      "title": "Printer Replacement",
      "text": "In less than 2 months this printer stopped working. It would not feed papers. I contacted the seller and he would not take responsibility for this defective product. He never included the software for installation so that I could try it on other computers. When I requested this software, he never responded. Do NOT buy this product and do NOT use this seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Mary Beth",
      "helpful_votes": 0,
      "publication_date": 20130513
    },
    {
      "title": "HP Printers",
      "text": "Over the years I have purchased many printers by different manufacturers, and and am now locked in on HP. I have an Officejet Pro, a 3 in 1, and this new one for my wife. They are reliable, easy to maintain, and it's cool when you print out multiple page documents they are printed in order starting with page one when you pull them out.",
      "rating": 5.0,
      "verified": true,
      "author": "David B. Davidson",
      "helpful_votes": 0,
      "publication_date": 20080312
    },
    {
      "title": "Goes offline and stays offline",
      "text": "I purchased this printer. I installed it. After a week, it went offline and would not go online, regardless of power cycling, reading the manual, or any troubleshooting or reconnecting. It now resides in my trash can.",
      "rating": 1.0,
      "verified": true,
      "author": "Max",
      "helpful_votes": 0,
      "publication_date": 20110510
    },
    {
      "title": "did not work",
      "text": "I was disappointed by the product. Ink cartridge did not work, called Hp for help and come to find out it was out of warranty and the product was 7 years old. Considering what I paid for, I will have reservations about buying anything like that from amazon again.",
      "rating": 1.0,
      "verified": true,
      "author": "Becky",
      "helpful_votes": 0,
      "publication_date": 20140120
    },
    {
      "title": "High quality inkjet with built in ethernet!",
      "text": "Just an overall high quality color inkjet printer with built in ethernet!! About time for an affordable built in ethernet solution. Us customers know it only takes a couple of dollars to add an ethernet port, THANKS for finally doing it to a home inkjet printer!",
      "rating": 5.0,
      "verified": true,
      "author": "Jorge Berova",
      "helpful_votes": 18,
      "publication_date": 20060429
    },
    {
      "title": "HP bubble jet",
      "text": "I have a used a similar HP printer (same 96 & 97 cartridges) for four years and I am very pleased with the reliability. The only problem is I live in a small town and Walmart does not carry HP printer cartridge number 97 here. There are some other stores in my town that sometimes carry this cartridge but usually, I have to drive 75 miles to the nearest big town.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger",
      "helpful_votes": 2,
      "publication_date": 20101230
    },
    {
      "title": "HP Review",
      "text": "HP failed to package the setup poster with the machine and no USB cables , I had to purchase USB Cables and download the setup poster",
      "rating": 3.0,
      "verified": true,
      "author": "C. Strait",
      "helpful_votes": 0,
      "publication_date": 20100705
    },
    {
      "title": "i lost my money i'll try to get it fix i'm sorry it's a scam printer dirty with",
      "text": "it's not work! i lost my money i'll try to get it fix i'm sorry it's a scam printer dirty with ink",
      "rating": 1.0,
      "verified": true,
      "author": "milien pierre diquinne",
      "helpful_votes": 0,
      "publication_date": 20150419
    },
    {
      "title": "ummm",
      "text": "Good printing quolity is only sample print. Big power adaptor and very short power cable. I never buy hp printer.",
      "rating": 2.0,
      "verified": true,
      "author": "MS",
      "helpful_votes": 0,
      "publication_date": 20130218
    },
    {
      "title": "Not good printer",
      "text": "Not a good printer. It boasts high speeds, but at high speeds the print is shadowed and very hard to read. I sent this one back and got a Canon MP600 and am very happy with it.",
      "rating": 1.0,
      "verified": true,
      "author": "Randall Ney",
      "helpful_votes": 9,
      "publication_date": 20070607
    }
  ],
  "product_meta": {
    "title": "HP Deskjet 6940 Color Printer (C8970A#B1H)",
    "description": "The HP Deskjet 6940 Color Printer is the new wired ethernet printer with breakthrough speed, professional print quality and direct photo photo printing. Easy print sharing abilities with built-in wired Ethernet make HP's Deskjet 6940 an affordable performance print solution for professional printing at office and home. Work the way you want to with wired Ethernet printing and print sharing with up to five computers. Work more productively with breakthrough speeds up to 36 ppm black, up to 27 ppm color in Fast Draft mode. Print professional-quality color color up to 4800 optimized dpi or optional 6-ink color. Convenient, direct photo printing without a PC from PictBridge-enabled cameras using printer's front USB port. Create standard and custom size photos up to 8.5 x 24 in, with or without borders. Save time and use up to 50% less paper with optional auto two-sided printing. Automatic paper type sensor and optional 250-sheet plain paper tray are other convenient paper handling features. Enhance and fix photos automatically with HP Photosmart Premier software. Smart, fast-access controls include Print cancel, Network configuration and Quiet print mode\n\nAMAZON.COM\nAmazon.com Product Description If you're looking for a fast and affordable inkjet printer, the HP Deskjet 6940 may be the one. This printer offers an impressive range of features, including wired Ethernet printing, direct photo printing, and the ability to print high volume jobs in full-color or black & white at speeds of up to 36 ppm. The affordable and efficient HP Deskjet 6940 is a perfect addition to any home office or small business environment.\n\n \n\nFast, Full-Color Printing Options\nThe Deskjet 6940 isn't your average inkjet printer. This printer offers the ability to print documents and photos at up to 4800 optimized dpi resolution for exceptionally crystal-clear prints and at paper sizes of up to 8.5 x 24 inches. HP's Vivera Inks and optional six-ink color technology allows for professional quality photos with true-to-life color. The automatic duplex printing feature allows for printing on both sides of the paper which greatly reduces paper costs. This printer even allows for printing photos directly from a PictBridge compatible digital camera via the integrated PictBridge USB input, bypassing the need to use a computer for printing photos.\n\n Speed is one of the 6940's greatest assets. This Deskjet is capable of printing up to 36 ppm in black and 27 ppm in color which is significantly quicker than other similar inkjet printers.\n\n Wireless Print Sharing and Networking Features\nHP has equipped the Deskjet 6940 with plenty of useful wireless and networking features to help expand upon its usability. The built-in Ethernet input eliminates the need for additional hardware or software, and it also allows for easy setup of a home or office network that allows the user to connect multiple laptops and desktop computers to one printer.\n\n Wireless is the wave of the future, and this printer features the latest in wireless technology. Just plug the printer networking cable into a wireless router (sold separately) and enjoy wireless printing. The Deskjet 6940 also supports Blue tooth wireless connectivity which allows for wireless printing straight from a camera phone or PDA device with an optional wireless print adapter (not included).\n\n Award-Winning Support and Reliability\nHP has been a reliable and dependable name since 1988 and was even chosen by consumers as the \"most reliable\" printer in a 2006 study. \n\n The Deskjet 6940 is compatible with both Windows (including Vista) and Macintosh. It measures 17.7 x 14.5 x 5.7 inches and weighs 13.2 pounds. It's backed by a 1-year limited warranty which includes HP's Total Care advice and support.\n\n What's in the Box\nHP Deskjet 6940 Printer, HP 96 Black Inkjet Print Cartridge (21 ml), HP 97 Tri-color Inkjet Print Cartridge (14 ml), HP Photosmart Premier software, printer drivers, user's guide on CD-ROM, setup poster, reference guide, Ethernet cable, power supply, power cord.\n\n \n\n\n\n\nFROM THE MANUFACTURER\nThe HP 6940 color inkjet printer is an affordable performance print solution for professional printing at home and office. Work the way you want to with wired Ethernet printing and print sharing with up to five computers. Work more productively with breakthrough speeds up to 36 ppm black and up to 27 ppm color (in fast draft mode). Print professional-quality color up to 4,800 optimized dpi or optional six-ink color (HP 99 tricolor photo ink cartridge available separately). \n\n You can make use of convenient, direct photo printing without a PC from PictBridge-enabled cameras using the printer's front USB port. Or create standard and custom size photos up to 8.5\" x 24\", with or without borders. An automatic paper type sensor and optional 250-sheet plain paper tray (available separately) provide additional convenient paper handling features. You can also enhance and fix photos automatically with HP Photosmart Premier software. HP includes a one-year warranty covering parts and service. \n\n What's in the Box:\nHP 6940 printer, HP 96 black ink cartridge, 97 tricolor ink cartridge, Photosmart Premier software, drivers and user's guide on CD-ROM, setup poster, reference guide, Ethernet cable, power supply, power cord, warranty information\n\n\n\nSee more",
    "rating": 4.2,
    "feature_bullets": [
      "Affordable, high-performance InkJet printer for professional printing at home or office",
      "Crisp and clear 4,800 dpi print quality",
      "Built-in Ethernet network card",
      "Prints up to 36 pages per minute",
      "1-Year limited manufacturer's warranty",
      "Use only Original HP Ink in your HP printer for great results, print after print"
    ],
    "specifications": {
      "Product Dimensions": "14.5 x 17.7 x 5.7 inches",
      "Item Weight": "17.5 pounds",
      "ASIN": "B000CO9ZMI",
      "Item model number": "C8970A#B1H",
      "National Stock Number": "7025-01-536-9858",
      "Customer Reviews": "4.2 out of 5 stars206 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#207,830 in Office Products",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "December 30, 2005",
      "Manufacturer": "hp",
      "Language:": "English"
    },
    "categories": [
      "Printers & Accessories",
      "Office Products",
      "Electronics",
      "Printers",
      "Office Electronics",
      "Inkjet Printers"
    ],
    "price": ""
  }
}