{
  "website_summaries": [
    {
      "verdict": "A hugely popular best-seller that offers exceptionally good value, too.",
      "pros": [
        "You cannot beat the quality for the price",
        "Good, solid construction",
        "Comes ready to mount"
      ],
      "cons": [
        "On the small side",
        "Some users report placement instructions are inadequate"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Happy bats moved in!",
      "text": "The bat shelter is small, but the bats seem to like it. Our first two bats moved in recently, almost a year after installing it. That's not a bad time-frame. It can sometimes take 2 or more years for bats to occupy a new bat house. This house is mounted about 9 foot high, under the overhang at the peak of our utility shed, facing East.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick Chill",
      "helpful_votes": 292,
      "publication_date": 20160831
    },
    {
      "title": "Works great, just be patient!",
      "text": "Here in South Jersey we can't go outside for a campfire after dark without at least mosquito spray, off candles, etc. I've had mine up for 7 years now and the difference in bugs at night is huge. It did take the bats about a year to find it, but now they come back every spring.",
      "rating": 5.0,
      "verified": true,
      "author": "Tech Medic NJ",
      "helpful_votes": 58,
      "publication_date": 20180422
    },
    {
      "title": "Hadaware is not acceptable for outdoor use",
      "text": "I would give this a four or five star review except two things are bothering me. One, the mounting screws included are not galvanized or stainless steel. Two the screws that were used for assembly were zinc coated, which is absolutely terrible for anything outside. I’m not sure what the difference in price the company would save by using proper outdoor fasteners but for 30+ bucks each, it should unquestionably be included. So I replaced all screws on my box for an additional $1.57 of SS screws from lowes, and I mounted mine with a high rated galvanized deck screw that I know will last more than a few months outside.",
      "rating": 3.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 44,
      "publication_date": 20180625
    },
    {
      "title": "MADE IN CHINA not \"handcrafted in USA\" like it is claimed.",
      "text": "Misleading product information and will be reported as such. I would have never bought this if I had known it was a Chinese product. Also, the two boxes I received both had damage on them. You can tell one of them left the factory with the damage, as it is located right at the junction of two pieces of wood. Poor quality, but what else can you expect from something MADE IN CHINA? I don't like being tricked by false advertising, so buyer beware!",
      "rating": 2.0,
      "verified": true,
      "author": "solinvictus39",
      "helpful_votes": 33,
      "publication_date": 20180804
    },
    {
      "title": "I love my bat house and the support I've received from ...",
      "text": "I love my bat house and the support I've received from the seller is absolutely wonderful. They gave me ideas's and suggestions for calling bats to my yard. I would buy this bat house again and again.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Miller",
      "helpful_votes": 28,
      "publication_date": 20171001
    },
    {
      "title": "Loved this little box",
      "text": "Loved this little box. We put it up a few months ago down by the lake and we have 2 little ones that moved in! Our mosquitos have decreased as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 23,
      "publication_date": 20170526
    },
    {
      "title": "Love it",
      "text": "I bought this to attract bats near my house as mosquito's are the demons and they need to die a slow, painful death, plus I wanted \"night crew\" pollinators for my garden. Put on a 15 ft 4x4 post and painted it medium brown as recommended by the vendor and other websites. No bats yet, perhaps next year. Good construction, sealed off some small gap openings.",
      "rating": 5.0,
      "verified": true,
      "author": "ISeeRed",
      "helpful_votes": 21,
      "publication_date": 20171208
    },
    {
      "title": "These little guys need all the help they can get!",
      "text": "Nice piece. Remember to mount this bat house where you won't have to deal with bat droppings. We have a creek in the backyard and I'll mount it near there.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan  B.",
      "helpful_votes": 40,
      "publication_date": 20170328
    },
    {
      "title": "Fell apart while taking out of the box.",
      "text": "So I was really excited about this product and because the reviews were mostly positive, Well here’s my experience. I just opened the package and the thing fell apart while lifting it out of the package. All side screws that are supposed to attach the walls to the back panels are stripped and no longer useable.",
      "rating": 1.0,
      "verified": true,
      "author": "NiBl",
      "helpful_votes": 8,
      "publication_date": 20180730
    },
    {
      "title": "Bat Shelter",
      "text": "Well made and easy to install. Not recommended for tree mount as it will not attract bats and provides easy access for predators. Recommended for pole mount away from trees.",
      "rating": 5.0,
      "verified": true,
      "author": "George R. Sullivan",
      "helpful_votes": 9,
      "publication_date": 20170819
    },
    {
      "title": "Don't do it",
      "text": "So we have bats. I bought this bat house and the bat guy who came to evacuate our bats laughed - kindly. He said that bats would never live in it because 1)it wasn't dark enough, 2)it wasn't really big enough for a family, 3)it wouldn't be warm enough in winter 3)it wasn't high enough (we hung it pretty high) and 4) it didn't smell right to the bats. He said we could buy some bat poop and smear in it and that might help. We turned it upside down and the squirrels love it.",
      "rating": 2.0,
      "verified": true,
      "author": "Amanda Krikle",
      "helpful_votes": 4,
      "publication_date": 20181106
    },
    {
      "title": "Highly Disappointing for an Audubon Product",
      "text": "I was really excited about this and thought it would be quality since it's an Audubon box, but sadly I am very disappointed. I took it out of the box and immediately the back two pieces fell out. I thought maybe it's supposed to come out for cleaning, but I put it back in, and the pieces aren't even cut right to fit. The one portion of the wood is broken and splintered. Also, it comes with no instructions on how to put together - if it's even supposed to be like that, how to clean. I'll be purchasing a better quality one for sure from another company.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191009
    },
    {
      "title": "Broken. Cheap. Do not order this.",
      "text": "So disappointed with this product. Shattered in about 8 pieces when I received it. Made so cheap. Packed horribly. We hired our tree guy to hang this for us this weekend now we have to reschedule so it’s affecting people’s lives now. Thanks so much for this $hi7. The Audubon society endorsed this!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Turk",
      "helpful_votes": 3,
      "publication_date": 20190919
    },
    {
      "title": "Nice design, weak construction",
      "text": "I liked the design of this. But when it arrived, I noticed some of the boards jostling around. This thing is literally held together with just a couple screws and the other boards just sit in the grooves not fastened to anything. Would it kill the manufacturer to use more screws or press everything together before fastening so things aren’t moving around? I put in an additional 6 screws to tighten all the boards down and make this thing feel more solid. If I were a bat, that’s how I’d want my home constructed. Now let’s see if any bats move in!",
      "rating": 3.0,
      "verified": true,
      "author": "Bullish",
      "helpful_votes": 3,
      "publication_date": 20180826
    },
    {
      "title": "Split top panel",
      "text": "I was very excited to receive this item, however I am very disappointed to see the maker of this shelter split the top panel when screwing it together. Now the top panel is wobbly and there's a large crack all the way across it. Not a very practical \"shelter\" now. Rain, light, and anything else will now leak through the top because they didn't put a different panel on, one that isn't split! Again, I'm quite disappointed this is broken.",
      "rating": 1.0,
      "verified": true,
      "author": "katherine stensing",
      "helpful_votes": 5,
      "publication_date": 20181227
    },
    {
      "title": "I ordered two at different times--one was in great shape and the other arrived in pieces",
      "text": "I hope I get some bats and that it's true that the critters eat bugs because the mosquitos are terrible this summer! As stated in the headline one bat house arrived and I was able to stain it and put it under the eaves on the sunny side of the top garage floor. I am still working on the other one. I had to reassemble it, glue and caulk it, and add some more some screws. BE AWARE that the mounting screws provided are completely inadequate in size.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180904
    },
    {
      "title": "Well designed with high quite materials",
      "text": "We have not hung our bat box yet, but it's a well made, attractive product. We actually ordered four and plan to give the others as gifts. One box arrived with a manufacturing flaw -a screw had been placed off-center and caused the wood to split omg the top of the box. I contacted the seller directly , and was told to contact AMAZON instead. Not as friendly or helpful a response as I would have hoped--especially after the multiple orders. :( Still and all, I am happy with the design and quality of the bat boxes.",
      "rating": 4.0,
      "verified": true,
      "author": "Savvy Sal",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Not to proper specs",
      "text": "The bat house arrived broken. The top piece of wood was pushed in and detached from the rest of the house. The worst part is that the chamber is way too wide. The proper guidelines call for the chamber to be 3/4 of an inch wide. This chamber was 1 & 3/4 inches wide. I had the box opened for 3 minutes before I requested a return.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael T Mimnaugh",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Assembly Required",
      "text": "This would be great if it were something I found on the side of the road. Being that I bought it, I was a little disappointed. It arrived in pieces; the screw holes were stripped; there weren’t enough screws to hold it together or mount it properly. I like the cedar wood and the design seems proper, but I had to glue it all to together and add my own nails and screws. This was not as described and just seemed really carelessly slung together.",
      "rating": 3.0,
      "verified": true,
      "author": "Wesley D. Huffmaster",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Great batboxes!",
      "text": "The picture is not of ordered and received batbox. We are very happy with ours. It is cedar and seems high quality. Cannot wait to give to daughters family as a gift. They have a pool and bugs in summer....hope the bats roost and do their work! We have had great success with our three year old occupied batbox! Place under eaves and facing sun....they will nest in time!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Fell apart. Screws stripped.",
      "text": "Bought for my Dad for Christmas. Opened the box and thing was in pieces. Put it back together and all the screw holes are stripped. Had to get replacement screws. Regret the brand now. Should have bought from different company",
      "rating": 3.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Very Nice Bat Shelter",
      "text": "I actually purchased this shelter 3 years ago and didn't put it up until today. I needed a sturdy ladder, and we finally replaced the broken ladder. The bat shelter was very easy to attach to one of outbuildings. It appears very sturdy and has a lot of grooves for the bats to cling to. Hopefully, bats will find it and help with the mosquito population",
      "rating": 5.0,
      "verified": true,
      "author": "Grandma",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Bats moved in",
      "text": "It took two years but looks like atleast one bat moved in. I hung it about 35 feet up on a giant oak tree. Can't look in but guano on grass below (see pic).",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin P.",
      "helpful_votes": 45,
      "publication_date": 20160807
    },
    {
      "title": "Made in CHINA and arrived in pieces.",
      "text": "Made in China! Not made in the US like the description claims. And then it fell apart coming out of the shipping box!",
      "rating": 1.0,
      "verified": true,
      "author": "Darci",
      "helpful_votes": 2,
      "publication_date": 20200227
    },
    {
      "title": "We've got bats!",
      "text": "My husband said this installed easily, and most importantly, we've got bats! We installed it on the east side of our house, which is a side we don't hang out by very much, but if you look up there, there's definitely bats inside! Very satisfied customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Bexa Blue",
      "helpful_votes": 2,
      "publication_date": 20180817
    },
    {
      "title": "If made in USA, why does it say made in china?!!",
      "text": "It seems a bit rickety but figured once its screwed in it should be fine. My greatest concern is that they emphasize its assembled/made in the USA, however I saw no such iconography and only saw a \"made in china\" label on the tag. Just hope I didn't get ripped off with chinese knock-off.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Kessler",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Good quality. I heard it could take 4 months ...",
      "text": "Good quality. I heard it could take 4 months to 2 years before seeing ant bats. WE have had ours up about a month and just saw bat quana.",
      "rating": 5.0,
      "verified": true,
      "author": "suzr",
      "helpful_votes": 3,
      "publication_date": 20180722
    },
    {
      "title": "Decent construction. Faint cedar smell. I needed to ...",
      "text": "Decent construction. Faint cedar smell. I needed to use longer screws, as the ones provided barely penetrated tree bark.",
      "rating": 4.0,
      "verified": true,
      "author": "uɐʎɹ",
      "helpful_votes": 5,
      "publication_date": 20170701
    },
    {
      "title": "Delivered broken and in pieces",
      "text": "Was disappointed to find that the Bat house came delivered and broken in pieces. 4 of the 6 screws holding it together were stripped and so in order to be able to hang the box, I needed to re-drill holes and use wood glue as the pre-drilled holes were also stripped. Was hopeful that since it was an Audubon box it would better quality. It's a shame.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Pretty little bat box, no residents yet",
      "text": "Eh, it is a nicely made box, it was easy to install, but no bats have move in yet. I waited months to see if it would attract some residents and none yet. Thus, not sure if this is a novelty item pleasing the buyer to think it will be bat friendly or not. But, will leave it there and see what happens in future. The box is well made and attractive",
      "rating": 4.0,
      "verified": true,
      "author": "OldRetiree",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Inferior quality, not worth it",
      "text": "This bat shelter is cheaply-made and falls apart easily. I bought one for my wife's anniversary present, didn't bother opening the box, and when my wife opened it she found it broken. The wood on one of the sides had split. This isn't something you can just glue back together and call it good. It's pretty much worthless now. And because I bought it a month ago, it's past the return window, so I'm just out that $35, and I should probably buy my wife a new present. I wouldn't recommend anyone buy this, especially as a present.",
      "rating": 2.0,
      "verified": true,
      "author": "Adam Gish",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Broken",
      "text": "Unfortunately, mine was delivered broken in several places. I returned it and decided it was a sign buy a more expensive, certified, bat house instead.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180809
    },
    {
      "title": "Be a pollinator pal!",
      "text": "This was easy to assemble and follows more of the bat house specs than some of the other homes we read about, and the price beats building one! No bats yet - but it can take a while. May add some phermones eventually. Between this and my honeybees I'm doing my pollinator part!",
      "rating": 5.0,
      "verified": true,
      "author": "Scarlett",
      "helpful_votes": 2,
      "publication_date": 20180805
    },
    {
      "title": "Bat Box is Made of Cedar Wood",
      "text": "The bat box quickly arrived and is solidly constructed from solid cedar wood. According to Texas Parks and Wildlife the bats hibernate in November/December and are not to be disturbed. This home has a cedar fence. The bat box became a Spring project.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Nice bat box",
      "text": "We've been using this for about a month now and we are hoping the bats discover the box soon. At least they have relocated to another area of our porch. May have to purchase the bat attraction stuff to lure them to the box.",
      "rating": 5.0,
      "verified": true,
      "author": "Dj",
      "helpful_votes": 3,
      "publication_date": 20170726
    },
    {
      "title": "Gr8 Deal",
      "text": "I don't give reviews often but this is a top notch bat house at a good price! Not only that, it arrived super quick. Can't say one negative thing about the entire transaction, I received zilch to write this review. - Joe",
      "rating": 5.0,
      "verified": true,
      "author": "Tyrd Ferguson",
      "helpful_votes": 25,
      "publication_date": 20160702
    },
    {
      "title": "My bat house was falling apart when I got it",
      "text": "This product was made of great wood, but cut poorly (too short) and the slats literally fell out when I opened the delivery box and picked it up. The fault was in construction and not in shipping. Plus, it was distributed in the US but not MADE in the US. I returned it for a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "LindaW",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Good product with reservations.",
      "text": "Good product; however, the top section of the (back) was completely missing! Threw the pkg away...just went ahead and re-made it myself (I am a carpenter....not worth the agony of sending it back. Also product was apparently damaged in shipping...the right side of the box was completely into...again...I fixed it. Sorry.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda Y. Dale",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Nice Size, Like Flat Top",
      "text": "This house is a nice size--not too big and not too small. We have had two of them, and the construction quality is good. We use them on a pole, and also like that the top is flat to facilitate it's dual use as a daytime perch for hawks and other birds.",
      "rating": 5.0,
      "verified": true,
      "author": "GKC",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Place on a pole, not a tree.",
      "text": "Product came very wuickly. Directions say to mount on a tree, facing the sun, about 12 feet high. Did that. No bats. Further research says that the bats can’t get into the house, and don’t feel secure if predators can get into the habitat. It is strongly recommended to put it on a pole.",
      "rating": 4.0,
      "verified": true,
      "author": "Tami S.",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "In bits - may need more packaging.",
      "text": "Sadly, it arrived in bits. More like a nice wooden jigsaw than a bat house. Some of the screw holes had split, presumably in transit. The main components are in one piece so I will glue and screw it together but a little disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Ace",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "The bats seem to like it. I like that it isn't tacky looking",
      "text": "The bats seem to like it. I like that it isn't tacky looking.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 5,
      "publication_date": 20170501
    },
    {
      "title": "Otherwise a good product from a good seller",
      "text": "The bat house is designed by default to be pole mounted. It would be helpful if screw holes were added to the top to make it easier to mount underneath the eaves of a roof (which is what we did). Otherwise a good product from a good seller.",
      "rating": 4.0,
      "verified": true,
      "author": "Desert Rat",
      "helpful_votes": 11,
      "publication_date": 20170417
    },
    {
      "title": "Nice bathouses.",
      "text": "Had a bat problem and had several of these hung near creek in my backyard. You do need to mount them at least 20 feet above the ground. They are attractive and provide a better habitat for the bats than my attic!",
      "rating": 5.0,
      "verified": true,
      "author": "Deedra D.",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Probably will need longer screws",
      "text": "Hoping the bats find this sooner but will give it a year to see. The screws weren't long enough to mount to the house but had some longer ones laying around. Installed under the soffit so hoping this holds up well. Nicely made.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason T",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "built tough and will last",
      "text": "This is my first bat house. I got lucky with this one...it's built tough and will last. I installed it too late in the season for a bat to move in but it's a good bat house.",
      "rating": 5.0,
      "verified": true,
      "author": "waldopg3",
      "helpful_votes": 2,
      "publication_date": 20180105
    },
    {
      "title": "Excellent first bat house.",
      "text": "Well built, purchase two for grandson (10) and his grandmother. Now they want mount them on the barn and see which gets \"tenants\" first!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr V",
      "helpful_votes": 2,
      "publication_date": 20180316
    },
    {
      "title": "As advertised",
      "text": "Well made, no odors. Its been up for a few weeks but no bats yet. I have a couple that were in my wood pile last year and am hoping they stick around. I understand it can take a year for them to find it. Fingers crossed",
      "rating": 5.0,
      "verified": true,
      "author": "c.adams",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Pretty awesome little house",
      "text": "The bat house is constructed of a nice sanded wood with the audubon insignia burned on the front of it. It was a little cheaper on Amazon than a few of the stores I saw it at. As yet we have no bats but the houses were pretty easy to install since they came with the 2 screws that you just attach to the tree with. Pretty sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "JacQue",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "poorly made",
      "text": "This thing is so poorly made that the back slats kept popping out of the shallow channel they have routed. I had to use screws to secure them. i just hope it attracts bats.",
      "rating": 2.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Perfect for our bat community",
      "text": "We have bats in our neighborhood and appreciate the little critters and what an aid they are for pests like mosquitoes, ants, etc. Highly recommen.",
      "rating": 5.0,
      "verified": true,
      "author": "Nina",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Very well built!",
      "text": "This was a gift for my wife who loves bats and it made her day. Solid construction and positive grips for the little radar guided guys to roost in. Looking forward to installing it!",
      "rating": 5.0,
      "verified": true,
      "author": "Vegas Cuts",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Ouch!",
      "text": "Gave me a crazy splinter. My finger was bleeding like I’d stabbed it with a lancet. Made sure to sand the heck out of it afterwards because if it did that to my finger I don’t want to know what it would do to bat wings. Otherwise seems well constructed and comes with wood screws for mounting and an information card.",
      "rating": 4.0,
      "verified": true,
      "author": "Cat",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Great quality bat house",
      "text": "Bat house was nice and good quality. I'm not sure how as they arrived with some other items that were not packaged well in the box.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "In great shape after two years.",
      "text": "We purchased and installed these houses two years ago but unfortunately no bats have come to use them. They’re sturdy and well built. No sign of deterioration. Maybe they’re not hanging in the right area or are getting too much shade.",
      "rating": 3.0,
      "verified": true,
      "author": "Sandy Chytla",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Cute bat house for yard, works well!",
      "text": "Cute little bat house with burned in logo. It's on our fence. Thought was bigger, but apparently you dont need a huge one. All good.",
      "rating": 5.0,
      "verified": true,
      "author": "ROSEMARY PACHECO",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "... haven't attracted any bats yet but the product is sturdy and high-quality",
      "text": "I haven't attracted any bats yet but the product is sturdy and high-quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Lopertrack",
      "helpful_votes": 2,
      "publication_date": 20180221
    },
    {
      "title": "Practical application",
      "text": "The bat house looks good, just need to figure out how to entice them into their new home.",
      "rating": 3.0,
      "verified": true,
      "author": "Harlan Faust",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Bought two - both came damaged and had to return",
      "text": "Purchased the first one it came broke apart in the box....thought I would give them the benefit of the doubt. Nope second one came to me worse than the first one. Do not buy",
      "rating": 1.0,
      "verified": true,
      "author": "BM",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Lols great!",
      "text": "I considered building one myself but when I came across this at the price, It was worth it to just buy it. Very sturdy. Easy to hang. Although it doesn’t have bats living in it, it’s a great conversation piece! I’ve only had for about 3 months so hopefully they will come eventually.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Muir",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Very good product.",
      "text": "Very good quality. I painted my dark brown to help hold the heat. Easy to mount on a pole.",
      "rating": 5.0,
      "verified": true,
      "author": "Rudi Bennet",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "easy installation. still waiting for bats to like it ...",
      "text": "easy installation. still waiting for bats to like it though. I actually placed a bat in the box, but it only stayed there one night and vacated the next day to never return. Not sure why. I followed the instructions to a tee.",
      "rating": 4.0,
      "verified": true,
      "author": "Bartles",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "Cedar bat house",
      "text": "The bat house seriously lacked quality control. The cedar wood was in excellent condition but construction needs improvement.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert McCain",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Nice bat box",
      "text": "Nice bat box. It had a few small cosmetic defects (deep scratches on the front, some sharp wood on the side), but nothing a fine piece of sand paper couldn't fix.",
      "rating": 4.0,
      "verified": true,
      "author": "JW",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "have had for several years but no bats have made ...",
      "text": "have had for several years but no bats have made a home there. I can't really fault the product for that though.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Bats",
      "text": "Product not bad but has been up for 2 years now and no bats. What am I doing wrong. Need an extension ladder to install properly.",
      "rating": 2.0,
      "verified": true,
      "author": "JZ",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Excited!",
      "text": "Sturdy. Very easy to install. Just recently noticed bats in my yard. hoping to provide a home for them and to encourage them to stay.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa O'Hair",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "shipped fast",
      "text": "Haven't used it yet but it is perfect just have to get a ladder to get it high enough :)",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Very nice bat house",
      "text": "I bought this so I could put this up with my little grandson. It is well made and I am very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Neil Hebert",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "Well made",
      "text": "A little smaller than I thought, but very well made. Waiting for the bats to return after their last box fell down during a storm.",
      "rating": 4.0,
      "verified": true,
      "author": "Silver",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Hang in a proper location as directions state",
      "text": "Very happy with my bat box, I know it takes time for them to find it, so we are waiting patiently :-)",
      "rating": 5.0,
      "verified": true,
      "author": "1955",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Poor quality",
      "text": "Shelter arrived in pieces. Constructed in China. Single wood screw holding sides and not centered which led to split wood.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin L. Luppen",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "broken",
      "text": "arrived in broken and split wood. good that have wood glue Would NOT buy again.",
      "rating": 2.0,
      "verified": true,
      "author": "JOHN MERRELL",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Good quality",
      "text": "Well made. Bought as a present-time will tell if it attracts bats or not.",
      "rating": 4.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Mosquito control",
      "text": "We bought the bat houses with the hopes of attracting some bats for mosquito control. As of yet none have moved in. Still Hoping!",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald Hansen",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "FUN",
      "text": "This was the best thing I ever bought. When I moved into my house, I had bats on my front porch. They used it for a while, but have not used this year. I still keep it up in case they return.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula Kapiloff",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Five Stars",
      "text": "Nice and well made...but still no bats. I think we have too many hawks in the area. : (",
      "rating": 5.0,
      "verified": true,
      "author": "Rob T",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "To date after 2 seasons, not bats have decided to use this as their home",
      "text": "I think I have it in the right place, have used the scent on it, but no bats!!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Good quality",
      "text": "This was well put together and good quality. We were able to paint it and put it up in no time. Just waiting for the bats now!",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Five Stars",
      "text": "nice box, but has not attracted bats yet. I'm using the spray now, hope that works",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew J.",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "New Tenants  Wanted!",
      "text": "Just installed the bat house in our yard. The construction of the unit is sturdy. Hoping the bats find is soon to help with the bugs.",
      "rating": 5.0,
      "verified": true,
      "author": "Jas",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Great looking.",
      "text": "Great looking and easy to install. Just need some bats!",
      "rating": 5.0,
      "verified": true,
      "author": "Travis Dixon",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Jinga game Bat Box",
      "text": "Received it and it came out of box almost as a whole unit, the three back panels of the box just fall out and one of the panels seems too small to even stay in the slots (cut short). I guess gorilla glue is the fix,",
      "rating": 3.0,
      "verified": true,
      "author": "Matthew Wane",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "I got this 2 months ago, no bats yet ...",
      "text": "I got this 2 months ago, no bats yet, but I know it takes time. Product is very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "Arrived very broken.",
      "text": "Do not order this. The roof was cracked, and the screw holes were stripped. It's basically junk. Do not order this.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew S. Harasymiw",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Constructed without skill",
      "text": "Looked like it was a middle school shop project....+C. Wood was scuffed and splintered at all the cuts...on all 3 ordered. I thought professional woodworkers would have mastered that skill. Functionally OK but crappy looking as gifts.",
      "rating": 3.0,
      "verified": true,
      "author": "n",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "What is this??",
      "text": "Wood in a box. That’s it. Crammed inside a laptop box was all the wood to make this bat house. But no instructions, no nails and nothing to hangs it with. I am heartbroken",
      "rating": 1.0,
      "verified": true,
      "author": "Peach ",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "When the box showed up it was broken into 4 ...",
      "text": "When the box showed up it was broken into 4 pieces I had to put it back together. The top had broken in half.",
      "rating": 2.0,
      "verified": true,
      "author": "Heather Reid",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "No more BATS",
      "text": "Smaller than I thought. Bats had no interest in moving into this house.",
      "rating": 3.0,
      "verified": true,
      "author": "Misty",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Five Stars",
      "text": "nice, easy install............just waiting for the little ones to move in.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 2,
      "publication_date": 20160219
    },
    {
      "title": "Nothing Yet",
      "text": "2 months in, not a hint of bats. Still holding out hope, will revisit this time next year.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrew Loder",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Looks great up on the tree",
      "text": "Built very well. Looks great up on the tree... waiting for bats!",
      "rating": 5.0,
      "verified": true,
      "author": "ChrisJ622",
      "helpful_votes": 0,
      "publication_date": 20161019
    },
    {
      "title": "Quality bat house",
      "text": "Product construction seems to be pretty good. Installed a few weeks ago at our river lot near the Mississippi River. We will update if we are able to get any bats.",
      "rating": 4.0,
      "verified": true,
      "author": "Adam Baer",
      "helpful_votes": 0,
      "publication_date": 20160530
    },
    {
      "title": "Five Stars",
      "text": "Still waiting for bats to call home but seems well made!",
      "rating": 5.0,
      "verified": true,
      "author": "Zoey41477",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "Love the bat house but think it is pricey at ...",
      "text": "Love the bat house but think it is pricey at $32. No assembling required. First one was damaged and the second one shipped before I got this one out the door! Fast service.",
      "rating": 4.0,
      "verified": true,
      "author": "Pam R.",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "Good size, easy to hag just waiting for the ...",
      "text": "Good size , easy to hag just waiting for the bats",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Bat house",
      "text": "This is our second bad house, very well built very sturdy. We're going to paint it black, Love to watch the Bats fly, They do so will at keeping those pesky insects at bay",
      "rating": 5.0,
      "verified": true,
      "author": "Misty Mckibbin",
      "helpful_votes": 0,
      "publication_date": 20150808
    },
    {
      "title": "well built",
      "text": "this is well built & sturdy, looks like it will hold up good & make a nice home for bats, just go it & haven't got it hung up yet so i'm hoping the bats will love it, but for the price I think it is a pretty good deal",
      "rating": 5.0,
      "verified": true,
      "author": "molly",
      "helpful_votes": 2,
      "publication_date": 20130417
    },
    {
      "title": "This is great",
      "text": "I love the idea of having a bat box. If I just had some bats living in it. I think they spray for bugs around the house too much, and yet not enough...lol I'm still getting bit up. But not enough to keep bats here..:(",
      "rating": 5.0,
      "verified": true,
      "author": "kb",
      "helpful_votes": 0,
      "publication_date": 20130117
    },
    {
      "title": "I have had it for over a year. Even ...",
      "text": "I have had it for over a year. Even though we have a tons of bats, nobody ever moved in.",
      "rating": 3.0,
      "verified": true,
      "author": "Heiligenwho",
      "helpful_votes": 0,
      "publication_date": 20161002
    }
  ],
  "product_meta": {
    "title": "Audubon Bat Shelter Model NABAT",
    "description": "Color:Light BrownGive the bats in your backyard a place to roost using the Audubon Cedar Bat Shelter. With a single chamber large enough for 20 bats, this bat shelter is perfect for your small backyard colony. The interior surface and landing platform are made of rough cedar and are grooved for clinging when roosting and landing . Mount this bat shelter 8 feet to 12 feet high in a tree or under the eave of a building. Can also be placed near ponds, lakes or streams facing the sun. The shelter is perfect for your small backyard colony; for use by big brown, cave, eastern pipistrelle, evening, little brown, mexican free-tailed, northern long-eared, pallid, pallas' mastiff, rafinesque's big-eared, southeastern, and yuma bats.",
    "rating": 4.1,
    "feature_bullets": [
      "Interior surface and landing platform are made of rough cedar and are grooved for clinging when roosting and landing",
      "Includes zinc plated deck screws and predrilled holes for mounting",
      "Holds up to 20 bats",
      "Hand crafted in USA"
    ],
    "specifications": {
      "Product Dimensions": "12 x 4.25 x 16 inches",
      "Item Weight": "3.25 pounds",
      "Department": "Racks/Futons",
      "Manufacturer": "Woodlink",
      "ASIN": "B000HHQBKO",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "NABAT",
      "Customer Reviews": "4.1 out of 5 stars577 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#16,547 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Bats",
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Outdoor Décor",
      "Backyard Birding & Wildlife"
    ],
    "price": 28.7
  }
}