{
  "website_summaries": [
    {
      "verdict": "Excellent quality pliers that perform many jobs well. Very comfortable handle grips.",
      "pros": [
        "Large variety of jaw width settings that will work on many sizes of bolts",
        "Strong gripping power that works well for tough jobs",
        "Includes a ratcheting feature to simplify using the pliers",
        "Great build quality from a trusted manufacturer"
      ],
      "cons": [
        "Carries a very high price point",
        "No teeth in the jaws so won't work for all jobs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "7” is the best size",
      "text": "I have 3 sizes. 5, 7, and 10 inch. The 7” pliers are the most versatile size.",
      "rating": 5.0,
      "verified": true,
      "author": "jfrazier",
      "helpful_votes": 20,
      "publication_date": 20171210
    },
    {
      "title": "Brilliant Design!",
      "text": "These are incredible pliers. I am regularly surprised by how affective these are. Genius! I also have the 5\" size, and they are two of the most used tools in my shop. 10 inch seems to be a really good size for most uses. They do feel a little bulky at times, but the longer handle gives good leverage when working on larger stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "jfrazier",
      "helpful_votes": 23,
      "publication_date": 20161018
    },
    {
      "title": "Great pliers for aircraft mechanics!",
      "text": "I have several sizes of these pliers that I used working on aircraft. They are really great to disassemble the \"B\" nuts on hydraulic lines. The jaws are flat and close parallel to each other and will not mar the nut. The more pressure on the handles, the tighter the jaws will close on the nut. Also since the jaws close parallel, they are great for pressing in bearings, bushings, and sleeves into fittings.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Kalbfleisch",
      "helpful_votes": 6,
      "publication_date": 20171218
    },
    {
      "title": "Worth every penny!",
      "text": "I purchased this to work on some plumbing in my house. I wasn’t disappointed, and I am happy to have them for any other projects that may come up in the future. They are worth the asking price. Take care of them, and they will take care of you. I don’t think you will ever have the need for a replacement. Just don’t lose them or lend them to someone that conveniently “forgets” to give them back.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous1",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Lives up to the hype",
      "text": "I saw this on the Cool Tools blog and the reviews on there are usually spot on. This tool should be a standard for any toolbox because it is so useful. I have all kinds of different tools and tool sets, but this pliers/wrench replaced several things that I was carrying around in my toolbox. It's really an excellent tool that I have recommended to several other people that had the same reaction I did when I started using it.",
      "rating": 5.0,
      "verified": true,
      "author": "MWS",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Superior to Channelock and similar pliers.",
      "text": "Superior to Channelock and similar pliers. Select a jaw opening and the pliers lock to that size. Doesn't matter if you set them down or drop them or open the jaws all the way; the jaw size is locked in place until you manually change it. Once you experience this advantage, you'll be less impressed with your slip-jaw pliers. The other great feature is that the jaws always remain parallel. Now you can use these pliers instead of an adjustable wrench. The leverage is fantastic. Squeeze the handles, the the jaws grip like iron. Definitely superior to slip-joint pliers. Worth the price if you value good tools.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Stearns",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Excellent worth the price",
      "text": "Just got it and it has already paid for its self. Had a bent bicycle rim and it was the perfect tool to carefully squeeze the rim precisely back to its original position. Strongly suspect that this is actually better than a specific size wrench for bolts since it precisely fits and squeezes the bolt rather than just approximating the bolt's size.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken S. Sato",
      "helpful_votes": 2,
      "publication_date": 20190112
    },
    {
      "title": "The only wrench I want in my toolbox",
      "text": "This wrench performs beautifully! I'm currently in the process of building up my mechanics toolbox for the cycling race season and this wrench clears out all the box wrenches I would normally carry, leaving more room (and weight!) for other necessities. Got the 180mm wrench which is great at torquing down anything I've ever needed to on a bike (including removing over torqued lockrings). If you're looking for just one tool, I'd easily suggest this one. Going to be building up my box to have this and the 240mm one though for those extra oomf situations though.",
      "rating": 5.0,
      "verified": true,
      "author": "Winston Durand",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Bye Bye Crescent Wrench",
      "text": "I love this pliers wrench. I have used these for everything from bolts to bending thick washers. The jaws are not off center, perfectly flat, operate in parallel, and have a ton of clamping force (like squish a penny or nickel amount of force). Best I've ever seen. The alloy is very hard and resists deformation. The 10 inch are good all around. For a full lineup, get the 5 inch, 10 inch, and 12 inch.",
      "rating": 5.0,
      "verified": true,
      "author": "Mal Calhoun",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Best adjustable option.",
      "text": "A ratchet handle with the proper socked is still the best option, but in a pinch these are great. They will not lose adjustment amd round off the fastener like standard adjustable crescent wrench, also you can loosen your grip for opposite direction versus having to completly remove the wrench and reseat on fastener.",
      "rating": 5.0,
      "verified": true,
      "author": "Sebastien Maximilien",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Love the handle",
      "text": "They work great. I love the handle grip on these. They provide a good grip so they don't just slide out of your hand. They also seem easy to wipe clean (or at least the few times I have done it, it wasn't an issue). I think I'm becoming a Knipex fan as this is the 5 tool I have purchased of theirs and they have all been great so far. They aren't cheep but they also are insanely expensive like those sole by tool truck companies.",
      "rating": 5.0,
      "verified": true,
      "author": "SpeedD408",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "The neatest tool that you didn't know you needed; until you tried one.",
      "text": "I have the 5\" and recently bought the 7\". It is incredibly handy because while only 7\" it can do things a 10\" crescent can't. I like that it doesn't marr surfaces and that you can really use it's leverage to torque down on a nut or bolt; or anything that you need to turn. It functions as a parallel jaw plier but one that you can exert much more force on.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Burns",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Great Pliers",
      "text": "Saw this in a magazine review of new tools and decided to give it a try. I hate when using traditional slip joint pliers when I torque down the jaws loosen and these solved that problem. I also like that the jaw remains parallel through the travel. They aren't cheap but as with quality tools you get what you pay for and these are worth it. Would buy again and may get another with a different jaw in the future. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Zack",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Clever and convenient wrench",
      "text": "This Knipex wrench is a delight to use! The design is so much more effective and comfortable than the classic crescent wrenches I'm used to. I've always found the crescents a hassle to use, both to set and constantly reset. The Knipex, in contrast, gives a sure grip on the nut and is easy to reset into position via a ratcheting action. As the pliers are long (10\") and have a comfortable grip, I use them to apply leverage on various workpieces. So far these pliers have proven exceptionally useful, and I appreciate the high build quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Donaldson",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Buy them. You'll only cry once, then all your friends will be jealous after they use em once.",
      "text": "Not cheap but also not cheaply made. These have performed extremely well in the shop for general use and can replace wrenches 90% of the time. They work so well that all of my coworkers and boss have purchased their own various pairs lol. Only neg aside from the wallet hit is I had to trim the rubber off the handle ends to make them legal to fly with carry-on (under 7\").",
      "rating": 4.0,
      "verified": true,
      "author": "wes473",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Not Durable!",
      "text": "Love this item, just not for tough bolts. The ratcheting mechanism broke in the 7/16 - 1/2” area, or the most used area. Makes these useless for me. Shame as I love most knipex tools, have a full bag of them. I’ll write these off as a fluke I guess",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190502
    },
    {
      "title": "Two of these hyper-priced wrenches will replace a large messy set whilst saving much time",
      "text": "Amazing tool, absolutely love it. I purchased two of the 10\" and a single 7\" with the thinner head. Unless you're application requires a less conventionally shaped head or body, these wrenches will replace an entire wrench set. Unlike most adjustables and their requisite retightening (attritional thumb warfare sucks), this tool will remain at your desired setting for as long as necessary, no slipping. ...Knipex tools are always a hefty investment, and only worthwhile if your current arsenal wrecks your work efficiency.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 3,
      "publication_date": 20160831
    },
    {
      "title": "The 7\" Comfort Grip works great for me",
      "text": "Great tool. I first got the 6\" once but the handle was too small considering that when it's fully open one handle shifts back reducing the usable area of the handles. Good quality, non serrated jaws that don't damage the working piece, high leverage ratio which allow to apply high force and the jaws are always parallel so holds nuts and other parts much better.",
      "rating": 5.0,
      "verified": true,
      "author": "Consumer Joe",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Buy'em.",
      "text": "These are now one my favorite and most used tools. I'm not in love with the bulky comfort grips (which I chose) but the tool it self is so great. Knipex is a quality brand as well. These things can squish and fold pennies over. They don't just fit and turn nuts and bolts, they tightly grip fasteners as well. So many more uses than you might think of too. I've used them for straigtening out metals as well.",
      "rating": 5.0,
      "verified": true,
      "author": "smooth e",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Just buy them.",
      "text": "These are now one my favorite and most used tools. I'm not in love with the bulky comfort grips (which I chose) but the tool it self is so great. Knipex is a quality brand as well. These things can squish and fold pennies over. They don't just fit and turn nuts and bolts, they tightly grip fasteners as well. So many more uses than you might think of too. I've used them for straigtening out metals as well.",
      "rating": 5.0,
      "verified": true,
      "author": "smooth e",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Excellent quality, DESIGNED AND MADE IN GERMANY!  Ingenious design.",
      "text": "Excellent quality, designed and MADE IN GERMANY! Ingenious design grabs nuts and bolts firmly in a way that neither a Crescent nor open-end wrench can. Grips tighter the more you squeeze the grips with zero backlash. For quality tools stick to Knipex or Channellock and avoid everything made in China especially the formerly American brands like Crescent, Irwin Vise-Grip, and Craftsman...since they're all Chinese garbage now.",
      "rating": 5.0,
      "verified": true,
      "author": "David M.",
      "helpful_votes": 2,
      "publication_date": 20170306
    },
    {
      "title": "You get what you paid for",
      "text": "These are not cheap, but they did help me get out of a lot of binds where a thin profile was needed with the holding strength of pliers with the adjustability of a crescent wrench while feeling comfortable in the hands. Pay the extra money and never look back when you have the right tool for the right job.",
      "rating": 5.0,
      "verified": true,
      "author": "Emac",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Very Handy “Wrench”",
      "text": "My new “go-to-it” tool when I need an adjustable wrench. Extremely versatile and easy to use. It’s probably overpriced, but I liked it so well, that I also purchased the 6” version.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Fan",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "dont scrimp- these are the best. only one gripa",
      "text": "upon stocking up my new shop,I quickly found that cheap all-in-one kits just werent built to be used by anyome other than those looming to use tools once a year. if you use your tools regularly, knipex are second to none. craftmanship, precision and durability are hallmarks of knipex. IF i need to buy another pair after I wear these out (DOUBTFUL), they are worth every penny. my only gripe is the push button adjustment. takes a couple guesses to dial i. the perfect pressure/opening to be applied, but qhen you do,there little to no slippage to worry about!",
      "rating": 5.0,
      "verified": true,
      "author": "William Calomiris",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "The Incredible pliers-wrench",
      "text": "I’m telling all my friends about this wrench. I’ll keep my Crescent wrenches, but doubt they will get much use; this pretty much makes them obsolete. With this smallish plier-wrench, I was able to tighten the aluminum rear axle nut on my KTM to fully tight (about 40 ft-lbs) with no damage to the nut and using just one hand and a cheater-bar. The harder you twist the nut, the stronger the clamping force on the nut. And it also acts as plies, for work such as twisting two wires together tightly. The perfect tool to toss in a toolbag, as well as for daily use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "As Useful as Expected",
      "text": "My first pair of Knipex, I was not let down. These are a pleasure to use and actuate, and have paid for themselves already performing all sorts of unconventional duties. Along with the vinyl protectors sold separately they are useful for things large and small.",
      "rating": 5.0,
      "verified": true,
      "author": "Cryph",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Quality wrench as expected",
      "text": "This particular size in the Knipex pliers wrench family is really nice. It is just big enough, but not too small. The comfort grips feel really good on this one and they don't make it too clunky. The next size up (10 inch) is quite a bit larger and heavier.",
      "rating": 5.0,
      "verified": true,
      "author": "Geoff",
      "helpful_votes": 2,
      "publication_date": 20171110
    },
    {
      "title": "Ok, tool...order the small pair.",
      "text": "These pliers are not intuitive to adjust. Once you get them set, they provide great leverage. It take both hands to adjust, which sucks when you need to other hand to hold you work. Also, I think the smaller size would perform better if you want them in your tool belt.",
      "rating": 3.0,
      "verified": true,
      "author": "Darryl",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Must have tool",
      "text": "This has pretty much replaced an adjustable wrench in my bag. The smooth jaws won't mar a finish as easily as serrated jaws on most pliers, but because of the great engineering, you get a LOT of strength and leverage. Push button makes it easy to adjust on the fly and you can even ratchet it by just easing up on the pressure a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Higgs",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "No More Crescent Wrenches!",
      "text": "These are some kind of awesome! Glad I purchased the 10\" set. I work on generators and used them for the first time today and used them all day after that! Great strength and quality! Will probably purchase the smaller tools as well. No more crescent Wrenches!",
      "rating": 5.0,
      "verified": true,
      "author": "Consejero",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "This is perfect medium tool",
      "text": "Honestly I'll never go back to the traditional adjustable wrench, these ones are the future. Already owned the 250mm variant, and needed something smaller size appropriately for my children. This is perfect medium tool. The comfort grip is ideal.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon Disnard",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Powerful parallel grip, locks in place, doesn't mar the work. Don't know anything that can replace them. Expensive but well made",
      "text": "They do what the copy that comes with them in the description says; they're a parallel pliers that also can be made to lock in place, and don't have serrations that can mar the work. Yes, they are expensive, but if you want an adjustable parallel pliers that can grab significantly large pieces of material with good parallelism and power, and don't need serrations, these are what you want.",
      "rating": 5.0,
      "verified": true,
      "author": "Hgnomentat",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "Knipex 8605180 7-inch Pliers Wrench - Comfort Grip",
      "text": "Yep, they're expensive- overpriced. But I wish I'd gotten a pair long ago- they would have saved me a LOT of time over the years, well worth the price. When the patent runs out, knockoffs will definitely be cheaper (but you're paying both for the design and the quality, and that will never be \"cheap\") So far, they do exactly what they are designed to do. Being able to \"ratchet\" with an adjustable wrench is wonderful. I haven't used them much, or on really tight nuts/bolts, but so far I'm sold. I'm planning to get the 10\" one, and considering who I can give one to!",
      "rating": 5.0,
      "verified": true,
      "author": "Nelson R. Pardee",
      "helpful_votes": 0,
      "publication_date": 20150625
    },
    {
      "title": "Why did I wait?",
      "text": "Wow. For such a small piece of metal this sure packs a punch. I bought to carry in a tool kit for riding motorcycles but finding that I use it a LOT now when I'm doing things around the house. Not cheap by any stretch, but if you value quality tools and can afford to get one of these, by all means treat yourself.",
      "rating": 5.0,
      "verified": true,
      "author": "Speedy R",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Well made, but...",
      "text": "Quality construction / materials, but just seemed overly cumbersome to use. Could never figure out quite how to adjust using just one hand - always seemed to need to use both hands. Decided to send back - for less than half the money able to get a pair of multi-position adjustable wrenches from Craftsman.",
      "rating": 3.0,
      "verified": true,
      "author": "J. P. Young",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Strong grip like a small vise",
      "text": "Strong grip like a small vise. Given the size, it has an impressive amount of holding power. Does not slip and leave marks on metal. when it does slip, it will only slightly marr paint and finish but it will leave the material undamaged. This is a great opening tool! I plan on buying a second pair as my #2 Cobra pliers have been damaging the other end of what I need opened.",
      "rating": 5.0,
      "verified": true,
      "author": "Jefferson Miller",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Best fit in hands for working on multiple items",
      "text": "I am a apprentice and this plier works best to fit in tight places. The flat jaws work well for not messing up nuts or bolts. I replaced my cresent wrench due to how well it works",
      "rating": 5.0,
      "verified": true,
      "author": "charles s.",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Used and missing pieces",
      "text": "So my dad has a set that my husband loves. But when I gave these to my husband tonight he says they are missing the plastic caps. Thoroughly disappointed. I mean I know the box looked like these were used, but I thought the pliers looked fine. I guess not.",
      "rating": 1.0,
      "verified": true,
      "author": "Lauren A.",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "It's Knipex, what did you expect?",
      "text": "These are awesome, I bought a pair immediately after seeing my coworkers and I love them. Not saying throw your crescent wrench away, but you'll want to use these way more. Also the comfort handles are DEFINITELY worth the extra money.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Excellent!",
      "text": "These are extremely premium. I saw the team USA Paracycling mechanic using these and had to ask what they were. Bought them straight away and never looked back! Incredibly versatile and handy, I use these all the time!",
      "rating": 5.0,
      "verified": true,
      "author": "Paraplegic dude ",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "The Audi of Wrenches",
      "text": "I thought I had seen all that the wrench world had to offer until I purchased Knipex's Plier Wrench. The flexibility it offers along with how comfortable and natural it feels to be held has left me recommending this. The spring lock alone makes this wrench worth it and this wrench is now the pièce de résistance of my toolbox.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark S",
      "helpful_votes": 2,
      "publication_date": 20180614
    },
    {
      "title": "The torque possible with the jaw design is amazing in actual use but I feel that the comfort ...",
      "text": "As wrenches go these save a lot of time. The torque possible with the jaw design is amazing in actual use but I feel that the comfort handles don't offer any extra usable gripping force but they do however get in the way of tighter work spaces and make unhinging the jaws more difficult. I suggest the regular handle version.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter Chhu",
      "helpful_votes": 5,
      "publication_date": 20151008
    },
    {
      "title": "The non serrated jaws do not mar the work and fasteners but the best part is the incredible gripping force these things can ...",
      "text": "March 1st 2017 I bought these Pliers for work. Im a machinist and needed a small pair of pliers to do set ups. The non serrated jaws do not mar the work and fasteners but the best part is the incredible gripping force these things can apply. If you have ever had to use regular pliers to tighten a nut or bolt you know just how fast you can round off and destroy them. With these Knipex Pliers it is like having a wrench. It is adjustable for a wide verity of sizes far beyond a typical tool this size. I love Knipex tools which I have always found to be of the highest quality best tools on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "Marc Pearson",
      "helpful_votes": 0,
      "publication_date": 20170301
    },
    {
      "title": "A top five in my tool bag",
      "text": "A great tool in the perfect size. The 10” were a bit too large and heavy for me to keep in my go bag. These however, go with me everywhere on the job site",
      "rating": 5.0,
      "verified": true,
      "author": "The River Doctor",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Excellent!",
      "text": "Excellent set of pliers! They are so useful I have a drawer full of other pliers that I never use anymore. I also have the 8\" Combination & 10\" Cobra pliers from Knipex and these are all I need for around the house and general \"garage\" work. Knipex quality is top notch! Note that I have had these all for over 2 1/2 years and they work like they did on day 1. I do take care of my tools and spray them down/clean them with Kroil once or twice a year to keep them like new. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Hawke",
      "helpful_votes": 0,
      "publication_date": 20150909
    },
    {
      "title": "Germany in my hand",
      "text": "Best thing for delicate finishes like a shower head. The finish on the jaws is super smooth. I will NEVER pick up a worm drive again.",
      "rating": 5.0,
      "verified": true,
      "author": "Noname Norelation",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Excellent adjustable wrench",
      "text": "Excellent adjustable wrench. Smooth jaw so no marring. I will be getting the larger size as well. I haven’t had these slip on any bolts or nuts yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Timmy",
      "helpful_votes": 2,
      "publication_date": 20180330
    },
    {
      "title": "Great product",
      "text": "One of the Best tools in my box. Use almost everyday. Small enough to carry with you with great results if you need a wrench. Doesn't fit everywhere but were it does it is priceless",
      "rating": 5.0,
      "verified": true,
      "author": "Theodore F. Beck III",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Great pliers",
      "text": "These pliers are not cheap but their parallel jaws grip very well and they don't damage the faces of the nuts like other adjustable wrenches. Very easy to change the gap between the jaws in order to grab different sized nuts.",
      "rating": 5.0,
      "verified": true,
      "author": "RD",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "They are amazing. Far superior to any adjustable wrench I have ...",
      "text": "Phenomenal tool. I will keep these as long as I can. They are amazing. Far superior to any adjustable wrench I have ever used. They are strong, versatile and durable. Love them. The comfort grip is really nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Slushpuppy154",
      "helpful_votes": 2,
      "publication_date": 20180111
    },
    {
      "title": "Replaces a bag of wrenches",
      "text": "This tool made me feel silly for buying wrenches. It works well for me in Aviation because dropping a tool in a small dark space could be catastrophic. This fills a large range of sizes and ultimately makes it less likely for me to drop a wrench that’s in my pocket or off to the side.",
      "rating": 5.0,
      "verified": true,
      "author": "Francisco  Weatherspoon",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Great Knipex wrench",
      "text": "Love my Knipex. I am a convert to this brand from poorly made wrenches. Go for the comfort grip, an upgrade from the standard grip. Yes, they are expensive, but if you watch over your tools and don't lend them out, they will be with you forever.",
      "rating": 5.0,
      "verified": true,
      "author": "Merle W",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Incredible quality and brilliant design.",
      "text": "My son recently got a job as an apprentice (commercial/industrial) electrician, and the other electricians on his crew marvel at this wrench/pliers. This tool replaces my sons 12\" crescent ('adjustable') wrench AND doubles as 'pump'/'channel lock' pliers. Incredible quality and brilliant design.",
      "rating": 5.0,
      "verified": true,
      "author": "eichtj01",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Versatile, but there's a small gap in the closed position",
      "text": "I am not sure if the jaws are supposed to have this gap between them. This is the pliers fully closed and the handles squeezed. I compared it to another pair and both are the same. Should it be this way?",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Functional and strong",
      "text": "I use them to tie the plumbing tube joints. Work perfectly without damaging the nuts. the only complain is it is a little uneasy to adjust, the push-down button doesn't restore to up position so freely.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Great Product",
      "text": "I would recommend these to anyone who works with having to put machined connectors together, I work in the Telecommunications field for a Broadband internet and TV provider and these work perfect on our Trunk and feeder lines and they also do not tear up our soft metal connectors we use on our lines. Very easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "Troy",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "A must have if you use adjustable pliers on a regular basis",
      "text": "I work in a brewery and use these pretty much every day. I love the smooth clamps for tightening vinyl gas fittings so they don’t get chewed up like they do with pliers/wrenches with teeth. Super easy to adjust and they look great too!",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy B.",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "One of those tools you dont need but is really nice to have.",
      "text": "These are very nice. It is surprising how much force you are able to put on them. I thought they might tend to slip like channel locks do, but that is not the case.",
      "rating": 5.0,
      "verified": true,
      "author": "Wes",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Where have you been all my life?",
      "text": "I borrowed a co-worker's Knipex and was very impressed with the tool. I decided to get a 6\" one as a carry along tool in my tool bag. I should be able to shed a few of my other wrenches to lighten up the bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Papua Pilot",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Say goodbye to your adjustable",
      "text": "I'll admit at first I was hesitant to believe that this could replace an adjustable wrench but trust me it can. The way the jaw opens up, as you open up the handle, while maintaining it's position makes using these pure joy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Fantastic tool",
      "text": "Great pliers. They have a large range and great grip, and the parallel jaws are a huge plus! I also like the chrome finish, which has held up well under use. Knipex tools are expensive than most other brands, but they are worth EVERY penny. Plus, they are made in Germany, not China.",
      "rating": 5.0,
      "verified": true,
      "author": "Blackboxx",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Lives up to the hype",
      "text": "I was a bit underwhelmed with the Knipex Cobra wrenches, but these pliers are the real deal. Excellent, precise grip and versatility.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Walker",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Expensive, but Awesome",
      "text": "I wish I bought these way earlier. They are a great versatile size, pack away easily and take the place of an entire set of wrenches. I only wish they were cheaper.",
      "rating": 5.0,
      "verified": true,
      "author": "Big C",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Best plier style wrench",
      "text": "I work on industrial equipment, I bought one pair and then after a month bought another to use as a hold back. Fits into tight places and has small increments of adjustment that lock into place (won't move like a typical adjustable wrench). The self ratcheting action speeds up turning whatever you are turning. The ability to squeeze what you are working on beats any crescent wrench and the smooth jaws prevent chewing/marking up what you're working on. After using these I don't think I could go back to using traditional crescent wrenches again.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick R. ",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Great pliers",
      "text": "This is the way these pliers should have been made from the beginning. Lots of gripping strength. Love Knipex tools",
      "rating": 5.0,
      "verified": true,
      "author": "RMM",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Replaces the crescent wrench, vice grips and channel locks...and doesn't booger up your nuts",
      "text": "These are such a dramatic improvement over the crescent wrench, vice grips and channel locks. Yes, there are some times when these traditional tools are great for demolition work. But most times a part needs to go back on and not get boogered up in the process. Very high leverage and great comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20161104
    },
    {
      "title": "Worth it.",
      "text": "Work exactly as advertised. These really do replace a wide range of wrenches, thereby lightening my load. You need duct tape, WD-40, a screwdriver, a utility knife and THESE on almost every job. Buy once. Cry once. Worth every cent.",
      "rating": 5.0,
      "verified": true,
      "author": "G. ConnerTop Contributor: Guitars",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "Knipex quality!",
      "text": "Great fit and finish and the comfort grips are so nice. I especially like the 10:1 leverage advantage so torque isn't an issue. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous ",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Very nice!",
      "text": "They're not cheap and also extremely worth every penny. These make incredible gifts for anyone who uses tools.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse Guilmette",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Awesome Quality",
      "text": "I love this! It allows a better grip than other pliers (neat cam-type design). They are expensive, but I will look to buy more items from Knipex in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "FCLE",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "I love these.  These cost too much.",
      "text": "I love these. I have chano locks, and hate using them. These cost too much, but they are life time, so every time I will use them, I will be thankful to have alternative to hateful chano locks.",
      "rating": 5.0,
      "verified": true,
      "author": "SeeAndSay",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "The Best",
      "text": "If you don't have one (or a set) of these pliers, you have never used them. Once you do, you will never go back to anything else.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel A. Loeffler",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Highly recommend",
      "text": "I had no idea if this kind of tool exist by a few months ago. just buy it and you will like it.",
      "rating": 5.0,
      "verified": true,
      "author": "MyAnonAZ",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "I bought these hoping they were an amazing leap forward in adjustable wrench technology",
      "text": "I bought these hoping they were an amazing leap forward in adjustable wrench technology. They are better. You can grip tighter so you don't have as much play and strip nuts as often, but they are not worth the cost. The adjustment is annoying, you can't just dial it in like you can with a crescent, you need to pull them off the nut and use two hands to adjust the jaws. I wish I'd just played it safe and bought a Klein adjustable wrench. Or 3 Husky or Kobalt wrenches",
      "rating": 3.0,
      "verified": true,
      "author": "mike g.",
      "helpful_votes": 0,
      "publication_date": 20170416
    },
    {
      "title": "Everything you're looking for in an adjustable wrench -  the hype is real!",
      "text": "These things are so well built. I LOVE them. Now I'm wasted for any other tool brand... this was my first Knipex, and I don't think I'll ever be able to go back. Poor wallet.",
      "rating": 5.0,
      "verified": true,
      "author": "Meredith",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Outstanding -- one of the few tools even total laymen should invest in",
      "text": "I'm just a regular guy. I don't work in any trade that requires use of hand tools, and I don't really do a huge amount of maintenance or improvement work around my home. But even I find these pliers incredibly useful. I'd rather own these than a handful of other tools; and certainly more than a bucket-full of cheaply made tools that will fall apart after five years or less, and frequently won't get the job done anyway. I have found these well-worth the investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Schaq",
      "helpful_votes": 7,
      "publication_date": 20120527
    },
    {
      "title": "Perfect hybrid of pliers and wrench.",
      "text": "The parallel moving jaws and the amount of gripping force make this a super tool. KNIPEX makes outstanding tools. And while the initial price may seem a bit high compared to channel lock style pliers the way the jaw functions makes it well worth the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Norris",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "The best! Period!",
      "text": "Knipex makes the best hand tools on the market. Period. So glad that I discovered them.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Wyatt",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Much better than a traditional adjustable wrench",
      "text": "These seemed like a gimmick but I bought them because of my trust in knipex and the good reviews. In my experience so far, they are great. They hold bolts tightly with no fear of rounding and are faster to use than normal adjustable wrenches. Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Lucas",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "Instead, Knipex 8605250 was sent Knipex 8602250.",
      "text": "Hello. Instead, Knipex 8605250 was sent Knipex 8602250. I will not evaluate the goods, as there was an unpleasant residue from the seller’s work. Tell me, how is the issue with the incorrectly sent goods resolved?",
      "rating": 1.0,
      "verified": true,
      "author": "Aleksandr Rozuman",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Versatile and robust tool...",
      "text": "Nothing bad to say other than price and the tool will, unfortunately, outlive you. I'm going to purchase the smallest pair next since I need something for a small toolbox. If you love pretzels and beer, you'll love Knipex tools.",
      "rating": 5.0,
      "verified": true,
      "author": "Skully",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Excellent Pliers",
      "text": "These smooth jawed, leverage action pliers are excellent for applications where you need strong pliers action without marring the surface. I use them to install front sights on handguns, and they are excellent. Have also used the to tighten a sprinkler head where I did not want to scratch the shower head. Yes, they cost a little more than another set of pliers, but after you use them, you'll see why. I would highly recommend these pliers.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Stockholder",
      "helpful_votes": 3,
      "publication_date": 20121028
    },
    {
      "title": "Small with big opening. Awesome.",
      "text": "The best item in my toolbox. Small enough for tight space and opens wide enough for almost all cases. Got the biggest version, ironically rarely used. Love Knipex!",
      "rating": 5.0,
      "verified": true,
      "author": "SKL",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Highly recommend",
      "text": "These pliers do not leave my pocket while I am at work. I am an elevator mechanic and we use metric and standard hardware so these are the perfect fit everywhere. Also very well built.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric R",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "My go to replacement for adjustable wrenches",
      "text": "What a cool product. I grab it instead of my standard adjustable wrenches. So much quicker to adjust and I use in in situations where I might have used pliers too - for example, to hold parts.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Nice tool to have it in your toolbox.",
      "text": "Great tool. It is compact & easy to use around the house.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Nguyen",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Great tool",
      "text": "Save me me plenty of times out in the field my preferred tool to carry around with me",
      "rating": 5.0,
      "verified": true,
      "author": "LeDerrius school acc",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "I use these for EVERYTHING",
      "text": "I use them for darn near everything in my shop. I am truly afraid I will have to buy another pair very soon because a number of my friends have seen me using them in my shop and now covet them magnificently.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon Radowski",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Eleventy stars",
      "text": "Best multipurpose tool I know of, does things I don't know how to do without these. I have this pair in the Electric car and I use them all the time for random stuff. I have the 10\" in the Diesel, and the 10\"+12\" on the workbench.",
      "rating": 5.0,
      "verified": true,
      "author": "Andre Juneau",
      "helpful_votes": 0,
      "publication_date": 20160826
    },
    {
      "title": "High quality",
      "text": "This is a well made tool, comfortable handles, can be used like a ratchet and doesn't round the bolt or nut. The 10 inch size was my choice over the smaller size, glad I got these. They are expensive but should last a lifetime.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill A.",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "So long crescent wrenches",
      "text": "Bye bye crescent wrenches. Love these pliers. Take a little getting used to but once you do you’ll never go back to the crescents. As an added bonus if you are removing a nut from a vertical bolt (nut on the underside) you’ll never drop the nut because the plied maintains a solid grip.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle Capp",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Quality at its finest",
      "text": "U know u bought something quality when hold this in your hand",
      "rating": 5.0,
      "verified": true,
      "author": "Dylan douglas",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Perfect for smaller jobs and the parallel jaws still open ...",
      "text": "Perfect for smaller jobs and the parallel jaws still open wide. The comfort grip handles are a real improvement over the thinner handles on my 10\" version of this wrench.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas R Martin",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "German excellence",
      "text": "Well made tool an excellent alternative to using crummy crescent wrenches. The 10\" is the perfect overall size. I am still getting used to the adjustment mechanism, it's a tad clumsy. But so far I have been pleasantly surprised with the strength & gripping ability of this tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Virginia Hoffman Photography",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "The Best",
      "text": "I use these on a regular basis in gun armorer work. The smooth jaws do not mar the surface, and the leverage of these pliers give it enormous grip. You can buy these at various retailers, but Amazon makes it easier and a few bucks cheaper. So if you need a great pair of strong, non-marring smooth jaws, these are for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Stockholder",
      "helpful_votes": 7,
      "publication_date": 20121028
    },
    {
      "title": "I love this thing.",
      "text": "Best adjustable wrench ever. Works better than vise grips. And replaces most crescent wrenches.",
      "rating": 5.0,
      "verified": true,
      "author": "Ric Sitnek",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Fantasy",
      "text": "These are great! Im a maintenance man. I carry these and the smaller on my belt at all times. They get great grip on bolts or anything else you can grab with them. built right they take the place of a crescent wrench,pliers,small hammer,prybar and 3 other tools but I'll let you figure out the other 3.",
      "rating": 5.0,
      "verified": true,
      "author": "90bs117",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Great tool but could have been finished better.",
      "text": "The Knipex (Model 8605250) 10 inch pliers are a great tool to have as they serve multiple roles from pushing in pins to turning soft pipe nuts without rounding the corners. The only drawback I can see is they they are kind of roughly finished in the grinding/polishing of the metal. However, I am sure they will be strong enough to provide years of reliable service.",
      "rating": 4.0,
      "verified": true,
      "author": "faceman",
      "helpful_votes": 0,
      "publication_date": 20150316
    },
    {
      "title": "The parallel jaws adjust easily and clamp down without any jiggle.",
      "text": "I got this and the seven inch version as well, replacing an odd collection of heirloom crescent wrenches with two nice tools. The parallel jaws adjust easily and clamp down without any jiggle. It does have a quality feel to it and fits well in the hand.",
      "rating": 5.0,
      "verified": true,
      "author": "AverageJoe",
      "helpful_votes": 0,
      "publication_date": 20161029
    },
    {
      "title": "Very good for its price!",
      "text": "I love the entire feel to this. The grip is comfortable and it gives you the satisfaction knowing its durability will last you for a very long time while still feeling like it is still new.",
      "rating": 5.0,
      "verified": true,
      "author": "Mayra",
      "helpful_votes": 0,
      "publication_date": 20200507
    }
  ],
  "product_meta": {
    "title": "KNIPEX Tools - Pliers Wrench, Chrome, Multi-Component (8605250)",
    "description": "Style:10-Inch Comfort GripMade In Wuppertal-Cronenberg, Germany. In Addition To Quality, Innovation And Performance, Other Important Cornerstones Are Sustainable Actions And Value-Guided Orientation.\n\nFROM THE MANUFACTURER\nThe Knipex 8605250 10-Inch Pliers Wrench (with Comfort Grip) is excellent for gripping, holding, pressing and bending work pieces. The comfort grip handles are made of two colors, dual component material providing a comfortable grip during continued use. The high lever ratio, parallel jaws without profile and infinitely variable adjustment guarantee a secure and smooth gripping of the work piece free from backlash. . Zero backlash jaw surface pressure prevents damage to edges of sensitive components. Fast adjustment directly on the work piece by pushing a button. The action of the jaws allows screwed connections to be tightened and released quickly using a ratchet principle. Lever transmission is greater than 10 - 1 for strong gripping power. Can also be used for tile breaking.",
    "rating": 4.8,
    "feature_bullets": [
      "Precision Grade Performance Tools",
      "The Number 1 Choice Of Tradesman Worldwide",
      "Comfortable In Use And Quality Assured Design",
      "Fit To Match The Needs In The Shop, At Home Or In The Service Field",
      "Each Tool Is Proven And Tested For Durability And Function In Real World Use And Conditions"
    ],
    "specifications": {
      "Manufacturer": "Knipex Tools",
      "Part Number": "8605250",
      "Item Weight": "1.26 pounds",
      "Product Dimensions": "10.43 x 2.21 x 0.91 inches",
      "Item model number": "8605250",
      "Is Discontinued By Manufacturer": "No",
      "Size": "10\" inches",
      "Style": "10-Inch Comfort Grip",
      "Item Package Quantity": "1",
      "Number Of Pieces": "1",
      "Measurement System": "Inch/Metric",
      "Included Components": "1 Knipex Branded Product",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B000X4J2EI",
      "Customer Reviews": "4.8 out of 5 stars601 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#9,940 in Tools & Home Improvement",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "March 29, 2005"
    },
    "categories": [
      "Hand Tools",
      "Pliers",
      "Tools & Home Improvement",
      "Power & Hand Tools",
      "Slip-Joint Pliers"
    ],
    "price": 53.89
  }
}