{
  "website_summaries": [
    {
      "verdict": "Aside from a few possible frustrations, this is a great STEM toy if your child is interested in learning about electronics.",
      "pros": [
        "Award-winning toy",
        "Provides a fun way for kids to learn about electronics",
        "Includes parts for constructing working alarms, radio functions, and more",
        "Over 300 possible projects"
      ],
      "cons": [
        "Occasional quality control issues, including missing parts and non-working circuits upon arrival",
        "Some parts are a bit flimsy",
        "Instructions could be better"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It's not super engaging for a kid who isn't already super engaged ...",
      "text": "I bought this for my 9 year old daughter to try and get her more into STEM projects and it's a little bit intimidating as a first dive into the field. It's not super engaging for a kid who isn't already super engaged in this stuff. The snapboard is fantastic, and the pieces are great. The projects are interesting, but again, as much as it pains me to admit, its not gonna grab the attention of every kid.",
      "rating": 4.0,
      "verified": true,
      "author": "Space Kabooms",
      "helpful_votes": 18,
      "publication_date": 20180124
    },
    {
      "title": "Love this Awesome Circuits Set",
      "text": "I bought this for my eight year old son for Christmas. Both his father and I were electronics technicians in the Navy and I thought it would be a fun way to share some of our experience with him. We hadn't had a chance to play with it yet, and I was busy today in my office. My son was in his room playing and came in to my office to show me how he had created a fan circuit by reading the manual. Sure enough, once we put in the batteries and closed the switch, it worked like a charm. This is a great little kit for use one on one or in group play.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi S",
      "helpful_votes": 12,
      "publication_date": 20171231
    },
    {
      "title": "Fun kit instructs on what to do, but not why",
      "text": "Bought these for my nephew's 9th birthday. He likes to do the Lego kits but I wanted something with more \"cause and effect\". These snap circuits are great! He and his 6 year old sister have a blast following the diagram and seeing what they can create. I'm sure there's some educational benefit but I don't see how much you can really learn about electricity by playing with the circuits without supplemental content. It might spark an interest in learning about how electricity works though.",
      "rating": 5.0,
      "verified": true,
      "author": "sal",
      "helpful_votes": 9,
      "publication_date": 20180627
    },
    {
      "title": "Perfect for Inventive and Creative Kids!",
      "text": "Got this for my 9 year old for Christmas and he wasn't too excited at first because it looks like a unique Lego-type (but knock off) building set. That's before he cracked the book and read about all the crazy cool electronic gadgets you can create using these pieces. He sat down and without any assistance, dude created a working AM radio!!! That blew all our minds but really lit a spark in his creative juices. Thank you for another activity that uses the mind and a bit of creativity! Shipping was prompt and overall buying process was painless.",
      "rating": 5.0,
      "verified": true,
      "author": "J. HATHAWAY",
      "helpful_votes": 4,
      "publication_date": 20190103
    },
    {
      "title": "and they LOVE it. I feel it increase critical thinking and ...",
      "text": "I bought this for my 6 and 7 year old daughters, and they LOVE it. I feel it increase critical thinking and meta cognition. It is a great way to get kids detached from screens and engaged in real play. I have to admit that i spoil my daughters, and buy them a lot of toys; nonetheless, this is a top 5 buy. It is a quality product and built to last. I also enjoy playing with it. I would surely purchase again. Can't recommend enough for parents who want their kids to be thinkers as opposed to screen zombies.",
      "rating": 5.0,
      "verified": true,
      "author": "Na'eem Abu Hafsa",
      "helpful_votes": 4,
      "publication_date": 20171215
    },
    {
      "title": "Fun for the entire family",
      "text": "Fun for the entire family, We got this for my 11yr old daughter and she loves making all the different things work. You can even create your own circuits work that are not in the book. Very safe to use as well.",
      "rating": 5.0,
      "verified": true,
      "author": "JESSE",
      "helpful_votes": 4,
      "publication_date": 20171228
    },
    {
      "title": "Hours of fun STEM lessons and bonding activity for whole family",
      "text": "Bought this kit for my 8yr old grandson. He wants to build robots when he gets older, so I thought this is a good starter kit to begin to understand electronics and circuitry. He was excited to build the lie detector, but disappointed that it didn’t actually work. However, he understood the concept. He was delighted to find that the other projects worked. It has turned out to be a great father- son activity, even his younger sister has joined in on the science. I can’t wait to buy him and his sister add-on kits in the future.",
      "rating": 4.0,
      "verified": true,
      "author": "T YoYo",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "These activities are FANTASTIC!",
      "text": "Love thesevandvsondo my students. I thought the directions would be difficult for third and fourth graders but they actually give them the opportunity to problem solve. These activists have kept the students engaged and interested! It is especially neat to see that even my students who struggle in other content areas stage engaged and motivated with these hands on, fun projects!",
      "rating": 5.0,
      "verified": true,
      "author": "J.B.",
      "helpful_votes": 2,
      "publication_date": 20180611
    },
    {
      "title": "LOVE!!!",
      "text": "Such a great toy that is full of learning too! It's fun for the whole family. My daughter received it as a gift and was skeptical at first. Once she started building, she was hooked. I love that she can explore engineering in a fun way! I was worried that she would seem too old for it (she's 10) but that wasn't the case at all. Great product that makes a great gift!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Avid Reader",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Great Value and Fun!",
      "text": "Kids love this and the product is awesome. Teaches them logic and circuits and it's a lot of fun. They see it as a hands on game to build the projects one after the other. Teaches attention to detail too. If a single connection is wrong or not snapped in place correctly - the project probably will not work as designed. They then have to retrace and check everything to see where the problem might be. Great thinking game for kids. Good for small groups of kids too. They can work together on projects.",
      "rating": 5.0,
      "verified": true,
      "author": "User 47",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Very dissatisfied, manufacturing defect.",
      "text": "We had very high expectations from this Snap Circuits product. My son was very disappointed when we realised that it was not working. After trying to figure out if we were doing something wrong, we finally figured out that one of the leads in one of the battery packs was not soldered on properly and that it was not making contact as you can see in the attached pictures. Such a basic manufacturing error is unacceptable, as I wonder now if there were any quality checks done at all. Will be returning this.",
      "rating": 1.0,
      "verified": true,
      "author": "Uma Keskar",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Snap Circuits Classic SC-300 Electronics Exploration Kit",
      "text": "Another winner for the grandparents and granddaughter! All pieces were in tact, appear to be relatively well made. The 1st project she assembled was the lie detector which was fun but likely not too accurate. She assembled several other projects but enjoyed the obnoxious multiple sound generating project the most...imagine that! She will be experimenting with this kit for days to come.",
      "rating": 5.0,
      "verified": true,
      "author": "JDDD",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Great gift. Components are cheaply made. Great customer service",
      "text": "Bought this for my son and the concept is actually pretty cool. Plenty of designs to choose from. Unfortunately some of the components are cheaply made. Customer service is great though so they’ll send you any pieces that break. Pros: great kid gift Cons: some of the snap on circuit components are cheaply made and will break which means you’ll wait a couple weeks while the vendor sends you a replacement piece.",
      "rating": 4.0,
      "verified": true,
      "author": "H. Kang",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Intuitive introduction to basal circuitry through coding path",
      "text": "The manual does not match the pieces but that provided a good challenge for gifted students who found other activities too easy and boring; such as the Bee Bot coding activity. This kit engaged clever children aged 6 to 11 in my experience, and some adults were challenged also. The kit affords an introduction to capacitors and resistors to form basal circuitry through snap circuit boards ; switches, dry cell holder, fan, light, speaker et cetera. I used this when teaching coding to challenge the brighter children in the class. It is very affordable. I found it fufilled the sound and light toy assessment item in Queensland.",
      "rating": 5.0,
      "verified": true,
      "author": "catherinelcurran",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Excellent introduction to circuits",
      "text": "Never knew this will be so exciting. At last, the toy I can play together with my 4y old son, without dying of boredom. You can make the real working AM radio and listen to some Mexican station with the music of 80s. The only thing I don't like much - rigid connectors. It's fine to use rigid strips for power lines, but when you have some bright idea and you still need to spend 15 minutes thinking about how to connect all components, when you could just use colored wires instead - arghhh. Anyway - top toy, without a doubt.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Fun and doable",
      "text": "My husband got this for our 8 year old son who was able to follow the instructions and get it working with ease and interest. Our 7 year old daughter was also interested and was able to do it as well. They had a lot of fun and it challenged them without being overly difficult. Best of all they were able to put the parts back in the box properly for storage.",
      "rating": 5.0,
      "verified": true,
      "author": "hdcollins85",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Amazing!",
      "text": "My son (who never sits still and would rather be outside playing) has loved this!!! So glad I got the bigger one. Tons of experiments and they have ALL worked so far! My son is 8 and isn’t naturally inclined to things like this but there is enough to keep him engaged with all the fun experiments! Would buy again and may be looking at a bigger kit!",
      "rating": 5.0,
      "verified": true,
      "author": "Clifford E. Dyson",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "I am glad I went with the larger set",
      "text": "Ordered this for an adventurous 9 year old. He was a little reluctant to get started, probably thinking it was going to resemble work, but he quickly got interested and engaged. He was so excited to show off the projects he created. I am glad I went with the larger set, I think he will use all the pieces.",
      "rating": 5.0,
      "verified": true,
      "author": "F. L. Pettet",
      "helpful_votes": 2,
      "publication_date": 20180102
    },
    {
      "title": "Fun and educational gift!",
      "text": "We ordered the smaller snap circuits for my son a few years ago. He loved them so much that we bought this kit for his 8th birthday. He was thrilled. He has been doing projects everyday since he received the kit. Everything has worked well so far. The circuits do use a lot of batteries, but my son loves reading the projects and putting them together independently. This is a great gift for a child who likes to build and create.",
      "rating": 5.0,
      "verified": true,
      "author": "Dena",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Does not teach",
      "text": "The manual explains what the circuits do, and how to assemble them, but it does does not teach how they work. It also does not provide any info on what the expected multi-meter readings should be around the circuit.",
      "rating": 2.0,
      "verified": true,
      "author": "Nobody",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Fun and Lots of Options",
      "text": "This has been a fun toy for our 7 & 9 year old. Both my wife and I love doing it with them as well. It is fun all the different options there are. Keeps them entertained and gets them looking carefully at minor errors they may have made if it doesn't work right way. Really fun and love how focused they stay with this.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Love it",
      "text": "My 8 yr old daughter loves these and has actually gleaned quite a good understanding of electrical circuits and electricity on the whole as a result of playing with it. Would definitely recommend, especially if you buy the battery eliminator so you can just plug it in rather than buying countless batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "UKmom",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Great STEM toy",
      "text": "My 6 y/o son got this for x-mad yesterday and has already worked his way through twenty of the projects. He’s obsessed so I’m happy, even if I don’t totally “get” it. He is very into legos, building this, etc. so this is right up his alley. None of my daughters had any interest in this, as their interests are different.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim9292",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "My 6yo Nephew Loves it.",
      "text": "He needs help with it still but it is a good distraction that draws him away from the tv. He is pretty much just putting them together like Lego but he does some experimenting not much works in his experiments but he has fun. I think he will get more out of it as he gets older the nice think is there are lots of add-ons to keep him going as he grows.",
      "rating": 5.0,
      "verified": true,
      "author": "Sexy BoBo",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Cool stuff but younger children will definitely need adult help/supervision",
      "text": "My grandson and I have had hours of fun together building these projects. Even though he is a little young for it, I have been able to teach him some rudimentary concepts using the kit. Would like to see schematics included with the projects. I think that would be a valuable learning tool.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Looney",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Easy for younger children to use.",
      "text": "Bought this for Christmas 2017 for an almost 4 year old. She plays with it quite a lot and her 6 year old brother enjoys it too. The magnets are strong enough to hold whatever they build together. My only complaint is that for the price it would be nice to have a few more pieces for more building options.",
      "rating": 4.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Super fun and educational!!",
      "text": "Gave this to my son for his 10th birthday.. I was worried that he may be to old for it but it was perfect!! He played with it for weeks, we all did really.. it’s easy to understand the instructions and the pieces fit together perfectly.. I wish I had heard of it sooner as I would’ve gotten a set for my older son when he was little.. But like I said, everyone plays with it!!",
      "rating": 5.0,
      "verified": true,
      "author": "GoosesMother",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "It is so SO nice to have a learning toy like this that I ...",
      "text": "My 6 year old LOVES this set. He is learning a lot from it and can follow the directions without needing help. It is so SO nice to have a learning toy like this that I don't have to read the directions and do most of the work for him. I absolutely recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "30somethingShopperMom",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Great gift!",
      "text": "This was a gift for our 11yr old grandson. We gifted him the smaller set last year and he was really excited about it. This set allows him to expand his knowledge and his interest and he was very excited to receive it. It’s actually fun for an adult helping him to learn as well.",
      "rating": 5.0,
      "verified": true,
      "author": "hgw2",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "They loved them, but these are fun for everyone",
      "text": "I bought these for my 7yr old girl and a different set for my 6yr old nephew (boy). They loved them, but these are fun for everyone. When these are out on the table everyone ends up playing. Such a smart product to get any mind thinking. After sitting with my daughter for a bit she was able to complete the easy experiments alone and soon started trying her own. My nephew who is an engineer at heart and a lego lover could play with these for hours alone without a word",
      "rating": 5.0,
      "verified": true,
      "author": "Kelcie",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Perfect toy for our future engineers",
      "text": "This is an absolutely must-have for any young boy even up into teens it has over 300 things to build from simple to complex Perfect to begin to understand engineering",
      "rating": 5.0,
      "verified": true,
      "author": "nicole m. anderson",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Fun and easy to assemble",
      "text": "My daughter is younger than the age they suggest, however, she had a lot of fun assembling the pieces and was excited to see her creation. I had to assist as she is younger than 8 but an 8 year old can totally do it by herself/himself",
      "rating": 5.0,
      "verified": true,
      "author": "dlh",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Great for learning",
      "text": "When my nephew received the Snap Circuits Classic SC-300 he was so excited to begin he could hardly wait. It will keep him busy learning for a long time. The parts and circuit boards are high quality and the cost is more then fair",
      "rating": 5.0,
      "verified": true,
      "author": "DENISE GONZALEZ",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Love this toy",
      "text": "My kids love this. Even my older kid has had a blast playing with this. It teaches great lessons about quality work and follow through as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Crazy Reader",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Well worth a few dollars more.",
      "text": "Excellent product! My 7 year old grandson loves it and has completed over 65 projects in less than two weeks. His understanding of electricity and electronics is growing daily. He loves following instructions and this kit is well done. At first I thought this kit was a bit overpriced, but the quality of the parts and instructions make the cost palatable.",
      "rating": 5.0,
      "verified": true,
      "author": "John Steed",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Fun & Learn at the same time!",
      "text": "Purchased this for our grandson age 8 Birthday. He loved it. Not only did it keep him busy for hours but his older brother 15 and his Dad joins in on the projects. Creating an AM Radio and actually hearing the stations work is only 1 of the amazing items. For Christmas we purchased an additional kit giving him even more options. Opening it he said, “Wow, I got the upgrade to make more things!” This is incredible, with easy to follow instructions. It’s a winner for anyone looking to help a child have fun learning.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "So much fun",
      "text": "My kids love this gift. They will spend hours playing and creating circuits. It was a gift for my nine-year-old at Christmas and he absolutely loved it. My 10-year-old and my six-year-old also enjoy playing with snap circuits.",
      "rating": 5.0,
      "verified": true,
      "author": "Lyla",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Fun for all ages",
      "text": "Great product. I first used this in my Engineering class at UNR and knew I had to have one of my own. It will keep people of all ages busy for a good while. Knowledge is Power!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Perdue",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Extremely Age Appropriate Gift for Age 7 and above. It is fun",
      "text": "I would highly recommend this as a gift or purchase for 7 and above I bought it for my son turning 8 this July. This has intrigued and keeps him engaged every afternoon. This is a fun experiment toy and much better to spend $ on this rather than other one-time use toys",
      "rating": 5.0,
      "verified": true,
      "author": "Mandip Kumar",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Pretty cool",
      "text": "Overall, I've enjoyed using this with my grandson. He's quite fascinated by the circuits that light up or make sound. However, a couple of them just don't work, but most of the designated circuits do exactly as described.",
      "rating": 4.0,
      "verified": true,
      "author": "JAL",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Kid loves it",
      "text": "This is an excellent kit to start kids on basic electrical theory. Girlfriend's son just turned 10 and he loves the kit. If your kid is old enough to build Lego kits on their own, they are old enough to assemble the snap together electronics kits.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Great for all ages!",
      "text": "I bought this for my 25 year old friend who likes to put things together. He LOVED it. So much fun to put them together and get the mind turning! (MBTI: If you’re an INTJ OR INTP you might love this)",
      "rating": 5.0,
      "verified": true,
      "author": "Mackenzie Westphal",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Perfect for our 11 year old!",
      "text": "My son LOVES this kit. There are over 300 projects to do. It starts with project number one which is the simplest and leads you up to more complex things. The book explains why and how each project works so you learn as you go and can create your own projects.",
      "rating": 5.0,
      "verified": true,
      "author": "SassyCassie",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Best electricity STEM Set ever!",
      "text": "This is probably the best STEM set I have ever bought. My husband is working through the projects with my 6 year old grandson. They are having so much fun together. The instruction set is very clear. The product is so well thought out. All the pieces just snap together and it seems very well made to endure lots of use.",
      "rating": 5.0,
      "verified": true,
      "author": "anna rice",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Great Gift",
      "text": "My son has played with these for countless hours. He's a creative engineering type and loves to adjust the setups to find what it will do. He plays the happy birthday program for EVERYONE!! Great buy!",
      "rating": 4.0,
      "verified": true,
      "author": "Travis",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "10 year old girl loves it",
      "text": "My grand daughter has been building all the suggested circuits and really like this gift. She has done some after school robotics last year so this is a great extension of that learning experience.",
      "rating": 5.0,
      "verified": true,
      "author": "Sable",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Good product...",
      "text": "Good gift for kids, interesting circuits, help to learn basics of electronics. It is nice to see kids sit together discuss and design the projects. As an adult you also need patients to explain the kids when they put questions.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Snap Circuits are a hit!",
      "text": "My daughter loves snap circuits, and I have to admit, I do too. It is fun putting the circuits together and if it doesn’t work problem solving. A lot of skills can be learned from this terrific toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Mommy of one",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Amazing fun",
      "text": "We started with the 300 projects set for our 6 year old, he loved it, the parts are really well made and seem pretty durable. the instructions are clear and easy to follow. Lots to do and learn.",
      "rating": 5.0,
      "verified": true,
      "author": "G R",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Gift with unexpected result",
      "text": "Bought this for a coworker's son. He and his dad bonds over it. I like it for that reason alone. It is a great design and very practical for learning...even for older audiences. Great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Integrity",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Simply amazing",
      "text": "I absolutely love this set. The kids enjoy playing around with it as well. We make sirens for their police and fire trucks as well as lights and other little circuits.i can not say enough good things about this set.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "I love that is it not connected to the TV and ...",
      "text": "My 10 year old received this as a Christmas gift and play with it for 3 days straight. I love that is it not connected to the TV and is not an iPad :) It was fun seeing him get excited about the creations he made. The book comes with a ton of ideas, but he was able to make a lot of his own. I would highly recommend this product. My 7year old has asked to play with it several times. My 10 year old finds it hard to share this toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Good buy",
      "text": "This is a really neat kit to help kids have fun while they are learning about circuits. I use these kits in my physical science class and the instructions are understandable and easy to follow.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "They provide a good hands-on activity to demonstrate photo resistors",
      "text": "I am using these as an introduction to electrical circuits. They provide a good hands-on activity to demonstrate photo resistors, diodes, transistors and more. By having the students measure the voltage across the circuits, it helps to show the current flow. I teach a mechatronics class at a high school technical education center. I use these in conjunction with electronic trainers and the standard breadboard to provide different ways for the students to learn.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "This is very educational.",
      "text": "My grandson, age 9, loved getting this gift. He started to join the components together to make the projects right away. Then, he went on to \"invent\" a few more on his own. I know he'll enjoy this and learn from it for awhile.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Klopfenstein",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Great gift for kids.",
      "text": "This was a gift for my 6 year old son. He loves this set so much. He needed a little help at first understanding the directions but quickly got it. It's a very nice gift for kids into this type of thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Fun",
      "text": "It is fantastic! Lots of things to build, the diagrams are great and it is all included(except for batteries). Love it!! BUY IT! Even if your kid doesn't like it (mine does) you will!",
      "rating": 5.0,
      "verified": true,
      "author": "tommy",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Hard to follow directions",
      "text": "This should not be used to teach but it is rather more of a toy. Breadboard kits are much better for older children and adults wishing to learn and experiment on their own..",
      "rating": 3.0,
      "verified": true,
      "author": "bookwormser",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Great projects",
      "text": "My son loves the snap circuits. He is engaged with a lot of projects, builds them, takes them apart and builds them again. He already has his favorite ones. Use of speakers and lights are wonderful, you can directly see and hear the effects. He built an AM radio this evening he was very proud of, even listened to the presidential debate and then sports coverage he was super amazed about.",
      "rating": 5.0,
      "verified": true,
      "author": "Nino Chelidze",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Great value product",
      "text": "My 12 yr old boy had science fair in the school, and asked me to purchase Electronic Circuit for him. He loves this kit. It is totally age appropiate, easy to assmble, very safe. And good learning and play experience!",
      "rating": 5.0,
      "verified": true,
      "author": "Monica 507",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Awesome!",
      "text": "Awesome for kids teaches them how to follow instead learn details and keep curiosity piqued with multiple project options. I paid over $200 for my daughter to attend camp invention and this gift provided her with more challenge and greater challenge",
      "rating": 5.0,
      "verified": true,
      "author": "JOEY",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Great learning toy!",
      "text": "I bought this as a Christmas present for my 8 year old grandson. He loves it! I agree with one reviewer that it doesn’t necessarily teach a child all about electricity but I believe it starts giving that basis of understanding which will make the concepts much easier to understand in the future. For example he learned that water conducts electricity. After doing only about 5 of the projects my grandson was off creating his own experiments! The instructions are fantastic! Definitely a buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "son enjoys",
      "text": "I've given smaller snap circuits sets to my boys in the past and they enjoyed them greatly. They were able to complete various projects independently; proud to show off their accomplishments.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Great fun gift for my 7 year old daughter",
      "text": "I purchased this for my 7 year old daughter. She enjoys science and experiments. It starts off very easy and the instruction are very easy to follow. It has gotten her interested in electricity and how controls work.",
      "rating": 5.0,
      "verified": true,
      "author": "dan",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Every child loves this toy",
      "text": "Every child loves this toy. Its easy to tailor to different's kids abilities with adult help, and has many different ways of play. I gift it often for kids 4-12!",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla Walrath",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "For Curious or Engineer minded",
      "text": "This is an amazing building set . Our 7 and 10 year old grandsons equally enjoyed making the variety of shapes and forms from the instructional guide. Lights, action and movement!",
      "rating": 5.0,
      "verified": true,
      "author": "booklover*",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Fun and Educational",
      "text": "I enjoyed working with my eight year old granddaughter to go through the experiments, step by step. The experiment build on each other in an orderly manner. She developed her own process for following the diagrams and keeping the components where they belonged until they were needed.",
      "rating": 5.0,
      "verified": true,
      "author": "LarryF",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "STEM geared without being complicated",
      "text": "such a cool concept. my 7 yr old loves snapping the pieces together making science happen. Awesome for parents looking for an interactive STEM toy. I would recommend anyone looking for something cool and unexpected this is your gift. We keep coming back to play with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Belair",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Great gift for kids",
      "text": "My 8 year old son got these for Christmas and will play with them for hours on end. He's started veering away from the projects listed in the booklets and making his own circuits using what he's learned.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "Super fun",
      "text": "I have a 3 yr old and 5 year old. With husbands help they were able to make a radio. Flying disk. And light. They love it. Husband maybe more then kids. But it’s a fun whole family game",
      "rating": 5.0,
      "verified": true,
      "author": "mrs.roach",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Great fun and educational!",
      "text": "8 year old step son loves it. He’s made over a dozen of the experiments. I bought it to get him to take a break from screens/video games. Works like a charm and he actually thanked me and marveled at how cool it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyful-reader",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Great product to get kids interested in science",
      "text": "My nine year old granddaughter had used a different model at her school and was excited about it, so gave her this version for Christmas. She played with it first and was quite excited. Good quality product and excellent idea. As a retired electronics engineer, I like to see the newer generations this interested in science.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebl",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Missing pieces, hard to use, the projects are ...",
      "text": "Missing pieces, hard to use, the projects are not doing what they are supposed to do - light up, make sounds, etc. had to return.",
      "rating": 1.0,
      "verified": true,
      "author": "Book Lover",
      "helpful_votes": 2,
      "publication_date": 20180718
    },
    {
      "title": "Build lots of things!",
      "text": "My 8 yo grandson was over the moon with this. He called one day and was playing a radio he had built with it. He dismantles the projects and builds other things with it.",
      "rating": 5.0,
      "verified": true,
      "author": "gopher 10",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Excellent electrical learning tool",
      "text": "This reminds me of the Radio Shack circuit kits as a kid. What I like better about this is the circuits are faster to build and the book is much more readable/approachable. The kids ask great what if questions when working with it that we explore. Great way to get kids interested in science.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Zerfas",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "As advertised",
      "text": "Got this for a bratty nephew whose father got more joy out of it. Give it to a kid with the right propensities and they’ll definitely get something out of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Ramirez",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "10 yr old loves it",
      "text": "Purchased for gift for 10 yr boy. He loves it--he had no experience with this type of kit. He and parents have had great fun doing the projects together. Kit has plenty of projects and is a good starter.",
      "rating": 5.0,
      "verified": true,
      "author": "mrsmyke",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "He and my 6 year old played with it for hours this morning and I am sure that it will continue to add many more hours of fun. If you add on a little bit of ...",
      "text": "My son turned 8 and this was his birthday present. He and my 6 year old played with it for hours this morning and I am sure that it will continue to add many more hours of fun. If you add on a little bit of explanation to what is happening it becomes a great educational opportunity.",
      "rating": 5.0,
      "verified": true,
      "author": "Maplebear",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "Fun and educational",
      "text": "Bought these for my six year old daughter and she loves it! The directions can be a little tricky ( for me, not so much for her!). Everything she has build has worked great! She loves the doorbell ones. She gets super excited when it does what it’s supposed to do! Great educational toy!!",
      "rating": 5.0,
      "verified": true,
      "author": "lakegirl",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Fun Educational Toy",
      "text": "My son (age 9) loved this Snap Circuit set. He spent a whole day doing projects and even made up his own. Not for younger kids, as there is a \"short circuit\" risk that could destroy the toy that requires you only put the circuits together in a certain way. Appropriate for kids who are able to read and follow the directions.",
      "rating": 5.0,
      "verified": true,
      "author": "S R.",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Great STEM product for kids!!",
      "text": "I bought this for my 9 year old. He loves it and was a great way to teach him about electricity and circuits. He even wanted to make his own experiments.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Sleight",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Great product.  Not without flaw",
      "text": "Great, fun, educational product, but not without flaw. Specifically, the spinning motor is finickey. It doens't like to be snapped down all the way and many of the projects that involve this module fail to work as designed because of this and other aspects of its poor design.",
      "rating": 4.0,
      "verified": true,
      "author": "Robvs",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Pretty cool learning toy for kids",
      "text": "I bought this for my 9 year old. Really easy to set-up - maybe too easy. Teaches some good basic concepts. He whipped through the book pretty fast.",
      "rating": 4.0,
      "verified": true,
      "author": "Tia",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "After a stroke, I took sessions at a Neuro ...",
      "text": "After a stroke, I took sessions at a Neuro Rehab Clinic that uses this toy to help victims with spatial perception and functioning. I bought one for myself to use at homeand it does help me. My grandson loves to play with his Granny's toy also !.",
      "rating": 5.0,
      "verified": true,
      "author": "Piecemaker",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Every child should have one of these kits",
      "text": "Our kids love doing the projects in the book that are included with this kit. The designs are clearly illustrated and fun.",
      "rating": 5.0,
      "verified": true,
      "author": "jrjohn77",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Fun and creative",
      "text": "We rarely follow age suggestions. Both my children love this set. (I do as well!) comes with plenty of step by step instructions to make projects, which were a springboard for our own creative ones!",
      "rating": 5.0,
      "verified": true,
      "author": "Libby DeSotel",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Pretty cool.",
      "text": "My daughter enjoys this. Not sure what the age range is, but my 9 year old has no problem working with it and building the projects on her own. Project \"schematics\" could've been clearer, but I don't have any recommendations, so I can't complain.",
      "rating": 5.0,
      "verified": true,
      "author": "Knives",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Entertaining and Educational!",
      "text": "Birthday gift for my grandson age 7. He loves it and can play by himself or with others. The storage system is awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "VAM",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Kid and Adult friendly",
      "text": "I’m pretty sure my boys loved it but honestly hubby had more fun putting it together. There are many different combinations in the book. The wiring is covered by plastic to make it easier for little fingers to make the connections. I’m not sure if they understand the concept, but they did like turning the buzzer and light on.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Sanchez",
      "helpful_votes": 3,
      "publication_date": 20180103
    },
    {
      "title": "Super fun",
      "text": "Easy to use and educational. Many experiments with the included pieces. Keeps the kids entertained for hours and they don’t even realize they are learning.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Forton",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "My 8 and 9-year-old absolutely love this set",
      "text": "My 8 and 9-year-old absolutely love this set. One likes princess toys and the other video games, but they both enjoy this set very much. They take turns coming up with different combinations and I can hear them laughing like crazy when they come up with something new that makes the fan fly in the air or the music play. It's a very cool set and well worth the purchase price.",
      "rating": 5.0,
      "verified": true,
      "author": "Betty",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Better than legos",
      "text": "The boy we got these said that they were better than legos. Which coming from him was a very high compliment, as legos are a favorite toy of his.",
      "rating": 5.0,
      "verified": true,
      "author": "huntingstill",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Perfect for gift",
      "text": "Helps kids understand electricity conduction and it is a quality product. Easy to configure and take apart to reconfigure.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Great toy",
      "text": "I got this toy for my Grandson and he loves making all the different connections. Keeps him occupied for hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Marlyn R. Hoksbergen",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Great educational toy!",
      "text": "Gave it to my 8 years old son for Hannukah. He loves it! Good quality, instruction book with many chellenges, everything works smoothly. Great value as well. It feels like $80-$100 toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Valeria Z. G.",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "Great idea",
      "text": "My kids love this. It's easy to understand the diagrams. It's age appropriate. This is also great in getting kids off electronics.",
      "rating": 5.0,
      "verified": true,
      "author": "GREAT",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Good boy or girl gift",
      "text": "This was the absolute best gift to get my grandson who is 8. He played with it nonstop and it made him think.",
      "rating": 5.0,
      "verified": true,
      "author": "Faithnjc",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "the kids really like this, and worth doing as a starter to ...",
      "text": "the kids really like this, and worth doing as a starter to expand later if the children enjoy this one. .. simple and fun",
      "rating": 4.0,
      "verified": true,
      "author": "Frank A Mastromauro",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Wonderful family time activity and STEM focus",
      "text": "We got this gift for my 6 year old daughter who loves STEM projects. She sits down with my husband and does a few experiments a night. They very much enjoy this product as a family time activity. Once, shes older our goal is to have her assemble it solo. It's wonderful in helping them understand reading directions and following step by step instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia Chaney",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Hours of fun",
      "text": "My grandchildren are really enjoying this item. They spent more than two hours creating, laughing, and launching the helicopter blade.",
      "rating": 5.0,
      "verified": true,
      "author": "Char",
      "helpful_votes": 0,
      "publication_date": 20191231
    }
  ],
  "product_meta": {
    "title": "Snap Circuits Classic SC-300 Electronics Exploration Kit | Over 300 Projects | Full Color Project Manual | 60+ Snap Circuits Parts | STEM Educational Toy for Kids 8+,Black,2.3 x 13.6 x 19.3 inches",
    "description": "Product Packaging:Standard PackagingLet your child have endless fun learning to build circuits with these colorful electronic Snap Circuits. Each one features more than 60 parts that easily snap together. The Snap Circuits Classic can be used to make interesting circuits, encouraging educational play that teaches your future engineer about electricity. All of the parts have colored graphics that represent their real electronic names and symbols. This educational toy comes with a complete instruction manual and project guide that helps you to guide your child through exploring over 300 experiments. Some of the projects include making circuits for doorbells, radios, alarms, flash lights, laser light, street lamps, a lie detector and a fan Modulator. This kids' Snap Circuits toy runs on four AA batteries that are sold separately. It is ideal for children age 8 years and older. Snap Circuits Classic comes with over 60 parts to create 305 different electronic projects. The parts, which include snap wires, a slide switch, a resistor, a microphone, and capacitors, snap together easily onto the included plastic grid--no soldering required. Each part is numbered and color-coded to make identifying them easy. These parts combine to create working circuit boards just like the ones found inside televisions, radios, and other electronic devices. With its easy-to-follow instructions, Snap Circuits gives your child a hands-on education in how electrical circuits run the everyday devices that they're familiar with. They'll also gain valuable lessons in building and in following instructions. The project manuals include large color illustrations and simple directions for each project. the projects are arranged in order of complexity, kids can build on their skills as they progress through the manual. The lessons start out with a simple electric light and switch project that demonstrates how electricity is turned on and off with a switch. Further along, kids can put together a fire fan symphony, a water-detection alarm, a delayed-action fan, and more. Once children have mastered several of the techniques introduced in this kit, They can use the parts to experiment and create their own customized circuits and electronic devices. The Snap Circuits SC-300 can also be upgraded to the Snap Circuits Pro, Snap Circuits Extreme, or SCM-400 with the purchase of a UC-50, UC-70, or UC-100 upgrade kit, respectively. Kids will enjoy additional parts, manuals, and projects that will take their kit- and their fun- to the next level. Snap Circuits SC-300 requires four AA batteries, which are not included. What's in the box: plastic snap-grid, 32 electrical parts, and 2 Project manuals.\n\nAMAZON.COM\nGive your child an exciting, hands-on introduction to electronics with Elenco Electronics Snap Circuits SC-300. This kit contains over 60 color-coded, real circuit components that snap together to create working electronic circuits and devices. Recommended for children 8 and older, this set offers 305 do-it-yourself projects that will give your child an entertaining, concrete education on how electronics work.\n\n \n\nCreate Working Electronic Circuits\nSnap Circuits comes with over 60 pieces to create 305 different electronic projects. The pieces, which include snap wires, a slide switch, a resistor, a microphone, and capacitors, snap together easily onto the included plastic grid--no soldering required. Each piece is numbered and color-coded to make identifying them easy. These components combine to create working circuit boards just like the ones found inside televisions, radios, and other electronic devices. Simple, Fun Projects Let Kids Learn While They Play\nWith its easy-to-follow instructions, Snap Circuits gives your child a hands-on education in how electrical circuits run the everyday devices that they're familiar with. They'll also gain valuable lessons in building and in following instructions. The project manuals include large color illustrations and simple directions for each project.\n\n The project list includes all of the projects included in the SC-100 set and 204 additional projects, including a photosensitive electronic organ, a lie detector, an AM radio, and a two-finger touch lamp. With these projects, children will experiment with electric switches, integrated circuits, digital circuits, fuses, and the transformation of circuit sounds into other sounds.\n\n Grow as You Go\nBecause the projects are arranged in order of complexity, kids can build on their skills as they progress through the manual. The lessons start out with a simple electric light and switch project that demonstrates how electricity is turned on and off with a switch. Further along, kids can put together a fire fan symphony, a water-detection alarm, a delayed-action fan, and more.\n\n Design Your Own Circuits and Upgrade Your Kit\nOnce children have mastered several of the techniques introduced in this kit, they can use the components to experiment and create their own customized circuits and electronic devices. The Snap Circuits SC-300 can also be upgraded to the Snap Circuits Pro, Snap Circuits Extreme, or SCM-400 with the purchase of a UC-50, UC-70, or UC-100 upgrade kit, respectively. Kids will enjoy additional parts, manuals, and projects that'll take their kit--and their fun--to the next level.\n\n Snap Circuits SC-300 requires four AA batteries, which are not included.\n\n What's in the Box\nPlastic snap-grid, 32 electrical components, and 2 project manuals.",
    "rating": 4.8,
    "feature_bullets": [
      "Build over 300 experiments with 60+ parts",
      "Experiments include: photosensitive electronic organ, a Lie detector, an AM radio, and a two-finger touch lamp and much more!",
      "Parts included: snap wires, a slide switch, a resistor, a microphone, and capacitors",
      "No soldering - no tools - it's a snap! Snap Circuits parts require no tools and and click together to ensure solid electrical connections",
      "Our AWARD-WINNING product line of Snap Circuits supports a vigorous STEM/ STEAM educational curriculum",
      "LEARN BY DOING- designed for young engineers and makers ages 8 and over."
    ],
    "specifications": {
      "Product Dimensions": "18.9 x 13.2 x 2.1 inches",
      "Item Weight": "3.15 pounds",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "ASIN": "B0000683A4",
      "Item model number": "SC-300",
      "Our Recommended age": "8 years and up",
      "Manufacturer recommended age": "8 years and up",
      "Batteries": "2 AA batteries required.",
      "Best Sellers Rank": "#2,123 in Toys & Games",
      "Customer Reviews": "4.8 out of 5 stars4,539 ratings4.8 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "June 12, 2006",
      "Mfg Recommended age": "8 - 99 years",
      "Department": "ToysAndShoes",
      "Manufacturer": "Elenco Electronics Inc"
    },
    "categories": [
      "Learning & Education",
      "Science Kits & Toys",
      "Toys & Games"
    ],
    "price": 45.88
  }
}