{
  "website_summaries": [
    {
      "verdict": "These heavy-gauge steel pans have a substantial lip that makes them easy to grab and turn in the oven.",
      "pros": [
        "Heavy-gauge steel construction for even heating",
        "Pan dimensions embossed on handles",
        "Easy to clean",
        "Won't stick",
        "Pan lip makes it easier to rotate in oven",
        "Pans cool quickly",
        "Dishwasher safe if you don't use detergent",
        "Good weight"
      ],
      "cons": [
        "Must hand-wash for best results to protect the finish"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good pan",
      "text": "We bought this Wilton pan, the good cook pan, Sur La Table pan, Sunbeam, and the USA Aluminized Steel pan The prices were from $3.80 to $13.99. The expensive pan will most likely last the longest but as far as baking goes we made a big batch of yeast bread We baked bread in all the pans at the same time in the same oven There was not enough of a difference in the final product to buy the more expensive pans and we did really like the Wilton pans because of the lip on the pans. Makes it much easier to rotate",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 64,
      "publication_date": 20170318
    },
    {
      "title": "Sturdy and long lasting",
      "text": "I have that pan for almost 2 years maybe more, and it still looks pretty good next to my new Wilton. In the picture is the one in the middle, the biggest one is the Wilton's 9.25 x 5.25",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra O'C.",
      "helpful_votes": 19,
      "publication_date": 20180810
    },
    {
      "title": "Perfect!",
      "text": "Wilton Medium Bread Loaf Baking Pan measures 8 1/2\" x 4 1/2\". Is exactly what I was looking for in a loaf pan. Perfect size, easy to clean, sturdy, non-stick, however, I used a bit of olive oil or Pam, then wipe the excess off, works like a charm. Very pleased!! Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "April Renn/AprilR",
      "helpful_votes": 5,
      "publication_date": 20200124
    },
    {
      "title": "Money Very Well Spent",
      "text": "After baking over 30 years, I too have moved to Wilton for their bread pans. Even though they are dishwasher safe, they rinse out in the sink in an instant, so I see no need to stress them through a dishwasher cycle. The pans also have holes punched into both ends, if you care to store them hanging up. Nothing even comes close to sticking, and I bake a lot of sweet breads with pearl sugar on top. Even cooking, beautiful finish, rolled edges, rigid, good build quality, and just an overall excellent value. I'm back to buy another one.",
      "rating": 5.0,
      "verified": true,
      "author": "ClickHere",
      "helpful_votes": 143,
      "publication_date": 20120218
    },
    {
      "title": "Perfect results!",
      "text": "I recently made a banana bread in this pan. It came out of the pan cleanly and perfectly browned. Washed it by hand. Easy!",
      "rating": 5.0,
      "verified": true,
      "author": "PJCB",
      "helpful_votes": 7,
      "publication_date": 20171229
    },
    {
      "title": "I ended up returning them",
      "text": "I ended up returning them. They arrived with marks on them / the coating already coming off in spots. As far as the design of the loaf pans, I was very concerned that anything that might overflow would get caught in the crack of the rolled lip along the edge, making it hard to clean. The edge is rolled up, which doesn't make any sense to me...",
      "rating": 2.0,
      "verified": true,
      "author": "Hafheim",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Works just as expected!",
      "text": "Needed this size pan for some Japanese Milk break I was baking, and this was perfect for the job. Yes, it was a little heavier, so I can't give it a perfect grade for \"lightweight\" but that's not what I was looking for anyway. Super easy to clean, I recommend. Especially if you are like me and only have (or had) 9x5 pans.",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor I.",
      "helpful_votes": 4,
      "publication_date": 20180921
    },
    {
      "title": "Use them ALL the time!",
      "text": "Love these pans - I make organic quick breads (sweet/savory) a couple of times a week to have quick snacks on hand and to eliminate cookies and other chemical laden stuff - these pans are my absolute go-to and I use them for all the recipes that call for 9x5 pans as well. I prefer the more compact breads with a higher profile versus the lower, wider breads. Clean up is super easy, especially since I don't have a dishwasher. The fewer nooks'n'crannies to clean up (like muffin tins), the better.",
      "rating": 5.0,
      "verified": true,
      "author": "ManuSchatz",
      "helpful_votes": 7,
      "publication_date": 20150712
    },
    {
      "title": "Good size",
      "text": "I specifically bought this because of its size not too small or not too big. We are a family of 4 and it perfect for small portion sizes in servings. First time I used it I made a banana nut chocolate chip loaf of bread. I used almost flour and it worked wonders. My kids help me bake the bread. And it was easy to pour in the batter. And when it was time to wash and clean up. It was perfect to wash off with dish soap. I have no complaints for this one. Just worked fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Veronica Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Perfect little loaf pan",
      "text": "Bought because my other loaf pans are slightly off, not the precise 8.5x4.5 that many recipes require. Was 50% the current price, so was a great deal. Baked a sandwich loaf in it today, and it came out perfectly, with just a spray of EVOO.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon User",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Great pans!",
      "text": "I use baking Pam in these, and my cranberry bread came out perfectly. I was using stoneware before, but these pans cook much more evenly and are easier to clean. I bake two loaves at a time. One thing about Wilton pans, they will sort of \"cure\" like stoneware and iron does. In my experience, that makes them work even better, so don't worry about keeping them pristine. I have a Wilton baking sheet I've been using for over 10 years, and it's practically black and works better than any other baking sheet I've used. I normally hand wash mine, but they have gone through the dishwasher with no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Vaelorn",
      "helpful_votes": 3,
      "publication_date": 20130330
    },
    {
      "title": "Great for baking breads (cinnamon raisin included).",
      "text": "I love these, they clean out so well even if something leaks out on them like sometimes happens on a cinnamon raisin bread. All I have to do is soak it for a minimal amount of time if any to get any gooey sugary substance that is baked on hard off of these pans. Plus there are no little cracks for water to sneak in and stay in to rust them out. Great pans that I use regularly to bake breads in.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "Great pan",
      "text": "All my Wilton bake ware has good quality - never got one in this size- added to my collection. Bakes well & easy to clean",
      "rating": 5.0,
      "verified": true,
      "author": "Shyanne",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Would of been a PERFECT pan but arrived with dent overall good",
      "text": "Loaf pan works great! Non-stick bread slides right out. Unfortunately they didnt ship with proper packaging and pan arrived dented.",
      "rating": 3.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "PERFECT PANS",
      "text": "should have gotten them a long time ago they are great!!!",
      "rating": 5.0,
      "verified": true,
      "author": "dianna weaver",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Great Loaf Pan - Non-Stick Feature is Fantastic - Even Baking Results",
      "text": "Great loaf pan at a fantastic price! The non-stick feature of Wilton's pans is what keeps us coming back to purchase more! The size of the loaf pan is great and we love this pan so much that we've purchased more to have during the holidays for when we bake a TON to give as gifts! Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "ShakikiTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Will buy again",
      "text": "Great pan! Good heat distribution. Can’t comment on durability since I have it very long. I’m definitely buying another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Rulouie2",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "aEg - Just cooked my first four loaves of bread ...",
      "text": "aEg - Just cooked my first four loaves of bread. They just fell out of the pan when I tipped them over. This is a very high quality pan (in my humble opinion.) At $4.00 each, as an add-on, you just can't come close to beating this deal. I've already ordered more!",
      "rating": 5.0,
      "verified": true,
      "author": "a3Gram",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "I love making pumpkin bread",
      "text": "I love making pumpkin bread, but I grew tired of buying the throw-away aluminum ones from the grocery store - so I picked up a couple of these loaf pans. It's much easier to bake and then cool and remove the loafs than it was with the cheap-o alternative. Wrap them in foil after and you've got yourself a perfect gift for anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "whereismymind",
      "helpful_votes": 0,
      "publication_date": 20160308
    },
    {
      "title": "This is the one...loaf browned perfectly !",
      "text": "Made a loaf of bread this morning...came out sooo much better than my dark steel pans.",
      "rating": 5.0,
      "verified": true,
      "author": "olddad",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "This is good for baking bread and loaf cakes",
      "text": "This is good for baking bread and loaf cakes. It has non stick surface which is good. But I noticed that the surface gets damaged very easily. Overall good product.",
      "rating": 4.0,
      "verified": true,
      "author": "silverblaze",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "Just what I needed",
      "text": "Had recipes that called for this size loaf pan. It was just what I needed. Worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "JPK",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Doesn't hold up after even two uses.",
      "text": "The size is perfect, but that's where my appreciation for this ended. I used it twice and it stained like this. From butter. Nope, this is trash. Save your $8. I'll have to keep looking.",
      "rating": 1.0,
      "verified": true,
      "author": "Claire G.",
      "helpful_votes": 3,
      "publication_date": 20180822
    },
    {
      "title": "Great for banana breads and keto breads.",
      "text": "Easy to clean. My breads come out beautiful every time.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "It was perfect!",
      "text": "So I got this to make banana bread and my bread turned out great as you can see attached from my pictures!",
      "rating": 5.0,
      "verified": true,
      "author": "Abeer",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Fooey",
      "text": "I bought two sets of two pans each. Both sets of two pans are forced together so tightly, I have broken two fingernails and a knife blade trying to pry them apart. I even tried the hot-water/ice-water routine with no change at all. One would expect that a brand like Wilton would have come up with some sort of divider between the pans. How simple is that to think of? Now I'll have to work on repackaging and shipping these things instead of baking my Christmas fruitcakes. The queen is not amused!",
      "rating": 2.0,
      "verified": true,
      "author": "erv",
      "helpful_votes": 8,
      "publication_date": 20151211
    },
    {
      "title": "A must for Paleo Bread recipes",
      "text": "This non stick loaf pan is the perfect addition to my Paleo lifestyle and pretty much the only way to turn true Paleo bread into actual bread and not flattened, raw junk. It's dimensions are perfect to help almond and coconut flour rise. I personally still grease the pan, but its great. I recommend this for at home bread makers.",
      "rating": 5.0,
      "verified": true,
      "author": "Aud's View",
      "helpful_votes": 2,
      "publication_date": 20140115
    },
    {
      "title": "great quality for the price",
      "text": "This loaf pan is lightweight, perfect size to do a banana bread for example, non stick pan and the baking was homogeneous so... I still have my baking pans that I bough in France or Germany (not cheap at all) but I keep them for some special purposes or occasions. I needed a correct loaf pan for an \"every day\" uses and this one do the trick, and I won't cry my pan if anyone scratch the bottom or ruined it with some experiment (you never know sometime)",
      "rating": 4.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20130204
    },
    {
      "title": "Decent for the price",
      "text": "Good enough. Not the best quality but good enough for the price",
      "rating": 4.0,
      "verified": true,
      "author": "Hena Shah",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Great Bread Pans and just the correct size for a particular Gluten Free Bread Recipe.",
      "text": "Great bread pans! My wife has started baking her gluten free bread at home and needed particular sized pans. She has been using them often and is happy with the results. Wilton is a good name and has great reviews. We add our recommendation of 5 stars to a long list.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Cavell",
      "helpful_votes": 0,
      "publication_date": 20150126
    },
    {
      "title": "Wilton Medium Bread Loaf Pan",
      "text": "I already have one of these pans . I knew how well it baked the bread and was easy to clean up. I was glad to find it on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Great for homemade bread-nonstick is amazing!",
      "text": "I have 3 of these and compared to the two other loaf pans I have they are awesome. I make homemade bread and the loaves just slide right out onto the cooling rack. (I still use a little bit of Pam, but my other two pans I kind of have to shake the bread out and sometimes burn my fingers if I'm not careful. They were supposed to be professional pans-my mom bought them from me from some fancy store)These are great quality. I like that they have a little lip on the edge unlike my other ones. Makes it easier to take in and out of the oven.",
      "rating": 5.0,
      "verified": true,
      "author": "obsessivepurchaser",
      "helpful_votes": 0,
      "publication_date": 20110625
    },
    {
      "title": "Good size, Easy to clean",
      "text": "I'm not a baker, so I'm not sure what's standard/right/whatever, but this thing is incredibly easy to clean and is exactly the right size for any frozen dough or recipes I use. The lip around it could be a bit bigger to make it easier to lift with pot holders/gloves, though.",
      "rating": 4.0,
      "verified": true,
      "author": "Flavian",
      "helpful_votes": 0,
      "publication_date": 20130910
    },
    {
      "title": "Bread Pans",
      "text": "Pans were good size and heat evenly. They clean up easily. Follow the pre seasoning directions to prepare them. I use them every week for my bread making.",
      "rating": 5.0,
      "verified": true,
      "author": "Debra J. Ross",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "Wonderful Wilton Loaf Pans",
      "text": "Beautiful, sturdy, THICK loaf pans. A great size, too. Not too big, not too small. I made two loaves of whole wheat banana bread in them. The loaves came out well-browned and the bottoms were not soggy or over-baked. Excellent pans. Highly recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Pua",
      "helpful_votes": 0,
      "publication_date": 20131116
    },
    {
      "title": "Perfect",
      "text": "WOW! Great product, great price, great vendor = Great DEAL! I'm impressed! Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "JD Jones",
      "helpful_votes": 0,
      "publication_date": 20170224
    },
    {
      "title": "it a great bread pan",
      "text": "so easy for bread slide out, also it can stick but adding oil or butter works wonders.",
      "rating": 5.0,
      "verified": true,
      "author": "jesse",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Five Stars",
      "text": "Great pans! Very sturdy and a perfect size. Cakes and bread just slide out of the pan.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda J Flournoy",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "Great value",
      "text": "Doesn't bend. Hasn't stained even after making plenty of meatloaf. Does its job perfectly and it's only $4.5!",
      "rating": 5.0,
      "verified": true,
      "author": "Allan",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Great product",
      "text": "LOVE these pans! Cooks banana bread nice and even. It is also an amazing price.",
      "rating": 5.0,
      "verified": true,
      "author": "Carli",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "They cook breads and cakes well. I'm ordering silicone ...",
      "text": "They cook breads and cakes well. I'm ordering silicone loaf pans because even with the nonstick coating things stick to these. I hope the silicone does as well at baking.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael Hopwood",
      "helpful_votes": 0,
      "publication_date": 20140829
    },
    {
      "title": "WILTON LOAF PAN",
      "text": "Loaf Pan is great quality - would buy again - The Wilton brand is great",
      "rating": 5.0,
      "verified": true,
      "author": "MANDY the dog",
      "helpful_votes": 0,
      "publication_date": 20170621
    },
    {
      "title": "Best Bread Pans!!!!",
      "text": "These work sooooo great!! Non-stick feature works flawlessly and these pans have a heavy-duty quality. Definitely worth the purchase. My wife makes bread once a week with all 4 of the pans we have purchased. Makes the bread perfectly and cleaning the pans by hand is a breeze.",
      "rating": 5.0,
      "verified": true,
      "author": "Shaun Peabody",
      "helpful_votes": 0,
      "publication_date": 20140430
    },
    {
      "title": "Wonderful pan",
      "text": "I have started making my breads at home. This size pan works so nicely for this. I am going to order more soon so I can make different breads at the same time. For my baking needs this works just right!",
      "rating": 5.0,
      "verified": true,
      "author": "Donna M Rose",
      "helpful_votes": 0,
      "publication_date": 20130502
    },
    {
      "title": "Loaves bake evenly and slide out effortlessly",
      "text": "Loaves bake evenly and slide right out of the pan. Even though might be unnecessary, I lightly grease the pan with vegetable shortening.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard R",
      "helpful_votes": 0,
      "publication_date": 20160319
    },
    {
      "title": "It does it's intended purpose.",
      "text": "What can a person say, other than it's a pan and it bakes things? It cleans up well...baked food.... 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanette",
      "helpful_votes": 0,
      "publication_date": 20161222
    },
    {
      "title": "Perfect for meatloaf and quick breads",
      "text": "Perfect for meatloaf and quick breads! The lighter color of the metal prevents overcooked outside and undercooked inside. Great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Jina",
      "helpful_votes": 0,
      "publication_date": 20141111
    },
    {
      "title": "These are great pans",
      "text": "We use these at our cafe and they are great; even heating, good depth, great size and price. Bread, meatloaf, and even recently a few seafood cannelloni, you can cook anything that you need to.",
      "rating": 4.0,
      "verified": true,
      "author": "MnM",
      "helpful_votes": 0,
      "publication_date": 20110222
    },
    {
      "title": "Baking Awesomeness",
      "text": "This pan is awesome. I don't even have to \"butter\" or \"oil\" it. I want a whole set like this!!",
      "rating": 5.0,
      "verified": true,
      "author": "Hanna Kat McDeavitt",
      "helpful_votes": 0,
      "publication_date": 20150210
    },
    {
      "title": "Love it. Especially for the price",
      "text": "Love it! I use it for banana bread all the time. Heavy duty and dishwasher safe.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Ison",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "i like it. it works well",
      "text": "i like it. it works well, releases the loaf, and I prefer this size to the larger size I see at most stores.",
      "rating": 4.0,
      "verified": true,
      "author": "EJTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20141210
    },
    {
      "title": "Five Stars",
      "text": "Great pan! I bought 2. I use them for meatloaf, banana bread and zucchini bread. Easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaclyn",
      "helpful_votes": 0,
      "publication_date": 20150302
    },
    {
      "title": "Cooks Great",
      "text": "These pans are outstanding. Nothing sticks in them and they cook evenly. Great quality at a great price. I would buy these without hesitation.",
      "rating": 5.0,
      "verified": true,
      "author": "pvic",
      "helpful_votes": 0,
      "publication_date": 20130208
    },
    {
      "title": "Wilton products I like",
      "text": "I have used these for baking before and I like these pans a lot. Things don't stick to them I do use a light spray on them before baking.",
      "rating": 4.0,
      "verified": true,
      "author": "grandma10",
      "helpful_votes": 0,
      "publication_date": 20130218
    },
    {
      "title": "Great so far",
      "text": "Have only used a few times for tea bread and meatloaf, but nothing as stuck to it and it is easy to clean. Wish I had bought 2. Good price and good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20110602
    },
    {
      "title": "This is a perfect size.",
      "text": "I make bread every week...This is a perfect size...easy to remove the bread and easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "TerriS",
      "helpful_votes": 0,
      "publication_date": 20141004
    },
    {
      "title": "Medium bread pans",
      "text": "What is not to like about these. Durable of good thickness. Non-stick coating; we will see how that holds up.",
      "rating": 5.0,
      "verified": true,
      "author": "Ol' Man",
      "helpful_votes": 0,
      "publication_date": 20140211
    },
    {
      "title": "One Star",
      "text": "I was supposed to receive 2 of these but only one was in the package",
      "rating": 1.0,
      "verified": true,
      "author": "Lukas R Robishaw",
      "helpful_votes": 2,
      "publication_date": 20170219
    },
    {
      "title": "Five Stars",
      "text": "Superior in non-stick release and heat conductivity. Love it. Own two.",
      "rating": 5.0,
      "verified": true,
      "author": "Rabbi BethTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20150111
    },
    {
      "title": "Pan came dented. Unable to return",
      "text": "Pan came with a dent on the bottom. Tried to return it only to find out the pan isn't eligible for return. If you're going to sell items that can't be returned at least ship the item in good quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Invisti",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "They don't leak.  That's a given but you never know these days.  Good pans.",
      "text": "Nice pans. They do exactly what pans are supposed to do.",
      "rating": 4.0,
      "verified": true,
      "author": "Karl  Schneider",
      "helpful_votes": 0,
      "publication_date": 20150426
    },
    {
      "title": "Browns unevenly",
      "text": "Does its job but if you bake bread in it, it creates a tough crust and no, it is not the oven temperature. I have baked in other kitchenware and have noticed that holding all other elements constant, I still get a less than desirable product. Unfortunately this seems to be the lot of many of the cheaper non-stick baking pans. Oh well- you get what you pay for . .",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer 999",
      "helpful_votes": 3,
      "publication_date": 20111106
    },
    {
      "title": "Just what I wanted",
      "text": "This pan is the perfect size for homemade breads. I made two loaves of apple bread and they came out PERFECT.",
      "rating": 5.0,
      "verified": true,
      "author": "VJATX",
      "helpful_votes": 0,
      "publication_date": 20131219
    },
    {
      "title": "Loaf Pans",
      "text": "Whole wheat bread recipe makes a smaller loaf and a medium pan is perfect to make well shaped delicious loaves.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon B. Wilbur",
      "helpful_votes": 0,
      "publication_date": 20130130
    },
    {
      "title": "Five Stars",
      "text": "Nice pans that release the bread easily and cook evenly.",
      "rating": 5.0,
      "verified": true,
      "author": "canonwren",
      "helpful_votes": 0,
      "publication_date": 20141109
    },
    {
      "title": "Disappointing",
      "text": "I am surprised by the great reviews for this product. I am an experienced home baker, and bought these pans because my 9 x 5 Pyrex loaf pans are too large for some recipes. I have been making do with the larger pans for years. This week I made 3 loaves of quick bread (two pumpkin and one lemon) in these Wilton pans, and all 3 of them burned on the bottom and sides before the tops were done. I am not sure whether reducing the temperature would help. I will probably be returning them.",
      "rating": 2.0,
      "verified": true,
      "author": "V. Frederick",
      "helpful_votes": 3,
      "publication_date": 20160430
    },
    {
      "title": "Five Stars",
      "text": "Love this loaf pan for 1 pound loaf of Bread. Nothing sticks!",
      "rating": 5.0,
      "verified": true,
      "author": "Slick",
      "helpful_votes": 0,
      "publication_date": 20150508
    },
    {
      "title": "Quality",
      "text": "Very nice pan. In the process of replacing all of my baking pans with Wilton. Don waste your money on the cheap ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda L Pettigrew",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "Wonderful Pans!",
      "text": "Great baking pans! The bread just slides right out,and they are easy to clean! Really glad I purchased these as I make tons of breads!",
      "rating": 5.0,
      "verified": true,
      "author": "dporter",
      "helpful_votes": 0,
      "publication_date": 20131207
    },
    {
      "title": "Great Pan",
      "text": "Love the pan but the only issue i have with in is that whatever i bake does not cook properly in the middle. but would highly recommend to anyone to buy the pans",
      "rating": 4.0,
      "verified": true,
      "author": "Nathan Peter",
      "helpful_votes": 0,
      "publication_date": 20130326
    },
    {
      "title": "Great pan",
      "text": "High quality pan that baked evenly and easy to clean. Great for baking meat loafs too",
      "rating": 5.0,
      "verified": true,
      "author": "Luanne Null",
      "helpful_votes": 0,
      "publication_date": 20150823
    },
    {
      "title": "It's a loaf pan.",
      "text": "It's a loaf pan. It bakes loaves. It does its job, and I haven't had it not do its job. What more could I ask?",
      "rating": 5.0,
      "verified": true,
      "author": "Rynne",
      "helpful_votes": 0,
      "publication_date": 20131129
    },
    {
      "title": "Wilton Bread pans",
      "text": "These were exactly what I was looking for. I had been unable to find the MEDIUM sized NON STICK loaf pans in the store. I AM VERY HAPPY WITH THESE PANS.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20121121
    },
    {
      "title": "Great pan!",
      "text": "I bought this to make my pumpkin bread. When I made it, it was perfectly brown and came out of the pan easily. The pan cleans well too. Plus it's super affordable! No complaints here.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20150114
    },
    {
      "title": "Makes delicious breads!",
      "text": "Banana nut bread? Zucchini bread? Dark chocolate chip n' raspberries? This loaf pan does them all! You put in batter and BAM! you get absolutely mouthwatering bread. But wait! THERES MORE - this thing cleans super easy and is hassle-free! *Disclaimer: don't screw up the batter.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Yu",
      "helpful_votes": 4,
      "publication_date": 20130926
    },
    {
      "title": "Baking bread is fun",
      "text": "The pans make the work easy and the cleanup is a breeze. The loaves of bread come out evenly baked and do not stick to the pan.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn A. Kiess",
      "helpful_votes": 0,
      "publication_date": 20140217
    },
    {
      "title": "Great choice!",
      "text": "Very nice seamless loaf pans. Bread released easily, evenly bakedly, clean-up was a breeze. I will order a.few more for future holiday baking.",
      "rating": 5.0,
      "verified": true,
      "author": "Suellen Y Jaros",
      "helpful_votes": 0,
      "publication_date": 20150327
    },
    {
      "title": "Nice",
      "text": "I used these pans the day they came. They worked very well. Cleanup was a breeze! Wish they could be made in USA. As far as the amazon order, they cam as promised well packaged. thanks",
      "rating": 4.0,
      "verified": true,
      "author": "Topology Student",
      "helpful_votes": 0,
      "publication_date": 20120306
    },
    {
      "title": "Five Stars",
      "text": "It is the best loaf pan I ever used nothing sticks to it",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Sansone",
      "helpful_votes": 0,
      "publication_date": 20140702
    },
    {
      "title": "Works well",
      "text": "Nice basic pan with useful non-stick coating. While mainly intended for loaves, I've used for roasting small batches of potatoes before with great results.",
      "rating": 4.0,
      "verified": true,
      "author": "David N.",
      "helpful_votes": 0,
      "publication_date": 20140102
    },
    {
      "title": "Great mid-size loaf pan",
      "text": "Perfect size. Easy to clean. Breads come out perfect. After washing pans for storage, put small sheet of wax paper on the bottom of each pan to prevent sticking when stacking the pans on top of each other as they are a \"tight\" fit. For ease in removing bread from pan - line sides and bottom with wax paper after greasing the pans - bread comes out very easily after inserting knife at the ends of the loaf pan.",
      "rating": 5.0,
      "verified": true,
      "author": "ccl",
      "helpful_votes": 0,
      "publication_date": 20141103
    },
    {
      "title": "Love these pans",
      "text": "Love the size and quality of these pans....perfect for baking med sized loaves of bread. Would highly recomend them!! Can depend on Wilton products.",
      "rating": 5.0,
      "verified": true,
      "author": "Lenora  Cullor",
      "helpful_votes": 0,
      "publication_date": 20131028
    },
    {
      "title": "Super Pans",
      "text": "My treasured aluminum loaf pans are going into the recyclables. Mom's Babka bread never looked so appetizing, tasted so good - the reason - the Wilton Loaf Pan. The bread baked quickly, browned (golden) beautifully and the pans were spanking clean after I removed the bread. I'm ordering more to be ready for the next holiday when my family looks forward to another baking delight.",
      "rating": 5.0,
      "verified": true,
      "author": "Terenia",
      "helpful_votes": 27,
      "publication_date": 20120406
    },
    {
      "title": "Great pan, crappy packaging",
      "text": "Pan was exactly as advertised. Packing was very sub-par, multiple pans in one box were rubbing together due to lack of filler material.",
      "rating": 3.0,
      "verified": true,
      "author": "TXJaxon",
      "helpful_votes": 3,
      "publication_date": 20140106
    },
    {
      "title": "thanks works great",
      "text": "great product! it arrived fast yay! My bread doesn't stick to the pan at all. I will be buying a second soon!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily wiley",
      "helpful_votes": 0,
      "publication_date": 20131208
    },
    {
      "title": "NOT SMALL ENOUGH",
      "text": "THEY SAID MEDIUM AND I WANTED A LITTLE BIGGER THAN THE SIZE FOR ONE PERSON. THIS WERE JUST TOO BIG.",
      "rating": 2.0,
      "verified": true,
      "author": "DELORES KRATZER",
      "helpful_votes": 0,
      "publication_date": 20131025
    },
    {
      "title": "Favorite pan yet!",
      "text": "This is the best non-stick pan I think I have ever owned. I have had it for several months, using it, on average, once a week and it still looks (and bakes!) as good as new. I hand wash only and it is honestly a breeze to clean. Everything just washes right out! Even the more 'stuck-on' mess washes away with a bit of warm water. It has not warped with heat, and I haven't noticed any issues with inconsistent heating. It is smooth with no harsh edges, and feels very solid and sturdy, unlike previous pans I have used.",
      "rating": 5.0,
      "verified": true,
      "author": "JessTop Contributor: Pets",
      "helpful_votes": 3,
      "publication_date": 20170823
    },
    {
      "title": "Outstanding non-stick bread pans.",
      "text": "I bake bread weekly in these pans. They are wonderful pans for yeast breads, pound cakes, or what have you. They’re incredibly non-stick with just a hint of oil needed. (I put a tiny bit on a paper towel piece and wipe it over the pan.) I now have several different types of Wilton pans for baking and swear by them. The others have lasted for years and I expect these will too. I highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary L. Westcott",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Bread pans",
      "text": "These are very nice, I would recommend them. Well made and the right size. I bake all of our bread. I do oil them even though they are non-stick, the loaves pop right out after baking. The directions said to hand wash and towel dry, don't wash in the dishwasher. Cheaper is available, but after reading reviews of the less expensive ones, I opted for durability and I'm not disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Mach",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Nice Thick Pan",
      "text": "For years I sat and watched my grandma whip up banana breads and other delicious breads that us kids just loved. I soon realized I need to learn all her skills so that one day I can do the same for my grandchildren. As an adult you find sometimes you just don’t have the right pan handy when you need them. When I find a good deal on pans, I snag them all up! I got this loaf pan on a wonderful sale and it is absolutely amazing. I was very impressed with the nice thickness of the pan. I feel I got my money’s worth on this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs jones",
      "helpful_votes": 3,
      "publication_date": 20160922
    },
    {
      "title": "Great pans!",
      "text": "Couldn’t find these anywhere else in town. My husband ends up using my bakeware for other projects like painting or cleaning his tools with chemicals, or starting seedlings, which ruin my other pans. These are OFF LIMITS. Can’t replace him, but these are perfect replacements!;)",
      "rating": 5.0,
      "verified": true,
      "author": "Lkrahn",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Great loaf pan",
      "text": "I already had larger loaf pans, but our Keto bread recipe called for a smaller pan this size. And it works beautifully. I make bread every week in this pan and the bread never sticks. Cleanup is a breeze. I love it. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "TrixieLou",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Great pan for baking bread",
      "text": "I’ve taken up baking gluten free sourdough bread and this is a great pan for that. I must have bought it on bargain day as I came back to buy a second and the price had more than doubled, so I didn’t. I can only eat one loaf at a time.",
      "rating": 5.0,
      "verified": true,
      "author": "a human",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Great Loaf Pan!",
      "text": "I love this pan. Anytime I need a loaf pan, this is the first pan I reach for. It is sturdy, easy to clean and bakes my zucchini bread perfectly every time!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Hollar",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Love this bread loaf pan",
      "text": "Great bread loaf pan. Easy to clean, sturdy and durable. I use it all the time to make bread! I am so happy with this purchase! Well worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "mheartsn",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Amazing pan.  Long lasting!",
      "text": "Love, love love Wilton pans. Nothing ever sticks to them, and they are super easy to keep clean. I have several that are YEARS old, yet show barely any wear, and are still completely non-stick. If you take care of these pans, they will last forever.",
      "rating": 5.0,
      "verified": true,
      "author": "LBurtie1981",
      "helpful_votes": 2,
      "publication_date": 20160912
    },
    {
      "title": "Medium size",
      "text": "They are thick and well made. Medium size so smaller than a standard loaf. I have not baked in them yet but they seem better constructed than my pan I have had for 15years. I imagine with care these are just as durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "The Right Baking Pan",
      "text": "The Wilton Recipe Right Medium Loaf Pan is simply put; IDEAL!! As I only have a small toaster type oven for my baking needs, this pan fits nicely into the small counter top oven. Even though it is coated for non-stick baking, I still wipe down the inners with olive oil and the baked loaves simply drop out of the pan. There is essentially no clean up with just a fast wipe down with the dish cloth, a rinse, and a dry. The loaves are evenly baked throughout from top to bottom. This is one great baking pan.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry Copeland",
      "helpful_votes": 0,
      "publication_date": 20140728
    },
    {
      "title": "Great for sliced bread loaves",
      "text": "I like making sliced bread loaves but I can't seem to find good quality metal 4.5x8.5 inch pans in stores. This pan did the trick and the bread turned out great.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian H",
      "helpful_votes": 5,
      "publication_date": 20151203
    },
    {
      "title": "Great Value",
      "text": "Love this pan !! Perfect when you want to bake for just two or one person . Easy to clean and maintain .",
      "rating": 5.0,
      "verified": true,
      "author": "Neha ",
      "helpful_votes": 0,
      "publication_date": 20200630
    }
  ],
  "product_meta": {
    "title": "Wilton Recipe Right Medium Bread Loaf Baking Pan - 8 1/2\" x 4 1/2\"",
    "description": "Favorite Size For Homemade Breads, Cakes, And Meat Loaves. Recipe Right Is Constructed Of Heavy-Gauge Steel That Provides An Even-Heating Performance, Baking Experts Prefer For Perfectly-Browned Baked Goods. The Non-Stick Coating Makes Food Release And Clean-Up A Breeze! 5 Year Warranty. Dimensions: 8 1/2 X 4 1/2 Inch",
    "rating": 4.6,
    "feature_bullets": [
      "MEDIUM LOAF - this pan is perfect for the quick bread recipe, measuring 8 1/2 x 4 1/2 inch",
      "HIGH QUALITY STAINLESS STEEL - the Recipe Right pan line is constructed of heavy-gauge steel that provides an even heating performance",
      "NON-STICK COATING - baking experts prefer for perfectly browned baked goods, and this pan makes food release and clean up a breeze",
      "MULTI-USE PAN - use for your traditional breads, but could also make cakes, meat loaves and more",
      "COMPREHENSIVE SELECTION - Wilton offers the most innovative selection of baking, cake decorating, candy and cookie making, party, seasonal, and kitchen products"
    ],
    "specifications": {
      "Product Dimensions": "9.8 x 5.4 x 2.6 inches",
      "Item Weight": "0.81 ounces",
      "Manufacturer": "Wilton",
      "ASIN": "B000FT1F6Y",
      "Item model number": "2105-950",
      "Customer Reviews": "4.6 out of 5 stars718 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#13,999 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 21, 2004"
    },
    "categories": [
      "Loaf Pans",
      "Home & Kitchen",
      "Bread & Loaf Pans",
      "Bakeware",
      "Kitchen & Dining"
    ],
    "price": 9.24
  }
}