{
  "website_summaries": [
    {
      "verdict": "A well-built nozzle that gets the job done. It can deliver a high volume of water even when used at lower pressures.",
      "pros": [
        "This nozzle features a secure grip that makes it easy to hold and control, even if your hands get wet",
        "The unit has 5 different spray patterns and it can be shut off when twisted in either direction"
      ],
      "cons": [
        "Some users have noticed that the nozzle may fuse to a brass fitting over time"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "JUNK",
      "text": "If you some place where it gets crazy hot in the summer, don't buy this. After 2 years, mine melted onto the hose and I couldn't remove it. Eventually when it did come loose it was because it snapped the hose end right off along with it! It was corroded and melted onto the hose threads. Now, I have to buy a whole new hose, and nozzle.",
      "rating": 1.0,
      "verified": true,
      "author": "R. Stark",
      "helpful_votes": 4,
      "publication_date": 20190401
    },
    {
      "title": "LOW FLOW and NO RETURNS!!!!! Now I am stuck with inferior product.",
      "text": "DO NOT BUY THIS PRODUCT! Low flow compared to others AND they DO NOT ACCEPT RETURNS! I repeat, THEY DO NOT ACCEPT RETURNS! So if you are unhappy, you are now stuck with this item. Learned my lesson. Will buy from Walmart next time. They accept returns, NO questions asked. I have the Gilmore fireman which is getting old so I thought I would buy these after reading some reviews. Wrong! Gilmore fills 5 gal bucket in 23 sec from my well where this one takes 32 sec. Quite a big difference if you are hand watering your lawn and gardens. Did I mention NO RETURNS!",
      "rating": 1.0,
      "verified": true,
      "author": "Kev1900",
      "helpful_votes": 5,
      "publication_date": 20180130
    },
    {
      "title": "Incredibly reliable",
      "text": "THis is the second one that I have owned. My first one lasted me 12 years and the reason I had to buy a new one is that I lost the last one in error. The ease of adjustment, consistent flow and extremely high quality machining of the mental parts is what makes all the difference. The rummer parts are practically indestructible. I can't recommend this enough. Everything else is trash that you will only get a season or two out of before it strts to crack or drip. It's 1000% worth the little extra price.",
      "rating": 5.0,
      "verified": true,
      "author": "Stumpknocker",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "HIGHLY RECOMMEND. Best hose nozzle",
      "text": "We have had two of the stainless steel version which were fantastic. We mis-placed one. Therefore I had to order a replacement. This aluminum version works as well as the stainless steel, but cost less. It seems very durable and it is my guess that it will last as long as the stainless steel version. The people at Bon-Aire in Boise give super support and were to very helpful to describe the differences between the stainless steel in the aluminum versions. They also help if there is a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Santa Barbara Jim",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Not good",
      "text": "Bought this because Wirecutter recommended it. It's big and seems durable, but the spray patterns are limited, almost useless. If you want to put water somewhere (on the lawn, on the car, in a garden, etc.) spend less and buy a traditional nozzle.",
      "rating": 1.0,
      "verified": true,
      "author": "Ling Kear",
      "helpful_votes": 3,
      "publication_date": 20190831
    },
    {
      "title": "Good product but no parts support.",
      "text": "While this is a good product , it has a simple problem like all other nozzles; it uses o-rings. O-rings eventually fail and need to be replaced. In Bon-aire’s design, it is not too difficult to take the nozzle apart to get to the O-ring. The problem is that it is near impossible to get the damn part. In my opinion, it is better to buy a cheap nozzle and through it away when it fails instead of buying a well made expensive product that fails at the same rate with no product support to fix Its simple problem.",
      "rating": 2.0,
      "verified": true,
      "author": "LC",
      "helpful_votes": 2,
      "publication_date": 20200509
    },
    {
      "title": "Great for me",
      "text": "I've been using this for about a year now pretty heavily through a winter, a summer, and another winter at all times of the day from freezing conditions to burning hot. It's always been left on the deck out in the open but I haven't moved it around much. My wife and I gutted our house and I've been doing a lot of the work myself. I've been using this sprayer to clean my tools constantly of mud, paint, dirt, etc. This thing has been covered in all of it too from my hands being messy and held up great. I wouldn't hesitate to buy another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Giese",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "The best!",
      "text": "This has to be the best nozzle out there in the market, especially when it comes to watering your flower beds and garden. There is a lot of water coming out of the hose, but it is soft enough that you're not going to damage the delicate flowers and soft leaves of your garden harvest. The circular design is great. It is so good that I bought 5 total: 3 for myself, 1 for my parent, and 1 for a friend who was complaining about how bad the new nozzle he bought was. Suffice to say that I am satisfied with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Phong Bui",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "I have two, bought a substitute, then came back to the real McCoy (Bon-Aire)",
      "text": "I have two of these in my front and back yard. I wanted another one for my side yard. Many other brands out there, but this one is the ONLY one that has a nice \"Soaker\" type setting where it's great for watering pots or doing that final waterfall \"Rinse\" on your car to get rid of all the small wet dots. None of the other do this, I love this soaker setting for watering pots or putting large volumes of water in the plants, without blasting them with a jet of water.",
      "rating": 5.0,
      "verified": true,
      "author": "MH",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Best hose nozzle, ever!",
      "text": "This is my 5th Bon-Aire hose nozzle - I would not own anything else. They are very well built, with a rubber nozzle that is easy to grip. They give a variety of spray patterns that are super for gardening, or washing dogs and horses. They LAST for many years (my originals are about 8 years old). I did have a problem with the spray on one of them in the past and Bon-Aire sent me the parts to fix it at no cost. Even with multiple people using one of mine at a stable, the nozzle just keep on working!",
      "rating": 5.0,
      "verified": true,
      "author": "C. Vesel",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Amazing nozzle. I love the 2-directional shut-off",
      "text": "Amazing nozzle. I love the 2-directional shut-off! It's really easy to handle and adjust -- so glad to get rid of those multi-pattern spray nozzles that leak and can't be fixed! Love the idea of being able to use an allen wrench to clean this bad boy. The hardest spray force isn't quite what I expected, but I also don't have a 3/4\" hose, so I am not getting the full benefit of this wonderful nozzle. Good price on Amazon too. The 1-yr warranty isn't noted anywhere on the packaging -- so I'll have to depend on Amazon to back that up for me if I do have problems, tho that would surprise me!",
      "rating": 5.0,
      "verified": true,
      "author": "Shrimper",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "5 Stars even though I returned it",
      "text": "This is a solid, heavy duty nozzle and there is no reasons to give it less than 5 stars. I ended up returning it though for 2 reasons. 1. I live in Arizona and if it is left in the sun, it's burning hot to touch until you flush out the hot water from the hose. 2. I find the spray volume is either too strong or too wide for watering a garden. If you're using it for every-day use other than that and you can place it in a location that doesn't get direct sunlight, I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "MG",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Best Nozzle Ever",
      "text": "We purchased our original nozzle on July 7th 2009. Our hose split a few months ago and we had to get a new hose. Unfortunately due to the hard water and heat in Florida we were unable to disconnect the nozzle from the old hose. The nozzle still worked perfectly. We bought our 2nd nozzle a few days ago and it's just as wonderful and well made as the first. We highly recommend this nozzle. Something that last with use several times a day for what would have been more than 9 years is well worth buying. God bless :)",
      "rating": 5.0,
      "verified": true,
      "author": "Panic",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Good quality but not perfect",
      "text": "Overall has the feel and action of a quality piece of equipment. Lots of options in terms of spray levels. My only complaint is that regulating the spray can be tricky—you have to twist it one way to turn it on then back off to get a gentle spray. And sometimes hard to regulate it to a gentle spray to water vulnerable seedlings. When you turn it down it has a tendency to dissolve into a dribbling mess rather than staying in a distinct spray but at a lower pressure. Still happy with it though. Like it much better than the traditional squeeze spray gun.",
      "rating": 4.0,
      "verified": true,
      "author": "Edward Motley Jr",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "if you have small hands or arthritis, this is a bother",
      "text": "I really, really don't like this nozzle. I don't understand all the good reviews. There is no control except continual rotation of the large head, left to right or back, and if you have small hands or arthritis (I have both), this is a bother. I have a lot of flower beds all over my patio and I find myself keeping the hose on across the stone to avoid turning it on and off over and over again. While I don't live in an area with water shortages, it is still wasteful. I bought two of these, one for the front and one for the back yard. I will be giving both to Goodwill.",
      "rating": 1.0,
      "verified": true,
      "author": "Lori Grace",
      "helpful_votes": 8,
      "publication_date": 20150805
    },
    {
      "title": "Durable and well made fire hose type nozzle",
      "text": "I like everything about this nozzle I’ve owned four of them, this Bon-aire brand is excellent. Recently we had A small issue with one of the nozzles, it was very cold (freezing at my son’s house) and the nozzle was dropped onto the frozen ground. The fall caused it to crack in the metal, it didn’t work as well after that. No other issues with this product we will buy more again",
      "rating": 5.0,
      "verified": true,
      "author": "MICHAEL SULLIVAN",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "The Best Nozzle on the market",
      "text": "I have had this nozzle for 20 years and it is still in use. I bought a 2nd for my back yard. I have bought cheaper nozzles for my wife to water her hanging plants and they break every year. I finally got smart and bought this nozzle knowing I won't buy another for 20 years. BTW: My original nozzle broke about 3 years ago, I called the company and they sent out the part to fix it at no charge.",
      "rating": 5.0,
      "verified": true,
      "author": "Cap Retired",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Surprisingly awesome",
      "text": "Yes, it’s more expensive than your average ten dollar nozzle from a big box store. But this thing will last forever where as I had to replace the cheap ones every year. I love the heavy duty feel of it and I can fine tune to do just about anything needed, from a tiny stream to a jet blast of water. Works very well, no leaks, and has already taken a beating with no issues. Very happy!",
      "rating": 5.0,
      "verified": true,
      "author": "El Duderino",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Wouldn't Buy Again, Broken W/O Abuse 8 Days Past Warranty",
      "text": "I thought this would be a hose nozzle of a lifetime. It looks rugged, seems like you could run over it with a car. Not the case. 8 days past the warranty, it appears to have hit its end of life. Can't be shut off now. Leaking badly from the front rubber apron. Very disappointing. I love the style. I will buy same type from another vendor. Suggest getting a warranty longer than 1 year.",
      "rating": 2.0,
      "verified": true,
      "author": "Carl Chapman",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "This is the BEST !",
      "text": "So \"yes\" this is expensive at 30 bucks for a hose head but it is so worth it ! it makes watering so much easier . i dont have to walk back into the house with one pants leg an one arm drenched because the hose nozzle kept dripping. And the distance! ...so maybe i have a small yard but this nozzle can shoot water almost 23 feet. Its great !",
      "rating": 5.0,
      "verified": true,
      "author": "scooter",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Great nozzle.",
      "text": "Great nozzle. Easy to use, has many different sprays, and easy to hold. Have used them for many years. Old ones are still working but could not get them off the old hoses, so I brought the old hoses to my business (for Use) and bought new nozzles for my house. If you drop them, no problem, the rubberized exterior shields them from damage. great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary J. Wexler",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "This one is sturdy. I drop this on concrete after using quite ...",
      "text": "Been using this for 7 months now. I'm hard on my hose attachements and so I've replaced them a few times due to leaks, breaks etc. This one is sturdy. I drop this on concrete after using quite often and I do use it almost everyday. My water is also hard which causes hose attachments to clog. This one is keeping up with my abuses and water condition. If this holds for another 1.5 years (which is how long others lasted for me) I'm getting another one and buying this as a gift for my sister.",
      "rating": 5.0,
      "verified": true,
      "author": "Jangler",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "Excellent Quality.",
      "text": "This nozzle seems pretty solid. I attached it to a 3/4\" hose, but the pipes running to my spigot are only about 1/2\". The end result was higher initial pressure, but immediately much lower. So, I'd recommend this mostly for a higher flowing system than my own. It's still very usable, and more sturdy than the ~10 cheap predecessors I had laying around.",
      "rating": 5.0,
      "verified": true,
      "author": "BMH",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Just didn't live up to what I was hoping it would. Perhaps I had a bad unit??",
      "text": "I purchased this to replace a cheaper plastic selectable (same style) nozzel. This just didn't work at all. I couldn't get a solid shower or fan spray from this unit. I use the shower mode on my current one to wash my cars/truck/lawnmowers. This unit did perform a solid spray well. I wouldn't recommend this unit. The quality of the material used to make this was very good though. Disappointed. I'll have to go find another nozzel.",
      "rating": 1.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 4,
      "publication_date": 20170503
    },
    {
      "title": "Holy crow! I love this sprayer",
      "text": "I’m a solid love with this sprayer! You just turn the head to your desired spray pattern and go. No sore hands from holding a trigger down, no leaks where it meets the hose. And on one of the setting you can spray water almost 100’!!! I’ll never go back to the old school sprayers. These are totally worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Silver Star Wife",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Love it!",
      "text": "I bought 2 of these exact same nozzles quite a few years back and loved both of them. Our dogs chewed the rubber off of one of them a month ago so I was so happy to have found a new one. Just like the last two, it works soooo great! I've tried a few other ones from Home Depot but they don't come close to this one, in comparison.",
      "rating": 5.0,
      "verified": true,
      "author": "Nataliya Jones",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Leaks",
      "text": "I bought this nozzle after reading all the good reviews. Worked fine for the first two years except for an annoying constant drip enough to soak my sneakers. well that annoying drip turned into a shower ,very disappointed . I don't buy cheap tools and gardening equipment because I take care of them and expect them to last more then two years.",
      "rating": 2.0,
      "verified": true,
      "author": "kenneth lufrano",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Good - Not Great",
      "text": "To wash cars I need a lot of water with low pressure. This nozzle will certainly do that, but the on/off is a hassle. If I'm using a car wash mit, and I need two hands, I don't want to grab a hose/nozzle that has been on the ground. That could badly scratch my car. I wish it were easier to use with one hand.",
      "rating": 4.0,
      "verified": true,
      "author": "TZ250",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Great Quality - Didn't Like Water Flow",
      "text": "When you have it on low to mid-low flow settings, instead of a mist or delicate shower, there was part of it where the water pours out - like water pouring from a container. This was too strong for watering new plants. If you plan to use it for higher flow settings (washing a car) it would be fine. It was durable, heavy duty and neither the head or where it attached to the hose leaked.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Not Exactly As I Expected",
      "text": "What I did not like was the nozzle only had a few settings. The push of the water depending on the setting used was weak. It looks great in the package but I expected the water to shoot out from the nozzle better. Even at the lightest setting I expected a spray for the flowers.",
      "rating": 2.0,
      "verified": true,
      "author": "Desma Robinson",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Best Nozzle Ever",
      "text": "I have owned dozens of hose nozzles over the years, this one is my favorite. It does what it should do, securely stops the flow completely, something lots of other claim yet fail to do. And in between stops provides everything I need from near misting to a powerful jet.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie D",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Meh...not for me",
      "text": "I think the design is helpful BUT I don't like the way you unscrew to turn on at either end. When you first turn on the hose, it blasts out like a firehose so you end up having to kink it until you can turn it down with the knob. Compared to an on/off version with a trigger and adjustable spray nozzle, this one is sub-optimal.",
      "rating": 3.0,
      "verified": true,
      "author": "Raul Calloway",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "I have had (3) of these with mixed results. Quality is going down.",
      "text": "I have had (3) of these with mixed results. The first one lasted 10 years. The 2nd one lasted 3 years. The current one is already leaking and starting to break and its only 8 months old. They must have changed suppliers. This used to be the gold standard. Not anymore.",
      "rating": 3.0,
      "verified": true,
      "author": "Charles Foster Kane",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Works great for a while....",
      "text": "I have three of these, likely the aluminum model. I have had the for a few years. One works very well with no leaking. The other two leak and become very stiff and hard to turn. I would not purchase this product again. I do like the stream and control on the one that works well.",
      "rating": 3.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Good price.",
      "text": "I use the craftsman version of this product and was very happy with it. But after ten plus years it started to leak. So I bought this product that looks exactly like it but doesn’t perform like it. The adjustments weren’t as good. But it performs as it should.",
      "rating": 4.0,
      "verified": true,
      "author": "In Hawaii",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Very durable.",
      "text": "This nozzle very simular to craftman’s nozzle that I had owned for ten year. Nozzle no longer being manufactured. This nozzle works pretty good. The only time I don’t care for is middle spray nozzle can’t hold the position, keeps moving to light spray. As of today is the best nozzle I own.",
      "rating": 4.0,
      "verified": true,
      "author": "Bulldog",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Cool concept, effective but not the most efficient",
      "text": "It’s a good concept and very sturdy. There’s no handle or springs to break which is cool. My only thing is that with a sprayer, you set the spray type and it sprays and turns off automatically when you squeeze the handle. Downside to this is you have to twist it through the settings and to turn it on off. Slight downside.",
      "rating": 4.0,
      "verified": true,
      "author": "Matt Jacoby",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Not just a Nozzle",
      "text": "This is the second one that I have purchased. I love it because it is very heavy-duty and my first one is still going strong 3 years later. I like the ease of adjustment. It is willing to take a beating when you kind of throw it down on the driveway after washing your car.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael B",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Spray is poor",
      "text": "The spray is strong, probably very durable, easy to operate. But, the nozzle does not produce a spray for watering plants. Spray is cone shaped, low volume and low strength. Wind easily distorts the spray. Will be replacing next year. Would not buy again",
      "rating": 3.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "The Bon-Aire Original Ultimate Aluminum Hose Nozzle",
      "text": "The Bon-Aire are the best hose nozzles I ever bought. The aluminum ones from Bon-Aire don't last as long as the all stainless steel ones last, but the all stainless steel ones are considerably more expensive. They hold up in the Phoenix, Arizona sun better than anything I used from the hardware store.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "DON'T BUY A DIFFERENT BRAND BUY THIS.",
      "text": "I do a lot of yard work and this is amazing. It is wonderful to turn on and off. What a change that you don't need to line up a nozzle lever to turn your hose on. It also sprays a long long distance with a lot of pressure. You will love this product.",
      "rating": 5.0,
      "verified": true,
      "author": "sara ",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Best hose nozzle I've ever owned",
      "text": "My husband and I have been gardeners for decades and every year we struggle with cheap hose nozzles. They leak, if they have special features they break too soon. I expect these to last a few years, but not even one season? This Bon-Aire hose nozzle is the best. It does not leak, has the power to water across a 20 ft bed, or shower lightly up close. Its great to hose off the deck, takes and chairs that get dirty in the yard. I'm very please with it. Not sure how long it will last as this is our first summer with it, but time will tell.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Thorne",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Hype Advertising",
      "text": "\"Five-pattern spray nozzle turns any standard garden hose into multifunction spray tool.\" Hype Advertising. There's nothing special about this nozzle. You'd be better off buying a basic twist nozzle or the $7 Orbit adjustable brass nozzle from Home Depot. Don't waste your money on this item. I had high hopes for it, because I loved the firehose nozzle that my uncle had (not sure of the brand name. It definitely was not this one). I'm returning the item because it's hype advertising and not worth $18. I've heard there is a better, similar nozzle at Sears for less money.",
      "rating": 2.0,
      "verified": true,
      "author": "Jonathan Simms",
      "helpful_votes": 0,
      "publication_date": 20160330
    },
    {
      "title": "Powerful water flow!",
      "text": "I have purchased several of these now. They are GREAT. They offer adjustable flow rates from knock paint off your car to gently watering flowers. I love it for washing windows that are too high to reach or for power washing / knocking mud off the under carriage of my Jeep. Yes they are well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "YOU WILL NOT FIND A BETTER NOZZLE",
      "text": "We first discovered this amazing nozzle at a booth at our local fair. My husband was skeptical, but I bought two anyway. Compared to ALL the other nozzles we've tried over the years, well, there is no comparison. To break one of these, you'd have to employ large machinery or dynamite. We've since purchased enough of these nozzles to have one at every hose bib (we have five acres of garden). There is no better nozzle on the market. Trust me, we've tried them all.",
      "rating": 5.0,
      "verified": true,
      "author": "DJH",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Best hose nozzle ever. Almost like a power washer.",
      "text": "Extremely powerful. Every to turn on and off. Washes much like a power washer. Car and RV very clean just from rinsing. Only downside is that it uses a lot of water. Best hose nozzle I have ever purchased—by far!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Windchime",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Best hose nozzle I've every owned.",
      "text": "I bought on of these at a home show several years ago. It was promoted as \"the last nozzle you'll ever need to buy\" and they were right. I've had no leaks and no problems with that original nozzle so when I needed a new one for another hose reel - I bought this another one. Super durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy Vose",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "The only nozzle to buy",
      "text": "I have used these nozzles for years. they are the best in class bar none. Only issue is you Must, have to, it is absolutely required that you not allow this nozzle to be exposed to freezing temperatures as they will ice and damage if you do. But then, that would be your fault. I will not use any nozzle but this. They are that good.",
      "rating": 5.0,
      "verified": true,
      "author": "BigWhiteDog",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Great Nozzle, My last one lasted around years",
      "text": "I just bought another nozzle to replace one that went bad after 7 years. That's pretty good for an attachment that is always left on and is sitting outside in the elements. The water must have finally punched a hole through the rubber as water was squirting out the sides. Also, I tried to unscrew the nozzle and it just spins. So going to need to buy a new hose also, but I won't fault the nozzle for that since I don't know if it's the nozzle or the crappy hose. Hoping for another 7 years for this nozzle.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Klein",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Love these nozzles",
      "text": "Love these nozzles. I use them on a commercial charter boat. I have never had a problem with them (besides the mate losing them over the side). The rubber trim keeps the nozzle from scratching the paint as well. This review is for the cheaper, aluminum nozzle - I have never used the more expensive stainless steel ones.",
      "rating": 5.0,
      "verified": true,
      "author": "TNT in Maryland",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Difficult to use; doesn't spray well",
      "text": "I was really hoping this would be easy to use, but it wasn't. I had a very difficult time holding and turning to adjust the spray. I had to buy a different one as it was too difficult to use. Also, the spray doesn't work that well, even when adjusted to full, it did not spray well.",
      "rating": 2.0,
      "verified": true,
      "author": "Daryl S. Seager",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Fabulous!",
      "text": "I go through nozzles like dirty socks. This one is the best I've ever had. It is easy to use, has few working parts and I hope it lasts forever. Thanks to all the previous positive reviews who convinced me to buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customertmar",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Hose Nozzle",
      "text": "After reading over many reviews...with another seemingly with a better review...I chose this one because: when in use you can turn either way to turn it off. The other that seemed to be a better nozzle would only turn off in one direction thus going thru all the spray selections to turn it off. I had never used this type nozzle so had to get used to it and do very much like it. You can make it spray a distance or turn it down to water a flower bed without it digging a hole in the dirt with the spray.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo Lee",
      "helpful_votes": 0,
      "publication_date": 20160630
    },
    {
      "title": "I'm a bit disappointed in the performance",
      "text": "I'm a bit disappointed in the performance. On any other pattern than the jet, the nozzle sprays half the pattern and drips the other half. For example, on a shower pattern, the top half sprays out a shower and the bottom half just drips out so you get half a cone of spray and the rest just falls where ever your hand is. Update: The nozzle seems to be operating properly now. Not sure if any of the seals finally set or what, but months later, the spray pattern started to come out correctly.",
      "rating": 3.0,
      "verified": true,
      "author": "OCD_OBD",
      "helpful_votes": 2,
      "publication_date": 20151214
    },
    {
      "title": "Adequate and hefty",
      "text": "Certainly not what was expected. It has the appearance of a high-end or industrial quality nozzle but performs like a basic $3 nozzle. It has a great weight and feel with its thick rubber outer pieces but the actual nozzle is inconsistent in spray pressure and even spray pattern. I have a hard time getting the right flow for watering delicate small plants and then trying to get enough stream to even shoot 12feet. I can say it is hefty and tough also, the gasket seal is good quality and wont leak. This is the main reason I still use it.",
      "rating": 3.0,
      "verified": true,
      "author": "adrian",
      "helpful_votes": 2,
      "publication_date": 20140721
    },
    {
      "title": "Good high pressure nozzle",
      "text": "Nice nozzle with a long & strong spray on high. Sometimes at a lower setting it decides to suddenly jump up to a stronger spray. Kind of annoying when you're watering potted plants & it sends wet soil flying around. Otherwise, a good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Halibut52",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Living in Arizona -can’t do without these ‘work horses’!",
      "text": "We have two of these nozzles on the hoses we use most. In Arizona we use these every day, the ones we have have been lasting for years. Recently one stopped working properly, we ordered a new one, it being very important to us with constant watering. We found out that you also can repair these, the help we got for parts and I teach a ging these parts has been truly amazing. We can highly recommend these great nozzles.",
      "rating": 5.0,
      "verified": true,
      "author": "ingeborg silberschlag",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Best nozzle I ever used",
      "text": "I didnt expect much from this when i bought it but it really performs well. It's durable, precise on adjustments, has rubber armor protection, doesn't leak, shuts off quickly, gives a full blast for hosing off driveways and when you need a dribble for watering without destroying delicate plants. Highly recommend. One comment about some other reviews on this item: It needs higher pressure of water AND use a larger diameter hose such as 5/8\" or 3/4\". Don't use a small 1/2\" hose on low water pressure. That's likely the problem with the people who say it didn't perform well.",
      "rating": 5.0,
      "verified": true,
      "author": "M. King",
      "helpful_votes": 0,
      "publication_date": 20150521
    },
    {
      "title": "The Best",
      "text": "I have owned literally dozens of hose nozzles of pretty much every shape and size you can get... and I've hated every one of them...until now. This nozzle operates smoothly, doesn't leak, shuts off *completely* every time and has pretty much any setting you need from a mist to a sharp cutting stream (all of the settings will give different results depending on your water pressure though!) I was hesitant about the price... but am sold on the Bon-Aire and am glad to have spent the money on something that I really believe will give me years of use. Buy one!",
      "rating": 5.0,
      "verified": true,
      "author": "RDSWY4",
      "helpful_votes": 0,
      "publication_date": 20150714
    },
    {
      "title": "rugged, easy to use, of course no spray options",
      "text": "holding up well so far after a few nozzles failed before. It's fine, easy to use, stream changes from a low pressure shower to a pretty strong full spray. No noticeable corrosion so far.",
      "rating": 4.0,
      "verified": true,
      "author": "tomd",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "This is by far the best hose nozzle i've ever used",
      "text": "This is by far the best hose nozzle i've ever used! I'm a huge stickler when it comes to washing my car and ensure that I use proper tools and methods, this nozzle allows me to easily rinse my car using the sheeting method. This thing is solidly made and the thick rubber around it will give you peace of mind when dragging it around your car! It does have quite a range of spray types so it's super versatile in its function around the yard.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle C.",
      "helpful_votes": 0,
      "publication_date": 20160206
    },
    {
      "title": "Great performance with a solid construction",
      "text": "This is the best nozzle I have ever owned. In fact, I bought a second one so that I could have one for the front yard and another for the back. The heavy-duty rubber casing is easy to grip and can handle being dropped repeatedly. The nozzle sprays from a gentle shower to a strong stream and shuts off in both directions. This nozzle is perfect for watering plants from above, hosing off the deck, and washing the car. I’ve only had it for a few weeks, but it has not dripped or leaked (like every other nozzle I’ve ever owned). Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "\"drapcho\"",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Best hose nozzle ever!",
      "text": "I first ran across this hose nozzle at our local county fair and bought one. I found it to be the best hose nozzle I have ever had even though they seem rather expensive for a basic household product. They are still a little pricey on Amazon, but so worth it, I bought 3 more to have on all sides of my house. I can guarantee they are better than any you will find in a hardware store like Home Depot, Lowes, Ace, etc...",
      "rating": 5.0,
      "verified": true,
      "author": "marissa taylor",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Not what I expected.",
      "text": "Going by some of the other reviews I had high-hopes this was going to be just what I needed. Unfortunately the most forceful stream elicited from this device is inadequate to remove even the top layer of dirt from either my garage or carport floor or the several cars we own. It's of a high-quality build, seems to me, but if it won't blast off caked-on dirt or even sweep a carport clean of leaves and grime without taking an hour to do so, then it's not much good for my uses.",
      "rating": 3.0,
      "verified": true,
      "author": "muvywriter",
      "helpful_votes": 2,
      "publication_date": 20140723
    },
    {
      "title": "Disintegration",
      "text": "It didn't even last two years. I was careful to allow it to dry with the valve open so not to cause any problems. About one year in, the nozzle would fail to shut off in one direction (continued to leak). Finally this past week when turning it off, the nozzle disintegrated into three pieces. Another negative is that even with the highest flow setting, it was not as strong as my previous nozzle.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt N.",
      "helpful_votes": 2,
      "publication_date": 20170411
    },
    {
      "title": "Quality product at a great price",
      "text": "I am a repeat customer of the aluminum version of the Bon-Aire Ultimate Hose Nozzle. Over the last 2-years I have found them to be durable and problem free. Compared to the typical “box store” type hose nozzle, the Bon-Aire is virtually indestructible. The rubber surround for the nozzle acts as a shock absorber. I can literally drop the hose without fear of breakage. Just try that with a standard twist brass nozzle. The bi-directional shut-off is a wonderful feature. Turning clockwise or counter-clockwise makes no difference; the nozzle shuts-off perfectly. Search the internet you will not find a better nozzle at a lower price than on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerard Fitzgerald",
      "helpful_votes": 0,
      "publication_date": 20140716
    },
    {
      "title": "Rubber outside allows you to drop it on the cement",
      "text": "This is an awesome nozzle. Has sprinkle, stream and a fat flow. Bought a few of these. Great for car washing and window washing too, but won't replace a pressure washer. But strong enough for cleaning windows and throwing a lot of water out. Also mostly rubber so great for throwing it around.",
      "rating": 5.0,
      "verified": true,
      "author": "P-man",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Best Nozzle I have ever owned!",
      "text": "This is the second one of these that I have purchased for a second hose setup. The first one is now 4 years old and still works as it did when new. After going through several nozzles over the years, this is the one I will be sticking with from now on. Highly recommend. It is worth the higher price and you will have it for a very long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunny",
      "helpful_votes": 0,
      "publication_date": 20161020
    },
    {
      "title": "The nozzle you have been looking for!",
      "text": "This is the nozzle you have been looking for. It has it all, volume and pressure! I purchased this nozzle because I had about 5,000 sf of hydro seed applied this fall. You need to water that stuff two times a day for two weeks! This took a 90 min watering time down to 40 min. Delicate enough to water plants while having enough pressure to take mud off the fenders of the car. It is the tool you need when you want to apply water by hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Nice nozzle",
      "text": "Great quality. Easy to hold rubber. Will not get hot in the sun like a metal hose sprayer. The infinitely adjustable spray setting is nice to have. Although it does not produce a fine mist but i guess this is want, not a need these days. i just need to get that water on the dirt without it washing it all away and making a hole that i have to blame my dog later for digging. My dog is happier now because of this purchase. Plus it fills his water bowl up and will give him a nice gentle bath when the kids soap him up. I like this sprayer - my life is now complete.",
      "rating": 5.0,
      "verified": true,
      "author": "null",
      "helpful_votes": 0,
      "publication_date": 20141014
    },
    {
      "title": "Reasonably priced, attaches easily, versatile",
      "text": "This nozzle is reasonably priced, attaches easily to your garden hose and, with the variable spray, can serve a variety of functions. I use this nozzle primarily in the back yard for watering plants and giving the patio a good wash-down. It doesn't have the power of a pressure washer, but it has ample force for most cleaning tasks. And when I adjust it for gentler uses, it works just fine. I can't talk to longevity (so I am withholding the fifth star), but for now, I am very satisfied. 18 July 2020 EDIT: Five years later, it's still always attached to a back yard hose, and working like a champ. Fifth star awarded (after all, fair is fair.)",
      "rating": 5.0,
      "verified": true,
      "author": "gmesick",
      "helpful_votes": 0,
      "publication_date": 20130322
    },
    {
      "title": "Best Hose Nozzle Ever!!",
      "text": "I bought this Hose Nozzle 2 years ago. Still looking and working like brand new. I live in Florida with extreme heat at summer. I just ordered two more. Not a single problem. Great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Munera783",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Not happy.",
      "text": "I used to buy these when they were built to last and i remember them having a clear color rather then the green that it comes with now. I bought two and they both are leaking from the front and i was sure to never drop them. Not happy.",
      "rating": 2.0,
      "verified": true,
      "author": "Doublea88",
      "helpful_votes": 0,
      "publication_date": 20170331
    },
    {
      "title": "Original Bon-Aire",
      "text": "Been using this brand for a lot of years tried other brands but I always come back to the original. Does exactly what it's supposed to do, can't ask for more than that.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron M",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Disappointing",
      "text": "Big disappointment. Delivers functionality not easily achieved with nozzletriggers. Withinthreedaysthespraystarted malfunctioning. I should have returned it. Save your money. Expensive for little quality or durability.",
      "rating": 1.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Awful",
      "text": "Sounds real good on paper, but spray options are horrid. If you want to jet something off your driveway it's great. If you want to water plants/flowers, forget it.",
      "rating": 2.0,
      "verified": true,
      "author": "Loretta Gunn",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "I'm a pet groomer and this is the best nozzle I've used in my 13 years in the ...",
      "text": "I'm a pet groomer and this is the best nozzle I've used in my 13 years in the profession. It was recommended by another groomer who uses hers everyday and it lasts longer than any other nozzle. A thorough bath is necessary for a healthy coat and great haircut. I'm able to bath a Yorkie or a Husky by easily adjusting the water pressure. Any product that will make our job easier is welcome.",
      "rating": 5.0,
      "verified": true,
      "author": "mariah murphy",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "My Go To nozzle for sure",
      "text": "I am impressed with this nozzle.....not sure how long I will be impressed...but so far its the best nozzle I've ever used! Its so easy to use....I bought a different type of nozzle for my out of gate hose pipe along with this one just to see which one I liked best.....both serve their purpose....but I so love the ease of using this one BEST : ))",
      "rating": 5.0,
      "verified": true,
      "author": "NIM",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Needs serious water pressure",
      "text": "Nice nozzle, but make sure you have sufficient water volume and pressure. If your pressure or line is small, it is ok, but not great. If you have the water pressure, it is great",
      "rating": 4.0,
      "verified": true,
      "author": "Charles A. Gallo",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "The Best!!",
      "text": "These are THE BEST hose ends. Don't get another brand. I bought the Costco ones and they were horrid. I moved and left the originals with the new home owner, bought the Costco ones as a replacement, came right back here and bought the Bon-Aire units.",
      "rating": 5.0,
      "verified": true,
      "author": "F. Wincek",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Junk.",
      "text": "Don't bother with this hose. If you think this \"firehose\" nozzle will provide any type of pressure, you're wrong. The fan pattern is not consistent, the design gives minimal pressure and I found it essentially useless. It does seem to be sturdy but go with a trigger style if you want usefulness.",
      "rating": 1.0,
      "verified": true,
      "author": "JYD",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Works Great! Purchased 3 of them!",
      "text": "This nozzle works fantastic! I have tried most of the others which work terrible. But this one by Bon-Aire is great and much better than I thought it would be. I thought I would be disappointed like I was with the other products but this one is great and works with no leaking! I recomend it and purchased another one for my son's home.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Excellent product!",
      "text": "A spectacular hose nozzle. When something is machined correctly, and is made from good quality material, you can just feel it in your hands. This product is in that category. It's heavy to the hand, and the rotating nozzle has a nice smooth feel as you turn from a cone of mist to a stream. You can spend less, and you can spend more. You won't get better quality at any price.",
      "rating": 5.0,
      "verified": true,
      "author": "LCR",
      "helpful_votes": 0,
      "publication_date": 20160811
    },
    {
      "title": "Quality, Durability",
      "text": "This is my second one, I bought my first one 5 years ago and putting it side by side with the new one, you can't tell which is new vs 5 year old one. They are commercial grade!",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn R.",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Relatively pricey but so worth it.",
      "text": "I like to buy things once. I’m willing to pay a lot for something if I only have to buy it once. I’ve spent years buying sprayers every year. Finally found this one. It takes a beating. I drop it, drag it, abuse it and it keeps on spraying. I bought three more, one for every hose, after getting the first one. Recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "John Davis",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Excellent buy",
      "text": "I had bought a previous version through Duluth Trading Company and it has lasted so long and delivered such a range, from gentle spray to a steady strong stream, that I bought one for the front yard, as well. It shuts off at both ends ends of the twisting mechanism. Replaces loads of cheap garden store nozzles.",
      "rating": 5.0,
      "verified": true,
      "author": "Baab",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Best hose nozzle, ever!",
      "text": "I just bought my second one in August 2019. I'm still using the first one which I bought in August of 210 and have forgotten and left out over at least 4 Michigan winters. The first is still fine. I just wanted another: one for both front and back hoses.",
      "rating": 5.0,
      "verified": true,
      "author": "NGCW",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "2 patterns.. only",
      "text": "not so great. can't get all the patterns to work. only two patterns work. tried the troubleshooting by removing the screw .. but no joy.. seems defective. disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "APKHOU",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Great but doesn't last UPDATE !!! It was the water supply!",
      "text": "The nozzle has to be my favorite attachment I have ever used! It is versatile and does all that is asked of it. However, after just over a year it quit working completely. I am going to get another with the hopes that the last one was an anomaly. UPDATE: 15 APL 2013 It was no fault of the nozzle, it was the water supply of Kingsville, Texas that was the culprit. When I took the nozzle apart (I had to! I have been doing that since my parents threw out the toaster when I was 10!), which was very easy and there was a bunch of pieces of limestone. Cleaned it all out and it works like new!",
      "rating": 5.0,
      "verified": true,
      "author": "David P. Kutchinski",
      "helpful_votes": 0,
      "publication_date": 20130123
    },
    {
      "title": "Loved it the first time!",
      "text": "I first purchased this nozzle at a Home and Patio Show many years ago. Loved it from the start and so did everyone else who ever used the hose. It would go from a long hard stream or a gentle rain-like stream with just the twist of the dial. After this original one finally needed to be replaced, I decided to buy two new ones...........one for the front hose and one for the backyard. Neither of these seems to work like the first one. They are both good, but not exceptional as the original. Not sure what the difference is, but these aren't made as well as they used to be. Still better than most nozzles though.",
      "rating": 3.0,
      "verified": true,
      "author": "at home mom",
      "helpful_votes": 0,
      "publication_date": 20140102
    },
    {
      "title": "Sturdy with good spray options",
      "text": "The nozzle seems sturdy, and the spray options are great. I have no reason to believe it won't hold up for years. At the same time, I don't use it much, so all I can say is that the function is great and it feels sturdy.",
      "rating": 4.0,
      "verified": true,
      "author": "SM",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Works great and durable. I've bougth three over the years",
      "text": "I just bought my third one for my third outdoor spiggot. Durable, comfortable in my hand, twist it for different sprays.",
      "rating": 5.0,
      "verified": true,
      "author": "HootHootie",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Great for watering plants, not as powerful as expected on jet stream mode",
      "text": "I bought this as I needed something that had a high water flow for my plants as opposed to using no nozzle at all. The flow and pressure was similar [to having no nozzle], though of course with the added benefit I could shut it off without putting a kink in the hose and running towards the source valve. Exactly what I needed. The jet stream mode isn't as powerful as the cheap-o pistol like nozzle I had before. Not sure why. I think because it just doesn't narrow down the stream as effectively. All-in-all, it's good for da plants, yo. So 4 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian Dolan",
      "helpful_votes": 0,
      "publication_date": 20140630
    },
    {
      "title": "unusual but so far so good",
      "text": "I have been buying the standard dial type nozzles and frustrated because they break down after a short time. After researching for the best one, I decided to give this Bon-Aire a try. At first I missed the shower setting, but now I like the ability to adjust the stream. While watering the yard, I often need a longer stream to get bushes against the fence but then can quickly adjust the setting to a gentle flow for more delicate plants closer to me. I do hope it lasts longer than a year but so far I am very happy (received the nozzle a few weeks ago). No leaks at the connection to the hose either.",
      "rating": 5.0,
      "verified": true,
      "author": "Janice Johnson",
      "helpful_votes": 0,
      "publication_date": 20130628
    },
    {
      "title": "awesome nozzle.  probably the best.  I wish I had one on every hose!",
      "text": "don't buy anything cheaper that looks like this nozzle. I did and regretted it. buy this one it works and lasts!! Just to show you I have used this for 3 years on the farm and it's my GO TO nozzle. I wish I had one on every hose! See my picks for how it looks after 3 years of heavy use!",
      "rating": 5.0,
      "verified": true,
      "author": "Heli Chief",
      "helpful_votes": 6,
      "publication_date": 20150310
    },
    {
      "title": "Just tried it out and it is truly a revelation!",
      "text": "My initial impression is right in line with most of the other 5 star reviews, so I won't be redundant. Its great. We'll see about its durability over the coming months (and years)! Update 11/2010: Still doing well, though it is somewhat tiresome to turn the thing on and off, as you have to rotate it though its range every time. I have no gripes about the amount of water it delivers, though. Update 3/2012: Still working, but the uniformity of the pattern is degrading somewhat. When set to \"fan\" out, it is as if some grit may have got into the mechanism so the water pattern is uneven. Other than that, its working well. 2010 update still valid.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe C.",
      "helpful_votes": 0,
      "publication_date": 20090308
    },
    {
      "title": "Depends on your intended usage",
      "text": "I have to admit that this product is well made and sturdy but I will stick to the usual all brass twist nozzle. This is awkward to use as it twists in both directions from \"center flow\" and it gets confusing as to which way to twist. It does do full flow so that is a huge advantage if you're using it for filling pools and such but plants don't like that kind of flow and that is the limiting feature of this unit... it doesn't do \"rain\" flow. This will likely be a great nozzle for washing the car as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Allen",
      "helpful_votes": 0,
      "publication_date": 20140803
    },
    {
      "title": "Love this nozzle!",
      "text": "I've tried several nozzles over the past 3 years. While I've only been using this for a few weeks now it's head and shoulders above the previous purchases. It's solidly built, easy to operate (turn either direction) and shuts TIGHTLY. This really is a great nozzle. UPDATE 09/18/2014: We used this nozzle all summer and it works 100% as well as it did on day one. It's held up flawlessly and I can't say enough about the quality of the flow/shutoff control. By now any head I've had in the past would be half dead from normal use.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Beaulieu",
      "helpful_votes": 0,
      "publication_date": 20140611
    },
    {
      "title": "So far, so good",
      "text": "Can turn nozzle off to then left or right which is huge. Only had for a week, but it seems like great nozzle overall so far. A little pricey, but worth the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Buckler",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Change bib to valve",
      "text": "Most of the reviews that say performance is not good, have their hose connected to a regular hose bib. These have just a 1/4 to 3/8 opening, so no matter what size hose you use the flow is reduced. To obtain the best from this nozzle, change your \"hose bib\" to a \"garden valve\" style. These have a 3/4 to 1\" opening that allows 2 to three times the volume of water. This difference is like night and day as to the output of the nozzle.",
      "rating": 5.0,
      "verified": true,
      "author": "Tripod",
      "helpful_votes": 0,
      "publication_date": 20160623
    }
  ],
  "product_meta": {
    "title": "Bon-Aire Original Ultimate Aluminum Hose Nozzle ( Colors may vary )",
    "description": "Tired of garden hose spray nozzles that leak, clog, or soak you with unpredictable sputters? Step up to professional quality with the Original Ultimate Hose Nozzle from Bon-Aire. Built tough for a lifetime of use, this spray nozzle is virtually indestructible and leak-proof. The patented two-way shutoff system and ergonomically designed comfort grip make it easy for everyone to use. With five different spray patterns, the Original Ultimate Hose Nozzle provides you with the perfect stream of water for virtually any task.\n\nThe Perfect Stream of Water for Any Job\nWhether you're gardening, washing the car, or taking on a larger project, the Original Ultimate Hose Nozzle is the perfect accessory sprayer. It screws on to any standard garden hose and turns it into a flexible, multi-function spray tool. Modeled after the kind of nozzle that professional firefighters use, the Original Ultimate Hose Nozzle has five different spray patterns that can tackle a variety of jobs. Use the near-solid jet stream setting to power away tough dirt and grime, or choose the wide fan spray to saturate broad areas quickly. You can even water delicate plants with the gentle soak setting.\n\nNot only is the Original Ultimate Hose Nozzle flexible, it's easy to use too. Just twist the ergonomic control grip to select your spray pattern. The unique, patented two-way shut-off makes stopping the flow of water a snap as well--simply twist the grip in either direction. Soft and comfortable to hold, the rubberized control grip also serves to protect any object the nozzle may accidentally bump against.\n\nBuilt Tough for a Lifetime of Use\nThe Original Ultimate Hose Nozzle is engineered from aircraft aluminum, stainless steel and high-grade fiberglass, making it virtually indestructible and leak-proof. It's built tough to provide you years of use without breaking, rusting, or leaking. This rugged design is also elegant in its simplicity, allowing you to easily take the Original Ultimate Hose Nozzle apart with a 5/32\" Hex driver should it become clogged or need servicing.\n\nAMAZON.COM\nTired of garden hose spray nozzles that leak, clog, or soak you with unpredictable sputters? Step up to professional quality with the Original Ultimate Hose Nozzle from Bon-Aire. Built tough for a lifetime of use, this spray nozzle is virtually indestructible and leak-proof. The patented two-way shutoff system and ergonomically designed comfort grip make it easy for everyone to use. With five different spray patterns, the Original Ultimate Hose Nozzle provides you with the perfect stream of water for virtually any task. \n\nThe Perfect Stream of Water for Any Job \nWhether you're gardening, washing the car, or taking on a larger project, the Original Ultimate Hose Nozzle is the perfect accessory sprayer. It screws on to any standard garden hose and turns it into a flexible, multi-function spray tool. Modeled after the kind of nozzle that professional firefighters use, the Original Ultimate Hose Nozzle has five different spray patterns that can tackle a variety of jobs. Use the near-solid jet stream setting to power away tough dirt and grime, or choose the wide fan spray to saturate broad areas quickly. You can even water delicate plants with the gentle soak setting. \n\nNot only is the Original Ultimate Hose Nozzle flexible, it's easy to use too. Just twist the ergonomic control grip to select your spray pattern. The unique, patented two-way shut-off makes stopping the flow of water a snap as well--simply twist the grip in either direction. Soft and comfortable to hold, the rubberized control grip also serves to protect any object the nozzle may accidentally bump against. \n\nBuilt Tough for a Lifetime of Use \nThe Original Ultimate Hose Nozzle is engineered from aircraft aluminum, stainless steel and high-grade fiberglass, making it virtually indestructible and leak-proof. It's built tough to provide you years of use without breaking, rusting, or leaking. This rugged design is also elegant in its simplicity, allowing you to easily take the Original Ultimate Hose Nozzle apart with a 5/32\" Hex driver should it become clogged or need servicing.",
    "rating": 4.6,
    "feature_bullets": [
      "Durable, five-pattern spray nozzle turns any standard garden hose into multifunction spray tool",
      "Engineered with aircraft-grade aluminum, stainless steel, fiberglass and comfort-grip soft rubber to withstand years of use",
      "Fire hose nozzle construction",
      "Unique patented two-way shut off for added convenience",
      "1-year warranty"
    ],
    "specifications": {
      "Manufacturer": "BON AIRE",
      "Brand": "BON AIRE",
      "Model": "HN-10AL",
      "Item Weight": "10.1 ounces",
      "Product Dimensions": "3 x 3 x 4 inches",
      "Item model number": "HN-10AL",
      "Is Discontinued By Manufacturer": "No",
      "Exterior": "Polished",
      "Manufacturer Part Number": "BON-AIRE",
      "Cover Included": "COMPRESSOR",
      "ASIN": "B0001L0DFA",
      "Customer Reviews": "4.6 out of 5 stars2,636 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#2,306 in Patio, Lawn & Garden",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "January 6, 2006"
    },
    "categories": [
      "Nozzles",
      "Patio, Lawn & Garden",
      "Watering Equipment",
      "Automotive Parts & Accessories",
      "Gardening & Lawn Care"
    ],
    "price": 25.07
  }
}