{
  "website_summaries": [
    {
      "verdict": "A must-have storage solution. It’s versatile in the fact that it can house a myriad of items and makes organization easy.",
      "pros": [
        "Great value for a versatile and practical item",
        "Can be used to store shoes, accessories, toiletries, and more",
        "Clear design for transparency into what’s in each pocket",
        "Includes over-the-door hooks, so no assembly or tools required"
      ],
      "cons": [
        "May be accompanied by a plastic smell, so air out before filling"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Meh, Will do",
      "text": "First off... when I received this product I thought it was broken. It took me a good while to stand it up and make it stable enough to hold the blanket. I have a really large heavy duty blanket and this holds the blanket fine. The plastic is hard and it only has one zipper. Not 2 for a storage case this size. The plastic also has a smell. I think I probably would have preferred a cloth comforter bag and paid the extra money. As I said it will get the job done. But I m not a fan...",
      "rating": 3.0,
      "verified": true,
      "author": "K. Edwards",
      "helpful_votes": 3,
      "publication_date": 20190318
    },
    {
      "title": "Only OK",
      "text": "This garment bag serves the purpose, but it lacks a still bottom to hold it away from the hanging clothes. It is not as rugged/high quality as I have in old garment bags that I have had for many years. I did like that I can see what is haning without having to open it.",
      "rating": 3.0,
      "verified": true,
      "author": "Mandy205",
      "helpful_votes": 6,
      "publication_date": 20171202
    },
    {
      "title": "Did not work like I hoped",
      "text": "Hanging garment bag arrived and appeared to be well made and sturdy. I hung it up in my closet and placed about 6 cocktail dresses and 2 evening gowns in it. Zipped it up and was impressed. However, 2 days later...I went to add another dress to it and when I unzipped it, the metal support on top came down. I pushed it back up and it would not stay up. I removed all the dresses and attempted one more time. Seemed to hold so I started to load dresses back in bag and it just collapsed. These were not heavy items. I love the concept but will be returning the unopened and opened one immediately.",
      "rating": 3.0,
      "verified": true,
      "author": "Red Tress",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Good way to store bulky comforter or off-season clothing",
      "text": "I ordered it to store summer clothing. Previously, I'd been using plastic totes, but our storage shed is full of totes, mostly containing my fabric stash. Made it hard sometimes to find the off-season clothing. I think it holds as much as a tote but it's possible to see what's in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Buckley",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Designed for shoes for small feet",
      "text": "I really like this organizer, but it's obviously intended for women's shoes, because I can only fit one of my husband's shoes in each slot. He doesn't have big feet - size 8 mens. Otherwise, this is a great, and since he doesn't have that many shoes, I was able to fit all his shoes in it. I was able to put a pair of his crocs in one slot.",
      "rating": 3.0,
      "verified": true,
      "author": "Lulubeans",
      "helpful_votes": 5,
      "publication_date": 20151107
    },
    {
      "title": "Avoid!",
      "text": "This item would be great IF you want all of your cloths to smell like plastic! I even left the covers out of the packaging to air out for a day and they still had a strong plastic smell and even made the mattress smell that they were sitting on! Avoid these and get cloth covers.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin H.",
      "helpful_votes": 8,
      "publication_date": 20170307
    },
    {
      "title": "Seems to be perfect!",
      "text": "Although I just recently got these and can't speak for longevity I was looking for something larger to fit household cold weather sweaters, fleece items and so on. I was able to fit a lot in to these (I purchased 2) and they fit well under the bed in one of the spare rooms. They are a thicker plastic which I found impressive. I put a lot of cedar balls in each of them and will hope for the best. As for a early review I highly recommend them for storing most items you may need a bit of extra room for!",
      "rating": 5.0,
      "verified": true,
      "author": "TravelerTop Contributor: Makeup",
      "helpful_votes": 3,
      "publication_date": 20150517
    },
    {
      "title": "It is a great idea, however actual product worst then 1 star",
      "text": "It is a great idea, however actual product worst then 1 star. I use it to hang work clothing (shorts and jeans) in garage and used ONCE a week. So after 3 month of use it broke, The problem and main weakness is a top rode which is is very weak and broke under a steady weight. I have similar one from Container Store and it works like a charm, but this one is a CHEAP RIP OFF and nothing more.",
      "rating": 1.0,
      "verified": true,
      "author": "Dmitry S Eliseev",
      "helpful_votes": 3,
      "publication_date": 20170429
    },
    {
      "title": "Would like to return it",
      "text": "Just started to redo my closet. I had ordered two different products. The other was easy to assemble and worked great. This product is awful. Would not stay together and collapsed when I hung it in the closet.",
      "rating": 1.0,
      "verified": true,
      "author": "Sue McMillan",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "FINALLY AN AMAZING STURDY STORAGE BAG, YAY!!",
      "text": "This storage bag is AMAZING!!!! Finally I ordered a jumbo storage bag that truly was jumbo! It is also incredibly sturdy! I can't even remember how many of these things I have ordered from other companies and they tear while I'm putting the blanket in the stupid thing! If you want a sturdy storage bag that is big enough for 3 comforters and probably 2 regular blankets, order this one!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Minnow Martorell",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "Fits 6 pillows",
      "text": "I bought this product to store bedding under beds and in closets. I have ordered other products in the past and the zippers tear off almost immediately or the bags tear etc. This product is very heavy duty plastic that holds its shape well. I ordered the jumbo size and was able to get 6 queen size pillows in 1 bag without completely smashing the pillows. The zippers and side handles appear durable. Overall a good buy for the money",
      "rating": 5.0,
      "verified": true,
      "author": "happy shopper",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "My shoes are much more organized",
      "text": "I am enjoying this hanging shoe \"box\" every time I need to take or put my extras shoes and sandals. Great use of space- each pair has own shelf (unless it's slippers or flat sandals, then I put two pairs in one shelf). Happy happy happy!",
      "rating": 5.0,
      "verified": true,
      "author": "AH",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "If you want to hang just one or two shirts, then this is for you!",
      "text": "Utter piece of garbage. Paper thin metal support rods, and there was no way this could have supported more than one or two shirts - no way it would support anything in quantity or heavier. Item was shipped broken.",
      "rating": 1.0,
      "verified": true,
      "author": "mindzeye",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "It works fine",
      "text": "I have opened the package, but I have not used it yet. Nevertheless, I like the product. For me, I would like it if some plastic invisible bedding storage units would have zipper lock capabilities on them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Not a space saver. Probably gets the job done.",
      "text": "Eh. It does what it’s suppose to but often requires a struggle to fulfill its purpose. It isn’t the MOST sturdy product however it will probably be sufficient for your purpose. My biggest gripe is how much space it takes.",
      "rating": 3.0,
      "verified": true,
      "author": "Nai",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Like it!",
      "text": "I ordered two of these to store winter clothes. One holds pants which are laying flat and the other has sweaters and shirts. They plastic is pretty thick and the handles seem sturdy. Since I'm using these for seasonal clothes storage, they aren't being pulled and pushed around a lot. When I did use them, they easily slid around on my short carpeting and were easy to maneuver. So far I am very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 13,
      "publication_date": 20130605
    },
    {
      "title": "Great Product",
      "text": "This is much larger than I expected which I'm happy. I use it to store my craft yarns. Handles were in the inside of the bag, but a quick adjustment and it was easy to place them on the right side.",
      "rating": 5.0,
      "verified": true,
      "author": "DM_Consumer",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "I'm really happy with this",
      "text": "I'm really happy with this. I wanted something that better organizes my shoes for a small space. I also love the idea of the plastic back because I simply installed the holder backwards. This way, I can easily see which shoes I want to wear and, because the opening is facing the wall, my shoes remain free of dust and pet hair. Great product and a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa D.",
      "helpful_votes": 0,
      "publication_date": 20151010
    },
    {
      "title": "NOT FOR COATS! Or any other items with any weight to them.",
      "text": "Advertised as being capable of coat storage. The metal is WAY TOO FLIMSY! The product rods bent under the weight of just a few items. Grommet pulled out of bag top also.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Waste of money",
      "text": "Can I give this less than one star? Crumbled under the weight of just a few things. It took longer to assemble than the length of time it stayed assembled. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "GardenMamma",
      "helpful_votes": 2,
      "publication_date": 20180514
    },
    {
      "title": "Great for School/Craft Supply Organization",
      "text": "I bought this to organize art and school supplies for the kids for our homeschooling activities. I love that the pockets are clear so that you can see exactly what is in the pocket. This organizer is very sturdy. The pockets are well-constructed and roomy. Four hundred 3x5 index cards will seat all the way down into a pocket in a neat block. I am very pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Rainey",
      "helpful_votes": 2,
      "publication_date": 20140607
    },
    {
      "title": "ripped at zipper seam with first zip. returned!",
      "text": "love the clear plastic and secure closure but ripped at zipper seam the very first use. returned. bought several. returned all. same problem. even called the manufacturer to get more sturdy product but they dont make one. very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Smart Buyer",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Perfect",
      "text": "I have been looking for these and I ordered two because of the great price. They hold a lot of garments and keep them nice and clean! I wish they came in not only clear, but also opaque.",
      "rating": 5.0,
      "verified": true,
      "author": "Babs",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Great for king size spread",
      "text": "Needed a really big nice storage bag for a puffy king bedspread. This one is perfect, big enough and sturdy too.",
      "rating": 5.0,
      "verified": true,
      "author": "barbararitaville",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Happy with purchase",
      "text": "This is a solid bag - it's pretty sturdy (though the zipper makes me a little nervous since it doesn't seem super strong) and holds quite a bit. It's nice to have a place to store our linens and is still going strong about 4 months after purchase, though to be fair we don't pull it out that often. Still, it does its job. It initially had a distinct plastic-y scent, but that has faded and our linens don't smell like that at least.",
      "rating": 4.0,
      "verified": true,
      "author": "H. Wong",
      "helpful_votes": 0,
      "publication_date": 20131117
    },
    {
      "title": "Over Door Shoe Holder",
      "text": "Great quality, love the grommets and stability for hanging. The hooks are wide so they go over almost any size door. I bought this to take on a cruise to hold makeup and such (cruise cabins are very small with no space). It worked great - all my makeup and jewelry were in one spot, I could easily access it, and nothing was lost in a bag. Quality was good enough I didn't want to leave it behind, so brought it home and now use it for storage for out of season shoes. Well worth the money spent on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Marsha Davenport",
      "helpful_votes": 0,
      "publication_date": 20140221
    },
    {
      "title": "Over he door shoe storage",
      "text": "Very fast shipping! When this arrived I first took it out and it was of good size, I like the hooks for over the door very small so I can close my door all the way without any damage. I currently been storing about 8 pairs of shoes mostly flip flops and sandals and couple pairs of Mary Janes the pouches are plenty big enough. I wear a women's 6 1/2 and I am also able to store wedges in it. I would say for women it's good and men with smaller feet. Men sizes 11 up i would not recommend. Very durable!",
      "rating": 5.0,
      "verified": true,
      "author": "SportyTracy",
      "helpful_votes": 0,
      "publication_date": 20130715
    },
    {
      "title": "I am quite pleased with this product",
      "text": "While not what one might call \"heavy duty\", I am quite pleased with this product. It is exactly the dimensions I needed and hangs quite nicely in my closet. I own a seasonal home and prefer to store some valued clothing items in a more secure way. This garment bag provide exactly what I need and should serve well for a number of years.",
      "rating": 4.0,
      "verified": true,
      "author": "Theoden",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Works great",
      "text": "This seems to be a good quality shoe rack. The pockets are thick plastic, though I wish they were just slightly larger. It works well for me because I put mostly flats and sandals in it. I wear a size 8 and the shoes fit pretty well. Wouldn't recommend for boots or high heels because they just wouldn't fit. I am very happy with it and would buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 2,
      "publication_date": 20140403
    },
    {
      "title": "Not bad",
      "text": "It holds a lot of clothes, but is hard to keep assembled and hard to open.",
      "rating": 4.0,
      "verified": true,
      "author": "Kerri Stanley",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Very successful alternate use",
      "text": "I got this to go over my office closet door so that I could organize all of the small electronic cables, charges and other parts I frequently need. All of this used to be in some portable organizer drawers on a shelf in the closet and that was great - but you could never tell which drawer held the item you wanted. This is a much better solution, even though it is meant for shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "David A Saltzman",
      "helpful_votes": 2,
      "publication_date": 20131130
    },
    {
      "title": "Large, mostly plastic bag will do just fine",
      "text": "Great service and delivery from Amazon on this item. The bag was easy to assemble and hang. This garment bag is large enough to hold 10-14 women's items. All four sides are plastic, only the top and bottom are fabric. The zipper was \"off track\" when I opened the package but I was able to fix it. All in all, this is a garment bag that will do just fine for clothes I rarely access but need to protect from dust.",
      "rating": 3.0,
      "verified": true,
      "author": "skates79",
      "helpful_votes": 2,
      "publication_date": 20140603
    },
    {
      "title": "Better off grabbing one of the ziplock large bags",
      "text": "Better off grabbing one of the ziplock large bags, possibly better costructed and without that coma inducing plastic smell. 5/5 stars for noxious odor lingering abilities.",
      "rating": 1.0,
      "verified": true,
      "author": "humph",
      "helpful_votes": 4,
      "publication_date": 20140920
    },
    {
      "title": "Yes",
      "text": "I got this to put gloves and scarves in, in my hall closet which has no shelves. Great idea and works well. It would also hold shoes or whatever else you need some little cubby holes for. Good price too.",
      "rating": 5.0,
      "verified": true,
      "author": "DMSN1220Top Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "Very pleased!",
      "text": "Like everything about it. Was going to order another one and the price went up almost $4.00 so will look around.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy M.",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Meh",
      "text": "Not very durable, served its purpose for the time I needed it to",
      "rating": 2.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Worthless product",
      "text": "This product is less sturdy than the cheapest plastic bag. It broke in 2 places immediately. I had to store away some clothing quickly and therefore could not take the time to return it, So I just lay it down in a heap, covered it with a blanket and left it in storage. So much for a hanging Storage bag.",
      "rating": 1.0,
      "verified": true,
      "author": "M Elizabeth Fox",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Many different uses",
      "text": "This product was exactly as I expected. I felt the quality matches the price. I wanted one that didn't hang over the door as I have this hanging in our garage by the door for hats/gloves/socks/sunglasses etc. I plan to buy a few more for organizing computer cords and other items in the closet in the house. We have never used it specifically for shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Wright",
      "helpful_votes": 0,
      "publication_date": 20140116
    },
    {
      "title": "Great for Holding Household Products",
      "text": "I actually bought this to use in our downstairs bathroom as a catch-all for the random things we use all the time and can never find (air freshener refills, sunscreen, advil, etc). Its been great...before this, all that junk was scattered in the bathroom of every house and we either had too much of one thing or not enough because we could never find it. This was a genius idea I saw on Pinterest. Its held up great.",
      "rating": 5.0,
      "verified": true,
      "author": "BeachMom",
      "helpful_votes": 0,
      "publication_date": 20131125
    },
    {
      "title": "Works well but feels flimsy.",
      "text": "Feels a bit flimsy, but it is holding and supporting the weight from the items in the bag well. It just feels like it may break. It hasn't yet though. It's just, ok. Not great but also not bad and wasn't expensive so hard to complain but no real reasons to brag either.",
      "rating": 3.0,
      "verified": true,
      "author": "Josh Slone",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Bad quality vinyl and bended frame",
      "text": "Bad product. Bad quality vinyl and the frame inside is bended. Does not stay straight in square from. Returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Keyur B",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Breaks within a month",
      "text": "I bought this to fit all of my dresses and this was the only size that could fit in my closet along with other brand garment bags I ended up buying...it lasted a month and then the wiring snapped and that was it. Not sturdy and made out of cheap materials. Buy a more sturdier rod piece to save the disappointment.",
      "rating": 2.0,
      "verified": true,
      "author": "Catherine",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "perfect for my needs!",
      "text": "This item was perfect for my needs but I had set my expectations low based on some prior reviews. It perfectly holds all my cashmere sweaters (which shouldn't be stored on hangers) and thin long sleeve shirts and freed up drawer space! It definitely can't hold anything too heavy.",
      "rating": 3.0,
      "verified": true,
      "author": "Einat",
      "helpful_votes": 0,
      "publication_date": 20150527
    },
    {
      "title": "Not very sturdy but serves the purpose",
      "text": "It's not the best but its ok. It is not the sturdiest quality. I will be using it to store extra quilts and comforter so won't really be moving it around a lot. It'll seal the stuff n hold it in place. That's alli need. Also the size is indicated but I felt this was smaller than the picture depicted.",
      "rating": 3.0,
      "verified": true,
      "author": "new mom 2",
      "helpful_votes": 0,
      "publication_date": 20150730
    },
    {
      "title": "Worked great",
      "text": "Bought this for a trip to take to store our clothes. It worked great. Liked the quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick_n_nat ",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Recommend for smaller shoes",
      "text": "Easily hangs over your door to hold 12 pairs of shoes! No hardware or installation required. The pockets are not very roomy, and I doubt they would hold men's shoes very well, but I use this to hold my shoes (women's size 7) and my toddler's shoes. Of course, bulky shoes like boots or hiking shoes won't fit, but for smaller items like sandals, flats, heels, etc, it works fabulously.",
      "rating": 5.0,
      "verified": true,
      "author": "Kona K",
      "helpful_votes": 0,
      "publication_date": 20141209
    },
    {
      "title": "Only buy if you have 4-5 LIGHT items to hang",
      "text": "If you have only a few garmets to hang and they don’t have much weight to them then this may be the product for you. If you’d like to hang more than a few items however you’re better off just getting the individually sold garment bag packs (amazon sells 6-10 bags for around the same price as this product) and putting a few pieces in each bag. The metal apparatus used for this hanging bag is extremely weak and only lasted for about 2 weeks before it buckeled completely.",
      "rating": 1.0,
      "verified": true,
      "author": "amazon junkie",
      "helpful_votes": 0,
      "publication_date": 20171003
    },
    {
      "title": "Works",
      "text": "I have a horrible kitchen with no functional storage space I put all the things I am always loosing or rifling through the draws in a fit to find. Tape, measuring tape, plastic bags for the kitty litter, wash cloths, dish towels, aspirin all the little things that have no proper place ...I can see through and find what I want even if I do not put it back in the same pocket! I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nora M Qudus",
      "helpful_votes": 0,
      "publication_date": 20131007
    },
    {
      "title": "Bad quality",
      "text": "I bought this product to help me move and did not last very long. I bought 4. One broke after an hour I mounted the hangers and the other one with light summer clothes lasted one day. I am returning the other 2 as this product is totally useless. Though it has space to hold multiple hangers, it does not have the weight carrying capacity.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Good price and as described",
      "text": "These matched the item description perfectly, and were a good buy. I am using them to cover my size 42 and 44 jackets and suits. Like someone else had mentioned, these do squeeze the side of the coat a little. Time will tell if that creates wrinkles or a slight crease. Either way, I usually either steam or press off my jackets before wearing them so it is not a big deal. Well worth the price to protect my most expensive garments.",
      "rating": 4.0,
      "verified": true,
      "author": "E. Sikorski",
      "helpful_votes": 0,
      "publication_date": 20130107
    },
    {
      "title": "I bought 2 more right away I loved them so much",
      "text": "I bought these for art supplies. The are thin enough in width that I can put 2 next to each other since some supplies are smaller. I bought 2 more right away I loved them so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Star",
      "helpful_votes": 0,
      "publication_date": 20161124
    },
    {
      "title": "I purchased 3. I think I need more...",
      "text": "Love this item! As described by others, it's not cheap, crappy plastic. What you get for the price is pretty amazing. I will admit, I have to squeeze in my man's wide-fit tennis shoes, but everything else is easy-peasy, including his dress shoes, my stilettos and my wedge heels. Flat sandals fit into one compartment. I have one shoe holder hanging behind our bedroom door (our closet is very small), one behind the closet door in the living room (partly empty, for guests), and one behind my office/craft/pantry room that holds ridiculous amounts of various granola/power bars. Awesome. Forshizzle. Update: 5 years later, just as awesome as ever!",
      "rating": 5.0,
      "verified": true,
      "author": "Appa",
      "helpful_votes": 11,
      "publication_date": 20130531
    },
    {
      "title": "I'm sure it works... if your door is the right size...",
      "text": "I bought this product and was excited to put it to use as I expected to free up some floor space in my dorm room, but... The problem with this product is that if your door isn't the right width, it simply won't work. The door to my room is a little wide and the hooks' default width would not work for it. I tried to re-size the hooks in order to make it work, but two of the three snapped as I was re-sizing them (and I was as gentle as possible with them). The verdict: for the right door, I'm sure it works fine. For me, I wasted a bit of money on a frustrating product.",
      "rating": 2.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 3,
      "publication_date": 20131013
    },
    {
      "title": "Didn't like material",
      "text": "The plastic was not easy to unfold, I returned it. Didn't like the material",
      "rating": 1.0,
      "verified": true,
      "author": "Erika Gutierrez",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Good fit under my 6\"",
      "text": "Good fit under my 6\", low clearance bed, can't stuff them though or they don't fit. Smelled heavily of plastic when I opened them up though so I suggest letting them air out for a night before use, they smelled fine after I did that.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex D.",
      "helpful_votes": 0,
      "publication_date": 20160212
    },
    {
      "title": "Great storage for low beds",
      "text": "I bought this because I saw another review in which the purchaser had the same Ikea bed that we have! Since it is a low bed I was pleased to see that if fit well underneath. It is all true, the bag is great, fits under our bed which is 6\" off the ground. I just ordered another. Great solution when you have limited closet space.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 4,
      "publication_date": 20130814
    },
    {
      "title": "Very handy!",
      "text": "I really enjoy my new shoe rack. Of course, I still have a rack on the floor in my closet, but this new one allows me to keep less on the floor, which means...less clutter!! It doesn't hold super chunky shoes or heels well, but its great for flats, flip flops and lower heels. My fiancé is using this rack and a floor rack, but since he has less shoes, he uses it for other items: casual belts, biking gloves, old baseball caps, etc....I wanted to get another one for my linen closet for more storage, but the door is bit narrow, so I'm not sure it will work.Definitely enjoying this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Regina",
      "helpful_votes": 0,
      "publication_date": 20130528
    },
    {
      "title": "Hanging shoes",
      "text": "Perfect for all my shoes. Bought two sets and I am very please to have all my shoes in one place, I did have a problem getting the top to lay flat, but put flip flops in the first space and it works. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20161025
    },
    {
      "title": "Very Pretty!",
      "text": "I've had this for about a year and still works great. I've gone through a few different things on it but now holds several sweatshirts and some hats/gloves. It's super nice fabric and looks great in my closet. I would recommend this to anyone, it was a great way to organize my closet.",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan",
      "helpful_votes": 0,
      "publication_date": 20160131
    },
    {
      "title": "This is perfect for the door of my pantry",
      "text": "This is perfect for the door of my pantry! It holds gravy and soup packets and other small items that take up room in the pantry! I love that it has clear pockets and has 3 hooks that fit over the door. Super fast shipping thanks to PRIME. It not as long as the one in the picture but perfect for what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Robyn",
      "helpful_votes": 0,
      "publication_date": 20140725
    },
    {
      "title": "Maximal & Minimal",
      "text": "Living in independent living this maximizes wardrobe within minimal space",
      "rating": 5.0,
      "verified": true,
      "author": "Gloria J. Eddie",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "Pretty good! Not amazing quality but the price reflects ...",
      "text": "Pretty good! Not amazing quality but the price reflects it already, and you get exactly what you see in the listing.",
      "rating": 4.0,
      "verified": true,
      "author": "you",
      "helpful_votes": 0,
      "publication_date": 20171225
    },
    {
      "title": "Adequate for Men's Suits - Needs to be Larger",
      "text": "Slightly too small for men's suits. It would only have to be a bit larger to easily fit a men's suit. The opening on top also needs to be a bit larger to accommodate high quality wooden hangars. I'd buy many more if they would make these changes. As is, it's adequate...nothing more.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Soberman",
      "helpful_votes": 0,
      "publication_date": 20141104
    },
    {
      "title": "The pockets are too small for my husband's size 10 sneakers and nice shoes.",
      "text": "Men's shoes won't fit in it. The pockets are too small for my husband's size 10 sneakers and nice shoes.",
      "rating": 3.0,
      "verified": true,
      "author": "Jenny M",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Great to Concur the Closet Dust",
      "text": "Finally I have a simple way to keep the dust off my hanging clothes. At the same time it is easy to see what is inside. I do wish the plastic was a little less stiff, but overall, this is exactly what I was expecting. I will be buying more for the rest of my clothes in the closet.",
      "rating": 4.0,
      "verified": true,
      "author": "Erin Walker",
      "helpful_votes": 0,
      "publication_date": 20160521
    },
    {
      "title": "Fine if you're not going to open and close it frequently.",
      "text": "The plastic/vinyl feels decently weighty, but the zippers feel cheap. If you're not opening and closing it all the time, it's probably fine. If it's something that you're going to be using a lot, you might look to something that's better quality.",
      "rating": 3.0,
      "verified": true,
      "author": "TXnLA",
      "helpful_votes": 0,
      "publication_date": 20161004
    },
    {
      "title": "Poor Construction",
      "text": "We purchased several of these bags. The product has a major flaw. Where it is welded together it breaks apart and will not hold clothes. You can see that the two metal pieces are not even welded straight. We had to throw several out that broke. In other words, money wasted.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Great buy!",
      "text": "So glad I got these for my dresses that I usually don't wear or that I don't want tangled with out clothing in my closet. Easy to pop into your closet and is very compact. I shoved a good amount of dressed in it!",
      "rating": 5.0,
      "verified": true,
      "author": "AZN",
      "helpful_votes": 0,
      "publication_date": 20170224
    },
    {
      "title": "Frees up my bedroom from the need for a dresser!",
      "text": "Love these! I bought one for every closet. Frees up my bedroom from the need for a dresser!",
      "rating": 5.0,
      "verified": true,
      "author": "GenieWish123Top Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20171007
    },
    {
      "title": "excellent storage",
      "text": "I have had this for a while. I use it under my bed for storage. I like it because it is clear plastic and you can see what is inside. It is made of thick plastic and looks durable. It is the perfect size, not too big and not too small. I can pull it easily from under the bed. I will order more.",
      "rating": 5.0,
      "verified": true,
      "author": "Elham",
      "helpful_votes": 0,
      "publication_date": 20140610
    },
    {
      "title": "Fantastic for toddler bed storage",
      "text": "Our toddler bed has 5.5\" clearance underneath it. As long as we don't over-stuff this bag, it fits underneath. I am currently storing our baby bed linens inside and extra baby blankets for the winter season.",
      "rating": 5.0,
      "verified": true,
      "author": "Cassie Ogle",
      "helpful_votes": 7,
      "publication_date": 20130630
    },
    {
      "title": "Nice, strong",
      "text": "Nice, strong, sturdy but it will damage your door. Add cotton balls or some fabric on the hangers,that will prevent damage.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin's Ghost",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Well Built",
      "text": "I am using this over-the-door shoe holder for cleaning supplies in my laundry room. It is amazing how much weight from all of the cleaning products that it is holding. Makes for a very organized cleaning closet.",
      "rating": 5.0,
      "verified": true,
      "author": "Tricia",
      "helpful_votes": 5,
      "publication_date": 20130312
    },
    {
      "title": "Perfect.",
      "text": "I love how it doesn't take much space and it's not bothersome.",
      "rating": 5.0,
      "verified": true,
      "author": "Ofelia",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Smells",
      "text": "The product has a musty smell. After applying Febreze and washing the bags. I could use for storage. This is too bad because the bag its self works well. The company should find a warehouse that is not musky.",
      "rating": 2.0,
      "verified": true,
      "author": "Indy",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Great garment Bag",
      "text": "This was exactly what I was looking for. It protects garments that are hardly worn and I can quickly see through th clear plastic to find what I am looking for that day.",
      "rating": 5.0,
      "verified": true,
      "author": "Eugene S Rubin",
      "helpful_votes": 0,
      "publication_date": 20170819
    },
    {
      "title": "Solidly economical way to store lighter weight items",
      "text": "Overall a reasonably solid product. The plastic is good, heavy duty, but I ended up reinforcing the rope handles as they kept popping out. The zippers aren't great, but they're functional. I would still probably buy again if I needed an economical way to store items.",
      "rating": 3.0,
      "verified": true,
      "author": "Steven M Smith",
      "helpful_votes": 0,
      "publication_date": 20160728
    },
    {
      "title": "Now I can find my 'junk' from the 'junk' drawer!",
      "text": "Wonderful solution to storing miscellaneous stuff from my kitchen 'junk' drawer! Hung over the door to the basement, now I can find my glue, thumbtacks, flashlight, key chains, string, ETC.! Before it was all thrown in together and I couldn't find any of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Katy Bejarano",
      "helpful_votes": 2,
      "publication_date": 20141027
    },
    {
      "title": "nail polish!",
      "text": "I got this to keep all my nail polishes and other stuff like nail files, lotions, and cotton balls organized. They're all kept color coordinated and neat. I'm surprised that it's holding the weight of all the polishes so well! It will definitely hold slippers and sneakers well, if it can handle the polish bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "joodee",
      "helpful_votes": 0,
      "publication_date": 20131206
    },
    {
      "title": "Handles are not as sturdy as the bag",
      "text": "Handles pulled out of the holes, this is not well made.",
      "rating": 2.0,
      "verified": true,
      "author": "MDL",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Strong vinyl odor.",
      "text": "I chose this one, in part, because someone had posted that it didn't have an odor. Unfortunately, it does have a very strong vinyl odor, so it doesn't work for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Mom says",
      "helpful_votes": 0,
      "publication_date": 20150920
    },
    {
      "title": "Horrible smell and broke within one week.",
      "text": "Horrible. First my clothes smell like plastic/chemicals. I probably need to have everything cleaned....second it broke the first week. The metal is not sodered so any weight pulls it apart. Too much hassle to pack and ship back. So bye bye money......don't buy these.",
      "rating": 1.0,
      "verified": true,
      "author": "bk",
      "helpful_votes": 0,
      "publication_date": 20160917
    },
    {
      "title": "it's very sturdy.",
      "text": "I live with a heavy smoker and bought these to keep my clothes protected from the cigarette smell. It didn't work. Except for that, it's very sturdy.",
      "rating": 4.0,
      "verified": true,
      "author": "VCP",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "I love seeing all of them clearly through the pockets - ...",
      "text": "I used this with medium sized plastic command hooks to hang on the back of my closet door. I filled it with scarves, I love seeing all of them clearly through the pockets - works very well for my walk-in closet.",
      "rating": 5.0,
      "verified": true,
      "author": "dilli",
      "helpful_votes": 0,
      "publication_date": 20150121
    },
    {
      "title": "Poor quality",
      "text": "The bag is sealed all the way and there is no zipper on it, I don’t know how to open it.",
      "rating": 1.0,
      "verified": true,
      "author": "Chao Tang",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Did not stay zipped...",
      "text": "The idea of this product is great, however every time I moved the bag for any reason it would randomly come unzipped. It started towards the bottom and would open slowly. This defeats the purpose of putting items in to a sealed garment bag.",
      "rating": 1.0,
      "verified": true,
      "author": "Allyson Kitch",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "LOVE IT",
      "text": "LOVE THESE ! I use them to store papers and/or diapers 😂 . I love that I'm able to see clearly what is in each pocket . I definitely recommend !",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Great shoe holder",
      "text": "This shoe holder works better than the previous one I that I bought at a local store. An added benefit are the clear pockets. I like full visibility of the shoe since some of my shoes look the same just looking at the heel. I no longer have to pull the shoe out to see which one it is.",
      "rating": 5.0,
      "verified": true,
      "author": "V_White",
      "helpful_votes": 0,
      "publication_date": 20140303
    },
    {
      "title": "Zip Once Throw Away",
      "text": "I bought this item and inserted my clothes. When I needed a dress coat I took it out, wore it, and was ready to replace it. I was very careful with the zipper, making sure the sides were lined up. It broke. So I literally zipped once and now it is useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Good Product",
      "text": "Fits one queen size comforter perfectly. Made of high quality plastic material. The workmanship is very good. Seems sturdy and no PVC off-gassing smell.",
      "rating": 5.0,
      "verified": true,
      "author": "Vegannosaurus",
      "helpful_votes": 8,
      "publication_date": 20140117
    },
    {
      "title": "I am pleased with the protection",
      "text": "The garment bag was purchase to store winter coats and to help diminish the oder of mothballs. I am pleased with the protection. D.M.",
      "rating": 5.0,
      "verified": true,
      "author": "D.M.",
      "helpful_votes": 0,
      "publication_date": 20170527
    },
    {
      "title": "I actually use mine to store wrapping paper. I ...",
      "text": "I actually use mine to store wrapping paper. I can see exactly what is where. Also large enough for gift bags and stuff. Stands up very well once a few items are in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Scooby Snacks",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "Great outfit sorter for little's cloths. (NB-24Months)",
      "text": "I use this thing for my little girls cloths. she is now in 24 month outfits and they still fit in the slots nicely, when rolled up. Keeps me from having to dig through her cloths in the morning. I just make her outfits as I am putting her cloths away (from the laundry) and whala... outfits are ready.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Lee",
      "helpful_votes": 0,
      "publication_date": 20141220
    },
    {
      "title": "Recommended",
      "text": "Great fit for our situation. We have a standard king bed and had no problem getting three of these under the bed. Cons are it is difficult to get the sides to stand up while loading, and there is a strong plastic smell out of the package.",
      "rating": 4.0,
      "verified": true,
      "author": "DesertYak",
      "helpful_votes": 0,
      "publication_date": 20150706
    },
    {
      "title": "Great option for safe storage",
      "text": "I was renting my upstairs and suddenly needed a place to store blankets etc. that I used to keep in upstairs closets. These were economical and keep blankets safe and clean under the bed and in my downstairs closet. They are extremely spacious. The zippers seem fragile, but so far, so good! I've had no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "S. C. Greene",
      "helpful_votes": 0,
      "publication_date": 20131031
    },
    {
      "title": "Works as advertised",
      "text": "I am using this to store clothes not worn often.",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine S Stella",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Love!",
      "text": "We used this for a dorm move-in and it made transporting my daughter's \"hangables\" so easy to move! I'll never be without them.",
      "rating": 5.0,
      "verified": true,
      "author": "Shanagan",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Great. Love it!",
      "text": "This is made very well. I'm using one for cords and utility items in the basement. and another for electronic/computer/crafts parts. Very sturdy and strong. Due to the total weight when I filled them with items I screwed them into the door(could be hung on a wall as well, just find studs to secure it). Holds a lot",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20130401
    },
    {
      "title": "... grandsons toys in and let me tell it works great! The plastic is very sturdy too",
      "text": "I purchase this bag to keep my grandsons toys in and let me tell it works great! The plastic is very sturdy too!",
      "rating": 5.0,
      "verified": true,
      "author": "Merl",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "One Star",
      "text": "Doesn't hold much! Bars broke next day, Thru it into the trash!",
      "rating": 1.0,
      "verified": true,
      "author": "D. Mck",
      "helpful_votes": 0,
      "publication_date": 20180223
    }
  ],
  "product_meta": {
    "title": "Whitmor 24 Pocket OTD Shoe Organizer Clear",
    "description": "Style:24 POCKET OVER THE DOOR SHOE BAGThis easy to assemble Over-the-Door Shoe Organizer from Whitmor's Supreme Garment Care Collection has 24 clear vinyl pockets to store and protect up to twelve pairs of shoes. Instantly declutter your closet or bedroom while also saving your shoes from unwanted damage. This shoe organizer is a snap to assemble using the provided hooks and hangs conveniently over standard size doors. Whitmor’s Supreme Garment Care Collection consists of products made from, heavy-duty fabrics and vinyl, reinforced stitching and heavy duty easy-pull zippers. Because items from this line are defined as Whitmor’s premier line of products, you won't be disappointed when choosing a product from one of the Supreme Collections. Measures: 19\"W x 64\"H.. Whitmor is a 4th generation family-owned and operated business. Since 1946, Whitmor has been dedicated to bringing organization home by creating products that simplify everyday life. Ensuring that those products are built with integrity, value, and innovation is our commitment to you. And our promise is that we will always be here for you should you ever need us as we stand behind our product 100%. Whitmor customer service is available in English and Spanish Monday through Friday from 8am - 4:30pm CST. Call us and we will gladly assist you in your language. Whitmor customer service Department, 1-888-944-8667",
    "rating": 3.9,
    "feature_bullets": [
      "Over the door hooks included means no assembly is required. Hangs on standard door or closet rod.",
      "Made to last, with heavy duty clear vinyl and reinforced seams.",
      "24 oversized pockets easily organize shoes, toys, accessories, cleaning supplies, and more",
      "Neatly stores and organizes 12 pairs of shoes without taking up any additional floor",
      "Perfect for organizing bedrooms, closets, laundry room, play room, college dorms.",
      "Dimensions: 19\"X64\"",
      "Service & . Whitmor stands by our products. If you have any problems, contact us for help."
    ],
    "specifications": {
      "Product Dimensions": "0.5 x 9.5 x 20.5 inches",
      "Item Weight": "1.4 pounds",
      "Manufacturer": "Whitmor",
      "ASIN": "B000JTBU60",
      "Item model number": "6046-13",
      "Customer Reviews": "3.9 out of 5 stars878 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#88,773 in Home & Kitchen",
      "Warranty Description": "For replacement parts or assembly help call 1-888-whitmor.",
      "Import Designation": "Imported"
    },
    "categories": [
      "Clothing & Closet Storage",
      "Home & Kitchen",
      "Under-Bed Storage",
      "Storage & Organization"
    ],
    "price": 16.0
  }
}