{
  "website_summaries": [
    {
      "verdict": "The ZX/2 Classic’s excellent fit, lasting durability, and fashionable style easily make it a preference for on-trail and everyday use. However, it is still hounded by flaws, of which its confusing strap adjustments are considered the most revolting. Nonetheless, once the mentioned issues get resolved, the adorable Chaco ZX/2 Classic can potentially enable wearers to meet the excessive demands of the trail and the punches of daily chores. Interested buyers are also advised to try this on and see if it’s comfy enough for them.",
      "pros": [
        "A majority of buyers said that they got a perfect fit in the Chaco ZX/2 after breaking it in",
        "A handful of owners vouched for the durability of the sandals",
        "Several wearers confessed to wearing their Chaco ZX/2 Classic women’s sandals on a daily basis, not only for outdoor adventures",
        "A couple of people appreciated the support this strappy hiker gave them",
        "A few people said that the sandal was comfortable",
        "Some owners shared that the ZX/2 Classic is fashionable and could be paired with almost anything",
        "Its cute looks enamored a small group of consumers"
      ],
      "cons": [
        "A majority of the users found difficulty in adjusting the straps of Chaco ZX/2 Classic despite the instructions they come with",
        "The toe straps bothered a significant number of testers",
        "Several wearers complained about constantly adjusting the sandals",
        "A handful of buyers found out that the ZX/2 Classic runs a little small"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.4,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Cute but uncomfortable, and prone to changing shape at inopportune times",
      "text": "In theory you can adjust these any way you'd like. In practice, it means any time you slip your footwear is suddenly reconfigured, usually in ways that are pretty uncomfortable. I've been stuck multiple times in public, where I had to sit down and take my shoes off and spend 3 minutes fussing with them in order to be able to walk again. Pretty embarrassing. My Keens are on the dorky side, but I'm happy to hike in those for 8 hours. I can't stand walking in my Chacos for more than 45 minutes at a time. But they are quite cute...",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 24,
      "publication_date": 20180404
    },
    {
      "title": "Toe stranglers",
      "text": "I will be exchanging these for the ones without the toe strap, as that ruined these sandals for me. I adjusted these several times to fit my foot, but the toe straps kept tightening after walking for a short bit, and felt like it was starting to cut the circulation off in my toes. The shoes are comfortable if it weren't for that strap trying to strangle my big toes.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 16,
      "publication_date": 20180828
    },
    {
      "title": "Wide feet review",
      "text": "I am a size 10 and have wide feet, so I was a little nervous about ordering. I think they fit well, but they are a little difficult to put on and adjust all the straps. But once adjusted they fit really well. An 11 would be way too big. They are extremely comfortable and I just love the look of them. Excellent buy and quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Momof3",
      "helpful_votes": 163,
      "publication_date": 20160603
    },
    {
      "title": "Disappointed/ probably returning",
      "text": "I'm pretty upset I paid good money for these and overall the looked great but when I put them on the left shoe straps were so tight I couldn't fit my big toe in and the right shoe the straps were very loose! I was able to pull the stapping on the left shoe out a bit to make it fit but still don't know if it's fitting the way it should and the right side is still so loose",
      "rating": 2.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 28,
      "publication_date": 20170616
    },
    {
      "title": "Great fitting & comfortable sandal",
      "text": "Thought I’d give these Chaco’s a try since my Teva’s were worn out. I usually wear a 7 1/2. I was afraid an 8 would be too big so I ordered a 7. They fit perfectly! I have a wide foot but this wasn’t even an issue. The sandals come with illustrated instructions on how to adjust them. I followed this, kept them slightly loose while walking around the house, then tightened the strap. I’ve already taken them to Hawaii & used them for several walks & a 5 mile hike on rough volcanic rock. They worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "love2travel",
      "helpful_votes": 5,
      "publication_date": 20191107
    },
    {
      "title": "Soft, comfy and supportive.",
      "text": "I love the Z cloud ! I have a very old pair of Chacos and wanted to replace them for a trip to Cancun. These shoes are so much more comfortable than my old ones. Great arch support. I wore them everyday we were in Cancun. They didn't need any \"breaking in\" time and were comfortable right out of the box. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Johnson",
      "helpful_votes": 20,
      "publication_date": 20170317
    },
    {
      "title": "Chaco's are so meh!",
      "text": "My 3rd pair of Chaco's... I still think these are as uncomfortable as ever for wearing more than 2 hours. Everyone I know loves them and raves about them so I keep trying different styles. I think they are all lying or in comfort denial. I'll stick to my Vibrams and Birks for true all day comfort. I don't have to worry about strap issues or too hard soles making my feet burn with pain. These are uber cute though... I imagine the pain I feel after wearing these must be like wearing heals all day. Thank goodness I was able to resell these to someone who wanted them... its always an option.",
      "rating": 3.0,
      "verified": true,
      "author": "burgundeejones",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Don't try them unless you're in a very relaxed mood!",
      "text": "The straps on these sandals are horrifying, (all Chaco sandals) so much so, that I nearly hurled them through a window. Finally, I googled how to put on Chacos, and found several videos. I still have to leave myself a full five minutes every morning, in order to have time to readjust the straps. My podiatrist insisted on them, and I have to say, if I have worn my Chacos the previous day, I wake up with NO foot pain in the morning! Good thing, because otherwise, they'd be long gone through that window. So, no five stars until they come up with a less absurd way to make them.",
      "rating": 4.0,
      "verified": true,
      "author": "Portianay",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Too Cute But Not for \"Normal\" Arches",
      "text": "I really love these shoes. So incredibly cute!! I don't have high arches so I have to return them as there is just too much support in them. Just after wearing them for 10 minutes max in the house the design on the top of the soles irritated my feet badly. That coupled with the extreme arch support made it feel like I was stepping on a rock and still felt like it after I took the shoe off for about 15 minutes. I've since read that style Zvolv in Chaco works best with someone who has \"normal\" arches or low arches as the arch isn't as pronounced.",
      "rating": 4.0,
      "verified": true,
      "author": "JK Bryant",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Great sandal, once you get the adjustments right",
      "text": "Needed an athletic sandal for hiking, having broken my toe just prior to a hiking trip. This sandal was open in the right places for my needs. It’s relatively cute, for an athletic sandal. Great arch support, and seems very durable. I wear a 9.5 W, and wash sure whether to go 9 or 10. The 9 was plenty big - but unfortunately not wide enough for me. Chaco sandals take some adjusting of the straps to get them just right - once I figured them out, they were very comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Kmkchicago",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Not sure yet",
      "text": "I’ve worn these two times, and I’m afraid to commit to another time without a backup pair of shoes. I’m sure they’ll be awesome once broken in, but I hate having to break in new shoes. I recently bought a pair of sandals from another company that were comparable in cost and quality, and I just slipped them right on with no problems. These are adorable, and I really want them to work out. I have very high arches, and it’s difficult to find shoes with good arch support, which these do have. I’ll keep on trying these, but I hope they get to be comfortable soon! They are also very heavy, which will also take some getting use to.",
      "rating": 4.0,
      "verified": true,
      "author": "Erica J. Price",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Leave blisters!",
      "text": "These are not comfortable at all. If you walk more than half a mile in them, the ridges on the bottom start to leave blisters along the tips of all your little toes! So if you want to wear them, I recommend thoroughly breaking them in first! Also, they’re surprisingly small. I got a 6, and it fits, but my heels are at the very end where I feel like maybe I should have sized up. However, I’ve never been able to wear a 7 in any shoe!",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "I’m a KEEN Fan!  This is why...",
      "text": "Great arch support, nice looking, feel like quality sandals. The negative for me was the straps on this particular pair are way to long, I’ve attached a picture. I also noticed that when I walked the straps around my toes got tighter and the straps around the ankles got looser. It felt like these sandals would give blisters if I wore them any longer than 5 minutes because of the rough edges on the outside straps. Unfortunately, not the right pair of sandals for me, going back to being a KEEN fan.",
      "rating": 2.0,
      "verified": true,
      "author": "Beagle Girl",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Try before you buy. Wide width for wide feet!",
      "text": "I went to a R.E.I. near me to try on a few pairs and see what size I needed before purchasing. Ive got a wide foot and a high arch so sandals never really fit right, but the wide width in these is the closest ive come so far. My foot still hangs of the edge a little, but nothing terrible. The regular sizing fit and was wearable, but if you have a wide foot get wide width for comforts sake! So far they are comfortable and im happy with them. Again, try to track down a store that sells them to try them on, but amazon will probably be cheaper to buy them on (by 50$ for me).",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Pinnt",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Not at all worth the price",
      "text": "I’ve always heard of chacos sandals and as an outdoor enthusiast who plays in the water a lot, I was so excited to buy a pair. Unfortunately though, they are not at all worth the price (and to be honest, I would not have kept them even if they were half the price). The straps are so difficult to adjust but they don’t even stay in place once you start moving, bending crouching, (normal activities) etc. The sandals were more frustrating to wear, and not all that comfortable, either, Due to some straps tightening too much while others become loose throughout the day. Total bummer! I world not recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "K.B.",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Very narrow, toe strap is horrible",
      "text": "I have narrow feet and feel like I should have ordered a wide size! I also had to send my first pair back and go up a size. They fit small. Haven’t quite mastered the straps yet. I don’t think shoes should be so hard to wear. Still prefer my Vionic High Tides for my heel spur. Also, the toe strap constantly tightens no matter how often I adjust it. I can’t wear these shoes.",
      "rating": 3.0,
      "verified": true,
      "author": "Ragan",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Maybe I’m not meant to be a Chaco person",
      "text": "I just...I want to be a Chaco person but I just don’t know if I am. These try to strangle my big toe no matter how many times I readjust. I’ve washed them. I’ve tried to let them get super dirty and hope that keeps the straps in place. Nothing works. I have them perfectly adjusted when I first put them on and then a few minutes later they’re murdering my toe. They are really cute though. For chacos.",
      "rating": 3.0,
      "verified": true,
      "author": "Mandi G",
      "helpful_votes": 3,
      "publication_date": 20171119
    },
    {
      "title": "Don't buy.",
      "text": "Felt like I wasted my money. They are pretty but not comfortable. Toe length too long. Sole is too heavy. Near impossible to adjust. Unfit to walk in even for an average day's light walk. If I didn't get the bottom of sole dirty just trying them out, I would have returned them.",
      "rating": 1.0,
      "verified": true,
      "author": "M Sloan",
      "helpful_votes": 2,
      "publication_date": 20190806
    },
    {
      "title": "great quality. Took a bit to hit that sweet ...",
      "text": "I normally wear an 8-9. 8 wide fit perfectly.great quality. Took a bit to hit that sweet spot of strap placement, but once you get it, you keep it there. I wore these on a “light hike” in the Adirondacks, perfect, comfortable, no stones or twigs got in the sandal. Next day in the water fishing in a lake, shores edge. Sturdy, cute, very fuctional, comfortable. I am extremely pleased. I wish I had gotten them at the beginning of summer.",
      "rating": 5.0,
      "verified": true,
      "author": "MaryB",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Perfect shoe!!",
      "text": "I bought these sandals because summer is coming and I have been riding bikes, taking walks, and I needed supported sandals that would not make my feet sweat. So, I chose chacos! I have heard both good and bad things about these sandals and decided to buy them. They fit perfectly, the color is awesome. I usually have a hard time with things in between my toes, but the strap was so thin and gave a perfect amount of support. Love this shoe!",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "No thanks",
      "text": "My second pair of chacos and my first pair, which i was in love with had thicker straps but i lost them during a kayak trip. This new pair has thinner straps and i feel like evey time i walk it gets tighter around my big toe. Very uncomfortable. Im a size 6 and petite... i rather go back to the thicker band",
      "rating": 1.0,
      "verified": true,
      "author": "Kellsmarie",
      "helpful_votes": 2,
      "publication_date": 20190613
    },
    {
      "title": "Be sure to carry a sturdy crochet hook for constant adjustments",
      "text": "Though these do fit as expected, they are truly miserable around the big toe. Be sure to carry a sturdy crochet hook for constant adjustments. I gave them 3 weeks of \"trial wear before my trip. Still can't wear them without adjusting the straps constantly. Really wish I would have purchased the ones without toe loops. Really disappointed with this style",
      "rating": 3.0,
      "verified": true,
      "author": "Kathryn",
      "helpful_votes": 3,
      "publication_date": 20170724
    },
    {
      "title": "Toe hurt after wearing them and got numbed",
      "text": "I wanted something to wear during summer but after giving it a try.... ummm it’s a NO I had to return them! Hard to put on ... even after I fix them and had them on for a little while my big toe would start to hurt and get numbed ! They look good and somehow my plantar fasciitis wouldn’t bother me as much... but the toe getting number was a big issue for me, maybe I’ll try adifferent style",
      "rating": 1.0,
      "verified": true,
      "author": "Miriam",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Cute!",
      "text": "I normally wear a 9.5 or 9.5wide in women’s and bought a 9 in these. They fit. It’s crazy how many reviews mention the straps being too loose or too tight because they’re totally adjustable! The straps slide through the footbed so you can change how loose or tight they fit. I am pretty flat footed so the arch was a bit uncomfortable at first. But since I’ve been having foot problems I waited a few days. My feet do not hurt! I’m not gonna run a race in them but they seem to be helping.",
      "rating": 5.0,
      "verified": true,
      "author": "mobetta",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Not quite...",
      "text": "I love the how comfortable the sole is and that I can get them wet and muddy and just spray them off and they are good as new! They are also super cute... BUT... I’m giving 3 stars because the straps don’t stay where I adjust them and they end up digging into my foot in certain places when I wear them for a long time. This is very uncomfortable and I end up not wearing them as much because I just have to keep adjusting them in that spot throughout the day. I don’t know if this is specific to me and my foot or the way I walk or whatever... I hope this helps!",
      "rating": 3.0,
      "verified": true,
      "author": "Carissa Dunn",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Good fit, sketchy packaging, hoping they are the real deal.",
      "text": "Sandals arrived in a plain shoebox with no logo or label. Sandals didn't have manufacturers tag on them and no product pamphlet explaining how to adjust the straps. This made me very leery about the sandals being knockoffs, especially since I paid $100. Chaco is stamped on the sole, so I can only hope they are the real deal. They fit as described and are very comfortable walking all day. Haven't tried them on the trails yet, but imagine they'd be fine on groomed trails. I have a high instep and wide foot so the sandals are great for giving the right amount of support and have a secure fit. Only gave 4 stars because of the sketchy packaging.",
      "rating": 4.0,
      "verified": true,
      "author": "Robinknits",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "my favorite pair of sandals",
      "text": "I had another pair before I ordered this pair and the only reason I got a new one was because my previous pair that I had had for over 11 years literally fell apart because I had worn them to death. MY FAVORITES. I wear them all summer long. The only time I dont enjoy wearing them is when I am going to do a very steep hike. It hurts my feet to grip my toes at the downhill angle for 1+ hour. Otherwise, I wear them all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Moore",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Over-rated sandal",
      "text": "The sandals are very cute, get tons of compliments. I do get blisters on the side of my right foot not sure why since it’s only right foot. I only get them if I walk around in them for an hour or more consistently. They aren’t very easy to put on but once they’re on properly they’re great. I wanted to love these sandals so bad but I honestly think they’re a bit over hyped. They had a wonderful arch support but they have no cushion so it isn’t very comfortable. The price does not match the comfort!",
      "rating": 3.0,
      "verified": true,
      "author": "Marjorie ",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Great - Comfy & Durable Shoes!!",
      "text": "I got these for my daughter who normally is a size and it seems to fit true to size. The straps are tight at first and she seems to have to adjust them just in the beginning. She said now after a couple wears they start almost forming and adjusting to her feet. She thinks they are wonderful and she absolutely loves them!! She says they are really comfortable!!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Allen",
      "helpful_votes": 14,
      "publication_date": 20170429
    },
    {
      "title": "Awesome sandals",
      "text": "Sandals are great, pretty good quality and very very nice looking. They are way heavier than expected but really comfortable though. The most amazing thing they have is that you can fit them your way, which means you'll always have the most comfortable fit and you can readjust them as many times as you want to so in case you need to walk on a slippery surface you can tight them up or loose them as needed. I love this sandals and I think I'll stick to the brand. I love adjustable shoes and these are awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "rainbownaty",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "I am pretty disappointed in the toe strap",
      "text": "I am pretty disappointed in the toe strap. I thought that I would like the toes strap because it would stabilize the shoe. However, it keeps tightening as I walk. The strap tightens and tightens until both my toes are purple! I will come back and review if it changes at all.",
      "rating": 3.0,
      "verified": true,
      "author": "Rog",
      "helpful_votes": 6,
      "publication_date": 20160705
    },
    {
      "title": "Comfy, but clunky...",
      "text": "SUPER hard to get the straps to move when loosening/tightening, yet the bucke doesn’t hold it in place, and the whole weave will loosen on its own every few steps. The fit is perfect, the sandals are super cute, and they are very comfy once I can get the toe loop to not be too tight, but having to spend 10 minutes putting them on, then having to keep yanking them tighter every few steps is killing my vibe with these...",
      "rating": 3.0,
      "verified": true,
      "author": "Petra Tabor",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Very comfortable sandal",
      "text": "these sandals take a little getting used to, but once you do, they are extremely comfortable. I really like how you can adjust the straps to better fit your foot. However, the only downside I would say is that you really cannot adjust the back strap. I ordered a 9 and they are slightly large, but going down a 1/2 size wasn’t an option unfortunately. I normally wear an 8 1/2 and was a little skiddish going down to an 8. I hope this helps",
      "rating": 5.0,
      "verified": true,
      "author": "Carolina Blue",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "High arch support and very comfortable.",
      "text": "I am returning these because the Chaco Women's Zvolv X2 Sport Sandal fit me better, but I liked these a lot too. They were very comfortable. I am usually a 7 1/2 and I bought a 7. I wish they had half sizes because these fit, but just barely and the 8s are a bit big. The arch is much more pronounced in this style than the Zvolv style. For me it did not feel as good, but if you have high arches this may be a good fit for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 2,
      "publication_date": 20180611
    },
    {
      "title": "Let down",
      "text": "This may be because I've never owned chacos and I really wanted to like these, but I just dont, especially for a 70$ pair of shoes. I'm not sure if it is because I owned Tevas first, but the bottoms of the chacos are so heavy, the straps on top are too loose I just felt so uncomfortable in them. I really wanted to like them, but even tightened as far as they go I still felt like they weren't secure enough. I'm usually a 9.5 and I sized up to a 10. The footbed was a good size but the staps just felt wrong.",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Feels great but difficult to adjust",
      "text": "These sandals feel really great once they are properly adjusted, but adjusting them is very difficult. Also, I don't know if it is because they're wide or because they are so difficult to adjust and maybe I am still not doing it right, but the strap could definitely be about an inch longer. The arch support feels really good though. I can't wait to use these on trails in Switzerland next month.",
      "rating": 4.0,
      "verified": true,
      "author": "TiffyBen86",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "FAIRLY GOOD",
      "text": "I love Chaco. They’re great. This style was not what I expected though. I have worn them once and didn’t expect them to be so heavy but that’s because they’re for outdoorsy things like hiking. The ties around the foot and toes are interesting. One sandal has a longer string than the other. I had to really mess with it and adjust it to make it somewhat comfortable. I’m believing for them to break in, so let’s hope they do!",
      "rating": 4.0,
      "verified": true,
      "author": "Bailey",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Comfortable shoes",
      "text": "Tried both these and the Tevas. They are both good for wide feet and I loved that these had the option to choose wide. Also love the straps can be adjusted so much by simply pulling them through the sole. The reason I sent back is because the toe hole. Although it looks cute it’s simply not as easy to slip on as the Tevas were. Overall a great shoe if you don’t mind that one thing.",
      "rating": 5.0,
      "verified": true,
      "author": "cyatraveler",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Not for me",
      "text": "I received this delivered by someone that was not FedEx or UPS. It was delivered after hours to where I work and dropped at the front door OUTSIDE! I will never purchase anything delivered like this again. Now back to the shoe, it is off on the arch, like I need to have a longer shoe, the straps are tight even tho I purchased a wide shoe thinking it would fit better. These may be all the rage but their straps are to tight for someone with a less than tiny foot!",
      "rating": 2.0,
      "verified": true,
      "author": "IfollowChrist",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Nice women’s chacos",
      "text": "Chacos fit nicely. Slightly smaller/skinnier than the chacos I bought years ago, but still a good fit. The title says they are men’s, but they are definitely women’s(it says women’s on the box). I wanted women’s, so I’m glad they actually are.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnson",
      "helpful_votes": 2,
      "publication_date": 20190717
    },
    {
      "title": "Love these sandals!! 💕",
      "text": "Love these!! Great color, great fit. You should probably break them in a few times before walking in them for hours!! Sometimes they get too tight, but take a moment to watch a quick YouTube video on how to quickly loosen them while wearing them!! Great purchase!! 🙌🏼",
      "rating": 5.0,
      "verified": true,
      "author": "Tami L. Foster",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Sturdy and supportive!",
      "text": "I absolutely love this shoe. I have put a ton of miles on these shoes and they have not disappointed. I definitely had to get used to the arch support because of how high it is, by once your foot adjusts, I couldn’t imagine it being any less. I’ve done a ton of rugged and water trails and they’ve done an awesome job. The tread on the bottom is also a big positive. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashes",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Cute, but oh those straps",
      "text": "Cute, comfortable...kinda...but... WHAT is with the straps?! Driving myself insane trying to get them juuuuust right. Finally get them exactly the way I want...loose toe, tighter midfoot. I take them of oh-so-carefully to keep the perfect strap configuration and the next time I put them on...TIGHT toe...start all over. Adjust, tug, pull, adjust. Grrrr. Overall, I prefer my Tevas.",
      "rating": 3.0,
      "verified": true,
      "author": "A Librarian",
      "helpful_votes": 3,
      "publication_date": 20171107
    },
    {
      "title": "If you are in between Chacos and Tevas.....",
      "text": "After reading multiple reviews of Tevas and Chacos, I decided to order a pair of Tevas while stuck in quarantine....I ended up ordering 3 pairs because they just didn't fit right so matter what size I ordered. They didn't to stay on feet straight and I didn't feel secure. Finally I gave in a bought some Chacos. I usually wear a size 8.5 but ordered the 9. There were instructions for getting the straps to fit your fit perfectly and so far I'm very happy with them. I feel secure in these. I haven't walked a good bit in them yet so I'm not sure if I will get blisters....to be continued.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Chacos ❤️",
      "text": "This is my third pair of chacos! I love them! My first pair died when a puppy I was dogsitting got ahold of them (RIP), my second pair was stolen by my mother (and 5 years later are still in great condition), and now I just received these! My only complaint with my order was that I had ordered the “wink blue” z2s and the ones I got are gray and mint and z1. I’m keeping them because I love the print and I prefer the way they look to the wink blue, but buyer beware, you may not get what you order to a t!",
      "rating": 4.0,
      "verified": true,
      "author": "Samy",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Best. Shoes. Ever.",
      "text": "Was introduced to Chacos by a family member and will never look back. Does take some getting used to. I have flat feet and these helped with arch support tremendously. However first few days wearing them I only could do a couple hours and not far walking. Hurt the muscle over the top of my foot. Now they’re super comfortable, almost like walking barefoot. Love them so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Not perfect",
      "text": "Daughter reports these gave her a blister on the outside edge where the strap meets the footbed on one foot. This happened after walking at least a mile. She put some moleskin on the shoe for awhile and is hoping that eventually, they will break in and not cause a blister. Since it takes a considerable distance for the blister to appear, and she did not buy them specifically for walking long distances, she wants to keep them (rather than attempting to sell).",
      "rating": 3.0,
      "verified": true,
      "author": "Ann Fitzgerald",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "My favorite shoe",
      "text": "This is my second pair of Chacos - I had my first pair for over 10 years and they finally broke down after daily wear. I find this shoe to be so comfortable and supportive that I don't want to wear any other shoe. I live in Florida and walk a lot, so I appreciate having good foot support but also the cooler comfort of wearing a sandal. Plus, if you doing any boating activities and need a shoe that will stay on and protect your feet if you need to jump in the water, this product is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Billie",
      "helpful_votes": 3,
      "publication_date": 20160614
    },
    {
      "title": "Great sandals!",
      "text": "First pair of Chacos and they are perfect! I got a size 7 in the \"Creed Golden\". I usually wear a 7.5 in tennis shoes and a 7 in sandals, so these fit just as expected. The color is a light grey with orange/golden flowers. It's a nice neutral color that should go with a lot of outfits. The sandals also feel comfortable and the straps were pretty easy to adjust. I haven't had any issue with the straps tightening too much around my toe once I adjusted them to fit my foot.",
      "rating": 5.0,
      "verified": true,
      "author": "k1s5dan",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Solid and Stable",
      "text": "My second pair of Chacos. So far they have gone on a few hikes. My first pair of Chacos lasted over ten years and more miles than I can count. I wore them until the soles were gone. These seem pretty sturdy and they're comfortable for hiking and river crossings. The toe loop is a little difficult to get the fit just right and a little more frustrating to fiddle with than the simpler model strap that goes across the toes only. However, once I dialed in that toe strap adjustment it made the sandal feel much more secure on my foot, especially when crossing rivers.",
      "rating": 5.0,
      "verified": true,
      "author": "Hallie Dallie",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Perfect arch support for high arches",
      "text": "Bought this for my wife. She is a runner with high arches and these shoes help soothe her feet from plantar fasciitis. We got them for hiking, but they weren't ideal for her. The two-strap model seems to be harder to adjust, and she has complained about tightening around the big toe on its own during longer hikes. She mostly uses them for casual walks now, and for that, they are perfect and quite comfortable. Minus 2 stars for how tricky they are to adjust and for the adjustment moving on its own; Plus 1 star for the amazing arch support.",
      "rating": 4.0,
      "verified": true,
      "author": "Gui Oba",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Comfortable shoe with a little work",
      "text": "I had a pair of chacos 10 years ago that I loved so I got another, previous didnt have a toe strap. The straps were too slick to start and would cut off circulation to my toe after a little bit. After some research i found that someone recommended getting straps where you want and putting super glue in the holes. After i did that they have been great.",
      "rating": 4.0,
      "verified": true,
      "author": "A Jane",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Straps are uneven 😣",
      "text": "They said okay, but the straps are uneven. One shoe pulls as tight as it can, while the other is in top and so tight. The buckle in on top of my foot instead of on the side. I spent over an hour trying to mess with the straps, but it will not look like the other shoe. I bought these to go to Costa Rica on vacation and is them for hiking. I don't know that I have time to get new ones before I go. I'm just sad they aren't right. 😒",
      "rating": 2.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "I love my Chacos sandals except....",
      "text": "I love these Chacos. They are comfortable and I love how they are adjustable. I had been wearing another cheaper brand of similar sandals for use while kayaking. I walk on boat ramps that are often slippery with algae. These Chacos do not perform as well as my cheaper sandals on algae covered concrete. That is the only down side of my Chacos.",
      "rating": 4.0,
      "verified": true,
      "author": "Vicky Carey",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Love!!",
      "text": "Love these sandals! They will be perfect for my river trip! I love how adjustable they are as I have wide feet. Very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom4Life",
      "helpful_votes": 2,
      "publication_date": 20200722
    },
    {
      "title": "I was so excited.",
      "text": "Let me start with these shoes do seem very sturdy and I like how the straps can be adjusted. Other than that, the arch support seems to be in a very strange spot. I tried two different sizes and both of them were painful to wear after a few minutes. Also, once you adjust the straps to get them to fit your foot and then take them off, they are difficult to put back on. I have a very normal foot. I can try on pretty much any size 8 1/2 shoe and it fits. Not these.",
      "rating": 3.0,
      "verified": true,
      "author": "Heidi O.",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Not a fan of the toe strap personally",
      "text": "I ended up sending these back to get a style that doesn't have the toe loop. But the footbed was excellent and chaco always makes a great product. I loved the color of this style. My toes are just too fat for the loop, even though it was adjustable, it just rubbed the side of my big toe raw. My new pair without the toe strap are prefect. And I have lots of friends who prefer this style with the toe loop!",
      "rating": 4.0,
      "verified": true,
      "author": "Roxxanne T.",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Like the Z Volv over the Classic",
      "text": "This was my first Chaco. I wear a 6.5 shoe and mistakenly rounded up instead of down so the arch of my foot hurt in these. The material is very hard and unyielding, and a bit heavy for my liking. I sent these back and went to a store to try others on and ended up buying the softer and lighter Z Volv 2 shoe in a 6 which feels great",
      "rating": 3.0,
      "verified": true,
      "author": "carolet1966",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Relatively comfortable but not quite the fit I would prefer",
      "text": "I've hear rave reviews for Chacos and heard they had great support. I ordered these which are cute but I am kind of annoyed by the strap that hangs so low I end up stepping on it and the heel of the shoe is too tight. It hurts to wear the shoes for too long. I did decide to keep them however because they are a good choice for some occasions.",
      "rating": 3.0,
      "verified": true,
      "author": "KentuckyGal",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Back strap not snug",
      "text": "I’m sending these back. I was able to adjust the straps to a comfortable position on the top of my foot but the back strap is not adjustable and does not fit snuggly. I don’t love the toe strap. And the sole is not super comfortable, not enough arch support. Overall for a $100 pair of sandals, I should be in love. I’m not. I and returning and trying a pair of the cloud sole chacos with no toe strap with hopefully better results.",
      "rating": 2.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Pretty good.",
      "text": "I still prefer Sketchers sandals to Chacos. These are stylish and comfortable to wear while I'm on my feet teaching all day, so they serve their purpose. However, I did go out shopping one day and was uncomfortable walking in them all day, which is what they are actually made for (walking/hiking). The arch support is high. After awhile it starts to make the bottoms of my feet ache, but for minimal walking, it's fine. You can adjust the straps to give more room or to make tighter. You can not slip off like most sandals but most loosen to get them off.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Fuqua",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Highly recommend!!",
      "text": "By far my favorite pair I’ve gotten so far. My shoe size is between a 9 1/2 and a 10. I needed up ordering the 10!! I have very wide feet and usually order a wide in shoes but chose not to this time around just to try them out and they fit GREAT! I didn’t even need to break these in. They felt so comfortable the second I put them on.",
      "rating": 5.0,
      "verified": true,
      "author": "Whitney Winkler",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Worth the money",
      "text": "The first pair lasted her 4 years before being handed down to the next sister who continues to wear them daily. They still wear well but do look a bit ragged and faded. We bought this pair because we have experienced how well chacos hold up to years of wear and tear by many kids. Chacos are a good investment for a large family with lots of hand-me-down experience.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "I wish I could have loved these more",
      "text": "I got these and was so excited because I have heard so many good things about these shoes. The straps were so confusing, took me 30 minutes to figure you how to put them on. walking in them it was not as confuse as other shoes I've had, the straps hurt a lot. It was a big investment and I was very disappointed that I had to return them. I wanted to love them, but perhaps in the future I can buy a different style, maybe the one strap style instead of two straps.",
      "rating": 2.0,
      "verified": true,
      "author": "Ally Hamilton",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Not worth the $ or hype!",
      "text": "Ordered 2 different pairs. Sent 1 back immediately, hurt and was uncomfortable. The second pair felt good at first , but after just walking my dog gave me blisters on the sides of both my heels, bad blisters! Heel is very narrow, my feet aren't wide at all, but definitely don't work in these sandals. Not worth the $$ or the hype!",
      "rating": 1.0,
      "verified": true,
      "author": "DDallas",
      "helpful_votes": 3,
      "publication_date": 20170729
    },
    {
      "title": "Okay so actually these sandals are super cute. I can’t wait to have weird tan ...",
      "text": "Okay so actually these sandals are super cute. I can’t wait to have weird tan lines because of them hahha. But I got them 4 stars because having a normal foot, it takes time to get used to the whole high arch thing. I would also recommend that if it is your first time buying these babies to do it at a store for the fitting because it got me and my roommate to figure out how to make the straps comfortable enough for me not the get blisters. That is serious business okay?",
      "rating": 4.0,
      "verified": true,
      "author": "Ruth delgado",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "Perfect for Busy Piggies",
      "text": "I LOVE these sandals. I'm a teacher and am going on my feet all day. These give me the support to not go home with aching painful feet like I have from every other shoe I've tried. Now I need this style of base in a full shoe! So worth the $$ as every strap is adjustable!",
      "rating": 5.0,
      "verified": true,
      "author": "JennieH725",
      "helpful_votes": 6,
      "publication_date": 20160903
    },
    {
      "title": "Terrible fit",
      "text": "My toe barely fits in the toe loop. It is not adjustable like the other straps. Gave me a blister. If I bought a larger shoe the whole shoe would be way to big. Also, the adjustment straps with the clip have so much slack that they drag on the ground. If I didn’t throw away all the packaging then I would return these shoes.",
      "rating": 2.0,
      "verified": true,
      "author": "Ryann",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "New to chacos",
      "text": "I've tried other chacos in a store and went on here to find the color I want (yup Amazon does it again). It wasn't the exact same chacos year and model but I'm glad it still fit well. I thought I had wide but I rarely needed to buy wide shoes, so these (non wide) worked for me. I have bunions and flat feet is what makes me feet wider than usual but NOT narrow enough to fit in most pointed heels. So far I can see why someone complained about the strap being too long...and so far I just tuck it in the back. I wear it loose enough that it doesn't rub me.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Phillips",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "Broke out of foot jail and returned them",
      "text": "I loved everything chacos stood for. Outdoorsy, adventure, etc etc. they arrived in the mail I put them on my feet and I couldn’t take them off soon enough. Maybe I walk funny- but I kept stepping on the inside of the raised heel cup. They were heavy, clunky, and I hated having my big toe strapped in.",
      "rating": 3.0,
      "verified": true,
      "author": "heather slagle",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Maybe I got a bum pair...",
      "text": "You know, after all the hype about Chacos, I finally broke down and bought an original pair. I've had a few other pair, leather,etc.but not the traditional ones. I went white water rafting at the end of July 2016. Imagine my surprise when I got out of the boat to see right sandal was beginning to fray on one of the toe straps. Seriously, I dare not get them wet or use them for hiking or anything bc I'm afraid that strap will snap. Meh.",
      "rating": 2.0,
      "verified": true,
      "author": "Marisol",
      "helpful_votes": 2,
      "publication_date": 20160818
    },
    {
      "title": "Consider ordering the wide!",
      "text": "I messed up and didn’t try them out before my return window closest. Now that I ‘ve had the chance to try them on and wear them around my house, I regret not ordering the wide. I was sure I wouldn’t need to as my feet are somewhat narrow. Was really excited for these and bummed I won’t be able to use them.",
      "rating": 3.0,
      "verified": true,
      "author": "Rebecca R. Adams",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Do not buy. These are fake!!!",
      "text": "These came without tags and in a plain box. We have two other pairs of Chacos and these are definitely fake! The soles are hard as rocks and the pattern is so rough it rubs and leaves sores in my feet. I am so deeply disappointed and the return deadline was yesterday so I am stuck with these horrible and expensive fake sandals. Please buy from somewhere that is reputable.",
      "rating": 1.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 3,
      "publication_date": 20180813
    },
    {
      "title": "Love these sandals",
      "text": "My daughter bought a pair of these shoes a year ago and absolutely loves them so I thought I would try them too. I typically wear a 9 - 9 1/2 shoe. I don't have a wide foot and the size 9 regular was not wide enough and pinched along the outside of my foot. I went up to a size 10 regular and they fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie J. Millen",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Tourniquet around the toe :(",
      "text": "I REALLY want to like these sandals. Unfortunately with this model it is very common for the straps to “slide” as you walk creating a tourniquet around the toe. I’ve tried loosening them over and over, tried washing them (suggested by customer service) and nothing has worked. I’ve called costumer service twice (very little help) and now just spoke to repair service. My only option is to send in for a “toe fix” which takes weeks and may not work. I bought these for an upcoming vacation so don’t have weeks to wait, and don’t feel like going through the hassle. It’s too bad such an expensive sandal would have such a huge issue.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Different sized straps",
      "text": "The straps are all different sizes. See in pictures. I will be taking these back and going to Nordstrom instead, I’m hoping it’s the seller I bought these from and Chaco didn’t change the best sandal to ever live!",
      "rating": 1.0,
      "verified": true,
      "author": "Andee",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Squeaks like an old door",
      "text": "my sandals squeak something horrible. I sent email to company and was told to try powder on them. Still squeak. Then I called and was told I would need to mail them back for repair. These are brand new sandals. They also said they were behind in repairs and so they could not say exactly how long it would take to return. I actually love the sandals and the way they fit but the squeak is a defect that should have been replaced, not repaired at the expense of my time.",
      "rating": 2.0,
      "verified": true,
      "author": "Dave Anderson",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Great Shoes, and Adjustable Straps make them Last!",
      "text": "I love these shoes!! They are (thus far) great for water, hiking and just general comfort, support and as a plus they are just too cute!! Some reviewers were complaining about the straps being too tight; however, they are adjustable and you can make them looser. If I hadn’t adjusted them, they would have been too tight even on my narrow feet. I appreciate this feature, as you can adjust, tighten or change then over time as they get more use, rather then having them wear out too quickly and be unable to tighten them as the inevitable occurs (no matter how well made the shoes).",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Tight Bands",
      "text": "I LOVED these shoes. The colors are great! The arch support was supreme. However the bands barely fit over my feet and toes. I literally stood up in them once I got them on and they instantly began rubbing. I was planning on wearing them for a hiking and camping trip but there is no way they would work. I am sad to say I had to return them.",
      "rating": 3.0,
      "verified": true,
      "author": "Kristina Z.",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Not very comfortable, a bit large",
      "text": "I usually wear 7 or 7.5 in sandals, but even these 7's are too big. My heel sits pretty far back which isn't adjustable, and there's quite a bit of room at my toes. Not nearly as comfortable and light feeling as my Teva Verra sandals, so I'll go back to those. Love the adjustable straps, though.",
      "rating": 3.0,
      "verified": true,
      "author": "hkf",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "really wanted to love these shoes",
      "text": "I really, really wanted to love these shoes, but I have very low arches and was unable to even just wear them on my feet comfortably. If Chacos ever made a version featuring no arches, I would buy them as soon as I could. For now I'll settle with a competing brands similar style shoe.",
      "rating": 3.0,
      "verified": true,
      "author": "Tiffany Tabor",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Too much strap adjusting every time you wear them.",
      "text": "Bought these for my daughter (all the rave - oh the tan lines!!!). But she spends too much time adjusting straps all day. And the back area where the straps come through cut into her feet. Waste of money but a neat idea on adjustability. Not good choice for wide feet.",
      "rating": 3.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Toe discomfort",
      "text": "My daughter bought these for school, but the toe part tends to tighten on its own, which makes wearing them out and about a bit difficult.",
      "rating": 3.0,
      "verified": true,
      "author": "Tiffany Watkins",
      "helpful_votes": 2,
      "publication_date": 20180813
    },
    {
      "title": "Fantastic shoes BUT break in slowly!",
      "text": "I love these shoes for everyday wear and for more active things such as kayaking and hiking. HOWEVER, break them in slowly! I went on a four mile trail walk for my first wear and came out with blisters on both feet that ran the length of my foot, after this occurrence I can now wear them as long as I want comfortably, but they needed to be broken in more slowly.",
      "rating": 5.0,
      "verified": true,
      "author": "Alyssa J.",
      "helpful_votes": 3,
      "publication_date": 20160904
    },
    {
      "title": "Firm sole, adjustable and waterproof",
      "text": "I am a big fan of Chacos, have several pairs, and these do not disappoint! Plenty of support for hiking long distances and over rough terrain, as well as fording streams, and especially nice in summer because your feet are open to the air. Very good quality!",
      "rating": 5.0,
      "verified": true,
      "author": "G. Richmond",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Knock off? Or just a poorly made pair?",
      "text": "I love the Chaco brand and support, especially being a teacher who is on my feet all day. However, I’m super disappointed in the pair I ordered from here. Within 4 wears, a strap completely broke! I had them adjusted perfectly (as I’ve had a few pairs that have lasted forever), and while I was teaching “snap!”. I had to throw them out and luckily had a back up pair of shoes at school! Very disappointing.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaitlyn H Leonard",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "... store before purchasing to decide on which size fits best. I normally wear an 8",
      "text": "I tried these shoes on at a store before purchasing to decide on which size fits best. I normally wear an 8.5-9 but the size 8 fit perfectly. The sandal itself is adjustable and I was able to easily adjust the straps for my feet which run a little on the wide side. The shoe bed is very comfortable and I feel like I have really good arch support. I have not had any issues with discomfort or straps rubbing in any way. Love these sandals and glad I bought them. They will be perfect for warm weather hiking and use around the camp for overnights.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170724
    },
    {
      "title": "Nice to find Wide widths available.",
      "text": "Great to find Chacos online at amazon when Wide width is hard to find in store. However, even though I usually wear an 8.5 wide in all other shoes, I think the regular width actually fits me better and provides more support. The wide was actually a little more width than I needed, which is rare, so well done Chacos! Thank you for options! I will stay with my regular width.",
      "rating": 5.0,
      "verified": true,
      "author": "lovinlife",
      "helpful_votes": 0,
      "publication_date": 20170606
    },
    {
      "title": "Straps are too long and make the sandal fit loosely.",
      "text": "I'm so frustrated with this sandal! The straps are way too large. Even tightened all the way, the sandal flops on my foot. I can't go down a size smaller because the foot bed is a good size. Returning these because they're uncomfortable to wear for more than a few minutes. I'm a size 8 and ordered size 8.",
      "rating": 1.0,
      "verified": true,
      "author": "nunya.business",
      "helpful_votes": 3,
      "publication_date": 20180610
    },
    {
      "title": "I would recommend trying these on in a store to see what ...",
      "text": "I would recommend trying these on in a store to see what size properly fits you before buying these online! I purchased a size seven because I'm usually a size seven. I never tried one of these on before in store so I just went with my usual size. These shoes are so comfortable and I can't wait to go out and wear them in all kinds of terrain. The only problem I've noticed is that the toe strap is pretty loose (but maybe I just have small toes) and when I tighten the straps, the hanging strap at the end of the the buckle is very long and doesn't look great, but maybe I can trim them off somehow.",
      "rating": 5.0,
      "verified": true,
      "author": "KeFu05",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "Not what I expected, but still good",
      "text": "I bought these hoping they would fit like a pair of Chacos I already have -- but they aren't quite the same. My previous pair are ZX/2 Yampas from REI; the straps on this new pair of ZX2 Classics from Amazon seem to be a little shorter, I can't get them to fit quite as loosely as I would like. The footbed feels the same, I really like the cushiony feel and arch support. \"Camper Purple\" implies that the color of the shoe is primarily purple -- the INSIDE of the straps is purple, once I put them on my feet, the straps appear mostly blue and red.",
      "rating": 4.0,
      "verified": true,
      "author": "Terri",
      "helpful_votes": 0,
      "publication_date": 20161007
    },
    {
      "title": "Right size, so comfortable",
      "text": "I have been recommended these sandals for several years and I finally got myself a pair. I've been wearing these sandals since July and I can't stop wearing them, even in the fall. They're so comfortable and cute! I can wear these all day with no issue-- even when hiking all day. One thing I will mention is that I had to find the right size. I tried on the size 8 at a store and they felt far too small but the 9s were perfect (though usually I'm an 8.5). When I had the 8s on, it was not very comfortable and kind of hurt my foot, but the 9s feel like a dream.",
      "rating": 5.0,
      "verified": true,
      "author": "Eva",
      "helpful_votes": 0,
      "publication_date": 20161004
    },
    {
      "title": "Right size will bring perfect fit for all",
      "text": "Oh my goodness these are the best footwear for the entire Spring and Summer no matter where you walk, hike or even go swimming. If you get your true size, you'll never go for another sandel. I've given a few for presents just to prove these are great. They will become your new best pair of shoes!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer 1959",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Hard, heavy, and painful",
      "text": "I don’t like how the material is so hard it gets hot and hurts your feet after a few minutes of walking around. I thought Chaco sandals were comfy because of some reviews but they are so heavy and hard that they are the worst shoes I have ever owned. Never again.",
      "rating": 1.0,
      "verified": true,
      "author": "Alejandra Arriola",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Very stiff sandal",
      "text": "This is an extremely stiff sandal. I have flat feet with no arch and when I put them on the foot bed felt extremely weird to me and the tow strap did not work for me. I have worn Tevas for years and I guess I'll be ordering another pair.",
      "rating": 1.0,
      "verified": true,
      "author": "Helene",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Get wide width for hiking",
      "text": "As a hiker I wish I would’ve gotten the wide width, even though my feet aren’t really wide. When hiking the outside cup of the sole can really dig into your sole...not an issue for walks but for more strenuous mountain activity it can hurt sometimes!",
      "rating": 5.0,
      "verified": true,
      "author": "tab",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Overall comfortable",
      "text": "I got a pair basically for a trip to the Riviera Maya, it was a smart idea to start breaking them and adjusting them like a month before my trip. This way with all the walking involved in the trip my feet wouldn't kill me. I did get tired of them by the end of a long day (8-10 hrs walking), but overall very good and comfortable shoes specially for hot and humid kind of adventures.",
      "rating": 4.0,
      "verified": true,
      "author": "Enith S",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Each sandal fit differently",
      "text": "My wife ordered a pair of Chaco Women's ZX2 Classic Athletic Sandals. Unfortunately, she had to return these. The sandal for the right foot fit well. However, the sandal for her left foot did not. The strap on the heel cannot be adjusted and it was longer than the heel strap on the right foot sandal. She felt like she was going to walk out of her sandal.",
      "rating": 1.0,
      "verified": true,
      "author": "Charles Bradford",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Be patient with adjusting they’re worth it",
      "text": "Bought my correct size in wide and it was perfect. Takes time to break in (probably a week) I just wore the straps too loose so they didn’t dig into my feet and it was fine. Now that they’re broken in they’re probably the comfiest I own",
      "rating": 5.0,
      "verified": true,
      "author": "Karlie ",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "I love these so much",
      "text": "I love these so much! They're really hard to adjust at first, so I recommend knowing someone to help you. Also they hurt SOOO bad when you first break them in, for about 2 weeks. After that it's great. Also, you can wear them in the rain, but don't be freaked out when the straps don't pull as easy. Once they are completely dry it will return to normal.",
      "rating": 5.0,
      "verified": true,
      "author": "MaryBeth C",
      "helpful_votes": 2,
      "publication_date": 20170614
    }
  ],
  "product_meta": {
    "title": "Chaco Women's Zx2 Classic Athletic Sandal",
    "description": "Streamlined and dependable since 1989, our classic series is comprised of only 8 component parts, making for the simple, timeless sandal design that made our name. Every pair comes standard with adjustable double-straps that custom-fits to your foot, a toe-loop for additional forefoot control, plus our podiatrist-certified luvseat™ pu footbed for all-day comfort and support. Now featuring chacogrip™ rubber for our best performing classic outsole to date. Experience our classic sandal like never before.",
    "rating": 4.4,
    "feature_bullets": [
      "Double-strapped polyester jacquard webbing upper wraps around the foot and through the midsole for a customized fit toe loop for secure fit adjustable and durable high-tensile webbing heel risers injection-molded ladder lock buckle",
      "Women's specific LUVSEAT PU midsole vegan-friendly construction",
      "Outer Material: polyester",
      "Sole: Gum Rubber",
      "Closure: Buckle",
      "Heel Type: no-heel",
      "Shoe Width: medium",
      "Non-marking ChacoGrip rubber compound 3mm lug depth"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "12.7 x 12.7 x 1.78 cm; 311.84 Grams",
      "Date First Available": "20 Jan. 2016",
      "Manufacturer": "Chaco",
      "ASIN": "B07XLG1ZVY",
      "Item model number": "ZX3 CLASSIC-W",
      "Department": "Women's"
    },
    "categories": [
      "Sports & Outdoor Sandals",
      "Fashion & Athletic Trainers",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Women's Shoes",
      "Shoes & Bags"
    ],
    "price": 92.99
  }
}