{
  "website_summaries": [
    {
      "verdict": "A refreshing spray that calms irritated skin and is perfect for a light moisturizer in the wintertime.",
      "pros": [
        "Gives skin a nice, dewy look without leaving it shiny or oily",
        "Refreshing, moisturizing spray",
        "Rich in antioxidants to help  calm dry or irritated skin",
        "Suitable for use on sensitive skin"
      ],
      "cons": [
        "Some users have complained that the bottle doesn't last very long"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Spray not as good",
      "text": "I've been using thermal spring water spray as long as I can remember. My usual go to is either Avene or Evian. This product popped up in \"recommended\" feed, so I gave it a try. The spring water itself is fine but the spray mist is not as fine as Avene or Evian. The mist is rather coarse and I didn't like that. I use it after washing my face, but also use it to set my makeup (powder foundation). For that purpose, I want the mist to be very fine. It didn't meet my expectation in that regard. I will go back to my regulars after this one.",
      "rating": 3.0,
      "verified": true,
      "author": "Tellurium",
      "helpful_votes": 24,
      "publication_date": 20180901
    },
    {
      "title": "Gives my skin a boost of moisture!",
      "text": "I have very dry skin, and was looking for something extra beside my daily moisturizer. I spritz this on my face before using my moisturizer and it makes my skin feel and look dewy. I also spritz it on before applying my foundation as well. No more dull and flaky skin for me! I love this stuff! It's the moisture boost my skin needed.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Garrigus",
      "helpful_votes": 34,
      "publication_date": 20160521
    },
    {
      "title": "Amazing and Magical Thermal Spray!",
      "text": "I have very bad eczema on my face. Trying to soothe the painful and uncomfortable redness and itchiness, I spray it on cotton puffs and put it on my face as facial mask for 10-15 min, and it does an amazing job of soothing my skin. Thank you for giving me back the normal and healthy skin!!",
      "rating": 5.0,
      "verified": true,
      "author": "Claire C.",
      "helpful_votes": 19,
      "publication_date": 20170806
    },
    {
      "title": "A must for rosacea skin",
      "text": "I have rosacea and this really calms and sooth my skin, my dermatologist recommend me to use this everyday as much as I want, I've used other brands and this one doesn't dry my skin and you can feel the soothing effect.",
      "rating": 5.0,
      "verified": true,
      "author": "sandra",
      "helpful_votes": 8,
      "publication_date": 20190729
    },
    {
      "title": "Quit misting after 1/4 of can used! Wasted product.",
      "text": "I am a big fan of La Roche-Posay and facial misting water. I purchased 3 large cans, 10.5 ounce and only 1 can continues to mist. The other 2 cans just shoot a stream or drizzle water and the can is still 3/4 full, waste of money as the \"return window\" closed a month after I bought 3 cans (a 3 month supply), so I have no recourse to return or get money back. Lesson learned. Won't purchase again.",
      "rating": 2.0,
      "verified": true,
      "author": "jupiternurse",
      "helpful_votes": 5,
      "publication_date": 20190204
    },
    {
      "title": "It’s water in a can but I love it.",
      "text": "This is just mineral water in an aerosol can. Honestly, though it seems ridiculous, the fine mist really does help hydrate and refresh your skin. Yes it has minerals that purportedly are good for the skin but it’s the fine spray that you can only get with an aerosol that make me love this product. I’ve tried different brands & really don’t notice any difference; I like them all.",
      "rating": 5.0,
      "verified": true,
      "author": "rhhb",
      "helpful_votes": 7,
      "publication_date": 20180516
    },
    {
      "title": "Great product for rosacea!",
      "text": "I have rosacea, therefore I have sensitive skin. This is my 1st time purchasing La Roche-Posay's Thermal Spring Water for Sensitive Skin. When you have rosacea you learn what your triggers are. Heat is one of my triggers. This spray is fabulous! It is a fine mist. A quick couple of spritzes and my skin feels cooler and a lot less irritated. It is now my favorite La Roche-Posay product! I highly recommend anyone with rosacea to give this product a try. Amazon does sell this product at a higher price. It is approximately $2 more on Amazon than it is on the company's website for the same size bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "AZmom",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "love this product",
      "text": "Great product for hydrating dry, itchy and sensitive skin. I usually use this after a shower to rehydrate my skin since I typically shower with warm to hot water, especially during winter months. Price point is very affordable, though I like to compare Amazon's offer with Target's to see who is selling it cheaper at the time of buying. I have purchased this product a handful of times and will continue to buy and use this. Definitely recommend if you feel like you need something like this. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Star Fire",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "I first tried it when I had a terrible skin rash in the summer",
      "text": "Cannot live without this product. I first tried it when I had a terrible skin rash in the summer. Not only was this the only thing to soothe it but have since found that your skin when irritated or regular can be washed with only this to soothe it. Helps with any irritations you may have or after medical treatments as well. Just spray to wet your skin, then blot off.",
      "rating": 5.0,
      "verified": true,
      "author": "Demmy",
      "helpful_votes": 14,
      "publication_date": 20160220
    },
    {
      "title": "Super-hydrating Water Spray!!",
      "text": "I have very sensitive skin that tends to be dry but does not tolerate heavy moisturizers. I use this thermal spring water spray to hydrate my face before using a light moisturizer. It's fantastic! My face feels completely soothed and hydrated as soon as I spray it with the La Roche-Posay Thermal Spring Water for Sensitive Skin. I also use the spray on my hair and body. It feels great!! I love that there is no scent. This water spray is the best I've used and I've tried many. I am finding this brand superior in hydrating my sensitive dry skin. Excellent product and the bottle is big, which justify the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly - New Haven, CT",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Spray doest work",
      "text": "Doesn't work! I've been using La Roche Thermal Water for 5 years and this never happened to me - after few uses, the water leaked and the spray doesn't work!! It was first time I ordered it online here - but never again.",
      "rating": 2.0,
      "verified": true,
      "author": "globalove",
      "helpful_votes": 2,
      "publication_date": 20200511
    },
    {
      "title": "Refreshing Spritz of Thermal Spring Water",
      "text": "I like the refreshing spray of water that feels like a personal mini spa indulgence.Then, back to work. I bought two: one small for my handbag and one for home. If I encounter a colleague having a bad moment or a difficult day, I try to remember to take it out and say \"Now Breathe,\" to lighten the moment. On the practical side, this can be used to set makeup after application so it does not appear too matte. Dewy. Otherwise, this is one of those trifles that separates us from the other animals.",
      "rating": 5.0,
      "verified": true,
      "author": "dianne ",
      "helpful_votes": 4,
      "publication_date": 20181027
    },
    {
      "title": "Many uses for this refreshing spray!",
      "text": "Very refreshing!!! I live in hot, humid southern OK and spend lots of time outdoors with my horses. I'd never make it through summer without this spray!. I use it to freshen my face and neck and found that mixing it with my nightly moisturizer, it made the proper balance of moisture during the summer months. Also, due to humid conditions, this spray is my moisturizer in the morning, anything else is too sweaty.",
      "rating": 5.0,
      "verified": true,
      "author": "AR72704",
      "helpful_votes": 7,
      "publication_date": 20160922
    },
    {
      "title": "I like the fine mist it sprays and the way it ...",
      "text": "My daughter had this product and let me use it. I thought I could get the same results by just keeping a little moisture on my skin after washing my face, but I've gotten spoiled by this product. I like the fine mist it sprays and the way it works with my moisturizer. I was glad to find it available on Amazon since I can't always find it where I live.",
      "rating": 5.0,
      "verified": true,
      "author": "SER",
      "helpful_votes": 9,
      "publication_date": 20160125
    },
    {
      "title": "Waste of money",
      "text": "I have read so many good reviews about this product as I am a big fan of this brand (in love with the Hydraphase moisturizer) so I decided to purchase+ this thermal water. I am using this spray already 2 weeks and I haven't noticed anything good in it, it's just a regular water nothing more, it doesn't even hydrate my skin. DO not recommend it, do not waste your money just buy a spray bottle and use a regular water to hydrate your skin during the day. :)",
      "rating": 1.0,
      "verified": true,
      "author": "Inga",
      "helpful_votes": 2,
      "publication_date": 20180913
    },
    {
      "title": "Atomizer defective",
      "text": "I ordered two. One was banged up in the delivery. I tried to replace it but the option wasn’t available on Amazon. The atomizer stopped working half-way through the bottle and now I have to throw it away while still half-full. This is ridiculous. Half of a nice product (and it isn’t cheap) has to go to waste because the atomizer isn’t working any more. Ridiculous. Amazon should replace this for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Best for Sensitive Skin",
      "text": "Makes my skin happy. I have Rosacea and serrobic dermatitis. Cant treat one without making the other one angry. I use this in place of a toner and before i put on my azelaic gel. Makes the gel last longer too. And no flare ups. I also use it when my skin is dry mid day or for a little pick me up. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Clare",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Refreshing fine mist",
      "text": "Although it’s definitely over-priced, I just love the feel of the mist that sprays out of this can. I always wake up in the morning with dry eyes and sinuses; I spray a cloud of this in my face and feel so much better. I also spray it on top of my makeup to set it. It sprays evenly and leaves no little droplets like other makeup setting sprays I’ve used.",
      "rating": 5.0,
      "verified": true,
      "author": "Abi",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "best product ever",
      "text": "hidrates my skin so nicely give me that glow as i have a dry skin. check this link and buy dont waste time.",
      "rating": 5.0,
      "verified": true,
      "author": "NILZETE OLIVEIRA FINAMORE",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "After using this spray, an allergic rash, redness and burning appear on my face",
      "text": "After using this spray, an allergic rash, redness and burning appear on my face",
      "rating": 1.0,
      "verified": true,
      "author": "Edyta",
      "helpful_votes": 3,
      "publication_date": 20190220
    },
    {
      "title": "Easy to Spray",
      "text": "Thermal water is very soothing to the face. The nozzle is very easy to use so that the mist comes out evenly. I've used Avene previously which is very similiar to the La Roche Posay but this bottle has an easier application.",
      "rating": 5.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 8,
      "publication_date": 20160215
    },
    {
      "title": "but i love it! so refreshing",
      "text": "first time trying a thermal water spray, so i don't have anything to compare it too, but i love it! so refreshing, very light scent (smells nice), and i thought it would just refresh my skin in the moment, but then i felt it later and it felt velvety. so i guess it really does something! def plan on buying again.",
      "rating": 5.0,
      "verified": true,
      "author": "Land Atoo",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "So much more than just water-in-a-can",
      "text": "This soothes and rehydrates better than plain water (no idea why) and keeping my skin moist while I go through my routine actually makes the products work better!",
      "rating": 5.0,
      "verified": true,
      "author": "BrandNewReviews",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Love this!!!",
      "text": "I love this spring water so so much. You can spray it on your skin anytime without any irritation at all!! I definitely will buy it again. Highly recommend it for everyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Tam Nguyen",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Heaven in a bottle!",
      "text": "This stuff feels great! So cooling on my face! I'm wondering how much is \"enough\" to spray because I'm sure I'm spraying way more than I need just because it feels wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Lawson",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "If my skin feels super dry and irritated",
      "text": "I cannot live without this all year long! I have sensitive skin and I use it everyday after washing my face and before toner. It helps to calm my skin down and keeps any irritation/inflammation at bay. If my skin feels super dry and irritated, I would use a paper mask (like those muji compressed ones) and soak it with this water, and put the mask on my face for like 5-8 minutes. Sometimes I would use the mask method everyday for 5 days and it just really helps with any kind of skin conditions I have.",
      "rating": 5.0,
      "verified": true,
      "author": "Wenyu Wu",
      "helpful_votes": 2,
      "publication_date": 20171127
    },
    {
      "title": "Saved my skin",
      "text": "I’ve been using this on my face to calm down my skin after having histamine related reactions. Works wonderfully for cooling the face and adding some moisture to dehydrated skin.",
      "rating": 5.0,
      "verified": true,
      "author": "emjaygee",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Love it!",
      "text": "I use this every day after cleaning my face and before moisturizing and it makes the cream go on very smoothly. The bottle is large and will last a long time!",
      "rating": 5.0,
      "verified": true,
      "author": "Jean Pulley",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Fabulous!",
      "text": "Absolutely love this fine cooling mist on the face. I realize you can use tap water, but that runs the risk of spoiling! I would highly recommend this for anyone with dry, sensitive, redness, or flushed skin!",
      "rating": 5.0,
      "verified": true,
      "author": "Nurseandmommy",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "always have one with me",
      "text": "La Roche-Posay or Avene spray, Always have one with me. It can control my skin allergic reaction during the sensitive season. A large bottle can last for 1 month when used in the morning and evening.",
      "rating": 5.0,
      "verified": true,
      "author": "elaine～",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Perfect FOR ME and my use of it.",
      "text": "I use this like it is a setting spray. The fine mist is perfect for helping the powder look more natural. I do go in with a quick spritz of something to help lock everything in. Before finding this I had to spray multiple times to help everything mesh. This is a much better option FOR ME.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Easy to use and scent free",
      "text": "Easy to use and scent free. Works great as a base to help my moisturizer products go farther with less.",
      "rating": 4.0,
      "verified": true,
      "author": "NE Shopper",
      "helpful_votes": 2,
      "publication_date": 20171215
    },
    {
      "title": "I love the refreshing feeling",
      "text": "I always carry this with me to hydrate my face and neck, specially after a sunny day. I love the refreshing feeling.",
      "rating": 5.0,
      "verified": true,
      "author": "Baker",
      "helpful_votes": 4,
      "publication_date": 20160827
    },
    {
      "title": "I have sensitive skin that turns red at the slightest ...",
      "text": "I have sensitive skin that turns red at the slightest irritation or temperature above 75 degrees. I don't know how this works since it's basically just water, but I carry a travel size of this in my purse and I give my face a few spritzes after hot yoga and it calms down my redness quicker than if I just splash cold tap water on my face.",
      "rating": 4.0,
      "verified": true,
      "author": "Meredith V",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "It's been working great. I use it while I am in the ...",
      "text": "It's been working great. I use it while I am in the office during the days my face gets oily.",
      "rating": 5.0,
      "verified": true,
      "author": "G.Y.",
      "helpful_votes": 4,
      "publication_date": 20170125
    },
    {
      "title": "Great for hot flashes and workingout",
      "text": "Love this for hot flashes and for working out. My face gets very flushed in both situations. This works great to cool my face down without removing my make-up or making it run. I will continue to buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Penhall",
      "helpful_votes": 2,
      "publication_date": 20180305
    },
    {
      "title": "Destroyed in transit",
      "text": "Love this product but very disappointed to have received it damaged and not working (top won’t spray when pressed down) after spending $18 and It doesn’t give me the option to replace or cancel the order",
      "rating": 1.0,
      "verified": true,
      "author": "Tyler Shoulders",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "MMMMM",
      "text": "so refreshing especially on a hot day. I like to use after i take my make up off or after a mask treatment",
      "rating": 5.0,
      "verified": true,
      "author": "QueenKristine",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "Good hydration boost.",
      "text": "So far I've been able to see an improvement in my skin's hydration level using it just prior to moisturizer. I have dry skin, and it does make a difference from moisturizer alone.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161103
    },
    {
      "title": "You need this if you live in the desert!",
      "text": "Large odorless and refreshing great for summer heat to keep you Dewey, hydrated and moisturized. Looking forward to using it when I go outside.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Nice quick spritz of facial spray. It does not have a scent which I appreciate.",
      "text": "I love these waters. Great for my dry skin. Problem can be the top clogging up if damaged in delivery. This can be a problem with anything from Amazon and it did happen with one of my cans.",
      "rating": 5.0,
      "verified": true,
      "author": "LS",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Calms skin but mist spray isn't fine enough",
      "text": "It calms skin irritation and lightly refreshes instantly. but it doesn't provide hydration or moisture in long run. it's not a sub of softener or toner, so i don't think it's price friendly at some points. Also at this price point, I wish the mist spray can be better, it isn't fine enough compares to the Avene's bottle.",
      "rating": 3.0,
      "verified": true,
      "author": "lkc216",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Refreshing!",
      "text": "Love this spray especially in the Fall and Winter. Has helped decrease the dryness on my skin. I use a serum then this spray, followed by my moisture cream.",
      "rating": 5.0,
      "verified": true,
      "author": "H.P.J",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "really like it",
      "text": "I really like it. it was great to use midday when my face felt dry. But FYI-bottle is really big so not best size for carrying around",
      "rating": 5.0,
      "verified": true,
      "author": "pallepalle",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "This has a fine mist and instantly helps me feel refreshed",
      "text": "This has a fine mist and instantly helps me feel refreshed. I like that it has a balanced pH. I use this morning and night before I put my lotion on to seal in as much moisture as I can.",
      "rating": 5.0,
      "verified": true,
      "author": "Beccreative",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "I love this, it always makes me feel refreshed anytime ...",
      "text": "I love this, it always makes me feel refreshed anytime of the day. I spray it on my face every morning when I wake up and I use it while putting on makeup. My face tends to be dry and this product makes it feel better.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana B",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "My sensitive skin reacted to this product.",
      "text": "This doesn’t spray in a fine mist, like other thermal water I’ve tried. I also don’t believe it is suitable for sensitive skin. Within a few minutes of applying, my skin was bright red and within an hour, I had two sizable bumps—one above my eyebrow and one under my mouth.",
      "rating": 2.0,
      "verified": true,
      "author": "Jennie C.",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "like other reviewers have commented",
      "text": "I have no idea if this product actually works or not (I can't tell a difference) but, like other reviewers have commented, it arrived dented and seemingly only half full (or maybe even less than half).",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20170401
    },
    {
      "title": "Great water spray.",
      "text": "I have several water sprays for my face. This one is great. I keep one of any brand with me at all times. It refreshes, moisturizes and plumps my skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Apl",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Just like water",
      "text": "I bought this mist spray for calming down my sensitive skin. But it just like water. It doesn’t help with redness on the face and to calm down the skin.",
      "rating": 3.0,
      "verified": true,
      "author": "Chloe",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "It feels great on my face",
      "text": "It feels great on my face. However, it feels like someone has used it already as it feels a bit empty. I still give 5 star for its cheap price during discount.",
      "rating": 5.0,
      "verified": true,
      "author": "Kiki",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Ilikeit",
      "text": "Very hydrating and moisturizing, it is recommended to buy a few more bottles when discounted",
      "rating": 5.0,
      "verified": true,
      "author": "lorraine",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Love it",
      "text": "So far so good, Very Happy with this good product",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Perfect",
      "text": "Will buy it again and I just want to say it’s great. Feel so comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "5 stars",
      "text": "Its the same product as I saw in the market. And it’s very comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Cooling",
      "text": "So cooling and refreshing! After surgery a wonderful way to deal with feverish face.",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Works well",
      "text": "Feels really refreshing on the skin, really good product for hidratación and refreshing",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Not what I paid for",
      "text": "DO NOT BUY!! Bottle was half empty when it was delivered and each time I used it, I got a new pimple. I am not kidding, I have used this product four times since I purchased it and I have four pimples. On top of that, I can’t even return it and get my money back.",
      "rating": 1.0,
      "verified": true,
      "author": "Sams Angel",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Just like the spray!",
      "text": "It was really cheap. I just like the spray.(Actually I do not know whether it has any effects hhh)",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Best facial mist",
      "text": "Been using lots of facial sprays. Found out that this one is the best one and makes my face feel so fresh and relaxing",
      "rating": 5.0,
      "verified": true,
      "author": "Jessi",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "I got a used one, very disappointed",
      "text": "This product has been used before it came to my hand. What makes me angry is that I can't return it, even there is only half bottle left for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Huilin Yang",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Love la Roche posay",
      "text": "Entire product line of la Roche posay is amazing! Thermal spring water hydrates as well as sets my makeup.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Travel size",
      "text": "Super bummed that this is a travel size. For the price I paid it should be a normal size I would have thought.",
      "rating": 2.0,
      "verified": true,
      "author": "Miss Thorne",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Makes your skin like a sponge to absorb moisturizers.",
      "text": "I use this first thing in the morning to wake my skin up and then apply moisturizer.",
      "rating": 5.0,
      "verified": true,
      "author": "J. M. Boudreau",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "Amazing product",
      "text": "I used La Roche Posay for years, but mostly their sun block products, because I have \"sun sensative\" skin and couldn't be outside without it. I started using their skin care line and it works really well too, but this product just amazed me. After 7 days of use, my redness went way down, my pores are smaller and wrinkles are disappering. Way. Remember, you have to keep this water in refrigerator.",
      "rating": 5.0,
      "verified": true,
      "author": "irwat",
      "helpful_votes": 3,
      "publication_date": 20120312
    },
    {
      "title": "Great purchase!",
      "text": "Love how light the mist goes on. Feels very refreshing. Appears to have made my skin more dewy and less susceptible to dryness. Keeps my makeup from drying out. Would love to purchase this again in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Lia",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Nice price when I bought it",
      "text": "I bought this at great price. No complain at all. Love it. Hopefully the price will drop, I will buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Yilin W.",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Good for skencare",
      "text": "I use it almost every day, it does well in moisture for your skin, and that is about it, so if you need to wear make up, it would be a good choice beforehand. The spray sometimes gets a little stucky, you have to press really hard.",
      "rating": 4.0,
      "verified": true,
      "author": "wenping cheng",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Spray",
      "text": "Very hydrating! I absolutely love this when I need a little moisture and it doesn’t irritate my skin!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberley Saunders",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Moist skin easily",
      "text": "Love it! No scent, very moisturizing, and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Good product and very convenient!",
      "text": "I like this spring water which is very good to use and don't need cotton pad. Keep skin moisture! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Life",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Amazing!",
      "text": "Perfect and mold caring for the sensitive skin! So good!",
      "rating": 5.0,
      "verified": true,
      "author": "Jingbo.Qi",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Love it !",
      "text": "I don't know if it works or not , but I just really like how gently it sprays water😊 use it always before moisturizer or serum",
      "rating": 5.0,
      "verified": true,
      "author": "Irina",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Sent me a used can?",
      "text": "No security seal and the can is half empty. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Not good!",
      "text": "The can came in beat up with dents and scratches everywhere and dirty, not even sure it's new. When sprays, dops of water spills. For the price paid($13), not worth it!",
      "rating": 2.0,
      "verified": true,
      "author": "Smart shopper AL",
      "helpful_votes": 0,
      "publication_date": 20160129
    },
    {
      "title": "Not moisture at all",
      "text": "Not recommended for dry sensitive skin... once you apply to your face that you have to gentle hit your face, otherwise it will moisture off you face...",
      "rating": 3.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "False advertising",
      "text": "This product is advertised as 10.5 ounces, which is the amount listed previously on the product can I have received. However the amount listed on the cans is 10.1 ounces, for the same price. If La Roches-Posey has changed its container size, it should be so noted.",
      "rating": 2.0,
      "verified": true,
      "author": "Barbara Francisco",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "very good",
      "text": "I have used it for a long time.Put it in the refrigerator in the summer,After chilling, take it out,I feel very cool",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Perfect for sensitive skin",
      "text": "I have sensitive skin and I wanted to add an extra layer to my routine. It makes skin feel and look less irritated. Will buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Natasha",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Best thermal water",
      "text": "I’ve tried lots of thermal water and this one has been my favorite so far. It’s really cheap if you compare to the quality of the product. I use everyday after showering and I also use it on my hair!",
      "rating": 5.0,
      "verified": true,
      "author": "Julia Lourencao",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Blast of Wonderful on your Face",
      "text": "This a blast of wonderful on your face. I love it! It feels great, excites my face. I use a few times a day for a invigorating wake up.",
      "rating": 5.0,
      "verified": true,
      "author": "GERAX",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "bad packaging",
      "text": "The product is fine. Bought two as gifts. They were so poorly/carelessly packed with NO protection that the containers banged together and were so ugly looking I didn't gift them.",
      "rating": 3.0,
      "verified": true,
      "author": "redryder",
      "helpful_votes": 0,
      "publication_date": 20160215
    },
    {
      "title": "Do not waste your money",
      "text": "Do Not Buy!!!!!!! If i could give it zero stars i would!!!!!!!! Bottle feels less than half full and no seal on it- not using it- And can’t return, wasted money this product should either be pulled or do some quality control!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Lavonne R",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "it felt like it wasn't full",
      "text": "I actually don't have a problem with La Roche-Posay; my problem was with the bottle I received as it seems to have been half used. Since I received the bottle and shook it, it felt like it wasn't full, but it is difficult to open, so I just started to using it even if I knew this wasn't a new product. It lasted ONLY 3 weeks (Using it only in the mornings) which feels totally deceiving because I have bought the same bottle before (In France), and it usually last between 2 to 3 months! I feel like I have been robbed!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20160324
    },
    {
      "title": "I love this spray",
      "text": "I love this spray! I use it before applying my BB cream and it goes on so smoothly. I also use it before applying my night cream. It is very soothing and causes no irritation. I am addicted!",
      "rating": 5.0,
      "verified": true,
      "author": "julie c bresette",
      "helpful_votes": 2,
      "publication_date": 20160221
    },
    {
      "title": "I will buy again!",
      "text": "I have ridiculously sensitive skin and this product is amazing. Will buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Moirraine Porter",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Does work for my needs",
      "text": "Had tried before, wonderful daily skin spray for face and neck for Arizona weather conditions",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "damaged product",
      "text": "the bottle has been scratched an damaged, the area around the cap is very dirty, It have small black dirt like object.",
      "rating": 1.0,
      "verified": true,
      "author": "Haoyou",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Great Product",
      "text": "I really like the spring water and use it in the morning before make up etc. I am definitely going to try more of their products. Good value for an exceptional product",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Great product",
      "text": "I’ve been using this product for 4 months . This is a fantastic fine mist for my skin. I can’t live without this . The moisturizing effect is very good . High recommended !",
      "rating": 5.0,
      "verified": true,
      "author": "shirley",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Check before use",
      "text": "My skin is sensitive so I bought this, but I got allergy on my skin where I use this product. I personally not recommend this product for someone who have sensitive skins.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "It's just water? Used the entire can and didn't ...",
      "text": "It's just water? Used the entire can and didn't feel any difference. I don't think this is necessary for my skin.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170601
    },
    {
      "title": "Good to have it",
      "text": "Smooth my face and I sometimes use it as toner",
      "rating": 4.0,
      "verified": true,
      "author": "dreamung",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Thirsty skin? DRINK IT UP",
      "text": "Just off of the first use your skin will be feel so good. The mist is very fine and light!",
      "rating": 5.0,
      "verified": true,
      "author": "mZED",
      "helpful_votes": 0,
      "publication_date": 20160831
    },
    {
      "title": "A lifesaver for sensitive skin",
      "text": "The fine cool mist feels like heaven on reactive skin!",
      "rating": 5.0,
      "verified": true,
      "author": "H Nelson",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Refreshing and moisturizing",
      "text": "I really like the way this spray feels on my skin. It's perfect for cooling off on a hot day.",
      "rating": 5.0,
      "verified": true,
      "author": "Renay all day er day",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "Locks in Moisture!",
      "text": "As someone who suffers from dry skin, this is a lifesaver! Spray it on your skin to lock in moisture or to give you a pick-me-up!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Sprayer stopped working",
      "text": "Good product, that I really enjoyed using. However, the sprayer stopped working white the bottle was almost full, leaving me with an almost new product that I can't even use.",
      "rating": 3.0,
      "verified": true,
      "author": "Svitlana Borysevych",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Good product but won't buy from here again",
      "text": "The product is good for sensitive skin and does a really good job. But the product I received seems to be used one and only has half of the liquid inside.",
      "rating": 2.0,
      "verified": true,
      "author": "Athena",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Waste of money",
      "text": "The spray itself is great but it only last 2 weeks the cam started leaking and no longer works",
      "rating": 2.0,
      "verified": true,
      "author": "Shay",
      "helpful_votes": 0,
      "publication_date": 20200603
    }
  ],
  "product_meta": {
    "title": "La Roche-Posay Thermal Spring Water for Sensitive Skin",
    "description": "Size:10.5 Fl Oz\n\nAmazon is an authorized retailer of La Roche-Posay products.\n\nLa Roche-Posay Thermal Spring Water Soothing Face Mist Spray with Antioxidants is essential for soothing face and body for sensitive skin. This water mist spray helps refresh and tone the skin. Thermal Spring Water is at the heart of most La Roche-Posay products. Its unique combination of mineral salts and trace elements has been scientifically demonstrated for its soothing properties and used in Europe for centuries at the center of Thermal Dermatology in the town of La Roche-Posay. Naturally contains a high concentration of Selenium, a powerful natural antioxidant and mineral-rich micro-droplets, which provides immediate, intense soothing. This facial mist spray is:\n\n * Oil-free\n * Fragrance-free\n * Paraben-free\n * Additive-free\n\nFace mist spray can be used as the last step in cleansing or first step in caring to tone and refresh skin. After a mild cleansing, spray 8 to 12 inches from face then leave on 2-3 minutes. Gently pat off excess spray without rubbing. Use as often as desired, at home, at the office, or on the go. Ingredients: Aqua/Water.\n\nProduct packaging may vary.\n\n\n\nBRAND STORY\nRecommended by 90,000 dermatologists worldwide, La Roche-Posay offers unique daily skincare developed using a strict formulation charter and stringent clinical testing for efficacy and safety, even on sensitive skin.",
    "rating": 4.6,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "2.25 x 2.25 x 10 inches; 12.8 Ounces",
      "Item model number": "LAR0100067",
      "Department": "Skin Care",
      "UPC": "885325289459 885136975084",
      "Manufacturer": "La Roche-Posay",
      "ASIN": "B000V3O732",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item is not eligible for international shipping.",
      "Amazon Best Sellers Rank": "#4,507 in Beauty & Personal Care",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Face",
      "Cleansers",
      "Beauty & Personal Care"
    ],
    "price": 18.0
  }
}