{
  "website_summaries": [
    {
      "verdict": "If you are looking for an economy stand for a small, artificial tree, this is it.",
      "pros": [
        "A great fit for smaller, artificial trees as it is a nice for those less than 3 inches in diameter"
      ],
      "cons": [
        "Will not be able to handle larger trees - or real ones"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Stand for Small/Tabletop Trees!",
      "text": "We used this for a 3-4' tree this past Christmas, and it's a perfect stand with a nice, deep well so you don't have to water constantly (and it doesn't spill easily). I had the hardest time finding a stand for a small (but not tiny) tree, but we hit the jackpot with this guy. The screws are easy to use, and screw easily, and since you're dealing with a small tree, it's not nearly the ordeal that putting big trees in a stand is. As long as we're in our little apartment and buying more diminutive Christmas trees, this guy will serve us well. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "pensivefix",
      "helpful_votes": 14,
      "publication_date": 20170508
    },
    {
      "title": "Perfect for a tabletop tree",
      "text": "Absolutely PERFECT for my 3 foot tabletop tree. It's small enough for a small table yet sturdy and holds plenty of water. Honestly I'm impressed at the quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Book Lover",
      "helpful_votes": 15,
      "publication_date": 20161217
    },
    {
      "title": "Sent different item then advertised",
      "text": "I made my purchase with the belief I was purchasing what was being advertised. Apparently I was wrong for thinking that. I was sent a different item. The stand advertised says it’s for 5ft. I was sent one for 4ft and a different label",
      "rating": 1.0,
      "verified": true,
      "author": "rob brown",
      "helpful_votes": 5,
      "publication_date": 20181127
    },
    {
      "title": "Tree stand is unstable",
      "text": "I put my tree up last night. The tree had a 1-2 inch trunk. I decorated the tree, took me two hours. I got up this morning and my tree fell to the floor and my christmas decorations smashed and flew across my hardwood flooring. Isn’t your product tested to hold a tree up? I am not happy! Please refund me for this tree stand, and while you are at it, please send new pearl white and gold Christmas bulbs! Merry Christmas!",
      "rating": 1.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 2,
      "publication_date": 20181202
    },
    {
      "title": "Great Xmas Tree Stand",
      "text": "Received this item in two days even though it wasn't Prime. Nice solid base for a small to medium tree with hefty plastic screws to hold the tree in place. Exactly what I wanted!",
      "rating": 5.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 5,
      "publication_date": 20171208
    },
    {
      "title": "Stressful.",
      "text": "Plastic. Plastic screws. Doesn’t hold much weight before tipping. You would need a small tree and hope the plastic screws go in all of the way to the slim stump. Only 3 screws so tree base kept slipping out and falling over. Needs 4 screws.. I guess for the price, you get what you pay for. (Why are Christmas tree bases so darn expensive?!)",
      "rating": 2.0,
      "verified": true,
      "author": "Luke and Jess",
      "helpful_votes": 2,
      "publication_date": 20190105
    },
    {
      "title": "Sturdy",
      "text": "Sturdy and does the job well! When I first got the box it was light and I was skeptical but it's very well made. Watch your fingers when you screw in the bolts, I did pinch myself. We have probably a 3' tree in it and it can very easily handle it. I push it across the floor when I vacuum and it's never once felt unsteady. My 4 year old constantly plays with the tree too and it never had an issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Bella",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Not stable",
      "text": "Not stable. Perhaps my tree was too tall - -a 5 foot noble fir, very slender. There was no way it was going to h old my tree without tipping over. Most likely my mistake. I went back to the old standard metal stand with four extended legs for stability.",
      "rating": 1.0,
      "verified": true,
      "author": "Judith Gillham",
      "helpful_votes": 2,
      "publication_date": 20171212
    },
    {
      "title": "Not made for artificial trees",
      "text": "Definitely not made for artificial trees! But if you have a real tree, it’s super easy to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Great tree stand for smaller trees",
      "text": "Perfect for a tabletop tree. The plastic pegs that sturdy the tree are really easy to screw in and it’s practically impossible for the tree to end up crooked.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn Q",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "is just right for our tree",
      "text": "We have a live tree and the stand is the perfect size . We couldn't be more pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Perfect",
      "text": "I've got a toddler and as you can imagine, it's tricky to have a tree when your kid wants to climb and conquer everything! I decided to do a small table top tree this year and needed a new stand to hold a small tree. This is perfect! The price is great too. So glad I found this, or we would be tree less this year!",
      "rating": 5.0,
      "verified": true,
      "author": "Annie Leitzinger",
      "helpful_votes": 0,
      "publication_date": 20161125
    },
    {
      "title": "Wrong stand was sent",
      "text": "I like it but the advertisement says the stand is suitable for a 5 foot tree and the one sent to me says 4 feet.",
      "rating": 1.0,
      "verified": true,
      "author": "Vchiz",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Great for trees with 3/4inch bases and up!",
      "text": "I bought this for my 4-foot artificial tree with a 3/4inch base. It works great. The bolts store securely in the base and twist in easily. I didn't put anything in it for weight, but pebbles, kitty litter, or sand would work well. My Xmas bush is stable and happy.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Bucy",
      "helpful_votes": 0,
      "publication_date": 20161208
    },
    {
      "title": "Perfect stand for table top trees",
      "text": "This is the second year I have used my stand and it is holding up well. I need a small tree due to limited space and this is the only stand I have found that fits a small tree and holds it securely. It is easy to assemble and fit the tree into. It also looks appropriate. A small tree looks ridiculous in a huge stand. You can't beat the price. I highly recommend this stand.",
      "rating": 5.0,
      "verified": true,
      "author": "Bevsb",
      "helpful_votes": 6,
      "publication_date": 20111214
    },
    {
      "title": "Great buy...",
      "text": "I love this table top tree stand, I was a little worried cuz, it had shown plastic screws that goes in tree.. I must say This product is great quality at a great price... what more could you ask for ! And I actually managed to do it all by myself.. I would recommend this tree stand.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela McGeathy",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "Perfect for 4ft Real Tree!",
      "text": "So pleased with this purchase! This was perfect for our 4ft real Christmas tree! We wanted a tabletop tree so the babies and dog would leave it alone. This stand worked perfectly for a 4ft tree. It was easy to add water and holds plenty for. Smaller tree. Love this! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Zigler",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Smaller than I thought",
      "text": "Should be fine for small trees. I returned as they were too small for what I need.",
      "rating": 3.0,
      "verified": true,
      "author": "joel",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Works just perfectly.",
      "text": "It's so easy to mount your tree in there and it keeps the water very well.",
      "rating": 5.0,
      "verified": true,
      "author": "susikx",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "lGood quality and nothing to rust",
      "text": "Used this container for our 5ft. live tree on our patio. Holds a good amount of water. Nothing to rust. We will use it for many years.",
      "rating": 5.0,
      "verified": true,
      "author": "shadepalm",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "The lugs in this stand are plastic and bend when ...",
      "text": "The lugs in this stand are plastic and bend when toughing the wood. It will not hold up a small tree.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim Clemmer",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Bad treestand",
      "text": "Worst Christmas tree stand ever the base was flimsy plastic do not waste ur money",
      "rating": 2.0,
      "verified": true,
      "author": "Naomi Blevin",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Held my tree up",
      "text": "Had a 3ft tree in this on top of a table and it was very sturdy and balanced.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Rakus",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Perfect of our tiny tree!",
      "text": "Our tiny Christmas tree fit perfectly into this holder! We had a vintage bucket that was smaller than all the regular Christmas tree stands so this worked just as we had hoped! LOVE IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy Gibson",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Very good stand and it fits our 5 foot tree perfect ...",
      "text": "Very good stand and it fits our 5 foot tree perfect and secure. It was very easy to set it up. Will recommend for anybody who needs small tree stand.",
      "rating": 5.0,
      "verified": true,
      "author": "scyth",
      "helpful_votes": 2,
      "publication_date": 20160102
    },
    {
      "title": "Only for very small trees!",
      "text": "Easy enough to use and durable but not very sturdy. Our tree (maybe 5 feet tall, relatively sparse branches, not a huge amount of decorations) tipped over about 10 min after decorating — disaster — water, pine needles, and broken ornaments everywhere!!",
      "rating": 2.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "buy it.",
      "text": "Absolutely one of the best holders I have had. Has room for plenty of water, a spike in the middle to tack the tree, and is as big as a large dog dish. It is also made in the USA.",
      "rating": 5.0,
      "verified": true,
      "author": "Pax",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "Great Christmas tree stand!",
      "text": "Great Christmas tree stand! very easy to use, no leaking, and nice large area for watering. I’ll be using this for years to come!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "pretty easy to assemble",
      "text": "Works as described; pretty easy to assemble. Overall very satisfied. The only reason I didn't give it 5 stars, is because 5 stars says \"I love it!\", and it's hard to say I Love It, to a Xmas tree stand.....",
      "rating": 4.0,
      "verified": true,
      "author": "S. Daugherty",
      "helpful_votes": 0,
      "publication_date": 20170305
    },
    {
      "title": "Turns regular size artificial tree into an end table mini-tree!",
      "text": "I have a regular size artificial tree, which comes in two parts (small top, large bottom). With this stand, I can turn the top piece into an end table mini-tree, which works great for our current living conditions.",
      "rating": 5.0,
      "verified": true,
      "author": "Jar Jar B.",
      "helpful_votes": 0,
      "publication_date": 20151011
    },
    {
      "title": "It works",
      "text": "It's all plastic but it is holding the tree fine so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "This is only good for a SMALL tree, even if your midsize tree is narrow with a small trunk.",
      "text": "My tree is 5' but with a trunk just under 3\" so I thought this might work. It's way to light for even such a skinny tree and tips over. It might work for a smaller tree but the stand itself is bulkier than anything I would want to put on a tabletop.",
      "rating": 3.0,
      "verified": true,
      "author": "KA",
      "helpful_votes": 0,
      "publication_date": 20151215
    },
    {
      "title": "Good product",
      "text": "I use it to hold my antenna pole. Works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Darrell L. Maddox",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Would not recommend.",
      "text": "Did not work well with our small real tree. It need 4 clamps to hold the trunk not the three provided. Would not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "Ricardo",
      "helpful_votes": 3,
      "publication_date": 20141214
    },
    {
      "title": "Great",
      "text": "Perfect for our 4 ft tree! Easy to use and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "DBAmazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Good mini tree stand.",
      "text": "These are slightly larger than I expected, but I believe they are still the smallest ones a person can find. Good enough for my purposes, and just fine with a tree skirt.",
      "rating": 4.0,
      "verified": true,
      "author": "21pigs",
      "helpful_votes": 0,
      "publication_date": 20150305
    },
    {
      "title": "Perfect for a small tree",
      "text": "This is perfect for my 3 foot tree on my side table. Very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Perfect for a small tree",
      "text": "This year I decided to use my small tree, but lost the stand. This stand works perfectly. It looks wide enough to hold a larger tree, although not sure how strong it would be. I'm happy with the price and purchase. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "ND from NY",
      "helpful_votes": 0,
      "publication_date": 20121212
    },
    {
      "title": "Horrible",
      "text": "Horrible product ! It could not hold up my tree straight. The screws don’t go in all the way. It also should have four screws !",
      "rating": 1.0,
      "verified": true,
      "author": "DAZIEL O GARCIA",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Measure the circumference of your tree!",
      "text": "A little tree and it worked well would be better if screws were a little linger",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley ",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Easy to use",
      "text": "We used it for centerpieces at a wedding to hold branches it worked great",
      "rating": 5.0,
      "verified": true,
      "author": "Traci Ruggieri",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Perfect for my tabletop tree.",
      "text": "Perfect for my tabletop tree. Was very sturdy and the simple design made it easy to get the tree set up.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Perfect just what we needed!",
      "text": "This tree stand worked great for our little Christmas tree this year very sturdy and is well made very heavy duty plastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20150124
    },
    {
      "title": "Tabletop Christmas Tree Stand",
      "text": "I needed a very small tree holder but all the stores were out of them so I went online and found this little gem. It easily held a bushy 3' tree and the heavy duty plastic screws snap right inside the stand when not in use. The best part is the tree stand was made in the USA!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Ranger Bob",
      "helpful_votes": 2,
      "publication_date": 20130109
    },
    {
      "title": "Great product!",
      "text": "Super easy to use, very sturdy, perfect for tabletop tree.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia F.",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Does the job",
      "text": "Does the job & the large water well keeps the tree fresh. Much easier to handle than stands I've had in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "clonsheefior",
      "helpful_votes": 0,
      "publication_date": 20140422
    },
    {
      "title": "Easy to use",
      "text": "This little tree holder did the job for the small table top trees that I get at Christmas. It is easy to use and big enough for lots of water so you don't have to fill it often.",
      "rating": 5.0,
      "verified": true,
      "author": "Betty Kidd",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Easy to use!",
      "text": "Finally -- a tree stand that was easy to use for a 5' tree. It took under 10 minutes to set the tree up in it and it remained stable.",
      "rating": 5.0,
      "verified": true,
      "author": "SandraJ",
      "helpful_votes": 0,
      "publication_date": 20130109
    },
    {
      "title": "Returned item",
      "text": "Nice but screws slid past tree trunk & it leaned to side- returned item",
      "rating": 5.0,
      "verified": true,
      "author": "ann schweinsberg",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "tree this year and I wanted a simple and sturdy stand. This one is super stable",
      "text": "This store is the most responsive I've dealt with in a long time. The product exceeds my expectations. We downsized to a 4ft. tree this year and I wanted a simple and sturdy stand. This one is super stable, easy to use and holds plenty of water in case we forget. I hope we have a chance to work with GATZIES again. They are amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen",
      "helpful_votes": 0,
      "publication_date": 20141214
    },
    {
      "title": "Five Stars",
      "text": "Works GREAT with small trees! Our tree is real & about 4 feet tall. Very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "liam coleman",
      "helpful_votes": 3,
      "publication_date": 20161209
    },
    {
      "title": "Does What It's Supposed to Do",
      "text": "Five stars because did exactly what we needed it to: hold our Charlie Brown Christmas tree upright on the coffee table top, while giving it a drink of water.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "This Tabletop Christmas Tree stand is used for a Broadcast TV antenna mount.",
      "text": "This tree stand is used for an indoor broadcast TV antenna stand. The antenna mount to a 12 inch long, 1\" dia. end of a flag pole cut off. The wooden pole bottom sits in the tabletop tree holder by drilling a hole in the end of the pole for the spike in the bottom of the tree holder. Three small holes are drilled in the sides of the wood pole to keep tree base mount screws from sliding off the pole. The tree mount and antenna assembly sit on the top of my 6 foot tall entertainment center. The antenna weighs less than 2 pounds. The antenna is directional and rotates with a remote control.",
      "rating": 4.0,
      "verified": true,
      "author": "Curtis Cee",
      "helpful_votes": 0,
      "publication_date": 20150831
    },
    {
      "title": "Not stable at all.",
      "text": "The tree fell over— twice. My toddler was horrified. I’m still traumatized.",
      "rating": 1.0,
      "verified": true,
      "author": "Loves to Read",
      "helpful_votes": 5,
      "publication_date": 20171217
    },
    {
      "title": "sturdy stand for a small christmas tree",
      "text": "great heavy plastic stand does well on a table or on the floor the plastic screws are heavy enough to hold the tree in place even after 2 weeks after the trunk begins to shrink",
      "rating": 5.0,
      "verified": true,
      "author": "linda eve",
      "helpful_votes": 0,
      "publication_date": 20140402
    },
    {
      "title": "Love it",
      "text": "Bought this for a 3-4 ft tree. Well-made, easy to use, and attractive. The little tree details are cute, and the basin holds plenty of water for at least 3 days before needing to be topped-off.",
      "rating": 5.0,
      "verified": true,
      "author": "Kari Sandell",
      "helpful_votes": 0,
      "publication_date": 20121202
    },
    {
      "title": "Worked perfectly",
      "text": "I used it for my 4.5 foot table tree and it took all of 5 minutes to set up. The tree was very stable and the stand held the right amount of water.",
      "rating": 5.0,
      "verified": true,
      "author": "Meg",
      "helpful_votes": 0,
      "publication_date": 20140102
    },
    {
      "title": "Rip off way above daily consumers price",
      "text": "Bought item placed a frayser fur 7ft in less than 3in wide held over night placed 3 ornaments on next day heard load crash the base busted water went everywhere my ornaments are broken which thank god I had just placed only those three that morning Not worth 15$ plus they’re 6$ at lowes!!!",
      "rating": 1.0,
      "verified": true,
      "author": "REGINA RUCKLE",
      "helpful_votes": 2,
      "publication_date": 20171123
    },
    {
      "title": "Small Christmas Tree Stand",
      "text": "Perfect for a small tree to put on a table. Simple to put together and easy to use. I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "sharon",
      "helpful_votes": 0,
      "publication_date": 20140101
    },
    {
      "title": "Basically the only thing good about this stand is the size of the water ...",
      "text": "This Christmas tree stand is not all it's cracked up to be. I had a 5 foot tree. The plastic screws wouldn't support a 3 foot tree! The screws should've been metal so they could penetrate the trunk of the tree. Basically the only thing good about this stand is the size of the water reservoir!",
      "rating": 1.0,
      "verified": true,
      "author": "Karen Lee Westphal",
      "helpful_votes": 0,
      "publication_date": 20170117
    },
    {
      "title": "Five Stars",
      "text": "It was just what I needed. No one else had one that size. Thanks!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kay R.",
      "helpful_votes": 0,
      "publication_date": 20150205
    },
    {
      "title": "I wish it was a little less bulky but I ...",
      "text": "I wish it was a little less bulky but I bought it to be used with a smaller tree (4 ft). I think that if you have a larger tree it would work okay but once you get up to the 7.5 I think it's too flimsy. It worked for what I needed but I ended up covering the bottom with fake snow as even a tree skirt looked kind of lumpy around it.",
      "rating": 3.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20160110
    },
    {
      "title": "Worked as promised",
      "text": "Great, sturdy stand for my 4' Christmas Tree. Easy to tighten and adjust plus nice feature on the bottom to keep you from spilling water on the floor. Remarkably study - held up to my kitten's fascination with the tree....",
      "rating": 5.0,
      "verified": true,
      "author": "alg",
      "helpful_votes": 0,
      "publication_date": 20121227
    },
    {
      "title": "Sturdy and easy to work.",
      "text": "It has been years since I had a Christmas tree. I was looking forward getting a tree but not the hassles of dealing with a tree stand. I have arthritis and it is not easy for me to deal with small parts. I was pleasantly surprised by this stand. It work for our 4.5 ft fairly thick tree. It fits fair amount of water. The water is easy put in and there were no spillage. The screws that keep the tree fixated in place are large and easy to turn and tighten.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonka",
      "helpful_votes": 0,
      "publication_date": 20160117
    },
    {
      "title": "Unstable, wobbly",
      "text": "My 4’ tree crashed to the ground in the middle of the night, breaking many of my ornaments I’ve had for years and years. Very sad. The tree was still firmly in the stand, so I stood it back up. Realized that the stand isn’t perfectly flat, has a slight wobble. That wobble combined with its small diameter, then add a 4’ tree and BLAM! They should say 3’ limit! The only limit I see us 3” trunk, which mine is under that.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Swaner",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Just the right size",
      "text": "Went to a table top tree this year and found this stand, it is perfect. Wide solid base that holds plenty of water and holds the tree firmly in place. Simple to assemble and ease of use made it the ideal choice for us.",
      "rating": 5.0,
      "verified": true,
      "author": "OakSky",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "It was the perfect size to hold a long cardboard fishing tube that ...",
      "text": "It was bought to be used as a stand for making a palm tree for a tropical \"Shipwrecked\" theme for our church's kids' VBS. It was the perfect size to hold a long cardboard fishing tube that will be made into a tree and placed in the stand to decorate the classroom. The 3 screws holding the tube are sturdy and easy to set where needed. Also, it was a clever idea to place clips inside the container to hold the 3 screws when not using the stand so you never lose the screws that go with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mona D. Wilson",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Fit is perfect for my 4ft frasier fir tree and galvanized tree ...",
      "text": "Fit is perfect for my 4ft frasier fir tree and galvanized tree collar made from a 3 gallon tub",
      "rating": 5.0,
      "verified": true,
      "author": "J. Johnson",
      "helpful_votes": 4,
      "publication_date": 20171127
    },
    {
      "title": "Not same product as listed",
      "text": "The product listed is for a five foot tree. The one I got - as did another reviewer - is only for a 4 foot one. Luckily my tree is only 3.5 feet and this worked fine with large plastic screws that is holding the tree firmly upright.",
      "rating": 3.0,
      "verified": true,
      "author": "Althea",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Too big for my tree",
      "text": "This was too big for my tree with a 1 5/8 in trunk. It slowly started to fall and luckily toward the window while I was putting the lights on. The product description should provide the size range of a tree trunk it will accommodate.",
      "rating": 4.0,
      "verified": true,
      "author": "nano",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "perfect for smaller trees",
      "text": "Perfect, just what I needed for my 3-1/2' tall tree with a 2\" diameter trunk, but the screws can go even a little smaller than that. I found the plastic screws to be plenty sturdy enough for my lightweight tree.",
      "rating": 5.0,
      "verified": true,
      "author": "see jane read",
      "helpful_votes": 0,
      "publication_date": 20171130
    },
    {
      "title": "Easy to use",
      "text": "Very good for a table top tree. Had no issues with it. Very nice to store since all the screws have a storage compartment in the tree holder.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "I haven't tried it yet, but this tree stand seems to be just what is needed for a smaller tree.",
      "text": "I bought this after Christmas when I realized my usual tree stand was difficult to use on a smaller tree than I have used in the past. I know in the future, I will be turning to more manageable table top-size trees, and this appears to be a fine stand. Looks well-made and is nice and light-weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Canadian/American",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Very nice stand.",
      "text": "This is a pretty heavy duty tree stand. It is designed for a live tree. I needed a semi small stand for my artificial tree. This worked well. It is heavy duty plastic. The screws are pointed to dig into a real tree. However, my tree has a metal center and the points slipped. I just cut the off flat with a knife and it worked well. The price was good and the stand is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Faye B",
      "helpful_votes": 0,
      "publication_date": 20151204
    },
    {
      "title": "Good stand for 4 ft tree",
      "text": "This tree stand is perfect for he 4 foot Douglas for I have this year. Holds a good amount of water and isn’t too bulky.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather B.",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Not black",
      "text": "Ordered the tree stand in black, but it is a dark green.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul W.",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Best tree stand for smaller trees.",
      "text": "So glad I was able to find this. I had my other one for years. It is perfect for smaller real trees and is instant when it comes to putting the tree up. I had lost one of the pegs and that is why I had to order this one. It also has a deep well so that the tree trunk is well saturated.",
      "rating": 5.0,
      "verified": true,
      "author": " Agatha Christie",
      "helpful_votes": 0,
      "publication_date": 20160109
    },
    {
      "title": "Nice tree stand",
      "text": "As described. I live in Hawaii and could not find a small tree stand anywhere. This stand was perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "BarbaraJ358",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "great product",
      "text": "perfect for table top tree, better than the small stand you get with a small tree",
      "rating": 5.0,
      "verified": true,
      "author": "ryan-goss",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "needed to anchor my tree with extra weight to keep ...",
      "text": "needed to anchor my tree with extra weight to keep it standing. I think they ought to reduce the intended tree height to maybe 3 feet.",
      "rating": 3.0,
      "verified": true,
      "author": "kevink121",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Just right for 3 ft tree",
      "text": "Perfect for my 5-yr old daughters 3 foot tree! Thank goodness for this-it came quickly too. (It’s all plastic but nice wide base.)",
      "rating": 5.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Was super easy to put up our fresh cut 3 foot ...",
      "text": "Was super easy to put up our fresh cut 3 foot Christmas tree. I was unsure of the quality of the screws since they were plastic but it was sturdy and was even able to keep the tree up when my 2-year old was pulling off ornaments.",
      "rating": 5.0,
      "verified": true,
      "author": "crispy_cakes",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Tippy",
      "text": "Adequate. Not sturdy for the sized tree it claims - very wobbly. Only for true \"tabletop\" sized trees, which usually come with an attached stand anyway. Waste of money.",
      "rating": 2.0,
      "verified": true,
      "author": "Jaybird",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "Good for Christmas trees 4’ tall and under",
      "text": "It was easy to use for a tiny Christmas tree that was only 4’ tall. It didn’t cause the tree to lean or tip over. And was worth the price as well",
      "rating": 5.0,
      "verified": true,
      "author": "Kate Long",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Good quality tree stand for smaller trees.",
      "text": "Small, but just perfect for the Christmas tree that we wanted to have while on vacation during the holidays. Easily handled a 4.5 foot tree. Small water reservoir, but just right for the size of tree. Do not attempt to support a large tree---not made for it!",
      "rating": 4.0,
      "verified": true,
      "author": "DLn",
      "helpful_votes": 0,
      "publication_date": 20150211
    },
    {
      "title": "Just what I was looking for! I have a ...",
      "text": "Just what I was looking for! I have a 3 ft. artificial tree that had a stand, but it broke off the first year I had it. Most other stands I've seen are for much bigger trees, but this can be used for big or small.",
      "rating": 5.0,
      "verified": true,
      "author": "NB",
      "helpful_votes": 0,
      "publication_date": 20141208
    },
    {
      "title": "Great stand I use it every year it holds a ...",
      "text": "Great stand I use it every year it holds a 4ft tree perfectly wish the screws were not plastic but it holds perfectly even with a toddler and a cat tugging on the tree",
      "rating": 5.0,
      "verified": true,
      "author": "C.Duncan",
      "helpful_votes": 2,
      "publication_date": 20150318
    },
    {
      "title": "Makes putting up small trees so much easier",
      "text": "We get fairly small trees about 3 feet tall so the trunks are pretty skinny. It used to be so hard to put it in a tree stand. This one was easy and it does not fall over! Wish I had gotten it years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Nguyen",
      "helpful_votes": 0,
      "publication_date": 20141227
    },
    {
      "title": "Fast shipping, and it held my slightly crooked, ...",
      "text": "Fast shipping, and it held my slightly crooked, 5 foot, fresh Christmas tree straight and tall. The reservoir is deep and I only had to add water once for the whole time the tree was up. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "angusmacscottie",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "Great tabletop tree stand!",
      "text": "I was skeptical about using a all-plastic stand, but this one worked really well for my 3-foot tree. Easy to adjust/tighten and the lip around the bottom was nice for catching drips.",
      "rating": 5.0,
      "verified": true,
      "author": "E.M.S.",
      "helpful_votes": 0,
      "publication_date": 20140624
    },
    {
      "title": "Good for table top trees",
      "text": "This is the only stand I could find for small diameter trunk trees. It seems to be pretty sturdy and hopefully will last us for years. I like the fact that the screws are really thick so the tree doesn't have much room to slip out. Very easy to assemble, I did it myself. Also the base holds plenty of water so you don't have to worry about your tree drying out.",
      "rating": 4.0,
      "verified": true,
      "author": "Klynn",
      "helpful_votes": 22,
      "publication_date": 20090209
    },
    {
      "title": "Terrific small tree holder",
      "text": "Perfect for my mom's little tree. Works great, great size, nice water reservoir.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonKC",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Perfect!",
      "text": "Worked perfect for our 5' tree and looks like it would take a slightly larger one or much smaller. Very sturdy and easy to set up.",
      "rating": 5.0,
      "verified": true,
      "author": "Pam Designs",
      "helpful_votes": 2,
      "publication_date": 20160213
    },
    {
      "title": "Excellent in all aspects.",
      "text": "Perfect for a small tree very easy to assemble and to fit tree into base.",
      "rating": 5.0,
      "verified": true,
      "author": "MJK",
      "helpful_votes": 0,
      "publication_date": 20170117
    },
    {
      "title": "Three Stars",
      "text": "Perfect for my little trees, easy peasy to use... but came very late :(",
      "rating": 3.0,
      "verified": true,
      "author": "Amanda B.",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "Great for trees with a smaller trunk",
      "text": "Great for trees with a smaller trunk. Won't work well for tall trees though with a small trunk, like the ones cut from the forest. Product is exactly as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "rebecca",
      "helpful_votes": 0,
      "publication_date": 20160117
    },
    {
      "title": "Excellent tree stand",
      "text": "This stand was exactly what we needed to put a small tree up on a cabinet. Very sturdy and looks nice. Ideal for small trees a few feet in height.",
      "rating": 5.0,
      "verified": true,
      "author": "dwf",
      "helpful_votes": 0,
      "publication_date": 20141228
    },
    {
      "title": "Small stand for a small tree: perfect",
      "text": "Perfect size for my 4 ft tree. Small metal spike in middle of base to jab your tree in.",
      "rating": 5.0,
      "verified": true,
      "author": "ArtDeco",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "This was perfect for what I needed",
      "text": "This was perfect for what I needed. It held a 2.5 foot fir tree securely. The only I would have liked more is if the screws were metal.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Two Stars",
      "text": "Not good quality, REALLY small, check your measurements on your tree.",
      "rating": 2.0,
      "verified": true,
      "author": "Deborah",
      "helpful_votes": 0,
      "publication_date": 20160621
    }
  ],
  "product_meta": {
    "title": "Good Tidings C163 Cinco Tabletop Christmas Tree Stand, Green",
    "description": "Cinco Poly Tree Stand - Never-fail tree stand. Patented reservoir with spill guard. Features raised bolt post and cut-away sides to save bottom branches. No break polypropylene has great strength and is unaffected by low temperatures. 3 tempered steel, rust-proof spikes keep tree from shifting or twisting. Easy set-up and easy take down. - Type: Live Tree, Maximum Tree Height: 5 Ft., Max Trunk Dimension: 3 In., Material: Polypropylene, Color: Green",
    "rating": 4.3,
    "feature_bullets": [
      "Never-Fail Tree Stand",
      "Package Height is 29.85 inches",
      "Package Length is 13.34 inches",
      "Package Width is 29.85 inches"
    ],
    "specifications": {
      "Product Dimensions": "14 x 14 x 8 inches",
      "Item Weight": "1 pounds",
      "Manufacturer": "Good Tidings",
      "ASIN": "B000HJBLRU",
      "Item model number": "C163",
      "Customer Reviews": "4.3 out of 5 stars268 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#360,897 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Batteries Required": "No"
    },
    "categories": [
      "Home & Kitchen",
      "Trees",
      "Seasonal Décor"
    ],
    "price": 11.0
  }
}