{
  "website_summaries": [
    {
      "verdict": "The easiest and most affordable way to sort coins in your car, which makes them easy to access on-the-go.",
      "pros": [
        "Fits in any cup holder and holds $10 in change",
        "Many buyers loved how easy this made it to use change when going through drive-thrus and tolls"
      ],
      "cons": [
        "Several buyers noted that the cup could be twice as tall, to hold twice as much change, and still not get in the way while driving"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Coin capacity",
      "text": "Got this product yesterday and it works great. I've haven't had any issues getting coins in or out. Here's some information no-one else, including the manufacturer, provides. These numbers are from my tests. Pennies: 42 or $0.42 Nickels: 32 or $1.60 Dimes: 46 or $4.60 Quarters: 36 or $9.00 Total: $15.62",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart R Middleton-White",
      "helpful_votes": 660,
      "publication_date": 20100917
    },
    {
      "title": "Perfect For My Toyota Tacoma",
      "text": "This coin holder fits perfect in the center consul where the ash tray would go. It's very handy when in a drive up for gut bomb food. It's easy to remove at night, I'll put in the glove box, or I'll just lay my gloves over it. The only draw back is the smaller coins may stick once in a while but other than that it's a great product.",
      "rating": 4.0,
      "verified": true,
      "author": "bob",
      "helpful_votes": 23,
      "publication_date": 20160123
    },
    {
      "title": "Springs jam coins preventing access to change when you need it quickly (ie drive thru's)",
      "text": "The problem with this product is that that some of the 4 coin-springs are not always calibrated right. So you may be able to get the quarters out with your finger when you pay at a drive thru but nothing else.. the coins are literally jammed in there. You can't get them out because the spring is pushing the coins upwards to the lip of the lid and making it impossible to pull another coin out.. So I cannot recommend this. After 12 months I finally gave up and tossed into the garbage bin were it belong. NOT Worth buying !",
      "rating": 1.0,
      "verified": true,
      "author": "JDP",
      "helpful_votes": 10,
      "publication_date": 20170908
    },
    {
      "title": "Makes paying with exact change at the drive-thru a snap!",
      "text": "Great way to organize the loose change in your car. Many people who have ridden in my car have asked if it was part of the car since it fits in so nicely with the interior of my truck. As some have said, the only real problem that I have with it is that the size of the coin holder is slightly smaller than most standard cup holders. This means that the cup will slide around a little when driving, but I don't find it to be a real problem. It definitely helps to speed things up for me in the drive thrus. I highly recommend this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 2,
      "publication_date": 20180202
    },
    {
      "title": "Handy Utility that should be in Every Car",
      "text": "This change organizer holds a good amount of change. It fits right into my cup holder. I wish it could be slightly wider to look like it was made exactly for my car, and a bit taller so it could hold even more change. I have it in a 2016 Corolla LE Eco. It is basically a little over flush with the cup holder relative to height. I would buy more to gift to family, especially if it was larger. I really think everyone should have these in their vehicle Vs a pile of chaotic loose change. I’m pleased overall with the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Nicholas S.",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Makes carrying change convenient.",
      "text": "I sometimes have problems removing change with my fingers, since it requires a certain amount of friction or the use of a fingernail to release a coin. Placing coins in the container is easy. This avoids carrying much change in your pockets or purse until required for certain items. Especially nice when purchasing something from a drive-through when it is difficult fishing change out of your pockets.",
      "rating": 4.0,
      "verified": true,
      "author": "Geaser",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Other reviews pretty much have this covered",
      "text": "Other reviews pretty much have this covered. It could be bigger, as is its a little smaller than a soda can, and *could* be twice as tall. But even at its size fully loaded its a decent weight. Holds: 42 pennies 32 nickels 47 dimes 35 quarters Gets slightly harder to slide them out when there are fewer in, and dimes are the hardest to slide out. That said it covers all I need it to (holding spare change from my pocket, and keeping all the pennies off my car floor).",
      "rating": 5.0,
      "verified": true,
      "author": "Z. Voigtman",
      "helpful_votes": 2,
      "publication_date": 20170609
    },
    {
      "title": "Just what I was looking for!",
      "text": "After looking at many coin holders I settled on this one. It is exactly what I wanted. Most of the others seemed to be for foreign coins and the slots were all the same size. This one is perfect as it fits U.S. quarters, dimes, nickels and pennies. As others noted, at times they can be a little difficult to slide out. I solved this by buying some rubber finger tips. Problem solved. I keep the finger tip by the coin holder in my car.",
      "rating": 5.0,
      "verified": true,
      "author": "ErrandGirl",
      "helpful_votes": 3,
      "publication_date": 20170622
    },
    {
      "title": "Must Have !",
      "text": "After checking many styles and the reviews, I decided to purchase this particular Coin Holder and crossed my fingers that I made the right decision ! To be honest I was really surprised how well my decision was correct based on the size, the function and how well it is made and the great fit to my Ford Fusion 2020 as the pictured shows !",
      "rating": 5.0,
      "verified": true,
      "author": "NKK",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Weak springs - coins hard to extract",
      "text": "At first this looked like it would work pretty well so I loaded three of the slots with quarters, nickels and dimes. But as I started to remove the coins for parking meters I soon ran into a problem. When the dime stack was reduced by about half the dimes became harder and harder to extract and soon they were almost impossible to get out. The problem seems to be that the spring loaded mechanism is not strong enough. I've thrown this out and am looking for something better.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160717
    },
    {
      "title": "GREAT FIND!",
      "text": "Cleaning out my car, I realized half of my problem is the random change floating around. As I started researching on Amazon, I came across this bad boy and it was a great find. It's the perfect size for my cup holder and not heavy but DANG does it hold a lot of change. Now my car is actually clean and organized, plus going through the drive thru is way less stressful and exact!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristine Rita",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Easy To Use. Fits In Cup Holder",
      "text": "This thing is great. It's black so it looks good and discrete. It's small so it fits in a cup holder, or can just sit on your desk. It can hold a bunch of coins. The spring and mechanism to put coins in and taking them out works really well. I would definitely buy again, and in fact, I have. I bought one for my desk and have just now bought another one for my car. Not to mention it's cheap so it doesn't hurt the wallet. Definitely recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Landon Rock",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Coins Keep Falling Out",
      "text": "This coin holder has slots for pennies, nickles, dimes, and quarters and holds quite a few of each. It also seems somewhat sturdy for the price. The problem is that coins keep falling out. The springs seem strong but I was continuously picking up coins and putting them back in the slots until I finally threw this coin holder away. It's probably fine for indoor use but not in a car.",
      "rating": 2.0,
      "verified": true,
      "author": "S. Fox",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "I love these little money holders",
      "text": "I bought three of them -- one for each car in our household. It's so much nicer than having loose change rolling around in the car's console or ash tray. Organized, easy to use, and fits perfectly in the cup holders. It encourages us to actually use the change instead of continuing to grow a change collection in our cars. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "dmwalker",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Very Functional Product",
      "text": "This was a perfect answer to my personal dilemma. I owned an older Jeep that had a coin holder that I used constantly. I traded the Jeep for a new 2015 never thinking about it having a coin holder, which it didn't. I searched Amazon for options and I selected the Winplus model. I have now used it for about 2 months and really am glad I found this product. The only comment I would make is that you should not insert bent or gashed coins as they might become stuck. Not a problem removing them, but just avoid inserting flawed coins.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Pavese",
      "helpful_votes": 0,
      "publication_date": 20150226
    },
    {
      "title": "Exactly what I was looking for, but nickel slot gets stuck",
      "text": "I love the idea of organizing all of my loose change and taking up a cup holder so I'm not tempted to throw random things in there. As soon as I got mine, I loaded it up, and all slots work well except for the nickel slot which gets stuck \"pushed in\". I'm going to try spraying some lubricant in there and hope for the best. It's not a deal breaker since I can still use it, it's just not as smooth as the other coin slots.",
      "rating": 3.0,
      "verified": true,
      "author": "Juan",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Fortunately, if it vibrates when the spring is vertical",
      "text": "Works well, but in some cases you'll get the springs vibrating. If you're OCD (which, let's face it, you are if you're buying a coin holder...) and you hear a vibration, this may be the culprit. Fortunately, if it vibrates when the spring is vertical, it likely wont in the horizontal position, so just move it from the cup holder to the door pocket or seat or something.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris P Bacon",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Not good. Not bad.",
      "text": "Like others have said, it's easier to get the coins in than out. However, it does take different types of coins and fits rather securely in my cup holder so it works for me. I could see how others might have a problem with this product as sudden stops have caused a coin or two to pop out. Not a big deal but it does happen. The tape at the bottom to secure it in place? Worthless.",
      "rating": 4.0,
      "verified": true,
      "author": "Gary A. Hoover",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "So far, I haven't had any issues with the ...",
      "text": "So far, I haven't had any issues with the coin holder. US coins fit in no problem. It also fits down into a cup holder so it's not rolling around the car or in the way (unless you need the cupholder.) If you have coins scattered around and want to keep them organized, this thing will help tremendously.",
      "rating": 5.0,
      "verified": true,
      "author": "daniel7683",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Good Addition To My Center Console",
      "text": "I bought this item so I could get $15 - 20 worth of change from my center console cup holder so I could use it for my coffee cup. Now I can take the holder out and set it on the floor until my coffee is gone. It is a little hard getting the change out of the 4 retainers sometimes but tapping it on your hand toward the side of the change denomination you want works well. It is definately worth the money and I would recomend it to my friends, if just for the convience of being able to use my cup holder again.",
      "rating": 4.0,
      "verified": true,
      "author": "F. Ross",
      "helpful_votes": 0,
      "publication_date": 20151010
    },
    {
      "title": "Holds Lots of Coins--even Pennies--& not very big",
      "text": "It's not too big, but it hold lots of coins, pennies included. Nice to have at the self-serve car wash, and keeps me from throwing coins in the console. I like it better than the rectangular one that came with my truck, but I accidentally left that one behind when washing my car! Went back, but somebody else needed it more than I did, I guess. :-( I'm kind of glad, since I replaced the lost one with this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenna Vandermey",
      "helpful_votes": 0,
      "publication_date": 20161104
    },
    {
      "title": "Excellent For Parkway Tolls",
      "text": "I use this everyday! Fantastic device for keeping loose change organized in your vehicle. It does hold a good amount of each coin. I use to aid me in paying tolls as counting up the required amount is fast and easier with this.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. C",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "It’s Okay",
      "text": "When removing coins from this item, if there’s too much stacked in one slot it’s hard to remove coins, if there’s too little stacked in one slot it’s hard to remove coins, it needs to be jusssssttttttt right!",
      "rating": 3.0,
      "verified": true,
      "author": "Colby Morgan",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Smaller then expected",
      "text": "Smaller then expected but the right size all the same. Fits well into my door cup holder and holds enough coins of all four (4) sizes to be worth the purchase. Haven't used the stick pad that's included to secure the holder in place yet but love that it's an option.",
      "rating": 4.0,
      "verified": true,
      "author": "Clairese",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "great coin organization!",
      "text": "great coin holder to use in your automobile if your vehicle manufacturer wasn't smart enough to address this organizational need when crafting your car. fits in cupholders - holds each of your coin denominations in a separate spring loaded channel (quarters, nickels, dimes, pennies) comes with a 3 m double sided disk to mount more permanently - but it didn't stick for me! holds plenty of coinage too!",
      "rating": 5.0,
      "verified": true,
      "author": "Russell R. Herman",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Change holder=Life changer",
      "text": "This little cup is going to be a life changer for me. I went to the bank today and got coin rolls to fill up this thing. I've been filling it and emptying it for an hour to test how many coins that it can hold. I can't wait to go through a drive thru so that I can pull out my coin cup like a BOSS! My coin holding test is as follows: 33 Quarters= $8.25 45 Dimes= $4.50 31 Nickels= $1.55 40 Pennies= $0.40 $14.70 coin capacity",
      "rating": 5.0,
      "verified": true,
      "author": "Keisha Richardson-Warren",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "good coin holder",
      "text": "Coin holder works well to organize coins in the car. It is a little difficult to remove a dime if it is the only one in the holder. However, if the organizer is full, the coins are easy to remove.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Very nice.  Everything I wanted, including pennies.",
      "text": "Excellent. It holds pennies! It is great over all, but I was in disbelief at how many of these things do not have a place for pennies. If you don't have pennies, and something costs __.01 and you give them a nickel, you will have 4 pennies and no where to put them. :) With this, no more worries! I haven't even tried filling it up entirely, it holds so much. I am keeping it in the cup-holder in the door of the car. It was a little awkward getting it out, but it fits well there.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "it helps",
      "text": "I have for years had a cup of coins riding the roads with me, but this item really helps keep me organized for that quick car wash or food drive through coin need. Now instead of $20.00 in tow, I am able to keep down the amount of change in my car to a few dollars",
      "rating": 5.0,
      "verified": true,
      "author": "Al B. Moore",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Perfect for keeping your car organized.",
      "text": "This little tool really helped me better start using my loose pocket change, as it makes it available on hand and in exact amounts. After a couple months of use, I can safely say I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Harrison",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Handy to give exact change at the drivethru",
      "text": "A nice gift for a neat car lover fits like $10 according to the instructions. Only backside to take out your coins it will be unit by unit, since its completely seal, easy to give exact change though.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose S",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Great coin sorter with a small circumference to fit most cupholders",
      "text": "This is a great coin sorter for your car that is small enough in circumference that I imagine it would fit in most cupholders. The only bugaboo I have is that the slots are not marked in any way, so I sometimes, when it's empty, will accidentally put a penny in the nickel slot or some such. I rectified this by using a paint pen to write \"P, N, D, Q\" on the slots. Would be nice if they came marked somehow.",
      "rating": 4.0,
      "verified": true,
      "author": "PC",
      "helpful_votes": 0,
      "publication_date": 20160207
    },
    {
      "title": "Handy!",
      "text": "Even my teenage son stays organized with this. His Tundra has a cup holder in a location that is impractical for most cups & so he had the perfect place to place the coin holder. He doesn't have to scramble for exact change when he doesn't listen to his mother when she tells him how awful fast food is for him & pays at the drive thru.",
      "rating": 5.0,
      "verified": true,
      "author": "A P",
      "helpful_votes": 0,
      "publication_date": 20160405
    },
    {
      "title": "This is good for someone that needs exact change every time for ...",
      "text": "Meh. This didn't even hold the quarters I had in my console. If paying for meters is what you want it for it's so not worth it. $2.00 for a typical meter in LA it wouldn't last long. Nickels and pennies for me just end up in a jar in the house. This is good for someone that needs exact change every time for drive throughs I guess. I just usually pay cash and throw the change in a jar till Coinstar time. Maybe worth it to some but useless for me. To be fair though the refund was a breeze.",
      "rating": 2.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20140927
    },
    {
      "title": "Good execution of a good idea",
      "text": "Works great. Fits cup holder perfectly. Only drawback that I didn't think about is the functionality of loading coins. When I pull away from the coffee drive through, instead of just tossing the coins into a cup, I'm not stuck with the delimma of pulling over the stow my recently acquired coins into the holder, or just toss into the other cup holder and drive away. So the holder works great...just the usability issue to keep in mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew H.",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "Get this one",
      "text": "I had a different manufacturer's version of this and it worked OK until someone broke into my car and took it. I went without for a while, but I missed it eventually and bought this version instead. I can't think of much to say honestly except that it's exactly what it looks like and if I had to do it again I would stick to this version. Also this more completely fills the space in my cupholder so it rattles around in there less. 5 stars simply because I couldn't imagine any significant improvement they could apply here. If you need one of these, buy this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas J. Foote",
      "helpful_votes": 0,
      "publication_date": 20141215
    },
    {
      "title": "Not for F350, not enough cup-holders.",
      "text": "Great concept, I like it, but it takes up my second cup-holder out of the two I have, so I end up throwing it on the adjacent seat or floor where it inevitably lands, and rolls around. Not sure how this can be resolved other than vehicle choice, where cup-holders are more ubiquitous...",
      "rating": 4.0,
      "verified": true,
      "author": "NorthernIndyRyan",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Love it!",
      "text": "Love this thing! Had been keeping coins in a plastic container and it was difficult to sort through coins quickly when at a drive-thru. It is a little smaller than the cup holder, but I think that is good because it is easier to remove coins when holding it in your hand. So glad I purchased this!",
      "rating": 5.0,
      "verified": true,
      "author": "Kerry K.",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Works Great and holds pennies!",
      "text": "I bought one for myself and my wife saw it and asked for one as well. Coins can sometimes be hard to pull back out, especially once you have a number of coins in a slot. UPDATE: Two years later on and we are still using it. The \"Nickle\" slots spring as compressed (I keep a lot of coins in most of the time) and they rattle out while driving. Coins do stick every now and then, half of it is because coins get nasty and sticky sitting in peoples dirty cup-holders! I'm pleased with the overall function and resiliency, so I'm replacing it with another one!",
      "rating": 4.0,
      "verified": true,
      "author": "Tom L",
      "helpful_votes": 0,
      "publication_date": 20150626
    },
    {
      "title": "One of those things you like more every time you use it",
      "text": "I was pleasantly surprised by how much change can go into this coin holder. Coins slip into their respective places easily and it's super simple to retrieve the ones you want when you want them. Quick and easy in a toll booth, drive up window, or charitable donations at a stop light. It fits into the cup holder on the driver's car door, taking up very little space in a convenient location.",
      "rating": 5.0,
      "verified": true,
      "author": "Far2Organized",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "To remove a difficult coin just use another coin",
      "text": "Works great. It is true that some coins may very a little difficult to extract. The way I remedied this was by using one coin to push another coin out. It holds a lot of coins that's for sure. For those who have made the statement that the coin holder is visible and that someone may break you window to steal just a few coins do what I did. I place the coin holder in the center compartment and no one can see it. Or place it inside the glove compartment. Hope this helps.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose Perez III",
      "helpful_votes": 0,
      "publication_date": 20150122
    },
    {
      "title": "Is as described",
      "text": "This product came fast, is as pictured and described and fits in my door cup holder. I have not used the adhesion, so can't comment on those aspects.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Day",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Works Really Well",
      "text": "Feels solid. The springs don't feel like they are wobbling around inside like my previous one. I have no complaints. Just buy it. Oh, I guess I should say that I use it for US coins.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Gibson",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Try this trick for getting coins out",
      "text": "I found a trick for removing coins when they \"stick\". Wet a finger or two with water, some soda, your saliva, or anything that won't leave a slippery residue. Then, dry with a napkin, towel, a shirt sleeve, or pant leg. Once fingers are completely dry, they should have good traction, making it very easy to remove coins. Works 99% of the time. This trick makes using this coin holder worthwhile. Coin holder eliminates having to fish through console or ash tray. I've also said goodbye to coin jars that are tedious to have lying around then having to schlep to those coin redemption machines.",
      "rating": 5.0,
      "verified": true,
      "author": "JCGarza",
      "helpful_votes": 0,
      "publication_date": 20160208
    },
    {
      "title": "Worked as expected",
      "text": "I find this item helps me keep a calm level head when I'm in a drive thru; rather than panicking finding where my dime or nickel is. This helps me keep organized.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Horrible, useless, cheap junk",
      "text": "it is difficult if not impossible to get to coins to come out of this cheap piece of junk. the diameter is too small to fit almost any size drink holder. The price is low, so is the quality. Do not buy.",
      "rating": 1.0,
      "verified": true,
      "author": "KK",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "Gather up that loose change in your car! Small and tapered to fit any cup holder. Also adhesive bottom.",
      "text": "Good build quality. Cleaned up my center console from all the loose change floating around. The secret I found to getting out coins easily is to put your finger or thumb over the inner cutout right over the middle of the coin versus the edge. If you place your finger near the edge, it is very easy to push the coin below the lip of the container. You can start pushing it out from the middle without depressing it below the lip. Great change holder.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Chapman",
      "helpful_votes": 0,
      "publication_date": 20150223
    },
    {
      "title": "Now I never run out of change",
      "text": "the unit fits nicely in my cup holder and can easily be removed to take into a store so I don't have to come out of the store with a lot of change.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert B.",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "I like this coin holder a lot",
      "text": "I like this coin holder a lot. In the short time I have had it, I have no complaints. It is easy to load and unload. I had it maxed out on dimes and it did make it difficult to get the first 1 out but that was understandable.Occasionally I have to put it in the cup holder in the door panel and closing the door will cause some of the quarters to pop out of it. Overall I am satisfied and look forward to having organized coins!",
      "rating": 4.0,
      "verified": true,
      "author": "MrFoo",
      "helpful_votes": 0,
      "publication_date": 20160911
    },
    {
      "title": "Better than loose change",
      "text": "It help with you ending up with a bunch of loose change. Now I'm getting a bunch of 1 dollar bills. Go figure. Got it on time and in good condition",
      "rating": 4.0,
      "verified": true,
      "author": "Ericjohnns",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "pennies and dimes get stuck",
      "text": "Like some other reviewers have complained, this gadget is useless because the coins get stuck. Very unexpected because there are so many positive review here. Maybe I just got a lemon?",
      "rating": 1.0,
      "verified": true,
      "author": "Πέτρος",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "It a bit small, but still a great value",
      "text": "I would recommend this to anyone looking to organize their change. It makes utilizing change MUCH easier! It does what it says and is one of the few that has a penny slot. As mentioned in the title it is kind of small and tends to rattle around in my small cup holder. Be aware of that if your vehicle has large cup holders. Not much else to say about it. it does what it says quite nicely. Great value!",
      "rating": 4.0,
      "verified": true,
      "author": "Deez",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "works great to hold and dispense coins well",
      "text": "speedy delivery. works great to hold and dispense coins well. It is the size of a pop can just not has high so fits easily and able to keep handy to use in my car. This way I use my change more rather than putting it into a machine to separate for more usable cash bills. and I do not like to roll my own coins to take to the bank.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Jen",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Wish I could rate it higher.",
      "text": "Great design but it's too bad the springs are so weak. After you take out a couple coins out the rest don't get pushed up enough to get out. You have to turn it upside down and bang and shake it. Otherwise it's great, I love the cup holder location and that it has a slot for pennies. If it worked like it should I'd have given it five stars, but as it it.....",
      "rating": 2.0,
      "verified": true,
      "author": "Galt44",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "Surprisingly Sturdy Construction",
      "text": "Very sturdy construction. Holds pennies, dimes, nickels and quarters. Easy to load, just poke coins into the appropriate tubes. Taking them out again is even easier as just light finger pressure easily pops out a coin. As a buyer you are probably concerned with the quality of construction. Trust me when I tell you that this coin holder is not a flimsy piece of junk, It is strong and well built.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Neese",
      "helpful_votes": 0,
      "publication_date": 20150528
    },
    {
      "title": "Weak quarter spring.",
      "text": "I have used this for several months now in the driver side door cupholder, around my left knee. The spring that holds the quarters cylinder has demonstrated itself to be too weak, returning far less force than the ones holding the other three denominations. This has resulted in quarters being strewn about on the floor beneath my feet and in the driver side door pocket.",
      "rating": 1.0,
      "verified": true,
      "author": "Disgruntled",
      "helpful_votes": 0,
      "publication_date": 20161030
    },
    {
      "title": "Works pretty well",
      "text": "I put this in a cup holder in the car door. Works pretty well, but some coins come out when the door is shut hard.",
      "rating": 4.0,
      "verified": true,
      "author": "kc1tom",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Worth every penny!",
      "text": "I am loving this coin holder so far! Just got it today and it's already making it easier to put away and access any of my spare change. AND it has a sticker at the bottom to hold it in place. I'll update this in a few weeks or months to let you know if it's still living up to it's 5-star rating.",
      "rating": 5.0,
      "verified": true,
      "author": "SKNik",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Best Product Out There",
      "text": "I was worried when getting this that it was going to be very small and not carry as much as I need. I was very pleased to find out that this is just the right size and fits a lot. Very easy to use and to retrieve and overall the best I’ve tried",
      "rating": 5.0,
      "verified": true,
      "author": "Nolan",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Does not fit in new car (measure your cup holder if 3\" dia and 3\" deep perfect)",
      "text": "I have a new Accord with a center console cup holder that has adjustable tabs and a non-round cup holder shape; this coin holder is too short and too small diameter - it does not fit into my cup holder. The coin holder rattles around and because it is short, you have to lift it out to use it. If your cup holder has a 3 inch diameter opening and is no more than 3 inch deep, this would be perfect. But it does hold the coins nicely and better than nothing. So I will keep it and put it in the console, until I find something better",
      "rating": 3.0,
      "verified": true,
      "author": "Retired EE",
      "helpful_votes": 0,
      "publication_date": 20140107
    },
    {
      "title": "Easy to use",
      "text": "My husband loves this in his pickup. I love it because it helps keep his pickup tidy. It sits in the middle drink holder.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr Jo",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "New truck came without change sorter and we missed it",
      "text": "My hubby got a new truck and it didn't come with a change sorter. He primarily drives the truck with no other passengers so it works out well for him to put this in the second drink cup holder. When I am with him, we just set it inside the console and it sits upright without problems. He is very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "LisaU",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "I would even like it much more if it had additional quarter slot",
      "text": "Definitely does its job , I would even like it much more if it had additional quarter slot",
      "rating": 5.0,
      "verified": true,
      "author": "aviad bracha",
      "helpful_votes": 6,
      "publication_date": 20170409
    },
    {
      "title": "Meh",
      "text": "This is a cute idea. In reality it’s hard to take the coins out and once you do the springs are all coming out. It’s more of a hassle than anything.",
      "rating": 3.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "I love this coin organizer",
      "text": "I love this coin organizer. I love that it also has a slot for pennies because I got tired of tossing loose pennies into my cup holder. It also holds much more change than my last one.",
      "rating": 5.0,
      "verified": true,
      "author": "K9Jeeper",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "Saves your loose change!",
      "text": "I put this in my cup holder. Once I leave a store with some change in my pocket, the first thing I do is put them in here. It helps me save a good bit of money where before, I cared little about loose change. Build quality is good. It feels like solid plastic, not super think and cheap. The matte finish also feels nice. Once a fair number of coins are place into it, it feels quite solid. The cup also has a surprisingly large capacity, however, there is no indicator of how much change/space you have. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "ALam715",
      "helpful_votes": 0,
      "publication_date": 20160209
    },
    {
      "title": "Great.....but needs a lid!",
      "text": "This is an excellent coin holder for the car which fits nicely in a cup holder. I also had no problems getting any denomination of coins out of their slots. Works perfectly! The only thing it needs is a lid. It's a little tempting for petty thieves to see money inside the car. Also, it would look nicer for us car enthusiasts who want our cars looking like it just rolled off the showroom floor and not a daily beater if it had a cover. Otherwise it's a great buy and highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "LilRedVette",
      "helpful_votes": 0,
      "publication_date": 20140617
    },
    {
      "title": "Basic, easy to use, gets the job done.",
      "text": "It fits in your cup holder, gets the job done. Only thing is, as you start to fill the coins in each compartment, they get harder to remove as the spring is tighter in the barrel. I haven't found a way to open up the base if a coin happens to fall inside, but right now it doesn't seem to be a problem. It's simple, basic and an easy way to organize your coins for going through tollways or getting exact change without fumbling for coins in the dash compartment.",
      "rating": 4.0,
      "verified": true,
      "author": "Cool Spot",
      "helpful_votes": 0,
      "publication_date": 20141127
    },
    {
      "title": "IT Is What It IS",
      "text": "It holds coins well. Now, if it MAKES coins, and holds them....Then i will give it 5 stars !",
      "rating": 4.0,
      "verified": true,
      "author": "Sk8sn0surf",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Awesome for the car!!",
      "text": "My husband needed this for his car and he loves it! It’s easy to use and keeps everything organized so it’s easy to grab!",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Not so good",
      "text": "Limited usage for non US coins due to the tubes size. Also, holder size is smaller than most of the car cup holders so it fit too loose in the cars I tried",
      "rating": 3.0,
      "verified": true,
      "author": "Pablo Gilardoni",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "This thing holds a lot of coins",
      "text": "Wonderful coin capacity, works as intended, no issues yet. Very happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "drew kohl",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "works great!!!",
      "text": "helps you organize your change so you're not searching through a cup to find pennies in the drive thru, looks great works even better very satisfied",
      "rating": 5.0,
      "verified": true,
      "author": "Jake&Cara",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Love it",
      "text": "Handles all my change needs. If you load it up, would make a nice weapon. Just saying",
      "rating": 5.0,
      "verified": true,
      "author": "MLBNFP",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Great Idea",
      "text": "I have used this product for several weeks and it performs as advertised. I definitely recommend this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry L",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "A slot for pennies!",
      "text": "This one has a slot for pennies. Really not much more that needs to be said. I'm not a fan of pennies, but the annoying, nearly worthless little things are still legal currency, so I need a place to put them! Which is why it baffles me that every other coin holder out there omits the penny slot. I do also like the cupholder design of this product (or you can mount it with the enclosed mounting tape, or toss it in your console storage). It's reasonably solid, has more capacity than similar products, and functions well. This is the coin holder you want.",
      "rating": 5.0,
      "verified": true,
      "author": "Bluemont Hill",
      "helpful_votes": 56,
      "publication_date": 20121231
    },
    {
      "title": "Great buy",
      "text": "Like this little holder fits perfect in my truck ! No k no more coins laying around!!",
      "rating": 5.0,
      "verified": true,
      "author": "tchud",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Great type of product",
      "text": "I'm kind of upset. Great type of product, but mine is lacking efficiency. The nickel portion of the slots are defective and get stuck so it is a real pain in the kulo. I hope the seller will send me another one otherwise I plan on returning the product entirely. I was really excited about this purchase, but unfortunately for no reason. Barely holds any pennies as well. Maybe 10.",
      "rating": 3.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20151024
    },
    {
      "title": "Good coin holder",
      "text": "This is a good coin holder; it holds a lot of change. I wish that it was a little taller because it sits very low in my cup holder which makes accessing the coins a little difficult.",
      "rating": 3.0,
      "verified": true,
      "author": "Ronald Hill",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "Love this coin holder.",
      "text": "Love this thing. Using this coin holder, I keep my change in the cup holder in the door of my car. It can't be seen from outside the car and is handy.",
      "rating": 5.0,
      "verified": true,
      "author": "JP97392",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Coins fall out.",
      "text": "I like it but the coins fall out of it when it vibrates. I put a small piece of the carpeted side of Velcro next to the coin to keep them from falling out.",
      "rating": 3.0,
      "verified": true,
      "author": "Shield80",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "Good Product/Springs need to be stronger",
      "text": "Overall good product. The springs that push the coins up could be stronger. Half the coins in each sleeve works well with the strength of the springs, but once the sleeve is full, the weight of the coins push on the springs more than the springs push on the coins. Coins still comes out but with some work on my behalf. Overall Good Product and does the job as long as I don't fill the full sleeve up with coins.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Very convenient coin holder",
      "text": "I use this coin holder quite a bit. It holds a lot of coins. My Highlander has an abundance of cup holders so this was a great choice for me to store extra coins. My only complaint is that the pennies seem to get stuck and won't come out easily. I often have to bang it on the palm of my hand to get them loose. I have had this coin holder almost a year and with the exception of the pennies side it works well.",
      "rating": 4.0,
      "verified": true,
      "author": "C.T.",
      "helpful_votes": 0,
      "publication_date": 20150208
    },
    {
      "title": "Makes getting correct change fast.",
      "text": "Holds a fair number of coins and makes getting the correct change fast. Then I put the rest of the coins in a travel mug with this coin holder on top and into the doors cup holder. Great combination. As I use the coins in the coin holder, I refill it from the cup.",
      "rating": 4.0,
      "verified": true,
      "author": "Shawn R. Blackhurst",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Fits the Tundra little cupholder perfectly!",
      "text": "I own a Toyota tundra with 3 cup holds in the front console. This fit right into the smallest one and now gives me a convenient place to keep my change! if you have cup holders that are for oversized cups, this will not be ideal since it is short and narrow.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 5,
      "publication_date": 20160215
    },
    {
      "title": "dimes and pennies are hard to retireve",
      "text": "I would love this thing but alot of the time the dime and pennies are a pain in the ass to get out if the spring is not damn near fully compressed. And god help you if you get some sticky goo on a coin and it makes its way into here. You gonna jamb up the whole system.",
      "rating": 3.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Great holder for all coins!",
      "text": "Love this! Love that it holds quarters, dimes, nickels AND pennies. It fits in my cupholder perfectly and when I have a passenger riding with, that wants to put a drink in the other cupholder, I just toss it on my backseat, and the coins stay in it (of course that might be because it's new, but I'm liking it). Glad I purchased and I would definitely buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "KazzyK",
      "helpful_votes": 0,
      "publication_date": 20160104
    },
    {
      "title": "Very practical and keeps clutter organized",
      "text": "Nice deep slots for each coin. Holder fits easily in car cup holders.",
      "rating": 5.0,
      "verified": true,
      "author": "GLETS President",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Great core design with a couple tweaks needed.",
      "text": "So far very impressed. As others mentioned, I wish the spring tension was more, but it's workable. Also, as others mentioned, I wished the size were larger, but the person who suggested putting it in a foam beer insulator has a good idea, and I'll try that so it's not bouncing around so much in the cup holder. Those two things being fixed, it'd be a 5 star product, hands down.",
      "rating": 4.0,
      "verified": true,
      "author": "Nate",
      "helpful_votes": 0,
      "publication_date": 20151218
    },
    {
      "title": "Great build quality",
      "text": "Great product for the money, you can hear the springs rattle around and make a small noise when the coin slot is almost full or has nothing in it. This is expected fo a $15 coin holder, is very well built and each holder is made fo a coin size, and not just a plastic cover to make it look like it is with other coin holders.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick C.",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Must be cheaper",
      "text": "Yes I will recommend this item but the original winplus coin holder which was stolen from my car I purchased 6 years ago was totaly different quality even on touch you could tell it is tough made and it cost me only $ 10.00 with a tax . So what I wanna say this item is just a good clone (I`ll see how long it`ll last) but a price including shipping is obviously must be lower because it is clone made from cheap plastic not as like original one that i had ,it is my straight thought sorry. And thank you anyways for selling this cheat item that must be cheaper . Will recommend for buyers!",
      "rating": 4.0,
      "verified": true,
      "author": "Anton",
      "helpful_votes": 0,
      "publication_date": 20121225
    },
    {
      "title": "It works",
      "text": "The trade-off is that it instantly adds 20 years to your current age",
      "rating": 5.0,
      "verified": true,
      "author": "Ana",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Nice product",
      "text": "I like it a lot, it does its job. Fits nicely in my center console.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick T Patterson",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Nifty handy little cup for dexterous fingers.",
      "text": "Nifty handy little cup for dexterous fingers. I love this coin holder. I've been using this for change in pizza deliveries, in the laundromat, vending machines, and to store excess change from the store checkout. I intend on getting some for my friends they'd make a nice gift.",
      "rating": 5.0,
      "verified": true,
      "author": "christopher rivera",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "It functions great and fits right in my side cup holder",
      "text": "Only thing I wish was that the plastic was clear. Lose track of how much change I have in the holder. It functions great and fits right in my side cup holder. Very convenient. Have used for 3 weeks*",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Super useful!",
      "text": "Never have to worry about any of the lose change anymore! The one thing I can't stand is the fact that every time I close my door some change sometimes comes out of the apparatus",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Timesaver",
      "text": "Really works well, stays in place and easy to get the correct change before you hit the drive thru.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard P. Armstrong",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "It's a simple unit that works great.",
      "text": "I found that it is easier to use this change holder if you don't glue it to a cup holder. It is easier to hold the change holder in my hand and remove the coins. I wish they made this with clear plastic so I could see how many coins I have left in each slot.",
      "rating": 4.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "awesome coin holder ! ☆☆☆☆☆",
      "text": "Fits PERFECT IN MY CAR! easy to move around ! Item description is on point ! Thank you so much again",
      "rating": 5.0,
      "verified": true,
      "author": "Miguel Ramirez",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Great quality",
      "text": "Awesome product. Very useful. Quick and easy to add and remove coins.",
      "rating": 5.0,
      "verified": true,
      "author": "Sigrid D.",
      "helpful_votes": 0,
      "publication_date": 20191219
    }
  ],
  "product_meta": {
    "title": "WINPLUS AC02000606 Coin Holder",
    "description": "Type S Coin Holder by Winplus stores your loose change in a modern holder. Fits pennies, nickels, dimes, and quarters. Holds over $10 in change.",
    "rating": 4.6,
    "feature_bullets": [
      "Fits in any cup holder",
      "Holds pennies, nickels, dimes, and quarters",
      "Can hold over $10 in change"
    ],
    "specifications": {
      "Manufacturer": "Winplus",
      "Brand": "WINPLUS",
      "Item Weight": "6.4 ounces",
      "Product Dimensions": "7.8 x 5.3 x 3.1 inches",
      "Item model number": "AC02000-60/6",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "AC0200060/6",
      "ASIN": "B000CRO4IK",
      "Customer Reviews": "4.6 out of 5 stars1,182 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#14,256 in Office Products",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "April 16, 2008"
    },
    "categories": [
      "Money Handling Products",
      "Forms, Recordkeeping & Money Handling",
      "Office Products",
      "Automotive Parts & Accessories",
      "Office & School Supplies",
      "Coin Counters & Sorters"
    ],
    "price": 14.99
  }
}