{
  "website_summaries": [
    {
      "verdict": "This clamp-and-lock jar opener works for everything from kitchen jars to soda and medicine bottles.",
      "pros": [
        "Made of heavy-duty plastic",
        "Opens smooth-sided and grooved caps and lid from 1 to 3.5 inches",
        "Hole in handle for hanging",
        "Long handle provides good leverage",
        "Works well on everything from water bottles to kitchen jars to pill bottles"
      ],
      "cons": [
        "Can dent lid if you over-tighten"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Does not work.",
      "text": "It doesn't work at all. Didn't know there was a time limit to return, as this as garbage. DO NOT BUY!",
      "rating": 1.0,
      "verified": true,
      "author": "ldb",
      "helpful_votes": 48,
      "publication_date": 20180224
    },
    {
      "title": "This thing is great!",
      "text": "This tool is fantastic. Due to carpal tunnel and some arthritis, I'm having a hard time opening jars and bottles. It works on everything from water/soda bottles to pickle jars to laundry detergent. Simple to use, just place it over the top and tighten the lever, and open. The only time it isn't so easy to use is opening small jars, because it's difficult to get a grip on the jar itself so you can use force on the lid. Still, it's awesome, highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "MA-reader",
      "helpful_votes": 12,
      "publication_date": 20180621
    },
    {
      "title": "Decent opener",
      "text": "I can't live without this item. Easy to use. When a jar or bottle seems impossible to open, this little gadget really works. I gave it 4 out of 5 stars because it replaced a similar opener that I had for years. My old one finally gave out. Unfortunately, when I compared the two, I found my new one was not as well made. I doubt it will last as long as my older model.",
      "rating": 4.0,
      "verified": true,
      "author": "T. B.",
      "helpful_votes": 8,
      "publication_date": 20190321
    },
    {
      "title": "Finally! Something that works!",
      "text": "A jar/bottle opener that works! My problem is partly weak hands and partly sensitive skin so I either can’t get a good grip on the lid or the ridges designed to help with grip are painful to my skin. I’d tried multiple other ways To open jars and bottles including flat pieces of plastic and other brands of grippers but they did not help. This is the first device I’ve been able to confidently rely on!",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie ._c-",
      "helpful_votes": 2,
      "publication_date": 20191018
    },
    {
      "title": "So glad I splurged!",
      "text": "Our old jar opener was the type with 4 sizes lined with thick rubber to help you grip and turn. The rubber finally gave out and started to disintegrate so after considering cheaper replacements, I decided on this tool instead. So glad I did! I like this much better than our old one and I think this will last a long time. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "D.",
      "helpful_votes": 3,
      "publication_date": 20190305
    },
    {
      "title": "No more frustration with senior hand vs jars",
      "text": "I've had a few jar-assist gadgets but nothing works like this. Just center over the lid, turn the wing screw on top, then use the handle to give a good turn. I remember from my physics class many decades ago that a lever (the handle) increases the power of the push/pull and by golly it sure does! One caution: do not over tighten the screw. It can actually compress the sides of the lid and then the lid binds harder to the jar. Just snug is all you need!",
      "rating": 5.0,
      "verified": true,
      "author": "RSD48",
      "helpful_votes": 2,
      "publication_date": 20190310
    },
    {
      "title": "Great Can Opener for  Arthritic hands.",
      "text": "I love this bottle opener. I used many different ones and up until a year ago I'd grab a rubber placemat or a gripper to take bottle caps off. I also had one of the ones that you attach under the cupboard. (I really liked that one). I have Arteritis in my hands now and can't get good grip. This opener works great. I put it on the jar or bottle i want to open, tighten it and i can open every jar ive tried.",
      "rating": 5.0,
      "verified": true,
      "author": "Fun Reader",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Do not buy!",
      "text": "Used for one jar of pickles and some bottles of Kirkland Kambucha. After 1 week...it broke. Good design if it was durable rather than cheaply made. I have a Kuhn Rikon can opener that I really like but this opener should not have broken like this. A waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Karen A. Ghan",
      "helpful_votes": 3,
      "publication_date": 20190916
    },
    {
      "title": "THIS HAS CHANGED EVERYTHING!",
      "text": "I love this device. I can open things on my own without hurting my fingers or wrist. It honestly makes me feel empowered again as weird as that sounds. No more waiting for someone to get home to open something for me. I wish there was a mini size to carry in my purse when I’m out and about for small bottles like juice, water, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise G",
      "helpful_votes": 4,
      "publication_date": 20190805
    },
    {
      "title": "Was for a gift.  Now going in garbage!",
      "text": "Just arrived, was going to use as a gift but the stainless steel handle is all scratched from the plastic strap that holds it to the packaging. Looked like it had been used. Not even worth my money to send back!!! Extremely disappointed !!!! Very poor packaging!! Should have zero stars!",
      "rating": 1.0,
      "verified": true,
      "author": "Gloria Svedahl",
      "helpful_votes": 3,
      "publication_date": 20190726
    },
    {
      "title": "THIS OPENER REALLY WORKS",
      "text": "I have had various jar openers over many years. I have never had a really good grip, but now with advanced age pain has become an additional factor. I am very happy to share that this jar opener works AND with the least amount of pain compared with other openers. I love it that when you tighten -using the turn handle- to the jar top that the opener holds its grip. In fact, you actually have to unwind a bit to release the top when finished. I hope this lasts a very, very long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Su",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Jar opener that really works. Bulky in size.",
      "text": "Sturdy jar opener that really works. I’ve tried other jar openers that scratched up the edge of the lids and spun before finally opening the jar. With this opener, you just tighten the three grippers with the handle on top, turn it, and the lid pops off. My only complaint is the large bulkiness of the opener. It would be hard to store if you were tight on space. I don’t know how they could remake it to be more compact yet have it work so well. I just put mine on the inside of an upper cabinet. I’m glad I finally found a jar opener that works.",
      "rating": 5.0,
      "verified": true,
      "author": "Palm tree",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Broke after a month.",
      "text": "I bought this a few months ago...as others stated, mine broke after a month and my wife couldn’t open jars. So, I bought a second opener..... it lasted about 6 weeks. I’m done with this cheap Chinese junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Charlie 3",
      "helpful_votes": 2,
      "publication_date": 20200126
    },
    {
      "title": "Definitely a winner for opening jars",
      "text": "This gripper really grips lids, and with the handle a lot of force can be applied to turn/remove the lids. I got it for my wife and she does not have the strongest hands due to some arthritis. She uses this griper just fine and has found it to be a game changer. I gave it five stars for 'easy to use' and for 'sturdiness', and four stars for 'easy to clean'. You do have to occasionally clean it, and to do a good job you need to clean it with the grips closed and then open.",
      "rating": 5.0,
      "verified": true,
      "author": "AhlJD",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Best jar opener ever!",
      "text": "I had been using a jar opener with metal teeth for years and would end up running warm water over lids since the V shaped metal grips just didn't work. This jar opener is fabulous. Just loosen or tighten the grips by twisting the handle, put it on the lid, screw to tighten and twist. This is the perfect opener for older folks and anyone who wants an easy way to open a jar lid. Wish I had found these years ago! Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Hiacynth Bouquet",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Does the job on every size of screw top.  Buy it.",
      "text": "Long overdue review. I reached a point last year where i couldn't grip jar screw top or get enough leverage well enough to unscrew it. I had to bring a screw top jar to my neighbor to open. This tool has been a godsend. When i first got it, i thought it was too clunky and unwieldy. But, then after using it on all sizes of jar screw tops -- very small to very large -- i couldn't live without it.",
      "rating": 5.0,
      "verified": true,
      "author": "ASAP-salem",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "GARBAGE!!",
      "text": "Just like another poster wrote: It doesn't work at all. Didn't know there was a time limit to return, this is garbage. DO NOT BUY! I expected much more from this company. Quality is GONE!",
      "rating": 1.0,
      "verified": true,
      "author": "tbard",
      "helpful_votes": 2,
      "publication_date": 20200118
    },
    {
      "title": "Product Broke",
      "text": "I have bad wrists - which is the reason I bought this product - and when tightening this morning around a lid, one of the pins broke on one of the three tighteners. With only two functioning tighteners, the product is not functional. I will probably order another but have a concern that if someone with bad wrists can over-tighten the unit and it brakes, it's probably not very sturdy.",
      "rating": 1.0,
      "verified": true,
      "author": "Bud",
      "helpful_votes": 3,
      "publication_date": 20190813
    },
    {
      "title": "Go electric instead",
      "text": "I have an old Black & Decker Lids Off jar opener and that thing is unstoppable. I bought this as a backup since my B&D is not replaceable. I don’t have arthritis issues - I have small hands and a weak grip. This thing works as long as you can maintain a strong grip on the base of the jar/bottle you’re opening. I couldn’t open salsa jars with it because I couldn’t grip the base of the jar hard enough to keep it stationary while turning the Rikon. I’d say if you have any significant hand/grip issues, this is not your solution. I’m going to continue looking for an electric jar opener instead.",
      "rating": 3.0,
      "verified": true,
      "author": "Zen Girl",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Not as useful as the company claims",
      "text": "This didn't open every can and jar quite as enthusiastically as the company claims. I'm pretty strong, and can open any can/jar I need -- usually without additional help like a rubber grip. But I've found that this product didn't give me any real additional assistance than a rubber grip pad did. You still have to have one hand on the handle, and then use your one remaining hand to hold the jar. That extra leverage just doesn't give as much as I'd hoped. I originally bought it for my mom (~60 y/o) that has arthritis, and it didn't do her a lick of good. So take their \"guarantee\" with a grain of salt.",
      "rating": 3.0,
      "verified": true,
      "author": "Matthew Kleinberg",
      "helpful_votes": 5,
      "publication_date": 20150713
    },
    {
      "title": "Disappointed. Design could use some work.",
      "text": "First one broken after a year. Second one lasted two months before it jumped the track. Still, I ordered another one because when it works it’s great for my 91 year old mother. Evidently product isn’t as advertised. They won’t replace it. Replace-by date was met.",
      "rating": 3.0,
      "verified": true,
      "author": "Ross Niinisto",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "It grips",
      "text": "The gripper grips. One must snug the grips up before use. Also one needs to realize one must hold the jar while rotating the handle. This may be an issue for some people since it still requires strength. Equal and opposite forces a physics thing. The grippers may mar the jar lid some from the force of loosening or gripping the lid. How long will it last may depend upon the tightenness of jar lids and how wide in diameter the lids are.",
      "rating": 4.0,
      "verified": true,
      "author": "spend thrift",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Like that it has adjustable clips for different sizes",
      "text": "Like that it has adjustable clips for different sizes, but a little problematic to turn when trying to hold bottom portion of container or jar, because the adjustable clips must also be held while turning so they don't loosen. Now if I had a third hand...",
      "rating": 3.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 3,
      "publication_date": 20180610
    },
    {
      "title": "Brilliant Device",
      "text": "I have some arthritis in my hands, so it can be difficult to open various jars and such. This thing works brilliantly. It's very flexible so it'll open something as narrow as a top to a ketchup bottle, to something as thick as a big wide jar. The only downside is that it takes up a lot of space. I believe I have 3 of these now (I keep them in different rooms).",
      "rating": 5.0,
      "verified": true,
      "author": "MovieGuyTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Great kitchen gadget, a must in any household.",
      "text": "This I the third one I’ve gotten, have given this as a gift, it is the best jar opener, bar none, that I have ever had and I’ve had a bunch. I have always had weak hands, years of carpo tunnel and arthritis have taken a tool. There are very few jars that have needed any extra assistance. I highly recommend this tool!",
      "rating": 5.0,
      "verified": true,
      "author": "annm",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Very Poorly Made",
      "text": "This worked great at first. It opened bottles and jars but it broke after only 2 weeks and I had to throw it away. Certainly not worth $15.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190113
    },
    {
      "title": "Great for small hands and/or loss of strength in hands.",
      "text": "This is a great product for those of us losing hand strength. Or those,like me, with a double whammy of freakishly small hands with loss of strength! Seriously, this works wonders for large and small jars & bottles. It works really well on those infernal small water bottles! Just tighten onto the lid, hold the jar, & \"turn\" (actually just slightly push the opener handle). . .like magic the seal breaks without any hard work or frustration. I've been using this for several months and it never failed to EASILY open anything. The best way to open is to turn the opener, NOT the jar or bottle being opened.",
      "rating": 5.0,
      "verified": true,
      "author": "N. L. O.",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Fine, but not great",
      "text": "Adjusts well to varying sizes and opens moderately tight closed jars. Amount of leverage opens some jars, but not all. Have had to get creative, like lying jar on its side, holding jar and hitting lever with something to get it to start moving the jar lid (which is not ideal for glass or contents that might spill).",
      "rating": 3.0,
      "verified": true,
      "author": "Chistine",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Wish I had this long before now!",
      "text": "Easy to use and works as advertised! Place on a jar lid, turn the top so the 3 grippers are snug on the sides of the lid and twist the big handle while holding the can/glass jar with the other hand - easy and nearly effortless! Highly recommend and would buy again - as a matter of fact, I did - bought one for my sister-in law!",
      "rating": 5.0,
      "verified": true,
      "author": "BWeb",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Helps a lot",
      "text": "Due to arthritus I was having more and more trouble opening bottles and jars. This really works. It can damage the lids in some cases as the metal teeth dig into the lid. Also can be a little difficult to adjust, especially with arthritic hands. Overall however it does get the job done and is a lifesaver.",
      "rating": 4.0,
      "verified": true,
      "author": "JRS",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Not a product as I envisioned",
      "text": "Not product worthy of Amazon. Too cumbersome and not as universal as other instruments. I will not respond to any other questions.",
      "rating": 1.0,
      "verified": true,
      "author": "EEF",
      "helpful_votes": 2,
      "publication_date": 20191007
    },
    {
      "title": "it does the job",
      "text": "I've done opening my botttles with this gadget. thing is, you need up line up the lid between the grips and then twist until tight, then turn the handle, and lid will come off. I had one with teeth that lasted for years before it broke that I really liked but this one works.",
      "rating": 4.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "... was using one of these and I saw how easy it was for her",
      "text": "My mother-in-law was using one of these and I saw how easy it was for her. She has arthritis in her hands and is in her 80s, so it's difficult for her to open jars. I purchased this and am not disappointed. It works very well. I would recommend it to anyone having difficulty opening jars.",
      "rating": 5.0,
      "verified": true,
      "author": "Becky J. West",
      "helpful_votes": 2,
      "publication_date": 20180916
    },
    {
      "title": "So easy to use and so practical",
      "text": "Up until now we were using the rubber on an old stethoscope to open jars! I can’t believe it took so long for me to discover this. It is so versatile as it works on small jars and large ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeudepalme",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Second One Inferior",
      "text": "My first one lasted at least five years and was great. This second one failed with my first attempt. I'm guessing the company is using a cheaper manufacturer. Big disappointment. I thought I had found a winner!",
      "rating": 1.0,
      "verified": true,
      "author": "foster",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "A must to have",
      "text": "This us a gadget that every kitchen needs. It works slick and easy with my crampy hands and tight lids. Going to buy another for my camping trailer.",
      "rating": 5.0,
      "verified": true,
      "author": "Grammy of 7",
      "helpful_votes": 2,
      "publication_date": 20190201
    },
    {
      "title": "less than two months it is broken.",
      "text": "Broken. opened it up to see if it was fixable, and the inside that does all the work is thin flimsy plastic. very disappointed. furthermore, I don't see how to contact the seller.",
      "rating": 1.0,
      "verified": true,
      "author": "deb o",
      "helpful_votes": 4,
      "publication_date": 20181023
    },
    {
      "title": "Best Ever Jar Opener",
      "text": "OMG this is the best bottle top opener from small ketchup to large pickle jars. Great for all ages and those with limited hand strength. I call it my \"don't need a guy in the kitchen machine.\" Just be sure you turn the clamp down tight, flat, and turn handle counter clockwise while holding the jar tight. I'm giving one to every one I know for Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry R",
      "helpful_votes": 2,
      "publication_date": 20180530
    },
    {
      "title": "Sturdy and easy to use",
      "text": "My wife loves it! And so do I because now she doesn't have to call me for every little or big jar she can't open. Gripper is durable, easy to use, and has quality build. Great product and recommended for almost everyone - don't have to struggle with extremely tight jars anymore",
      "rating": 5.0,
      "verified": true,
      "author": "Aku",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Great for arthritic hands",
      "text": "It is the best jar opener I have ever used. It fits so far every jar or bottle I had to open. I have given it as a gift to a friend that just had a shoulder operation and it was a huge success. I can really recommend this can opener",
      "rating": 5.0,
      "verified": true,
      "author": "AD",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "FRAGILE OPENER",
      "text": "This opener worked well until it was tightened by the twist knob and something snapped in the mechanism. after that it was useless. we had it a couple of months. if you buy it, don't over-tighten or it will break the spring.",
      "rating": 2.0,
      "verified": true,
      "author": "Montcalm",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Invaluable Opener",
      "text": "I only encountered one lid I could not open with this jar opener and it was a very large pickle jar with no ridges in its lid. Otherwise, I have found it so invaluable in the kitchen, that I bought another as a gift for my sister, and yet another to keep in our RV. I have rheumatoid arthritis in my wrists and hands, so have tried many other types of openers but always ended up asking my husband to open jars before I bought this gripper. Once it is in place on a lid, it takes very little effort to open the jar. What a lifesaver to have in the kitchen--everyone should have one.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20141019
    },
    {
      "title": "Excellent Kitchen Tool...",
      "text": "My wife used this for the first time about a week ago. She said that she couldn't believe how easy it was to use and that it truly works. This is coming from a woman who broke both wrists and fractured her arm about 2 years ago. She's always had to ask me to open jars as a result.",
      "rating": 5.0,
      "verified": true,
      "author": "bwdan2003",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Product short lived",
      "text": "We liked the product but it broke in about a months time. We were very disappointed as we had purchased another one elsewhere a couple of years ago. At least it lasted that long. This one didn't last very long at all. We use it every day.",
      "rating": 1.0,
      "verified": true,
      "author": "Barbara VanBuren",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Amazing lid opener, makes it so easy to work",
      "text": "I got 2 of the openers 1 for my mom and 1 for me. There super easy to use, me and my 74 year old mom have osteo arthritis and we can't grip the plastic water bottles or jar lids and these have \"NO \" problems with this taking the lids off, those Zero Vitamin Waters were so hard to open but this makes it so easy to use 👍👍👍👍👍",
      "rating": 5.0,
      "verified": true,
      "author": "John Mc...",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Kuhn Rikon The Gripper Jar Opener",
      "text": "If you have a problem with opening jars in the kitchen then you probably need one of these. It’s adjustable so it will fit different sized tops. Easy to use and small enough so it doesn’t take up a lot of space when storing.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy225",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Must have for Every Kitchen",
      "text": "This product is absolutely fantastic. Works great on a wide-range of product lids: 1\" to 3\" diameter. This means you can use it to open your sparkling water bottle twist-off top or your favorite jam lid! This is not meant to open soda/beer bottle style tops. My wife arthritis, and I have Carpal Tunnel so opening jars is becoming increasingly difficult, so this has been a true gift of simple technology.",
      "rating": 5.0,
      "verified": true,
      "author": "Felipe Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Didn't last",
      "text": "Very pleased when first received due to arthritic hands. Used about 12-15 times before it stopped retracting to fit lid correctly in order to open glass jars. I'm tossing after trying to repair",
      "rating": 2.0,
      "verified": true,
      "author": "Book Queen",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Really helpful for arthritic hands",
      "text": "After reading all the positive reviews on this jar opener, I decided to give it a try. I'm so glad I did. This absolutely saves me every morning. I have arthritis in my hands, and they are particularly stiff & sore in the morning while preparing my breakfast. Seems like everything requires a twist of the hands; opening the bottle of juice, the vitamin jar, the soy milk container... now I can use this gripper opener, with absolutely NO STRESS TO MY HANDS. It closes down really small for little lids too. What a great gadget!",
      "rating": 5.0,
      "verified": true,
      "author": "Robin R",
      "helpful_votes": 4,
      "publication_date": 20140728
    },
    {
      "title": "A must to own",
      "text": "I have been looking forward to buying a new gripper. My other gripper is at least 15 years old. I was thrilled to find this Kuhn Rikon looking for something else. I use this gripper many times a week. I'm thinking about giving this gripper to each member of our family, AAA+++",
      "rating": 5.0,
      "verified": true,
      "author": "dj",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "doesn't help me.. was a waste of money",
      "text": "very disappointed in this & it wasn't cheap... it only grips the lid & leaves you to try to keep jar stationary,but as you know that is not always possible. I bought it to help open jars, etc. but am using my strength keeping & turning this thing on the lid while still trying to grip the container... and it ain't happenin'",
      "rating": 1.0,
      "verified": true,
      "author": "EJG",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "So happy to be able to open jars on my own again.",
      "text": "I loved this. I have RA so have been buying “helpers” from assist with my daily tasks in the kitchen. This opener and others help me get back to cooking for my family. My favorite pass time.",
      "rating": 5.0,
      "verified": true,
      "author": "Isabel Alduen",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "It really works!",
      "text": "I was a little warry that this would be like so many I have purchased in the past, however it worked the first time I tried it! Love this dandy little helper for my poor hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Irma",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Great for old hands",
      "text": "It really helps to open bottles and jars. I have arthritis and this really helps take the pain out of opening tough to open jars and bottles. I would recommend this to anyone that has trouble opening tough caps.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray Russell",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "A must have in every kitchen!!!!",
      "text": "This is the BEST jar opener ever made!!!! I have arthritis in the base of my left hand and this jar opener allows me to never struggle to open a jar again. It makes a great gift for you to give to anyone that has to open a jar.",
      "rating": 5.0,
      "verified": true,
      "author": "M. T. Duffy",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Good Opener.",
      "text": "Got it for my wife who has trouble opening jars. It's getting harder for me as well. This opener has made it easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Mick Gregory",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "3 Stars",
      "text": "This works about as good as any of these devices work, but you still need a really good grip and strength in your hands to make it work. Not good for the elderly for sure.",
      "rating": 3.0,
      "verified": true,
      "author": "MonkeyB",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "A Winner!",
      "text": "I had a different but also well-rated opener that didn't make opening Vitamin H20 Zero bottles easy but was better than nothing. (For some reason those are incredibly tightly sealed.) I bought this one hoping for an improvement, and WOW, what a difference!! I LOVE THIS OPENER & HIGHLY RECOMMEND IT!!",
      "rating": 5.0,
      "verified": true,
      "author": "Zalea",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Exuberant at first......then this happened",
      "text": "I used one of these openers at work and just had to have one. I have a weak grip. I purchased this jar opener which I absolutely love. The problem is that it broke after a couple of dozen uses; thus, my two-star overall rating. One of the grippers on the underside came loose and no longer moves with the turn of the handle or grips the jars or bottles. I am truly disappointed. I really don't want to spend the money on another one. Kuhn Rikon is normally synonymous with quality....not this time.",
      "rating": 2.0,
      "verified": true,
      "author": "Kathleen F.",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Easy to use, requires little effort",
      "text": "I bought this a few weeks ago because I got tired of being near tears trying to open a jar which has been painful for years because of arthritis but didn't want to write a review until I had a chance to try it on \"The dreaded Pickle Jar\". It worked perfectly! This product is very easy to adjust to different jar sizes and requires little effort to open. Highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ohnina5",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Finally, I can open jars!",
      "text": "A friend recommended this jar opener. I previously had one that had 2 handles and you had to squeeze and turn. I could no longer use it. This one with 1 handle and flexible easy to use size adjustments is perfect+",
      "rating": 5.0,
      "verified": true,
      "author": "Nicknamejim",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "It broke on second use!",
      "text": "I used this ONCE, and it worked great. The second time I used it, it no longer worked correctly. Unfortunately, I guess, it was more than 30 days from my order date because there’s no return option. VERY DISAPPOINTING.",
      "rating": 2.0,
      "verified": true,
      "author": "fishpondgirl",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "If you are arthritic like me you need this!",
      "text": "My only issue with this product is that now it has the metal grips, I used it to open up my metal coffee cup and it scratched it. So, to alleviate that issue, I just put a paper towel over top the coffee top and it works perfectly. Absolutely absolutely absolutely need! Especially with arthritis in my wrist.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Porter-Nichols",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "This works great!",
      "text": "My husband and I were having mor trouble opening some jars. I got this and it works great. We’ve only had it a short time, but I am so impressed by how easy it is to use. Even our granddaughter can open new jars by herself! I highly recommend this opener!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Insufficient grip, cheap plastic breaks.",
      "text": "Cheap plastic junk. Does not grip stubborn lids tight enough to turn them, and any attempt to tighten the grippers enough to get a purchase on the lid breaks the mechanism so it will never close again. Bought two, both broke within a couple of weeks. Possibly useful for older people with weak grips to get leverage to open ordinary lids, but completely useless for opening anything remotely tight because it will break before holding tight enough for anything that's cinched down tight enough to need this tool in the first place.",
      "rating": 2.0,
      "verified": true,
      "author": "EN in Austin",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Easy of use. Not good",
      "text": "I bought because of my weak wrists and I can't use it. It works to hard.",
      "rating": 3.0,
      "verified": true,
      "author": "janie",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Idt opens some jars relatively easily and others not so much",
      "text": "Idt opens some jars relatively easily and others not so much. I haven't had too many opportunities to use it lately. So far, it's working on most caps. I have a steel opener that works as well. The problem is that the jars need to be anchored at the bottom so they don't twist, but that's not the fault of any opener, just something that's needed and doesn't seem to be available yet.",
      "rating": 4.0,
      "verified": true,
      "author": "raven65",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Didn’t last",
      "text": "Had this for 2 1/2 months and the return “window” had expired and of course it broke. Two of the three grippers tabs wouldn’t retract all the way. Am ordering another because it’s actually a great opener. Hoping the second one lasts longer.",
      "rating": 1.0,
      "verified": true,
      "author": "Doug Proudlock",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Works well, as described",
      "text": "I bought one and thought it was unique. I bought the second as a gift",
      "rating": 5.0,
      "verified": true,
      "author": "dano03",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Saved my wrists",
      "text": "I use this every day. Works great for vitamin water bottles and even jars. My husband is happy that I don’t have to ask him to open things for me as much anymore, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Vasana",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Grips holds removed lids",
      "text": "Firm steady grip on lid holds well when carefully used as directed. Long leverage arm ensures more than enough twist to remove all lids.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Miller",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Broke within 2 months",
      "text": "We had the same item that lasted 2 years before it broke. This one barely made 2 months and there is no option to return.",
      "rating": 1.0,
      "verified": true,
      "author": "tango",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Better than I expected.",
      "text": "I am at the age my wrists are losing strength. I love this opener as it fits so many size lids. It is easy to use. I am very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Net shopper",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Easy to use!",
      "text": "Opened my pickle jar effortlessly! I haven’t been able to open jars for over a year due to arthritis! This product is excellent! I wish I had seen it a year ago! Excellent product and would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda S.",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Great for carpal tunnel",
      "text": "This is the best jar opener I've ever owned. It is very easy to use (I have carpal tunnel) and is also sturdy. I've used it for several years and it works on a variety of lid materials and sizes. Couldn't do without it.",
      "rating": 5.0,
      "verified": true,
      "author": "LBeau",
      "helpful_votes": 2,
      "publication_date": 20170620
    },
    {
      "title": "Works!",
      "text": "This works!!!! After years of use my trusty Oxo jar opener fell apart and I bought a replacement one, which turned out to be totally worthless. I read the reviews of the Kuhn Rikon on Amazon and I thought I would give it a try. It works flawlessly. I cannot live without it.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara S",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Best damn jar opener EVER",
      "text": "Have tried other openers. Most were useless. This is the first opener that worked perfectly. Easy to use and opens any size bottle or jar. Love this opener.",
      "rating": 5.0,
      "verified": true,
      "author": "CarisD",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Effortless opener!",
      "text": "Excellent product! We like our so much we purchased several more as gifts. Truly opens any size bottle/jar! The smallest screw top to the largest jar are a snap to open.",
      "rating": 5.0,
      "verified": true,
      "author": "Gardening Granna",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "It works BUT...",
      "text": "It works great for opening jars but with my sore hands I have trouble holding on to the jar while I'm twisting it with the opener",
      "rating": 5.0,
      "verified": true,
      "author": "Seann",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Get a grip!",
      "text": "A life saver! I used to be able to get away with using rubber \"gripper\" style, flexible jar openers, but no more. Arthritis and joint ailments have made opening new jar of anything a painful challenge. NO more! This thing is amazing: Adjustable to almost any size jar or bottle, from wide (peanut butter) containers to small (soft drink) bottles, it works for them all. GREAT for anyone with painful hands or \"grip\" problems. I keep it handy and use it daily.",
      "rating": 5.0,
      "verified": true,
      "author": "Joy S. Johnson",
      "helpful_votes": 0,
      "publication_date": 20160315
    },
    {
      "title": "Gripper Opener",
      "text": "My wife loves this. She has opened pickle jars and other types with ease. She has only had this since Christmas 2019 but so far would highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "JP Tennessee",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "works well with small arthritic hands",
      "text": "I love this opener. We've tried others that were too big when used with large jars and they ended up breaking. This is truly the best",
      "rating": 5.0,
      "verified": true,
      "author": "Susan A. Winters",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Great for opening jars",
      "text": "Whether you have strong hands or not...jars can be hard to open--this gadget is very effective. That said, older version with more metal was better.",
      "rating": 5.0,
      "verified": true,
      "author": "bp",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "does not fit canning jars",
      "text": "wouldn't open a canning jar seems a little flimsy but will keep as i haven't used it much",
      "rating": 3.0,
      "verified": true,
      "author": "WWII Gamer",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Love it. Works first time",
      "text": "was afraid my kids misplaced my opener. I couldn't find this in any story and just happened across it on line. Love it. Works first time, every time. Great gift for seniors. I just didn't want to be without it, so this one is my back-up opener!",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Blumenfeld",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Broke on first use",
      "text": "The product is a bit flimsy. For the very specific use I had bought this for I thought I had to really crank down on the grip and it broke. Perhaps I was a bit too tough on it, but perhaps they should at least had a warning or more clear message on usage.",
      "rating": 1.0,
      "verified": true,
      "author": "Philip W.",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Reliable opener, slightly flimsy",
      "text": "Good jar opener. The construction of the opener is mainly plastic and it doesn't feel extremely secure at first but it seems to do the job well and hasn't failed since so I guess the plastic construction doesn't really matter.",
      "rating": 5.0,
      "verified": true,
      "author": "one",
      "helpful_votes": 2,
      "publication_date": 20170514
    },
    {
      "title": "Great product for older people to use.",
      "text": "Able to use on jars and bottles of all sizes. I like the fact that it has a handle for leverage to open the item.",
      "rating": 5.0,
      "verified": true,
      "author": "CLB",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "It's very easy to use",
      "text": "Works beautifully. I live alone so I'm using this jar opener all the time. No problems at all. I recommend this for all women.",
      "rating": 5.0,
      "verified": true,
      "author": "Roseann Floyd",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Works with ease",
      "text": "Once you get the hang of attaching to bottle/ jar and and making the twisting motion it works very well. Even opens those pesky small tonic bottle tops. Got one for Mom too and she uses it.. sometimes needs reminding on how to attach and twist. (80 yrs old)",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Works perfectly!",
      "text": "It only takes a couple seconds to screw it down and turn the handle. It's so nice not to fight jars and feel pain in my hands! I love this thing!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Great tool to open jars",
      "text": "I've purchased a number of these to give as gifts to those who have trouble opening jars. A couple of times with really hard-to-open jars, one of us has held the jar steady on the counter and another has opened it. It always works.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol W.",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Easy twist",
      "text": "This jar opener helps me a lot . It is adjustable , easy to use , grip is good and easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Roberto Garcia",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Best jar/bottle opener I have found",
      "text": "I have tried many openers, but was never interested in one that required batteries. This is probably the most expensive one I have purchased, but I own several Kuhn Rikon products and have found them all to be exceptional, so I decided to risk it in spite of the price. You do not have to (and probably shouldn't) screw it onto the jar very tight, and I was amazed by how it opens the jar or bottle with very little effort. This one is definitely a winner.",
      "rating": 5.0,
      "verified": true,
      "author": "P. J. Hartman",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Easy to use",
      "text": "I would purchase this tool again. Easy to use, light weight, and fast shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "Malia",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "You still need good hand/arm strength",
      "text": "I ended up getting the battery one...this one still requires quite a bit of torque to open a jar.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Good",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Opens almost all jars",
      "text": "I use it to open all kinds of jars. Without it, I don't know if I could open the jars. Like the type, you get in stores. Food, like pickles, jams, any type of jar that twist off.",
      "rating": 5.0,
      "verified": true,
      "author": "Deba",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Good but not a total savior",
      "text": "Does not work on all jars. Had a resistant pasta sauce jar that the Kuhn Rikon could not budge. Ended up with a Black and Decker doing the job. So: the Kuhn Rikon is not a universal panacea.",
      "rating": 4.0,
      "verified": true,
      "author": "Gerard J Rauluk",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "It has a nice ninja grip on the jar, all you need to do is twist.",
      "text": "The tool is well done and it works as advertised. So far it has helped me and other members in the family to open stubborn jars. I had seen a similar item in France that an older relative used, and I loved it. This was the only one of this type I could find on Amazon. I bought it last year (2018), the price hasn't changed much and it was sold directly from Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Mireya Cortel",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Great for opening any size bottle.",
      "text": "I love these openers. Bought previously from a shopping channel at a higher price. Happy I saved some money on this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Marleespal",
      "helpful_votes": 0,
      "publication_date": 20191120
    }
  ],
  "product_meta": {
    "title": "Kuhn Rikon Strain-Free Gripper Opener for Jars and Bottles, 10 x 5 x 2.25 inches, White",
    "description": "Color:WhiteSay goodbye to the struggle and strain of opening stubborn jars and bottles thanks to the Swiss-designed Gripper Jar Opener from Kuhn Rikon. The adjustable mechanism locks securely onto lids and caps (and won’t let go!) via a clockwise turn of the front-facing knob. Lids are then released by twisting the opener in the opposite direction. As well as being extremely easy to use, the device is also highly versatile: it will remove any lid or cap between 1 and 3.5 inches in diameter and is suitable for threaded, smooth-sided and grooved jars/caps.",
    "rating": 4.5,
    "feature_bullets": [
      "Designed to eliminate the struggle and strain of opening household jars and bottles",
      "Locks securely onto lids via 3 sets of steel jaws/teeth (attaches by a simple clockwise motion; releases by twisting in the opposite direction) - watch the video to see the opener in action",
      "Adjustable mechanism will remove any lid or cap between 1 and 3.5 inches in diameter and is suitable for a wide variety of jars/caps - threaded, smooth-sided and grooved",
      "Long handle provides extra leverage for stubborn lids, including vacuum seals (opener is ideal for those with limited strength/mobility in their hands and/or wrists)",
      "Easy to clean and store: wipe with a damp cloth (not dishwasher safe) and keep within kitchen drawers or utensil pots (can also be hung via a hole within the handle)"
    ],
    "specifications": {
      "Product Dimensions": "12 x 6 x 2 inches",
      "Item Weight": "4.9 ounces",
      "Manufacturer": "Kuhn Rikon",
      "ASIN": "B000CO256G",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "Strain-Free",
      "Customer Reviews": "4.5 out of 5 stars1,997 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#4,827 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 4, 2003"
    },
    "categories": [
      "Home & Kitchen",
      "Can Openers",
      "Kitchen Utensils & Gadgets",
      "Kitchen & Dining"
    ],
    "price": 13.59
  }
}