{
  "website_summaries": [
    {
      "verdict": "A simple stainless steel cooler that uses freezer inserts to chill wine.",
      "pros": [
        "Sleek stainless steel chiller comes with a total of four inserts, which gives users some control over the temperature of their wine",
        "Inserts can be housed in the fridge or freezer",
        "Capable of keeping wine cooled for up to six hours"
      ],
      "cons": [
        "Exterior easily dents and the freezer inserts harden unevenly so they are tough to re-insert"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "America's Test Kitchen Winner!!!",
      "text": "The recommendations from the PBS show America's Test Kitchen have not let me down yet and I love that you can always find the products on Amazon. Their tests show that wine only lost 10° after 7 hours. I only keep a bottle in it during dinner for about an hour and it stays refrigerator cold. The inserts are thin, freeze quickly, and take little space in the freezer so I store them there. The bottle also stays dry and messless vs ice. Well made and looks great as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 13,
      "publication_date": 20190410
    },
    {
      "title": "A Great Wine Cooler",
      "text": "We were pleasantly surprised and pleased with this wine cooler. First, It is quite attractive in a combination of polished and brushed stainless. The four frozen panels were removed from the freezer in the quart Ziploc bag I had placed them in for ease use. They slice into slots at the bottom of the cooler to form a circle. The liner is now inserted to cover them and soon it becomes quite chilled. Now it is ready for the wine. We were so happy to have a perfectly dry wine bottle, as those in ice are always so messy. The cooler keeps wine cool for several hours. We could ask nothing extra from this fine product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kent R. Clark",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "If you're just trying to keep a bottle chilled while you drink it, this is a great solution.",
      "text": "Love this cooler, I built this cooler into an end-table to keep my Sake cool. it does a great job of maintaining temperature for the one or two hours it takes to finish the bottle. Clearly I'm not demanding much of it but under those circumstances it excels. It works much better than the old cooler with ice that I used to use, no need to keep a towel handy to dry off the bottle for every pour, no mess, no fuss. So for those of you just trying to maintain the temperature of a bottle of wine while you drink it, this is a great solution.",
      "rating": 5.0,
      "verified": true,
      "author": "LancetheUglyAndrogyne",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Really works!",
      "text": "Works exactly as described. Very pleased to have read about the Oggi Wine Cooler in Cooks Illustrated. To earn my 5-stars it would have to be more attractive (a little classier).",
      "rating": 4.0,
      "verified": true,
      "author": "Huck's Mom",
      "helpful_votes": 7,
      "publication_date": 20170822
    },
    {
      "title": "Top-rated by America's Test Kitchen",
      "text": "Top-rated by America's Test Kitchen. This was a gift for a friend, and she loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Books633",
      "helpful_votes": 4,
      "publication_date": 20170721
    },
    {
      "title": "Great especially with limited freezer space",
      "text": "Large diameter fits even larger wine bottles. Inserts are perfect when you have limited freezer space as they take up minimal space and then slip into the canister and are covered by the black plastic liner insert. As for things to watch for...some other brands have too small a diameter for large bottles...and some have a cheesy plastic bag-like liner the bottle has to slide into...not a classy look AND didn't fit the larger bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "T-bird",
      "helpful_votes": 4,
      "publication_date": 20141208
    },
    {
      "title": "Sharp edge. Rethink this purchase.",
      "text": "Given all the positive comments in the reviews, I ordered one. I was very surprised to find the inner edge of the lid area to be extremely sharp. It’s a pity since otherwise it looked great. The sharp edge however is a real concern as anyone handling this without much thought could end up when a nasty finger cut. I hope the makers fix this apparent flaw and post online that this shortcoming to an otherwise solid product has been fixed...",
      "rating": 2.0,
      "verified": true,
      "author": "Sanggyun Ahn",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Nice looking easy to use",
      "text": "Most wine coolers fall short on remaining cool on the table. This one stays nice and cold with the frozen inserts. It is really wide however and the wine bottle sits in the middle and doesn't really get the chill from the inserts.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Elegant and effective",
      "text": "What is nicer than an ice cool glass of chardonnay on a summer's evening. This well-designed cooler is easy to use and keeps white wine at the right temperature until the last drop. Forget other solutions - this one is ideal.",
      "rating": 5.0,
      "verified": true,
      "author": "John Campbell",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Best Wine Chiller",
      "text": "As good as ATK proclaims. Freeze the black inner tube and the 4 insets and your wine will remain cold. If you take a room temp bottle and place it in the tub, it will take about an hour or so before it chills the wine. No water dripping everywhere. Perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Vinh Q. Nguyen",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "It Works!!",
      "text": "These are a great gift only after you ourchase at least one for yourself! pretty look at and tgey keep your bottle of wine cold!",
      "rating": 5.0,
      "verified": true,
      "author": "P. Ruzich",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Works Great for Parties",
      "text": "I have owned a similar no-name wine cooler for about 15 years and have been looking for another one just like it. I was so happy to see America's Test Kitchen name this wine cooler their favorite. I now own two of them and they work great for keeping wine cool on the countertop or dinner table during parties. The smooth stainless steel edge gives it a touch of class.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary V",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Great value",
      "text": "I've been looking for a wine cooler like this for some time. It's easy to use and very effective.",
      "rating": 5.0,
      "verified": true,
      "author": "Beljumking",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Great gift, too.",
      "text": "Very happy with product. Keeps wine cold. Looks smart. Cold packs are small so fit in freezer. Sure beats having to use ice cubes!",
      "rating": 5.0,
      "verified": true,
      "author": "me",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Works great!",
      "text": "I have had a number of wine coolers and this one works the best by far. It keeps your wine cold for hours and you only need to store the ice packs in the freezer, saving lots of space.",
      "rating": 5.0,
      "verified": true,
      "author": "DanB",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Keeps temperature for hours",
      "text": "We saw this item on product review on Cook's Country and it was the resounding top choice for wine coolers. I purchased one immediately. It holds the temperature for hours (within 10 degrees for 7 hours according to Cook's Country, an who can't drink a bottle of wine in 7 hours). It's nice looking and easy to clean. A perfect friend gift, and don't forget to get one for yourself.",
      "rating": 5.0,
      "verified": true,
      "author": "MikeG",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Looks fine when ice packets are not frozen.",
      "text": "Works fine. But when you put the ice packets in the outside stainless steel immediately condensates. Honestly, I should have realized this when when looking at it due to the thin gauge metal.",
      "rating": 3.0,
      "verified": true,
      "author": "Vine",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Great wine cooler",
      "text": "This is just what i wanted. It cools wine and is easy to use. Works best if wine is already chilled.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelby",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Great unique gift!",
      "text": "Gave it as a gift. Recipient LOVED it. They are real wine drinkers. And they use it whenever they have company. Solved my holiday gift-giving needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Rivie B.",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Very nice product. And it arrived two days later",
      "text": "Very nice product. And it arrived two days later, the exact time I needed them for a party I was hosting. Good job.",
      "rating": 4.0,
      "verified": true,
      "author": "JohnFrancisX",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Best Wine cooler per America’s Test Kitchen.",
      "text": "Bought two as gifts. It was chosen as best wine cooler by America’s Test Kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Lackey",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Best wine cooler ever",
      "text": "Nice sleek and professional design perfect for any home or occasion. High quality product that keeps entire wine bottle chilled and for plenty of time - just long enough that you do not have to worry over it during a party.",
      "rating": 5.0,
      "verified": true,
      "author": "R Moore",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Best!! As shown on America's Test Kitchen",
      "text": "This is the one that keeps your White Wine Cold for a long time. Best !! As shown on America's Test Kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "rockytop",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Make sure you keep the packs in the freezer when not in use",
      "text": "Works so well. Keeps wine cool for hours...if it lasts that long",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Gee",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Perfet Gift for the wine lover!",
      "text": "The wine cooler was a gift for my sister in law and she loves it......",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Rouse",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "Plastic cracked on freezer pack after a year",
      "text": "Had this less than a year and really enjoyed it. Recently, however, one of the freezer packs cracked and leaked. There is no way to buy a replacement and no way to contact Oggi for a warranty.",
      "rating": 1.0,
      "verified": true,
      "author": "B. SILVA",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Accommodates all sizes of wine bottles. Chill lasts for a long time.",
      "text": "Works exactly as advertised. Would give as gift for any white wine drinker. Also accommodates champagne.",
      "rating": 5.0,
      "verified": true,
      "author": "MaggieB",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Keeps wine cool without dripping water",
      "text": "Works as advertised for standard wine bottles, keeping bottles cool without dripping water from melted ice as in a traditional ice bucket. The stainless is nicely brush finished and is a solid medium gauge material. Some Champagne and similar larger diameter bottles may not fit in the Oggi.",
      "rating": 5.0,
      "verified": true,
      "author": "HJC",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "... seeing it on America's Test Kitchen and am completely satisfied with it's performance",
      "text": "Purchased this after seeing it on America's Test Kitchen and am completely satisfied with it's performance. The exterior scratches if you aren't careful in handling it though.",
      "rating": 4.0,
      "verified": true,
      "author": "cheryl whittaker",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Very pleased",
      "text": "My son-in-law was very pleased with it as a Christmas gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Keeps wine cool well through a meal",
      "text": "Attractive and functional. Keeps wine cool well through a meal.",
      "rating": 5.0,
      "verified": true,
      "author": "Cape2",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Works Like A Charm!",
      "text": "I've only owned this wine cooler for two weeks, and it's already my favorite wine accessory. It looks classy and there's absolutely no condensation on the bottle. It can hold wine, champagne, and even oversized bottles--and it REALLY keeps your wine at the perfect serving temperature: red or white. I just love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael B.",
      "helpful_votes": 3,
      "publication_date": 20130912
    },
    {
      "title": "OGGI Wine Cooler - Just What I Wanted",
      "text": "This is exactly what I was looking for; something to keep the wine cool out on the deck. No longer need to walk in the house and get the wine out of the fridge. Thanks",
      "rating": 4.0,
      "verified": true,
      "author": "Carl S.",
      "helpful_votes": 13,
      "publication_date": 20100919
    },
    {
      "title": "Great gift for wine enthusiasts",
      "text": "I love this ice bucket. Omg where has it been all of my adult life. Lol",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Haven’t used yet",
      "text": "I will use for occasion but I haven’t tried yet. If it will keep the wine like what it says on description.",
      "rating": 5.0,
      "verified": true,
      "author": "E. W",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Affordable wine cooler that delivers as promised",
      "text": "Great product delivers on all aspects. Keeps wine chilled great for patio use no ice required plus it’s affordable",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Five Stars",
      "text": "A nice product for wine lovers who transport bottles to parties, or gatherings",
      "rating": 5.0,
      "verified": true,
      "author": "josie Durand",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "gift",
      "text": "this was a gift for my brother says he loves it and works well. He drinks a lot of wine so this was the perfect gift for him",
      "rating": 5.0,
      "verified": true,
      "author": "ll",
      "helpful_votes": 0,
      "publication_date": 20140218
    },
    {
      "title": "Inserts are easy to freeze in my freezer",
      "text": "Inserts are easy to freeze in my freezer. They fit perfectly in the canister and keep my wine chilled from first drop to last. Looks nice too!",
      "rating": 5.0,
      "verified": true,
      "author": "Christy Rawls-Gelert",
      "helpful_votes": 0,
      "publication_date": 20140727
    },
    {
      "title": "Cool Wine Cooler",
      "text": "Ingenious wine cooler that keeps white wine cold all night long. Contemporary, clean design that looks nice on any bar or dining table. This replaces an old plastic one with freezer inserts that I bought years ago but could never find again in stores...except it's even better, because of the metal exterior.",
      "rating": 5.0,
      "verified": true,
      "author": "DayHay",
      "helpful_votes": 0,
      "publication_date": 20150425
    },
    {
      "title": "Perfect to Parties",
      "text": "I used it at the bar so people could serve themselves and later on the table for dinner and as advertised it kept the wine nice and cold with no mess",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 2,
      "publication_date": 20130615
    },
    {
      "title": "Durable",
      "text": "Easy to use and they keep the wine cool for hours!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa C",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "work great but watch the sweat",
      "text": "Bought one and then three more as gifts. Only issue is they sweat a ton. Almost ruined a good table",
      "rating": 5.0,
      "verified": true,
      "author": "WTK00",
      "helpful_votes": 0,
      "publication_date": 20140829
    },
    {
      "title": "Perfect for the pool",
      "text": "This thing is perfect for a bottle of vino at the pool....highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "BKBroiler",
      "helpful_votes": 0,
      "publication_date": 20140710
    },
    {
      "title": "Does the job....",
      "text": "Does the job but I've had a better one before unfortunately they don't have here Amazon.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160518
    },
    {
      "title": "Salud!",
      "text": "I didn't buy this for myself, but the recipient loves it. If I drank wine and entertained more, I would want at least 3 of these.",
      "rating": 5.0,
      "verified": true,
      "author": "BARBARA G.",
      "helpful_votes": 0,
      "publication_date": 20150215
    },
    {
      "title": "Five Stars",
      "text": "Love this wine cooler, really nice in hot FL weather",
      "rating": 5.0,
      "verified": true,
      "author": "nanadi",
      "helpful_votes": 0,
      "publication_date": 20140710
    },
    {
      "title": "Four Stars",
      "text": "Great for keeping white wine cool, especially in our warm Florida climate.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas S. Johnson",
      "helpful_votes": 0,
      "publication_date": 20141112
    },
    {
      "title": "Love it!",
      "text": "love the inserts. Great idea and fits perfectly in the cooler. Works really well and kept the wine nicely chilled.",
      "rating": 5.0,
      "verified": true,
      "author": "crissy",
      "helpful_votes": 3,
      "publication_date": 20130606
    },
    {
      "title": "Great for keeping wine chilled and it looks great, too!",
      "text": "We use two of these at our B&B and love them. They keep wine cool for hours and hours. Looks great, too!",
      "rating": 5.0,
      "verified": true,
      "author": "Cottage Linda",
      "helpful_votes": 2,
      "publication_date": 20130710
    },
    {
      "title": "Not a good choice when there are other things out there that ...",
      "text": "If this weren't such a puzzle to put together it might be more functional and useable. Also, it only holds the 750 size bottles. Not a good choice when there are other things out there that are much easier to use that provide the same or better cooling.",
      "rating": 2.0,
      "verified": true,
      "author": "QMarsha",
      "helpful_votes": 0,
      "publication_date": 20150506
    },
    {
      "title": "Five Stars",
      "text": "fits bottles of all shapes and sizes. exactly what we wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "Best wine cooler we've used",
      "text": "Best wine cooler we've used, and we've used our share of them over the years. Might not travel as well as others, but this is our go to wine cooler.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Hutchinson",
      "helpful_votes": 2,
      "publication_date": 20171014
    },
    {
      "title": "Two Stars",
      "text": "Not sure how practical this is. Does not fit very well.",
      "rating": 2.0,
      "verified": true,
      "author": "nee",
      "helpful_votes": 0,
      "publication_date": 20140913
    },
    {
      "title": "Very nice product",
      "text": "I bought this product as a gift and the person that received it liked it a lot. It is very nice, and I was very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "MARIA C.",
      "helpful_votes": 0,
      "publication_date": 20130105
    },
    {
      "title": "Haven't used it yet, but looks great!",
      "text": "We have yet to chill our wine in this, but I will be sure to update when we do. Can't wait for warm weather so we can use it on the deck!",
      "rating": 4.0,
      "verified": true,
      "author": "McRita11",
      "helpful_votes": 0,
      "publication_date": 20140203
    },
    {
      "title": "The Best Wine Cooler",
      "text": "An amazing product that really does the job. the instructions say to put the inserts in the refrigerator but they should go into the freezer. The bottle sits in the cooler with a face between the inner wall and the bottle (the bottle does not make contact with the cold surface of the inner basket) but it seems to work very well. I bought it on the recommendation of America's Test Kitchen and as usual they found an amazing product I probably would not have found on my own.",
      "rating": 5.0,
      "verified": true,
      "author": "Basileus",
      "helpful_votes": 8,
      "publication_date": 20170718
    },
    {
      "title": "Five Stars",
      "text": "Great product, my husband loves it. My husband found you need to lay the freezer inserts flat on top each other in the freezer. He was leaning them against the rail on the freezer door and they were getting 'bumps\" on the inter surface and you couldn't slide the black plastic bottle holder in between the inserts. I hope I explained that ok lol",
      "rating": 5.0,
      "verified": true,
      "author": "C. Chandler",
      "helpful_votes": 4,
      "publication_date": 20171127
    },
    {
      "title": "Truly Effective Wine Chiller",
      "text": "It works perfectly if you, 1) keep entire unit in freezer 2) when ready to use, add 3 to 4 inches of water to can just before inserting wine bottle. It will chill for 6 to 7 hours. Great invention.",
      "rating": 5.0,
      "verified": true,
      "author": "shrinkucci",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Super!",
      "text": "It is a compact cooler, just perfect for a bottle of wine. It is a simple process to chill the liners, insert them into the container and then add the wine bottle. It does keep the wine chilled for at least 5 hours. We were so pleased that we got a second one.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean Ann",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "No puddles.",
      "text": "ATK recommend this wine cooler and it doesn't disappoint. It keep the white wine chilled and doesn't put condensation on the table. Amazing design. The ice packs are genius, but the spacer below the bottle keeps the table clear of condensation. I recommend and it's a great price point for gift giving.",
      "rating": 5.0,
      "verified": true,
      "author": "Sernity",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Meh...",
      "text": "We didn’t think it really got very cold. And got warm very quickly. Good idea, but poorly made. Returned.",
      "rating": 2.0,
      "verified": true,
      "author": "Bebes papa",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Cold on demand",
      "text": "Works perfectly. I had a similar product many years ago. It broke. This is a really nice replacement.",
      "rating": 5.0,
      "verified": true,
      "author": "BARBOUZE",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Works well",
      "text": "Goes together very easily and works as described. Wish I had purchased it years ago!",
      "rating": 5.0,
      "verified": true,
      "author": "4annie",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Superb white wine cooler",
      "text": "Love this wine cooler - so easy to use and it works!! Have given as gifts and people want to know where I got it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Works great and looks nice!",
      "text": "Works great and looks nice. Got lots of compliments on it so far.",
      "rating": 5.0,
      "verified": true,
      "author": "sullivac",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "... review about this product that said it was the best wine cooler",
      "text": "I read a review about this product that said it was the best wine cooler. And it is! It works super fast and is attractive. Keeps wine at the perfect temperature for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Guilloton",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Five Stars",
      "text": "Very attractive and works VERY well. Wine stays perfectly chilled even outside for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "L. A. Hildebrant",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Great item, works great",
      "text": "This works very well. I like to put one bottle of wine by my table when I watch movies so I don't have to keep jumping up and down. This keeps my wine cool and my champagne cold. The condensation from the bottle ends up in the liner so no mess. It holds one regular bottle of wine or champagne. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20150618
    },
    {
      "title": "Keeps the wine cool for several hours.",
      "text": "It was originally recommend by America’s Test Kitchens so we ordered a couple and they eork great.",
      "rating": 5.0,
      "verified": true,
      "author": "bon vivant",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "keeps wine cold and looks good on the serving table.",
      "text": "This is a great, well-made product. It keeps the wine product cold for several hours and looks good as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel L. Olah",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Works",
      "text": "Great for keeping wine nice and cool without the drip mess of ice. It really does work.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia A Farmin",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Pretty and Efficient!",
      "text": "So easy, so classy and so convenient! I use these in my Bed and Breakfast to deliver sparkling cider to special guests. It looks classy on the table with chocolate dipped strawberries and fine crystal and keeps the bottles cold for many, many hours!",
      "rating": 5.0,
      "verified": true,
      "author": "LodgingLady",
      "helpful_votes": 0,
      "publication_date": 20140922
    },
    {
      "title": "Freeze it drink it “cold”.",
      "text": "I could sell these. This is the best wine chiller. So easy to use. My extended family loves it as I do. Just follow the easy directions and you have chilled wine all night.",
      "rating": 5.0,
      "verified": true,
      "author": "Beverly J. Collins",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Nice wine cooler",
      "text": "This is a great little item to use on our deck. The freezer packs are easy to insert in the cooler plus they are stack-able so it is easy to store them in the freezer. Nice not to have to mess with water and ice to keep our wine cool. Does exactly what it says.",
      "rating": 5.0,
      "verified": true,
      "author": "mhc",
      "helpful_votes": 0,
      "publication_date": 20140614
    },
    {
      "title": "Too bad.",
      "text": "Attractive. Works very well at keeping the bottle cold. Works with Champagne bottles too. But it does sweat and leaves water on the dining room table. Too bad.",
      "rating": 4.0,
      "verified": true,
      "author": "Simon",
      "helpful_votes": 4,
      "publication_date": 20140718
    },
    {
      "title": "keeps champagne beautifully chilled, even in the summer",
      "text": "love this product! we use it for wine and champagne when we entertain outdoors",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer freund",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Cool",
      "text": "Performs as promised. Keeps our wine bottle cold for a good 6 hours both in the house with A/C or outside on a warm day .",
      "rating": 5.0,
      "verified": true,
      "author": "Diane M",
      "helpful_votes": 2,
      "publication_date": 20170731
    },
    {
      "title": "Really works",
      "text": "really works as advertised however it is a few steps to put it together for use versus just pulling a freezer sleeve out of the freezer",
      "rating": 4.0,
      "verified": true,
      "author": "Carolee Justus",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Small yet effective",
      "text": "So easy to use and store. Keeps item chilled through entire meal or gathering.",
      "rating": 5.0,
      "verified": true,
      "author": "Martha Gilliland",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "it works well",
      "text": "This works well and is attractive. Easy to use and I got it open box super cheap so I'm happy",
      "rating": 5.0,
      "verified": true,
      "author": "gk",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Attractive, functions perfectly as described, very versatile - great product!",
      "text": "Easy to store, the freezer inserts really make this wine cooler very versatile. It brings down the temp of our whites and reds perfectly, depending on how many inserts we use (if at all). Very well constructed and pretty to boot - nice enough to set out for a dinner party, but we often pull it out on weeknights too! Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Lonnett",
      "helpful_votes": 3,
      "publication_date": 20131207
    },
    {
      "title": "Excellent product",
      "text": "Does a great job of keeping a wine bottle cold without condensation. Easy to use- just take the 4 cold packs out of your freezer and put in the cooler. Its ready to go",
      "rating": 5.0,
      "verified": true,
      "author": "J. Grant",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Nice",
      "text": "This is a well made wine bucket,,, The inserts fit together really well and keep my wine nice and chilled.. only reg 750 Ml size bottles will fit though,, the 1.5 L bottle are too large, although you could use this without the chilled inserts for a large red.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 3,
      "publication_date": 20121217
    },
    {
      "title": "Work Well",
      "text": "One of the inserts arrived cracked and leaking. Contacted the manufacturer and they sent a replacement. I like this much better than an ice bucket as they are neater and easier to use. Oh, and it works!",
      "rating": 4.0,
      "verified": true,
      "author": "Gary P.",
      "helpful_votes": 5,
      "publication_date": 20130514
    },
    {
      "title": "Oggi Wine Cooler is very good",
      "text": "The \"coolest\" way to serve wine or champagne I have found. Freeze the inserts and your bottle will remain chilled without condensation or dripping. It is handsome to the eye and simple to clean up. A definite asset for your bar. WGS 12/31/2014",
      "rating": 5.0,
      "verified": true,
      "author": "WS",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "Great Price, Look Good and Is Very Handy",
      "text": "This fits the bill for having wine on the deck and keeping it cool-- even in the Texas summer. Helpful hint-- DO NOT hard freeze the inserts. They will expand and not fit correctly. I leave them in the refrigerator and they work great. A skinny wine bottle didn't fit snugly, but still stayed cool.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Henderson",
      "helpful_votes": 0,
      "publication_date": 20140113
    },
    {
      "title": "Works great! Looks great.",
      "text": "This works great and looks nice! The removable freezer packs really keep the wine cool during dinner, no matter the room temp. I show this to everyone who comes over and tell them to get one, LOL.",
      "rating": 5.0,
      "verified": true,
      "author": "Joolie",
      "helpful_votes": 0,
      "publication_date": 20140825
    },
    {
      "title": "Five Stars",
      "text": "Love this wine cooler... We already used it several times and it works awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Brinkley",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Loved this so much I have given them as gifts",
      "text": "Loved this so much I have given them as gifts. I just leave the whole thing in the freezer and pull out when needed. Great!",
      "rating": 5.0,
      "verified": true,
      "author": "NeverTooMuchRomance",
      "helpful_votes": 0,
      "publication_date": 20150724
    },
    {
      "title": "champ",
      "text": "i used this at a party where white was not the primary drink. it was simple to use, looked good, and keeps the one bottle of white cold for hours",
      "rating": 4.0,
      "verified": true,
      "author": "SpringTX",
      "helpful_votes": 0,
      "publication_date": 20140703
    },
    {
      "title": "Wine cooler",
      "text": "Nice stainless steel container, We had a similar one given to us as a gift 15 years ago but the outside container was plastic starting to age!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Francoise Micheletti",
      "helpful_votes": 2,
      "publication_date": 20130429
    },
    {
      "title": "Fantastic Product",
      "text": "I couldn't wait to get this home and put it to use. We had several birthday celebration s and graduation to attend and I'm was able to bring wine or champagne and keep it cool at all the parties. This kept my wine chiller and is porta,light and good looking too. I would recommend this to anyone who is planning on entertaining.",
      "rating": 5.0,
      "verified": true,
      "author": "janet levai",
      "helpful_votes": 0,
      "publication_date": 20140612
    },
    {
      "title": "Excellent",
      "text": "Love it a lot. excellent product, I recommend it. Oggi is a great brand and as a seller it was a very good experience",
      "rating": 5.0,
      "verified": true,
      "author": "ChristieS",
      "helpful_votes": 0,
      "publication_date": 20131202
    },
    {
      "title": "Best wine cooler ever.",
      "text": "Love it. Great wine cooler - particularly nice for use outdoors.",
      "rating": 5.0,
      "verified": true,
      "author": "Head Shred",
      "helpful_votes": 0,
      "publication_date": 20140723
    },
    {
      "title": "Pleased",
      "text": "This item was just what I thought it would be, the quality and usefulness. It was purchase for a gift and it was well received.",
      "rating": 4.0,
      "verified": true,
      "author": "Nothappy",
      "helpful_votes": 0,
      "publication_date": 20120322
    },
    {
      "title": "Happy Wine Lovers",
      "text": "This wine cooler is nice looking, versatile, and easy to use. It is well designed and meets all of our criteria.",
      "rating": 5.0,
      "verified": true,
      "author": "NBG",
      "helpful_votes": 0,
      "publication_date": 20140121
    }
  ],
  "product_meta": {
    "title": "Oggi Wine Cooler with Freezer Inserts",
    "description": "With innovative designs and contemporary finishes, oggi’s kitchen and bath wares are truly tomorrow’s housewares.Oggi’s wine Cooler with freezer inserts is no exception. This attractive Cooler keeps your wine cool without condensation on the wine bottle. It's easy to use. Simply remove black centerpiece and freezer inserts. Place inserts in the refrigerator and let cool or freeze. Once at desired temperature remove and replace in wine chiller. Replace centerpiece and insert wine bottle. Stainless steel. Do not use abrasives when cleaning. Hand wash.",
    "rating": 4.6,
    "feature_bullets": [
      "Stainless steel wine cooler with freezer inserts",
      "Keeps your wine cool without condensation on the wine bottle",
      "2 Tone satin and mirror finish",
      "Recommended hand wash with mild soap"
    ],
    "specifications": {
      "Product Dimensions": "6 x 6 x 8 inches",
      "Item Weight": "2.47 pounds",
      "Manufacturer": "OGGI",
      "ASIN": "B0001V2HF4",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "7040",
      "Customer Reviews": "4.6 out of 5 stars251 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#24,134 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 2, 2001"
    },
    "categories": [
      "Home & Kitchen",
      "Dining & Entertaining",
      "Kitchen & Dining",
      "Bar Tools & Drinkware"
    ],
    "price": 29.8
  }
}