{
  "website_summaries": [
    {
      "verdict": "Appearance is the high point of this unit; multiple quality-related complaints leave us questioning its dependability and construction.",
      "pros": [
        "Retains heat for prolonged periods of time -- unlike its close competitors"
      ],
      "cons": [
        "A few customers note this teapot leaks when pouring"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Poor spout design",
      "text": "My complaint with this tea pot is that it drips. Every time I go to pour my tea the tea will dribble down the front of the pot, all the way from the spout to the counter. I have to use a towel under the spout.",
      "rating": 1.0,
      "verified": true,
      "author": "Delene G. Dunne",
      "helpful_votes": 21,
      "publication_date": 20170325
    },
    {
      "title": "Nice!",
      "text": "Larger capacity than most teapots I've seen. Love the color, not lime but not olive either. Attached is a photo with my dishes which have several shades of green on them. Heats well in microwave oven. Holds heat well and I don't have a problem with dripping from spout. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "LOVELOVELOVE",
      "helpful_votes": 16,
      "publication_date": 20160423
    },
    {
      "title": "Poor Product Packaging",
      "text": "I have purchased and returned two teapots, both of which arrived with their lids broken. Having inspected the packaging, it's clear that the lid doesn't have enough protection and will probably break every time. This is frustrating as other colors of this teapot seem to make it to people without a hitch...",
      "rating": 1.0,
      "verified": true,
      "author": "RosesareRed",
      "helpful_votes": 4,
      "publication_date": 20181015
    },
    {
      "title": "My big little teapot",
      "text": "This teapot is so beautiful in person--the red is brighter and richer than in the picture (the picture's color is more brown, but this is a festive Christmas red). The size is big enough for four or more people, but small enough that I can still lift it with one hand. The lid is ingeniously designed so that it doesn't come off during pouring, and there is almost no detectable dribble from the spout! It's easy to clean (my hands are pretty small though) and keeps my tea warm for a long time. This is a must-have for any tea-lover on a budget!",
      "rating": 5.0,
      "verified": true,
      "author": "ana",
      "helpful_votes": 40,
      "publication_date": 20111229
    },
    {
      "title": "Sturdy Little Teapot",
      "text": "This is a very well made teapot. All the edges are smooth and well finished, the coloring is even and accurate according to the advertised pics and it does NOT drip at all when pouring. Also, the lid has a special divot to hold it in place, plus a pinhole (2nd pic), presumably to let steam escape. Overall, it's a good, sensible teapot and very attractive.",
      "rating": 5.0,
      "verified": true,
      "author": "Marige",
      "helpful_votes": 2,
      "publication_date": 20190213
    },
    {
      "title": "Big tea pot - get a lot of tea in one shot",
      "text": "Well made, attractive (I got the blue) and heavy, not lite weight like some of the other ones I have bought. The only reason I knicked it a star is because for me the handle is too small. I am male 6' foot 70 year old and I have trouble pouring when it is filled to the top because I cannot get enough leverage on the handle to counter the heavy pot, so when I go to pour for the first two cups the bottom of my hand ends up coming in contact with the very hot pot. I would like the top of the handle to be two inches or so higher so I could grip it better.",
      "rating": 4.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Perfect",
      "text": "Lid Broke in shipment, need a replacement **Update: I Returned item the next day and received replacement today. it is perfect! Very cute, color as shown, good size. Plan to use for pot of oolong tea throughout my work day at the office. A+ on Amazon customer service. My return was set to arrive a week later rather than 2 day prime shipping as expected, one brief call and it was rectified. Don’t hesitate, you won’t be disappointed in this tea pot!",
      "rating": 5.0,
      "verified": true,
      "author": "Customer ",
      "helpful_votes": 3,
      "publication_date": 20190115
    },
    {
      "title": "This is a remarkably nice teapot and would highly recommend.",
      "text": "The packaging was excellent everything arrived intact. I gave a few of these as Christmas gifts and then bought one for myself because I was told they were pretty awesome. This smart little pot holds a fair amount of tea and keeps it nice and warm in case you want more than one cup! Very easy to clean and after it's been cleaned and dried I put it somewhere on my counter where it can be seen because it is so darn cute!",
      "rating": 5.0,
      "verified": true,
      "author": "LORI Murphy",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "classic",
      "text": "The classic shape and warm color of this teapot makes me happy, even though most of the time I make tea by the cup. But it's good to know I have a proper teapot when needed. It is just the right size/shape for my British tea cosy. This teapot pours well! (Which one can never guarantee with a teapot...) Pro tip: you can judge how high to fill the water by the holes for the spout, once you've seen the water level for various numbers of cups. (Well, mugs!)",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonCustomer",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Drips Like Crazy",
      "text": "We bought this as a replacement for a tea kettle that we bought five years ago that broke hoping for the same performance from this one as from that one. Unfortunately, despite looking quite similar, this teapot drips liked crazy when it was pouring and we decided to return it. Not a good purchase,",
      "rating": 1.0,
      "verified": true,
      "author": "David S. Liebschutz",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Overall a good teapot",
      "text": "Overall this is a very good teapot. I got the green and it is very pleasing to the eye. I could not be more happy with the colour. I usually pour hot but not boiling water in to it to warm it up before I put the boiling water in. It keeps it warm for probably 30 minutes to 1 hour. Some tea does spill when you pour, but it's not that bad. I have not microwaved or dishwashered it but it's nice to know I can. It seems to be of good quality. It was definitely worth what I paid for it. I'm very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Monroe F.",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Terrible spout",
      "text": "The spout dribbles tea everywhere. Check out this teapot, which works much better:",
      "rating": 1.0,
      "verified": true,
      "author": "AG",
      "helpful_votes": 7,
      "publication_date": 20170720
    },
    {
      "title": "Good teapot - until it cracked for no reason",
      "text": "Just about a year after we bought this, it cracked. We've been pouring boiling water into it at least every other day to make tea, but this morning, ten minutes or more after setting it to steep, I heard \"*ping*!\" I went to see what that was, saw nothing, and came back a half an hour later to find a puddle of tea. It's a very fine crack, about 3\" long, in the body of the teapot, visible on the outside and feel-able on the inside, just enough to weep tea. Very disappointing - we make multiple pots of tea every day, and need several pots for the different types!",
      "rating": 2.0,
      "verified": true,
      "author": "Marie M",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Solid pot, but streams down the spout when pouring",
      "text": "It is a large,inexpensive, solid teapot;however, dribbling from the spout makes it difficult to use. When pouring, there is a steady stream running down the pot, regardless of angle. Hopefully just a dud, but I think I'm going to look for a replacement. Even when pouring the entire contents at once into an ice tea pitcher, I need 3 paper towels to clean up the mess and have wound up burning my hand on hot tea twice.",
      "rating": 2.0,
      "verified": true,
      "author": "RJ",
      "helpful_votes": 3,
      "publication_date": 20170206
    },
    {
      "title": "Nice teapot",
      "text": "This is a large teapot so if you're like me and like multiple cups of tea on one pot, this is for you. The color is exactly as I expected - not bright red but a nice cherry red. I bought this to replace a Sargento teapot I had which broke. It is very close in color but not the same color. I wanted to comment on some of the negative reviews - this is a steeping pot, don't heat water in it. It does dribble if you don't pour correctly but I have managed to get a perfect angle for pouring to keep it from dribbling.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20150101
    },
    {
      "title": "Excellent performance, quality, and price!",
      "text": "Teapot is exactly as described. Arrived quickly. Its coloring is even, and the size is perfect for two or three people to enjoy a \"spot of tea.\" The lid catches nicely, so you do not need to worry about holding it on when you pour. Glad that I chose this teapot over all of the others available on this site Price is reasonable, too.",
      "rating": 5.0,
      "verified": true,
      "author": "S K",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Lovely pot but poor spout design spills",
      "text": "Read the reviews, they said the spout spills a lot. Uh... I really liked the design anyway. So I did a lot of testing with it, and no matter what you do this thing is gonna spill. So I just hold beneath the spout with a cloth when I pour. If you pour properly only a drop or so will spill as you set the pot back down, making the cloth method viable. The pot keeps my tea hot for 2 friggin hours you guys. That's amazing. So I got a tea cozy for it and it keeps it hot even longer. Yey.",
      "rating": 4.0,
      "verified": true,
      "author": "Rilessa",
      "helpful_votes": 2,
      "publication_date": 20170520
    },
    {
      "title": "Good big teapot",
      "text": "The spout is a little crooked, so you have to account for that when you're pouring the tea. It's a good teapot. I've been using it for quite a while now. You'll want to use a strainer if you're using smaller tea leaves. Pre-rinsed loose Oolong works fine without additional straining though. Makes about one quart of tea. (Not quite the six cups that is advertised, unless you fill it to the brim, which would be silly)",
      "rating": 4.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 3,
      "publication_date": 20150716
    },
    {
      "title": "Love my teapot!",
      "text": "This tea pot is strong and sturdy. It holds a good amount up to 4 teabags. I enjoy pouring tea from this teapot without having to worry it will break if I set it down to fast on the table. You'll love your next tea party with this beautiful tea pot, highly recommended it.",
      "rating": 5.0,
      "verified": true,
      "author": "Grace W",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Third time NOT the charm",
      "text": "I ordered this teapot 3 times. the first time, it was damaged en route and never even came to my house. No problem, things happen. I order it again. It arrives broken. The top of the lid is broken. The box it came in was fine. It looked like it hadn't been well wrapped. I send it back and order it AGAIN. It arrived fine. Well wrapped, nothing able to move around. I wash it out and heat some water for tea. I fill the pot and then notice a lot of water on my counter. There's a crack I hadn't noticed near the handle. Don't waste your money. Buy a higher quality tea pot.",
      "rating": 1.0,
      "verified": true,
      "author": "Catherine VanderBok",
      "helpful_votes": 2,
      "publication_date": 20180925
    },
    {
      "title": "Drips as you pour. Otherwise a great teapot.",
      "text": "It drips as you pour. This makes it useful only in the kitchen on the counter with a towel nearby. Otherwise it's great. It holds a lot and feels solid. The price is good. If it didn't drip, I would give it 5 stars. I'm on the hunt for a better one. I'm going to check some resale shops first before ordering online. This teapot replaced one I broke a couple of days earlier. If anyone has a clue about how to fix the drip, please put it in the comments.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Just about the perfect teapot",
      "text": "It's attractive, thick enough to retain heat, has a lid that is resistant to falling out while you're pouring tea, is large enough for several cups. I love it. To get an idea of size, it's sitting in front of a four-cup measuring cup in the photo.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Elaine Murphy",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Boil or heat the water in the pot in microwave",
      "text": "For tea, put the water in the pot, put the pot in the microwave, heat water to any temperature up to boiling. Add tea. Let it sit. The lid seats well and does not fall out when pouring. It's a proper tea pot.",
      "rating": 5.0,
      "verified": true,
      "author": "H Cooper",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Love it!",
      "text": "I am a fan of hot tea and after becoming addicted to Father Brown and Call The Midwife I decided I needed a teapot! Never had a teapot before so I had no idea what to expect. I am thrilled with it. It holds enough water for 2 Texas sized MUGS (not teacups) with a little left in the pot. The water stayed hot much longer than I expected. The color is perfect and is almost an exact match to my dinette set.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin B",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "The Perfect Teapot",
      "text": "My wife has many teapots but did not have one to match the Christmas table settings. I ordered this one and when it arrived she said that this one is the perfect color and the perfect size for serving tea after Christmas dinner. The holiday has been saved!",
      "rating": 5.0,
      "verified": true,
      "author": "Bosk Scott",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Great teacup",
      "text": "I love the color and the size is perfect for sharing cups with my family. It is a bit big for one person, the tea is pretty cool by the last cup, but I think a cozy will help with that. I have had problems with dripping, but I rub a tiny bit of butter to the underside of the spout and there are no drips. Overall, I'm really pleased with this teacup.",
      "rating": 5.0,
      "verified": true,
      "author": "gwen",
      "helpful_votes": 3,
      "publication_date": 20160209
    },
    {
      "title": "Nice quality and great size for steeping more than one cup at a time.",
      "text": "Very nice quality tea pot. Easy to use and clean. Keeps tea hot between cups and the pretty green color matched my kitchen decor so I can leave it out when not in use. Very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Dribbles so much it is useless",
      "text": "Pretty teapot that unfortunately doesn't pour tea without dribbling all over the table. What a mess. It doesn't matter how fast or slowly you pour from it, it puddles all over the place.",
      "rating": 2.0,
      "verified": true,
      "author": "Paulette K",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "A Great Teapot!",
      "text": "This is the perfect teapot. It's sturdy and holds a full 6 cups. I especially like that there is a lip on the end of the pouring spout that helps prevent drips. It keeps my tea hot for a long time, too. This was a great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Wiedmeier",
      "helpful_votes": 3,
      "publication_date": 20170514
    },
    {
      "title": "Great no nonsense tea pot",
      "text": "I love this tea pot. The orange color is subtle. The hand is hefty without being heavy. It will be perfect for Halloween, Thanksgiving and anytime in the fall. Very useable. It would even be pretty with short stemmed fall flowers.",
      "rating": 5.0,
      "verified": true,
      "author": "Jib",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Poor pourer",
      "text": "Looks nice but doesn't pour well at all! Drips like crazy.",
      "rating": 1.0,
      "verified": true,
      "author": "Mags",
      "helpful_votes": 6,
      "publication_date": 20170907
    },
    {
      "title": "RSVP needs to package this item better. There is really no protection from shipping damage",
      "text": "RSVP needs to package this item better. There is really no protection from shipping damage. My teapot arrived shattered, I knew before I opened the shipping box it was damaged as I could hear the pieces clanking around in the box. You would think they wouldn't want this to happen and have to deal with all the returns. It's a cute teapot but I won't reorder since I'm sure the new one will arrive broken too.",
      "rating": 1.0,
      "verified": true,
      "author": "KELLY",
      "helpful_votes": 3,
      "publication_date": 20160810
    },
    {
      "title": "Good gift",
      "text": "This was a gift for a Grand-daughter, that is in her first year of college. She has loved tea since her freshman year in High school. She also Loves Jane Austin. I read all the previous reviews and determined that she could use this in her dorm microwave. She said that it works well in the microwave, keep warm long enough (I did buy her a cozy) She is happy, that's all that matters.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron & Jane",
      "helpful_votes": 0,
      "publication_date": 20160425
    },
    {
      "title": "Very nice design and color",
      "text": "Got this for my mother for christmas. It is something she has been wanting. Very nice design and color. My only complaint is that the spout isn't as open as I thought it'd be. inside you can see a bunch of holes that the tea passes through. I expect it's so you can put in loose tea and keep it out of your cup, which is going to be a feature to some, but I find it ends up making it harder to clean, since you can't pass a bottle brush through to the reservoir.",
      "rating": 4.0,
      "verified": true,
      "author": "AGS",
      "helpful_votes": 2,
      "publication_date": 20160116
    },
    {
      "title": "Utilitarian and large",
      "text": "Large and sturdy with enough mass to keep tea hot for a while. The top opening is too small to permit easy cleaning by hand, but the glaze is smooth and uniform enough that it's doable with a wadded up dishcloth.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Noble",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Thumbs up",
      "text": "I’m not using this as a teapot so I can’t speak to that. It’s a perfect little vase though. Golden yellow color. I THINK though that it would be a fine little teapot to add some color to your life.",
      "rating": 5.0,
      "verified": true,
      "author": "Gimmeeeeeeee",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Not horrible, but not stellar.",
      "text": "Well, overall it's fine. It does hold 6 cups, but that measures to the lip just under the lid leaving no room for bags or leaves. Enough tea for 4. It does drip down the spout when pouring making a mess on your counter or tray. Best to hold a cloth or tea towel under the spout to catch the drips. Stays warm a decent amount of time when preheated without a cosy. Nice color and large sturdy handle. Overall it's ok, but it won't be the last pot I'll ever buy.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert S. Miller",
      "helpful_votes": 0,
      "publication_date": 20150719
    },
    {
      "title": "Perfect",
      "text": "I have a set of pink tea cups and saucers but no teapot. I got this to go with my set so I can pass it along to my niece one day. The pot is perfect size and the color matched perfectly! I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Great Except for Dripping",
      "text": "It's a nice sturdy teapot, however, the spout of mine drips more than I would prefer. It doesn't stain, and the lid stays on nicely, it also will keep tea hot for a good amount of time, so it would be perfect if it didn't drip.",
      "rating": 4.0,
      "verified": true,
      "author": "Christina W.",
      "helpful_votes": 3,
      "publication_date": 20161220
    },
    {
      "title": "Lovely product!",
      "text": "True,shiny black color. Doesn’t chip easily. Weighty and not at all difficult to pour from. Love the design to this one. Hefty size and can hold quite a bit of tea or just hot water. It’s given me some good times at multiple tea parties!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs.Fraser",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "It drips!",
      "text": "I have many teapots but this one is aggravating. No matter how I pour, it drips!! My least favorite teapot. It looks nice, but doesn’t really work.",
      "rating": 3.0,
      "verified": true,
      "author": "MH28",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Could’ve been great",
      "text": "Kind of disappointed. The teapot is great, but there’s a noticeable spot on the spout where the color got thin. The manufacturer or the seller should have done better quality control for $19. The pour is also messy.. tea everywhere. Don’t recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "Mihella",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "very cute but broke!!",
      "text": "adorable bright colored but received with a broken lid and don't have time to exchange. I need it for a party this weekend. disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "rosanne la calamita",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Not 6 cups!",
      "text": "A standard US cup is 8 oz. Six cups equal 48 ounces. This teapot does not hold 48 ounces, but approximately 42 ounces. Why call it a 6-cup teapot?",
      "rating": 1.0,
      "verified": true,
      "author": "Karen Zukor",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Good pot for the price!",
      "text": "I have a family of 6 and needed a large capacity pot for us all. The pot literally holds 6 cups at the brink! Hints the 4 vs 5 stars. It's my only complaint, because I end up spilling some of the tea if I make it to capacity. It does what it should otherwise.",
      "rating": 4.0,
      "verified": true,
      "author": "kely",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "This teapot is a nice value for the price",
      "text": "This teapot is a nice value for the price, I purchased it because, unlike other inexpensive teapots from China, it is lead-free. The pink was not exactly the color I was expecting ..it has a purplish under-tone rather than being a pure pink. I'm fine with the color, but it looks horrid under fluorescent lights. If you have halo, incandescent or natural light in your kitchen, as I do, it will look nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Patty Pearson",
      "helpful_votes": 3,
      "publication_date": 20150205
    },
    {
      "title": "I love this teapot!",
      "text": "I love this teapot! Great color, shape and size. AND, it keeps the tea hot for a long time with a tea cozy on it. I want one in every color. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Bhakti Belle",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "disappointed",
      "text": "sorry it isn't favorable but after a month of use. the handle is too large of a gap the it is hard to balance. cleaning it fully is harder and it is heavier than expected",
      "rating": 2.0,
      "verified": true,
      "author": "susan freund",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Drips tea all over",
      "text": "The spout drips a lot of tea on every pour. Will have to buy a different one. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "A Goddess",
      "helpful_votes": 8,
      "publication_date": 20170424
    },
    {
      "title": "Nice teapot. Buy two.",
      "text": "I checked five stars for \"I love it\" but the truth is I \"loved it.\" I dropped this teapot on a concrete floor and it did a Humpty Dumpty imitation from which it could not recover. As mentioned in another review of the orange version of the same teapot, this is a great product at a great price and should be considered by anyone wishing to own and use a very durable and attractively utilitarian piece. It keeps tea hot and works like a charm in a microwave oven.",
      "rating": 5.0,
      "verified": true,
      "author": "Barry Friends",
      "helpful_votes": 0,
      "publication_date": 20150505
    },
    {
      "title": "Loving my new tea pot!",
      "text": "I love this tea pot - it feels really well-balanced in my hand when full, it holds lots of tea, stays warm for quite a while and looks lovely. The shape just makes me happy:-)",
      "rating": 5.0,
      "verified": true,
      "author": "baythedog",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "The Synchronistic Little Teapot",
      "text": "A friend asked me to buy a teapot for her, to keep at my place for her visits. Not a tea drinker, I scanned the reviews until I found one that seemed just right. Sturdy, sensible, a good size, and red to go with my kitchen. Utilitarian yet adorable. When I surprised her with the new teapot, she said she had the same one in white, from Amazon, and she loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ariadne Weaver",
      "helpful_votes": 0,
      "publication_date": 20160316
    },
    {
      "title": "Very useful",
      "text": "Practical and sturdy tea pot. Holds enough water to avoid having to refill even for two people to enjoy a good size cup of tea together. Nothing super fancy but color and design are lovely also.",
      "rating": 5.0,
      "verified": true,
      "author": "SVB",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Cute Teapot",
      "text": "I needed a nice big teapot to serve multiple people, and this 6-cupper is up to par! (For those of you using oversized mugs for your tea, this will fill roughly four of them.) It is also a gorgeous warm orange color, a tadd lighter than the picture seems, perhaps, but very close. It's still the rich color you like about it! It does not drip unless you overfill it like I did the first time (leaked out from the lid) and it won't drop its lid if you don't hold it. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "HarvestSong",
      "helpful_votes": 0,
      "publication_date": 20140303
    },
    {
      "title": "Great value. Use mine daily.",
      "text": "Use this daily for tea. Put loose leaf tea in a French press and then move it to the big orange teapot. Easy to use and clean. Good value. Sturdy. Looks nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom in Boston MA",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Nice Utilitarian Pot",
      "text": "I really like this solid not-so-little pot. It can easily get two people through a morning, the red is a very nice color, it holds heat quite well, and the handle is a cut above the usual. My only complaint is that it's a bit hard to clean; even my medium sized woman's hand doesn't quite fit inside. But life has it's challenges, eh?. For the price and quality, I recommend it - and am now glad that the pot I had before (and loved) broke.",
      "rating": 4.0,
      "verified": true,
      "author": "elfillinois",
      "helpful_votes": 2,
      "publication_date": 20140321
    },
    {
      "title": "Fits  AN OLD OBSOLETE \"MRS TEA\"! BETTER THAN OEM?",
      "text": "It for : NRS TEA ---( obsolete tea maker with :\" USED carafes @ obsene prices ( $50 - 75.00 ?) It fits & keeps tea warm - with the cozy-- HOT!",
      "rating": 4.0,
      "verified": true,
      "author": "What's My line?",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "A little fat for my cozies.",
      "text": "A well-made, sturdy tea pot. The spout could be a bit longer to prevent dribbling during the pour.",
      "rating": 5.0,
      "verified": true,
      "author": "Hoquiam Reader/Shopper",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Great size / look for the price",
      "text": "Super cute teapot - I am going to use it for a party and needed a good size. It is just right and seems very durable as I haven't had it long enough to verify the longevity of it/color fastness, etc. I do like the face it is dishwasher safe. Stoneware does have a tendency to chip easily, but no problems yet - I was not investing in bone china for my purposes with this pot.",
      "rating": 5.0,
      "verified": true,
      "author": "holley",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Well Crafted Tea Pot",
      "text": "I really love this pot. It is well designed and crafted. Like the other reviews the spout has a filter but it is ceramic with holes. I love it. The lid absolutely stays on when pouring and it's a true 6 cup pot. I can make 6 small cups or 3 large cups of tea. As well as the other reviews, the color is NOT what you see here. It is much darker \"fern\" green. Not as dark as forest, but definitely not this light. But for the price and quality I didn't mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy D",
      "helpful_votes": 0,
      "publication_date": 20150330
    },
    {
      "title": "Cute color!",
      "text": "This will brighten up your kitchen with the happy color! A bit heavy when filled w/liquid, but that doesn't make it unusable. Really like it!",
      "rating": 5.0,
      "verified": true,
      "author": "Pat Upton",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "It arrived COMPLETELY broken- I am so sad. Believe the other reviewers with broken teapot pictures",
      "text": "It arrived COMPLETELY broken- I am so sad. Believe the other reviewers with broken teapot pictures (on same item, different listings/colors). Returning it. Beautiful green color, perfect size... It would have been perfect if it had arrived in one piece.",
      "rating": 1.0,
      "verified": true,
      "author": "Sh689x",
      "helpful_votes": 3,
      "publication_date": 20180102
    },
    {
      "title": "Does what a teapot is supposed to do",
      "text": "This is a very nice teapot ata very reasonable price. It comes in an array of colors, cleans easily, and pots well. A nice addition to our kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "JJF",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Great pour.",
      "text": "We love the pour on this teapot. We love the color. We love the sturdy feel of it. Recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey Cat",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Very pretty, standard ceramic teapot",
      "text": "Very pretty, standard ceramic teapot. A good value, very serviceable for everyday use. The teapot comes with a built in strainer, which is simply holes at the interior spout base (my last teapot had no strainer for stray leaves and they used to block the pour spout.) The green is a touch deeper and not as yellow as pictured.",
      "rating": 5.0,
      "verified": true,
      "author": "eyesa",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "Cheerful teapot!",
      "text": "I make a pot of tea every night, and this holds 6 cups, stays hot, pours without dribbling, and looks good. I hope it holds up, but for now it’s working well.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Dillon",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Six cupTeapot is great!",
      "text": "I like the size...drink a pot of tea in the morning and don't have to go to the kitchen to refill my cup, can keep pot close by my work space. Also, it is thick so keeps tea hot longer. I crocheted a tea cozy and that adds to keeping the tea hot until I drain the pot. Love the pretty blue color too.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "POS",
      "text": "Seller description doesn't mention this is made in China! Bought as a gift for a friend who has been out of the country. Now that she is back and wants to return this because of the China origin, we cannot!!!",
      "rating": 1.0,
      "verified": true,
      "author": "erob",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Cute pot, good size",
      "text": "Functional and/or decorative this pot is so cute! Works great for loose leaf tea.",
      "rating": 5.0,
      "verified": true,
      "author": "MMK",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Spout is only as high as the top of pot ...",
      "text": "Spout is only as high as the top of pot, so when you pour it spills until the level lowers some. Also the spout is put on after the main pot is made and as such has only a bunch of holes connecting it and as such can only be cleaned by using bleach and soaking to get all the grunge out. Very poor design!!",
      "rating": 1.0,
      "verified": true,
      "author": "SpecialED",
      "helpful_votes": 4,
      "publication_date": 20150405
    },
    {
      "title": "Good looking teapot",
      "text": "A nice size for a large pot of tea. Be careful as the handle does get hot so you need a cloth for pouring.",
      "rating": 4.0,
      "verified": true,
      "author": "AB",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Pretty in Pink",
      "text": "The color is beautiful, and in addition to being used frequently, it makes my kitchen more attractive just by sitting there. My only complaint is that it has a tendency to drip just a little the first couple of cups.",
      "rating": 4.0,
      "verified": true,
      "author": "Shasta",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "I was very happy with the little tea pot",
      "text": "I was very happy with the little tea pot. This is not little, this is tea for a party. For the price i was amazed. Has a very nice balance and have had no problems with drip, just pour slower it is tea what is the rush. The color is a nice red, not gaudy red, a nice red that will fit into your kitchen. If you have a tea friend get them one as a gift. Put some tea inside.",
      "rating": 5.0,
      "verified": true,
      "author": "Don Currence",
      "helpful_votes": 0,
      "publication_date": 20140908
    },
    {
      "title": "Perfect!",
      "text": "If I had the space, I would get more colors just because. This is a great teapot. The spout cries hardly a drip. I use a dish towel folded length-wise to grip the handle and hold the base of the spout when its hot. Throw a tea cozy on it and I have mugs of tea all I want. If it does cool, just nuke it and good to finish. The red is a nice shade. The shape is cheerful, and its function is spot on. Glad I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "That_Lady",
      "helpful_votes": 0,
      "publication_date": 20140121
    },
    {
      "title": "but it's a good teapot for the price",
      "text": "It's royal blue, not light blue, but it's a good teapot for the price. Doesn't drip, holds at lest 4 cups and the lid doesn't threaten to come off when you're pouring. Made in China, but not bad quality. Dishwasher safe.I have no trouble recommending it.",
      "rating": 4.0,
      "verified": true,
      "author": "wyjomo",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "Great value for a nice teapot!",
      "text": "This teapot is adorable. It arrived as scheduled and was well packed. I needed a second teapot to use with assorted Fiesta wars but wanted to spend less than the price of another Fiesta teapot. Color isn't exactly as it appeared on screen, but it's very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Perfect Teapot",
      "text": "Great teapot. It is even nicer than it looks in the picture. Bought a medium blue one for a gift and than bought this green one for me. I would buy another one if the need came up. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard B.",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Cute and functional",
      "text": "Nice little teapot. Makes about 2 1/2 really big mugs of tea. A little heavy when full. Also a little difficult to clean because the opening is too small to get your hand into. But does the job okay.",
      "rating": 5.0,
      "verified": true,
      "author": "greatmom56",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Perfect Teapot!",
      "text": "This teapot is a nice weight and pours well. The pink color goes perfectly with Johnson Bros. \"Rose Chintz\" china pattern. I certainly would buy it again I needed another tea pot. This would make a great gift for somebody!!",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Marius",
      "helpful_votes": 0,
      "publication_date": 20151129
    },
    {
      "title": "Nice proper tea pot!",
      "text": "I like tea, I like a tea pot that has clean lines, classic look and works. This is all those things and large enough for a tea party too!",
      "rating": 5.0,
      "verified": true,
      "author": "N. Basile",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "The size is nice and large",
      "text": "The size is nice and large; enough for four medium-sized cups worth. The inside is fairly difficult to clean, though. The opening is just too small to get my hand into.",
      "rating": 4.0,
      "verified": true,
      "author": "Christian Moomaw",
      "helpful_votes": 2,
      "publication_date": 20170130
    },
    {
      "title": "It's a tea pot",
      "text": "Very simple well constructed basic tea pot. I have not had any issue with terminal spout dribble.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert W. Johnstone",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Pretty red teapot",
      "text": "The teapot is a true classic red and looks pretty on the table. It arrived without harm or defect. The lid has a specific way to fit and, when placed correctly, does not move during pouring. The pouring works well with one small drip after turning the teapot upright. I use a napkin to catch the last drop of tea. The capacity is 48 ounces, as described. I will be taking care to warm the pot with warm water before adding hot tea and I don't plan on putting it on my stove on a burner. I'm very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "COshopper",
      "helpful_votes": 0,
      "publication_date": 20151202
    },
    {
      "title": "Perfect teapot",
      "text": "Exactly what I was looking for. I was a little wary at first because I didn't want a huge teapot and 6 cups sounded very large. But it's the perfect size, I usually heat up about 400mL of water to use with 2 teabags. Product came in great condition, nothing broken or missing, and it came on time. Very satisfied with this purchase and I would definitely recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Liz Jaff",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "A simple and basic teapot",
      "text": "A simple and basic teapot...just what I wanted. My husband and I enjoy tea/ coffee every evening and sometimes we like to have another round depending upon the weather and our mood. This is perfect for keeping our extra tea or coffee hot. The stoneware has a good weight to it and the handle design allows a good grip.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160922
    },
    {
      "title": "Happy with the product",
      "text": "We use this tea pot frequently, it looks nice and cleans up easily. I haven't chipped it yet so I assume that it's durable because I am hard on tea pots.",
      "rating": 5.0,
      "verified": true,
      "author": "ganendal",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Very Nice Teapot",
      "text": "It's basic, it's cute and it does its job. I use this daily to boil water in the microwave for use in my neti pot. It's perfect for the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Lydia Fazio Theys",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Dribbling Nightmare",
      "text": "I broke my beloved teapot, and bought this model as a replacement because it looked like the one I broke. It is made well and looks well, but there is no way to pour tea without gaining a puddle. I've tried tipping it into a mug, pouring it from a height, pouring it fast, pouring it slow, and nothing works. Either I'm an idiot or this is a poor design.",
      "rating": 2.0,
      "verified": true,
      "author": "Carolyn W. Carrera",
      "helpful_votes": 6,
      "publication_date": 20131031
    },
    {
      "title": "Design flaw: the spout will dribble. The lid ...",
      "text": "Design flaw: the spout will dribble. The lid fits securely, however, the walls retain heat but aren't too thick, and the handle is well placed for pouring.",
      "rating": 3.0,
      "verified": true,
      "author": "D&CH5",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "Great teapot",
      "text": "I love this teapot. The lid is sensibly made and the handle is very broad, meaning it is easy for arthritic hands to grasp and safely pour.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan in Oregon",
      "helpful_votes": 2,
      "publication_date": 20170926
    },
    {
      "title": "Adorable!",
      "text": "This tea pot is adorable! It is true to the color shown online and fulfills its purpose. Make sure to order the correct size! I would recommend the six cup teapot to one or two people.",
      "rating": 5.0,
      "verified": true,
      "author": "Mae2301",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Nice pot!",
      "text": "Seems a bit smaller than 6 cups but love it. Keeps tea nice and hot.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle B.",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Perfect 3 bag teapot!",
      "text": "Firstly, I’m English and drink a pot of tea every morning so I think my review should count extra! This is a fab pot, classic size, washes wonderfully in the dishwasher and the pink color is sophisticated not girlish. LOVE IT.",
      "rating": 5.0,
      "verified": true,
      "author": "MrsB",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "but I am going to keep it because it good quality and the white will match more",
      "text": "I ordered this teapot in pink but they sent me a white one! :( Very dissapointed, but I am going to keep it because it good quality and the white will match more. The pink was for my daughter to have tea parties, but she is ok with the white.",
      "rating": 4.0,
      "verified": true,
      "author": "Marcia Miller",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "Unfortunately it is not a good design as it doesn't pour the tea properly",
      "text": "I was excited to receive this large teapot. Unfortunately it is not a good design as it doesn't pour the tea properly. The liquid runs down the spout when pouring..... Three friends tried pouring a cup of tea and they all found the same as I did. The teapot is useless unless you have a cloth standing by to mop up after. Very very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Ms S Friedman",
      "helpful_votes": 5,
      "publication_date": 20160222
    },
    {
      "title": "Love it",
      "text": "Would buy another one. I love it. I've used it every night since I bought it. I even put it in the microwave.",
      "rating": 5.0,
      "verified": true,
      "author": "Toniann",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Bought this for the color and size. It drips ...",
      "text": "Bought this for the color and size. It drips from the spout as you pour. Will throw out as soon as we get a new one",
      "rating": 1.0,
      "verified": true,
      "author": "Eugene Reeser",
      "helpful_votes": 2,
      "publication_date": 20180412
    },
    {
      "title": "Counter scratching teapot",
      "text": "The teapot it's self is quite nice. I would have rated it much higher if it were not for the bottom of the pot. The bottom is rough and has scratched my counter top. That is something that I will check in the future and would, without doubt, cause me to never buy this teapot again.",
      "rating": 2.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "Nice teapot at a very good price",
      "text": "The red is not as rich or beautiful as, say, a Le Creuset teapot, but this teapot is a fraction of the price. It is cheerful, holds the right amount for my needs, and is easy to clean. The tip drips a little, but I'm careful not to let it stain anything. Packaging was great and shipping was fast.",
      "rating": 4.0,
      "verified": true,
      "author": "Tsippi",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "Сold white color with little bit grayish :((",
      "text": "The color is not warm white color, but cold white and little bit grayish :( And now it doesn't fit with my white teapot warmer (Sun's Tea (Tm) Super White Ceramic Teapot Warmer (White)) which i bought the same day. But in category \"Frequently Bought Together\" Amazon says people often buy these two things together, but they do not really fit togethet because of the difference in the tone of white color! :(",
      "rating": 3.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 0,
      "publication_date": 20141106
    }
  ],
  "product_meta": {
    "title": "RSVP Large Stoneware 6-Cup Teapot, Red",
    "description": "Color:RedRSVP strives to offer quality kitchen products and cooking tools at competitive prices. Our Stoneware Teapot is a perfect example. It is offered in a bevy of beautiful colors to choose from so there is a teapot that will suit any decor. Features a generous 42 ounce capacity and seamless one-piece construction. Microwave and dishwasher safe, lead free. Measures 9-1/2-inches by 6-inches by 6-inches. When all the right people, and ingredients, kitchen tools, and food come together, we call this The Art of Gathering.",
    "rating": 4.4,
    "feature_bullets": [
      "Our generously large 42 ounce capacity teapot is the perfect size for entertaining or family tea time",
      "Measures 9-1/2-inches by 6-inches by 6-inches",
      "Made of seamless sturdy stoneware one-piece construction; also available in black, yellow, white, orange, pink, green, grey, light blue, and turquoise",
      "The spout has large drain holes to help keep it clear of tea leaves, making it easier to pour",
      "Microwave and dishwasher safe"
    ],
    "specifications": {
      "Product Dimensions": "9.2 x 8.1 x 7.7 inches",
      "Item Weight": "3 pounds",
      "Manufacturer": "RSVP",
      "ASIN": "B000UGTJBA",
      "Customer Reviews": "4.4 out of 5 stars1,289 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#14,473 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 4, 2007"
    },
    "categories": [
      "Beverage Serveware",
      "Home & Kitchen",
      "Serveware",
      "Teapots & Coffee Servers",
      "Dining & Entertaining",
      "Kitchen & Dining",
      "Teapots"
    ],
    "price": 25.94
  }
}