{
  "website_summaries": [
    {
      "verdict": "Can be a sufficient choice if you are able to work around the extraneous noise.",
      "pros": [
        "A budget-priced sound mixer with eight mono inputs"
      ],
      "cons": [
        "Requires a 9V battery or 9V adapter to run",
        "Frequent reports of extraneous noise when using battery adapter"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Very handy little mixer.",
      "text": "This unit is working very well for my small mixing jobs. Simple, direct, easy to use. I run several pickup equipped guitar/mandolins through it to a single amp. This works very well for that purpose. Will be trying it while recording with microphones into my little Sony digital recorder Still learning ways to use it but very happy so far. I love having a battery on board, one less thing to plug in and very good when I'm using a battery powered amp with no wall power nearby. Physically this mixer is pretty small. Very portable.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Thompson",
      "helpful_votes": 6,
      "publication_date": 20160916
    },
    {
      "title": "This is a well built little mixer. I am ...",
      "text": "This is a well built little mixer. I am using it with a few battery powered synths and a portable speaker I am thrilled with the performance and the build quality is outstanding.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Westcott",
      "helpful_votes": 9,
      "publication_date": 20170522
    },
    {
      "title": "I enjoy the fact that I can run it from a ...",
      "text": "I'm really digging this little mixer. I enjoy the fact that I can run it from a 9V battery. I'm using it with my Korg Volcas and it works great. Since my whole setup runs on batteries it makes it very easy to go mobile. Well worth the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe K.",
      "helpful_votes": 10,
      "publication_date": 20170129
    },
    {
      "title": "Really nice mixer for the price",
      "text": "Really nice mixer for the price. Need to use a DC adapter to avoid noise which gets worse as the battery gets drained but this is very common for audio mixers. For the price you can't really beat it. I bought a universal DC adapter to power it and it's been working great for over a year.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Leone",
      "helpful_votes": 3,
      "publication_date": 20171227
    },
    {
      "title": "Unit works great with a lot of Flexibility",
      "text": "This is the second unit I have bought. I use it to play audio from my laptop, desktop, MP3 Player and Alexa without switching. I can adjust the levels of each audio source separately. On the other unit, I have the audio from ham radios and since it is mono, I can mix up to 8 radios into one speaker system. The only improvement would be to offer a model with miniature 3.5mm jacks instead of the 1/4\" jacks. This would save having to buy adaptors to go from the 3.5 mm to the 1/4\"",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Allison",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "It works, but seems to have noise issues",
      "text": "I use this to mix audio outputs from various sources, computers, TV, etc. to a headphone output. With a single input, it sounds just okay. I notices some very faint \"chirps\", but it's tolerable. However, when I add another input the chirping is amplified considerably. Additionally, when I use the 9V adapter, I notice an additional high pitched ringing noise. The problem may be less noticeable when using speakers, but I would advise you spend a bit extra for a nicer mixer.",
      "rating": 2.0,
      "verified": true,
      "author": "John Allen",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Great product for budget producers.",
      "text": "This is perfect for what I needed. I have a mini amateur recording studio set up and wanted a way to route all of my hardware into my interface without constantly unplugging cables - this fit the bill so well. Works great right out of the box with my KORG volca series and my Teenage Engineering PO and OP1. Very quiet and super rad. Would recommend to anyone in a similar situation.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "I JUST FELT LOVE WITH IT :)",
      "text": "Its Amazing Product, you may think i just felt love with this :), very high end out put quality in stereo mode even amp is in less volume, it most useful for stage and studio, no need with sound operator :), you can control every instrument and vocal gains easily with this cute little device. flexible to hold like 7 inch android tablet, volume controllers are very sensitive :(, They need make it well , how ever its very impressive product, you can simply go for it, and really value for money.",
      "rating": 5.0,
      "verified": true,
      "author": "vikram",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "nice unit",
      "text": "This worked exactly for me. However the pots all crackle when turned. I think spraying them with switch cleaner may work but haven't tried that yet. This is the only part that let this great little unit down otherwise I would have given it a 5 star rating.",
      "rating": 3.0,
      "verified": true,
      "author": "Philip K. Jones",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Easy, affordable channel/track extension",
      "text": "Very affordable sub mixer. Can use it to send two mono tracks to two channels or four stereo tracks to four channels. Simple controls, no frills. If all you need it to fit more sources into fewer channels and don't want to spend a whole lot, this is a fantastic solution. I ran out of channels on my main mixer, so I'm sending cymbals/overheads to one channel together and toms to one channel together. Now everything's running back to the live mix and I still have individual volume control of each instrument/mic.",
      "rating": 4.0,
      "verified": true,
      "author": "Brent Williams",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "You Get What You Pay For",
      "text": "You get what you pay for, which in this case, is a very high level of noise and utter lack of electrical isolation. When I touch the chassis there's a nice hum (on battery power at least; it doesn't accept the industry standard 2.1mm barrel plug, and I don't have a 2.5mm plug for the power spec). But hell, it was $25, it's tiny enough for my purposes, and I guess I don't need a high SNR for the particular application.",
      "rating": 2.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 2,
      "publication_date": 20170308
    },
    {
      "title": "Probably will fit my needs",
      "text": "This will probably fit my needs but the \"Owners Manual\" leaves a lot to be desired. It only describes the features, no explanation on how to use it, how to connect it, or how to troubleshoot problems. Without a detailed manual, only 3 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "P. Cornell W7PLC",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Awesome value for the price",
      "text": "If you want a portable mixer for a nominal setup like Korg Volcas or Teenage Engineering Pocket Operators on the go, it's very hard to beat this. Panning allows for effects send/return possibilities as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan E",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "I just received these great little mixer today",
      "text": "I just received these great little mixer today.On testing it I found out that I've wasted time for not placing order for it long before now.It really served the purpose I wanted it for.My only constraint is the type of AC-DC power pack I'm to purchase for it.There a lot of complaint that the Nady power pack is not compatible with these product.Pls help",
      "rating": 5.0,
      "verified": true,
      "author": "OLATUNJI",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "Cheap and easy",
      "text": "This thing sends a huge pop through your audio system when you cycle the power switch. Be sure you turn it on 1st and off last. I use a 9-volt battery because I was too cheap to buy the 9 volt AC adapter. I have plenty of other 9 volt adapters but none of them fit this thing like I hoped they would.",
      "rating": 3.0,
      "verified": true,
      "author": "Mark Turner",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "... we use on this bridge is satisfactory and a good deal. We only use 4 of the 8 ...",
      "text": "What we use on this bridge is satisfactory and a good deal. We only use 4 of the 8 channels because these 4 have a bit of a preamp lift. The other 4 (left side of stereo?) don't work as well but basically happy. Very happy about what they cram into this little unit. Knob controls alone are worth more than I paid.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "Very handy item keeps my headphones in one place.",
      "text": "Wow, this thing saved me a bundle. The other alternative was a much more complex setup with a full mixing board. This unit has my PC, MacBook Pro, Cell Phone, and iPad plugged in to it, and a single headphone coming out. With that setup, I can hear notifications from any of my devices. I paired it with a Behringer HA400 for my microphone inputs on all the same devices. Now I have a single headphone and mic for everything. Works fantastic for my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Roybal",
      "helpful_votes": 0,
      "publication_date": 20151114
    },
    {
      "title": "I called Nady support and they were happy to replace it",
      "text": "My unit worked OK for a week or two. Then I started getting distortion. After replacing the battery everything was OK so I will give it 4 stars. If it came with a power adapter, I would give it 5 stars. Don't count on the battery lasting too long. I called Nady support and they were happy to replace it, if I sent the unit in with a receipt but did not mention that low battery could cause this problem, even when I asked. Needless to say, I will not be replacing it (yet).",
      "rating": 4.0,
      "verified": true,
      "author": "Jack Fenton",
      "helpful_votes": 0,
      "publication_date": 20140902
    },
    {
      "title": "Noisy",
      "text": "Lot of hiss that I could not get rid of do to how I have my rig setup. But I'm able to use it on a differant app. Good construction, loves it's juice, have a good supply of 9V bats on hand or very noisy with NOT INCLUDED power supply. Makes sence to me if your going to use an odd sized power plug, include a dang power supply with the unit (very stupid and frustrating)",
      "rating": 3.0,
      "verified": true,
      "author": "Marc",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Really not worth the money.",
      "text": "Same issue that most reviewers have: Very noisy without the proper power supply (it should come with one for the price!). I also hear a lot of distortion when the volume is turned up and get a radio signal when the volume is low. Better off with the Behringer Micro-mix MX400.",
      "rating": 2.0,
      "verified": true,
      "author": "G. Larimore",
      "helpful_votes": 2,
      "publication_date": 20170113
    },
    {
      "title": "Good for home use.",
      "text": "Works for what I bought it for. I don't have a home stereo system and my girlfriend wanted something to play records through as well as fiddle with the channels on her vocal processor when not in the studio so I bought this to plug all that plus my guitar and chaos pads into and then run everything to a preamp before my marshal combo amp. Works well for this. I have everything on its own channel with the volume set so it never blows you away when you turn stuff on.",
      "rating": 5.0,
      "verified": true,
      "author": "Nik88",
      "helpful_votes": 0,
      "publication_date": 20141110
    },
    {
      "title": "Great value",
      "text": "For the money this little unit does an excellent job for a simple task. Noise floor is good, sound quality is good.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "This little guy is great, I have been using it for this whole ...",
      "text": "This little guy is great, I have been using it for this whole month and not had a single problem with it. It does not provide AUX send nor a USB interface and it uses knobs instead of faders, but that's why it so cheaply priced, right? I use this for my Korg Volcas and Teenage Engineering Pocket Operators. I will be purchasing a larger mixer in the future, but until then, this does the job and does the job very well.",
      "rating": 5.0,
      "verified": true,
      "author": "haze",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Disappointing, but you get what you pay for.",
      "text": "Not sure quite what I expected but... Very noisy (scratchy/heavy static) when adjusting volume. B channel didn't work consistently. Not what I was looking for. Should have paid more attention to the negative reviews.",
      "rating": 2.0,
      "verified": true,
      "author": "PowayBob",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "small simple inexpensive and fun",
      "text": "I have this connected to a keyboard and drum sequencer as well as the audio from my tablet. I can play my own stuff or play along to music from the tablet and can either use my headphones or output to my Bose audio system. This is just what I needed to have fun on the cheap and be able to get the levels mixed correctly. It also allows me to play without waking up the misses if I get the urge to play late night!",
      "rating": 5.0,
      "verified": true,
      "author": "LAR",
      "helpful_votes": 2,
      "publication_date": 20130726
    },
    {
      "title": "Great quality, has some idiosyncrasies",
      "text": "Very high amplitude out of pre-amp. In Mono mode, the input level cannot be adjusted above about 1/4 of max before clipping occurs from virtually any laptop sound card. Great quality, but should have a variable input level adjustment, so users get more resolution in their mix volume from each input channel.",
      "rating": 4.0,
      "verified": true,
      "author": "dallasdave",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Competent little mixer",
      "text": "Haven't played my guitar for 40 years, so when pulling out my old gear, I found many electronics no longer worked. I bought this to mix down some 40 year old 4 channel tapes I have directly to my computer. Works fine. It's only drawback (hence 4 stars) is that there is no way to blend an input into both left and right output channels. Would have been 5 stars if a least one pair of inputs allowed that.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason Chamberlain",
      "helpful_votes": 0,
      "publication_date": 20140502
    },
    {
      "title": "I recommend purchasing the mixer that comes with the power supply",
      "text": "I am running Korg Volcas through this mixer and into powered desktop monitors and it works well. I recommend purchasing the mixer that comes with the power supply. When using the power supply, I've noticed no hum, buzz or distortion to the signal. I suspect the one-star reviews are due to user error.",
      "rating": 5.0,
      "verified": true,
      "author": "ConcernedCitizen",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "No bueno.",
      "text": "The volume amplitude is considerably different on the left channel versus the right. Very disappointed in this product I would not buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "Tom Stillwagon",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Great, but no power supply",
      "text": "Works great, but doesn't come with a power supply. Make sure you get a good one for it like a Rolland. Otherwise you will hear hum in your speakers. You can run it off of battery also, but that won't last very long.",
      "rating": 4.0,
      "verified": true,
      "author": "Lee M",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Good for small personal use",
      "text": "I have been using this mixer for over a year now as a personal mixer for my computers at my desk and have been very satisfied with its quality. The controls are great for making small left/right adjustments and making sure that the movie playing on your main computer is not too much louder than the IM's coming in on your laptop. I would fully recommend this mixer to someone that is looking to have a small portable sound system and does not need oodles of control.",
      "rating": 5.0,
      "verified": true,
      "author": "Hudson T",
      "helpful_votes": 0,
      "publication_date": 20101208
    },
    {
      "title": "Looks great!",
      "text": "Returned it because I needed mono 4 channel. I'm sure it's fantastic!",
      "rating": 5.0,
      "verified": true,
      "author": "Dolly",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "A+ piece of gear",
      "text": "I use this to level three inputs into one PA and it’s perfect. The audio signal is clear, the build quality is solid and it’s a great price. On prime day, I will be buying a second.",
      "rating": 5.0,
      "verified": true,
      "author": "eamon barrows",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "This is a great little mini mixer for on the go recordings",
      "text": "I love this little mixer. Works great on the go.",
      "rating": 5.0,
      "verified": true,
      "author": "bdrevolts!",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Small,works great",
      "text": "I bought this unit for my practice sessions,I used it with my backing tracks with my guitar and a friend with his bass,before we used his mixer which is very big to carry around,The mini is easily stored in the back of my amp. it is very quiet, works great.I have not tried it with a power adapter as yet but it does the job for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Francis Coutou",
      "helpful_votes": 0,
      "publication_date": 20140424
    },
    {
      "title": "Does what i need",
      "text": "It does the trick so no complains. very sturdy build.",
      "rating": 4.0,
      "verified": true,
      "author": "N. Adams",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "works great and cheap price",
      "text": "Have it mixing all the pedals from the outs on a drum machine, works great and cheap price. Get a daisy chain power adapter that has adapters for the larger negative pin that it has on its AC in. Then run the mixer with all your pedals! the adapter i have was an Ispot that came with them for like $25, no hum issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20170501
    },
    {
      "title": "Good Low cost option",
      "text": "Hey i was looking at this or the hart maker mixer and I choose this one. 4 inputs in stereo or 8 mono... good and stable. Not the best build quality but its more than robust enough to get the job done. Its really convenient to use with the 9v battery!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "It's a great mixer, just keep in mind that each input ...",
      "text": "It's a great mixer, just keep in mind that each input is a channel - so unless you input left and right separately, you will not get stereo out. On the flipside, this lets you adjust left and right separately.",
      "rating": 5.0,
      "verified": true,
      "author": "William Farrell",
      "helpful_votes": 3,
      "publication_date": 20150710
    },
    {
      "title": "Use the battery for recording.",
      "text": "Works very well for my home recording, and to run my PA system. Low noise. When recording I find running it on a 9v battery removes all hum and static. Can't bet the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Joseph w Zaccagnino",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Great for keyboards & synths",
      "text": "I Bought this little mixer to use with my keyboards in my studio. It does a fantastic job. I'm using a DC power supply & no noise issues. Very satisfied with this little unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory Schiller",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "not worth losing tone. splits signals great. sounds cheap and lo-fi.",
      "text": "has a lo-fi sound. It reminds me of a cheap cable. Doesn't do justice to my tube amps. The circuits are generic. Behind in modern day technology. The clipping sounds are not pleasant. No headroom.",
      "rating": 3.0,
      "verified": true,
      "author": "crazy finger magic",
      "helpful_votes": 0,
      "publication_date": 20140610
    },
    {
      "title": "Good sound.",
      "text": "I wish it had panning, but for this price, I will stop whining.",
      "rating": 4.0,
      "verified": true,
      "author": "Hazard",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "perfect for my purpose",
      "text": "I play guitar and sing, I needed a mixer that would work well for guitar and mic and have a seperate channel for a personal monitor. I put a condenser mic in the back of my amp, ran it through the other channel and the output to an earbud. It worked like a charm, no matter how loud the room noise is I can hear myself. jdb",
      "rating": 5.0,
      "verified": true,
      "author": "kidzmom4",
      "helpful_votes": 0,
      "publication_date": 20140311
    },
    {
      "title": "Neat and simple. I am not using it for ...",
      "text": "Neat and simple. I am not using it for anything important and so I don't notice any hissing or distortion.",
      "rating": 5.0,
      "verified": true,
      "author": "Consumer #7",
      "helpful_votes": 0,
      "publication_date": 20160831
    },
    {
      "title": "Good little mixer.",
      "text": "My high school electroacoustic guitar section uses this. Works great and the section leader can easily maintain levels as needed.",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Small and it's work well",
      "text": "Good to mix up 4 stereo or 8 mono source into 1 sound system. Independant power level (L/R speaker to every \"In\" source). No equalizer but it's easy to add this before the \"In\" or after at the \"Out\" before the audio system.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Not a Good Buy",
      "text": "This was the worst mixer that I have ever owned. First problem was that it wouldn't plug into the adapter that it was supposed to. I ended up having to use 9V batteries. Also, it was completely messed up within a month. I wouldn't waste your time on this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Dylan Slaven",
      "helpful_votes": 2,
      "publication_date": 20150210
    },
    {
      "title": "The 9 volt power connection is sized incorrectly, a ...",
      "text": "The 9 volt power connection is sized incorrectly, a standard nine volt power supply does not work for this item. On the plus side, it works fairly decently as a passive mixer.",
      "rating": 2.0,
      "verified": true,
      "author": "Ashley Etcetera",
      "helpful_votes": 0,
      "publication_date": 20160814
    },
    {
      "title": "Basic Tank Mixer -- Indestructable",
      "text": "Great mixer. It is steel cased and should last forever. The controls are a little stiff and variable on their operation. There was no power adapter with it, but at this price that is understandable. I will buy another in the near future.",
      "rating": 4.0,
      "verified": true,
      "author": "Dorian",
      "helpful_votes": 0,
      "publication_date": 20130913
    },
    {
      "title": "Live sounds fine",
      "text": "Lots of static... might seem obvious but using with headphones or higi is not an option. Live sounds fine though",
      "rating": 2.0,
      "verified": true,
      "author": "Ryan Miller",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "Needs a power supply",
      "text": "Need an easy to find power supply for this. It should have come with it, as the 9v batteries wear out quickly.",
      "rating": 4.0,
      "verified": true,
      "author": "John A.",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "Four Stars",
      "text": "Good mixer, would get 5 stars if it came with a power adapter instead of selling it separately.",
      "rating": 4.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "Noisy Hiss",
      "text": "Nice build quality. The problem is that it's noisy. It produces a lot of hiss on the output signal.",
      "rating": 2.0,
      "verified": true,
      "author": "Kris P.",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "works fine, lacks power supply. Runs on 9v btry.",
      "text": "works as described. a typical 9v alkaline battery might last 10 hours, maybe less. This does not include the power supply. That adds about another $20 including shipping.",
      "rating": 4.0,
      "verified": true,
      "author": "G. Matot",
      "helpful_votes": 0,
      "publication_date": 20150311
    },
    {
      "title": "Works well for me, the charger input is proprietary ...",
      "text": "Works well for me, the charger input is proprietary so you will have to buy theirs. Battery consumption is kinda high so just buy the wall charger to go with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephen Lynn Morton II",
      "helpful_votes": 0,
      "publication_date": 20150318
    },
    {
      "title": "Not so great.  Would return if I was still within the return window.",
      "text": "Stiff potentiometers on the Nady MM-242 4/8 Channel Mini Mixer. Makes me wonder if they are gummed up. The Nady MM-242 4/8 Channel Mini Mixer gives huge reduction in sound quality when using it. I'm using the mixer for 2-way radio sound so I'm not expecting HI-FI, but this give a noticeable degradation in signal even at voice frequencies. I suppose I should say (to myself) you get what you pay for. I'm going to buy up next time.",
      "rating": 2.0,
      "verified": true,
      "author": "MattJhsn",
      "helpful_votes": 0,
      "publication_date": 20140218
    },
    {
      "title": "Great Product",
      "text": "This is a great mixer, low cost, performs really well. It is perfect for small systems looking to mix a few audio signals together. This is my second mixer, the same model, that have purchased and they both work great. I'm very happy to recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Egalitarian",
      "helpful_votes": 0,
      "publication_date": 20140131
    },
    {
      "title": "Little guy does the job.",
      "text": "If you are not that much into professional music but want to add something to your existing instruments this might be for you. I have a digital piano with line-in inputs and some watts of output. I connected my guitars, my ukelele and my microphones to some of the eight inputs (don't really use stereo sound). I bought some extra 9V batteries so I add more portability without worrying about power noise. Works well. Just lies there among the cables. No need to put it on a stand or table. If you just need some extra channels or want to play with a few friends and already have an amplified speaker you can give this inexpensive mixer a try.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Rojas",
      "helpful_votes": 0,
      "publication_date": 20120112
    },
    {
      "title": "Good product",
      "text": "Gets the job done use it for the korg volca series in mono",
      "rating": 4.0,
      "verified": true,
      "author": "Joe Geiger",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "4 way stereo or 8 way mono mixer. transparent sound - very little coloring",
      "text": "4 way stereo or 8 way mono mixer. transparent sound - very little coloring - CAN be buzzy though, ground it if you are around florescent lights.",
      "rating": 4.0,
      "verified": true,
      "author": "CJ Gausvik",
      "helpful_votes": 0,
      "publication_date": 20151110
    },
    {
      "title": "Fun with Home Recording",
      "text": "After searching 40+ years and finding a former band member living on the opposite shore from me, we decided to get into CakeWalk and carry on with our 60's music. I needed a unit to bring everything together in my home studio. I wanted high quality at a lower price. After weeks of research, I found the perfect unit; The Nady 4/8 Mini Mixer. It works in the studio as well as with my amps located in my basement. Great all around device.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry John Diurba",
      "helpful_votes": 6,
      "publication_date": 20090526
    },
    {
      "title": "Five Stars",
      "text": "Exactly what I needed and received it sooner than stated.",
      "rating": 5.0,
      "verified": true,
      "author": "Ernest Caswell",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Solid product, knobs are very strong.",
      "text": "Product will be used for small set-up for voice and music.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Jay",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Good, but...You'll need adapters for stereo",
      "text": "Good, but...You'll need adapters/adapter cables for stereo. All input and output jacks are MONO 1/4\" phone jacks. No noise with battery operation (my only use right now).",
      "rating": 5.0,
      "verified": true,
      "author": "THE ULTIMATE PIZZA MANUAL 2.0 FANTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20121115
    },
    {
      "title": "Very handy",
      "text": "This works just as expected. It is built well and feels solid.",
      "rating": 4.0,
      "verified": true,
      "author": "Vlad Killmore",
      "helpful_votes": 0,
      "publication_date": 20150701
    },
    {
      "title": "Excellent Idea but very Noisy!",
      "text": "This is an excellent idea. Well made. Actually feels much more expensive than it is. I had \"hiss\" issues each time a signal would be sent thru it by either a Mic or Guitar. But when it's on and no signal is going thru, it's pretty quiet.",
      "rating": 3.0,
      "verified": true,
      "author": "L. Feith",
      "helpful_votes": 5,
      "publication_date": 20120610
    },
    {
      "title": "good value",
      "text": "This is a good value, very versatile and opens up a lot of options for how to run my gear.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Hudson",
      "helpful_votes": 0,
      "publication_date": 20130512
    },
    {
      "title": "Sweet! I use it to mix up tablets with ...",
      "text": "Sweet! I use it to mix up tablets with drum machines =) Portable! Works on single 9V battery so can be used in field with smartphones/tablets and portable speakers.",
      "rating": 5.0,
      "verified": true,
      "author": "Den7even",
      "helpful_votes": 0,
      "publication_date": 20161107
    },
    {
      "title": "Does the job",
      "text": "Good little mixer. My only issue is that I can hear noise when turned all the way up. Other than that it does the job",
      "rating": 4.0,
      "verified": true,
      "author": "Jude Auguste",
      "helpful_votes": 0,
      "publication_date": 20150423
    },
    {
      "title": "Just as good as the 4 channel I have had quite awhile",
      "text": "Just as good as the 4 channel I have had quite awhile. it is a very solid build, and small enough to hang on a mike stand.l ike it a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Gene S Morgan",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "Nice amp.  It works good, but not for what I needed.",
      "text": "It is a line level amp, so it couldn't support my microphones as I hoped. I needed something with a preamp. I didn't return it because of the cost of shipping.",
      "rating": 3.0,
      "verified": true,
      "author": "Dale Chaney",
      "helpful_votes": 0,
      "publication_date": 20140415
    },
    {
      "title": "It works",
      "text": "You get what you pay for. It functions at the basic level of a mixer.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170811
    },
    {
      "title": "Good for the price, just keep it low",
      "text": "Good for the price It works ok when the knobs are less than halfway but after that it strats to introduce noise.",
      "rating": 4.0,
      "verified": true,
      "author": "Mauricio Maiste",
      "helpful_votes": 0,
      "publication_date": 20150820
    },
    {
      "title": "My Nady mixer with the battery has a bad hum and I cannot use it",
      "text": "I am an independent film maker. I am looking for a mixer when I film with more than one microphone. I did a lot of research and my choice was between the Nady 242 and the Azen Cam-3. I need absolute clear audio.I heard about the hum from the Nady, but if you use the battery there is no hum. My Nady mixer with the battery has a bad hum and I cannot use it. It should be OK if your using it for a band or loud music. Looks like I'll try the Azden Cam-3 to see how it works.",
      "rating": 2.0,
      "verified": true,
      "author": "James Mecannic",
      "helpful_votes": 4,
      "publication_date": 20141113
    },
    {
      "title": "Great mini mixer!",
      "text": "I purchased this unit for use at our church. We needed a few extra channels for media, to patch into our exiting board. It works perfect for the line level devices we are using; DVD, PC, CD and cassette deck. There is no noise/hum. We are using a power supply, so I do not know how it works with batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Walters",
      "helpful_votes": 0,
      "publication_date": 20101219
    },
    {
      "title": "Quick shipping and as described.",
      "text": "Quick shipping and as described. Used to combine the audio from up to (4) computers. Needed \"stereo breakout 3.5 mm TRS to dual 1/4\" in TS\" cables. Length as required. Bough \"Hosa Technology\" cables. Fed combined output to computer sound system with sub. This worked perfectly in that application. Sound is excellent. Powered with a 9V power supply instead of a 9V battery.",
      "rating": 5.0,
      "verified": true,
      "author": "SpaceCadet",
      "helpful_votes": 3,
      "publication_date": 20160329
    },
    {
      "title": "Works well short battery life",
      "text": "You are going to want to plug this in. Batteries will not last very long. I got an adapter from radio shack",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20151223
    },
    {
      "title": "Mixer",
      "text": "This one works great on the battery, but the power supply you sent in another order does not work with this unit. I think it may be the wrong polarity. I will check it when I get home to be sure. You sent model # tpw-0900650. That may be why the other unit didn't work, if it is the wrong polarity than it may have damaged the unit. If it is the wrong polarity, I can fix it. Bill",
      "rating": 5.0,
      "verified": true,
      "author": "William C. Adams",
      "helpful_votes": 0,
      "publication_date": 20110728
    },
    {
      "title": "Works perfectly, especially the overload lights. I use ...",
      "text": "Works perfectly, especially the overload lights. I use a cheap AC/DC adapter and the 50hz hum is not signifcant if you max the signal input gain. For amateur/home studios you can't go wrong with this piece.",
      "rating": 5.0,
      "verified": true,
      "author": "Shimron Elit",
      "helpful_votes": 0,
      "publication_date": 20150405
    },
    {
      "title": "not fantastic but works for what i want it for.",
      "text": "I am using this because the media keys on my keyboard don't work with the archaic media player I like, and I can run music and other AV on my second computer, while I play videogames on the beast without having to alt+tab every time I want to pause or next song. This is nice since I can feed up to 4 stereo (8 mono) inputs through my tube amplifier. Since using this, I have developed a hiss at low volumes more pronounced than normal for a tube amp. I may upgrade from this one, but I will still have other uses for it.",
      "rating": 3.0,
      "verified": true,
      "author": "Psike",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "The item arrived ahead of schedule and I'm very pleased. As initial testing",
      "text": "The item arrived ahead of schedule and I'm very pleased. As initial testing, the unit works well with inputs either from mic, guitar, TV and other musical source.",
      "rating": 5.0,
      "verified": true,
      "author": "skywalker",
      "helpful_votes": 0,
      "publication_date": 20141121
    },
    {
      "title": "mixes, but sounds bad",
      "text": "well, it mixes the sound. Unfortunately, it sounds bad after it's mixed. There is no bass response. I have an older version of this mixer, same model but looks a little different. The older one sounds much better. I may try to send this one back and get a replacement to see if this one is just defective",
      "rating": 2.0,
      "verified": true,
      "author": "SickOfBluray",
      "helpful_votes": 2,
      "publication_date": 20141105
    },
    {
      "title": "good product",
      "text": "It's a great product and it works for me. But does not include the power adapter. When I opened it I was surprised at the size of it. I wasn't expecting it to be so small.",
      "rating": 4.0,
      "verified": true,
      "author": "sam",
      "helpful_votes": 0,
      "publication_date": 20150130
    },
    {
      "title": "I hate it!",
      "text": "I got what I paid for, a very cheap, low quality mixer. The B channel only worked for 1 week. Otherwise, looks good, but that's not really the point.",
      "rating": 1.0,
      "verified": true,
      "author": "Kip Kasper",
      "helpful_votes": 0,
      "publication_date": 20131107
    },
    {
      "title": "Review",
      "text": "I have been looking for a compact active mixer for use in automotive (motorcycle) systems for some time. While this is somewhat larger than I wanted, it seems well built and functions excellently. The only con I might give it is the lack of external power capability.",
      "rating": 5.0,
      "verified": true,
      "author": "Van",
      "helpful_votes": 0,
      "publication_date": 20110813
    },
    {
      "title": "buy it",
      "text": "FOE the price and size it rocks..my band did a demo on this and my netbook and it sounds better than the 4 track analog my band recorded on vinyl in 1994",
      "rating": 3.0,
      "verified": true,
      "author": "john bowen",
      "helpful_votes": 0,
      "publication_date": 20140326
    },
    {
      "title": "You get what you pay for, but it works",
      "text": "It works as advertised, but having to adjust the left and right volume levels for every input (and the output) in stereo mode is annoying. Also, the paint smudges very easily and starts to smear, so it ends up looking disgusting in a couple days. It also does not come with a power adapter. The only reason I purchased this item is because there aren't any other devices that perform the same function (Multiple stereo input, one stereo output), and as such I don't really recommend it. There are just no other options at the moment.",
      "rating": 2.0,
      "verified": true,
      "author": "L Davis",
      "helpful_votes": 0,
      "publication_date": 20170404
    },
    {
      "title": "... price are low you would think they wont work good but they",
      "text": "it work out grate every thing that I buy from Nady is work out and there price are low you would think they wont work good but they do",
      "rating": 5.0,
      "verified": true,
      "author": "george garcia",
      "helpful_votes": 0,
      "publication_date": 20141128
    },
    {
      "title": "Simple and excellent!",
      "text": "Perfect, low cost mini mixer. Exactly what I expected and very easy to use. I did order the 9V optional plug later though and recommend doing so when you order this.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20130902
    },
    {
      "title": "Defective and poorly made",
      "text": "Unfortunately mine was defective. It would appear quality control is generally poor for this particular product. There was plastic threads hanging out of the jacks, some of the jacks were lose feeling. Unfortunate, if they could redesign these and stick close to this price point they would have a winner. But it is what it is. Having to retun my unit.",
      "rating": 1.0,
      "verified": true,
      "author": "Allen Gee",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Three Stars",
      "text": "Not really quite as claimed. Interference noise at low sound volume levels,",
      "rating": 3.0,
      "verified": true,
      "author": "Larry K C Lee",
      "helpful_votes": 0,
      "publication_date": 20151019
    },
    {
      "title": "Not bad for the price",
      "text": "Little mixer does a good job. Just watch master volume level. If it's too high you get distortion. To avoid spending money on batteries, I went ahead and bought a standard universal ac/dc adapter which was very noisy (loud hum or high ripple dc content). Wouldn't recommend anyone doing this but since I have a background in electronics, I went ahead and opened up the unit, soldered 2 electrolyte capacitors in parallel (one 6800uF, the other 4700uF) across the dc in under the circuit board. Now it's quiet as a mouse.",
      "rating": 4.0,
      "verified": true,
      "author": "Gerard",
      "helpful_votes": 0,
      "publication_date": 20160129
    },
    {
      "title": "Bad idea. It makes a scratchy sound at random ...",
      "text": "I picked this up so i could simply send 2 channels in to 1 PA speaker. Bad idea. It makes a scratchy sound at random times, like scratchy pots would when turning them, or like a loose connection would make when wiggling it, but it does it without anything being touched.. (even at low volumes, so i know its not being vibrated) Also, turning up the \"volume\" knobs just 5% of the way gives you about 50% of the volume, then the remaining 50% can be slowly achieved by turning the knob up the rest of the way. All 10 knobs are like this.",
      "rating": 1.0,
      "verified": true,
      "author": "JakeGuy4",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "Description error",
      "text": "Product description says unit has balanced input/outputs but the manual confirms they are actually unbalanced. Will not return because the price is right and it seems to work for my purposes, but be warned if you need balanced.",
      "rating": 3.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 5,
      "publication_date": 20110902
    },
    {
      "title": "Just arrived. Ready to send back.",
      "text": "Just arrived. Ready to send back. Two volume knobs are attached crooked and stuck part way without full range of motion. Not even going to see what it sounds like. Build is crap and I'm not going to fight with the knobs every time I want to use it. Disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Armato",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Buyer BEWARE!",
      "text": "This product is such a poor design. Stereo channels still output as mono even when plugging into any of the channels (stereo switch is on!). Even when attempting to test the B side, the other side of my headphones provides no sound. If it was true stereo it should be able to have it able to use one 1/4in input. Now I have to purchase all male 1/4 splitters just to see if it'll actually work as intended?? This model needs a heavy revision. Add tracings to the PCB so the stereo channels are actually combined to 4 inputs and 1 output as described!",
      "rating": 2.0,
      "verified": true,
      "author": "Bryce Unger",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "Surprisingly well made",
      "text": "I use this with my Canon T3i with 3 condenser mics. (Pyle-pro PLMC15) ....wow...great audio. For as little as all of this costs...It exceeds my expectations!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Rackham",
      "helpful_votes": 0,
      "publication_date": 20140131
    },
    {
      "title": "Suitable for simple configurations",
      "text": "I bought this for a freind. He said it worked well for his event. The 3 star rating is only because I didn't actually use the mixer. Consider it neutral.",
      "rating": 3.0,
      "verified": true,
      "author": "techfella",
      "helpful_votes": 0,
      "publication_date": 20170323
    },
    {
      "title": "Good design poorly executed",
      "text": "I wish I could rate this higher looks great and sturdy and works well but I had to return the first one as only one of the output channels worked (much like another review mentioned). Hopefully it lasts.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Adelsberger",
      "helpful_votes": 0,
      "publication_date": 20160420
    }
  ],
  "product_meta": {
    "title": "Nady MM-242 4 Stereo / 8 Mono Channel Mini Mixer with mono/stereo mode, ¼” Inputs and outputs – battery powered, or use optional AC adapter",
    "description": "Dozens of applications for this extremely useful mixer at a very affordable price \n\nThe Nady MM-242 allows you to easily combine mono or stereo signals together and adjust their relative volumes. Ideal for DJ equipment, synths and guitar rigs, studio, stage, the MM-242 is a great tool to have around everywhere. Mono/stereo mode selector switch determines whether all 8 inputs are mixed to both 1/4\" outputs or are preserved as stereo signals, so you have greater flexibility and mixing options. Connect the ¼” outputs of this little workhorse directly to your PA or recording device for ultra-clean audio. Eliminate the need for bulkier, more expensive mixers, and take the MM-242 anywhere with you with its 9VDC operation using either a 9V alkaline battery or the optional PAD-1 AC/DC external adapter. \n\nSpecifications\n\nInput Impedance: 50kΩ\nOutput Impedance: 120Ω\nMaximum Output: +7dBm\nFrequency Response: 20Hz-30kHz\nTHD: 0.07%\nS/N: -95dB\nNoise Floor: 120uV\nInputs/Outputs: 1/4” unbalanced\nPeak LEDs: light 3dB before clipping\nCurrent Drain: 19mA\n9V Battery Life: up to 35 hours\nPower Requirements: 9V battery or optional PAD-1 AC/DC adapter",
    "rating": 4,
    "feature_bullets": [
      "Eight mono ¼” inputs with individual volume control and two ¼” outputs with Master Volume Controls.",
      "Two modes of operation: In stereo mode, 4 inputs (A1 through A4) are routed to output A, while the other 4 inputs (B1 through B4) are routed to output B. In mono mode, all 8 inputs are summed to both outputs, still with separate master volume control",
      "Heavy-Duty Steel Construction with smooth-turn, ultra-stable pots and high-quality jacks. Compact design is easily portable with 9V battery operation",
      "Up to 25dB of gain and professional audio quality: S/N ratio of 95dB and frequency response from 20Hz to 30kHz. Peak LEDs facilitate proper gain adjustment",
      "9VDC powered with either 9V alkaline battery or optional PAD-1 AC/DC external adapter"
    ],
    "specifications": {
      "Item Weight": "1.4 pounds",
      "Product Dimensions": "5.8 x 4.3 x 2.1 inches",
      "ASIN": "B0009XH4HU",
      "Item model number": "MM242",
      "Customer Reviews": "4.0 out of 5 stars235 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#31,708 in Musical Instruments",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 8, 2005",
      "Color Name": "MM-242"
    },
    "categories": [
      "Mixers",
      "Musical Instruments",
      "Electronic Music, DJ & Karaoke",
      "DJ Equipment"
    ],
    "price": ""
  }
}