{
  "website_summaries": [
    {
      "verdict": "Though it's far from perfect, the inexpensive Kodak EasyShare C330 is easy to use and produces relatively high-quality photos.",
      "pros": [
        "Competitively priced",
        "capable of producing relatively high-quality photos",
        "easy-to-navigate onscreen menus",
        "integration with EasyShare software and dock system"
      ],
      "cons": [
        "Small LCD",
        "limited manual controls",
        "out-of-alignment optical viewfinder",
        "jerky video captures"
      ],
      "aspects": {},
      "publication_date": 20051104,
      "rating": 6.4,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Company and Great Camera!!",
      "text": "This is a great company to buy from!!!!!! They are really reliable and fast!! They told the truth!!!! I bought this USED. It was a great price for used. I am glad I got this:) Works great!!!! There packing is great too!! Nothing broke and everything works and now I have a replacement camera for my docking station cause, I dropped the other one, one too many times:( Well be definitely ordering other used items and new items from this company again!!!!:)",
      "rating": 5.0,
      "verified": true,
      "author": "Vicker H",
      "helpful_votes": 0,
      "publication_date": 20141009
    },
    {
      "title": "Great little camera",
      "text": "This is the best digital camera I have owned so far. It is fairly easy to use, although I'm still learning how all the different functions work. Takes great pictures and I love how you can zoom in while reviewing your pics. The only drawback is the internal memory only holds about 15 pics so you need to upload often or buy a memory card. I'm lucky mine came with one. Most of my friends thought I paid over $100 for this camera and were amazed at what I spent. Great camera, great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie Lunsford",
      "helpful_votes": 0,
      "publication_date": 20081129
    },
    {
      "title": "Batteries were corroded and hard to remove. Had to clean out the battery compartment.",
      "text": "After cleaning it worked ok hopefully it will continue to work for a long time.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Good enough for the price I paid.",
      "text": "I guess for the price I got it (very gently used/ like new), it was a pretty dang good deal, which is why I bought it to begin with. Somebody needs to remind me though that when you buy a camera with batteries, that you have to KEEP buying batteries, lol. We do have rechargeables, but STILL! lol It's a very basic camera and it's good enough. :)",
      "rating": 3.0,
      "verified": true,
      "author": "Austin Stevenson Owens",
      "helpful_votes": 0,
      "publication_date": 20131204
    },
    {
      "title": "missing cables and will not take sd card",
      "text": "I was recently shopping for a digital camera and this one seemed to meet the means.Upun opening I discorcered the usb cord to the computer was missing and could make no other fit. Then I tryed putting in an sd card and it said it needed formamting ,which it did not format I tryed others with the same result.I don't know if it was a bad camerea or dealer neglect.",
      "rating": 2.0,
      "verified": true,
      "author": "Bruce Blanton",
      "helpful_votes": 0,
      "publication_date": 20120816
    },
    {
      "title": "Sweet and easy to use!",
      "text": "I just received this camera order from Amazon.com, and it works great! Very hassle-free and easy to use. My suggestion is to order directly from Amazon.com (which is what I did) instead of an individual or company doing business on the Amazon website. This way, I had confidence in who I was buying from, and I knew if there were any problems, they would be easy to resolve. No problems here, and this camera is a great buy, and a fantastic bargain.",
      "rating": 5.0,
      "verified": true,
      "author": "AmericanDreamer",
      "helpful_votes": 6,
      "publication_date": 20060207
    },
    {
      "title": "A huge surprise",
      "text": "The camera was more than I expected, and with the addition of a 1 gig sd card, It rocks. Only negative, it doesn't take bright pics on an overcast day. OTOH, the flash lights up a room. Worth the money, and get a docking station too.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony M. Kreitzberg",
      "helpful_votes": 4,
      "publication_date": 20061103
    },
    {
      "title": "Better then mine!",
      "text": "Bought this for my 9 year old son because he loves to take pictures. He has been taking pictures everyday since he got it. The software it comes with along with the camera itself are great. I want one now to replace mine which cost three times as much.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Ruhf",
      "helpful_votes": 0,
      "publication_date": 20070121
    },
    {
      "title": "Kodak Easy Share C310",
      "text": "The Kodak Easy Share is A very good camera for the beginner.The camera is very simple to use,light weight and small enough to carry anywhere.Just as simple to down load to your computer",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine",
      "helpful_votes": 0,
      "publication_date": 20090217
    },
    {
      "title": "Kodak C310 vs Kodak C300",
      "text": "The Kodak C310 is a very good camera, but seems a less sturdy when compared to the C300, which my wife bought, and which we had been sharing until I bought the C310. Also, with this particular camera, we noticed a small spot on the inside of the lens, which shows up on metal items. Other than that, I like the camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr.C",
      "helpful_votes": 0,
      "publication_date": 20090920
    },
    {
      "title": "Too pricey",
      "text": "I like the camrera had one before but for the price received no memory card or guide booklet",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda Lynn",
      "helpful_votes": 0,
      "publication_date": 20090916
    },
    {
      "title": "Excellent camera.",
      "text": "This is a good option if you are looking for a non expensive, resistant and trusty camera.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Bank",
      "helpful_votes": 0,
      "publication_date": 20100205
    },
    {
      "title": "Great camara",
      "text": "Purchased to replace my broken camera. I had everthing else and was glad I could get just the camera. ty",
      "rating": 5.0,
      "verified": true,
      "author": "adesigningdivw",
      "helpful_votes": 0,
      "publication_date": 20140103
    },
    {
      "title": "perfect for a teenager",
      "text": "Bought this camera for my 15 year old who loves to take pictures of her friends and animals. Does not have a zoom lens but for what she uses it for it is not needed. I am very satisfied for what it is.",
      "rating": 4.0,
      "verified": true,
      "author": "just me",
      "helpful_votes": 0,
      "publication_date": 20070115
    },
    {
      "title": "Used and in good shape",
      "text": "Camera was used, and did not include any of the accesorries. I am happy with just the camera, as I have all the accesorries. Bought as a replacement( my camera switch went bad)",
      "rating": 4.0,
      "verified": true,
      "author": "Susan Baugus",
      "helpful_votes": 0,
      "publication_date": 20130220
    },
    {
      "title": "As camera ages, battery compartment door is a problem",
      "text": "I've had this camera since 2007, and I've loved it. I keep it cased, and take care of it. It takes an SD card, which holds many images. What I **don't** like after all these years is how the battery compartment door no longer stays closed, so the camera no longer works properly. I don't understand why it was made so poorly. I've noticed this with other Kodak Easyshare models as well; they have the same problem with the battery compartment staying closed as the camera has aged. Other than this, I would highly recommend the camera, even though I must replace it now due to this flaw...",
      "rating": 4.0,
      "verified": false,
      "author": "Karen L. MacLeod",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Great Little Own the Go Camera",
      "text": "I've been using this camera for a about 2 months now and over all its a pretty nice digital camera. Only real complaint I have is finding another USB locally. For the life of me I cant find mine and the port is so little that none of my other millions of adaptors will work. Overall a nice around time, quick snap shots of the kids camera.",
      "rating": 4.0,
      "verified": false,
      "author": "Monique",
      "helpful_votes": 0,
      "publication_date": 20070818
    },
    {
      "title": "Wonderful Camera",
      "text": "I ordered the KODAK Easyshare C310 as my first digital camera and I must admit, I'm very impressed with it. The quality of the pictures are very good, and what I enjoy most about the camera is that I can take a picture in pitch blackness and it comes out very clear! That's amazing! So whether day or night, I have beautiful memories to preserve! Highly recommended.",
      "rating": 4.0,
      "verified": false,
      "author": "K-Marie",
      "helpful_votes": 32,
      "publication_date": 20051201
    },
    {
      "title": "Just what I needed",
      "text": "I really like this camera. I use it for photos that I take for my Romantic Oregon Coast Vacations web site [...] It is very easy to use. I also got the dock for it with the rechargable battery pack. This ensures that I'm always ready to go. The photos are nice and clear. Since I got it recently, there are some features that I haven't tried yet, but know that I will use down the road. Just right for a casual photographer. A big thumbs up!",
      "rating": 5.0,
      "verified": false,
      "author": "Tony Thomas",
      "helpful_votes": 0,
      "publication_date": 20061014
    },
    {
      "title": "Not Bad.....",
      "text": "This is a pretty good camera. Takes great pictures. The most important thing is that it's easy to use. Not complicated at all. The one thing I hate is the way it drains the 2 AA batteries sooooooooo fast. If you want to conserve battery then you have to leave the LCD screen off. If that doesn't bother you then this is the camera for you!",
      "rating": 4.0,
      "verified": false,
      "author": "Julz D.",
      "helpful_votes": 0,
      "publication_date": 20061130
    },
    {
      "title": "Decent camera, but what's up with the price??",
      "text": "Why is Amazon selling a camera for $198.89 when Kodak's MSRP is US $139.00? According to the specs, this camera does not include the printer dock, so it's not the combo price.",
      "rating": 4.0,
      "verified": false,
      "author": "B. Smart",
      "helpful_votes": 0,
      "publication_date": 20071121
    },
    {
      "title": "Great Camera!!",
      "text": "This is the first digital camera I have owned and I can't believe how easy it is to use! I love it. It's a great camera for the amount of money I paid for it! I would highly recommend it to anyone looking to get a digital camera. The black/white and sepia options are also very cool. It makes you feel like you're a professional photographer! The pictures come out great and the software that comes with the camera makes it extremely easy to share your photos with friends and family.",
      "rating": 5.0,
      "verified": false,
      "author": "N. Steiger",
      "helpful_votes": 11,
      "publication_date": 20060315
    },
    {
      "title": "Great Camera",
      "text": "I've been using this camera since September, so that is approximately 3 months now. It is a great camera. Takes great pictures, uploads them quickly to the computer and does everything I need it to do.",
      "rating": 5.0,
      "verified": false,
      "author": "Amy",
      "helpful_votes": 10,
      "publication_date": 20051227
    },
    {
      "title": "Great for my 8 year old",
      "text": "I bought this camera for my 8 year old daughter who loves to take pictures. It has worked well for her doing all the things she wants it to. I think it was easy for her to learn to use it. Two days after Christmas we did replace the batteries (I am sure b/c it was used so much due to the novelty) Since then, we have not changed the batteries. She is happy with the purchase and so am I especially for the price.",
      "rating": 4.0,
      "verified": false,
      "author": "Stacy Naulty",
      "helpful_votes": 0,
      "publication_date": 20070115
    },
    {
      "title": "Works with Apple OS X 10.4 and iPhoto.",
      "text": "I was hesitant to buy this camera because I didn't want to have to use Kodak's Easyshare software. Well, if you simply plug the camera into your Mac, iPhoto see the camera just fine. So you have the option of using Kodak Easyshare for Mac, which enables several share features, or simply using iPhoto.",
      "rating": 4.0,
      "verified": false,
      "author": "Raymond Mercier",
      "helpful_votes": 12,
      "publication_date": 20060105
    },
    {
      "title": "Kodak easy share  C310",
      "text": "I am totally not a camera person. ..until now. I love my new camera. It is great for a novice like me and I am so happy with the quality of pictures. I take the camera nearly everywhere I go and love the easy transfer to my computer. JB Dreyer",
      "rating": 5.0,
      "verified": false,
      "author": "Janet Dreyer",
      "helpful_votes": 6,
      "publication_date": 20060223
    },
    {
      "title": "Kodak C310 Digital Camera",
      "text": "The camera takes very nice pictures and when I e-mail them, all are happy the way it goes through. It is light weight and small which is a very important feature for me.I would have been even happier if the instructions were clearer.A lot clearer.",
      "rating": 4.0,
      "verified": false,
      "author": "uncle hank",
      "helpful_votes": 7,
      "publication_date": 20060226
    },
    {
      "title": "Ups and Downs",
      "text": "This camera has it's highs and it's lows. I purchased this camera yesterday, and was amazed at how clear the pictures look on the LCD. Once on the computer, I learned that the pictures I had zoomed in on were slightly pixelated. Slightly, though. The other ones were absolutely perfect! I love this camera. It's really lightweight, makes no sounds, and has three different settings to choose from.{B&W, Sepia, Regular}. It's a great camera for a cheap price. :]]",
      "rating": 4.0,
      "verified": false,
      "author": "Hayleyy",
      "helpful_votes": 8,
      "publication_date": 20060508
    },
    {
      "title": "Easy pics",
      "text": "This was a replacement camera since my granddaughter dropped my original in the toilet....long story! It was exactly what I wanted. I know there are alot of newer cameras but this one has proven to take good pics and is easy to download to computer.",
      "rating": 5.0,
      "verified": false,
      "author": "Nonny",
      "helpful_votes": 0,
      "publication_date": 20090805
    },
    {
      "title": "Kodak EasyShare C310 4MP Digital Camera",
      "text": "This is a great basic digital camera. My only comments are that I find the zoom feature somewhat inconvenient. I take a lot of distance pictures, and if enough time passes in between shots, the camera will revert to the \"normal\" view and you will have to zoom in all over again.",
      "rating": 4.0,
      "verified": false,
      "author": "Erin Solano",
      "helpful_votes": 0,
      "publication_date": 20070104
    },
    {
      "title": "Kodak EasyShare C310 4MP Digital Camera review",
      "text": "For a camera less than $100 it's cool. Got me some very clear and sharp pics too, even after zooming. I only wish the video recording had a sound input port even if no built-in mic. Overall - excellent! Good value for the money.",
      "rating": 5.0,
      "verified": false,
      "author": "Benny Tee",
      "helpful_votes": 0,
      "publication_date": 20070110
    },
    {
      "title": "Kodak C 310",
      "text": "I was disappointed with the product because I thought it had a zoom feature for taking pictures at a distance. It does not. This camera should only be used for close up pictures.",
      "rating": 3.0,
      "verified": false,
      "author": "C. Dellaira",
      "helpful_votes": 3,
      "publication_date": 20061108
    },
    {
      "title": "my easyshare c310",
      "text": "It's just like a new one , have been useing it a lot . thank you. my 310 easyshare is now compleate",
      "rating": 5.0,
      "verified": false,
      "author": "BARBARA voshall",
      "helpful_votes": 0,
      "publication_date": 20121211
    },
    {
      "title": "Poor Customer Service",
      "text": "I did not get the item I ordered, the seller has very poor customer service and is non-responsive.",
      "rating": 1.0,
      "verified": false,
      "author": "Shermeka Mcswain",
      "helpful_votes": 0,
      "publication_date": 20090303
    },
    {
      "title": "Pleased for awhile",
      "text": "The Koadk Easyshare C310 worked for about 2 months, then after each picture I took it shut off. I have changed the batteries over a million times, and it still doesn't work. So, I took it back and got an MP3 player instead.",
      "rating": 2.0,
      "verified": false,
      "author": "Caitlyn",
      "helpful_votes": 8,
      "publication_date": 20060221
    }
  ],
  "product_meta": {
    "title": "Kodak Easyshare C310 4 MP Digital Camera (OLD MODEL)",
    "description": "Kodak Digital (8909434) Kodak EASYSHARE C310\n\nAMAZON.COM\nKodak's C310 is a reliable, easy-to-use digital camera designed to take beautiful shots anywhere, anytime. In fact, the C310 is so smart that it can automatically rotate your vertical shots so they're right-side-up when viewing or downloading to your computer, deliver optimal settings for most standard shooting environments, and even let you immediately tag your shots for later printing or sharing via e-mail. \n\n The power of the C310 starts with the large 4-megapixel image sensor, which can capture enough detail to create photo-quality 11-by-15-inch prints. Kodak's Color Science chip consistently delivers rich, vibrant colors that are sure to wow your friends and family. Best of all, the camera's fast click-to-capture time (0.32 seconds) means you won't miss that fleeting moment when you press the shutter button. \n\n The camera features a 5x digital zoom to help you frame those far away shots, as well as a video capture mode that allows you to take short, silent QuickTime video clips--perfect for nature, sporting events, and other action environments. You can even add a little creativity to your pictures by shooting in one of the camera's color modes: color, sepia, and black & white. \n\n You can store your images in the camera's 16MB of built-in memory or on separately sold Secure Digital memory cards. The camera is powered by AA-size batteries--a size that offers both the money-saving flexibility of rechargeables and the convenience of readily available alkaline batteries. \n\n The C310 is a part of Kodak's popular EasyShare system. The included EasyShare software provides a simple way to edit, organize, print, and view your images on your computer. It is designed to work seamlessly with Kodak's separately sold EasyShare Camera Dock Series 3 and EasyShare Printer Dock Series 3. The Camera Dock provides easy uploading and battery recharging and the Printer Dock does that plus makes high-quality Kodak prints from your digital images in just minutes. \n\n What's in the Box\nKodak EasyShare C310 digital camera, Kodak non-rechargeable digital camera battery, USB cable, wrist strap, Kodak EasyShare software, getting started kit, custom camera insert for optional Kodak EasyShare Camera and Printer Docks",
    "rating": 3.2,
    "feature_bullets": [
      "4.0-megapixel CCD captures enough detail for photo-quality 10 x 15-inch prints",
      "1.6-inch LCD display; fixed 35mm-equivalent lens",
      "Three color modes: color, sepia, and black & white",
      "Compatible with Kodak Series 3 printer dock (printer dock not included)",
      "Powered by AA-size batteries; stores images on SD memory cards (camera includes 16 MB of internal memory)"
    ],
    "specifications": {
      "Product Dimensions": "4.06 x 1.38 x 2.56 inches",
      "Item Weight": "5.4 ounces",
      "ASIN": "B0009ZBVKE",
      "Item model number": "KC310",
      "Batteries": "4 AA batteries required.",
      "Customer Reviews": "3.2 out of 5 stars55 ratings3.2 out of 5 stars",
      "Best Sellers Rank": "#72,413 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 19, 2005",
      "Manufacturer": "Kodak",
      "Language:": "English"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": ""
  }
}