{
  "website_summaries": [
    {
      "verdict": "A thorough classroom pocket calendar that teaches weather terms as well as concepts like \"today,\" \"tomorrow,\" and \"yesterday.",
      "pros": [
        "Great option for new readers learning seasonal and daily orientation terms",
        "Comes with pre-printed cards for days, weeks, months, weather, and more",
        "Hangs using grommets",
        "Thick, quality cards",
        "Easy to read"
      ],
      "cons": [
        "Not as colorful as other options"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Love it even with the flaws",
      "text": "I love this calendar! It’s very large (you can see my kid for size) and well made. I used command Velcro strips to hang it up. I wish there were larger side pockets to store all the extra cards that you don’t need to use weekly/monthly- I’ll be keeping them in a large ziplock bag. The three yellow pockets on the bottom should be deeper as well because they have a Velcro closure but if a card is in there it won’t seal. Even with those few flaws I would buy it again. My kids are 2.5 & 4 so it’s a great learning tool for that age.",
      "rating": 4.0,
      "verified": true,
      "author": "Fatima",
      "helpful_votes": 52,
      "publication_date": 20180205
    },
    {
      "title": "Nice, but no flaps over storage pockets",
      "text": "It’s a nice pocket chart calendar, however, I’m very disappointed that the one I received does not have the flaps over the three pockets, as shown in the pictures, so the cards are constantly falling out of them. Also, still need to figure out what I’m going to do for the months where the 31st will need to be in a sixth row, since the calendar only has five (a limitation I did know about beforehand). You’d think the makers of these calendars would actually look at each month of the year before making these, so that they’d know that some months would require six rows!",
      "rating": 3.0,
      "verified": true,
      "author": "Shelly122812",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Efficient, but eh....",
      "text": "I had one of these in the classroom I did my student teaching in- it was a nice, sturdy fabric material. When I go this, it was a cheap looking plastic canvas material and had poor stitching. The material around the edges had to be cut at the bottom because it was much longer than the actual calendar. Also, the cardboard pieces were very difficult to \"punch out\" and some of the glossy finish peeled off when they finally were separated. This calendar also came with waaayyyyy too many blank squares- I would rather have had more \"No School\" inserts so that my money was put to good use on the cardboard.",
      "rating": 3.0,
      "verified": true,
      "author": "Olivia Smith",
      "helpful_votes": 4,
      "publication_date": 20170104
    },
    {
      "title": "Perfect best quality I've found!",
      "text": "This is perfect for homeschooling to have a fun morning calender time. Great quality on the thick accessories and solid hanging grommets and pockets.",
      "rating": 5.0,
      "verified": true,
      "author": "KristaC",
      "helpful_votes": 8,
      "publication_date": 20171022
    },
    {
      "title": "Awesome interactive learning calendar!",
      "text": "I’m not a teacher, just a mom. I got this to help my toddlers with the concept of time (today versus tomorrow versus yesterday vs next week, etc) and have no educational background but it’s super easy to get them involved. It had some super random cards that went with it but covered all the basics. It’s much bigger than I expected it would be, so check the dimensions if you have a certain spot you have in mind. It wouldnt fit on a closet door bc it was too wide, but it did fit on our playroom door. I bought some of those Command hooks to hang it with. Works like a charm!",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie L.",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Well made learning chart for preschoolers or K",
      "text": "The quality exceeds my expectation as it is well made and much bigger than I thought. The variety of cards covered dates days months years weather festivals seasons and much more like birthday or school related events. More thoughtful is the extra blank cards for replacement if the printed cards are lost or damaged. (This happens often, the kiddos can rip off a new toy in minute!) My son loves it and this really helps him to learn as he can visualize and recognize the words as time goes. I think it's a worth buy especially if your kids are doing remote learning like mine. Highly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "C. CHOW",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Excellent quality",
      "text": "This is much bigger than I pictured after reading the dimensions. The material is very sturdy and seems like it will hold up very well. All of the major holidays have cards and there are even a few blank cards that you can use to make your own. The cardboard cards could use some work since a few of them had the paper tear a little when removing them from the pop-out sheet. It was nothing major in my opinion though. I might just laminate them so they last longer. Overall, I think this is a perfect calendar for small children.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "some complaints",
      "text": "1. no consideration for hanging ..no stickers included. so I taped it. 2. this month of May 1st start from Friday of the week, when it comes to the end it only fill up to 30th. so I had to put the 31st on the top row ; first week of the sunday... poorly design...",
      "rating": 3.0,
      "verified": true,
      "author": "AL",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Great but more than we need for homeschool",
      "text": "Heavy duty, pretty sure this is the same one I saw in the kindergarten classroom. Love all the options for cards, but is a bit overboard for virtual. Pay attention to the size, this thing is huge, and lots of good cards because of classroom diversity + multiple bdays/month, but we won't use the majority of them. Keeping and did hang up, we'll use it, but wish I would have purchased something more compact.",
      "rating": 5.0,
      "verified": true,
      "author": "kristen",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Good but More Rows Needed",
      "text": "Wish their was one more row for the dates for a full month. This August started on a Saturday, that made it with one row short. Sooo I will have to remove August 1st to create the last row for the month. Also wish there were pockets on the back for storage of extra pieces. I ran out of space in the front pockets. As far as disability and content, 10/10. Lost review point for the above mentioned misses.",
      "rating": 3.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Great product for distance learning",
      "text": "We were awaiting the arrival of this and were so excited when it arrived! It’s very sturdy and thick and will last a long time. We are using it to supplement preschool learning at home and are pleased with how easy this was for our children to use. I gave it four stars because of how heavy it is. To use this you will need a chart stand Otherwise I don’t see nails being sturdy enough to hold this.",
      "rating": 4.0,
      "verified": true,
      "author": "Cal River Farms",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Works great! Good for home and probably classroom settings",
      "text": "This is perfect! My son is on the spectrum and is learning months and weekdays at school, as a kid who loves sets (colors, alphabet, numbers, shapes, months, etc), I wanted to make sure he understands the context of the days and months, etc. He is 4. He loves this already! It’s in our kitchen so that we can remember to practice learning days together as a family every day. It’s very big and he pieces seem sturdy. Used regular picture hanging hooks to hang it on drywall.",
      "rating": 5.0,
      "verified": true,
      "author": "NikkoHam",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Mummy approved.",
      "text": "Mom approved. With everything going on I need to make my house more school-like and with my oldest being autistic, it's a must. I got it on time and undamaged. Bought hooks to hang it on wall. Comes with so many cards and even blank ones. Idk I really like it. I just got it but if you don't savagely handle it I think it should last a while. I don't regret buying, my daughter is happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Great quality calendar!",
      "text": "Great quality calendar! Keeps my 2 year old entertained and also educational. Only thing I wish it had more holidays like Mother’s Day and Father’s Day. It comes with some blank tiles so I guess you can add what you want.",
      "rating": 5.0,
      "verified": true,
      "author": "cbugai",
      "helpful_votes": 2,
      "publication_date": 20190621
    },
    {
      "title": "Cards were molded",
      "text": "This product is great because everything is large so it is easy to read. The order in which the days of the week are sequenced “today”, “yesterday and tomorrow” should be switched around though so that kids won’t get confused because the days of the week aren’t sequenced when put into the order the calendar comes in. Also a big thing was that my cards were moldy when they arrived. They smelled like a basement and had visible mold on it. I was going to return the product however I just decided to use bleach to wipe them down before popping them out of the sheet.",
      "rating": 3.0,
      "verified": true,
      "author": "AB94",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "It smells bad",
      "text": "Very sturdy and strong. Good quality. Great pictures. Only problem is the smell. It smells like it has been in storage for 30 years. I thought it might have mold, but it does not. It's a great size, but the pockets at the bottom aren't big enough to hold the days of the week so the velcro doesn't close so the cards can slip out while moving it.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Great Calendar",
      "text": "My grandchildren are learning concepts about days, weeks, months, years, seasons, etc. while at home during online instruction. The first-grader is relating to these concepts so much better now. My only suggestion would be to have the pockets in the order of: Yesterday—Today—Tomorrow. The chart shows it as Today—Yesterday—Tomorrow.",
      "rating": 5.0,
      "verified": true,
      "author": "Nana",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Great product! Highly recommended!",
      "text": "This is a great product. I homeschool my son and this is incorporated in our daily circle time. He loves it! It comes with blank cards for customization. If i had to give any feedback it would be to add pocket stitching to the weather portion to help keep cards from collapsing forward. Also, to add Moon phase cards (but that's just me, lol and thanks to the blank cards... I created some myself!)",
      "rating": 5.0,
      "verified": true,
      "author": "ALEXIS",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Poorly made",
      "text": "Poor quality. Quite a few of the headings are covered by the cards due to shotty placement of the pouches. Also cards are in the pouches as far as possible. Strong odor when opening pack. I would have returned it but I already popped all the cards out of the card sheets so im not sure they would take it back anymore. Over priced for this quality. Maybe try a different seller",
      "rating": 2.0,
      "verified": true,
      "author": "Nursetobe",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "I'd buy again!",
      "text": "Great texture, durable. A bit confused about this December 2018 calendar though, I can't fit every date on there. It may be because Dec. 1st started on Saturday this year (the last \"day of the week\" in the top row of the calendar. Unless, someone knows a trick to this? Other than that, it's been a great learning tool, at home with our 3 year old daughter. Many holidays and extras to choose from that came with the calendar! Easy to punch out all the dates and special date pictures! I'd buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "It’s huge.",
      "text": "This is a nice calendar, but I wish I had looked more closely at the size. It is huge! Bigger than my kid huge. Won’t fit on the back of a door huge. Will have to rearrange my downstairs to find a place to put it huge. The other downside is the super convenient pockets at the bottom to hold the spare pieces are too small. Great idea, love that it has Velcro to close, but the Velcro is useless because the pieces cover it.",
      "rating": 4.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Sturdy and Durable",
      "text": "This is my second purchase of this calendar. I have one at school and purchased one for Live Video lessons during Distance Learning. The one that I have in my classroom still looks new after more than a decade; however, two years ago I ran out of preprinted year cards. I was excited to have new cards with this new calendar. I was disappointed to find out when I got it that the calendar has been sitting around since 2017, so three years of preprinted cards are wasted.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Fitzpatrick",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Ripped in several dots after 3 months of short time use",
      "text": "We bought this back in May to help our son who has autism not loose his calendar skills. Since we had been home and noticed he was forgetful of the days of the week- My wife loves this and uses it everyday. She actually bought hooks and hung on a clothing rack.. we use during home circle time. Sadly it’s ripped and is not ripping in a few places. The rips are now effecting our son and he keeps mentioning it’s broken.",
      "rating": 3.0,
      "verified": true,
      "author": "Jason Avon",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Great calendar for kids!",
      "text": "This calendar and weather chart is perfect for my 2 and 4 year old children. It is really durable for them to insert the items themselves and the pockets are great. There isnt enough room to hold all of the items, but I just have a separate envelope to hold the extras. I would definitely recommend to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "A.02",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Some design flaws",
      "text": "I wanted to like it because of the durability. However, there are some design flaws which I don’t want to keep: 1) the days lists as today, yesterday and tomorrow, which logically is not easy to get for a young kid. 2) the event card would totally block the date number. Hope could be some changes.",
      "rating": 1.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Don’t buy! Stained our wall!",
      "text": "The product itself was okay but it stained our wall after using it for a couple of weeks. Started to make a dark outline and discolor the paint. We have very nice sherwin Williams paint on the wall not cheap paint. I’m not sure what is wrong with this calendar or what is on it causing it to do this but I do not recommend this product!",
      "rating": 1.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 2,
      "publication_date": 20190613
    },
    {
      "title": "Beautifully made and very very  large",
      "text": "I got this for my 2 year old and right now he just wants to pull out all the numbers. They are cardboard, so if your kid is very oral still- they can ruin the cards. It will be perfect when he is a little older. A Please note the size. Make sure you have a nice big spot picked out on your wall. I honestly love it so much though.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristianna S. ",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "At least the kid loves it",
      "text": "This calendar is HUGE and heavy! My toddler loves it. Pictures are super cute for holidays and other special events.... buuuut.... my calendar came out of the package damaged in several areas. Large slits in the blue fabric, discolored (looks like water damage) on some of the pieces, and some of the letters are worn off... somewhat disappointing",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan Mazingo",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Worth the money.",
      "text": "We love this calendar. It is very large and perfect for my 4 year old. My only complaint is that it has every holiday you can think of and then we get to May and I went to look for Mother’s Day and Memorial Day and both of those holidays were no where to be found. Why are those missing? I am a little disappointed this but used other markets to signify the holiday. Overall a great product.",
      "rating": 4.0,
      "verified": true,
      "author": "sarah",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "All in one weather and calendar center...kids love it...teacher loves it :)",
      "text": "I was really impressed with this set, and the quality was better than expected! I use it with my toddlers and preschoolers as we do our morning center time. They get so excited to do the days of the week and weather of the day! Great resource with lots of weather/season/holiday selections plus blanks to write in your own events. Great tool...you'll use it \"everyday\"...",
      "rating": 5.0,
      "verified": true,
      "author": "April Robison",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Good learning tool",
      "text": "Great for my visual learners! I put this up in one of my kids rooms that also serves as a “school” room. And they love how big all the numbers are, that they get to put the calendar numbers in themselves, and help count down to fun activities. I’m glad I bought it!",
      "rating": 5.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Missing a whole row!",
      "text": "Overall this calendar is what I needed for my kids. My main issue with it is that there is not enough room for the days of the month. For example: May 2020 has 31 days. There is no spot for me to place the 31. It’s basically short a whole row. There is also a lack of storage space for all of the holidays, weather, months etc.",
      "rating": 3.0,
      "verified": true,
      "author": "Katie Gibson",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Great, especially for use during remote learning",
      "text": "We got this calendar because my son's teacher had the same one while she was doing remote learning with him. It really helped him relate to her through the computer and work well during calendar time. It is sturdy and well made and I love all the holidays, weather etc included. Great price too compared to what I have seen on other sites.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Lynch",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Great addition to our homeschool room!",
      "text": "Since we are distance learning and my 4 year old would ordinarily see this in his Prek classroom, I figured it would be a great addition to our new homeschool room. He loves it! Great visual aid for kids learning the days of the week and months. I was easily able to hang this using command hooks. The material and cards seem sturdy and will last a long time with good care.",
      "rating": 5.0,
      "verified": true,
      "author": "carry ross",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Good quality",
      "text": "Nice calendar and thick cards. I really wanted a calendar that also did days of the week cards and weather. I was able to easily hang with pushpins. Only con is if you have a month that needs 6 rows (like this one), there is only 5.",
      "rating": 4.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Just like preschool",
      "text": "I bought this for my home since I have my son all day due to COVID. He's three and is learning his months and days. This is just like the one I have at work but better. It's so strong and I hung it on the wall with nails. I like that I can take it down and move it around. It comes with all the labels you would ever need to teach about the days and the months. It also has holiday labels for everything. Love this.",
      "rating": 5.0,
      "verified": true,
      "author": "veronica reyes",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Great purchase!!",
      "text": "Love love love this calendar. My son is excited to update it every day. I'm so happy they include blank inserts. I've used my Cricut too make other words. For instance I took an extra blank square and out \"today\" on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Functional but the quality is poor!",
      "text": "It's functional and will work fine for my class. But unfortunately, the quality is not there. Stitching is uneven and the plastic pockets aren't cut straight. I really can't understand how this was passed by the company's quality control management and was allowed to be sold. They got to improve their quality control. After all, Learning Resources should live up to its name brand.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Great calendar for my lil' ones!",
      "text": "We hung this up behind out front door. Our little ones are in charge of updating the calendar. They love it. Every time we head out, we review the month, day, and year, along with the days of the week. Very helpful item to have when teaching these basics.",
      "rating": 5.0,
      "verified": true,
      "author": "Comprona",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Works good enough",
      "text": "We bought this for our autistic daughter as they use something similar at her school. We really like it but I wish they would make all the letter holders out of velcro because within a week into it my daughter has ripped like three of the letter holders and now they are sagging. With her autism she gets really excited and obviously cannot control herself sometimes and she'll pull really hard to get the letters out and unfortunately it's already ripped apart. For normal school children I could see this being very nice and easy set to use though so I only docked it 1 start because I think a design change could really help make this thing last longer.",
      "rating": 4.0,
      "verified": true,
      "author": "musicphreak",
      "helpful_votes": 0,
      "publication_date": 20150806
    },
    {
      "title": "Cute classroom calendar!",
      "text": "I actually really like this! My only minor issue is one of the plastic pockets is sewn through a little bent. It doesn't effect the usefulness of the pocket, I'm just a little concerned it will eventually tear. But regardless I am happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Love! Just missing 2 holidays!",
      "text": "Love ! Only problem I have is the calendar arrived but is missing Mother’s Day and Father’s Day!",
      "rating": 4.0,
      "verified": true,
      "author": "Meadow ",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Product Not As Advertised",
      "text": "I bought this product specifically because it shows the closed yellow pockets on the bottom to help enclose all of the pieces. I noticed other companies charging much less for similar products (without these pockets). I was willing to pay more for this feature. Upon receiving the product - the pockets are not as shown. Very dissappointed. I'd pay less for the other versions out there. Not worth paying the extra money.",
      "rating": 2.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Useful, bright, sturdy",
      "text": "We ordered this at the beginning of quarantine for circle time. My kids love changing the days, and it has been fun to use. It has lots of options and many different cards you can change out for holidays and seasons.",
      "rating": 4.0,
      "verified": true,
      "author": "variationsonatheme",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Well worth the money",
      "text": "Great product, comes with really sturdy cards, my only wish is the large strip for “today’s weather” poses some reinforcements in the plastic window. It sags in the middle. Other than that, everything holds up really well.",
      "rating": 5.0,
      "verified": true,
      "author": "Mandie",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Great calendar for kids!",
      "text": "This calendar is GREAT to teach your 3 year old the days of the week months, and weather. It has extra blank cards that you can use to personalize events and activities! Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Ainahainagirl",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Disappointed",
      "text": "I love this calendar. I use it to teach calendar math. However, I received only numbers 1 through 15. I am so disappointed because I had to create numbers 15-31 with paper. I complained to Amazon but the seller refused to send me a complete set of number cards.",
      "rating": 3.0,
      "verified": true,
      "author": "The Butterfly",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Nice chart!",
      "text": "Great tool to have in my ESL classroom. I use this in tandem with a foam hand pointer stick to go over the month, day, weather, and seasons for our warmup lessons.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Camina",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Teacher and Student approved!",
      "text": "This is one of my favorite pieces that we got for our classroom. Unfortunately the pockets can rip easily, but I still absolutely love it. The kids take turns changing the weather and there is a ton of holidays to choose from.",
      "rating": 5.0,
      "verified": true,
      "author": "NYer523",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Great product",
      "text": "Works great for the in home childcare my wife runs. The kids love it and because it’s durable the kids are able to help change out calendar during circle time making it much more interactive. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Martin",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Sucks for the price",
      "text": "The stuff doesn’t fit in the pockets. Today, yesterday and tomorrow are in the wrong order the little holiday and birthday cards don’t stay in the pocket they fall behind the numbers and you can’t see through them so my child can’t tell what day it is unless she counts. And their aren’t enough lines for the month to start on Saturday and fit all the numbers inter chart correctly without having to put two numbers at the top.",
      "rating": 1.0,
      "verified": true,
      "author": "Lovelace31",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Sturdy and good for several years",
      "text": "I've been looking for this calendar. I love that it has the weather and seasons as well. I find the placement of the 'today, yesterday, tomorrow' a little weird but we make it work. The drawings describe the weather well and help students learn the characteristics of the weather and seasons. I love that it comes with extra years printed out already.",
      "rating": 5.0,
      "verified": true,
      "author": "Mirna",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "High Quality and Great Price!",
      "text": "If you're looking for a high quality calander at a great price, you've found it! I bought this for my 0-3 classroom and it very big and the colors are vibrant . You get alot of extras for the holiday events and even blank ones for your own events! Very nice set!",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Cass",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "THIS IS THE ONE TO BUY!",
      "text": "It's a high-quality product. The plastic pockets ensure that the pieces don't fall away and go missing, which is very important in an elementary classroom. This may be the first calendar I've had to last more than two years. The only negative is that it takes up a LOT of room on the wall or bulletin board; it's a bit of a space-eater. Still, it's also about the only product of its kind left that still comes with a full assortment of holiday cards, so you've nothing else to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "jacovny",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Nice calendar for kids!",
      "text": "It's a great calendar for a child and big numbers and graphics, my only gripe is the \"Today, tomorrow and Yesterday\" section seems unnecessary and confusing. Almost like a space filler. It's fairly large which is great for a classroom but we have it in our child's room which is great too. I would recommend this.",
      "rating": 4.0,
      "verified": true,
      "author": "ichiban3",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Big and Durable",
      "text": "Wow! This chart is so perfect for a pre-k classroom!!! It’s much bigger than anticipated and made out of durable canvas material. Great buy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mandy T",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Sturdy calendar",
      "text": "Sturdy and well made Perfect for our little homeschool area Only negative is there isnt enough space to store all the card with it",
      "rating": 4.0,
      "verified": true,
      "author": "Momshopper",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Perfect!",
      "text": "With school being at home I thought it was important to have a calendar like this for my kindergarten grandson. This calendar is perfect !",
      "rating": 5.0,
      "verified": true,
      "author": "Shopper#1",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "This is a great learning tool for toddlers and preschoolers.",
      "text": "I really love this calendar. There are so many ways that you can use it for teaching so many different skills. Years, months, days of the week, days of the month, weather, seasons, and holidays. Just sending your toddler off to look out the window or go outside and then pick out the appropriate weather icon is a great teaching tool. I also like the fact that there were quite a few blank cards to make your own holidays and events. My only concern is how the plastic sleeves are going to hold up after some vigorous and enthusiastic lessons.",
      "rating": 5.0,
      "verified": true,
      "author": "Maggy H",
      "helpful_votes": 0,
      "publication_date": 20140226
    },
    {
      "title": "Looks awesome but moldy trash.",
      "text": "It had visible mold in the cuts of cardboard through the whole stack of cards and on the pocket chart. Smelled like bad shower curtain. Froze it for 24 hours. Didn't help. Had to throw it away. Delivery service does not need to be shipping mold.",
      "rating": 1.0,
      "verified": true,
      "author": "Anonymous Friend",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Deffective - No Hanging Grommets",
      "text": "I have requested a replacement, but this item originally came with no grommets on the top for hanging. Otherwise, seems like quality materials, just disappointing that it didn't come with a way to hang it. Hoping there are no issues with the replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "N.Erickson",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Good product!",
      "text": "Love how great the material is!it is a lot bigger than we thought so be prepared for it to cover a little less than half the wall:)",
      "rating": 4.0,
      "verified": true,
      "author": "Minsu Park",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Wanted to love it",
      "text": "This is HEAVY, so be prepared to hang it with something strong. It’s cute, However, the cardboard inserts are badly made - images are curling off in the corners already. Plus one of the pocked for the days of the month is randomly missing.",
      "rating": 2.0,
      "verified": true,
      "author": "LH",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Love it , bit pricey but worth it",
      "text": "Happy I made the purchase! Bought for my 2.5 yr old. Goes up to 2026. I'm sure itll get used by my newborn once he is older as it seems very durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonshopper61",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "good quality",
      "text": "I like this product its good to use for a couple of years as well. the only problem is the months started bending on me but it is great besides that. my daughter even loves following along with it",
      "rating": 5.0,
      "verified": true,
      "author": "chanel de leon",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Great quality",
      "text": "This calendar is great quality! The cards that get inserted in the pockets are thick cardboard and are very durable. The pocket calendar itself is made out of thick, well made material. The print is large and easy for kids to see. It has so many detailed options for holidays and special events. I love that it includes the weather and the seasons!",
      "rating": 5.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Product not exactly what is advertised in image",
      "text": "Great product, but I purchased a calendar with velco flaps for the three pockets across the bottom, and the product I received does not have the flaps. Everything else is as expected; the kids love it and so do I.",
      "rating": 4.0,
      "verified": true,
      "author": "Matt Anding",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "EDUCATIONAL",
      "text": "Such a great product, helps kids learn so much! Its eye catching, and I love how there are SO MANY littlecards they don't all fit in the slots so you;ll have to put them away separately.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs.A",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Great condition",
      "text": "Very happy with purchase. Everything came in great condition and easy to install. Wish it came with a little bag to place the extra items but overall it is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Ana",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Very good to have",
      "text": "I bought this calendar for my 3 yr boy to learn the month/year/date/weather, also to get him into study time mode. The Calendar is huge and make sure you have the room for it. They Calendar is sturdy so far as we have only been using for two months. This is a good to have and good teaching tool for the little one. The products came with a lot of cards and as one of the mom mentioned, the calendar cannot hold them all, so i put most of them in a bin, only leave the months/day of week/weather/month in the big pocket at the bottom of the Calendar. highly recommended this products if you have the room for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Gwen",
      "helpful_votes": 0,
      "publication_date": 20140103
    },
    {
      "title": "Great center, great price!",
      "text": "Perfect for what i was looking for! Really nice design, has everything you need in it and its a great price:)",
      "rating": 5.0,
      "verified": true,
      "author": "donna",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Educational and engaging",
      "text": "Liked that this was sturdy and well made. My kids and I enjoy changing out the calendar every month and observing what birthdays and holidays we have each month.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric C Joo",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Good quality, kids love it",
      "text": "I use it in my kitchen for my homeschoolers. The kids really enjoy it and it definitely helps my preschoolers grasp the concept of days, weeks, months, etc. It seems to be made to last. I think we’ll enjoy it for several years before it gets worn out.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous ",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Perfect for preschool classroom",
      "text": "I looked at a wide variety of classroom calendars, but I had a difficult time finding a large calendar that could be changed daily that covered date, seasons, and weather, while being durable enough to last little hands using it regularly. I am so pleased with this purchase! The calendar comes with MANY pieces, including several blank pieces for customization. It is large and very well made. Most of all, I love how it looks in our classroom! Fun way to teach days of the week, months, holidays, seasons, and weather!",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron Triplett",
      "helpful_votes": 0,
      "publication_date": 20150603
    },
    {
      "title": "Great classroom calendar!",
      "text": "Love this! It works perfectly in my kinder classroom. I'm only giving it 4 stars because the yellow pouches are a little small to hold extra pieces. Otherwise it works great in my room!",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Good quality, very happy",
      "text": "I love this calendar! It is very durable, good quality. We use it everyday in my homeschool classroom.",
      "rating": 5.0,
      "verified": true,
      "author": "FoJen",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Great quality!",
      "text": "Great for home schooling, in the classroom or for kids to play school. Easy to hang with command strips! I only wish it came with an organizer/storage for all the inserts.",
      "rating": 5.0,
      "verified": true,
      "author": "iLoveMySailor!",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Stitching not that good",
      "text": "Love it but the plastic pockets are not holding up as well as I hoped they would.......would not recomend since it has not even held up half the year was really hoping not to have to replace it already.....",
      "rating": 2.0,
      "verified": true,
      "author": "Eileen",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Musty/moldy smell",
      "text": "I wish I had taken a photo of the black powder around the \"push outs\" when I opened the package, they smelled like a damp moldy basement. You could definitely tell they had gotten moisture in them at some point and started to mold...I spent alot of time wiping them down with sanitizing wipes after breaking out from touching them, I hope the smell goes away",
      "rating": 1.0,
      "verified": true,
      "author": "CrystalTinsley",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Good Price",
      "text": "I really liked this! The \"weather\" pocket doesn't hold things well, with som considerable ballooning, and the pockets that are meant to hold the cards it comes with arent big enough to stay closed when there are cards inside. Overall though, the price was good for everything it came with! Its also very cute!",
      "rating": 4.0,
      "verified": true,
      "author": "Cate P",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Would be nice if they only sent future years",
      "text": "I gave 4 stars as they gave me too many years past. Would be nice if they only sent future years. What do I need with 2014? Needs to be updated....other than that I really love this product and my 5 year old enjoys changing everything every day.",
      "rating": 4.0,
      "verified": true,
      "author": "Wyldmum",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Good for circle time.",
      "text": "We use this in our preschool for circle time. The kids can interact with it well and it is easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Great ideas, but some flaws",
      "text": "This calendar doesn’t allow you to set up the numbers with the correct day of the week, like a real calendar has, because there aren’t enough number slots, for some months. Also, the TODAY, YESTERDAY, TOMORROW pockets would be better set up as YESTERDAY, TODAY, TOMORROW, in my opinion.",
      "rating": 3.0,
      "verified": true,
      "author": "Cynthia Wig",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Very Durable, cute, and perfect for what I wanted.",
      "text": "This is a great calender. It has the months, year, days (with plenty of holidays ect.), today, yesterday, tomorrow, season, and todays weather. The whole thing is really durable and well made. The cards that do in the slot are also very thick. The pictures are cute. They have plenty of holidays as well as blank ones to make your own. There are also pokets at the bottom to keep the cards you aren't using at the time. It is very big. I am very glad that I bought it. We use it at home as we unschool. I just keep it up and she enjoys looking at all that is on the calender and doing the weather.",
      "rating": 5.0,
      "verified": true,
      "author": "Cherub",
      "helpful_votes": 3,
      "publication_date": 20090516
    },
    {
      "title": "It is a good daily routine for a youngster!",
      "text": "It is a nice size, colorful and sturdy. It is a good daily routine to have with your child.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda A",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Great for preschooling my son at home",
      "text": "Way bigger than I expected but we love it. I would have given 5 stars but there is no holiday card for Veterans Day:/. But there is a card for groundhogs day ( didn't sit well with me) More holiday cards would be nice. It does come with American flag cards which we liked. It also comes with blank cards so you can make your own.",
      "rating": 4.0,
      "verified": true,
      "author": "Alaina Joy Banyas",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "Great calendar!!",
      "text": "Very educative!! I love this calendar for my kids!! It looks durable and good quality!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Awesome!!!",
      "text": "I really like this calendar. It's nice & big so we hung it on the back of the door in our \"school room\" Comes with lots of extra pieces for birthdays & holidays, numbers can be flipped to be made RED or BLACK (for special days or weekend) Great for discussing/learning days of the week, months, weather...and more. Slight problem - if the start of the month begins later than Wed. there won't be enough pockets for all 31 days of that month (no biggie) Material is nice & heavy - very sturdy.",
      "rating": 4.0,
      "verified": true,
      "author": "KorinaNyree",
      "helpful_votes": 0,
      "publication_date": 20140211
    },
    {
      "title": "Wonderful!",
      "text": "We Love our calendar! This has made teaching the months, days and year so much more fun! Great Product, very sturdy material, very thick cards.",
      "rating": 5.0,
      "verified": true,
      "author": "mysterious shopper",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Great calendar! Got this for my 3 and 4 ...",
      "text": "Great calendar! Got this for my 3 and 4 year old preschoolers. We put it up in the playroom and review it before leaving each morning. It's a nice large size, well made and the pieces fit nicely. There isn't a lot of storage so many pieces will need to be stored in another container but that's fine my kids would take them all out and play with them if all were available. In general I'm very happy and impressed with this calendar. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Nicole Hawkins",
      "helpful_votes": 0,
      "publication_date": 20141122
    },
    {
      "title": "Best calendar EVER!",
      "text": "I have been in the school system for over 20 years and I ordered this for my grand daughter to use in her \"virtual classroom\" ... This is the most sturdy, wonderful calendar I have EVER seen or used! Highly Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "lovelifenc",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "One clear pocket missing",
      "text": "Loving this calendar except tang one of the clear pockets for the days of the month was missing. I had to cut the bottom of a zip lock bag and use clear tape to make one ..",
      "rating": 4.0,
      "verified": true,
      "author": "Allison ",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "This calendar is GREAT! We bought this for my daughter as she ...",
      "text": "This calendar is GREAT! We bought this for my daughter as she loves doing calendar at Therapy. Since her therapy time is almost up, she is happy to know that she can continue it at home. She loves to guess what the weather is going to be like outside. I only gave this four stars because this one is more situated for American holidays, and we will have to use a lot of the blank cards to fill in for our Canadian Holidays.",
      "rating": 4.0,
      "verified": true,
      "author": "AmyM",
      "helpful_votes": 0,
      "publication_date": 20150503
    },
    {
      "title": "Exactly what I needed.",
      "text": "Love it, it is exactly what I was looking for. It works perfect in my son's classroom, we are homeschooling him. It also has the numbers in two colors, red on one side, black on the other. It helps him tell the difference between weekdays and weekends. You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Metzger-Smith",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Perfect construction",
      "text": "This works exactly how I need it to in my classroom. Easy to set up and pockets hold cards perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "R Herbst",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Great Calendar for Learning",
      "text": "This calendar is bright, durable and large. It can be seen from a distance (so I can hang it on a wall and have a chance that my young children won't lose all the inserts). It comes with a wide range of inserts showing not only dates/months/years and weather but also special dates. It also includes several blank inserts so that you can create your own. My only gripe - the inserts to show special days are designed to cover the numbers. I'd prefer an extra line as you have for the weather so that the numbers are always visible. I still think its the best learning calendar on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "TJW",
      "helpful_votes": 0,
      "publication_date": 20091030
    },
    {
      "title": "Teachers loved it!",
      "text": "The teachers loved using this in their classroom. Great and durable!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Great product, but faulty manufacturing with ours, as well as not being able to show full month..",
      "text": "We just received this yesterday and put it up this morning. We love it, except the fact that it is missing a pocket (as seen in pics) and more/bigger storage pockets for all of the extra cards would be great. It also doesn't have enough rows to fit a 6-week calendar month, ie this month, as seen in last pic (no 30th or 31st).",
      "rating": 3.0,
      "verified": true,
      "author": "Momof3",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Great for kids",
      "text": "This is huge, and very helpful for visual learners! Great addition to our homeschool",
      "rating": 5.0,
      "verified": true,
      "author": "Dominique P",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "AMAZING VALUE",
      "text": "Wowzers! This calendar is amazing! So many pieces and worth even more than what they are charging. We used this for distance learning with out Preschooler",
      "rating": 5.0,
      "verified": true,
      "author": "BryannaAnderson",
      "helpful_votes": 0,
      "publication_date": 20200602
    }
  ],
  "product_meta": {
    "title": "Learning Resources Calendar & Weather Pocket Chart, Classroom Organization, Homeschool Supplies, School & Classroom Supplies, 136 Piece,Multi-color,30 3/4\" x 44 1/4\", Ages 3+",
    "description": "This sturdy, vinyl pocket chart will makes a visually appealing introduction to weather. Includes pre-printed, double-sided cards for dates, days of the week, months, years, yesterday, today, tomorrow, holidays and celebrations, weather conditions and seasonsmdash;136 heavy-duty cards in all! \n\n\n\nFROM THE MANUFACTURER\nCalendar and Weather Pocket Chart is sturdy, vinyl pocket chart will makes a visually appealing introduction to weather. This includes pre-printed, double-sided cards for dates, days of the week, months, years, yesterday, today, tomorrow, holidays and cel",
    "rating": 4.7,
    "feature_bullets": [
      "VISUALLY ENGAGING: Engage children in learning about seasonal happenings and weather with this illustrated chart! Great way to entertain the kids!",
      "EVERYTHING YOU NEED: Features 136 double-sided, full-color cards",
      "QUALITY MATERIALS: Sturdy flame-retardant vinyl chart with hanging grommets measures 30.75\"L x 44.25\"H",
      "PERFECT FOR HOME LEARNING & CLASSROOM INSTRUCTION: Great for ages 3+"
    ],
    "specifications": {
      "Manufacturer": "Learning Resources",
      "Brand": "Learning Resources",
      "Item Weight": "2.2 pounds",
      "Product Dimensions": "30.4 x 13.5 x 0.3 inches",
      "Item model number": "LER2418",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Multi-color",
      "Cover Material": "Vinyl Chart",
      "Material Type": "Vinyl",
      "Number of Items": "1",
      "Size": "30 3/4\" x 44 1/4\"",
      "Manufacturer Part Number": "LER2418",
      "ASIN": "B000P86RMC",
      "Customer Reviews": "4.7 out of 5 stars1,255 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#486 in Office Products",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "March 14, 2007"
    },
    "categories": [
      "Office Products",
      "Office & School Supplies",
      "Teaching Materials",
      "Education & Crafts"
    ],
    "price": 36.99
  }
}