{
  "website_summaries": [
    {
      "verdict": "If you’re looking for a jewelry-making kit that young kids can enjoy, this set is a good choice. A versatile option that even allows siblings of different ages and genders to work together.",
      "pros": [
        "Chunky wooden beads are easy for little fingers to grip",
        "Great for developing hand-eye coordination and polishing fine motor skills",
        "Comes with a good variety of shapes, letters, and colors that both boys and girls can appreciate",
        "Quality construction"
      ],
      "cons": [
        "While the partitioned box itself is well-made, the absence of a lid can make storage tricky"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "No lid, once again",
      "text": "Lids, lids, lids. How hard would it be to provide lids?! Does anyone from Melissa and Doug actually care about reviews---because they would find out pretty quickly that we ALL want lids.",
      "rating": 3.0,
      "verified": true,
      "author": "Taylor Deere",
      "helpful_votes": 31,
      "publication_date": 20161215
    },
    {
      "title": "We love Melissa & Doug products!",
      "text": "I got this set for my 5-year-old because he wanted to make his friends some bracelets and necklaces for Christmas. We love this set and you get a lot of beads for a very affordable price! The strings are also of excellent quality. We love Melissa & Doug products! Only one miniscule complaint is that I wish this came with a storage or at least a top lid for the tray it came with. Other than that, this is a great buy and highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Naomi",
      "helpful_votes": 4,
      "publication_date": 20181226
    },
    {
      "title": "Very nice bead set!",
      "text": "I expected a larger size, however it is a very nice set and the kids love it. I like that it came with plenty strings and clips for the ends to snap together because other brands I've purchased did not have enough. I also like how the beads, especially letter beads, are not tiny like other sets.",
      "rating": 5.0,
      "verified": true,
      "author": "ashP",
      "helpful_votes": 2,
      "publication_date": 20181101
    },
    {
      "title": "the letters and charms are a pretty good size",
      "text": "Cute set, bought this for my 4 1/2 year old, the letters and charms are a pretty good size, very cute, definitely needs help with securing the string to the clasp with a knot. The set comes wrapped in clear plastic wrap and once it's opened there's no lid or anything really that could cover up the little charms making it very easy for it to spill everywhere and pretty hard to store it.",
      "rating": 3.0,
      "verified": true,
      "author": "MG",
      "helpful_votes": 2,
      "publication_date": 20160823
    },
    {
      "title": "nice beads, but would be better if it had a lid",
      "text": "Bought as a christmas present this was a wise choice, Comes with decorative beads, letters, and strings to string them on. The strings are made of nylon and easy to slide into the wholes in the beads. Only reason i give this a 4 and not a 5 is the packaging is not practical. Its is packaged in a nice wooden box, but has to be store lying flat. It does not come with a lid! My daughter would play with these more if it was in a practical storage spot but that is not practical without it having a lid",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon customer",
      "helpful_votes": 0,
      "publication_date": 20160113
    },
    {
      "title": "Nice set, but easily scattered",
      "text": "This is a very nice beading set, appropriate for even small kids (3-5 yrs old). Something to be aware of: There is exactly one layer of beads in the box. What you see in the picture is exactly what you get. The tray is a nice sturdy wood, but it's very shallow - about half an inch deep - so you'll likely need to find something else to keep all the beads in. It doesn't come with a lid or anything to keep the beads in place, so I can see them getting scattered and lost very quickly once the plastic shrink wrap is removed. I give four stars for the overall product for this reason.",
      "rating": 4.0,
      "verified": true,
      "author": "Marie T.",
      "helpful_votes": 4,
      "publication_date": 20120314
    },
    {
      "title": "Only missing a cover for the bead receptacle",
      "text": "I love Melissa and Doug products, which are generally really well made. The only reason why this product got 4 stars was that I wish that the box had a cover. The only cover is the plastic wrapper, so once you remove it, you could have beads flying everywhere (unless you put them all in a zip lock bag like I did). That could be especially problematic if you have little ones around for whom the beads would be a choking hazard.",
      "rating": 4.0,
      "verified": true,
      "author": "Ree Vewur",
      "helpful_votes": 0,
      "publication_date": 20151230
    },
    {
      "title": "No lid?  What could go wrong?",
      "text": "The product is nice enough, good variety and quality, but I have a beef with a few of Melissa & Doug products, including this one, which is that they have a lovely compartmentalized box and no lid, so the box is pretty much useless once the cellophane comes off. The beads and stuff are just fine and my daughter (5 1/2) enjoys playing with them...",
      "rating": 3.0,
      "verified": true,
      "author": "Julianna M. Lower",
      "helpful_votes": 0,
      "publication_date": 20170203
    },
    {
      "title": "Good for big kids",
      "text": "My 6 year loves to play with this set but there is no storage box so difficult to preserve so many tiny pieces and this bead set is only good for making necklaces whereas we were expecting more jewelry making like bracelets etc out of it so this was a huge disappointment..",
      "rating": 3.0,
      "verified": true,
      "author": "bird1982",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Great for little speller fashionistas",
      "text": "I bought this for my four, almost five, year old daughter for Christmas and she loves it. She makes me necklaces and jewelry all the time and she is learning to read so the letters help her to spell. I wish it came with more of the strings (that are like shoe strings, even on the ends) and different lengths of the string. I also believe that there should be more of the little closures that snap the necklaces shut. The strings come in a few different pastel colors and there are plenty of beads, including pastel colored fish, hearts, stars, etc. Good product Melissa and Doug!",
      "rating": 4.0,
      "verified": true,
      "author": "Charay",
      "helpful_votes": 0,
      "publication_date": 20140515
    },
    {
      "title": "pretty beads, no lid",
      "text": "This is a very pretty set of beads, especially if your child likes letters and/or you're working on letter recognition or spelling. My 4-year-old daughter and her 7-year-old cousin both enjoyed stringing these beads. Be aware, however, that the pretty box it comes in has no lid. I couldn't think of a use for a box with no lid, so I ended up throwing out the box. If you choose any of the smaller M&D bead sets with the arched top and the larger beads at the top, such as this one----those have a plastic lid that slides in the wooden box.",
      "rating": 4.0,
      "verified": true,
      "author": "Sheri",
      "helpful_votes": 4,
      "publication_date": 20091002
    },
    {
      "title": "Excellent quality, perfect for little fingers",
      "text": "My daughter (age 2.5) loved stringing these beads to make matching bracelets for mommy and herself as well as baby sister to be. Vibrant colors, excellent quality of wood beads and string, perfect size for little fingers.",
      "rating": 5.0,
      "verified": true,
      "author": "whit",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Christmas gift",
      "text": "Santa delivered this to my daughter. The beads are not too small so they are good for my little one's hands. She plays with them more than beads right now, but she has little difficultly stringing the beads. My only complaint is the packaging. They come in a nice wooden container, but once the plastic wrap is taken off, there is not way to contain the beads. I put them all in a plastic bag and disposed of the container. A cover to this would be nice. Over all.... great product.",
      "rating": 5.0,
      "verified": true,
      "author": "srbelladonna",
      "helpful_votes": 0,
      "publication_date": 20150107
    },
    {
      "title": "Not just for making necklaces",
      "text": "This is a cute set. Very small I thought the beads would be bigger but they are around the size of my pinky finger. There are several learning games listed on the back that you can do with your child....learning Abc colors shapes and spelling. It can also be made into adorable necklaces with the child's name etc. I initially bought this for my 4 year old to make wooden bead jewerly but was pleasently surprised to see how versitile and educational this set is. I would recommend this to anyone who enjoys teaching with their child using fun crafts.",
      "rating": 5.0,
      "verified": true,
      "author": "Jodi",
      "helpful_votes": 0,
      "publication_date": 20121216
    },
    {
      "title": "Fun toy, better container needed",
      "text": "It would be 5 stars, but like other Melissa and Doug items it does not have a top to keep the beads in the container. We keep ours in a plastic bag, but it would be nice to be able to use the divider it comes in without the beads spilling out everywhere. It is a good quality product ands my daughter likes creating necklaces with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Collinsam",
      "helpful_votes": 0,
      "publication_date": 20160322
    },
    {
      "title": "Great jewelry set",
      "text": "Both my 8 year old and 4 year old daughters have loved this - great summer entertainment!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Nice!",
      "text": "Very nice and entertaining. My two 4 year old granddaughters made necklaces and were joined by their 7 year old brother. Plenty of shapes and letters for all without any fighting. I highly recommend because the 4 year olds made up words, spelled out their names, so the kit is educational also. Only bad thing is there is not a lid to the tray but I sent it home with their mother - her problem, not mine.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne Johnston",
      "helpful_votes": 0,
      "publication_date": 20131226
    },
    {
      "title": "This is a great set except I WISH they had gone the extra ...",
      "text": "This is a great set except I WISH they had gone the extra mile and provided a plastic cover to the nice wood box it comes in. Store carefully once open or it is a messy clean up!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary P. Morris",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Inadequate tray, no lid!  Provide your own storage.",
      "text": "This tray is only the depth of the beads. The laces will only fit in the tray when carefully wrapped up as shown in the photo. There is no lid, requiring the owner to buy a storage device. The beads are cute. I bought these to use as a fine motor activity combined with making \"Mardi Gras\" beads for Mardi Gras. My three year old is delighted and is stringing away.",
      "rating": 3.0,
      "verified": true,
      "author": "Haidee Heyward DeLuca",
      "helpful_votes": 0,
      "publication_date": 20140302
    },
    {
      "title": "Buy three of these one for my granddaughter and two for gifts for twins",
      "text": "Buy three of these one for my granddaughter and two for gifts for twins",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Steinberg",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Great product",
      "text": "Awesome product. So fun and good for fine motor skills. Did with my almost 5 year old twins. Love the letters so we made as gifts!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "So cute!",
      "text": "We bought this as a Christmas gift, but ended up returning it because my husband's sister doesn't like toys with small pieces that the dog can chew up. But I would recommend buying it. It's a super cute gift for any little girl and reasonably priced.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry Tilson",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "Making learning fun!",
      "text": "I purchased this for my 5 year old niece and she loves it. She loves jewelry to begin with and her mother says she loves it because her sweet girl is using this to learn how to spell! AWESOME!!! Fun and even educational!!",
      "rating": 5.0,
      "verified": true,
      "author": "JmT13",
      "helpful_votes": 0,
      "publication_date": 20170128
    },
    {
      "title": "Quality fun toys!",
      "text": "You can always count on Melissa & Doug toys. The quality is exceptional, well made, non toxic and educational. Their puzzles and other toys stand up very well on the much used toys.",
      "rating": 5.0,
      "verified": true,
      "author": "gr8bch",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Where the top?",
      "text": "Nice gift but should have a top to store the items.",
      "rating": 4.0,
      "verified": true,
      "author": "OBXers",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "My 2 & 3 yo grandchildren really enjoy playing with these",
      "text": "My 2 & 3 yo grandchildren really enjoy playing with these. I wish they had a little more variety to the beads. The 3yo is a champ at stringing & enjoys making her necklaces sitting next to me while I'm working on my own projects.",
      "rating": 5.0,
      "verified": true,
      "author": "Dancynfairy",
      "helpful_votes": 0,
      "publication_date": 20151118
    },
    {
      "title": "Great quality product",
      "text": "I love this jewelry making kit. I bought it for a 5 year old girl and she had a lot of fun making bracelets for herself and her older sister. The beads are made of good quality wood and the colors are vibrant. It comes in a nice wooden tray for easy organizing. I would recommend this product to anyone looking for a gift at this age range.",
      "rating": 5.0,
      "verified": true,
      "author": "Mayra M. Thomas",
      "helpful_votes": 0,
      "publication_date": 20160207
    },
    {
      "title": "Good product",
      "text": "The only complaint that I have about this product is that it doesn't come with any way to store the beads. I would have thought it would have at least come with some kind of cover to put on top when not in use. Other than that it is a good product. Bought for my almost 5 year old niece.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20140101
    },
    {
      "title": "Smaller beads than I thought",
      "text": "Smaller beads than I thought but should still be good for 3 & 4 year olds",
      "rating": 4.0,
      "verified": true,
      "author": "sharon",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Fun",
      "text": "I bought this for my daughter and she has spent many hours making many different things. I love the fact that it has letter so we are able to use it as an educational toy and help her in creating words. She has made a necklace for everybody in the family with their name in it along with the other cool and fun symbols. I just wish that it came with a pouch to keep all of beads in, because being realistic here a 5 year old is not going to keep all the pieces in what it came in. I just use a baggy to keep them secured.",
      "rating": 4.0,
      "verified": true,
      "author": "Mommy of 2!",
      "helpful_votes": 0,
      "publication_date": 20130320
    },
    {
      "title": "Simply the best for bracelet/necklace making.",
      "text": "This set makes for a ton of bracelets and necklaces.. This was a gift for my great niece and she loves putting together bracelets... The wooden pieces are so much better than plastic and look more elegant.",
      "rating": 5.0,
      "verified": true,
      "author": "nodoubter",
      "helpful_votes": 0,
      "publication_date": 20160125
    },
    {
      "title": "bargus",
      "text": "Melissa and Doug products are of very high quality and I have ordered several of their products in the past. My granddaughter likes to do crafts and absolutely loved this set!!! She even turned off the TV as soon as I gave it to her to make some bracelets up for her friends. I highly recommend this product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bargus",
      "helpful_votes": 0,
      "publication_date": 20130406
    },
    {
      "title": "Fun for my 6 year old",
      "text": "My 6 year old loves making her own jewelry. It is very sturdy and easy for her to use. I love that the pieces are wooden and not plastic. There are many pieces which allows her to make many pieces of jewelry. She spends quite a bit of time playing with this and enjoys it. The only thing I wish was that it had a lid for storage and to keep the pieces together.",
      "rating": 4.0,
      "verified": true,
      "author": "Shelly",
      "helpful_votes": 0,
      "publication_date": 20121225
    },
    {
      "title": "Great activity with so many learning opportunities",
      "text": "So many times I've looked at beading kits that have the letters of the alphabet, you may only find or two of each letter, this kit gives you more and allows for more things to be spelled with the beads. I will probably upgrade to a larger kit next time, but this is a good starter kit for a young child to practice with.",
      "rating": 5.0,
      "verified": true,
      "author": "Lois Field",
      "helpful_votes": 0,
      "publication_date": 20121204
    },
    {
      "title": "Good starter necklace making set",
      "text": "This is a good starter set to see if your kids will enjoy necklace making, but if you've got 2-3 kids working out of it the beads will disappear very quickly. We started with this but have ordered beads in bulk bags since.",
      "rating": 5.0,
      "verified": true,
      "author": "Doug G.",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "Good Product",
      "text": "We bought this for our 5 year old granddaughter. She loves making jewelry with it. We liked the set because it is wooden and therefore durable. The size of the pieces makes it easy for her to handle and are not easily lost like the little round plastic beads. This particular set also has lettering and so has a little more educational value than the other M&D sets. The packaging is also convenient for storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Twain",
      "helpful_votes": 0,
      "publication_date": 20100109
    },
    {
      "title": "great project for boredom",
      "text": "My 5 year old loves making pretty bracelets and necklaces for herself and all of her friends. The beads are easy to string on the including string and the beads are plentiful. She has multiple Melissa & Four beading sets that she loves to combine to make really pretty pieces that she wears constantly. They're durable enough to wear all the time just like mommy does.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawna S-L",
      "helpful_votes": 0,
      "publication_date": 20120409
    },
    {
      "title": "Perfect for my little necklace maker!",
      "text": "My daughter(4) is currently obsessed with making necklaces! I love Melissa and Doug toys and so this only made sense! She loves it! Plus the holes in the beads are big enough that she can fit the string through without a struggle. We have been through many bead sets and the Melissa and Doug set is her favorite!",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Maziarz",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "You're stuck once it's open",
      "text": "Nice beads, but once you open, there are no options for organized storage. So don't take on the road for your 4 1/2 year old to use as I did; once unwrapped they must be thrown together in a quart size ziplock. The necklace fasteners will require an adults help to install/tie.",
      "rating": 3.0,
      "verified": true,
      "author": "Holly L in Michigan",
      "helpful_votes": 0,
      "publication_date": 20130401
    },
    {
      "title": "Great Toy...Not Enough Pieces",
      "text": "This bead set is really cute and very fun. My children have made some very cute necklaces and bracelets and I'm glad to have been the recipient of such lovely, handmade gifts. They're made of wood and are finished in lovely colors. All the letters are printed nicely. The only complaint is that there aren't that many beads.",
      "rating": 4.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 0,
      "publication_date": 20120904
    },
    {
      "title": "Great for motor skill development and gift giving!",
      "text": "The beads are good quality and the closure are kind of simple and cheap, but easy to use. I bought this for my daughter to work on fine motor skills and as a fun activity, but her necklace creations have now become a gift for several of her friends. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica White",
      "helpful_votes": 0,
      "publication_date": 20130907
    },
    {
      "title": "She loved it!",
      "text": "I bought this as a gift to an 8 year old little girl and she loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "TP",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "She loved it.",
      "text": "Bought this as a gift for my 5 year old niece. She loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "m heiman",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Great product, fun for kids",
      "text": "Another great Melissa and Doug product. So fun and easy for even young children. My kids were really excited to make a necklace.",
      "rating": 5.0,
      "verified": true,
      "author": "Cameron Merrell",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Hours of entertainment!",
      "text": "My daughter loved this set and spent several hours making necklaces for everyone she knows, spelling their names and other words.",
      "rating": 5.0,
      "verified": true,
      "author": "MamaofFive",
      "helpful_votes": 0,
      "publication_date": 20160106
    },
    {
      "title": "My daughter got allot of enjoyment out of this bead set",
      "text": "My daughter got allot of enjoyment out of this bead set. My only complaint is that there isn't a fitted lid to contain the beads. I can count on both hands the number of times we were picking up the entire bead collection off the floor!",
      "rating": 4.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20140801
    },
    {
      "title": "Terrific value",
      "text": "These are much better than the plastic beads of similar sets. This is the second child I've bought these for. The first child I bought this set for was 2 years ago and they're still in use! The strings they come with are great quality to use over and over again if you want. Well done!",
      "rating": 5.0,
      "verified": true,
      "author": "angelinamax",
      "helpful_votes": 0,
      "publication_date": 20121128
    },
    {
      "title": "5 year old recipient loved it.",
      "text": "Used this as a Christmas gift. 5 year old recipient loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Garrett",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "Plenty of beads, just spill easy.",
      "text": "Plenty of beads, my only complaint is the little tray they are in doesn't have a lid or cover to keep them from spilling... which for my 4 year old is hard to not do if its an open container. She loves all the choices though!",
      "rating": 4.0,
      "verified": true,
      "author": "mjmarrison",
      "helpful_votes": 0,
      "publication_date": 20150531
    },
    {
      "title": "It's a nice container and arranged pleasantly to give as a gift",
      "text": "It's a nice container and arranged pleasantly to give as a gift, but the small amount of beads you get for the price is the downside.",
      "rating": 3.0,
      "verified": true,
      "author": "Timothy Fields",
      "helpful_votes": 0,
      "publication_date": 20161009
    },
    {
      "title": "Beautiful Gift for a Child",
      "text": "My 7 year old niece was ecstatic to receive this gift. She has made necklaces and bracelets for the entire family lol. The \"beads\" are of good (wooden) quality. I wasn't too fond of the strings used to place the beads on.... They're more like shoe strings, but my niece is thrilled to have the gift and so I am :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Lloyd",
      "helpful_votes": 0,
      "publication_date": 20110803
    },
    {
      "title": "Fun and Creative!",
      "text": "When I saw this for my little girl I knew I had to buy it... She loved it! I wish they made little clips to help tie these things up! Oye! get them if you're child loves to do crafts!",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Rosario",
      "helpful_votes": 0,
      "publication_date": 20140325
    },
    {
      "title": "Cute enough",
      "text": "I can't say how this was after opening and play, but we got it as a gift. It is cute and looks as pictured. It's not terribly amazing quality, but that was to be expected. I think the 6 y/o we got it for will really enjoy it and we just added a few other things to the gift.",
      "rating": 3.0,
      "verified": true,
      "author": "Sean&Amanda",
      "helpful_votes": 0,
      "publication_date": 20130824
    },
    {
      "title": "Cute and sturdy",
      "text": "My daughter loves these. We use them in our homeschool to practice spelling, and this makes that task more fun! :) we do store them in a different container though.",
      "rating": 4.0,
      "verified": true,
      "author": "Danni",
      "helpful_votes": 0,
      "publication_date": 20170220
    },
    {
      "title": "Fun but not a necklace/bracelet kit",
      "text": "I bought it for an 8 year-old but it turns out it's for littler ones to learn shapes, colors and letters. The wooden pieces are a bit too big to use for making jewelry and the strings are too strong to put around a neck anyway.",
      "rating": 4.0,
      "verified": true,
      "author": "Eisele family",
      "helpful_votes": 2,
      "publication_date": 20130314
    },
    {
      "title": "My 4 yer old great neice loves it!",
      "text": "My 4 year old great niece loves it . This set encourages her creativity, generosity and is helping refine her fine motor control, she has been making presents for all the family non-stop since she received it. A win-win-win gift.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Tirado",
      "helpful_votes": 0,
      "publication_date": 20130304
    },
    {
      "title": "Great Art Project for Kids",
      "text": "My nieces loved this as a Christmas present. Had a good time putting together necklaces and bracelets. Beads were very good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel Deal",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "My daughter loved this.",
      "text": "We bought this for my 4-year-old for Christmas, and she loved it. She made a necklace for herself, and then one for several of her friends. It was a useful gift, that kept on giving!",
      "rating": 4.0,
      "verified": true,
      "author": "Aubrey",
      "helpful_votes": 0,
      "publication_date": 20140116
    },
    {
      "title": "Grandaughter enjoys but not well set up to prevent losing ...",
      "text": "Grandaughter enjoys but not well set up to prevent losing pieces once package is broken into! You end up needing individual containers to house beads!",
      "rating": 4.0,
      "verified": true,
      "author": "Happy Nana",
      "helpful_votes": 0,
      "publication_date": 20160301
    },
    {
      "title": "Nice beads. Have your own container ready.",
      "text": "The beads themselves are great. The container has no lid(just shrink wrapped tray), so you cant really keep them in the original container assuming its for kids.",
      "rating": 4.0,
      "verified": true,
      "author": "B.K. Burris",
      "helpful_votes": 0,
      "publication_date": 20150323
    },
    {
      "title": "Niece loved it!",
      "text": "Got this as a gift for my 4.5 year old niece. She loved it and enjoys making random bracelets with different names and shapes. For a tenner, well worth the price, would definitely recommend for anyone looking for a gift for a girl that enjoys arts and crafts.",
      "rating": 5.0,
      "verified": true,
      "author": "Cross The Brij",
      "helpful_votes": 0,
      "publication_date": 20150125
    },
    {
      "title": "Another amazing set of beads",
      "text": "Another amazing set of beads. Lots of letters for making names or words. Nice quality construction. And for $9 you get a lot of materials to make whatever craft you have in mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy V.",
      "helpful_votes": 0,
      "publication_date": 20141224
    },
    {
      "title": "Cute, but you can find cuter!",
      "text": "M & D actually has some cuter sets than this, but I didn't see them until I already bought this one. It's cute, but the other sets include more and bigger designs with more variety.",
      "rating": 3.0,
      "verified": true,
      "author": "Ruthie",
      "helpful_votes": 0,
      "publication_date": 20150621
    },
    {
      "title": "... for a christmas present for my niece came in great condition and it looks like something she will enjoy ...",
      "text": "Ordered this for a christmas present for my niece came in great condition and it looks like something she will enjoy making jewelry with.",
      "rating": 5.0,
      "verified": true,
      "author": "Happily Harding",
      "helpful_votes": 0,
      "publication_date": 20151130
    },
    {
      "title": "Great!",
      "text": "Great! My kids love it, provides tons of fun for my toddlers. Good quality, and great for hand-eye coordination. Pieces are small, so that's the only thing I worry about for young ones.",
      "rating": 5.0,
      "verified": true,
      "author": "lovestotravel",
      "helpful_votes": 0,
      "publication_date": 20140401
    },
    {
      "title": "Hours of play for the crafty child",
      "text": "Ordered as a birthday gift for friend's daughter and have been told it was a hit! Hours of play.",
      "rating": 4.0,
      "verified": true,
      "author": "Heathernheights",
      "helpful_votes": 0,
      "publication_date": 20160711
    },
    {
      "title": "Not impressed",
      "text": "I am progressively becoming more disappointed with a quality product from Doug and Melissa.The declining quality leaves much to be desired. Looks like more \"made in China\" stuff. The box has no lid, so beads cannot be returned for storage with ease. When playing with it, the child only needs to accidentally hit it and beads go everywhere.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20160427
    },
    {
      "title": "Great Christmas gift for our granddaughter",
      "text": "Great Christmas gift for our granddaughter. She loves crafts and the ability to make jewelry was a hit. Well made, as are all Melissa & Doug toys, and great price for a creative toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Hope Springs",
      "helpful_votes": 0,
      "publication_date": 20150214
    },
    {
      "title": "Three Stars",
      "text": "Needs more strings and claps, for the amount of beads it comes with.",
      "rating": 3.0,
      "verified": true,
      "author": "Frequent Amazon Shopper",
      "helpful_votes": 2,
      "publication_date": 20160412
    },
    {
      "title": "gift was well received",
      "text": "Gave this as a chirstmas gift. it was a big hit! the kids loved it . and made so many things with it! Melissa and doug make high quality goods.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Schweitzer",
      "helpful_votes": 0,
      "publication_date": 20140222
    },
    {
      "title": "Great Set",
      "text": "Kids love this set. Has a good amount of alphabet beads as well as non-alpha beads.",
      "rating": 5.0,
      "verified": true,
      "author": "Q Wan",
      "helpful_votes": 0,
      "publication_date": 20150904
    },
    {
      "title": "My niece loved this",
      "text": "I purchased this for my 5 year old niece who is beginning to learn letters and spelling. She was so thrilled and excitedly made a bracelet with her mom as soon as she could.",
      "rating": 5.0,
      "verified": true,
      "author": "Review queen",
      "helpful_votes": 0,
      "publication_date": 20140101
    },
    {
      "title": "Great quality wooden beads and woven fabric cord in great ...",
      "text": "Great quality wooden beads and woven fabric cord in great colors. Not like a lot of these packages where they are made from plastic or have plastic cording. My daughter (age 6) loves this. We use it to help learn her site words. The words that she is struggling to learn are put on the necklace to wear that day/week and she learns them with ease.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Harris",
      "helpful_votes": 0,
      "publication_date": 20141214
    },
    {
      "title": "Five Stars",
      "text": "Awesome! Perfect birthday gift for my five year old niece.",
      "rating": 5.0,
      "verified": true,
      "author": "Darcy W.",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Awesome!",
      "text": "My 3 YO and 5 YO love making beaded necklaces with these beads. Really great for working out those fine motor skills and small muscle control.",
      "rating": 5.0,
      "verified": true,
      "author": "Imelda",
      "helpful_votes": 0,
      "publication_date": 20160123
    },
    {
      "title": "Bought for my grand niece and she loved having the alphabet right at her fingertips",
      "text": "Bought for my grand niece and she loved having the alphabet right at her fingertips. What a way to teach her how to spell at five years old but to enjoy making necklaces!",
      "rating": 5.0,
      "verified": true,
      "author": "Book Reader",
      "helpful_votes": 0,
      "publication_date": 20141210
    },
    {
      "title": "Very cute gift for a 6 year old girl.",
      "text": "Very cute gift for a 6 year old girl. It looks more expensive than it is. Excellent quality you would expect from Melissa & Doug.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori T.",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "Melissa & Doug Bead Set",
      "text": "I love the bead set and my granddaughter will enjoy it",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Ellis",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Craft lover",
      "text": "Granddaughter loves crafts and everyone is into making bracelets these days, so highly recommended for anyone who enjoys crafts and making unique things.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Debie",
      "helpful_votes": 0,
      "publication_date": 20140226
    },
    {
      "title": "Very cute gift!",
      "text": "Bought as a birthday gift, so can't speak to its quality, but it looks like a lot of fun! Pieces are large and very colorful. They look well made. Excited to give it to my niece!",
      "rating": 5.0,
      "verified": true,
      "author": "jojo131313",
      "helpful_votes": 0,
      "publication_date": 20130126
    },
    {
      "title": "Best bead set available",
      "text": "With three girls, I have gone through a lot of different bead sets over the years. This one is hands-down my favorite. We have to keep it up high away from our toddler, but when she is napping, my older girls get it out and play with it. Great quiet activity.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Ballard",
      "helpful_votes": 0,
      "publication_date": 20080116
    },
    {
      "title": "Great letter set!",
      "text": "More then enough letters to make larger than a handful of bracelets! Combine with other sets and let your girls go creatively wild!! Consistent quality expected from M&D.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaip",
      "helpful_votes": 0,
      "publication_date": 20130823
    },
    {
      "title": "great for making presents",
      "text": "I bought this so my son could make bracelets and necklaces to add to the Christmas gifts we were giving. He did a great job spelling out names and stringing them. Wish it came with more string, but easy to find something else to use to string with.",
      "rating": 5.0,
      "verified": true,
      "author": "mom of a 5 year old boy",
      "helpful_votes": 0,
      "publication_date": 20121228
    },
    {
      "title": "Quite Nice, but the tray is thin and lacks any ...",
      "text": "Quite Nice, but the tray is thin and lacks any kind of cover so pieces can easily get lost or fall down.",
      "rating": 3.0,
      "verified": true,
      "author": "Lucy",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Nice assortment",
      "text": "Grandaughter loved these along wiht the other sets I bought her. Melissa & Doug make a nice product, well worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "cosmo",
      "helpful_votes": 0,
      "publication_date": 20140325
    },
    {
      "title": "Fun",
      "text": "Well made... pieces are a little smaller than I expected, but it is a nice set that 5-year-old girl is enjoying.",
      "rating": 5.0,
      "verified": true,
      "author": "veronica",
      "helpful_votes": 0,
      "publication_date": 20150224
    },
    {
      "title": "SUPER Cute!!!!",
      "text": "I bought this for my 5 year old niece and it was a huge hit!! Its endless hours of fun making necklaces and bracelets. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Momof3",
      "helpful_votes": 0,
      "publication_date": 20130802
    },
    {
      "title": "Bought it for grandduaghter, age 7. After showing ...",
      "text": "Bought it for grandduaghter, age 7. After showing her how to line up patterns before stringing, she entertained herself without assistance for hours.",
      "rating": 5.0,
      "verified": true,
      "author": "lovestotravel",
      "helpful_votes": 0,
      "publication_date": 20150212
    },
    {
      "title": "Great",
      "text": "Melissa and Doug toys are the best!! Good learning toys and yet fun. Grand daughter loves having mom sit down and make things with her",
      "rating": 5.0,
      "verified": true,
      "author": "melodysing",
      "helpful_votes": 0,
      "publication_date": 20130713
    },
    {
      "title": "So cute!",
      "text": "I purchased this gift as the second half of my 7 year old niece's Christmas gift. I love it! It comes with just enough letters for her to make jewelry for her friends and/or cousins. The shapes and colors are adorable and the wood seems smooth enough that she doesn't have to worry about splinters while making some fab pieces.",
      "rating": 5.0,
      "verified": true,
      "author": "Karona86",
      "helpful_votes": 0,
      "publication_date": 20121210
    },
    {
      "title": "M & D Wooden Stringing Beads",
      "text": "Great product for five-year olds (always watch stringing beads). Many letters to make many different necklaces. Good for fine motor skills.",
      "rating": 5.0,
      "verified": true,
      "author": "Chicago Suburbanite",
      "helpful_votes": 0,
      "publication_date": 20131213
    },
    {
      "title": "Lots of Beads and Pretty Colors",
      "text": "Plenty of beads to choose from. You will run out of some letters fast but there are many to choose from and more of the common letters.",
      "rating": 5.0,
      "verified": true,
      "author": "Quinnched",
      "helpful_votes": 0,
      "publication_date": 20130526
    },
    {
      "title": "Great for learning how to spell",
      "text": "We make necklaces with these with my daycare kids names on them. It is nice that there is such a variety of letters, so you don't have to take apart one necklace to make another. Another great product from Melissa and Doug.",
      "rating": 5.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 0,
      "publication_date": 20100107
    },
    {
      "title": "Five Stars",
      "text": "Great bead set for the preschool crowd. Melissa and Doug make terrific products!",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia Fishman",
      "helpful_votes": 0,
      "publication_date": 20151014
    },
    {
      "title": "fun for 3 year old",
      "text": "The beads are as described. Our 3 year old enjoys making things with it, and it's nice for practicing spelling.",
      "rating": 5.0,
      "verified": true,
      "author": "indiana cook",
      "helpful_votes": 0,
      "publication_date": 20140207
    },
    {
      "title": "There's so many letters that it was enough for all the girls names which was great. Colors are bright and pretty",
      "text": "Used it for a birthday party. There's so many letters that it was enough for all the girls names which was great. Colors are bright and pretty.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy",
      "helpful_votes": 0,
      "publication_date": 20150612
    },
    {
      "title": "Cute",
      "text": "My niece was thrilled with this when we gave it to her for her 6th birthday. Lots of pieces, but still fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Miglets",
      "helpful_votes": 0,
      "publication_date": 20130630
    },
    {
      "title": "it is simply a shallow lidless wooden box that the beads easily fall out of",
      "text": "I'm giving this product 4 stars only because the wood box is pointless, as once the plastic ks removed, it is simply a shallow lidless wooden box that the beads easily fall out of.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristin Jackson",
      "helpful_votes": 0,
      "publication_date": 20141228
    },
    {
      "title": "Very cute and fun for girly girls",
      "text": "I bought this for my six year old niece and she has really enjoyed making necklaces for everyone. The beads and string are good quality as well as being very cute.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Wilson",
      "helpful_votes": 0,
      "publication_date": 20130203
    },
    {
      "title": "Five Stars",
      "text": "Great product. bought for a 7yr old girl. Very easy to use and durable",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160105
    }
  ],
  "product_meta": {
    "title": "Melissa & Doug Created by Me Alphabet Beads Wooden Bead Kit",
    "description": "How many ways can your little jeweler spell \"beautiful\"? Lots of wooden letter beads, plus stars, butterflies, hearts and more, plus brightly colored laces are packed in a handy wooden tray to allow kids to create fabulous bracelets and necklaces. Set includes over 200 beads and 8 brightly colored cords—everything kids need to create fabulous bracelets and necklaces Set is stored in a durable, handy wood tray. Promoting hand-eye coordination and creativity, this set makes an exceptional gift for kids ages 4 to 8. Add the Melissa & Doug Bead Bouquet Deluxe Wooden Bead Set to round out the hands-on play experience and give kids another engaging option for screen-free fun. For more than 30 years, Melissa & Doug has created beautifully designed imagination- and creativity-sparking products that NBC News called “the gold standard in early childhood play.” Today, Melissa & Doug is proudly partnering with the American Academy of Pediatrics to foster early brain development and help children build important life skills through play.\n\nFROM THE MANUFACTURER\nFrom classic wooden toys to crafts, pretend play, and games, Melissa & Doug products provide a launch pad to ignite imagination and a sense of wonder in all children so they can discover themselves, their passions, and their purpose. \n\nSince the company’s founding more than 25 years ago, Melissa & Doug has consistently delivered innovative products that inspire open-ended thinking, encourage kids to see new possibilities, and offer Countless Ways to Play. It’s part of a bigger vision to Take Back Childhood. Because by giving children a true childhood with the space and freedom to explore their world, we give them a path to realizing their full potential!",
    "rating": 4.6,
    "feature_bullets": [
      "EASY-TO-USE WOODEN ALPHABET BEAD SET: The Melissa & Doug Deluxe Created By Me Alphabet Beads Set is an easy-to-use arts and crafts kit for designing and stringing necklaces and more. It includes 200+ beads and 8 cords.",
      "CONVENIENT STORAGE: This wooden bead set is packed in a handy wooden tray, allowing kids to easily store and organize their beads.",
      "HELPS DEVELOP SKILLS: This Melissa & Doug kids bead set helps children to develop strong fine motor and cognitive skills, while promoting hand-eye coordination and creativity.",
      "GREAT GIFT FOR AGES 4 TO 8: This set makes an exceptional gift for kids from 4 to 8 years. Add the Melissa & Doug Bead Bouquet Deluxe Wooden Bead Set to round out the hands-on play experience and give kids another engaging option for screen-free fun.",
      "“THE GOLD STANDARD IN CHILDHOOD PLAY”: For more than 30 years, Melissa & Doug has created beautifully designed imagination- and creativity-sparking products that NBC News called “the gold standard in early childhood play.”",
      "100% HAPPINESS GUARANTEE: We design every toy to the highest quality standards, and to nurture minds and hearts. If your child is not inspired, give us a call and we'll make it right. Our phone number is on every product"
    ],
    "specifications": {
      "Product Dimensions": "10.9 x 9.4 x 0.6 inches",
      "Item Weight": "13.6 ounces",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "ASIN": "B000GIPOJS",
      "Item model number": "3774",
      "Our Recommended age": "36 months - 8 years",
      "Manufacturer recommended age": "4 - 8 years",
      "Best Sellers Rank": "#16,072 in Toys & Games",
      "Customer Reviews": "4.6 out of 5 stars470 ratings4.6 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "October 4, 2006",
      "Language:": "English",
      "Mfg Recommended age": "4 - 8 years",
      "Department": "Unisex-child",
      "Manufacturer": "Melissa & Doug"
    },
    "categories": [
      "Jewelry",
      "Toys & Games",
      "Arts & Crafts",
      "Craft Kits"
    ],
    "price": 15.49
  }
}