{
  "website_summaries": [
    {
      "verdict": "Easy for smaller kids to hold and shake, with bright colors and a rattling rainmaker sound that many like.",
      "pros": [
        "Fascinates most babies and toddlers, and it’s small enough that most can easily turn the toy over to restart the rain sounds",
        "Bright-colored balls keep attention fixed on the toy"
      ],
      "cons": [
        "Some children may not like the noise it makes, which is somewhat loud",
        "Not waterproof, so don’t use in the tub",
        "May not hold up to rough play as plastic is prone to cracking"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "fun for all ages.",
      "text": "Purchased as part of a self soothing kit for my 7 year old. His response when I showed it to him was \"it's a baby toy!\" \"No, it's a rain stick! See how it sounds like the rain?\" We had one just like it when he was a baby but of course it found a new home a long time ago. He loves it. Heck, I even love playing with it. There's something mesmerizing about watching the beads fall and hearing the sound they make.",
      "rating": 5.0,
      "verified": true,
      "author": "Becca",
      "helpful_votes": 18,
      "publication_date": 20171024
    },
    {
      "title": "Great for small hands",
      "text": "Purchased this for my 18 month old it is just the right size for her hands, though all of us in the family including our four-year-old son enjoy it . It appears to be quality plastic, lots of beads and multiple layers for the beads to fall through .",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie M.",
      "helpful_votes": 9,
      "publication_date": 20180904
    },
    {
      "title": "The smaller size is perfect for little ones to handle",
      "text": "18-month old granddaughter loves this and so does her 8 and 7 year old siblings. They are fascinated by the constant movements and soothing sounds it makes as it is tipped over and over. The smaller size is perfect for little ones to handle.",
      "rating": 5.0,
      "verified": true,
      "author": "purplekathy",
      "helpful_votes": 10,
      "publication_date": 20170819
    },
    {
      "title": "Great little rainmaker",
      "text": "My one year old loves this rainmaker. It’s the perfect size for little hands. He uses it mostly to shake but will sit and watch when I turn it over for him. The only thing I wish was that the container wasn’t so blurry, my son likes to watch the balls drop down and the sides aren’t perfectly clear.",
      "rating": 5.0,
      "verified": true,
      "author": "Meg RTop Contributor: Baby",
      "helpful_votes": 6,
      "publication_date": 20180430
    },
    {
      "title": "Just as expected",
      "text": "This rainmaker is dollar store quality. That being said, it is just what I expected, so I got exactly what I wanted. And I love it. My 3 year old loves playing with it (tho i would suggest only supervised play with toddlers, due to the quality of the item). I would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy M. Weigle",
      "helpful_votes": 3,
      "publication_date": 20180924
    },
    {
      "title": "Great sound for a newborn, fun toy for a bigger baby",
      "text": "Bought this as a gift for a newborn but my son wanted to keep it for himself. I bought it for such a small baby because I remember when we had a newborn he loved the sound. Of course the parent is the one who holds it for such a small baby but the sound is so beautiful, even I enjoy listening to it. My son is 8 mons old and can manipulate it himself, he enjoys looking at it as much as he does listening to it. I will be buying another for us to keep at home. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Niccole Brege",
      "helpful_votes": 7,
      "publication_date": 20150416
    },
    {
      "title": "Fun and noisy.",
      "text": "Baby loves this toy but it is heavy and hard so recommend supervised use when first figuring this gadget/toy out. Some of the balls stick to the side from static electricity.",
      "rating": 4.0,
      "verified": true,
      "author": "The Kurgen",
      "helpful_votes": 2,
      "publication_date": 20171004
    },
    {
      "title": "Fun, inexpensive",
      "text": "Fun, inexpensive, not 100% waterproof. After rinsing, I could see little droplets of water inside. It's a baby toy, it will need to be washed.",
      "rating": 4.0,
      "verified": true,
      "author": "FrostyCoug",
      "helpful_votes": 3,
      "publication_date": 20171028
    },
    {
      "title": "Baby approved!",
      "text": "Friends baby is absolutely entranced by it. It really helps her stop crying when she has her tummy problems. Also, when we did Easter photos at home (because of the virus) we used it to get her attention for the photos too",
      "rating": 5.0,
      "verified": true,
      "author": "Cat",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Very helpful",
      "text": "We bought this for our son after he had a physical therapy appointment to help him learn to lift his head during tummy time. The PT used this toy and our son was fascinated by it so we bought it. It was great for getting him to follow it from side to side while lifting his head.",
      "rating": 5.0,
      "verified": true,
      "author": "Geoff",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Baby loves it!",
      "text": "I got this toy for my 10 month old, because she seemed to love shaking things to see if they made a sound. She absolutely loves the sound and watching the little beads move. Great toy! It’s her new favorite.",
      "rating": 5.0,
      "verified": true,
      "author": "Abby Olayer",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Better for Older Babies - Loud and Heavy",
      "text": "I bought this rainmaker stick after I found my little boy (4 months old) really liked the ones at baby gym. It's a decent size - larger than most of the rainmakers out there as infant toys and a good price. But, the beads are really loud. So much so, that it scares my baby. So, at the moment he hates it. And it's too heavy for him to hold. Hopefully we get more use out of it in a year or so. Better for older babies.",
      "rating": 3.0,
      "verified": true,
      "author": "Carrie",
      "helpful_votes": 4,
      "publication_date": 20141210
    },
    {
      "title": "As expected but...",
      "text": "I will not rate this low as the item is EXACTLY as described, however it is smaller than I thought so probably should have bought the longer version (this is just kind of a large rattle). Just recommend keep in mind when purchasing.",
      "rating": 5.0,
      "verified": true,
      "author": "Not without my TJ",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Generic & fine for the little ones.",
      "text": "It’s fine. It’s the ordinary one that everyone gets. No complaints. If buying for someone other than infant or toddler, I suggest you look at other more interesting versions.",
      "rating": 5.0,
      "verified": true,
      "author": "booklyn6027",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "big hit with the Little Tots but quality needs Improvement.",
      "text": "This was a huge hit with the tots and the adults at Christmas. Everyone was amazed what a fun toy this is. Although I have to say I was a little disappointed it was cheaper made than I was expecting. Hopefully they will improve the quality in the future.",
      "rating": 4.0,
      "verified": true,
      "author": "Smiley Face",
      "helpful_votes": 2,
      "publication_date": 20161226
    },
    {
      "title": "Wonderful!",
      "text": "Our Grandchildren under 2 years love this! But here is the thing...it is enjoyable enough when they get older they will enjoy it all over again. Adults pick it up and give it a whirl a couple times too! ☺️",
      "rating": 5.0,
      "verified": true,
      "author": "1shopper",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Like",
      "text": "Originally my one year-old was scared of the noise This toy would make it sound similar to a rainmaker however now she loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Brittney",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Small, came cracked.",
      "text": "Came cracked on the bottom. Not worth driving and wasting my gas to a drop off place to replace it. Other than the crack, it seems cool. It is small.",
      "rating": 3.0,
      "verified": true,
      "author": "Kathleen Hickman",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Magical toy!",
      "text": "This toy is magical! We first saw this toy in the hospital. My 5month old son had a procedure done and couldn't eat while he was coming out of anesthesia. He was hungry and hysterical and nothing could console him until a nurse walked over with this rain stick. He LOVED watching and listening to it. We ordered one before we even left the hospital!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen",
      "helpful_votes": 4,
      "publication_date": 20160817
    },
    {
      "title": "Didn’t keep interest",
      "text": "I bought as gift for 1st birthday. It is Cute, however, it did not keep my babies interest. He played with it for about a month.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Sharp",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "This was the second favorite Christmas Present for the 6 month old",
      "text": "The bell was the first favorite (also made by Hohner) and this was a very close second. The daddy preferred this because it was quieter and the little guy got strong enough to actually hold it around seven months so he uses it a LOT. He really likes the sound of rain and this really replicates that well. He shakes it, he hasn't yet figured out how to turn it over and make it continual but that will come in time. I can't recommend the Hohner products highly enough. It's great to have a company you can rely upon for quality musical instruments for babies and toddlers.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret Durbin",
      "helpful_votes": 0,
      "publication_date": 20120208
    },
    {
      "title": "Well Built Toy",
      "text": "I really like this rain stick toy. The sounds it makes are not as soothing as a traditional long wooden rain stick, but effective still. Great toy for the car as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Live Laugh Love",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Sweet",
      "text": "Won’t lie, bought it for my niece but got excited and opened up to let my baby play with it and I play with it more. It’s clean and well put together (pretty sure my niece would have liked it better)",
      "rating": 5.0,
      "verified": true,
      "author": "Bdg119",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "The Baby Whisperer",
      "text": "We call this The Baby Whisperer. My son cried at everything as a newborn, but this toy soothed the strongest storm. He's 10 months now and it's still one of his favorites. I expect it will grow with him, since my 25 year old sister is obsessed with it, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Fun toy",
      "text": "My daughter (10 months) love this! It's fun to play with and easy to use. I recommend this toy",
      "rating": 5.0,
      "verified": true,
      "author": "Cortney S",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "My daughter and daughter in law both love this rainmaker toy for my grandsons",
      "text": "My daughter and daughter in law both love this rainmaker toy for my grandsons. One grandson is 8 mo and other is 10 minths!",
      "rating": 5.0,
      "verified": true,
      "author": "RunBike",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Love it !",
      "text": "Ordered this to entertain my baby during tummy time. He loves it and it is one of the only things he will track with his eyes! I have a larger one I use in speech therapy which is always a big hit with most of my kiddos !",
      "rating": 5.0,
      "verified": true,
      "author": "Nell Baird",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Rainmaker",
      "text": "Love the sound it makes sounds just like rain. Durable and fun to play or watch.",
      "rating": 4.0,
      "verified": true,
      "author": "Jodi R.",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Mini Rainmaker",
      "text": "Bought it as a gift for 4 year old Grandchild--they love it --it makes noise !!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Evelyn L. Clark",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "but I enjoy playing with it",
      "text": "Haven't given this to my grandson for his birthday yet, but I enjoy playing with it. The sound is very soothing.",
      "rating": 5.0,
      "verified": true,
      "author": "diana",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Awesome and durable!",
      "text": "Amazingly well build and fun to play with. My daughter loved it and believe me she was ROUGH with it. Threw it everywhere. Never broke the whole time we had it. Just sold it in a yardsale because she grew out of it",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Young",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Awesome!",
      "text": "I've been using this to help my baby in physical therapy for torticollis. He really loves way this sounds, it helps keep him calm and interested through his stretches.",
      "rating": 5.0,
      "verified": true,
      "author": "Krista",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Great",
      "text": "Great toy. Dropped it several times and it hadn’t broken. Edit:coming back to say this thing is nearly indestructible. My son loves it",
      "rating": 5.0,
      "verified": true,
      "author": "CAthena",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "⭐️",
      "text": "My 10 mos old loves this toy! We like that it’s not an electronic toy.",
      "rating": 5.0,
      "verified": true,
      "author": "S-Luf ",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Better for babies or very young children",
      "text": "It's bright and colorful which is fascinating for babies. However, my toddler is bored of it already. It looks artificial with cheaply made plastic. It is cool for children to watch the cascading beads, but since it's only 8\" long the beads flow down quickly. Unfortunately, it doesn't have that soothing sound of a real wooden rainmaker. In hindsight I would have spent a little more and purchased a natural rainstick instead of this plastic one.",
      "rating": 3.0,
      "verified": true,
      "author": "Twinkles",
      "helpful_votes": 0,
      "publication_date": 20121229
    },
    {
      "title": "EH!",
      "text": "I purchased this for my neighbor's baby daughter for Christmas and she lost interest in it rather quickly.",
      "rating": 3.0,
      "verified": true,
      "author": "Fred Adelman",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Car ride approved!",
      "text": "Awesome for car rides to soothe crying baby to sleep!",
      "rating": 5.0,
      "verified": true,
      "author": "Jax",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Fun toy",
      "text": "My 12 month old loves it,... as do I!!! It’s just so relaxing to fiddle with.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Poor quality",
      "text": "There are some defects in the product. It doesn’t make it unusable, but it’s disappointing to find litter and uncut plastic parts inside",
      "rating": 2.0,
      "verified": true,
      "author": "michal ",
      "helpful_votes": 3,
      "publication_date": 20190131
    },
    {
      "title": "Great toy no obnoxious sound",
      "text": "11 month old received for Christmas and loves it. Out of all the gifts he received, he goes after this all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Green",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Durable and Entertaining",
      "text": "My 10 month old has been using this rainstick since she was 5 months old and she LOVES it. It's been through countless drops on the floor, it's been chewed on, rolled around, and shaken so much and it's still in one piece.",
      "rating": 5.0,
      "verified": true,
      "author": "JillianLee",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Meh . .",
      "text": "I know that this is a smaller sized rainstick but the noise doesnt last long enough to hold my daughters attention. The diameter of it is too wide for her to manipulate it well too. Hopefully we will have better luck when she is a little bit older.",
      "rating": 3.0,
      "verified": true,
      "author": "Jujujet82",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Get it",
      "text": "My baby loves it. It was her favorite toy for a long time",
      "rating": 5.0,
      "verified": true,
      "author": "S. Maheta",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Chil loved the noice and look of the toy",
      "text": "little expensive for product but is very nice to look at.",
      "rating": 4.0,
      "verified": true,
      "author": "doddie",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Perfect for infants and young children",
      "text": "This was one of my grandson's favorite toys as an infant. I purchased this for my 1year old granddaughter and she loves it. Perfect gift for little ones.",
      "rating": 5.0,
      "verified": true,
      "author": "ses5479",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Nice rattle, basic design.",
      "text": "All of the balls dont make it down easily. But it makes a lot of noise and is very colorful. Very light to for baby to carry about.",
      "rating": 4.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Staticky balls won't fall",
      "text": "Static build-up inside it balls don't just fall down they're staticy to besides you have to shake it, it shakes good my one year old is fine with it but it is not a Rainmaker.",
      "rating": 3.0,
      "verified": true,
      "author": "Rad",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Worth the money.",
      "text": "Both of my daughters liked this toy. Age 4 and 10 months. So different age ranges like it which is a plus. Just had hoped it was bigger.",
      "rating": 5.0,
      "verified": true,
      "author": "Gloria R.",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Decent rainmaker",
      "text": "The beads don’t flow as well as they should but the twins like it so that’s what matters!",
      "rating": 4.0,
      "verified": true,
      "author": "Briana M",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Excellent",
      "text": "Life saver! Helps me keep my sanity when the baby starts to cry. Several minutes of shaking and the baby acts like she never cried in the first place. Buy this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike C",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Five Stars",
      "text": "My 1 year old loves this! Well made and holds up to a feisty kid.",
      "rating": 5.0,
      "verified": true,
      "author": "SSZLC",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "Easy to hold for toddler",
      "text": "Grandson really likes it. He can easily turn it over.",
      "rating": 5.0,
      "verified": true,
      "author": "pdb",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "the clear plastic tube is in multiple parts lengthwise and I can easily squeeze them apart",
      "text": "My son loves this. However, the clear plastic tube is in multiple parts lengthwise and I can easily squeeze them apart, though not enough to let any beads out. I am worried that they will crack if my son sqeezes too hard.",
      "rating": 3.0,
      "verified": true,
      "author": "KaScho2015",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "Love",
      "text": "Totally mesmerizing. Helped my daughter tolerate Timmy time and be entertained on the floor for longer than a few minutes!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandee",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Safe and entertaining you for young children.",
      "text": "Bought as Christmas gifts for 2-3 year old girls. Safe and entertaining you for children with short attention span.",
      "rating": 4.0,
      "verified": true,
      "author": "ceanderson",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "great toy",
      "text": "babies love this rainmaker. It is fun to hear the beads roll around.",
      "rating": 5.0,
      "verified": true,
      "author": "beachgirl",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Fun Rainmaker For Toddler",
      "text": "This is the first toy my 13 month old son would always go after during story time so it was an easy decision to add it to his Christmas list. The little balls inside of the tube make a nice rain sound when flipped over but he also loves just shaking it around.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen R",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Love it!",
      "text": "Our Granddaughter loves shaking the rain stick. It has enough sound to be interesting, but not enough to grate on your nerves. (Ha Ha)",
      "rating": 5.0,
      "verified": true,
      "author": "Grandmomma",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "This toy is awesome!",
      "text": "This toy is awesome! No trouble at all with the balls \"sticking\" like I saw in other reviews. Not too loud which I appreciated as well :)",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Griffin",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "Great product!",
      "text": "Purchased this for my nephew who is 3 years old and is slightly autistic. He LOVES it! Couldn’t put it down!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Great!",
      "text": "Bought this for my 6 month old son for Christmas, have had it 2 months now and is holding up well. It holds his attention for short amount of times, is well constructed, and colorful. It's the sound he seems to like, but hard for him to hold at this age. His 2 year old sister loves it too. I originally bought it for my 2 year old developmentally delayed niece, but liked it after I got it and gave it to my own son.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20130226
    },
    {
      "title": "Perfect toy all around",
      "text": "Perfect toy all around. My brother grew up with the same one and loved it! I now have a four year old who is autistic and this is the perfect toy for him to stim-out to. He loves to watch the beads drop and it gives the satisfying noise as well unlike the colored oil/water droppers (which he also loves)! It's a good size as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan B.",
      "helpful_votes": 0,
      "publication_date": 20160219
    },
    {
      "title": "Great quality and perfect portable size",
      "text": "Great toy! My 2 mo old loves to watch and listen! Light weight and perfect size",
      "rating": 5.0,
      "verified": true,
      "author": "Michele L.",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "... gifts for my niece and nephew because my son enjoyed his 12 inch Hohner so much",
      "text": "I got these as gifts for my niece and nephew because my son enjoyed his 12 inch Hohner so much. These aren't anything like the 12 inch ones. I wish the bigger size had been in stock.",
      "rating": 2.0,
      "verified": true,
      "author": "CCC",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Cute, but not too entertaining",
      "text": "I bought this for a stocking stuffer last year for my then-9 month old daughter. She has the same opinion now as she did then--a smile, maybe a few minutes of entertainment, then on to something else. It's small and good for the diaper bag when going out. I give it to her when we go out to eat, and that's really the only time she plays with it. It is very durable, no sign of it breaking in site.",
      "rating": 3.0,
      "verified": true,
      "author": "Tenley",
      "helpful_votes": 0,
      "publication_date": 20111006
    },
    {
      "title": "Great musical instrument for young kids",
      "text": "This is a great musical instrument for a young toddler. My son is crazy about it, both the noise and the visual fascination watching the beads go through the maze layers. I also think it would be great for an older toddler.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose D",
      "helpful_votes": 0,
      "publication_date": 20170126
    },
    {
      "title": "Great sensory toy",
      "text": "My youngest is entertained by this and it keeps him busy. It would make a good gift for younger kids. It also makes a great sensory gift.",
      "rating": 5.0,
      "verified": true,
      "author": "alyssa",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Rattle",
      "text": "This is the size of a rattle. Not exactly what I was expecting. The beads are colorful and I’m sure small babies would enjoy it.",
      "rating": 3.0,
      "verified": true,
      "author": "sammi_10919",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Colourful",
      "text": "I like the idea that the babies can see the little balls how they are moving up and down. My son is a rattle fun so he likes everything what gives noises.",
      "rating": 5.0,
      "verified": true,
      "author": "Fruzsi",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Fun musical toy with engaging sounds and colors",
      "text": "Fun to use as a shaker or simply to watch and listen to the little balls fall when you turn it upside-down. For a kids' toy, it actually sounds pretty good. My son enjoyed playing with it at a music-based \"mommy 'n me\" class we were taking, and I was glad to be able to find the same product on Amazon.",
      "rating": 4.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20150710
    },
    {
      "title": "it makes noise!!",
      "text": "my son who was 8 months old when I bought this loved it bc it made noise and would fit in his hand really well. he's turning a year old Tuesday and he still really loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany mccoy",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Fun for baby!",
      "text": "Love this toy! My daughter loves to watch the colors and the noise!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "I had to buy one for home after seeing how much my son loved it at daycare",
      "text": "We call this toy baby crack-at the daycare, it makes every single baby stop crying. I had to buy one for home after seeing how much my son loved it at daycare. It provides lots of entertainment for him and keeps him busy - and calms him down when he's upset.",
      "rating": 5.0,
      "verified": true,
      "author": "Elo",
      "helpful_votes": 3,
      "publication_date": 20140707
    },
    {
      "title": "Great for 9 month old hands!",
      "text": "I love the size of this! It's big enough to be substantial but also my 9 month old can play with it independently",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah J",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Nice rainmaker but my kid wasn't into it",
      "text": "It is not too loud which I appreciate but unfortunately for my baby it does not interest her as a toy.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "Cute toy.",
      "text": "My little one loves this. She turns it back and forth and loves the noise of the \"rain\" and sometimes she shakes it and just giggles. Cute toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Em",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "Gift",
      "text": "I bought it as a gift so I don't really have much feedback but I know she loved it and that it held up well",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandra ",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Fun for baby!",
      "text": "My great niece is going to enjoy this toy that will keep her busy watching the little beads go through over and over and hearing the rainlike sound.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Drew",
      "helpful_votes": 0,
      "publication_date": 20161021
    },
    {
      "title": "Good present for toddler.",
      "text": "This is the one gift that my 16 month old granddaughter didn't put down for several hours! It isn't annoyingly noisy, has a pleasing sound, and I think will entertain for several years.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Abe",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "Just OK",
      "text": "I thought this looked pretty neat online and after reading the reviews I decided to purchase this for my one year old. Unfortunately she just wasn't interested in it. It's been sitting in our toy box. Every baby is different though so I can't say it's a boring toy. It just didn't do anything for my daughter.",
      "rating": 3.0,
      "verified": true,
      "author": "Jackie M.",
      "helpful_votes": 2,
      "publication_date": 20150206
    },
    {
      "title": "Small colorful plastic rainmaker",
      "text": "Bought for my grandson who is 4 months, he loved it! Perfect size and great entertainment for the car seat.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Turner",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Love this toy!",
      "text": "Bough this for a crying aid for my grandson and I love it. I hold it and he loves the sound and watching the beads fall and it quickly distracts his crying from being over-tired or teething. I don't let him play with it alone as the recommended age is older than he is and he could choke on the beads.",
      "rating": 5.0,
      "verified": true,
      "author": "S Bullington",
      "helpful_votes": 0,
      "publication_date": 20141128
    },
    {
      "title": "I like it!",
      "text": "I bought this for my 17 month old son. He plays with a little bit, but I have actually used this myself quite often. It helps to calm my nerves. 😊",
      "rating": 5.0,
      "verified": true,
      "author": "Ronnielynn",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "Very nice stim toy",
      "text": "I got this for my 4 year old child with autism. He loves it, calms him down.",
      "rating": 5.0,
      "verified": true,
      "author": "Gloria S",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "they liked the colors and sound but I think it is ...",
      "text": "got it as a sensory item for my Autistic children, they liked the colors and sound but I think it is way overpriced for what it is.",
      "rating": 2.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Our daughter loves this!",
      "text": "We have a 6 month old. She loves playing with this rainstick. Every time we flip it over she is mesmerized with the sound and the visuals of this toy. Its solid and not to heavy. Fits well in her tiny hands :)",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Charles M. Ramos",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Neat little toy for little ones. It's not too ...",
      "text": "Neat little toy for little ones. It's not too loud but it's an interesting enough noise that it's an attention grabber.",
      "rating": 4.0,
      "verified": true,
      "author": "Tisha Trice",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "Perfect for a calming box",
      "text": "Put it in my daughter's calming box and it worked brilliantly",
      "rating": 5.0,
      "verified": true,
      "author": "Kory Booher",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "2 thumbs up!",
      "text": "Great toy, sound isn't annoying and my 1 year old loves it! Bought a little tykes one similar that looked cooler for my nephew, when I received it it didn't even compare to this toy! It's colorful, easy for toddler to hold, soothing sound and durable!",
      "rating": 5.0,
      "verified": true,
      "author": "Lynette White",
      "helpful_votes": 0,
      "publication_date": 20141120
    },
    {
      "title": "Bought this for my son who is 2. He ...",
      "text": "Bought this for my son who is 2. He doesn't speak yet and he loves the sound of the tiny balls going down.",
      "rating": 5.0,
      "verified": true,
      "author": "SpecialNeedsMom3",
      "helpful_votes": 0,
      "publication_date": 20170203
    },
    {
      "title": "Junk. Static charge ruins the flow and it doesn't work.",
      "text": "Junk. Balls are statically charged and stick together. They get stuck at the top or bottom or to each other and it doesn't flow. I tried to return it and maybe waited too long? Somehow it's not eligible for return. Oh well... I guess I'll give it to my kid anyway. Lame.",
      "rating": 1.0,
      "verified": true,
      "author": "Hugh",
      "helpful_votes": 5,
      "publication_date": 20171127
    },
    {
      "title": "Keeps them entertained",
      "text": "Saw this product in a peds room at the hospital. Purchased it for my sons first birthday. He loves it, gets lots of entertainment from it.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Worrilow",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "I love it, baby likes it.",
      "text": "I love to tip this toy up and down to listen and watch all the balls fall through the slots. The product is well made, no sharp edges and there are lots of balls inside the shaker. I think I may be more fascinated with this toy than my baby... but I think as he gets older, he will enjoy it more.",
      "rating": 4.0,
      "verified": true,
      "author": "miss_betty",
      "helpful_votes": 0,
      "publication_date": 20130903
    },
    {
      "title": "Five Stars",
      "text": "Got what I expected and kids love it. Keeps them occupied for quite awhile.",
      "rating": 5.0,
      "verified": true,
      "author": "Marzipan",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "nice little rain maker",
      "text": "its an ok toy...alot of the balls get stuck on the upper side...and it requires a good bit of shaking...lol...mind you..my 1yr old is partial to it..when i'm changing a diaper and need to distract her...i really like it...and i wish i had of ordered a bigger one as well...b/c she loves to roll this one on the ground and chase it...",
      "rating": 3.0,
      "verified": true,
      "author": "Amberly W.",
      "helpful_votes": 0,
      "publication_date": 20120525
    },
    {
      "title": "grandma loves towatch it work - very relaxing",
      "text": "My 10-month old granddaughter likes this but it's not the first thing she picks up to play with at grandma's house. She shakes it a few times and watches the tiny balls fall down the tube and then goes on to another toy. However, grandma loves to watch it work - very relaxing.",
      "rating": 3.0,
      "verified": true,
      "author": "User1",
      "helpful_votes": 0,
      "publication_date": 20141122
    },
    {
      "title": "Good sitting still toy",
      "text": "Exactly as pictured. Beads run through fast. Perfect size for smaller children.",
      "rating": 4.0,
      "verified": true,
      "author": "Yendi",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Noisey toy, but fun, sensory",
      "text": "I got this for my nephew's son who has a form of autism. It was for his 4th birthday. I was told he really liked it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Not made in China!",
      "text": "This product is made in Israel (not China like a lot of toys out there) and is high quality. We take a music class and this toy was featured in the class. I was happy to be able to find this toy on Amazon. Our 7 month old son and his friends all love this toy. The beads do get a little stuck but he just shakes it around and they fall to the bottom.",
      "rating": 5.0,
      "verified": true,
      "author": "Atlmom",
      "helpful_votes": 0,
      "publication_date": 20130130
    },
    {
      "title": "Baby loves it",
      "text": "Ordered this for my nine month old neighbor who loves to shake things. She loves it. The plus with this toy is that the colored beads making the shaking noise are visible. Some complained about it being too small, but for this nine month old, it is a perfect size. Not too heavy or too big for her hands. Free shipping was a plus.",
      "rating": 5.0,
      "verified": true,
      "author": "Booklover",
      "helpful_votes": 0,
      "publication_date": 20120928
    }
  ],
  "product_meta": {
    "title": "Halilit Baby Rainmaker Mini Toy (8 inch) - Rain Stick Musical Instrument for Babies, Toddlers and Kids - Sensory Developmental Rhythm Shaker",
    "description": "Mini Rainbomaker provides soothing rain stick-like sounds with each turn. Made with see-through prismed walls so the falling beads look magically enhanced to calm all who watch and listen to those relaxing sounds. The bright colors, soothing noisemakers, and textured walls engage visual, auditory, and tactile senses. Gripping, shaking, and tracking the beads develops coordination, engagement of mental skills, and building of fine and gross motor skills. Packaged for easy gift wrapping.",
    "rating": 4.7,
    "feature_bullets": [
      "BUILD MOTOR SKILLS FOR BABIES: The Halilit Baby Rainmaker Mini Toy (8 Inch) by Edushape was invented with the intent of providing soothing, relaxing rain-like sounds with each turn. The continuous shaking and gripping motions aid in the development of fine and gross motor skills.",
      "SENSORY DEVELOPMENT: The vibrant colors, fun noisemakers, and textured sections of this sensory developmental rhythm shaker help to engage visual, auditory and tactile senses in babies, toddlers and kids.",
      "ENHANCE LOGIC AND REASONING: Sensory engagement and tracking the beads inside of this rain stick musical instrument allows for the engagement and development of mental skills in children.",
      "This item is recommended for ages 6 months and up. The product is made with BPA and phthalate free plastic."
    ],
    "specifications": {
      "Item Weight": "8 ounces",
      "Product Dimensions": "8 x 2 x 2 inches",
      "ASIN": "B000CBURPU",
      "Item model number": "HL200",
      "Customer Reviews": "4.7 out of 5 stars1,087 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#36,779 in Toys & Games",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 13, 2005",
      "Material Type": "Plastic",
      "Size": "8 Inch"
    },
    "categories": [
      "Musical Instruments",
      "Musical Toys",
      "Baby & Toddler Toys",
      "Toys & Games"
    ],
    "price": ""
  }
}