{
  "website_summaries": [
    {
      "verdict": "An excellent mid-range tool from one of the best names in the industry.",
      "pros": [
        "Excellent entry-level soldering station",
        "Good temperature range"
      ],
      "cons": [
        "Only one tip supplied (more available)",
        "Lacks temperature indicator"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Un-grounded Tip Fried 30% of our Arduinos.",
      "text": "UNGROUNDED TIP WARNING! I rated this 5 stars so it wouldn't get lost in the reviews, but BUYER BEWARE if you are soldering ESD sensitive microelectronics. We had 2 of these in use on our PCB assembly line and after months of mysterious Microcontroller failures we finally traced the issue to this soldering iron. There is 30-volt AC running through the tip, see pic. This fried approx 30% of the Arduino Minis we backpack onto our PCBs. We thought we had a bad batch of mini's but finally found the issue. This soldering iron. Both of our identical units have this issue. Do not buy if you are using on anything remotely electrostatic sensitive.",
      "rating": 5.0,
      "verified": true,
      "author": "Very Witty Screenname",
      "helpful_votes": 5,
      "publication_date": 20200801
    },
    {
      "title": "Five Stars",
      "text": "Excellent quality tool. First time project, own design, 15\" x 22\", 108 pcs, 3/16\"tape. Turned out great!",
      "rating": 5.0,
      "verified": true,
      "author": "Arne",
      "helpful_votes": 24,
      "publication_date": 20160703
    },
    {
      "title": "Are the good reviews all fake?",
      "text": "Either 1) most of you people don't know how a soldering iron works, or 2) I got a seriously defective unit. This thing takes 10-15 minutes to heat up. Since you should turn down the heat when resting the iron in the cradle for more than a few minutes that means doing 5 minutes of soldering, 10 minutes of resting to install components, and 5 minutes of more soldering, takes more like 40 minutes. Once it heats up, the heat does seem to be pretty sable. That's good. But overall, pretty useless.",
      "rating": 1.0,
      "verified": true,
      "author": "iamjared",
      "helpful_votes": 3,
      "publication_date": 20200817
    },
    {
      "title": "Perfect for pedals, amps...",
      "text": "This is my second Weller WLC100. I chose it over the haako whatevermodel everyone seems so giddy about. It's just a damn reliable tool. It's a Weller.. Period. Built hundreds of pedals with the first one, and it's still going.. I've only had to replace the wand due to the ceramic element cracking and crumbling inside of it. This one was purchased for the amplifier assembly bench, and it's worked flawlessly. If you're just starting out in small electronics as a hobby, or even more, this one won't let you down. It'll be there until you decide to stop using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah B.",
      "helpful_votes": 3,
      "publication_date": 20190716
    },
    {
      "title": "Worthlas Piece of Junk",
      "text": "Unfortunately, I wasted $50 on this -- I got busy with work and didn't start on the project of fixing stained glass lamp shade. This soldering iron takes a long time to heat up -- and the handle gets very hot, but the tip doesn't even stay hot long enough to really melt the solder effectively, even on MAX setting. Very disappointed with this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenn",
      "helpful_votes": 3,
      "publication_date": 20190814
    },
    {
      "title": "I’m so mad that this thing doesn’t work.",
      "text": "I turned it on last week to see if it worked. It got hot. “Yay,” I thought, “it works!” Turned it on this week and nothing happened. Unplugged every part, changed the tip, fiddled with the knob...nothing. I’m so mad. It’s going back.",
      "rating": 1.0,
      "verified": true,
      "author": "K. Burrell",
      "helpful_votes": 4,
      "publication_date": 20191118
    },
    {
      "title": "Great unit for the hobbyist",
      "text": "I am using this to solder guitar electronics. Have used on 2 guitars with great results. Tip can turn quickly so keep clean and tinned in order to reduce oxidation. It seems consistent heat wise and is a great improvement over cheap pencil type I was using. Again, I use this as a hobbyist, so not sure durability for day-to-day extended use. Would recommend for hobbyist that wants a quality unit with some control. Cord does seem to get in the way at times and can be irritating so just make sure to set it up so it stays out of the way.",
      "rating": 4.0,
      "verified": true,
      "author": "steve5985",
      "helpful_votes": 7,
      "publication_date": 20170328
    },
    {
      "title": "It's Not New :(",
      "text": "When I ordered this, I didn't know that it was a returned item. I haven't yet decided if I will return it, nor used it. But, the sponge has burn marks, the tip has obviously been used and is either dirty or bare of tinning (it's black, not silver), and the barrel of the iron has overheated and is discolored. I'm disappointed, because I thought I was buying a new item. I don't find any manual (but don't know if there should be one) or any other paperwork in the rather beat up box.",
      "rating": 3.0,
      "verified": true,
      "author": "Catmom",
      "helpful_votes": 4,
      "publication_date": 20180103
    },
    {
      "title": "Good Little Soldering Iron",
      "text": "Nice to have a small soldering iron with heat control. Unfortunately the heat control knob only gives numbers 1-5 with no indication of heat at the tip or referenced in the manual. I did some measuring with a digital temperature probe and found #1 220F, #2 325F, #3 535F, #4 750F and #5 995F. It took a while for the heat to stabilize at each setting as I had to wait about 5 minutes for new adjusted temperature. At the #2 1/2 setting .032 solder rated at 374F melted. I like this soldering iron and the convenient holder with cleaning sponge, but I feel Weller could have given a better guide to the heat settings - hence the four stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill Cody",
      "helpful_votes": 7,
      "publication_date": 20151217
    },
    {
      "title": "Disappointed.",
      "text": "Since this was the #1 in category, I bought it. Oops, wish I hadn't. Soldered maybe 50 small wires and components with it in maybe 3 sessions and the unit is just maddening. Seems it either cooks the hell out of solder and wire insulation or it's not hot enough to melt anything. It's like someone switches a light switch on and off while trying to use it. I've played with the control and it doesn't really help much. The other disappointment - since day one, the tip has been dark gray and rough. Never been able to get it clean. I've tried a few different solders with it.",
      "rating": 1.0,
      "verified": true,
      "author": "Mr. Neal",
      "helpful_votes": 30,
      "publication_date": 20150311
    },
    {
      "title": "Stiff zip cord is awkward",
      "text": "This soldering iron works well enough for for certain kinds of tasks. I have used it for various small electronic projects and it's ok for that as long as one watches the temperature carefully, and there's some guessing there because of the crudely index temperature dial. Trial and error is required. My biggest frustration is the stiff zip cord wire that connects the iron to the base, It is no very flexible and holds a twist, so I often am fighting the cord to get the iron into the right position for soldering.",
      "rating": 3.0,
      "verified": true,
      "author": "P. R. Wiley",
      "helpful_votes": 2,
      "publication_date": 20190206
    },
    {
      "title": "Quality. Instant heat. Adjustable. Did I mention Quality?",
      "text": "I have 1 old soldering gun, 1 old soldering iron, and 1 new-ish soldering iron. (All going in the trash) I thought I was doing something wrong. I got a bit frustrated. So I searched for the biggest bang for my buck on Amazon. I'm a bit squeaky on $$. So I ran across the Weller WLC100 40-watt soldering station. Took a chance. I'm so impressed. Got my piezo's done in lickity-split. I'm so happy that I no longer feel like an incompetent idiot. It was the old wimpy quality soldering gun & irons that didn't do me any justice. I highly recommend the Weller WLC100 40-Watt Soldering Station. It won't disappoint you.",
      "rating": 5.0,
      "verified": true,
      "author": "Loretta S.",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Missing a part",
      "text": "I just received my new iron and I like it. It was missing the sponge but that's easy to fix. Box was taped closed so someone may have borrowed from Peter to pay Paul. I really like the variable wattage but not crazy about the tip that comes with it. I bought a needle type tip and like it much better. This is not my first Weller iron. I have several ranging from a big gun to a tiny iron. Some of them are 40+ years old and still working like new. I don't use them everyday but when I need one, it always works.",
      "rating": 4.0,
      "verified": true,
      "author": "J. S. Spence",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Solid budget iron with decent power throughput",
      "text": "I've used this iron for the past three months to solder through-hole circuits, the occasional surface-mount and some heavy wire up to 12AWG. So far it hasn't let me down. When it's set to full power it outperforms fixed 40W irons of my past. It's fairly fast too, taking about a minute to warm up to 80% of its setpoint. The scale is a bit vague, so it took a bit of time to get an intuition for the temperature, but when the exact number doesn't matter a whole lot having temperature control at all is a huge plus for this price point.",
      "rating": 5.0,
      "verified": true,
      "author": "Derek Lam",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Multiple Problems",
      "text": "There were multiple problems with this iron. First, the only tip that came with it is useless for detailed work. It is like trying to write with my feet. It is simply too large and it doesn't transfer the heat to the solder effectively. It was missing the sponge that is clearly visible in the picture of the item. The cradle for the iron is poorly designed and the iron tends to fall out if not carefully positioned. I have ordered some replacement tips that will arrive today. If they don't work well, I will return everything.",
      "rating": 2.0,
      "verified": true,
      "author": "rhj4",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Should have went with Weller from the start",
      "text": "This is an excellent Soldering station. It gets really hot if you want it to. The downside is the sponge instead of a metal brillo type pad. I do soldering on guitars and I had trouble soldering onto pots in the past, but this thing does it in no time! Maybe it's the chisel point end, IDK, but it works far better than my other solder stations for that. For some reason, though, the plug wants to not make a good connection, you have to keep on pushing it in the outlet, but that might be the outlet. Overall I'm impressed at this for the price paid.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous Reviewer Dude",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Stopped working after MINIMAL USE!!!",
      "text": "This is the second Weller device I have purchased...BOTH have failed after MINIMAL usage. VERY FRUSTRATED!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Kim T.",
      "helpful_votes": 5,
      "publication_date": 20181207
    },
    {
      "title": "Keep on hand for moderate precision work or general electrical and electronic construction. OK for small computer projects, Pi .",
      "text": "Tricky to find the right temperature with this, Use an IR detector if critical or just experiment with the solder you have. point is fine enough for thru hold and some surface mount work. Not clear if it is regulated but it seems steady at any particular setting without cycling on and off. Once set, use a marker for the control position. For parts in electronic building, like raspberry PI, it is OK. STEM work, hobbies, point soldering. This isn't for sheet copper soldering or doing reflow work or de-soldering on larger IC's.",
      "rating": 4.0,
      "verified": true,
      "author": "CI",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Newb Soldering Electronic Components",
      "text": "Heats up quickly. Weller has a solid warranty on these so its nice to know that if it breaks down we can return them for another. Works as advertised. No problems whatsoever.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh O.",
      "helpful_votes": 18,
      "publication_date": 20150813
    },
    {
      "title": "Problems with fitting the iron in it's holder",
      "text": "The iron catches its solder tip set screw on the round opening in the iron holder. This makes it too hard to smoothly slip the iron into the holder, and the set screw catches when pulling the iron from the holder as well, causing the whole station to lift up. Maybe all it needs is a slightly shorter set screw. A design error someone should have caught. I have contacted Weller and await their reply. UPDATE: Weller said the iron holder part is wrong and they are sending the correct part.",
      "rating": 3.0,
      "verified": true,
      "author": "AlexJ",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Weller performance at a budget friendly price.",
      "text": "Good value for DIY types really all you need, but you may want to practice to learn the temperature settings. I bought a Weller WP25 and that has performed like a champ on small jobs like soldering resistors and capacitors on PC boards. It struggled with larger jobs and things with a heat sink, however. Just not enough wattage for bigger jobs. I finally broke down and bought this WLC100 40-watt station and it does a fine job on bigger projects. Not as nice as the Weller Professional series, but it has a much lower price. I bought a slightly used model from Amazon and it was in excellent condition when it arrived (better than advertised).",
      "rating": 5.0,
      "verified": true,
      "author": "Groundoggy",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "My first adjustable temperature soldering iron. I like it a lot!",
      "text": "Works fine so far. Opened the box and used it to solder a jumper wire onto a corroded PCB. Garage door remote control is functional again. That one repair probably paid for this soldering station! I really needed a mid-range iron. My 25 watt is good for delicate circuitry. My 100/150 watt soldering gun is overkill on all but automotive applications. This 40 watt adjustable output iron gets the job done without frying the components. The variable temperature range works well and seems to maintain a reasonably constant temperature. Slowly crank it up until the solder melts readily. Very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "TJM",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Well worth the money",
      "text": "Great value here. The temp control is stays very stable and consistent. The tips are pointed and you can get into some tight IC boards. The tip sponge reservoir is a little shallow so you need to wet the sponge a little more then some of the fancy solder guns. I use this thing lots of hobby craft with my son on his RC cars and planes. Also use this for lots of soldering on the RV, soldered electrical connections never come loose from road vibrations. Boat trailer wire connections especially need to be soldered. This was a great price for the quality that you get.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Meyers",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "So far so good.",
      "text": "Its way better than the portable propane torches for delicate work such as circuit board soldering. I needed to replace the stepper motors and bulbs in my Chevy Silverado's instrument cluster and this is what I used. I knew my lighter fluid portable soldering iron would burn up the board and lift the traces. I used this iron and the ergonomics and temperature control were right on. It made the job much easier and the job went well. Now I have to see how long it lasts. I will update in the future if necessary.",
      "rating": 5.0,
      "verified": true,
      "author": "HC",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Best Soldering Iron I have Used",
      "text": "This made a huge improvement in my soldering abilities. Before, i had only tried the super cheap version with no temperature regulation and couldn't accomplish even simple soldering tasks. With this, it's like night and day. Completely changed the quality of my soldering and I have built some pretty complex devices with pcb Circuits since buying it. The screw that holds the tip in place kind of gets snagged when pulling the iron from the holder, but if you twist it/rotate it sightly, it comes out without a problem. I don't see that as an issue for the price and quality of this machine. It also uses very nice fine Weller tips that are easy to install and great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "bearingsman500",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Great soldering station.",
      "text": "Three very important aspects about this station that spell SAFETY are: 1st..... The power buttom on the station itself is very convenient and makes you alert of it being on or off. 2nd.... Power control knob that helps you control the amount of wattage/heat on the soldering tip. 3rd..... The holder for the soldering tip is right there next to you. This is a very good setup for anyone who does quite a bit of soldering like me. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "S. RiveraTop Contributor: Bass Guitars & Gear",
      "helpful_votes": 3,
      "publication_date": 20170913
    },
    {
      "title": "Really poor quality iron. Only one bulky tip!",
      "text": "I'm disappointed with the tip. I would have thought for the price it would have come with several tips but it only came with one. The iron feels like harbor freight or dollar store quality. It worked but barely. I should probably send this thing back. The base is of good quality but the iron is sooo cheaply made that I doubt it will hold up for many uses..",
      "rating": 1.0,
      "verified": true,
      "author": "Carl Mazman",
      "helpful_votes": 3,
      "publication_date": 20181228
    },
    {
      "title": "More than enough for the average joe",
      "text": "This is an outstanding value. This iron is more than capable of handling large wire connections. The adjustable heat range is flawless! I started by soldering 24 gauge low voltage wire and went all the way up to 12 Gauge wire. This iron was more than capable of handling both. Even on setting 5 (goes up to 7), I was able to heat up a 12 gauge splice under a minute and performed a flawless connection. 10/10.",
      "rating": 5.0,
      "verified": true,
      "author": "AHans",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Buyer beware",
      "text": "Failed right out of the box, simple fix funny enough, but guess what I need for it? I bought it a few months back and left it in the package it came in till today when I needed it and the light up switch failed to light. I thought maybe the switch was faulty so I waited a minute like directed to see if it would still heat up, Nothing. Moved to different outlet, nothing. Thing is a brick. I got it on sale and got burned. Buyer beware. I'm going to buy the station I originally",
      "rating": 1.0,
      "verified": true,
      "author": "Alejandro Zarazua",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Not as good as expected",
      "text": "When i think Weller i immediately think of the go to name in soldering since i have been using their product for ages, so i thought buying this less expensive one would fare far better then the other less expensive versions offered by other manufacturers. I was wrong, this soldering iron all be it very affordable only was able to maintain proper heat for a few solders then it wouldn't even tin a wire. I will be buying another more expensive Weller. Sorry Weller.",
      "rating": 2.0,
      "verified": true,
      "author": "6 Stringer",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Awkward",
      "text": "The handle is too short compared to the wand it’s very difficult to navigate with this iron. I’m returning it is defective. You can’t tell what temperature it is. It’s just 1 two 3 or four. I don’t feel like the temperature is stable either. It takes a while after you set it down to get a good melt on your solder The two-piece design is also really awkward. I don’t recommend this at least for Stained Glass.",
      "rating": 2.0,
      "verified": true,
      "author": "Cari S.",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Really good quality and stable temps",
      "text": "These stay consistently at temperature, I checked with a laser pyrometer and they work so well. I love working with a quality soldering iron and this is very good for the price. Great for electronics, automotive, or computer cable and sleeving work. I also make my own custom adapter cables as well as custom sleeve work and I solder all of my terminals in place. Great, trustworthy iron at not a huge price.",
      "rating": 5.0,
      "verified": true,
      "author": "Marlo M",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Just spend the extra $$$$",
      "text": "Yes I was one of those who went to two different local stores and bought off the shelf soldering irons, after both broke within days of using them I ended up here. I couldn't be happier with the weller 40 watt. It's a perfect size for my work bench and its reasonably priced for what you get. I recommend spending the money up front for this iron vs. what I did. I gets plenty hot to solder the wires and flight control boards I'm using it on.",
      "rating": 5.0,
      "verified": true,
      "author": "Zach",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "It actually makes heat",
      "text": "It may be because my old soldering irons were old, but they were so frustrating to use because they could barely put out enough heat to melt solder, and constantly needed \"to rest.\" Buying this Weller put all of that into the past, as this until almost instantly heats the wires enough to melt the solder on contact. Comfortable, nice long wire, holder, cleaning sponge... no complaints!",
      "rating": 5.0,
      "verified": true,
      "author": "Carl R",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Great addition to my workbench",
      "text": "Great addition to my workbench. Love the variable settings. I work on guitars and this has been perfect. I put it on 3 to to general wire hookup and bump it to 5 to larger solder jobs like attaching ground wires to pots.",
      "rating": 5.0,
      "verified": true,
      "author": "Wootywooty",
      "helpful_votes": 4,
      "publication_date": 20170904
    },
    {
      "title": "Good value.",
      "text": "Stay away from the cheap irons and soldering kits. Everything in those kits is cheap and low quality. This feels like a \"real\" soldering iron that I could use all day long. Great for a hobbyist. It feels solid and comfortable in the hand. This is a good value for the price. I would only recommend that you buy more tips at the time of purchase. The tip that comes with this gets the job done but it is kind of large. This iron is also a little small for heavy soldering jobs.",
      "rating": 5.0,
      "verified": true,
      "author": "Frostic7734",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Good quality Soldering station",
      "text": "The Weller soldering station shipped out and arrived on time. The box it was in looks really old and like it got wet. The Soldering station and iron look okay and new. IT works great. Holds temperature as it should and does a good job. So far I'm happy with how it works. I would recommend it if you do any light Soldering.",
      "rating": 4.0,
      "verified": true,
      "author": "LLP",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Iron Doesn't Fit in the holder",
      "text": "While assembling the Station I realised the Iron itself did not even fit into the spring stand. The screw that holds the tip in place is preventing it from going in all the way. This was no problem for me because I had an extra iron stand laying around but for the first time buyer they may have an issue there! Love how the iron plugs into the station so if it fails I could just buy another one. For the price weller did a good job! First soldering job completed with it and I expect many more. Tip held fine, my previous iron was not good at all so this is definetly an upgrade.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Perfect performance at a great price...",
      "text": "This works great at what it is designed to do. If you need continuous duty, or are working with large items you'll need to spend more that $30. However, for occasional work this is just the ticket. The tip that is included is not adequate for electronics so you'll need to purchase one separately if you plan to work with PCB or prototype boards.",
      "rating": 5.0,
      "verified": true,
      "author": "backwoodsdog",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Perfect iron for occasional use",
      "text": "It’s a step up from the non-adjustable irons, but just barely. The cord is not super flexible and the iron itself is kind of thick to hold. The setscrew style tip changes are also kind of annoying. For the price I believe it’s a good value, but don’t expect a pro level experience. If you make occasional repairs of electronics, this thing is perfect and highly recommended. If you are a serious hobbyist, step up to the next level Weller or Hakko.",
      "rating": 4.0,
      "verified": true,
      "author": "Washingadog",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Does he job",
      "text": "There are certain things I like about this and some things I wish it improved. I wished the swirly solder holder was a bit more stable. It appears it is barely held down on some hole. For the most part it holds but angle things incorrectly and it’ll tip over. With a hot solder iron, I wouldn’t want to know the results. Besides that, for the wattage I paid for, it warms up much quicker than the super cheap harbor freight one I recently had. For a diy that wants to do simple stuff, it’ll do.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas T. Pham",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Weller WLC100 40-Watt Soldering Station",
      "text": "Weller is a great brand for soldering equipment and this station lives up to the name. Although it does not have all the features of the more expensive solder iron station like tip temperature feedback, but it gets the job done for me who is a DIY'er garage mechanic. The tips are changeable which is great for changing tips for different applications you are working on. I have had no issues using the station in the garage or outside at the vehicle. Makes quick work of soldering wires together or soldering LEDs. This is a great solder station for a beginner or for someone who does not do a lot of soldering. Great price as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie J",
      "helpful_votes": 0,
      "publication_date": 20160517
    },
    {
      "title": "Weller- quality.",
      "text": "I bought a Weller 8200 Soldering Gun, in 1966. Cost a lot for me, then a 14 year old building slot cars. I made about 15 bucks a week on my paper route. The gun, and the stuff it came with, were about 12 bucks. Remember- this is now 52 years ago. The salesman, said that I wouldn't regret buying it- that it would last me 20 years. He was wrong. I still have it- and it still works- more than a half-Century later! This Weller station was priced right, and is everything you'd think a Weller product should be.",
      "rating": 5.0,
      "verified": true,
      "author": "LHBassist",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Excellent inexpensive alternative to temp-controlled stations",
      "text": "No complaints for the price and the intention that this is not a temperature-controlled unit, just adjustable output voltage. The supplied soldering iron is just OK, I augmented it with Weller's much better WP-35, it fits the holder. The nice thing about this station is it will accept any iron that plugs into AC, so you're not limited as you are with a dedicated plug for a feedback-controlled iron. If you solder enough, you're probably experienced enough to deal with setting a tip temp through the wattage of the iron and working around heat losses as you solder.,",
      "rating": 4.0,
      "verified": true,
      "author": "scott decker",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "crap",
      "text": "I would select a minus star if that was possible. I got this a little over a year ago and it does now not work. This is a piece of crap. I have a soldering gun that I've used for over 20 years and it still works. This piece of crap didn't last at all...... Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 2,
      "publication_date": 20190228
    },
    {
      "title": "One Star",
      "text": "2 years old and has stopped working. little use and never worked properly. always had to set to max",
      "rating": 1.0,
      "verified": true,
      "author": "Arrdee",
      "helpful_votes": 3,
      "publication_date": 20180516
    },
    {
      "title": "great step up from the $5 soldering irons you might ...",
      "text": "great step up from the $5 soldering irons you might get at a hardware store or HF. I tend to crank it all the way to 5, and it takes a few minutes to warm up to soldering temp, but the included sponge and spot to put it is a nice touch, and if you wanted to use a different iron with it, or use the iron by itself, it detaches from the temperature controller with a standard 2 pronged wall plug type cord.",
      "rating": 5.0,
      "verified": true,
      "author": "nate michals",
      "helpful_votes": 0,
      "publication_date": 20171020
    },
    {
      "title": "Great soldering iron for the price",
      "text": "Great soldering iron for the price. For repairing electronics around the house, it's perfect. Don't waste your money on the cheaper irons. Having an iron that you can adjust the temperatures on will save you the hassle of melted tips, and potentially damaged appliances and circuit boards. If you want a different tip, for more intricate jobs this one works well: Weller ST7",
      "rating": 5.0,
      "verified": true,
      "author": "Ivan the Great",
      "helpful_votes": 0,
      "publication_date": 20170629
    },
    {
      "title": "So far, so good.",
      "text": "Only used twice but worked perfectly. Set to \"5\" heated up quickly and did the job. Wish I bought this a loooong time ago. I've been using the same old (probably antique) soldering irons for like, well, a long, long time. My old irons mostly made me mad. They just didn't heat up enough. Well, with this new Weller I'm soldering like a Chinese electronics assembly line! Solder is now flowing like water. You know, there's nothing like looking at a finished connection and seeing solder perfectly applied like paint. Good stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "U2",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Good iron.",
      "text": "I've tried other brands and tried being cheap with either using non-adjustable or just cheaper products. Wish I would have bought this sooner. No more burning items while soldering. No more burning off all of the flux before getting a nice shiney weld. I do with it came with more than just one style of tip, but I can always buy more.",
      "rating": 5.0,
      "verified": true,
      "author": "rescue5150",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Worked for 7 months and the base died",
      "text": "Purchased in February 2020 and the base stopped working September 2020. The light on the base comes on but it does not heat the soldering iron. The soldering iron itself still works if it's not plugged into the base but plugged into a different outlet. When it was working, it heated up quickly and worked perfectly. It outperformed any of the soldering irons I got from RadioShack. I have to call Weller to see how much it costs to repair. If it's close to the cost of a new unit, I'll just buy something else.",
      "rating": 3.0,
      "verified": true,
      "author": "TMan",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Quit Buying Cheap Soldering Irons",
      "text": "Just go ahead and buy it. I bought a few $10 soldering irons over the years. If you are lucky, they will last a couple months. This one is great. It is worth it to buy the soldering station. The holder will keep you from damaging your tips or getting burned. Everything about this product is far better than the cheapo soldering irons.",
      "rating": 5.0,
      "verified": true,
      "author": "LandK",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Solid performer and a permanent addition to my bench",
      "text": "I really love this Weller station. It just WORKS. What else can you ask? I love devices that are simple, work well and have a unique look. This soldering station has all three requirements met. I just repaired an electronic cuckoo clock with mine today and it heated up quickly, tinned the leads on the trigger mechanism and was a pleasure to work with. The WLC100 is a classic and if you don't need a big fancy iron for specialized projects, this will do the job for many years to come. I'm glad I decided to get this station and would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon Almada",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "how did I do without this so long?",
      "text": "I've been propping a hot soldering iron on a roll of tape for years for no reason whatsoever. I should have bought this a lot sooner. The iron heats up quickly directly into an outlet or through this controller. I love that I can turn down the wattage for thinner wires, because it keeps me from melting the insulation. The sponge looks useless only a few mm thick, but add water and it swells to over half an inch. Seriously, this soldering station rocks for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "GunNut37086",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Works Great!",
      "text": "I'm not a frequent solderer and had only an ancient pistol-type \"gun\" and a cheap pen-type iron. Both from Weller. Neither seemed to work well and I thought maybe my technique was the issue. I decided to splurge on this setup and am very pleasantly surprised! It heats up quickly and works great! Minus one star for the coiled iron holder not being easily removed from the base for storage in a toolbox drawer. It's pressed into the base quite tight. Unless you modify the coil... :)~",
      "rating": 4.0,
      "verified": true,
      "author": "TR",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Worked perfectly to solder new pickups and wiring in my guitar",
      "text": "Only used for one project so I have no idea how it will hold up long-term. I packed it back into its original box for storage so hopefully it will be ready and work the next time I need it.",
      "rating": 5.0,
      "verified": true,
      "author": "erwin t.",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Hobbyist Soldering Iron",
      "text": "This is a prefect soldering iron for the hobbyist! The only problem is it isn’t temperature controlled, which means if you turn on the soldering iron at max wattage (40 Watts; dial at 5) and leave it there for a while, the iron will get super hot and can damage tips or simply melt components. I like to turn the dial down to roughly 2 when I’m not going to solder for a couple minutes. Also, please keep your tip wet with solder, and if solder doesn’t stick to your tip, learn how to care for it correctly with some YouTube videos.",
      "rating": 5.0,
      "verified": true,
      "author": "Austin",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "Would buy again!",
      "text": "This is a great soldering iron! I’ve been using it for about 6 months and It works better than the very expensive soldering irons that my university uses. It can get very hot and I usually only have to set it to level 3 because level 5 is hot enough to tear up the copper pads on my PCBs. This is definitely a solid product and works very well, I would recommend this to anyone and would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Clark Family",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Solid Hobbyist Soldering Iron...",
      "text": "First, let me tell you that this is a good Soldering iron for beginners and hobbyist. The best feature I like is the adjustable dial to control the heat. I also like its compact size. The only challenge I have come across is that it takes awhile to heat up. Overall, this is a solid soldering iron to start with if you are new to projects that require little to mild use of soldering. I also love the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Don't get this! >:(",
      "text": "I used my soldering iron for about 2 days and i noticed that the ends did not come pre-tinned like other soldering irons i had gotten and on the second day i plugged it in to tin the tip and i touched the plate that connects the tip to the iron i got electrocuted so hard it tried the GFCI outlet i was using.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Not my favorite Weller model",
      "text": "Not my favorite. Bought for stained glass projects. It’s a lot bigger than my last one and kind of heavy which makes my hand cramp up and the bit it came with was far too big so I had to immediately buy smaller ones to even use it. It gets very hot at 5 and I have to use it around 3.5 and then after time that’s too low so I have to wiggle the temp here and there depending on how long I’m soldering for. Overall makes good solid smooth connecting lines which is what matters most at the end of the day.",
      "rating": 4.0,
      "verified": true,
      "author": "Chelsea",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "This is a great soldering iron!",
      "text": "I've done dozens of solders with this iron already and it works great! I would highly recommend using soldering rosin to help the wicking of the solder into the wires. I've owned this now for months and I can tell it's a quality unit. Great price too!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Patceg",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "this will work fine. It is not a quality piece of equipment",
      "text": "If you are cheap and need a soldering iron for occasional use, this will work fine. It is not a quality piece of equipment. If I could go back and do it again, I would drop the extra money to get a quality piece of equipment. If you are looking for a piece of machinery that will perform, bump up your budget $30 and look again.",
      "rating": 3.0,
      "verified": true,
      "author": "The_dude",
      "helpful_votes": 2,
      "publication_date": 20170912
    },
    {
      "title": "Comes with no sponge and a free bag of small rocks",
      "text": "Bought as new, came with a screw missing and no sponge included. There was a small piece of white plastic bag coming out of the corner, i thought it was odd so i kept pulling on it thinking they might have included the sponge under the unit. I kept pulling until a big bag of small rocks pulled out of the bottom of the unit.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicholas Stinzianni",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Buyer beware, Weller quality and reliability is not what it used to be.",
      "text": "The iron operated normally for all of five minutes before cooling and never reheating again. I got a lemon. Unfortunately, I discovered this outside of the 30 day window to easily return the item back to Amazon. I contacted Weller who is happy to replace the item ad nauseam, with shipping cost covered by yours truly, but without the one thing I desire at this point -- a full refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190305
    },
    {
      "title": "Worked once then crapped out",
      "text": "I bought this soldering iron and used it a few days after it arrived. It worked just fine. However, a few months later I pulled it out of storage and it would not get hot. After watching a few youtube videos on how to repair, I opened this one up and it looks very cheap and doesn't really seem like it was designed to be worked on at home.",
      "rating": 1.0,
      "verified": true,
      "author": "Rob Crowell",
      "helpful_votes": 2,
      "publication_date": 20181212
    },
    {
      "title": "THE glass soldering machine you need!",
      "text": "Just stop looking at other irons and get this one if you are planning on doing stain glass work etc. That cheap 10-20$ one isn't going to work, and the 100 watt ones are going to get too hot. This is the one you want.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 5,
      "publication_date": 20170712
    },
    {
      "title": "Quite pleased so far. Temperature exceeded specs",
      "text": "I'm mainly concerned with how long this iron will last, but I'm quite pleased so far. It a bit flimsy, but that's expected at this price point. Regarding temperature, on the highest setting (5) I was quite surprised to measure the supplied tip heating to 932F, a few degrees over the spec. The one thing i don't like is the little screw that locks in the soldering tip. It feels like if this little one penny part freezes up from the heat, the whole thing will be useless.",
      "rating": 4.0,
      "verified": true,
      "author": "Myles M",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "pure junk do not buy",
      "text": "Pure junk...would not heat up after one use of about 5 min. Do yourself a favor and buy a better quality iron if you are doing stained glass work like the Hakko FX601-02 Adjustable Temperature Controlled Soldering Iron, 67 Watts Yes it cost a little more, but it is well worth it",
      "rating": 1.0,
      "verified": true,
      "author": "biglry",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Great little analog soldering station.",
      "text": "My old soldering station went south on me right in the middle of rewiring a vintage electric guitar. It wasn't even six months old, either. My other one was a digital, and this one is analog because I really needed to finish that guitar and it was all I could afford at the moment. I have used this Weller for about a month now, on a couple of projects and I'm finding it to be much better than the expensive one that died just after it's warranty lapsed. I believe this will do me just fine. Should have bought a quality tool the first time. Heats up really fast and maintains temperature very well.",
      "rating": 5.0,
      "verified": true,
      "author": "km5wu",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Great hobby iron.",
      "text": "I own several RC (Radio Controlled) vehicles, and have gotten tired of all the different types of connectors they use. I bought this station to solder new connectors on most of my vehicles and batteries so that all of them use one of two different types of connectors. This iron is perfect for that, the iron itself is very ergonomic, iron tips are fairly easy to obtain, and the station is small and compact. I haven't been soldering for all that long, but I can safely say this is a good, reliable iron, and it is wonderful for hobby use.",
      "rating": 4.0,
      "verified": true,
      "author": "Hawk eyeTop Contributor: Guitars",
      "helpful_votes": 6,
      "publication_date": 20140518
    },
    {
      "title": "Very good soldering station, reasonable price",
      "text": "I am not super experienced, but for my needs I have enjoyed using this soldering station. It gets appropriately hot, fast enough, and I like having the base and sponge handy in one place. The iron can at times be just a little difficult to pull out of the base, so that is why it is not five stars.",
      "rating": 4.0,
      "verified": true,
      "author": "P. Sorensen",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Lasted about 10 solder sessions, and kaput!!",
      "text": "I bought this for the occasional soldering I do. I've used this about 10 or so times, and it no longer works. I unplugged it from the base, and put it in the wall, and that didn't isolate a problem. Not much to these, they shouldn't really break. I ordered a separate soldering iron without the base. We'll see if I just got a lemon.",
      "rating": 1.0,
      "verified": true,
      "author": "homesculptor",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Better than the cheap stuff",
      "text": "This is a pretty nice soldering station. Probably more than I need for the occasional task in the shop, but it is WAY BETTER than anything you can buy at Walmart or whatever. Don't waste your money on the cheap $10 stuff like I did, because you will be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Solidly Built",
      "text": "Great for everything from PCB soldering to larger automotive stuff (I’ve done up to 10-gauge stranded copper with this). Plenty of heat. Only comes with one tip so order a set when you buy it. I also put some anti-seize on the grub screw that holds the tip in to make sure it comes out easily in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous Consumer",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Good Overall",
      "text": "Its a great piece of equipment for its price. Im used to using irons that get much hotter than this though. It has a control for power but its certainly not an accurate way to set temperature. I use the max setting and it still takes 1-2 seconds for the solder to melt. It's good for soldering circuit components. All in all its a fine piece for home projects.",
      "rating": 4.0,
      "verified": true,
      "author": "LMaster",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Failed after a few hours of use.",
      "text": "I only used this item a few times since purchase in September 2019....probably no more than five hours of use. Plugged it in yesterday and it would not heat. Checked voltage on the temp controller and it was OK. So apparently the heating element in the iron burned out. After paying about $70, the iron should have lasted a lot longer. Very disappointed since Weller HAD a good reputation and the other Weller items I purchased 35 years ago still work. I hope this review helps someone else save a few bucks.",
      "rating": 1.0,
      "verified": true,
      "author": "DJA",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Can't go wrong with this Idem",
      "text": "One of the best soldering iron station I ever bought. I had a few and for the price and quality you can't go wrong with this product. Only thing I would recommend is get a solder tip wire cleaning and holder. The sponge will damage the tips over time. This is what I got  also a very great product",
      "rating": 5.0,
      "verified": true,
      "author": "Raul G",
      "helpful_votes": 2,
      "publication_date": 20161108
    },
    {
      "title": "Great entry level soldering iron",
      "text": "This is a great entry level soldering iron. It supplies a good amount of power (sometimes too much so you should be careful). I don't dial it up past 3 since I found that the iron can get too hot and burn PCB boards if you are not careful or hold it down too long. An improvement for this unit would be to bundle it with solder cleaning wire instead of the sponge which will ruin the tip over time (since you wet the sponge).",
      "rating": 4.0,
      "verified": true,
      "author": "D. Siah",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "I love this tool",
      "text": "My go to soldering iron brand from now on, I love this tool, I usually use it in the 4 settings, and works great, but if I need to solder a brass connector, i bump it up to 5 and it burns fast, and that makes the work a little easier. I would recommend this product to anyone in the drone hobby, you get your wiring done right the first time every time.",
      "rating": 5.0,
      "verified": true,
      "author": "Edgardo Rivera",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Iron stopped working after two minutes",
      "text": "Iron stopped working after two minutes.....no heat whatsoever. Plugged directly into power source to see if it was the station but nope, the iron is junk. I wasted my money and now have to go buy another iron to finish my job. Weller should be ashamed to put their name on this low quality piece of junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris Thompson",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Worked fine for a month, then exploded on me. useless",
      "text": "Well it worked for a bit, I've used soldering irons before and this is super simple and straight forward to use. While placing wires into position to solder, a fiery pop and fizz threw me out of my chair and now the unit no longer heats up. i suspect some sort of short happened, but there was no mishandling of the device on my part. Don't think id recommend this to anyone without also including a hefty warning about the inconsistent build quality",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Good for hobbyist home use",
      "text": "I am a hobbyist and have used this for a couple of small projects and it is working out just fine for me soldering mostly circuit board type stuff. There is more than enough wattage for those tasks and I am still experimenting with the various heat settings on it to find the optimum settings for different tasks. The overall quality appears to be good. It comes with a pretty hefty tip (the ST 3 or ST 4 I believe) which is too large for circuit boards. Fortunately a local electronics store carries the tips and I was able to find a conical ST7 which has a very narrow tip and works great on boards.",
      "rating": 5.0,
      "verified": true,
      "author": "David Joiner",
      "helpful_votes": 0,
      "publication_date": 20160118
    },
    {
      "title": "Casing not temperature resistant",
      "text": "Definitely puts out power. The base is sturdy enough. Only issue is that the plastic holding the sponge (and serving as the case for the whole unit) seems to have little to no heat resistance. I accidentally touched the solder pen to the edge of the plastic container area and it instantly melted.",
      "rating": 4.0,
      "verified": true,
      "author": "Juan",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Made in Mexico",
      "text": "Just received my Weller so I don't yet have a complete review. I used Weller when I worked in aviation electrical and it was a good product then. Before purchasing and reviewing warranty info, it looks like the product may be manufactured in the US. Receiving it shows it's made in Mexico so I decided to read some recent bad reviews and am now worried I wasted my money. I update my review once I start using it. Hard to believe that Amazon would pick this as a choice product.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Good for the price",
      "text": "It's a pretty good backup or beginners station. They only put one screw in to hold the base together instead of the two it was designed for, and the knob is out of alignment right out of the box. I straightened the knob up and it works pretty well. 3-3.5 feels like around 300-350C-ish. Temperature recovery is adequate, but nothing like a temperature controlled iron. If I had paid $100 for it I would be disappointed, but for under $50 it's a killing machine.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "Great product at a very fair price.",
      "text": "I love things that are well made and work the way they should. This soldering iron station has enough of a range to do a lot of the things that I use a soldering iron for. My only recommendation is to buy a pencil tip at the same time you buy this soldering station. The tip it comes with is broad and not as easy to use in tight spaces as a pencil tip.",
      "rating": 5.0,
      "verified": true,
      "author": "Alesis",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "You can’t go wrong with a Weller",
      "text": "Great choice, great investment for anyone who does any type of soldering. For me I work on guitars and everything I used in the past doesn’t compare. I highly recommend the Weller WLC-100. Weller has been around as long as I can remember. My grandfather worked on TV’s he used a Weller, that was 60 plus years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "1bluesman",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Fantastic for Soldering",
      "text": "I've managed to burn myself at least three times so far while using this. I wish it came with additional tips, a smaller point would have been dandy for what I needed this for. Otherwise a decent station to use for small projects.",
      "rating": 5.0,
      "verified": true,
      "author": "advanracing62",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Very well made.",
      "text": "I like the temperature adjustment. I suffered enough for overheated solder joints from my regular soldering irons. The one it replaced I paid over a hundred dollars 15 years ago and regulates only from overheating beyond the max watt rating.",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo A. Seneris",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "the iron doesn't even fit in the stand",
      "text": "The metal part behind the tip is too wide to fit inside the stand. I returned this item for another because I thought it was just a lemon, but the second one was the same way. The sponge that comes with it is super thin and clearly cheap. This is clearly a cheap soldering iron, despite the reviews I have seen. Going to spend more money for a real station.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristy",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Best Iron I Own",
      "text": "This is the best soldering iron I have ever owned. I got it for some hobby electronics, it heats up quick and allows me to easily and quickly solder my electronics. I wasn't willing to spend $600+ for a professional iron. I'm glad I picked this one!",
      "rating": 5.0,
      "verified": true,
      "author": "KKlouzal",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Great DIY person soldering station for jobs here and there.",
      "text": "I use it from time to time as a light duty DIY dude, and it's leaps and bounds ahead of the craptastic radioshanty version I had before. The tip flows solder really well and cleans up really well. Temp control is great and the stand is great as well. Totally happy with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "B. Ginkel",
      "helpful_votes": 2,
      "publication_date": 20170430
    },
    {
      "title": "Works very well",
      "text": "It works perfectly. Within a minute I'd replaced a battery in a touchpad that had been giving me some problems. I could write really enthusiastic things about it too, but the reality is that these would have to be cautioned because I would be comparing this machine to a soldering iron my Dad bought me to put together Heath Kit radios as a kid. (That one probably worked just as well -- 40 years ago.)",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa ",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Worked great about 5 times..",
      "text": "Got this for my husband for Christmas. He just started using it last week. He has used it only a handful of times for only a few minutes at a time. IT HAS ALREADY QUIT!!!! And it's too late to return it. Not happy!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Burned out",
      "text": "Used it once, seemed fine. Attempted to use it a second time, would not heat.",
      "rating": 1.0,
      "verified": true,
      "author": "Roger R. Torgerson",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Great value. Should do a student or semi-serious hobbiest well.",
      "text": "I purchased this for my son who is an engineering student. I've used a variety of soldering irons over the years from super cheap ones from Radio Shack, to professional Metcal soldering stations. Obviously, this is not Metcal quality, but for the price it does a very nice job. The fact that you can modulate the temperature is great. It was a bit harder than normal to properly tin the tip, but other than that, it has done well.",
      "rating": 4.0,
      "verified": true,
      "author": "tom",
      "helpful_votes": 0,
      "publication_date": 20170624
    },
    {
      "title": "The only shortcoming of this model is the temperature dial.",
      "text": "This is my first soldering iron and am am pleased with the purchase. It is a no frills 40 Watt iron with a nice storage area and sponge. So far i have a great success with it on my Arduino projects. If you're looking at this for the same reason I was and intend on doing a lot of soldering i would look for a model with a digital temperature read out. The only shortcoming of this model is the temperature dial. I lot of the time i feel like i'm just winging it on the temp, which is a good way to overheat sensitive electronics and brick a board.",
      "rating": 3.0,
      "verified": true,
      "author": "mrkbkr",
      "helpful_votes": 3,
      "publication_date": 20150410
    },
    {
      "title": "Great but should have gone with a rework station",
      "text": "Using this to create a massive Christmas light show on my house. I really like being able to change the temperature. My only regret, for just a little more I could have bought a rework station with many more features.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Mills",
      "helpful_votes": 6,
      "publication_date": 20160621
    },
    {
      "title": "Good value for the money but leaves you wishing for more",
      "text": "It's a clear step up from a soldering pen, but leaves you wishing you'd sprung for the $99 version. Pros: Base station setup with soldering iron holder & sponge pad Adjustable temperature gauge (1-5) Cons: Temperature gauge is labeled 1-5. Lacks temperature display (Is it heated up yet?!?) Takes a rather long time to heat up Lacks brass wire tip cleaning sponge It's a good value for the money but I'm upgrading to a Hakko to address the Cons.",
      "rating": 4.0,
      "verified": true,
      "author": "Don R. Hanson II",
      "helpful_votes": 0,
      "publication_date": 20160515
    }
  ],
  "product_meta": {
    "title": "Weller WLC100 40-Watt Soldering Station",
    "description": "Wattage:40 WattsThis 40 watt Soldering Station from Weller features a quality lightweight pencil iron and a cushioned foam grip with replaceable heating element. This product is ideal for hobbyist, DIY enthusiasts and students.\n\nAMAZON.COM\nThe Weller WLC100 Soldering Station includes everything you need to start using solder to join metals and create efficient, electrical connections. Designed with the hobbyist and the do-it-yourself enthusiast in mind, this kit features a high-quality, lightweight pencil iron with variable power control, a cushioned foam grip with a replaceable heating element, and a safety guard iron holder. And it’s from Weller, the world leader in soldering since 1945. \n\n \n\nThe Weller WLC100 Soldering Station offers:  * A lightweight pencil iron\n * Power adjustment from 5 to 40 watts\n * An ST3 iron-plated 1/8-inch screwdriver tip\n * A built-in iron stand\n\n\n\nWeller offers a variety of compatible soldering iron tips. View larger. \n\nA built-in holder keep your soldering iron ready to use. View larger. \n\nA lightweight pencil iron is the heart of this system. View larger. Durable, Easy-to-Control Pencil Iron\nAt the heart of the WLC100 Soldering Station is a high-quality lightweight pencil iron with an ST3 iron-plated copper tip. To ensure that you can work comfortably for long stretches of time, the iron has a cushioned foam grip that sits comfortably in your hand as you work. It has a replaceable heating element, so you can continue using the same iron for a long time to come. Easy-to-Adjust Variable Power Controls\nUnlike many basic soldering kits, which can be difficult to adjust, the WLC100 features a variable power control that lets you adjust the power level from five to 40 watts with a simple turn of the knob on the base unit. This lets you choose the precise setting for each unique job that you tackle. The base also includes a \"power-on\" indicator light and on/off switch to help keep you from leaving a hot iron on accidentally.\n\n The workstation also provides a built-in iron stand to keep your workspace organized and a natural sponge tip cleaning pad to keep your tip ready to go at all times.\n\n High-Quality Accessories for Dependable Performance\nThe WLC100 includes an ST3 iron-plated 1/8-inch screwdriver tip. Weller also offers a wide array of compatible ST series tips to perform a variety of applications (additional tips are sold separately).\n\n All Weller tips are constructed of solid copper and plated with iron, as well as nickel and chromium to protect against corrosion and solder creep, helping to ensure that your tools perform reliably over time. Additionally, Weller tips are pre-tinned with tin/lead solder.\n\n This WLC100 Soldering Station is UL-listed, which means it has been tested and meets independent safety standards. It is backed by a one year warranty against manufacturer’s defects in material and workmanship.\n\n \nWhat's in the Box\nSoldering iron, ST3 tip, and base unit with built-in iron stand. \n\n\nFROM THE MANUFACTURER\nThis 40-Watt soldering station features a quality lightweight pencil iron and a cushioned foam grip with replaceable heating element. This product is ideal for hobbyist, do-it-yourself'ers and students.\n\nSee more",
    "rating": 4.5,
    "feature_bullets": [
      "High performance analog soldering station produces up to 900° F to handle many soldering projects",
      "Variable power control dial adjusts power from 5 watts to 40 watts for accuracy",
      "Quality, lightweight pencil iron with cushioned foam grip provides extended comfort during long term soldering projects",
      "Includes: a Weller certified ST3 iron plated tip for long life and consistent performance, a built in soldering holder to safely rest your pencil, and a cleaning sponge to remove unwanted residue from soldering for next time use",
      "UL Listed: Tested and meets independent safety standards"
    ],
    "specifications": {
      "Manufacturer": "Weller",
      "Part Number": "WLC100",
      "Item Weight": "1.65 pounds",
      "Product Dimensions": "8.8 x 3.76 x 6.3 inches",
      "Item model number": "WLC100",
      "Is Discontinued By Manufacturer": "No",
      "Size": "1 Pack",
      "Material": "Copper",
      "Power Source": "Corded-electric",
      "Wattage": "40 watts",
      "Item Package Quantity": "1",
      "Number Of Pieces": "1000",
      "Included Components": "Iron-Plated Copper Tip, Weller Wlc100 40-Watt Soldering Station, Natural Sponge Tip Cleaning Pad, Safety Guard Iron Holder",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "7 year warranty",
      "National Stock Number": "3439-01-302-7225",
      "ASIN": "B000AS28UC",
      "Customer Reviews": "4.5 out of 5 stars2,626 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#865 in Industrial & Scientific",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "May 10, 2004"
    },
    "categories": [
      "Soldering & Brazing Equipment",
      "Tools & Home Improvement",
      "Welding & Soldering",
      "Soldering Stations"
    ],
    "price": 38.97
  }
}