{
  "website_summaries": [
    {
      "verdict": "A handsome product from a reputable manufacturer. A good concept, but it has some flaws.",
      "pros": [
        "Sleek design and no-tool installation",
        "Can inhibit bacteria growth",
        "Has 5 spray settings"
      ],
      "cons": [
        "Water deposits are still noticeable, and water pressure is reduced",
        "The plastic top feels flimsy, and the unit doesn't fare well with hot water"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Good water pressure, filter that gets rid of chlorine and a budget-friendly price make for a good, but not great showerhead.",
      "pros": [
        "5 spray patterns including massage",
        "affordable",
        "filter removes chlorine in water, which is better for hair and skin"
      ],
      "cons": [
        "Filter has to be changed every 10,000 gallons — not expensive, but very inconvenient"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "works for the hard water",
      "text": "love it!. use the test paper to test the hardness of the water. The right is the water coming from my kitchen and the left is coming from Culligan. It really works for the hard water.",
      "rating": 5.0,
      "verified": true,
      "author": "yumusenlin",
      "helpful_votes": 590,
      "publication_date": 20150823
    },
    {
      "title": "Hardly perceivable",
      "text": "The right is before using the filtered shower head, the middle is after and the left is bottled water. It seems to have made a slight difference, hardly perceivable to me, I may try a a few more filters to see if they can give me a bigger difference.",
      "rating": 3.0,
      "verified": true,
      "author": "C. v bick",
      "helpful_votes": 154,
      "publication_date": 20170131
    },
    {
      "title": "You are better off getting a whole house water softener or some ...",
      "text": "This filter does nothing to reduce TDS (total dissolved solids) in the water. My TDS meter showed no difference when adding this shower head, despite its claim of \"reducing the amount of scale (a hard, filmy residue created by minerals in water)\" All it did was reduce water flow. You are better off getting a whole house water softener or some other shower head product and testing it yourself. Make sure it does what it actually claims to do. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Tethyss",
      "helpful_votes": 48,
      "publication_date": 20170824
    },
    {
      "title": "Before installing this filtered shower head, I had a ...",
      "text": "Before installing this filtered shower head, I had a lot of issues with mineral build-up on my scalp causing intense itching. This filter solved that problem. I hope it can also help keep the glass shower doors cleaner.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Arany",
      "helpful_votes": 16,
      "publication_date": 20170214
    },
    {
      "title": "Freaking amazing",
      "text": "Amazing Product 😍😍😍😍😍😍😍 Combined this with the Aquabliss add on filter and made magic. I felt so holy after my next shower it is amazing!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Alaric Payne",
      "helpful_votes": 15,
      "publication_date": 20170730
    },
    {
      "title": "Softer Water, Chlorine Reduced: Use Less Soap/Shampoo",
      "text": "With Amazon Prime, the filter arrived in one day and I immediately installed it. The filter did everything it said it would: the chronic chlorine smell was gone and I used a LOT less shampoo and conditioner. Who knew shampoo foam was so delightful? Certainly I didn't...the hard water struggle was real. But not anymore: delightful, foamy shampoo in my hair for the *first* time since moving to Florida. The hydrating soap I usually use didn't leave my skin slimy with this shower filter--just soft and smooth. Wonderful. I have no complaints about this product: the filter softens and thereby improves water quality so there are no impurities left on my skin and hair. This is all I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "InOrlando",
      "helpful_votes": 3,
      "publication_date": 20180824
    },
    {
      "title": "Extremely low water pressure!",
      "text": "I liked the way my skin felt using this shower head/filter combo. However, after using it for just over a year, I've given up and replaced my shower with the original shower head that unfortunately does not filter my water. I honestly got sick and tired of the extremely low water pressure this Culligan shower head gave me. Even when changing out the shower filter there was hardly any difference from the old filter. Now this shower head just sits underneath my bathroom sink and collects dust. Ugh!",
      "rating": 2.0,
      "verified": true,
      "author": "Tall Paul",
      "helpful_votes": 3,
      "publication_date": 20190920
    },
    {
      "title": "Great filter, but unsatisfying shower experience.",
      "text": "This easy to install shower head does a good job of filtering the water to remove what dries your skin and turns your hair to straw. With just one shower my skin was soft and my hair felt soft and styled easily. Unfortunately, the shower experience is unsatisfying. The spray pattern is narrow and the pressure is weak. It takes more time than with my old non-filtering shower head to rinse my hair. And no matter how hot I make the shower I never feel enveloped in the heat. Wherever the spray doesn’t touch me I feel cold.",
      "rating": 3.0,
      "verified": true,
      "author": "Jim Grey",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Product has changed. Don't recommend it anymore.",
      "text": "If you are purchasing this shower head in 2018 or later, be aware that they have changed the product. I bought this shower head a couple years ago and it had amazing water pressure, so I decided to buy another one and was extremely disappointed with this new one. The pressure is next to none. Also, there is no way to remove the flow restrictor. Bummed, since this used to be a great product. Save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20180621
    },
    {
      "title": "Hard water..",
      "text": "We have very hard water in an area high in iron and no water softner. In our new (to us) home the water smells like sulfur, is very hard and causes rust streaks on the shower walls. My hair is damaged, and my skin is fairly dry after just one month living here. The shower head... I've showered once since installing. My hair feels much better, no more itchy skin, and the smell is not nearly as bad (still has a mild smell) and its very simple to install. I only gave 4 stars because I guess I was overly hopeful the smell would go away completely. I'd recommend this to a friend.",
      "rating": 4.0,
      "verified": true,
      "author": "Truly Barendse",
      "helpful_votes": 3,
      "publication_date": 20171013
    },
    {
      "title": "Read this Review!!!",
      "text": "Love this shower head. This is my second one. First one I had for years, and seal finally burst. Use with the generic Fulters inside it for crystal clean water. I have can er and dry flaky skin. This help improve my skin. I also have a whole house water 💦 softener too, but the shower head helps even further. I replace the interior cartridges every 3 months. This is a great addition to your showers, and it also keeps the glass on your shower doors cleaner too! See the bottom of the Amazon site page for the generic filters to use with this shower head..",
      "rating": 5.0,
      "verified": true,
      "author": "Gail",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Tested and it's worse than tap!",
      "text": "This filter is complete trash. We tested tap water, bottled water and the shower water using this filter. The tap water was somehow slightly better than the water that came out of the shower that was being filtered by this trash. Absolutely riding. Tap water was 208 ppl and this shower head filter made the water 221 ppm. Already started the return.",
      "rating": 1.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 2,
      "publication_date": 20190325
    },
    {
      "title": "Nice shower head.",
      "text": "Read the reviews on this shower head. Did not want the water restricted so tried to follow advice from reviewers on removing the water regulator and gave up. It is much harder and impossible as far as I am concerned. I would advise leaving it alone or purchase another shower head if the restriction bothers you. Other than that, a nice shower head..",
      "rating": 4.0,
      "verified": true,
      "author": "MarleneLouiseTop Contributor: Coloring",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "If it does make a difference I'll buy a better quality filtered shower head",
      "text": "Frustrated that I cannot get a complete seal with this shower head. I used the tape provided and tightened by hand and wrench. The small leak doesn't seem to come from where the shower head joins the pipe but from the first joint of the shower head. Maybe this is what happens when one buys a plastic product. I have high hopes that the filter may help my hair so I'm looking forward to see how it goes. If it does make a difference I'll buy a better quality filtered shower head. All in all, for this price, it's a good \"first filtered shower head.\"",
      "rating": 3.0,
      "verified": true,
      "author": "Amy Huang",
      "helpful_votes": 2,
      "publication_date": 20170924
    },
    {
      "title": "Replacement Shower Head",
      "text": "At the surface this shower head would be an improvement to the builder grade unit that was installed. I found quickly that you could not adjust the spray setting easily. Even today, I cannot change the spray pattern without making it a major effort. I am about to put the original shower head back and throwing the new one away.",
      "rating": 1.0,
      "verified": true,
      "author": "Senator",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Shower head made with cheap plastic",
      "text": "I enjoy the filtered water. It makes a big difference to add this filter and using the original brand is probably the best way to get prolonged softer water. The problem is when I have to change the filter. The cheap plastic causes leaks no matter how much I follow instructions and how careful I am. I have bought this product multiple times because of the same problem. I change the filter 2 or 3 times and by then I cannot prevent leaking. I would give it more stars if they used better material, not this cheap plastic.",
      "rating": 3.0,
      "verified": true,
      "author": "Cristina & Kristoff",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "water quality is 5++ stars, showerhead is a 2 star",
      "text": "The water comes out kind of weak. Only 3 of the five settings work (full body,full body/pulse, and pulse). The shower head wouldn't change from full body to the other two settings. I bought this used with the stipulation that the packaging was damaged. My brother had this same one but he bought his in the store. This was missing the mesh aerator inside the shower head and the Teflon tape. The filter does work though. My skin and hair feel great! I'll give it 4 stars for that at least",
      "rating": 4.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "OK but I had two and both failed.",
      "text": "I really like this shower head, but I've had two of them and they both failed. Both of them developed cracks around the outer part of the gray rubber ring, and leaked badly from the cracks. The second one was a replacement for the first. Each lasted about 2 or 2 1/2 years of one shower daily. It isn't like I'm hard on shower heads. I had them set and never adjusted or moved them except for the occasional cleaning. I feel there must be a weakness in the design or manufacturing.",
      "rating": 3.0,
      "verified": true,
      "author": "AH",
      "helpful_votes": 3,
      "publication_date": 20161210
    },
    {
      "title": "Does not last",
      "text": "I received 2 of the Culligan WSH-C125 on Sept 17,2018 one is installed the other is not. Problem: the first two months it was great I really felt a difference but that's where it ends. I noticed that my skin was dry and itchy just like it was before I installed this item. You say it is to last 6 months or 10,000 gal but this is unacceptable. Sadly because it is over the one month mark I can't get in touch with anybody. Maybe it was just a bad filter, but at this point I have wasted $60.00 of my money.",
      "rating": 2.0,
      "verified": true,
      "author": "Ken Scott",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Great Shower Head!!",
      "text": "I live in Tempe Arizona where the city water is very hard and has been chlorinated, this shower head makes the water much softer and completely gets rid of the chlorine smell. It was very easy to install, I replaced the shower head that was previously installed in just a few moments. Also, the replacement filters are very cheap, so it makes this shower head very affordable. I would highly recommend this shower head to ANYONE that lives in a city where the water has been treated, it makes a huge difference!",
      "rating": 5.0,
      "verified": true,
      "author": "Ben M.",
      "helpful_votes": 2,
      "publication_date": 20170802
    },
    {
      "title": "but there isn't a lot you can easily do about your shower",
      "text": "This product is essential if you ever find yourself living in an area where the water is not potable. You can filter and boil your drinking water, but there isn't a lot you can easily do about your shower. There are more complicated devices that will actually work to filter your shower, but they're not compatible with all shower types. This product is easy to install, you just need to be able to unscrew your shower head. After installing you can install the filters whenever you need. If you'll be dealing with unclear shower water for a long period of time you can start a subscription to the replacement filters and make it a routine.",
      "rating": 5.0,
      "verified": true,
      "author": "jnewbie",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "Excellent shower filter",
      "text": "Love this water filter for the shower. I live in South Florida and our water is full of chemicals. Without this filter my hair is frizzy and skin dry and itchy after a shower. Once installed I feel the difference immediately. It is very easy to install and comes with everything you need. It has three different settings for water flow. It's important to remember to change the white filter inside every 6 months (or more - depending on the number of users). Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "LVDV",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Buyer Beware",
      "text": "Updated Review - Nov 2016: by the time we installed this unit and the amount of time that it actually worked, was less than two months. While I am certain that we have toxins in our water, at $30 apiece for this unit, for some potential health benefit, I cannot say that this is a worthwhile purchase. While there may have been some initial perception of some kind of positive benefit on my hair and skin, I cannot say that it was all that measurable.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 4,
      "publication_date": 20161120
    },
    {
      "title": "Works great. Easy to mount on",
      "text": "Product reviewed based on Saudi Tabuk's hard water. Works great. Easy to mount on, water is clean I can drink it and compared it with my kitchen water which I can't drink. I washed my hair and my hair feels great. I have nothing to compare to when it comes to my hair as I've always washed my hair with bottled water after it started to fall due to the hard water in Tabuk. I'm super happy I took the plunge based on the reviews and order this shower head. It's a blessing:) Now go ahead, order yours it's gonna make a world of a difference:) to your scalp, hair and skin:)",
      "rating": 5.0,
      "verified": true,
      "author": "Tarah-Leah",
      "helpful_votes": 0,
      "publication_date": 20171031
    },
    {
      "title": "Doesn’t work as advertised!",
      "text": "This doesn’t help with hard water! False advertising, I retested my water and it still remains the same. Don’t waste your money because it’s BS!",
      "rating": 1.0,
      "verified": true,
      "author": "tara pardo",
      "helpful_votes": 3,
      "publication_date": 20190226
    },
    {
      "title": "Nice shower head but no benefits to hard water.",
      "text": "While I really like the shower head (thus the 2 stars) it's hope to act like a water softener fails completely. I tried it a number of months evaluating it. Yes, my hair was soft but not \"soft water soft\" with body but fly away soft, sort of like cotton candy,, sticking to my mouth. Have to again revisit a real softener. I love the difference when I stay in Pasadena where the water is soft, or at least the hotel water is. No dryness and thicker glossier feel to your hair. Very disappointed and cannot use it without the filter.",
      "rating": 2.0,
      "verified": true,
      "author": "Lovers of the Lamb",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Great showerhead, fantastic for hard water and scale buildup issues",
      "text": "I bought this item to solve my hard water issue. We have a terribly hard water that's treated with bleach and it leaves scale and buildup on water fixtures and left my hair feeling grippy with the residue. It tangled instantly after brushing and I have pin straight fine hair! After installing this in my shower however I've seen a noticable difference. My hair doesn't feel grippy and tangles far far less. If you're looking for a quick easy fix to hard water this is a great cheap option. My boyfriend didn't even need any tools to install it, just turned right on and after a few months of use no leaks or other issues yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Be",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Shower head with a filter",
      "text": "The Culligan WSH-C125 is mostly made of plastic. The flow selector will rotate the entire shower head unless you really tighten down the back screw ring(not the piece that threads to the wall). I removed the restrictors but noticed no difference in pressure, so I guess my apartment doesn't provide much to begin with. This being the case I find the shower spread to very narrow on all settings. It does what it is supposed to though, provide a stream of water.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrew T Fisher",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Great budget showerhead with water filter.",
      "text": "This is great for filtering out some harsh metals and chlorine. Our skin feels a bit softer and not as dry. The filters aren't that expensive either. The water pressure seems to be slightly weaker, but that could change over time.",
      "rating": 5.0,
      "verified": true,
      "author": "Sion87",
      "helpful_votes": 3,
      "publication_date": 20200107
    },
    {
      "title": "Works great, need more water preasure.",
      "text": "It works fine and I like it . However with the filter installed I just dont get the pressure I like. I have well water and sometimes with hot water I get a sulfer smell, this shower head stops that completely. If it didnt stop the smell, I wouldn't put up with the lack of pressure. I can shower just fine, i just prefer a little more pressure.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "A shower filter that actually works.",
      "text": "A shower filter that actually works. I tried another cheaper one and my hair and skin actually looked and felt worse after. This seemed to be a well known trusted brand so I went with it next. The water actually felt softer on my skin during the first use. I wouldn’t say my hair looks drastically better, but it does look nice. Overall, very happy for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia K Swope",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "It's a difference",
      "text": "I had my husband to install this shower head which was easy in less than 10 mins. I moved from a part in Mississippi where our water is so soft and drinkable out end faucet. Now we're so close to the oilfield the water is hard and less clean. Well since using this filter I have noticed a change. Our skin is less dry and itchy. I don't have drown my skin in aquaphor as much. My hair isn't shedding like crazy. It is very highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "A Michelle",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "it will blast you just fine.",
      "text": "I honestly did not notice any difference in the softness/smell of our city water compared to when using a \"regular\" shower head. I will continue to use it for the next few months simply because it's already installed. However, when the filter needs to be replaced, I think I will put my previous shower head back on, and toss this one aside. I miss the \"rain fall\" aspect of my previous shower head anyway. For those who are concerned about water pressure, don't. Assuming you take the governor out, it will blast you just fine.",
      "rating": 3.0,
      "verified": true,
      "author": "E",
      "helpful_votes": 4,
      "publication_date": 20150903
    },
    {
      "title": "Works",
      "text": "I got this to replace an old simple shower, so instead of buying only the filter, I bought this to get 2 for the price of one, the head shower and the filter. I haven't tried the different sets yet, however the water quality increased and it's visible in my hair and skin. Hair is smother and the skin is less dry after hot showers. So the main reason i got it was for the filter and it really works. the shower is ok, taking in consideration the price and that you are taking a filter and shower head for the price of one.",
      "rating": 5.0,
      "verified": true,
      "author": "Ama10",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Great showerhead, but remove the restrictor for full pressure!",
      "text": "I have two of these now in my apartment, one for each bathroom, and I can't see ever buying anything else. The different settings are great and once you remove the restrictor, they work even better. That being said, if you feel the water flow isn't powerful enough, it's because they hit a little plastic restrictor inside the nozzle that screws into the showerhead pipe. You have to pull it out with a pick or something small enough to pry it out. It takes some force to do, but you won't break it. Once you figure out how to get the little plastic restrictor out of there, it's an amazing shower head!",
      "rating": 4.0,
      "verified": true,
      "author": "That Cicero Guy",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "Pass on this, don’t buy it.  Bad purchase.",
      "text": "1 star for easy to install No water pressure 👎 My old cruddy shower head was better than this one. I had super strong water pressure to now having nothing. There are 5 options but I only have experienced 2 no matter how many times I click the dial 👎 Filter is ok, let’s see how long it last",
      "rating": 1.0,
      "verified": true,
      "author": "ToriLBC",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Well, this was disappointing.",
      "text": "We bought this based on a recommendation from a bar-shampoo company that suggested it would make our water softer. Not only was there no appreciable difference in our hair, it was almost impossible to adjust the stream from inside the shower (had to stand on edge of tub and use leverage) and the stream itself was so faint that we wasted water by needing to shower much longer to get the soap out of our hair. Sorry the return window has closed.",
      "rating": 2.0,
      "verified": true,
      "author": "Christine Eberle",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Reduced water pressure",
      "text": "This shower head is low flow, I don't even think it is 2 gpm like it states. The new code requires that the flow restrictors are not removable and that's the case with this shower head. But I had another connector ball without a restrictor from an old shower head that I used to fix the issue, otherwise I would have returned it. I'm giving it 3 stars because it is a good shower head with my fix.",
      "rating": 3.0,
      "verified": true,
      "author": "girlshopsalot",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Moved to Mississippi; Gulfcoast.... Horrible ORANGE water",
      "text": "I recently moved to Mississippi where the residue from the shower made my skin breakout in a rash, my scalp has scales, 15 minutes of shower I feel like my skin is crawling with itchy gross. So I hooked this very easy to install shower head up with no problem! I just couldn't believe it. My skin felt clean, no film and residue. The next day--- I showered again. Because truly this is a fluke- NOPE. IM so clean. My skin and scalp do not itch. This is fabulous! Will replace all my shower heads in my house with this product. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Maineiac",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "No noticeable difference",
      "text": "My skin is still dry right after a shower even with the temp dialed back. I haven’t noticed anything, no softer skin or softer hair. Useless! Glad Amazon will take it back.",
      "rating": 1.0,
      "verified": true,
      "author": "crazydoglady",
      "helpful_votes": 2,
      "publication_date": 20190105
    },
    {
      "title": "Filters well. Good selections. Disappointing pressure",
      "text": "My shower had very good water pressure, but after installing this, the pressure is much diminished. Of course, this is a trade off for filtered water and so I make the sacrifice. The filter works great.",
      "rating": 3.0,
      "verified": true,
      "author": "\"Loopydloop\"",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "No water pressure, spray settings don't work",
      "text": "The first problem with this shower head is that there is no water pressure. I tried fiddling with the flow restrictor as some comments suggested, but it seems they changed things in this model and it's no longer removable. Pretty much makes the product useless as the stream is very limp. Another problem is that the spray settings don't work. Twisting the gray bit spins and \"clicks\", but nothing changes.",
      "rating": 1.0,
      "verified": true,
      "author": "Ali Rajhi",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Spray won’t adjust",
      "text": "This filter was an easy install and seems to filter out chlorine etc. Only complaint is that the spray will not change when I try to change it. It turns but same three thinner sprays come out. It’s suppose to have five settings. Wonder if anyone else has had that problem or did I get a lemon?",
      "rating": 3.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Game changer for hair and skin",
      "text": "If you have hard water BUY THIS. It's amazing. I knew it wouldn't work but I had to give it a shot, and it actually changed my life. I wish I could put one of these on every faucet in my house. For my hair and skin it was a game changer. My hair is highlighted and started breaking off due to Indiana hard water. My skin was breaking out. I've had this filter for a week and I no longer dread what my hair will end up looking like when I get out of the shower. My skin is dramatically clearer too",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonmom",
      "helpful_votes": 2,
      "publication_date": 20161019
    },
    {
      "title": "Seems to help contaminant and water hardness...",
      "text": "Fantastic. I wanted something that would alleviate contaminant and hard water issues, and this thing really made my skin and hair so much happier. The replacement cartridges are really cheap too- around $14 here or at my local Bed, Bath, and Beyond. I believe the cartridge lasts 6 months under \"normal\" use conditions, but we have extremely hard water and too many people in our house all the time, so ours starts to deteriorate in performance a lot more quickly. Still, I'd much rather buy these than deal with crappy skin/hair. Maybe I'll update my review with some water hardness tests over time.",
      "rating": 5.0,
      "verified": true,
      "author": "Cat",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "It Filters the water, but sprays like a hose.",
      "text": "It performs as described and in that regard I cant fault it. The area I live in has very hard water and it has been driving my wife and I insane. The filter has eliminated a vast amount of the issue we've run into with the water. However, the shower heads stream is really where I find fault in its design. The water only comes out in a direct stream and the pressure can be adjusted, but its still only in a very confined stream. Personally I don't care for the water to be so confined and that's why I've rated as i have.",
      "rating": 3.0,
      "verified": true,
      "author": "Lyall",
      "helpful_votes": 0,
      "publication_date": 20170415
    },
    {
      "title": "Meh water pressure.",
      "text": "I was super excited to get this. I've been looking for a water filter for my shower for quite some time. The shower was easy to open up and put the filter in and then seal it back up. The shower head was also very easy to install and remove on my spout. However there was hardly any water pressure. The water felt so soft coming through but because of the lack of water pressure it took much longer to get wet soap up and then rinse off all the bubbles.",
      "rating": 3.0,
      "verified": true,
      "author": "Sam Bissell",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Didn't do a thing for me",
      "text": "This did absolutely nothing! I don't understand all the great reviews. I wonder if mine was just defective but I will not buy again. I also have the aquabliss shower filter and that worked great but only lasted me one month. I will continue using that one and change my filters monthly until I can find a filter that works great and lasts 6 months like it says it should.",
      "rating": 1.0,
      "verified": true,
      "author": "Soulva",
      "helpful_votes": 3,
      "publication_date": 20161207
    },
    {
      "title": "Really Works",
      "text": "I bought this because we have really hard water, even with water softener system my hair and skin were dry. This shower head was easy to install and the first time i used it i could see and feel a difference. This works so well i'm going to order more for our other showers in the house. So glad i purchased this.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Gets the job done",
      "text": "This has worked well to remove the sulphur smell from our water system. It also reduced some of the chlorine smell. The quality is just OK. Make sure you use a rag between your pliers and the shower head screw when installing. The finish comes off easy. The only negative so far is it reduces the water pressure by a small amount. Also, it’s a bit hard to change the spray features. We just leave it on one setting. I would probably buy this again. Can’t say whether the cheaper no-name brands are any better or any worse but this gets the job done at a reasonable cost.",
      "rating": 4.0,
      "verified": true,
      "author": "Doug",
      "helpful_votes": 0,
      "publication_date": 20180205
    },
    {
      "title": "Had reaction to chemicals in filter.",
      "text": "After first shower, I had slight burning sensation in my eyes. Thought maybe the filter needed flushing. Took a shower the next day, and again eyes were burning and this time were red. Removed this shower head and reinstalled my old one. This one is going into trash.",
      "rating": 1.0,
      "verified": true,
      "author": "ROBERT O.",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Better showers",
      "text": "What a difference this makes! Was concerned how big it would be, and how much less room my tall husband would have to take a shower. It's not any longer than our old shower head, so not a problem. We have very hard, heavily chlorinated water. Consequently, it took longer to rinse, the old shower head regularly scaled over and showering smelled like a public swimming pool. The water feels noticeably softer, the shower head isn't scaly, and it doesn't stink like chlorine anymore. Only wish that it also removed fluoride. And that it had a shut-off to conserve water while soaping up.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "WORKS VERY WELL!",
      "text": "This has been great for me and my husband! The quality of the shower water has improved...we don't get the slimey sludge on the shower head that we used to get (we have well water). The only draw back that I can see is that the water pressure is not so great but it's a fair trade off for me!",
      "rating": 5.0,
      "verified": true,
      "author": "a little Grandma",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "I swear shampoo and soap lather much better now (indicating softened water)",
      "text": "This shower head changed my life. Before, our very hard water smelled noticeably of chlorine. Now, absolutely no smell, and even though this isn't supposed to really do much for hard water, I swear shampoo and soap lather much better now (indicating softened water). I have very sensitive dry skin, and this has made a big difference. Just make sure to remove the flow restrictor if you aren't happy with a lower flow rate. It's an easy thing (just pop out a little ring), and it's a night and day difference in water pressure.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura M",
      "helpful_votes": 2,
      "publication_date": 20160105
    },
    {
      "title": "Wow!  Great product....my hair is softer and skin feels cleaner....read on...",
      "text": "Amazing.....is what I thought after my first shower....yea, it's that good. After reading the reviews I thought it might be decent, but not this good. My skin feels softer...yea not lying and I have long hair (I'm a long hair hippy :) and it's definitely made my hair softer. Who'd of thought..... buy it and thank me later",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Baily",
      "helpful_votes": 2,
      "publication_date": 20170719
    },
    {
      "title": "Nice shower head, love the filter.",
      "text": "This is the second one we have purchased. Previous one lasted about 8+ years before the plastic was too deteriorated. Only downfall is you have to remember to change the filter. I signed up for a 6 mo subscription w/ Amazon to solve this problem. Before that we would easily go a year without remembering to change the filter. It has good water pressure & settings.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Dmngz",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "A Waste of Money",
      "text": "Really disappointed with this filter. The water flow was terrible to begin with so, i called the helpline. I spoke with a really nice and super helpful representative and was told that i could remove the flow restrictor. After removing the restrictor the water pressure remained the same. I continued to use it using the strongest setting and it's still not working. Water quality is still poor.",
      "rating": 1.0,
      "verified": true,
      "author": "Sfer",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Definitely feel a difference!",
      "text": "Have had this installed in my home bathroom and gone for periods with the filter and other periods without. With this filter, the water smells better, feels softer, and smells cleaner from less chemicals. Is going to make a difference in the long run with my health, and in the short run it helps with my hair big time!",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Highly recommend - no more straw hair!",
      "text": "BEST PURCHASE! Our town has Extremely hard water and for years my hair felt like straw even with the use of the priciest hard water shampoos/ hair products. This Culligan filtered shower head changed that with the very first use! After the very first shower with this filtered shower head I had clean silky hair again (not to mention my skin feels so clean now too!) I have had the Culligan shower head for months now and the new and improved water quality in every shower is as great as the last. I will be a repeat customer of this product and I am so greatful it exists! Thank you Culligan!",
      "rating": 5.0,
      "verified": true,
      "author": "Ekp",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "This was dissapointing",
      "text": "I ordered this to replace a cheaper shower head with filter. I thought this was a no-brainer because I trusted the Culligan brand. I was really dissapointed that it lost pressure right away and was pretty useless. I have since ordered a different brand and that one is working fine.",
      "rating": 1.0,
      "verified": true,
      "author": "Iverson",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Broken and big size but has tiny small filter",
      "text": "I received a 100% damaged product in a new box, this thing is big in size but has a tiny small filter inside, and I don't believe this is capable of filtering out chlorine.",
      "rating": 1.0,
      "verified": true,
      "author": "Alexander",
      "helpful_votes": 4,
      "publication_date": 20170906
    },
    {
      "title": "Great Filter ..... Fair Water Pressure",
      "text": "I wanted to love this shower head. I have well water and I bought this shower head to keep my color treated hair from turning brassy. The filter of this shower head is top notch and will save me a lot of money at the hairdresser, but the water pressure is lacking. Easy to mount and no leaks as others have stated as long as you follow the directions.",
      "rating": 3.0,
      "verified": true,
      "author": "Cheryl207",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Wonderful Product",
      "text": "I live in Los Angeles, and one day I showered at a friend's house who had one of these filter heads. The rest of the entire day, I couldn't stop touching my hair, because it felt so incredible! Went home and immediately purchased one for myself, and have never looked back. My hair is exponentially softer, lighter and overall healthier. Who knew! Can't believe I spent so long showering with regular water! I promise this product will make a difference to your hair, especially if you have fine, dry, unpredictable hair like mine. Really great product. Thanks, Culligan!",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke Applegate",
      "helpful_votes": 4,
      "publication_date": 20150702
    },
    {
      "title": "Nice filtering shower head",
      "text": "Nice filtering shower head! Filters are easy to replace. I got this because my hair always felt dry and tangled. A friend mentioned my water might be hard. Sure enough, a water test showed my water was slightly hard. Hair feels nice and soft now! The only criticism I have is it doesn't allow you to angle it down as far as my old / standard shower head.",
      "rating": 4.0,
      "verified": true,
      "author": "RavensFan",
      "helpful_votes": 2,
      "publication_date": 20170312
    },
    {
      "title": "Has changeable filter & different spray modes.",
      "text": "It’s Very difficult for me to turn it to change to the different sprays but otherwise, I like it. It has a changeable filter which filters out more things than I could find on any other shower head. The massage spray is nice for sore backs! Its metal... not all plastic like most others I looked at too. Just feels and looks better made to me.",
      "rating": 4.0,
      "verified": true,
      "author": "Sjeanine",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Broke after 3 months... Good while it lasted.",
      "text": "This is the 2nd of these filtered Culligan shower heads I've purchased now. The first one was the handle/wand that hung up and was too heavy for the ball-joint/was useless hung up. Now after 3 months of normal use with this one the ball joint must have cracked (it's all plastic) and is spraying/leaking water pretty heavily and drastically cut down the pressure coming through the head. We were enjoying this shower head while it lasted, after I broke off the flow restrictor which was not as easy on this head. Return window was 1 month. I'll probably re-buy but if I have any other problems with it, this review will turn into 1-Star.",
      "rating": 3.0,
      "verified": true,
      "author": "Tyler E",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Must-have product from great seller",
      "text": "Product meets expectations in quality and design and offers great value for the money! I have noticed improvement in my hair and skin since I began filtering my shower water using the Culligan filter. Definitely recommend this inexpensive fix for heavy chemicals and/or mineral deposits in the shower. We noticed the difference in our skin on the first use!",
      "rating": 5.0,
      "verified": true,
      "author": "Rusty Shackleford",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Shower head did not work for me...",
      "text": "I was not able to get this shower head to fit onto my shower connection. While trying to connect my original order, I ended up stripping the Culligan threading - this could be due to the shower head being made of plastic. I emailed support with my issues, and they generously shipped me another unit right away. The second unit, I have been having the same problem! I am out of ideas, and have went back to using my old shower head, but I am giving 2 stars for excellent customer service. Please see video to view my issue.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160203
    },
    {
      "title": "My wife's hair was reacting very poorly to our water, this helped significantly",
      "text": "I rent an apartment that does not get water from a hard water source, but my wife's hair was still reacting as if it was. This filtered head significantly improved her hair once installed, it no longer got tangled as easy and could be brushed out in a reasonable amount of time. The only thing I don't like is that I don't find the different stream options on the head very useful.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan Schofer",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "A Wonderful Improvement for Las Vegas Water",
      "text": "I am surprised at the difference this show head is making. I moved to Las Vegas, and I haven't seen water as hard as it is here, and my skin and hair were really drying out. I saw this and figured any small improvement is still improvement, and I can't get a water softener system because I have an apartment. Well, I am pleasantly shocked. My shampoo lathers again (not as much as in Seattle but still!) and my Bronner's soap does too. I'm happy with my purchase. I didn't see anything saying how often to change the filter, but I can look that up easy enough. Installation was very simple.",
      "rating": 5.0,
      "verified": true,
      "author": "The Lizzie Bennett",
      "helpful_votes": 0,
      "publication_date": 20160528
    },
    {
      "title": "Looks and performs as advertised! Filter makes a huge difference! Easy to install! A+++++",
      "text": "This is a really nice showerhead. It looks, works and performs as advertised! I was a little hesitant to try a showerhead with a filter but now have no regrets. The coverage area is much wider than I thought it would be. It has enough movement to go up, down, left and right to satisfy my needs and I love my showers. My water feels so much better with a filter which makes this showerhead worth the price by itself. It takes both hands to change the settings easily but I imagine with larger hands it would doable with one hand. Either way, this looks and works as advertised and was easy to install! A+++++",
      "rating": 5.0,
      "verified": true,
      "author": "J.R. (Not from Dallas)",
      "helpful_votes": 2,
      "publication_date": 20150126
    },
    {
      "title": "Works well",
      "text": "Seems to work well. With it being just my husband and I and the occasional guest, we can go much longer in between changing filters. Needed a filtered shower head as we don’t have a water softener or filter and the shampoo bars we use don’t work well with unfiltered hard water. They seem to do really well with this though.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "This Thing Is The Bomb",
      "text": "Years of dry skin and dry hair were eliminated after I switched to this showerhead. I have spent most of my life and money buying expensive serums, lotions, creams, oils, masks, peels, etc to have clear, soft skin and beautiful, luxurious hair. Nothing really ever worked. I thought I didn't eat enough seafood or that I had inherited bad genes. Nope. Bad water. Old, crappy pipes. City in Southern California life. This showerhead changed everything. I cannot recommend it to you more. If you're tired of dry skin and dry, chlorinated hair (but you don't really swim?) then try this. For what it does and the changes you see, it is worth 4 times as much.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Quinn",
      "helpful_votes": 2,
      "publication_date": 20140404
    },
    {
      "title": "So hopeful...",
      "text": "I was so hopeful by the other reviews that my hair would take on a whole different texture. Not so. It seems dryer, coarser, fuzzier, less manageable... And not soft at all. I'm not giving up, maybe it needs time and hair products that will work with a softening shower head. Pressure, however, is awesome.",
      "rating": 3.0,
      "verified": true,
      "author": "wifetess",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Nice Water Pressure!",
      "text": "This works really well as far as the water pressure goes. Supposedly it also filters out the chlorine in your water. I have not seen any noticeable difference in skin or hair, but I only this this shower maybe once a week (prefer baths). We mainly got it because our other shower head just plain sucked with the non-existent water pressure. This one has several different settings depending on your preference/function. I use one of the harder ones to rinse my hair out for example. It works really well as far as that goes. We will probably buy another of these for the other bathroom.",
      "rating": 5.0,
      "verified": true,
      "author": "msbathsheba1",
      "helpful_votes": 0,
      "publication_date": 20161025
    },
    {
      "title": "We love it !!",
      "text": "We're very happy with this showerhead. We have hard water and because we rent didn't want to go as far as investing in a water softener system. This seemed like a solution worth trying. Our hair and skin feel so much softer ! It's definitely worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Kiki",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Not the best to eliminate chlorine in my water",
      "text": "After a month of use I still smell chlorine and still have dry skin, although it's not as bad as it was without a filter. I will be replacing it with another brand. My community has too much chlorine in the water and this filter just couldn't eliminate enough of it.",
      "rating": 2.0,
      "verified": true,
      "author": "watssup1",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Dissapointmet",
      "text": "It took out the chlorine smell in my water, but when I tested the water with a digital reader I own that I received from Zero Water (amazing drinking filter!!) It didn't drop at all. 182 before I changed it and 182 after. I also took the temperature of the water before I switched the shower head and after to make sure it was 100% the same test.",
      "rating": 3.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Excellent shower head for hard water",
      "text": "This is a great affordable shower head. I noticed only a slight change in water pressure, but certainly not enough to prevent the water flow from being effective. We noticed an immediate difference in our skin and hair which was becoming dry and itchy from our unfiltered hard water. The installation process was very quick and easy, and the look of our shower head from the generic one provided by our apartment management is much better as well. This was one of the best purchases we've made for our household, and it made a much bigger difference than we anticipated. I never realized that our water could be so irritating, but this shower head made all the difference!",
      "rating": 5.0,
      "verified": true,
      "author": "Llewyn Davis",
      "helpful_votes": 0,
      "publication_date": 20160913
    },
    {
      "title": "Totally worth it!",
      "text": "It makes a very noticeable difference in the softness, smell, and effectiveness of the shower water. I never want to go back to a non-filtered shower head ever again! I'm sensitive to chlorine, and so showers used to give me some mild breathing difficulties. I can fully enjoy my showers without worrying about the pain the chlorine will cause now. It was very easy to install. The filter is very easy to replace. The filters are inexpensive. The only thing I wish it did was adjust to a setting the shot water at a wider angle. The water shoots pretty straight, leaving my arms cold.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah L.",
      "helpful_votes": 0,
      "publication_date": 20150208
    },
    {
      "title": "Softer water!!",
      "text": "I love this showerhead!! It filters the water so it's softer and better for scalp and skin. Only thing that's an issue is the difficulty changing out the filter. Very hard to pull old filter out.",
      "rating": 5.0,
      "verified": true,
      "author": "Betty Boop",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Very nice and useful replacement to what I had!",
      "text": "Ok this shower head is amazing. My house has hard water and I am using this for cleaner showers. It looks perfect and the water flow is great. Twist the face of it to get 5 different streams. Replacement cartridges are $12 and it says to replace them when the flow slows. I would think that would be based on how \"hard\" your water is and how often it is used. The water flows better than my previous shower too. No delay since it has to pass through the filter. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Brendan J. W.",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "I really liked the ultraconservative flow in the Sprite filter",
      "text": "Compared to the sprite filter the quality of the water seems to be similar - smell, taste. However this device outputs a lot more water than the Sprite. I really liked the ultraconservative flow in the Sprite filter, but this makes for a nicer lush shower with the wider head. The massaging sprays actually feel good on this filter. I like the higher profile of the head compared to the sprite too. Our Sprite Filter fell to bits after 4 years - developed leaks in the casing.",
      "rating": 4.0,
      "verified": true,
      "author": "THE Yorgi",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "So Fresh and Clean",
      "text": "This is a good shower head at a very reasonable price. I don't think you could find a better deal at a brick and mortar store. Pros: Quality name brand Reasonable Price Chlorine Filter Good product warranty Super easy to install (I'm a girly girl and I installed it in less than 5 minutes) Cons: It does droop down from weight of filter as other reviewers have noted. (I haven't found this terribly important as my shower line is placed pretty high.) I'm pleased with my purchase, find it to be a perfectly functional entry level shower head. I haven't noticed any amazing skin differences other reviewers noted, but my hair is notably softer from Chlorine filter. Highly recommended!",
      "rating": 4.0,
      "verified": true,
      "author": "Megasaurus",
      "helpful_votes": 0,
      "publication_date": 20120121
    },
    {
      "title": "Perfect for my hard water situation with my hair!",
      "text": "Exactly what I was looking for. My home has horribly hard water... to the point it seemed to prevent my hair from absorbing conditioning at all. In a short time my hair was getting destroyed and having to put a lot of leave in conditioners just to get a brush or comb through it. So after some research I decided to try this. It is exactly what I had hoped for, my hair is in terrific condition now and my skin feels much better also!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Hadley",
      "helpful_votes": 0,
      "publication_date": 20161011
    },
    {
      "title": "Im happy they included the tape",
      "text": "Just got it today, installed quickly and painlessly. Im happy they included the tape, to improve the quality of the installation. Dont know how much this will affect my H20 quality, i live in San Francisco. The 1 less star is because, the variations in the \"water jets\" are a moot point. Ive tested each one and basically i end up using the default. The only setting, in my opinion, that is different would be the stronger center jets. Not sure if the filter is effecting the selections. Anyhow.. ill update the review after a months use to see if i use less lotion or have better quality skin/hair!",
      "rating": 4.0,
      "verified": true,
      "author": "dennisshopping",
      "helpful_votes": 0,
      "publication_date": 20151015
    },
    {
      "title": "Hey Culligan Man!",
      "text": "Very nice unit and a step up from the GE filter we were using before. It is mostly plastic but it looks good with its chrome finish in the shower and the water has no chlorine smell. We have a lot of chlorine in the water! Further, the stream is quite good even with the flow restrictor in place. I did take it out and my wife and I both thought the pressure was too intense. It was easy to replace the restrictor. It has multiple settings for different types of patterns but we like the typical full shower setting the best. This is a very good value because you get a functional filter that looks great and is adjustable.",
      "rating": 5.0,
      "verified": true,
      "author": "John Caramagna",
      "helpful_votes": 0,
      "publication_date": 20140820
    },
    {
      "title": "You never would know you need this until you try it!",
      "text": "I wish I had known about this product earlier. We have very hard water that sometimes has a smell from the sulfur. When my shower head broke and it was time for a replacement, I learned about this Culligan shower head that uses replaceable filters to remove contaminants in the water. Honestly, my skin and hair have both benefited from this product. I'm not sure how long the filters will realistically last, they say 6 months/10,000 gallons but it is worth it in my opinion since we are unable to install a water softener/purifier at this location.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason K.",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "Filter is amazing",
      "text": "Shower head is pretty good. I like the different settings. I only wish it was bigger and not sure if this if the shower head or my water but the pressure is very light. I wish it was stronger. The filter is fantastic. My skin is a lot smoother and softer. Less dry. Hair is a lot happier. Glossy and shiny.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake Beard",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Its own weight broke it",
      "text": "Purchased 09.18 and broke 03.19. It broke because of its own weight and now it just faces down. This isn't a cheap in regard to cost product. Disappointed don't recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeanette",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Terrible!",
      "text": "Water pressure is so low that I find it unusable.You can't even feel the water and on some settings it's so low that the water arcs where it can't even shoot straight out. BTW my water pressure is great and other heads you can blast your skin clean and get deep massage. Yes I took the stickers off filter and no there isn't a plastic flow restriction thing to pop out like on others. Terribly disappointing. Got out of shower and immediately unscrewed it and shipping back.",
      "rating": 1.0,
      "verified": true,
      "author": "JK",
      "helpful_votes": 0,
      "publication_date": 20160319
    },
    {
      "title": "Does it do anything?",
      "text": "I don't know what other reviewers are talking about personally. It could be that our water is particularly hard, about 160 tds or so. That being said, I tested the water after it exited the filter and the TDS was the same. I also checked the Gh and Kh using my water testing kit from my fish tank and neither changed at all. The water modes are fun at fist but you eventually just stick with the most basic one.",
      "rating": 2.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 2,
      "publication_date": 20160825
    },
    {
      "title": "Helped itchy, flakey scalp",
      "text": "This is a nice shower head. I've always had to use dandruff shampoo, at least once a week, for as long as I can remember and I realized that I hadn't used it in a few weeks and I don't have the itchy, flakiness that I normally have, it definitely helped my scalp. Now I only have to use the dandruff shampoo every few weeks, instead of weekly.",
      "rating": 4.0,
      "verified": true,
      "author": "Charity",
      "helpful_votes": 2,
      "publication_date": 20170201
    },
    {
      "title": "Only One Spray Setting",
      "text": "Nozzle rotates, but spray remains the same. The outer rim works, but that's it. We continue to order filters because it is noticeable when it is time to replace it. However, it is disappointing that the nozzle doesn't work.",
      "rating": 5.0,
      "verified": true,
      "author": "BarbaraAnn",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Helps with hard water",
      "text": "The shower head helps to make the water softer, but isn't anywhere near as effective as a whole house softener. Guess that's what I prefer, but it helps some and is a heck of a lot cheaper.",
      "rating": 4.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Fantastic! Highly recommend",
      "text": "Fantastic product. I have had this for about 3 weeks and it has been terrific. Since day one, the difference in the quality of the water has been tremendous. My girlfriend is allergic to chlorine so it was imperative to find a filter that removed chlorine from the water and it has been wonderful. The water pressure is actually better through this shower head than the old shower head that I had and it has a nice medium size spread of water that is great. It installed very easily with no tools and I have absolutely no plumbing experience. I would recommend this to anyone looking for a filtered shower head.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20140928
    },
    {
      "title": "never worked properly",
      "text": "I installed this pretty easily, but it never worked properly. It only had one stream - not the 5 advertised. I tried reinstalling it, but it didn't make any difference. Moreover, much of the water seemed to be simply collecting in the center and dribbling down the bottom , rather than actually coming out the showerhead. I thought there was a leak, but the register was off. Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Ally C.",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Helpful",
      "text": "This has helped so much with my hair and skin. I have mineral-rich water where I live, and this helps my hair look cleaner for longer (and I have noticed that I break out far less). Easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Does not soften water at all!",
      "text": "This filter does not soften water - not even one little bit. Hardness tests (withfor water coming from this shower filter and coming from unfiltered shower show exactly the same hardness. Don't waste your money on this.",
      "rating": 1.0,
      "verified": true,
      "author": "Ingrid King",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Changed My Hair For the Better!",
      "text": "This unit is great for the price. I bought it mainly for my face because I suffer from a “reddish face” and I thought it might be hot showers with hard minerals. Unfortunately, this unit didn’t help my facial irritation, but what it did was help my hair. I live in Massachusetts and the water is hard and is chemically treated. After showering my hair is usually flat and dead looking, just something I used to live with. NO MORE! This filtered showerhead has changed my hair for the better and now it looks fluffy and lovely. I highly recommend it if you care about your hair.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler Aronne",
      "helpful_votes": 0,
      "publication_date": 20141029
    }
  ],
  "product_meta": {
    "title": "Culligan WSH-C125 Wall-Mounted Filtered Showerhead with Massage, 10,000 Gallon, Chrome",
    "description": "WSH-C125 Features: -Shower head. -Level 2 extra filtration. -Reduces chlorine, sulfur odor and scale. -Offers 5 spray settings for added comfort. -Anti-clog rubber spray nozzle. -Filter life: 10, 000-gallon or 6-month (maximum flow rate of 2. 5 gpm as required by same standards). -Bacteriostatic indicates that system limits passage or growth of bacteria that may already exist in incoming water. -NSF certified. -Uses WHR-140 cartridge. -Operating temperature range: 40 -120 degrees F (4-49 degrees C). -Includes replacement cartridge, plumbing tape, installation and filter change instructions and cartridge change reminder sticker. Dimensions: -12. 25'' H x 8. 5'' W x 4. 75'' D, 1. 6 lbs. Warranty: -Five year warranty.\n\nAMAZON.COM\nWith the powerful filtration system of the Culligan Level 2 Wall-Mount Showerhead, you can reduce the chemicals in your water for a cleaner shower and softer skin. Featuring an anti-clog rubber spray nozzle and sleek chrome finish, this showerhead offers the choice of five spray settings. The Culligan Wall-Mount Showerhead provides filtration against sulfur, chlorine, and scale for up to 10,000 gallons of water, and it meets NSF standards for water safety.\n\n\n\nReduces Chlorine and Scale Buildup for a Softer Shower\nThe Culligan Level 2 Wall-Mount Showerhead offers a refreshing shower experience by reducing harsh chlorine levels and damaging scale buildup. The filtration system removes up to 99 percent of chlorine, as well as the impurities within water that can damage hair follicles and result in dry, itchy scalp. Additionally, by reducing the amount of scale (a hard, filmy residue created by minerals in water), the showerhead is able to give you more of the hydrating nourishment your skin and scalp need.Five Spray Settings to Suit Your Mood\nIn addition to offering a cleaner, more nourishing shower, this showerhead offers five spray settings to suit your mood. Choose from a full-body spray for maximum water coverage, to an invigorating pulse for a relaxing muscle massage.\n\nShowerhead Installs in Moments\nThis lightweight Showerhead can be installed within minutes using the included Teflon tape. Just wrap the tape around an existing shower arm, and attach the head--no tools are needed. You'll immediately benefit from pure, clean water.\n\nSafe and Long Lasting\nCertified by the NFC, the Wall-Mount Showerhead provides your family with chemical-free showers. In addition, this showerhead effectively filters water for six months--or 10,000 gallons--before it needs changing.\n\nThe Culligan Level 2 Wall-Mount Showerhead is backed by a manufacturer's limited five-year warranty.\n\nCulligan Filtration: Providing Families with Clean, Healthy Water\nA recognized leader in water filtration and softening products and solutions, Culligan offers filtration and treatment solutions available for all parts of the household. Culligan's drinking-water and working-water filtration systems help solve tough water problems to give you clean, clear water for your entire home.\n\nWhat's in the Box\nOne WSH-C125 wall-mount filtered showerhead; filter change reminder sticker, and Teflon tape.\n\n\n\n\n\n\nFROM THE MANUFACTURER\nThe Culligan WSH-C125 showerhead reduces sulfur odor, chlorine & scale for softer, cleaner skin and hair. The anti-clog rubber spray nozzle has five spray setting for comfort. The easy to install shower head requires no tools for easy installation, 10,000 gallon/ 6 month filter capacity (maximum flow rate of 2.5 gpm as required by ASME standards). Certified to meet NSF standard 177 for filtered showerhead systems and a 5 year limited warranty. Filter change reminder sticker included\n\nSee more",
    "rating": 4.3,
    "feature_bullets": [
      "FEATURES: Included WHR-140 filter cartridge reduces sulfur odor, chlorine, and scale; Patented filter media bacteriostatic that limits passage and growth of bacteria; Includes Teflon tape, cartridge reminder sticker, and installation instructions",
      "COMPATIBILITY: Installs on any standard 1/2-inch threaded shower arm; Culligan WHR-140 filter cartridge; 40°F-120°F temperature range",
      "CERTIFICATION: Tested and certified by IAPMO to ANSI standard 177; meets EPA WaterSense certification standard of maximum 1.8 gallons per minute or less; 1-year warranty",
      "ALERT: This product is TEMPORARILY unable to ship into the state of Califorina",
      "Provide your shower with ideal water for softer and cleaner skin and hair. FILTER LIFE: Up to 6 months or 10,000 gallons, depending on usage and filtration load"
    ],
    "specifications": {
      "Manufacturer": "Culligan",
      "Part Number": "WSH-C125",
      "Item Weight": "1.15 pounds",
      "Product Dimensions": "4.75 x 8.5 x 12.25 inches",
      "Item model number": "WSH-C125",
      "Is Discontinued By Manufacturer": "No",
      "Size": "10,000 Gallon",
      "Color": "Chrome",
      "Finish": "Chrome",
      "Material": "Multi",
      "Installation Method": "Wall Mounted",
      "Item Package Quantity": "1",
      "Number Of Pieces": "1",
      "Flow Rate": "2 Gallons per Minute",
      "Handle/Lever Placement": "Wall-mount",
      "Certification": "ASME",
      "Included Components": "One Wsh-C125 Wall-Mount Filtered Showerhead, Filter-Change Reminder Sticker",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B0006VVN1S",
      "Customer Reviews": "4.3 out of 5 stars4,132 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#10,596 in Tools & Home Improvement",
      "Domestic Shipping": "This item ships only within the U.S. excluding certain locales such as CA.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "September 14, 2004"
    },
    "categories": [
      "Bathroom Fixtures",
      "Kitchen & Bath Fixtures",
      "Showerheads",
      "Fixed Showerheads",
      "Tools & Home Improvement",
      "Bathtub Faucets & Showerheads"
    ],
    "price": 35.75
  }
}