{
  "website_summaries": [
    {
      "verdict": "No space for a countertop sterilizer? No problem. This spacious steam sterilizer sanitizes your baby items in 2 minutes and fits in most standard microwaves.",
      "pros": [
        "Destroys up to 99.9% of common bacteria in 2 minutes",
        "Open-away latch helps to prevent injuries from steam",
        "Lightweight and compact",
        "Handles resist heat",
        "Fits up to 4 bottles and 2 breast pump shields at a single time"
      ],
      "cons": [
        "Sometimes leaks water outside of the container"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Ugh, I HATE this thing! Its trash!",
      "text": "So frustrating to use! Who designed this and did they do no quality assurance tests? What is the hinge part for?! It doesnt actually hinge anything or roll, its just a nuisance! The handle part at the top isnt big enough to securely pick up the lid, why wouldnt they allow the handle to pop up so you can grab it!? You have to put your hand on the top so the steam burns you. Also the hot water easily spills out and will burn you. I HATE this thing so much! What idiot designed something that required you endlessly fidget with it when it involves hot steaming water!",
      "rating": 1.0,
      "verified": true,
      "author": "Somethingcreative",
      "helpful_votes": 26,
      "publication_date": 20180925
    },
    {
      "title": "So much easier than a pot of water",
      "text": "This is so much easier to use than boiling a whole pot of water. It holds a fair amount of items. I can fit two sets of pumping materials in at once. I use it mainly for that. You do have to measure out seven ounces of water pretty exactly to guarantee that the system works to sterilize the items. This isn't a big deal. Also​, a whole cycle only takes 14 minutes! Four minutes in the microwave and ten to sit. It would take me this long just to get a pot of water to boil on the stove to boil my items.",
      "rating": 5.0,
      "verified": true,
      "author": "MER1988",
      "helpful_votes": 22,
      "publication_date": 20170421
    },
    {
      "title": "Lots of room, but poor design",
      "text": "Would be perfect, but the hinge on the back makes it slightly difficult to get the lid on and off. Update: took another star off since I'm finding more problems. The handle on top is poorly designed so that the whole thing tips when I try to take it out of the microwave. I have to hold the bottom with a towel to balance it. The condensation leaks out the sides too.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 18,
      "publication_date": 20180223
    },
    {
      "title": "nice way to sterilize",
      "text": "My daughter is bringing baby grandson to stay and she supplements his breast milk with bottles. I decided that rather than get a big stand upon which to dry the bottles that I would get this because it is not huge and it can fit into a microwave very easily. (not a small one though). I did not want him to be around new germs so sterilizing seems like a good way to do this. It is well made and instructions for use very easy. Bottles I ordered fit well",
      "rating": 5.0,
      "verified": true,
      "author": "Jean A Marwick",
      "helpful_votes": 11,
      "publication_date": 20160312
    },
    {
      "title": "Simple design, and for the right price",
      "text": "No need to get a fancy sterilizer. We used the Medela microwave bags before, but found them not to hold very much and drying them out wasn't that good. The Munchkin Steam Guard was way better. It has a nice large capacity and puts together well. Glad we bought it cause its worth the convenience for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "tm81663",
      "helpful_votes": 9,
      "publication_date": 20170304
    },
    {
      "title": "Serves its purpose, good price.",
      "text": "I use this for light sterilizing/sanitizing of pump parts and bottles. Works great and serves its purpose. Fyi if you don't take it out after the 10 minute cooling off period it will leave water in your microwave (easy to clean though). It's about the size of a microwave plate cover with a bottom of course, so you do need to have a little space to store it. Overall, great price compared to the fancier ones if you just need to sterilized every now and then!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachael Hoffman",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Best for Breast pump parts",
      "text": "I use it for sanitizing my breast pump parts and find it very handy and useful. I have been using this for 3months now and have had no issues. It is super easy to clean as you have only 3 parts which are wide. I use it for small Boon bottles (4Oz) too as they fit in it fine. Medala and Boon 8Oz bottles doesn't fit well in this but its okay as I have a big sterilizer for them. I am sure almost all 4Oz bottles will fit in this if you want a quick sterilization.",
      "rating": 5.0,
      "verified": true,
      "author": "Sindhu",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "It's so easy to use.",
      "text": "I used to use a pot to boil my pump parts and bottles. This actually made it way easier into getting everything sterlize. I would notice that when i used the pot some parts will be ashy and feel weird and with product they just look clean. This has made my life a little easier. I also double use this product as a drying place and a storage place for my accesories. Highly recomend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Margarita Munoz",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "convenient and cost effective",
      "text": "Yes, it's a glorified lidded plastic plate thing. Yes, it's bulky and awkward to store. But it holds twice as much as the bags I was previously using, and let's face it - there's no point in storing this because you're using it constantly! I do 3 \"loads\" per day and the tray accommodates all the various bottles* and pump parts; so far it's holding up well and I have no complaints. *We use <5 oz bottles and they're pretty short; taller bottles may? have trouble clearing the lid.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Great for moms of multiple children!",
      "text": "I love the microwave sanitation. It’s perfect for moms who have toddlers and don’t feel comfortable leaving big pots of boiling water on the stove! I put some breast pump parts into it and placed my hand next to it for size reference in my review pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "Tierza",
      "helpful_votes": 2,
      "publication_date": 20200531
    },
    {
      "title": "you need this if you plan to pump or bottle feed",
      "text": "So happy i bought this! I had thought, 'why would indeed to clean bottles, I have a dishwasher.' The thing is, we are using bottles every 2-3 hours and all of the breast pumping machine parts just as frequently. We would have to run the dishwasher day and night I keep up. With this, I clean the stuff with bottle soap. Rinse and sanitize everything in10-15minutes. I feel much better knowing everything is clean. Also will work for pacifiers and such.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 3,
      "publication_date": 20160922
    },
    {
      "title": "Great product for moms!",
      "text": "I bought this microwave sterilizer when my son was born and I love it. It was so much easier sterilizing his bottles in the microwave than on the stove. Being a new mom, it saved time and my sanity! It holds a decent amount of bottles, pacifiers, breast pump parts, etc. I definitely recommend it for any moms out there.",
      "rating": 5.0,
      "verified": true,
      "author": "j4j16",
      "helpful_votes": 5,
      "publication_date": 20160913
    },
    {
      "title": "Use instructions and common sense!",
      "text": "This is big and fits a lot of bits and pieces. I have to echo other reviews, the hinge is a joke but it isn’t hard to use and the fact that it comes apart makes it easy to clean. Water does escape but if you let it set for 10 mins After the 2 min min row ave time as the instructions say there isn’t any fear of steam burns. For the price it’s totally worth it. Follow the instructions and common sense!",
      "rating": 4.0,
      "verified": true,
      "author": "MrsP",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Try not to fill it up too much",
      "text": "This is my second baby and I am again using Dr. Browns bottles. With my first baby I used a Dr. Brown sterilizer and I didn't quite like it. This time around this was gifted to me and I loved it. I ended up ordering a new one within a few months because I noticed that it was not closing tightly after the time I put too many bottles and items in it so try not to fill it up too much or it will stop closing properly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Useful overall",
      "text": "The two negatives: the bottles flop over/around when trying to move the container if not moving very gingerly, the lid has to be exactly aligned on the \"hinge\" but does not lock into place on the \"hinge\" part. I found that frustrating when trying to multitask. I did not like that the bottles fell over constantly.",
      "rating": 3.0,
      "verified": true,
      "author": "Anne Humberson",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Works well. Small issues",
      "text": "This works very well. There is only one complaint I have. The lid is detachable and the hinge it attaches with isn’t the most easy to get back. Also after using it water leaks out of it where the lid and base come together. But overall works well. I use it multiple times a day and it has held up great",
      "rating": 4.0,
      "verified": true,
      "author": "Cortney Marie Bowman",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Does the job, drips lots of water",
      "text": "This is an okay sterilizer for the most part. I like that you can reuse it over and over unlike the bags. My complaints are that the pieces come out sopping wet whereas with the bags they would be much more dry. It also drops water everywhere once I’m taking it out of the microwave.",
      "rating": 3.0,
      "verified": true,
      "author": "Emily E.",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Large, works well, but messy",
      "text": "This steamer is big enough to hold several large bottles with nipples etc., but it makes a mess. The water that collects on the lid pours out of the sides when you pick it up, getting hot water all over the microwave and counter (and occasionally your poor fingers if you aren’t careful). It’s also kind of annoying that they require exactly 7oz of water. It would have been less of a hassle to design something that took an even cup.",
      "rating": 3.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "A life-saver",
      "text": "This has made life as a new parent much easier. This takes out the guesswork of boiling water, how hot is too hot, how long to boil, will bottles or parts melt. It’s so easy to use and quick. I wish that I got one of these at my baby shower but I will definitely be gifting one the next time I have an opportunity.",
      "rating": 5.0,
      "verified": true,
      "author": "Raven",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "A must have for your newborns!",
      "text": "This is the easiest and most economical solution to sanitizing baby bottles! Very easy to clean, very durable! We’ve been using ours for a year now- planning on handing it down soon. Still lots of uses left! Do not have to worry about cords or anything. Simply fill it up, add 7 oz of water, microwave for 4 mins and let stand for 10 and voila! I used it to sanitize pump parts as well! Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip Aaron Groover",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "This will literally burn you.",
      "text": "They changed the design of the handle on top. Now it is literally a mechansim to deliver near boiling water to your person and the area around you. It is impossible to grip when this thing is filled. It is pretty hot so holding from bottom isn't an option. Not sure how this got to market. Don't buy this....it is dangerous.",
      "rating": 1.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 2,
      "publication_date": 20190812
    },
    {
      "title": "Tried and true.",
      "text": "I have 5 kids and I’ve always had one of these. With my last baby, the bottle kit we purchased came with the sterilizer bags and those things are terrible. This will always be my go to. I can fit bottles and accessories all together and it doesn’t take forever.",
      "rating": 5.0,
      "verified": true,
      "author": "April Tilden",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "It works and is cheap",
      "text": "I use my dishwasher for most sanitizatio. As it turns out many are certified for this. This product feels heap, but you literally just need a microwave save receptacle that won’t leak too much steam And won’t melt. Would definitely not pay for a fancy self heating device if you’ve got a microwave...recommend going for this shallow bucket with a lid and a steam tray on the bottom.",
      "rating": 5.0,
      "verified": true,
      "author": "mldiotallevi",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Bottles don't dry easily!",
      "text": "Won't recommend it. After following instructions for sterilization as in the manual, and some other variants, we found that the bottles remain wet for over 12h. We live in a humid place. I personally don't prefer to dry these bottles with drying rag post sterilization. Traditional method of doing it in boiling water dries up in a few minutes - probably because the temperatures achieved with boiling are much higher.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170808
    },
    {
      "title": "It's okay if you like getting water everywhere",
      "text": "As far as steam bottle cleaners go, this works fine. But the lid, sealing and locking mechanism leaves a lot to be desired. Since the one side latches on a hinge, no matter what you do when you open the steamer (after use) all the water on the inside of the lid runs to the one side and leaks all over the place. It's a big mess of water everytime we use it other steamers dont have this issue.",
      "rating": 3.0,
      "verified": true,
      "author": "Danielle Geruso",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "major design flaw",
      "text": "does it work? yes. does it drip hot water around the edge of the entire bowl leaving a puddle under it? yes they should have the lid resting on the inside of the bowl instead of outside.",
      "rating": 3.0,
      "verified": true,
      "author": "xzvc9084",
      "helpful_votes": 4,
      "publication_date": 20170518
    },
    {
      "title": "Works great",
      "text": "I live in a shelter and we have no dishwasher.I want to be able to keep my baby's bottles clean and sanitize this thing works great",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Good value",
      "text": "This product is good. The only complaint that I have is that even after washing all bottle parts and sanitizing them, they still have a residue inside. And I have to repeat process sometimes more than twice",
      "rating": 5.0,
      "verified": true,
      "author": "TNM86",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "didnt work out for me",
      "text": "I didn't like using this product, because it didn't work clean as good as a electric sterilizer, I felt there was a weird smell after using this item, yet it was super easy to use and clean. but overall didn't have a good durability, so I prefer a electric sterilizer over a microwave one.",
      "rating": 1.0,
      "verified": true,
      "author": "Sana G",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Melted Bottle Top",
      "text": "Follow directions for our wattage of microwave. But it still melted the rim of the Baby Brezza bottles that we use. Not the actual nipple itself but the hard plastic part that screws onto the bottle.",
      "rating": 3.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "This is all you need.",
      "text": "I had a fancy electric thing for my first baby but just this for my second and repurchased for my third. This is really all you need esp if you use a dishwasher. The little bottles and things go in here. Big bottles I do in the dishwasher. Save your money for other things and get this!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Love it",
      "text": "Any new mom that wants to have an easy way to insure bottles, breast pump supplies, pacifiers are sterilized should have one. I had one when my baby was born and I bought this one for my daughter. No boiling like our parents and grandparents. Awesome for the mom on the go.",
      "rating": 4.0,
      "verified": true,
      "author": "Mya's mommy",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Just what I was looking for!",
      "text": "I purchased this product with high expectations! Its a great product, I was able to fit six standard Dr. Browns 4oz bottles and four of their 8oz bottles! the only flaw I found with the product was that of course the steam starts to drip and it could leave a small puddle on your counter if you don't act fast but otherwise its a great product for the price!",
      "rating": 4.0,
      "verified": true,
      "author": "Carla Stevenson",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "get one!",
      "text": "love this product! it’s a great price, it’s easy to use, and clean! it’s convenient to not have to sterilize all my bottles and pumping parts by having to boil everything, i just add the water and place it in the microwave, 4 minutes later, my items are ready!",
      "rating": 5.0,
      "verified": true,
      "author": "Yazmin Longoria",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "I absolutely love this product",
      "text": "I absolutely love this product! I don't have a dishwasher so it's nice to feel like the baby bottles are extra clean. It's convenient and sturdy and I use it every day.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey Jebb",
      "helpful_votes": 3,
      "publication_date": 20170829
    },
    {
      "title": "Pretty great product",
      "text": "We love it! It’s better than having a pot of water out all the time for sanitizing! I wish it would be easier to stack bottles in there as some times the bottles topple over. Having said that though, I don’t know what I would change, because it’s pretty great as it is. It even fits 9oz bottles! I was skeptical at first, but they fit!",
      "rating": 5.0,
      "verified": true,
      "author": "J. R. Norton",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "I won’t by again",
      "text": "Honestly, the handful of times I used it, I found it cumbersome and a waste of my time. I found boiling everything quicker and easier.",
      "rating": 3.0,
      "verified": true,
      "author": "Cassandra A. Landry",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Fast, easy way to sanitize baby bottles",
      "text": "I received this as a gift from a friend (not on my registry) and I love it! I definitely will recommend to any new moms looking for a fast, easy way to sanitize bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan C.",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Made my life easier",
      "text": "Would have given four stars, but due to the design, I was unable to maximize the amount of things I could fit in the sterilizer... the dip in the middle of the cover interfered with my ability to fit certain things in, so I ended up spending more time sterilizing bottles",
      "rating": 4.0,
      "verified": true,
      "author": "Guernica Jean-Jacques",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Great product",
      "text": "This was a little saver to me prior to getting a dishwasher. Easy to use and is compatible with most bottles, pacis, caps, etc. Great baby gift for mamas without a dishwasher",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah Decowski",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Great product",
      "text": "We have this for my daughter and son. We use it for sippy cup lips and silicone parts. Easy to use and easy to clean. It’s also easy to store since it’s not super big and bulky",
      "rating": 5.0,
      "verified": true,
      "author": "Maegan Taylor",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Good Value",
      "text": "We been using this sanitizer for a couple months now. It works as intended. I do wish it had more room though. We can do four bottles at a time. But for the money it's worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Welker",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Does the job over and over again",
      "text": "Been using this for the past 4 month to sterilize bottles and it works great! I can fit in a bunch of bottles in a single load. The only drawback is that if the sterilizer is left unopen after sterilizing, the condensate will drip out of it leaving a puddle of water in the microwave or on the countertop.",
      "rating": 4.0,
      "verified": true,
      "author": "Anna D.",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Not for small-ish microwaves",
      "text": "It is a bit too big for my microwave so I am not able to use it for its intended purpose (as a sterilizer). I got it for a really good price so I kept it anyway to use as a drying rack for bottles and pump parts. I like that it comes with a bottle brush as a bonus. So if you have a small microwave, make sure to check the dimensions of the product before purchasing!",
      "rating": 3.0,
      "verified": true,
      "author": "Elle C.",
      "helpful_votes": 2,
      "publication_date": 20151116
    },
    {
      "title": "Love it",
      "text": "Love this works so much better then the first one i had and fits the bottlesbi have better definitely a must have",
      "rating": 5.0,
      "verified": true,
      "author": "Kiarra",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Almost pointless",
      "text": "Hopefully it’s just a plastic bowl with some places to put bottles. It has a treat so that water from the bottom doesn’t touch anything. If you wanted to save money you could just boil water and sanitize bottles that way",
      "rating": 5.0,
      "verified": true,
      "author": "Savannah",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Easy to use but..",
      "text": "This is simple to use so it might just be my struggle with the small groves where the top is supposed to be anchored to the bottom. Does just what I purchased it for.",
      "rating": 5.0,
      "verified": true,
      "author": "jazmin",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "100% recommend",
      "text": "i love this!! i bought mine because i accidentally ruined my original one (don’t put the baby spoons with colored tips in this lol) & this one was such an upgrade. i bought one for both my best friends as well & they also love theirs!",
      "rating": 5.0,
      "verified": true,
      "author": "Larissa Coleman",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Traveling must have!",
      "text": "I have the electric version of this steamer but we travel a lot and wanted something more portable. This is a good buy for us since it's very lightweight and straightforward to use. I like that it includes a cleaning brush that's way better than the one I got for free with the electric version. However, this would've been way better if it was a little bigger as I can only sterilize 4 9oz bottles at a time and have to do multiple batches as compared with my electric one that can do 9 or 10 bottles.",
      "rating": 4.0,
      "verified": true,
      "author": "Madel Robles",
      "helpful_votes": 0,
      "publication_date": 20150904
    },
    {
      "title": "Love!",
      "text": "My son is one and a half and i still use this for his sippy cups and pacifiers. It’s awesome. I’ve used this ever since he was born and it still works great. I buy them for everyone’s baby shower because no one realizes just how much this thing will help you out.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Effortless sanitizing",
      "text": "Love it. Easy to use, just throw everything in with some water, microwave and remove. Sanitizing bottles and pumping stuff sounds so tedious but this really makes it effortless!",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Great purchase.",
      "text": "I have used this for 2 months and it has held up great. You can fit about 6 small bottles in it at one time. It sterilizes in the microwave in 4 minutes. Great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Good purchase",
      "text": "So easy to use. I was so tired of boiling/dishwashing on sanitize all my pump pieces and bottles. 12 minutes and it's done. The bottles come out looking clean without residue left on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kiana Vaccaro",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Great product",
      "text": "These was part of a baby registry gift. My daughter has one and I have also used it. Very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Hawaii1160",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "I’d probably buy something better but this works so whatever",
      "text": "It does what it’s supposed to do. I try to wash 6 small 5 ounce tommee tippee bottles, nipples and rings all at once and it’s a tight squeeze but it works. If diapers and formula wasn’t breaking my bank account, I’d probably buy something better but this works so whatever.",
      "rating": 3.0,
      "verified": true,
      "author": "kylie",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "BUY IT NOW",
      "text": "This!!! This is the greatest!!! I can sanitize pump parts quickly and efficiently! It holds a lot. Stores my parts. I can't believe I didn't have this with my first baby!!! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Felicia Harrison ",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Love this! With my first I used the Madela ...",
      "text": "Love this! With my first I used the Madela steam bags. My second baby is almost 2 weeks old and I am exclusively pumping again and this seems way easier ! I think it may even fit more then the steam bags !",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie",
      "helpful_votes": 2,
      "publication_date": 20170718
    },
    {
      "title": "Excellent product",
      "text": "This one is a hard working sterilizer. Every day, twice a day. Easy to,use, easy to clean and works just perfect. Fits 4 tummy tepee bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelica Butler",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Great product",
      "text": "We love how simple this is to use. It gets used multiple times a day cleaning bottles, spoons, bowls, and more.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnnie Clark",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Not really worth it",
      "text": "Thought I would use this a lot more, but it's been used maybe once. Not really worth getting.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Worked great but we ended up liking the microwave bags better",
      "text": "Worked great but we ended up liking the microwave bags better. All about preference. With the bags you didn’t feel the need to clean that too. And after 20 uses, you could throw it away. But this is good if you wanted to regift or pass along.",
      "rating": 4.0,
      "verified": true,
      "author": "Drew H-M",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Better than most brand available in the market",
      "text": "Better than most brand available in the market. Tried quite a few. The newer version is not built well compared to older one but still better than its counterparts. What's good: 4(6 OZ bottles) OR 3 (9 OZ bottles) and parts of Playtex vent air. I don't believe sterilizing is the device capability; all of them do if ur microwave works fine. so ya, it works.",
      "rating": 5.0,
      "verified": true,
      "author": "Samba",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Must have for babies",
      "text": "When our daughter was about two months old, she came down with a case of thrush. Even with the meds, we had a hard time knocking it down; however, once we received and began using this, the thrush was gone within two weeks. I'm quite certain that the heat level in which this gets her bottles, and everything else we use for her, had much to do with getting her cleared up. The Munchkin is used EVER day in our house.",
      "rating": 5.0,
      "verified": true,
      "author": "C.J. S.",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "Easy to use",
      "text": "I like the concept of the quickness of this product and it does what it is designed to do and easy to clean. My dislike is that products take a long time to dry once out of this item. So that they were quicker to clean it up longer to dry.",
      "rating": 3.0,
      "verified": true,
      "author": "Catavo",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Save your money",
      "text": "This product does not fit enough bottles SECURELY for my liking. Most of the items would topple over and therefore not get steamed properly.",
      "rating": 2.0,
      "verified": true,
      "author": "JessicaisaMessica",
      "helpful_votes": 2,
      "publication_date": 20171107
    },
    {
      "title": "This sterilizer is super easy to use and has lots of room",
      "text": "This sterilizer is super easy to use and has lots of room. My only negative is that when I take it out of the microwave, half the time it leaks steaming hot water out, and then when you open it..same thing. It does the trick though and I've been using it for two months now. Just put a towel under it and you are good to go.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Great product for a great price.",
      "text": "My mom watches my twins while I am at work and it was becoming a mission to sterilize bottles at my house and bring them to her, so I bought this so that she would be able to sterilize her own bottles. I also didn't want to spend the $50 on the electric one that I have (which I love). This was a great price and does a great job. I use 8 oz bottle and can only put 4 at a time, but that's fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn Pedraza",
      "helpful_votes": 0,
      "publication_date": 20151014
    },
    {
      "title": "Great, simple product!",
      "text": "Very simple to use and perfectly priced. Does the job intended, no need for all the bells and whistles for something like this.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah E. Atwell",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Ease of use",
      "text": "Really easy to use and I believe it does a good job",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine Erwin",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Great sterilizer",
      "text": "I like this for sterilizing Breast pump, bottles, and pacifiers every day/every other day. Make sure you hand wash all parts before putting them in this though. This just sterilizes-it does not actually clean the parts. It's easy to use and easy to clean. Much more simple than boiling all your parts. Would definitely recommended for any parent--would be a great shower gift!",
      "rating": 5.0,
      "verified": true,
      "author": "Joel",
      "helpful_votes": 0,
      "publication_date": 20160208
    },
    {
      "title": "Excellent Sterilizer",
      "text": "Very easy, quick way to sterilize baby bottles, nipples, etc. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "D. West",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Simple and easy to use!",
      "text": "So easy to use!!! Busy mom of infant, this product makes sanitizing bottles easy and effortless!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Huang",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Very convenient",
      "text": "Very convenient for my daughter in law , she is very busy with two little girls and it helps to be able to sterilize the bottles in the microwave.",
      "rating": 5.0,
      "verified": true,
      "author": "Domingo Lavandier",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Great sanitizer for large bottles/multiple items",
      "text": "I love that this is so big and I can wash so many things at one time. It’s easy to clean and easy to use. I wish there was a fill line for the water.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy A.",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "A Life Saver",
      "text": "This thing is great! It makes sterilizing bottles so much easier. It holds a lot and is really convenient to use. Bonus: it's a lot cheaper than some other options I've seen.",
      "rating": 5.0,
      "verified": true,
      "author": "Cristina Thrower",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Easy to use",
      "text": "This is very easy to use and it makes sanitizing my baby's bottles and pacifiers very easy. It only takes 14 minutes. Things come out very wet, but I just put them on my drying rack and they're good to go the next day.",
      "rating": 5.0,
      "verified": true,
      "author": "KelTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "A Must Have.",
      "text": "I bought my first one back in 2009 and it still works well. So I bought my new grand baby one for his home. Very simple to use and fits in even a small microwave. We have harsh water so we must sterilize the baby's items using filtered bottled water.",
      "rating": 5.0,
      "verified": true,
      "author": "T and G Family",
      "helpful_votes": 0,
      "publication_date": 20171225
    },
    {
      "title": "Love it.",
      "text": "Easy to use. Easy to clean. Does not burn my fingers when trying to remove from microwave.",
      "rating": 5.0,
      "verified": true,
      "author": "Chi",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "you can put it away easy. Easy to wash it as well and sterilizes ...",
      "text": "Small, you can put it away easy. Easy to wash it as well and sterilizes everything pretty good! I was not a big fan of the microwave sterilizers because of the space, but this one fits a lot of things. It comes with a little piece for you to grab things when its hot. Very helpful!",
      "rating": 5.0,
      "verified": true,
      "author": "Mariana",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Works great",
      "text": "I probably use this over 5 times a day and so far it’s been working great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Great baby bottle sanitizer",
      "text": "Works as expected saves room as it doubles a sanitizer and bottle storage",
      "rating": 5.0,
      "verified": true,
      "author": "Gisela",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "I like it",
      "text": "Large enough to fit all pump parts, and a few bottles in at one time. Only takes 2 minutes in a high powered microwave with 10 min cool down time. I like that it came with a bottle brush, a special brush for the (bottle) nipples, and the tongs are a nice touch. It is pretty large though, so you'll need a full size microwave. But on the plus side it does fit full size bottles, not just the 4oz ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel Meredith",
      "helpful_votes": 0,
      "publication_date": 20151023
    },
    {
      "title": "Drips and leaks",
      "text": "It leaks. The condensation drips down the inside roof and walls of the lid and then drops out through the space between lid and base. Not sure why there isn't a seal there. This is one of just a handful of amazon items I returned.",
      "rating": 2.0,
      "verified": true,
      "author": "E. Gorman",
      "helpful_votes": 3,
      "publication_date": 20160115
    },
    {
      "title": "A MUST",
      "text": "I bought it as a gift, but I hve the same item in another brand. The concept is the same. My friends said they love it, and they use it 24/7. Specially th first couple of monht you are washing bottles, nipples, pump equipment and pacifiers all day. You don't have time to b waiting for the dishwasher to run all day. Hand washing leaves and after taste; my baby rejected bottles when I tried to transiton to that. Leave it running and have clean bottles 5 minutes later.",
      "rating": 5.0,
      "verified": true,
      "author": "C.R.U",
      "helpful_votes": 0,
      "publication_date": 20111128
    },
    {
      "title": "Great time saver",
      "text": "Really happy with this as it made cleaning bottles a breeze. 2 minutes in the microwave and then 10 minutes to let steam, and done. In those early months you really need everything you can to make life easier, so I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel M",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "Great!",
      "text": "We use this everyday. My wife pumps at work. So we want to clean and sterilise as quickly as possible ready for the next day. We simply run the dishwasher then place the parts in the steam cleaner ready to dry for the next day. Only gripe is that 8oz dr brown bottles won't stand up right due to lack of height",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. T. K. Brennan",
      "helpful_votes": 0,
      "publication_date": 20161113
    },
    {
      "title": "Easy to use sterilizer",
      "text": "Easy and effective way to sterilize bottles. Would recommend the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Danabubbis",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Too big to fit in a microwave",
      "text": "This thing is too big to fit in a normal sized microwave. Better off just washing the bottles by hand.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Great sterilizing option",
      "text": "So happy I got this. I hate creating waste so I did not want to keep purchasing the bags. Also saves money since you don’t have to keep buying them.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel/LaToshia Heng",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Not for me personally",
      "text": "It works as a steamer I just dont feel like it sanitizing things and I think I'd feel that way with any microwave sanitizer..so if you're looking for one thing is a good price and worth trying",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Every new parent needs one",
      "text": "I have used this as an alternative to boiling bottles ( i still do boil them all once a week) but this product helps save time and is so easy to use. I don't stick to the stacking method they suggest as you have to fit the bottle parts as you go depending on the type of bottles you use but all in all, bottles and all parts are cleaned and sterilized well. Just be careful when opening the lids after as the steam can be overwhelming. A very good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Sleepygirl7tt",
      "helpful_votes": 0,
      "publication_date": 20091113
    },
    {
      "title": "Unfortunately did not fit in our microwave",
      "text": "This seems like a great concept for steam sterilizing breastpump parts, bottles, nipples, pacifiers etc. However, it did not fit in our microwave. The diameter was too great for the microwave door to close. The description says \"Fits all standard microwaves\", and I didn't think I had a smaller-than-average microwave, but I guess I do. Instead, I have been using the Medela Quick Clean Micro-Steam Bags.",
      "rating": 3.0,
      "verified": true,
      "author": "cmanning3",
      "helpful_votes": 0,
      "publication_date": 20140122
    },
    {
      "title": "We were going though the medela sanitizing bags like crazy, and those are not cheap",
      "text": "This thing came in SO handy once my daughter was born. We were going though the medela sanitizing bags like crazy, and those are not cheap. This though was a life saver, and totally worth the price! Buy it and you will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan B.",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Great for sterilizing nebulizer equipment!",
      "text": "I use this to sterilize nebulizer equipment when traveling. Holds a lot, easy to use. I would give five stars if the lid were a little less cumbersome to use. It is pretty big, I wasn't sure if it would fit into some of the microwaves at places we stayed, but usually its not an issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Shoveltrick",
      "helpful_votes": 0,
      "publication_date": 20170419
    },
    {
      "title": "Great product",
      "text": "This would be the perfect baby shower gift. If you follow the manufacturers directions this product is safe and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "JGR",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Works great! Love that it just takes a couple minutes ...",
      "text": "Works great! Love that it just takes a couple minutes to sterilize my baby stuff vs what it would take to do it on the stove. I've had this for 4 months and still works good. The only thing is the two clasps that hold the lid on sometimes slip open, so I don't just hold it by the handle or sometimes my bottles will fall out. Otherwise very satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "Must buy especially for the price",
      "text": "For $11, this is a must buy. It's quick (2min) and even holds tall bottles. If you have a wide neck Dr. Brown's 4oztles, you still have to tilt it sideways. I would wish that they made this sterilizer taller but then it wouldn't fit in my microwave or it would but I would have to hold the body and in the process would burn my fingers.",
      "rating": 5.0,
      "verified": true,
      "author": "Ged",
      "helpful_votes": 0,
      "publication_date": 20151023
    },
    {
      "title": "Not a 4 minute steamer",
      "text": "When I bought this I thought it would sterilize bottles in 4 minutes. The directions say to microwave for 4 minutes then let sit closed for another 10. I do like it better than my electric steamer because this is so easy to clean. It holds a lot more than it looks like.",
      "rating": 4.0,
      "verified": true,
      "author": "kampy",
      "helpful_votes": 0,
      "publication_date": 20160915
    },
    {
      "title": "Money’s worth",
      "text": "Great product. Easy to use. Easy to clean. No mess. Only takes 2 min. Would buy again. I have been using this everyday. Very satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "Shiann",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Easy to use",
      "text": "Love this. I was boiling my little girls bottles daily. So much less time and it doesn’t ruin my pot. I am very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": ",Andrea",
      "helpful_votes": 0,
      "publication_date": 20200217
    }
  ],
  "product_meta": {
    "title": "Munchkin Steam Guard Microwave Sterilizer",
    "description": "You don't want harsh chemicals anywhere near your baby and his feeding supplies, but you don't have the counter space for a traditional bottle sterilizer, either, so how can you ensure everything is squeaky clean? The Munchkin Steam Guard Microwave Sterilizer is a safe, natural and efficient way to kill up 99.9% of bacteria on bottles, nipples, pacifiers, teethers, small toys and breast pump accessories right in the microwave. There's enough room to sterilize up to 4 baby bottles and 2 breast pump shields at once. This compact baby sterilizer fits all standard microwaves and works with both regular and wide-mouth bottles. The locking tab is designed to safeguard everything inside and prevent accidental opening, too. Baby-safe cleaning should always come this naturally.\n\nFROM THE MANUFACTURER\nThe Steam Guard Microwave Sterilizer helps prevent steam burns with heat resistant handle and tongs. It is compact and lightweight. This has a one tab latch to open lid and fits all standard microwaves.",
    "rating": 4.7,
    "feature_bullets": [
      "Kills up to 99.9% of common bacteria in as little as 2 minutes",
      "Lightweight, compact bottle sterilizer with heat-resistant handles",
      "Open-away latch prevents steam burns",
      "Holds up to 4 bottles and 2 breast pump shields at once",
      "Works in all standard microwaves. Product dimensions: 12.5 x 11.3 x 6.7 inches"
    ],
    "specifications": {
      "Product Dimensions": "12.5 x 11.3 x 6.7 inches",
      "Item model number": "11065",
      "Is Discontinued By Manufacturer": "No",
      "Target gender": "Unisex",
      "Material Type": "BPA Free, Latex Free",
      "Material free": "Nitrosamine",
      "Care instructions": "Prior to sterilizing, wash all items in mild soapy water and rinse thoroughly in un-softened water. Do not use antibacterial soap.",
      "Additional product features": "Open-away latch prevents steam burns",
      "Number Of Items": "1",
      "Batteries required": "No",
      "Dishwasher safe": "No",
      "Specification met": "Certified frustration-free",
      "Is portable": "No",
      "Item Weight": "1.74 pounds",
      "ASIN": "B000V9DXGS",
      "Customer Reviews": "4.7 out of 5 stars1,675 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#1,624 in Baby",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More"
    },
    "categories": [
      "Bottle-Feeding",
      "Baby Products",
      "Warmers & Sterilizers",
      "Baby",
      "Feeding"
    ],
    "price": 14.98
  }
}