{
  "website_summaries": [
    {
      "verdict": "It's hard for the budget-conscious consumer to argue with a solid stepper equipped with a multi-function monitor and other goodies.",
      "pros": [
        "Gets top marks for its adjustable hydraulic resistance, which lets users choose the intensity of every workout"
      ],
      "cons": [
        "Built-in computer prone to unpredictable operation and often shorts out"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I hesitated buying something like this for fear it would just sit and not ...",
      "text": "I hesitated buying something like this for fear it would just sit and not get used. I made myself do it for 5 minutes every day to start out with and gradually increased 1 minute per week. I love it and it makes my legs feel like jello by the time I’m done. It folds up and stores perfectly if needed but because I use it every day we don’t store it. I’ve had it for just 4 months now, and it’s very affordable, I would pay way more for a gym membership for 4 months and wouldn’t use it as often or conveniently! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "jeremy statler",
      "helpful_votes": 66,
      "publication_date": 20180121
    },
    {
      "title": "This machine is so fun!",
      "text": "Exactly what I wanted! I live in a small apartment with my man and dog, so space was a major factor in a cardio machine. This thing has great resistance settings and works just as well as the ones at LA Fitness! The foam grips were tough to get on but I just removed them, slicked it with olive oil, and slid them right back on. This machine is so fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Jassimine",
      "helpful_votes": 30,
      "publication_date": 20180207
    },
    {
      "title": "Do not buy this device. I've used mine for ...",
      "text": "Do not buy this device. I've used mine for a while and then this week the connector at the top of one of the hydraulic tubes suddenly broke and the tube snapped forward and hit me hard in the leg. Bleeding, huge bruise, etc. There are safer devices out there.",
      "rating": 1.0,
      "verified": true,
      "author": "NC Buyer",
      "helpful_votes": 65,
      "publication_date": 20160815
    },
    {
      "title": "even for a relatively fit 24 year old with pretty good leg strength",
      "text": "The pedals are really hard to push, even for a relatively fit 24 year old with pretty good leg strength. I had to set them to the lowest resistance in order to be able to get the speed I wanted, but it came already built, just a few things to do before you can use it. Really easy to fold up and small even when it is out.",
      "rating": 2.0,
      "verified": true,
      "author": "Dakota",
      "helpful_votes": 25,
      "publication_date": 20180306
    },
    {
      "title": "Super Easy set up.... Great for a sweaty workout",
      "text": "I was very reluctant to purchase this based on the harsh reviews. I was particularly concerned as some of the reviewers of my age (60s) said they could only use for a minute or two on the lowest (easiest) stepping tension. Not my experience. This machine is well constructed and provides a butt busting workout. I could do 10 minutes pretty much from the start and felt the burn. I am thinking of buying a second one for our second place, our cabin. Despite the negative reviews, I am very pleased with this product. Happy butt busting!",
      "rating": 5.0,
      "verified": true,
      "author": "DarG",
      "helpful_votes": 5,
      "publication_date": 20181231
    },
    {
      "title": "I have owned this unit for several years. The ...",
      "text": "I have owned this unit for several years. The main problem i had with this unit is the shocks breaking off at the top end connected to the horizontal bar and the shock falling off spewing oil on the floor supporting the unit. The price of each shock used to be $13 each and life span about a year. Now the price is up to $20 each and the life span is less than a year. I plan on replacing this unit with something else.",
      "rating": 1.0,
      "verified": true,
      "author": "Deborah Marche",
      "helpful_votes": 16,
      "publication_date": 20180212
    },
    {
      "title": "It’s s good product for the price!",
      "text": "I was very skeptical after reading reviews. But I am very happy with this. Very easy to assemble. The handle bar pads were difficult but defiantly doable. I did put a towel under the peddles because it does knock and I plan to do this early in the morning. It exactly what I wanted, my first ten mins and I’m sweating. It took awhile to find the tension I wanted but good to go!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 11,
      "publication_date": 20180612
    },
    {
      "title": "I previously used an old DP exercise machine that had a stepper with huge rubber bands that I loved. These shock absorber systems aren't as much fun",
      "text": "Sorta OK. I previously used an old DP exercise machine that had a stepper with huge rubber bands that I loved. These shock absorber systems aren't as much fun, but this one is OK. I made a crossbar of 1-1/2\" PVC pipe and drilled some holes through one side with a hole saw, and that allows me to lean on it to give better control so I can operate it in the middle of the range and maintain some flexibility of resistance. Otherwise, you have to set the resistance very high in order to keep you from banging metal-on-metal and disturbing your downstairs neighbors.",
      "rating": 3.0,
      "verified": true,
      "author": "Bo88y",
      "helpful_votes": 9,
      "publication_date": 20180510
    },
    {
      "title": "Great little workout machine",
      "text": "Bought this for my wife and I and we’re overall happy with it. I’m impressed on how low profile it is. It folds almost to nothing and doesn’t take much space. The tension on the steps are strange though. Even on light setting it does take a bit of power to get it down. (I’m about 160 lbs.) can’t wait to continue with some workout sessions. FYI some folks said the foam for the handles are a bit difficult to get on, Just a tip put them in the dryer for 2 mins or until somewhat soft and get em on that way.",
      "rating": 4.0,
      "verified": true,
      "author": "Joshua P",
      "helpful_votes": 5,
      "publication_date": 20190203
    },
    {
      "title": "No more parts available to this machine",
      "text": "Bought this machine less than 2 years ago. Broke a small clasp that holds the shock to the upper bar. Contacted the company for a replacement and was told it's a discontinued model and no spare parts available. So now I have to throw out the whole machine for a part that probably costs a few dollars.",
      "rating": 1.0,
      "verified": true,
      "author": "tberg",
      "helpful_votes": 4,
      "publication_date": 20190701
    },
    {
      "title": "JUNK",
      "text": "Don't expect it to last much beyond the 90 day warranty on parts. As other reviewers indicated, shocks snap off. Customer service...wait, there is no customer service, at least they don't respond. This may very well be an issue with any stepper shock, but I would at least expect customer service to respond to see about purchasing a replacement shock.",
      "rating": 1.0,
      "verified": true,
      "author": "WayG",
      "helpful_votes": 6,
      "publication_date": 20190109
    },
    {
      "title": "Handle bar rubber grips a nightmare!",
      "text": "A nice sturdy and easy to put together machine. Only major headache, and it was a big headache was putting one the handle bars. As they suggested I used soap and I also used oil. One went on somewhat easy the other was a nightmare. Why such a headache and why can’t they ship it with the rubber handle grips already attached. This is big negative to give it a five star rating. However the machine is very nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 5,
      "publication_date": 20180620
    },
    {
      "title": "Proper Stairmaster Equivalent Workout",
      "text": "Excellent product! I originally searched high and low attempting to find a space-saving actual stairmaster for a reasonable price. Didn't much care for steppers as they look more like ankle twisters. I needed something where I actually lifted my leg and pushed myself up as if it were a stair. This machine is as close as that gets with the parameters outlined. My only concern is the electronic meter. mine works fine and displays everything I need, but it's clear the stepper would be useless to me without it. I'm going to contact the company and see if I can purchase a spare! Just in case 😉",
      "rating": 5.0,
      "verified": true,
      "author": "Roman S. Van Allen",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Stay out of the germ-covered gym and build your own at home",
      "text": "Love it! If you have trouble adding the handle covers, then the trick it to pull down on them throughout the handle. Start at the bottom and work your way to the top by pulling down. Perfect for my small apartment! After 20 minutes, I’ve usually burned 100 calories. Not bad! I wish I had bought this years ago. I bought this to help me recover from my vein surgery. Perfect for living in a place like Michigan where the sidewalk is often covered in ice during the wintertime and you can’t safely go for a walk and get some exercise. I can’t wait to workout in front of the AC in the middle of July.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah G",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Assembly was pretty easy, with the exception of the handlebar covers",
      "text": "Assembly was pretty easy, with the exception of the handlebar covers. I find that the machine seems to be off balance when using and no matter how it's positioned, it appears to rock from side to side. Other than that minor issue, it seems to be a good workout. Definitely gets the heart rate pumping.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20171214
    },
    {
      "title": "Good workout",
      "text": "I am so happy to be able to exercise during the quarantine. This stepper does the job. I work up a sweat. It has issues with the console but I just use my phone to time the workout. Also, you need to coat the metal handles with Vaseline before you try to slide the foam padding on. Otherwise it was easy to put together.",
      "rating": 4.0,
      "verified": true,
      "author": "robin koffler",
      "helpful_votes": 2,
      "publication_date": 20200401
    },
    {
      "title": "Good Machine .... BUT",
      "text": "I liked the fact that it was extremely easy to assemble and also very sturdy. Also, I am sure it works very well.What disappointed me was that it really isn't for beginners. The weakest/lightest tension was still pretty tough to manage and actually caused my knees to hurt. It would have been so much better if the tension level went from VERY light to very heavy",
      "rating": 2.0,
      "verified": true,
      "author": "Oranyan187",
      "helpful_votes": 2,
      "publication_date": 20190606
    },
    {
      "title": "It works!",
      "text": "Using this for 20 minutes a day, three to five days a week has toned my legs and butt very noticably. I'm really glad I bought it. I had an Amazon rep assemble it (worth every penny!), so I don't know whether it's easy to assemble. It's not completely sturdy, but it's not a top-of-the-line machine. So, I'm ok with that. It's not wobbly to the point of it being dangerous or even a problem, really. But it's noticable.",
      "rating": 5.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Not what I expected.  Can you get it",
      "text": "Not fond of the handlebar set up as it should have a top bar to hold on to. . I thought the steps would be easier to use. I do not find it pleasurable at all since it’s too hard to just do a step routine. You have to go slowly up down or the pedals or they just slide down on you. If you go short and fast, the pedals slide down also. I thought it was going to be better. I had a good stepper years ago but this is not like it at all. To get the foam covers I sprayed the handle bars with pledge furniture wax and the slip on easily.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Very compact",
      "text": "I wanted something to supplement my bike ride. I put this in front of my TV in my shop. Great workout!. It kicks my butt.!! Very compact and easy to move around. Very simple and well made.",
      "rating": 5.0,
      "verified": true,
      "author": "GWP",
      "helpful_votes": 3,
      "publication_date": 20181110
    },
    {
      "title": "Terrible craftsmanship",
      "text": "Poorly designed and cheaply made. Only lasted 3 months and there is unbearable squeaking with each step. The customer service is non existent and warranty is a complete joke. Given the way they handle complaints and requests for assistance One could only conclude that the manufacturer doesn't even bother to stand behind their product.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 15,
      "publication_date": 20161001
    },
    {
      "title": "Great quick workout",
      "text": "This little stair climber is great for a quick workout! I took away one star because even on the easiest setting it is tough. I can only do about 15 minutes max so far. Maybe that says more about me then the stair climber though. Lol Set up was easy and I love that it folds up. I have used it a lot, and even my fiance uses it. For the price, I would definitely recommend",
      "rating": 4.0,
      "verified": true,
      "author": "Kim Hines",
      "helpful_votes": 3,
      "publication_date": 20181105
    },
    {
      "title": "Great machine, good workout",
      "text": "Stepper is good, but it squeaks! Used it for 1 week, 30 min/day, and the squeak is pretty obnoxious. I contacted the company and they said to use a few drops of lubricant oil, but this didn't stop the squeak. So, I used WD40 and the squeak has stopped. Stepper works fine now. Use daily, good workout!",
      "rating": 4.0,
      "verified": true,
      "author": "Kiki",
      "helpful_votes": 5,
      "publication_date": 20180414
    },
    {
      "title": "Not working for me",
      "text": "If you weight less than 130lbs, this machine is not for you. I used level one for beginner the steps didn’t even go down I just stand on it",
      "rating": 2.0,
      "verified": true,
      "author": "CC",
      "helpful_votes": 3,
      "publication_date": 20190701
    },
    {
      "title": "Not a good workout",
      "text": "This stepper structure is well built. The pistols do not hold resistance through out the workout. After 30 minutes, the pistons heat up and lose their resistance. Not sure how this got so many good reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 2,
      "publication_date": 20190511
    },
    {
      "title": "Good for the price.",
      "text": "Seems to work well so far. The mechanism heats up quickly and the resistance lessens somewhat, but it doesn’t bother me much. It doesn’t squeak like the one I replaced, although I admit I haven’t used it a lot yet.",
      "rating": 4.0,
      "verified": true,
      "author": "madbaker",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "If you don't mind not knowing how many steps you're taking this is great",
      "text": "Digital display monitor stopped working within a month or so of using it. Now my husband gave up using it since he doesn't want to use it not knowing how many steps he's taking. He's been gradually increasing his steps each time he uses it. Now it's not being used because of the monitor going out. We replaced the battery and still no luck. Bummer.",
      "rating": 3.0,
      "verified": true,
      "author": "Brass Honcho",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "If you are just looking for something basic, too ...",
      "text": "If you are just looking for something basic, too get you started this is it. I do have to stick something under one side because the bar going across isn't level. But it does what it need it to for now.",
      "rating": 3.0,
      "verified": true,
      "author": "Cathy",
      "helpful_votes": 5,
      "publication_date": 20180401
    },
    {
      "title": "A Great Way to Keep in Shape",
      "text": "The Stepper is a good way to exercise. It is very sturdy, easy to put together, fold neatly away. It is so small that it fits even in the smallest space. I use it every day, several times. Every time I walk by it I step on it and exercise. You can adjust the tension as you get more fit. Unless you have a staircase where you live and have to run up and down a lot, this tool is perfect and brings up your heart rate, works your leg muscles, hips and butt. It has a small price tag for the kind of workout you can enjoy.",
      "rating": 5.0,
      "verified": true,
      "author": "bogart",
      "helpful_votes": 4,
      "publication_date": 20160709
    },
    {
      "title": "My Knees Hurt",
      "text": "My knees hurt when I use it. I'm not sure how much is the fault of this stepper. But I can not use it. I try adjusting my positions but can't find one that works well. It is past the return window so I can not return it. I really hate not being able to try out stuff before purchasing!",
      "rating": 2.0,
      "verified": true,
      "author": "Anna's MUSIC",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "It is what it claims to be",
      "text": "It is what it claims to be, a folding stepper. It works. It stores easily. It's built reasonably well. It's not as smooth as a professional stepper but for the price, it is just what I expected. I would definitely start easy and slow with this. Take some time to get used to it.",
      "rating": 4.0,
      "verified": true,
      "author": "Karl N Tellefsen",
      "helpful_votes": 7,
      "publication_date": 20161228
    },
    {
      "title": "Didn't even work.",
      "text": "Didn't work at all. I stepped on the unit and my body sunk to the ground!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170420
    },
    {
      "title": "Great machine for the price. Does the job.",
      "text": "This is my 2nd one so I can have it at both mine and my parents' house. I've used this for about 8 years to stay in or get in shape. For when my knees aren't up to running. Sturdy, adjustable, compact, maneuverable and inexpensive. Use with dumbells to get the best workout. Folds down nicely under a bed or against a wall.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Iannarino",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "This is like the slow motion stair stepper",
      "text": "This is okay....it is very hard to use. It doesn't really adjust so when you go to step it takes quite a while before your foot goes down. If you were looking to stair step to music forget it. This is like the slow motion stair stepper...and I am 145 lbs. I can't imagine being a small person trying to use this.",
      "rating": 3.0,
      "verified": true,
      "author": "Sharon K. Root",
      "helpful_votes": 11,
      "publication_date": 20150221
    },
    {
      "title": "easy to assemble",
      "text": "I jus bough this machine 2 days ago, easy to assemble. But at the firt time of use the hydraulic get hot and one of the no longer goes up.",
      "rating": 2.0,
      "verified": true,
      "author": "Mia M. Ferrari",
      "helpful_votes": 3,
      "publication_date": 20180603
    },
    {
      "title": "Don’t buy",
      "text": "Easy to build and move. Broke within two months of using two hours a days. Wouldn’t buy it again.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott Sexton",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Great Stepper for the price!",
      "text": "Great for use in a small apartment! Works great and very affordable. So far is doing its job with firming and toning legs and butt. Definitely recommend to someone with limited space and looking for an affordable piece of workout equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie M.",
      "helpful_votes": 3,
      "publication_date": 20180222
    },
    {
      "title": "High resistance",
      "text": "Easy to set up, portable. I have it on the easiest setting, and it makes me sweat in 10 minutes. A bit more difficult to use than I had originally thought, very high resistance even on low setting.",
      "rating": 3.0,
      "verified": true,
      "author": "Terri Cruze",
      "helpful_votes": 2,
      "publication_date": 20180413
    },
    {
      "title": "Love this thing---perfect for when I need to work out ...",
      "text": "Love this thing---perfect for when I need to work out but don't have the time to go all the way to the gym. It folds up easily so I can store it in the corner of my living room and set up in front of the tv when I'm ready for a workout. It does get a little squeaky after about 20 minutes or so and I really wish it had a spot for a water bottle---but it is a great product for the price!",
      "rating": 4.0,
      "verified": true,
      "author": "RebeccaT",
      "helpful_votes": 2,
      "publication_date": 20160301
    },
    {
      "title": "Great stairstepper",
      "text": "I absolutely love it...I just got up to 15 minutes on it. And feel like I got a better workout than my other stairstepper that I broke after 10 years on it. does the job",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Impossible to get on and she have come on preassembled like everything else",
      "text": "The resistance slider does not appear to work properly. Feels all the same. The rubber tubes were impossible to get on even with \"hand soap\" as directed. Impossible to get on and she have come on preassembled like everything else. The unit is super heavy and difficult to take out and put back away but it suits its purpose just not for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "highwaycatcher",
      "helpful_votes": 3,
      "publication_date": 20170210
    },
    {
      "title": "Works great",
      "text": "This stepper is a little flimsy, but it's because I'm used to working out hard and heavy. For the convenience of home use and the time it saves me to travel to a public gym that has a monthly gym membership fee, saving me from fighting the crowd in a crowded parking lot, it's worth it. I used it the day after it arrived and I was out of breath and worked up a sweat in a matter of minutes. Does the trick. It's perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Serendipity ",
      "helpful_votes": 5,
      "publication_date": 20141127
    },
    {
      "title": "This is a really great product for the price",
      "text": "This is a really great product for the price. My order was missing the digital counter but I emailed the company and they sent one to me about as fast as humanly possible. The stepper is strong and works well. It folds so easily if you want to get it out of the way. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward Denton",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "I've also noticed its actually pretty sturdy, but I did take my time building ...",
      "text": "I don't have a ton of experience with a variety of fitness machines but this machine truly works you out. You can really feel the burn on this machine in just a few minutes of use. The machine is extremely light weight and takes up very little space which is exactly why I purchased it. I've also noticed its actually pretty sturdy, but I did take my time building it to make sure everything was in its place.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin M.",
      "helpful_votes": 4,
      "publication_date": 20160323
    },
    {
      "title": "Sturdy Stepper",
      "text": "The stepper was easy to put together. I'm starting to use it everyday. I thought it would be cheaply made but it is quite sturdy. It even folds and stores under the bed.",
      "rating": 5.0,
      "verified": true,
      "author": "KENNP",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Works great!",
      "text": "Perfect for what I need it for, lost 10 lbs so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Mario Rimoldi",
      "helpful_votes": 3,
      "publication_date": 20200107
    },
    {
      "title": "Easy to assemble and Use",
      "text": "I've had my stepper for over a year and lost 10 lbs. by using it while watching TV every evening. It's perfectly quiet (YOU are the \"motor\") and gives legs and butt a great workout. It was also easy to put together, sturdy, and is light and portable enough to move from one room to another. Great buy for the money! I purchased a portable treadmill also but never put it together because I like using this stepper so much.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. Pickle",
      "helpful_votes": 8,
      "publication_date": 20131129
    },
    {
      "title": "Loud Pistons & Short ROM",
      "text": "My review is subjective of course but this stepper does not seem to provide a challenging workout. I got it for low-impact purposes since I had back surgery. None-the-less I was looking for a challenging work out. The range of motion is pretty short (5'11 male). Also, after 3 minutes of use the right piston squeaked pretty loudly every step and I also got this machine to be quiet so I can workout while the kids slept. It may be good for others but for an average fit male or someone wanting a quiet workout this may not be for you.",
      "rating": 2.0,
      "verified": true,
      "author": "stephen",
      "helpful_votes": 8,
      "publication_date": 20150609
    },
    {
      "title": "WOULD NOT purchase again!",
      "text": "Did not like the fact that it did not fold like stated. The item was suppose to be a foldable stepper, yet it doesnot! Also not convenient. It took me a long time to put together, sturdy, but weight to HEAVY!",
      "rating": 2.0,
      "verified": true,
      "author": "Ronda Williams",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Love this machine",
      "text": "Love this machine. Workout, foldable for easy storage, the setup was easy except the foam handles were so tight to install. They should have been already installed. Otherwise the rating would be 5 stars",
      "rating": 4.0,
      "verified": true,
      "author": "MILTON",
      "helpful_votes": 3,
      "publication_date": 20171118
    },
    {
      "title": "Don't waste your money!",
      "text": "Worst piece if exercise equipment I have ever purchased. Hard to use. Adjustment are useless. Used it 6 times trying to make it worth the money I wasted on it. Done. Don't evrn feel good about trying to sell it to someone else.",
      "rating": 1.0,
      "verified": true,
      "author": "DEFH13",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "Four Stars",
      "text": "It's perfect but the assembly was a bit difficult, especially the handle grips.",
      "rating": 4.0,
      "verified": true,
      "author": "098",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Beware of the FOAM COVERS for the Handle Bars",
      "text": "My wife is currently pregnant with our 2nd baby. She uses it daily and it has improved her energy levels. Overall, it's not that difficult to assemble and is a good small size for a living room. However, the only issue I have is with the foam covers. They make it very difficult to put the foam covers on the handle bars. It took me an hour to get both on and I even got blisters!",
      "rating": 3.0,
      "verified": true,
      "author": "Michael Tran",
      "helpful_votes": 2,
      "publication_date": 20140730
    },
    {
      "title": "Simple ... Basic .... Works just fine",
      "text": "Very simple Very basic Works just fine I use it rotating with a few other pieces of equipment ....... A good buy in my opinion",
      "rating": 4.0,
      "verified": true,
      "author": "BuRu",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Super Work Out for CHEAP!!!",
      "text": "Super easy to assemble! Previous reviewers gave some good advice! Use a little cooking oil to slide the rubber covers onto the handles! Worked GREAT! I am used to the heavy duty steppers & was worried that I would dislike this little cheap one...this is not the case! This little stepper gives a tough workout! How nice to not have to hit the gym & hang out with the sweaty people & loud TV's! I stay home with my puppy & watch TV & step away! I HIGHLY recommend this little powerhouse!",
      "rating": 5.0,
      "verified": true,
      "author": "goldilocks",
      "helpful_votes": 6,
      "publication_date": 20120329
    },
    {
      "title": "Cheap, gives you a workout",
      "text": "I will start by saying that the product arrived broke. I was still able to put it together as the part that is broken is the part that allows you to screw it in to base and also unscrew to unfold. I can't do that anymore. I bought this thinking that if I get a year use out of it, it is cheaper than a gym. I just wanted something to give me a cardio workout to help lose the last five pounds before my wedding. My legs are killing me after a ten minute workout. Consider the price and the use. For the price, it may be worth it.",
      "rating": 3.0,
      "verified": true,
      "author": "CAReviewer",
      "helpful_votes": 8,
      "publication_date": 20080613
    },
    {
      "title": "You get what you pay for .",
      "text": "Not very sturdy. Jerky motion of foot pedals. Would not purchase again.",
      "rating": 2.0,
      "verified": true,
      "author": "Diane Harrington",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Hard to beat this stepper for the price!",
      "text": "Excellent stepper for the price. Durable, easy to set up. Folds down easily and slides under my bed when not in use. Very good for home or office, exceptional workout stepper for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "johnFL",
      "helpful_votes": 2,
      "publication_date": 20160829
    },
    {
      "title": "A nice piece of equipment.",
      "text": "Easy to assemble and operate. It is small enough and lightweight to move around your home. An inexpensive but useful workout product.",
      "rating": 4.0,
      "verified": true,
      "author": "Kandyce P Keller",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Works great easy to assemble the only negative thing is inserting ...",
      "text": "Works great easy to assemble the only negative thing is inserting the rubber handle was difficult which took me a while to insert which I had to put baby oil and cut the rubber handle in half in order to insert to the metal handle. Overall it's worth it because the price is good, sturdy, easy to move around, no noise and been using it.",
      "rating": 4.0,
      "verified": true,
      "author": "Galahad Curry",
      "helpful_votes": 3,
      "publication_date": 20151220
    },
    {
      "title": "What's not to love!",
      "text": "Love everything about it...cost, space saving design, and function! Hoping to get my legs toned for the summer.",
      "rating": 5.0,
      "verified": true,
      "author": "Jgonz84",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Excellent Stepper, Excellent Price!",
      "text": "This is the best stepper I've used in this price range. No stress or tension on my knees as other brands have caused. Effective workout, sturdy, and I love the handle bars. Just awesome!!",
      "rating": 5.0,
      "verified": true,
      "author": "CB",
      "helpful_votes": 2,
      "publication_date": 20160109
    },
    {
      "title": "Good Product - But Beware of the Clunk",
      "text": "very nice product. easy to put together although the instructions seems to be off a bit. The only issue I have is as you are stepping, the steps hits atop of the foot bar as you ride it. So I hear clunk clunk with each step. I just try to avoid allowing the steps to hit while stepping up and down.",
      "rating": 4.0,
      "verified": true,
      "author": "Cameron Dill",
      "helpful_votes": 4,
      "publication_date": 20150506
    },
    {
      "title": "Perfect for a quick, intense workout!",
      "text": "Took awhile to find my correct setting but provides a great lower body workout w/excellent cardio if you step quickly. I was wanting to find a stepper that was similar to the stairs at my office that I used to climb for exercise. This works that way if you stand with your heels off the back edge on the balls of your feet!",
      "rating": 5.0,
      "verified": true,
      "author": "STEVE",
      "helpful_votes": 4,
      "publication_date": 20130422
    },
    {
      "title": "This is an awesome stair stepper",
      "text": "This is an awesome stair stepper, I love it!! Great workout & sturdy but small convenient size. Very easy to put together. I just left the foam grips off because they were difficult to get on but no big deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke H.",
      "helpful_votes": 2,
      "publication_date": 20180103
    },
    {
      "title": "Four Stars",
      "text": "ships quick , actually break a sweat 20- 30 min workout fits under bed with 3 \" bed risers",
      "rating": 4.0,
      "verified": true,
      "author": "Oso",
      "helpful_votes": 3,
      "publication_date": 20170612
    },
    {
      "title": "Better than expected",
      "text": "I was expecting one of those cheap models, but that is definitely NOT what I got. This is made with tubular steel, not the old \"closet pole\" stuff I expected. I have gained 100 pounds since my accident, and it holds over 200 lbs just fine. I'm sure I'll be able to shed those pounds now, I'd recommend one of these to anyone who can step up on a step stool.",
      "rating": 5.0,
      "verified": true,
      "author": "trid2bnrml",
      "helpful_votes": 5,
      "publication_date": 20120318
    },
    {
      "title": "Best lil stepper I’ve tried sweating like the stair master 👌",
      "text": "Did a 20 minute workout and I can’t tell you how great it felt to sweat this much in a quick workout! Worth it! And I wish I would have ordered it at the beginning of quarantine!!",
      "rating": 5.0,
      "verified": true,
      "author": "Allen Cambell",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Broke after less than 2 months!",
      "text": "I agree with the other reviews that it was good while it lasted... I weigh 130 lbs so I'm well below the weight limit and it still broke! I use it on the more high impact/fast level and the metal gets very hot, I heard a snap and the metal on the front basically broke where it was welded on both sides! This was after about 25 minutes of use. I'm going to try and patch the cracks w/ epoxy and see what happens. I don't recommend using this on fast setting for more than short periods of time no matter what you weigh. I doesn't hold up and was cheaply made.",
      "rating": 1.0,
      "verified": true,
      "author": "jenn",
      "helpful_votes": 21,
      "publication_date": 20120531
    },
    {
      "title": "A Home Run!",
      "text": "This stepper is everything I hoped for, well made, extremely compact, quiet, and gives me a good workout. I'm very impressed. And a stairmaster is $4300 dollars??? Buy the Spacemate instead, and with the money you save, take a trip to europe, buy a scooter, re-carpet your house, or just go around the neighborhood laughing at people who bought something else!",
      "rating": 5.0,
      "verified": true,
      "author": "PaulTD",
      "helpful_votes": 4,
      "publication_date": 20120510
    },
    {
      "title": "Great workout !",
      "text": "Enjoying this a lot. Well made, easy assembly. Works great !",
      "rating": 5.0,
      "verified": true,
      "author": "pcbeachgal",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Just as expected!",
      "text": "Bought for my Dad to help strengthen his legs. He uses it daily. It reviewed better than the costlier ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Easy to collapse and store",
      "text": "Easy to collapse and store. It keeps track of your steps, calories burned, and the time you've been working out. It's a great resistance stepper, while accommodating small living spaces.",
      "rating": 5.0,
      "verified": true,
      "author": "charity kenemore",
      "helpful_votes": 2,
      "publication_date": 20160216
    },
    {
      "title": "Complement your daily routine",
      "text": "My wife completely loves this product, very easy to use and relatively inexpensive. My wife and I go for a 60-min walk together outside (we live in Phoenix so we can go every single day) and when we return she finishes her daily routine with a 20-30 min session with the Stamine SpaceMate Folding Stepper. It is small and light and can be stored in small places. The quality seems decent.",
      "rating": 5.0,
      "verified": true,
      "author": "Felaya",
      "helpful_votes": 0,
      "publication_date": 20121213
    },
    {
      "title": "Stepper works great",
      "text": "This stepper works perfectly, is easy to assemble, and does not take up much room.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Cooke",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "is easy to move around",
      "text": "This small unit was exactly what I was wanting. It takes up very little space, is easy to move around, and the tension is easy to adjust.",
      "rating": 5.0,
      "verified": true,
      "author": "Marshak",
      "helpful_votes": 2,
      "publication_date": 20160229
    },
    {
      "title": "I do not recommend it.",
      "text": "The shocks are not durable. The first one I ordered more that 4 months ago the bottom of the left shock torn apart in 3 months. The second unit I received, right away the left shock is weak 15 min. into the exercise it is just getting weaker and weaker. If you are a seriously workout person, I do not recommend it.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160423
    },
    {
      "title": "SCREEN AND SENSOR DO NOT WORK",
      "text": "I SENT AN EMAIL LAST WEEK OR TWO STATING THAT THE SCREEN AND/OR THE SENSOR IS NOT WORKING CORRECTLY. IT DOES NOT TURN ON AUTOMATICALLY WHEN I START STEPPING, AND THE COUNTER DOES NOT GO UP. THE MACHINE ITSELF IS GREAT, I DONT WANT TO RETURN IT..I JUST WANT THE PART REPLACED THAT IS NOT WORKING CORRECTLY, AND HAVE NOT GOTTEN A RESPONSE. PROBABLY WONT DO BUSINESS WITH AGAIN IF PROBLEM IS NOT CORRECTED.",
      "rating": 2.0,
      "verified": true,
      "author": "Freising",
      "helpful_votes": 0,
      "publication_date": 20130208
    },
    {
      "title": "Didnt last long",
      "text": "one of the shocks lasted about two weeks, emailed the company, no response.",
      "rating": 2.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Good Product So Far",
      "text": "I got my stepper in the mail about a month ago. So far, it has proven to be a pretty good product. Both me and my husband have used the product without a problem (we weigh 130 and 190 respectively). I love steppers and find that it gives me a similar workout to what I can get at the gym, without traveling. My only complaint is that the steps are on an incline, unlike gym steppers, so sometimes when i finish my workout my feet hurt in odd places. Besides this, it was well worth $120. That's about 2 months of a gym membership, so if it lasts longer than that, it will turn out to be a great value.",
      "rating": 4.0,
      "verified": true,
      "author": "dorigen",
      "helpful_votes": 0,
      "publication_date": 20080907
    },
    {
      "title": "Works Great",
      "text": "The machine is sturdy and works well. Needed customer support for one thing and they were great. It was just one of the boots for the leg, it split when i was putting it on. They sent me a new one no charge within a few days. The machine works well, my wife uses it mostly and she loves it she is on it everyday. Stores well either folded or it's easy enough to just move it in a corner. Good machine, Good price. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary K",
      "helpful_votes": 5,
      "publication_date": 20090403
    },
    {
      "title": "better than expected",
      "text": "This item works great. It was easy to assemble, but be sure you READ all the directions so you know how to slide the foam handles on. I assumed i could do it and struggled. I decided to use baby oil which it states NOT to do. After I FINALLY got them on and finished reading the directions, it mentions to use soap to get the bars wet to slide the foam handles on. lol!! works well and easily folds down. has 1 wheel on it to make it a bit easier to move around for storage. it has a counter and timer on there as well that seem to work.",
      "rating": 5.0,
      "verified": true,
      "author": "AlexandraN",
      "helpful_votes": 5,
      "publication_date": 20110306
    },
    {
      "title": "GREAT machine for the right person.",
      "text": "GREAT little machine. I use it everyday while watching a TV program and the time flies by. Keep in mind if you are heavy ( i would guess over 160 lbs.) this machine is probably not a good choice. It is not \"gym\" quality but I would highly recommend anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "barbara",
      "helpful_votes": 0,
      "publication_date": 20150218
    },
    {
      "title": "great before it broke",
      "text": "The stepper worked well for the first week. Unfortunately, the right piston broke after the first week. Other reviewers described this problem. I only needed the exercise equipment for a few months so for $100 it was worth the gamble. I am still using it, but now it is clumsy and awkward. If you need a temporary exerciser and will not be upset if it breaks, this stepper is a fair deal. Before the stepper broke, it was a good piece of equipment",
      "rating": 3.0,
      "verified": true,
      "author": "Christie",
      "helpful_votes": 11,
      "publication_date": 20080525
    },
    {
      "title": "Great buy!!!",
      "text": "It shipped faster than expected. I really like it! Folds super easy! I put it under my bed then roll it out every morning to get a little workout in while watching the news. Great buy I will definitely be recommending this to friends and family.",
      "rating": 5.0,
      "verified": true,
      "author": "Sylissa",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Usage",
      "text": "I like the easy assembly except placing the foam handle bars....they did not go on all the way and I end up cutting off the tops so I could use the stepper. The product is a good, sturdy one.",
      "rating": 4.0,
      "verified": true,
      "author": "Dora Balzer",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Good product so far...",
      "text": "Good product so far. The grips during assembly were a bit hard to maneuver. But functionally of it suits the purpose. I would recommend for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Lewtoncog1773",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "love this!",
      "text": "Takes up little space, has a timer on it and it counts your steps, or your calories burned. If you use it 1 minute a day, you can tell a difference. I love this. I just use it when I pass by it for 60 seconds and I feel a spring in my step the next day. You can also adjust the resistance. Nice sturdy machine! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "meg.miller",
      "helpful_votes": 3,
      "publication_date": 20110816
    },
    {
      "title": "Wow",
      "text": "Wow it is nice. It get me sweeting in 5 min and tired in 10 min it's hard but it's what made me lose weight. I still have it and it has been 2 years and it still work like the first day I got it .",
      "rating": 4.0,
      "verified": true,
      "author": "ANM",
      "helpful_votes": 6,
      "publication_date": 20140520
    },
    {
      "title": "Overall good product",
      "text": "A little wobbly but not too bad. Even on the lowest resistance level it's pretty tough. Not hard to assemble.",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Broke after 30 minutes total use",
      "text": "Used if off and on for a couple of days and a bolt broke rendering it useless. Where is the quality control? I am returning it for a refund and will look for something else. I loved it up until this point. :(",
      "rating": 1.0,
      "verified": true,
      "author": "JLB",
      "helpful_votes": 6,
      "publication_date": 20130330
    },
    {
      "title": "Not what I Thought.",
      "text": "Hard to balance. Not made for a person over 5' 5\". I will probably donate it. there are smaller people that can use it.",
      "rating": 3.0,
      "verified": true,
      "author": "Bruce",
      "helpful_votes": 2,
      "publication_date": 20170507
    },
    {
      "title": "This product was not the best purchase I have ever made with regard to gym ...",
      "text": "This product was not the best purchase I have ever made with regard to gym equipment. Very difficult to use. Parts and pieces would come off while trying to use it. Ended up giving it away.",
      "rating": 2.0,
      "verified": true,
      "author": "Brenda Sindorf",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "Fantastic",
      "text": "Easy to set up. Easy to store. Great workout !",
      "rating": 5.0,
      "verified": true,
      "author": "Dominique",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Set up is easy peasy",
      "text": "The instructions are easy to set up and the handles were easy to put on and I’ve felt great using the stepper",
      "rating": 5.0,
      "verified": true,
      "author": "Dale Frances Dykstra",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "I really like my workout on this machine",
      "text": "I really like my workout on this machine. Its a good workout at any level. It was easy to assemble and easy to put away. The only downfall is that it squeaks at each step",
      "rating": 4.0,
      "verified": true,
      "author": "Diane Duarte",
      "helpful_votes": 2,
      "publication_date": 20150912
    },
    {
      "title": "NICE CONVENIENT STEPPER",
      "text": "This is a well made stepper. the welds look good, it folds up nicely in a small package for when it is not being used. It is so easy that you will put it away when not using it. The handle gives several options for where to put your hands during your workout. Good product!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Swiatek",
      "helpful_votes": 0,
      "publication_date": 20140318
    },
    {
      "title": "It is very stable and gives a good cardio workout",
      "text": "The folding stair stepper is all an old man could want. Learning to adjust the resistance was all it took and that was quick. It is very stable and gives a good cardio workout. Tom Schulz",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Schulz",
      "helpful_votes": 6,
      "publication_date": 20170213
    },
    {
      "title": "rrf",
      "text": "This unit has been working well;nice size does not take up a lot of space. Works the lower back well,helps relieves/remove lower back minor pain. I'm not an athlete, but i was when younger. Appears to be good for a moderate work out, will it last? I don't abuse it. I would question use for more than moderate applications. At this price - aggressive use could be a good deal, but I would suspect replacement would be required at some point. Amazon responded and shipped - excellent as expected.",
      "rating": 5.0,
      "verified": true,
      "author": "RRF",
      "helpful_votes": 2,
      "publication_date": 20091224
    },
    {
      "title": "Well satisfied",
      "text": "This stepper is well worth the money, and after shopping locally, I find this item to be very well made and sturdy. I don't find it to be as compact when folded as I had hoped, but realize that to make it more compact would require sacrificing some of the sturdiness so we leave it up most of the time. And of course leaving it up is a constant reminder to use it, which after all, is the reason for having it. I would definitely recommend this stepper to anyone.",
      "rating": 4.0,
      "verified": true,
      "author": "N. H. Miles",
      "helpful_votes": 2,
      "publication_date": 20100121
    }
  ],
  "product_meta": {
    "title": "Stamina 40-0069 SpaceMate Folding Stepper",
    "description": "Burn calories with a low-impact workout that's easy on your joints. This light, compact exercise stepper provides a calorie-burning, cardiovascular workout that tones the calves, buttocks, thighs and hips. Plus, it folds to store easily under a desk or in a closet - great for use at home or the office.\n\nAMAZON.COM\nWith the pull of a pin, this lightweight stepper folds for storage in a closet or under a bed and can be rolled around on built-in rollers. It features a battery-operated electronic monitor displaying steps-per-minute, total steps, workout time, and calories burned. Two hydraulic cylinders provide a smooth stepping motion. Wide, textured pedals keep feet secure. Foam-covered handlebars offer comfortable gripping. Rubber floor protectors safeguard a workout area and prevent skidding. Assembled, the 45-pound stepper is 30-1/4 inches long x 16-1/4 inches wide x 54-1/2 inches high. Folded, it is 38-1/2 inches long x 16-1/4 inches wide x 9-1/2 inches high. The stepper assembles in less than 10 minutes (instructions included). The sturdy steel frame carries a one-year warranty against defects, with parts warranted against defects for 90 days.",
    "rating": 4,
    "feature_bullets": [
      "Independent design stepping action",
      "Two adjustable-resistance hydraulic cylinders provide a smooth stepping motion",
      "Foam covered handlebars for comfortable gripping",
      "Multi function monitor tracks number of steps per minute, number of steps during the workout, workout time and calories burned",
      "Folds for storage",
      "Weight Limit: 250 lbs."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "30.25 x 16.25 x 54.5 inches; 41 Pounds",
      "Item model number": "40-0069",
      "Date First Available": "December 21, 2002",
      "Manufacturer": "Stamina",
      "ASIN": "B000JC4OXS",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Exercise & Fitness",
      "Step Machines",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Cardio Training"
    ],
    "price": ""
  }
}