{
  "website_summaries": [
    {
      "verdict": "Draws a lot of praise for its elegant, brass look. Just make sure you wash off any rubber residue before use.",
      "pros": [
        "Heavy-duty brass construction that looks great",
        "Rustproof design",
        "Made in the USA",
        "Has 18\" blade, which is easy and inexpensive to replace",
        "Good build",
        "Fits on all Ettore REA-CH extension poles"
      ],
      "cons": [
        "Some buyers say that this model leaves streaks on windows or black marks on walls",
        "Make sure you wash it well before use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Almost perfect",
      "text": "A very nice squeegee but left black marks on the wall adjacent to the mirrors that I cleaned. I advise that you wash the rubber before you use it as there's a lot of black residue on the new squeegee",
      "rating": 4.0,
      "verified": true,
      "author": "Len in Florida",
      "helpful_votes": 8,
      "publication_date": 20180723
    },
    {
      "title": "THE BEST SQUEEGEE IN THE WORLD!",
      "text": "After owning a 16 inch Ettore Brass Squeegee for 30 plus years and installing about 5 replacement rubber packs, I bought the new larger 18\" and it is still the incredible quality brass. I will still use the 16 inch for smaller windows since it is still in fantastic shape. These Ettore brass squeegees are the best in the world, and I highly recommend them for anyone that wants picture perfect windows with no streaks or after marks like most of their competitors! Amazon sells the replacement rubber packets for $2.98 and I have found, depending on use, they last several years!",
      "rating": 5.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 10,
      "publication_date": 20160604
    },
    {
      "title": "Nice Clean Windows!",
      "text": "I love Ettore products for cleaning windows and mirrors. I purchased the 18 inch because I have large windows and sliding glass door windows. This size makes for fewer passes over the glass surface than a 12 inch. It is very well made and durable. I would recommend this to anyone who likes or dislikes cleaning windows! It saves a lot of money from using paper towels to clean windows.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie Day",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Quality Tool",
      "text": "Nice tool. Works as it should. I should have bought a shorter one for smaller windows but that's my fault. Works great on all windows., just easier for me on larger windows..",
      "rating": 5.0,
      "verified": true,
      "author": "iTransporter",
      "helpful_votes": 3,
      "publication_date": 20170720
    },
    {
      "title": "it is a very good quality for my party buses.",
      "text": "I own the #1 limo service in Los Angeles and my fleet of party buses are always looking dusty especially the massive windows. This squeegee is wide and does not leave a mark when I wipe the windows down before each trip. I have had many in the past and this one by far works so much better, fast and clean,",
      "rating": 5.0,
      "verified": true,
      "author": "EXECUTIVE LA LIMOUSINE",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Use it in the shower!",
      "text": "Yep, I use it for one purpose every day. We have a glass walled shower and when I shut off the water I run it quickly over the glass to keep the water spots from forming. It works perfectly well for that and only takes seconds. I heard about this from the Alison Rosen Is Your New Best Friend podcast (ARIYNBF) when they were chatting it up on a Thursday podcast. Gave it a shot and guess what? It does the trick!",
      "rating": 5.0,
      "verified": true,
      "author": "JVDUB",
      "helpful_votes": 3,
      "publication_date": 20150122
    },
    {
      "title": "Give Your Windows A Professional Clean!",
      "text": "I am a professional cleaning contractor. I purchased this squeegee to clean front entrance lobby windows, and it does an excellent job cleaning the soap off of the windows. My windows have that \"professionally cleaned\" look! The brass squeegee is very well made, and is weighty due to being well made. This squeegee will last a long time if it is taken care of. The rubber blade is easily, and inexpensively replaceable. If you want to give your windows a professional clean, then GET THIS ONE!",
      "rating": 5.0,
      "verified": true,
      "author": "katherine-w",
      "helpful_votes": 7,
      "publication_date": 20140806
    },
    {
      "title": "My go to squeegee",
      "text": "This is the only brand that does a great job for me. I have owned an Ettore squeegee in several sizes for more than 20 years. My 18 inch was starting to wear somewhat and I decided to invest in a new one. Does a great job with minimal streaks. I won't use any other brand!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary H Hogg",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "This has to be the best squeegee on the market. great price",
      "text": "This has to be the best squeegee on the market. great price! It will last you years and you can replace the rubber in the squeegee.",
      "rating": 5.0,
      "verified": true,
      "author": "Nadine Findley",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Excellent Squeegee",
      "text": "I have a number of different squeegees around the house, and this is by far the best one. I am seriously considering ordering more.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven D Heires",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Wide coverage",
      "text": "This worked awesome the first couple times then it smeared and left lines like every other one. I did like the wood coverage on it I just wished it was better",
      "rating": 2.0,
      "verified": true,
      "author": "Lizz",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Excellent Squeegee!",
      "text": "This squeegee is the best ever. It performs perfectly with no streaks. We have 5 by 5 windows which are difficult to wash. But with this squeegee, I didn't have to get up on a 10-foot ladder. Just put it on a telescoping pole and squeegee!",
      "rating": 5.0,
      "verified": true,
      "author": "G. Hammerstone",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Great squeege!",
      "text": "I have purchased many different squeegees and this one works the best. It covers a wider section and doesn't leave streaks.",
      "rating": 5.0,
      "verified": true,
      "author": "NCP",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Not the squeegee I was hoping for...",
      "text": "This squeegee arrived open. It left water behind every time, I am not sure if this has squeegee had been returned previously. I will also be returning it. The 12\" squeegee performed flawlessly. I have way too many windows to try this 18\" squeegee again.",
      "rating": 2.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Suberb quality.",
      "text": "Have used these in the past and will use in the future. Tried others but this one is the best!",
      "rating": 5.0,
      "verified": true,
      "author": "Mimi",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Great squeegee",
      "text": "Bought to take water off my glass shower door. Works Great",
      "rating": 5.0,
      "verified": true,
      "author": "Compshopper",
      "helpful_votes": 0,
      "publication_date": 20170603
    },
    {
      "title": "Good in granite",
      "text": "Work at a granite shop. I like the 18 inch length",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Top notch quality",
      "text": "Typical Ettore: solid construction, soft & effective squeegee rubber. What more can I say?",
      "rating": 5.0,
      "verified": true,
      "author": "Terks",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Speed tool for those bigger windows",
      "text": "Nice product that does the job quite well. I use it for the 8 4x6 foot windows in my sun room and it makes it quick and easy with no streaks and no problems at all. I don't use a handle with it - just the handle shank in hand and it gives a good feel and control.",
      "rating": 5.0,
      "verified": true,
      "author": "Cienega32",
      "helpful_votes": 0,
      "publication_date": 20150303
    },
    {
      "title": "Keeps our glass shower doors sparkling and spot free",
      "text": "The squeegee is as good as they say. I keep it in the shower for use on the glass door. It is large enough that the door can be done in two quick swipes- so even my husband will take time to do it on a daily basis!",
      "rating": 5.0,
      "verified": true,
      "author": "Indiana Girl",
      "helpful_votes": 4,
      "publication_date": 20131228
    },
    {
      "title": "Five Stars",
      "text": "professional grade. no junk here. suggest a spare blade also.",
      "rating": 5.0,
      "verified": true,
      "author": "floridian",
      "helpful_votes": 0,
      "publication_date": 20170406
    },
    {
      "title": "Solid and well built",
      "text": "Great for keeping the mold and mildew from ever gaining a start in the shower. 18\" blade means a few quick passes and the shower walls are clean.",
      "rating": 5.0,
      "verified": true,
      "author": "GSXR",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Love this squeegee and service on delivery from vendor was ...",
      "text": "Love this squeegee and service on delivery from vendor was excellent and prompt. Move smoothly across glass, go tracks, and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160105
    },
    {
      "title": "Best squeegee I have ever used!",
      "text": "Had to stop in the middle of cleaning my large windows, to say this is the best Squeegee I have ever used!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda S.",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Five Stars",
      "text": "Works great to clean all the sliding doors. No atreaks",
      "rating": 5.0,
      "verified": true,
      "author": "Ginger Hooper",
      "helpful_votes": 0,
      "publication_date": 20161120
    },
    {
      "title": "This squeegee worked like a charm",
      "text": "This squeegee worked like a charm. Using a solution of water, vinegar and dish soap, it removes the solution in one pass and does not leave streaks.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve B",
      "helpful_votes": 0,
      "publication_date": 20150705
    },
    {
      "title": "Five Stars",
      "text": "The Ettore is the only one to buy. The rest are junk!",
      "rating": 5.0,
      "verified": true,
      "author": "Megan V Davis",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "We have a big glass wall in our shower. ...",
      "text": "We have a big glass wall in our shower. This large and efficient squeegee makes keeping it spot-free so much easier than when we had a cheap little plastic one. Worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Filmstock",
      "helpful_votes": 0,
      "publication_date": 20150103
    },
    {
      "title": "Five Stars",
      "text": "Nice Squeegee works as it should, I used a light bulb changing pole fitted nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "jw",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "quality",
      "text": "exterior windows great rubber blade replace one I've used for 15+ years",
      "rating": 5.0,
      "verified": true,
      "author": "jrb",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Saves you $200.00 every time you use it",
      "text": "The Squeegee speaks for itself !!! You will not be disappointed !",
      "rating": 5.0,
      "verified": true,
      "author": "JPC",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "This size was perfect. Ettore is a quality product for the homeowner ...",
      "text": "I have large windows to clean in my house. This size was perfect. Ettore is a quality product for the homeowner and professional.",
      "rating": 5.0,
      "verified": true,
      "author": "Bradley K Carlson",
      "helpful_votes": 0,
      "publication_date": 20150324
    },
    {
      "title": "Five Stars",
      "text": "Top end squeeqee. Replacing one I bought thirty years ago",
      "rating": 5.0,
      "verified": true,
      "author": "titlemike",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Five Stars",
      "text": "This is fabulous. It holds it's shape and applies even pressure across the blade avoiding streaks.",
      "rating": 5.0,
      "verified": true,
      "author": "KittyK",
      "helpful_votes": 0,
      "publication_date": 20160309
    },
    {
      "title": "strong and stylish for glass shower wall cleaning",
      "text": "Works with one swipe. Clens 32x72 inch glass shower walls in 2 swipes.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20141029
    },
    {
      "title": "Finally found a good Squeegee.",
      "text": "Been looking for a replacement squeegee for a long time. Have brought a couple that were not good ones. They didn't lay flat on the window. I would always go back to my old one but it was falling apart. I check the reviews on this one and love it. It works just like my old one.",
      "rating": 5.0,
      "verified": true,
      "author": "THERESA EGGERS",
      "helpful_votes": 0,
      "publication_date": 20150621
    },
    {
      "title": "Best squeegee",
      "text": "These are the best squeegees made - have been using them for 20 years - could not find a replacement locally - have huge windows south facing with a view - these are the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat Cornelius",
      "helpful_votes": 0,
      "publication_date": 20130510
    },
    {
      "title": "Satisfied buyer",
      "text": "Ettore makes the best squeegees in my opinion, and the rubber is available separately when and if you wear out the original out.",
      "rating": 5.0,
      "verified": true,
      "author": "Ted Heithecker",
      "helpful_votes": 0,
      "publication_date": 20140912
    },
    {
      "title": "Perfect",
      "text": "While there may be other brands that do the same basic function, the Ettore equipment is top-notch and reasonably priced. Our windows look great!",
      "rating": 5.0,
      "verified": true,
      "author": "GoCougs!",
      "helpful_votes": 0,
      "publication_date": 20130703
    },
    {
      "title": "Recommend this brand!!",
      "text": "Replacing a 20 year old Ettore10018 Squeegee! You can't ask for more than that!!!",
      "rating": 5.0,
      "verified": true,
      "author": "gg",
      "helpful_votes": 0,
      "publication_date": 20160910
    },
    {
      "title": "Professional quality",
      "text": "Great, makes cleaning windows and mirrors a snap. This is professional quality and it shows when you use it. Go on Youtube and watch videos from professional window washers on how to use properly, you will never buy another bottle of windex ever. I use a bucket with warm water, about a 1/2 cup of white vinegar, and a thumbnail's worth of dish soap, works fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 2,
      "publication_date": 20150825
    },
    {
      "title": "Five Stars",
      "text": "It's the best thing I bought on amazon. I use it at work every day.",
      "rating": 5.0,
      "verified": true,
      "author": "MARIO JENKINS",
      "helpful_votes": 0,
      "publication_date": 20151021
    },
    {
      "title": "One Star",
      "text": "Did not work at all. Returned for a refund. Left and excessive amount of water on the glass.",
      "rating": 1.0,
      "verified": true,
      "author": "Dungeondog",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "my cheaper ones do better.",
      "text": "leave too many streaks in the windows, my cheaper ones do better.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael A Crawford",
      "helpful_votes": 0,
      "publication_date": 20151019
    },
    {
      "title": "Ettore Squeegees",
      "text": "See my review of the Ettore 8-inch squeegee. The only difference is the 18\" Ettore is solid brass and of a slightly heavier construction than the 8\" and 12\" models. It worked extremely well on our sliding glass doors. The smaller versions, 8\" and 12\" did well on the windows.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig in Florida",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "high quality",
      "text": "If you are going to clean windows you need a great squeegee. This is the one. Just buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "L&P",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Water Marks very visible.",
      "text": "Use it for shower, water marks all over the brass, looks old after a week's use.",
      "rating": 2.0,
      "verified": true,
      "author": "21gad",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Love this squeegee!",
      "text": "I bought this to use in our shower and this thing cleans the glass enclosure perfectly! It doesn't leave streaks or droplets of water anywhere, as long as you do a decent job of wielding it. I think I may have gone a little overboard in buying the 18-inch for the shower, but I only have a few swipes to do before I'm done. I may have been better off with a slightly smaller squeegee for the area around the shower door handle, but that was my mistake. This squeegee rocks!",
      "rating": 5.0,
      "verified": true,
      "author": "mhueima",
      "helpful_votes": 3,
      "publication_date": 20140513
    },
    {
      "title": "Great since June 2016",
      "text": "I bought this in June 2016 to squeegee our large glass shower doors and it still works great! We went through two other brands squeegee which didn’t always get the water off after one swipe.",
      "rating": 5.0,
      "verified": true,
      "author": "Renie",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "ANGLE OF HANDLE IS NOT PRACTICAL",
      "text": "I changed the handle up side down because We have to hold the handle rubbing on surface to clean right. Design problem!",
      "rating": 2.0,
      "verified": true,
      "author": "Iam",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Save time to clean",
      "text": "this thing is wider than other similar products on the market, save time to clean windows and mirrors. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jieun Lee",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Second one, love it",
      "text": "This is my second one, can't find my first. I think I must have lent it out to a family member and no longer housed here. Had to get another one as it works so well.",
      "rating": 5.0,
      "verified": true,
      "author": "Verne",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "What the pro's use!",
      "text": "Only buy the best when it comes to squeegees! This is it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jo Jo the Dogfaced Boy",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "High quality construction.",
      "text": "High quality. It works great for drying windows. The sturdy metal frame works better than others with plastic construction. The rubber edge is thick and sturdy too. This should last a long time. It connects and fits well with the Ettore handle for a longer reach.",
      "rating": 5.0,
      "verified": true,
      "author": "Twostory",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Makes window cleaning fun.",
      "text": "Makes window cleaning fun. Nice quality squeegee. Love the large size with my big windows.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Fontaine",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "I highly recommend this squeegee",
      "text": "The easiest way to clean windows for me is to use a squeegee, but not the type sold for cars. I just wipe and scrub my windows and use this squeegee for sparkling clean windows. I highly recommend this squeegee.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary E. Thomsen",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Great Squeegees",
      "text": "It does what it is supposed to do-- which in this case is clean the shower glass walls. I've only owned it for a week now, but having had 2 other Ettore squeegees, I know that they work well. Very good pieces of equipment. Update 4 years later: It's still going strong. Great squeegee!",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20141218
    },
    {
      "title": "pliable rubber makes for excellent drying",
      "text": "squeegee width of 18\" made short work of some very large windows. I was surprised to see no dripping off the ends or overlapping wet areas. Don't know whether its the type and pliability of the rubber or not but couldn't be more pleased with the results.",
      "rating": 5.0,
      "verified": true,
      "author": "Clarence",
      "helpful_votes": 16,
      "publication_date": 20110921
    },
    {
      "title": "Makes annoying tasks simple and easier.",
      "text": "This is what the professionals use. Friend recommended it and I'm super happy with it. Cleaning sucks, this makes it suck less.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Young",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Great product.",
      "text": "Squeegee works very well. I live in Arizona and have a lot of windows on my home so I needed a large squeegee to get them all down without spending an entire day on them. Very professional, I just need to work on my technique !!!! Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimbo",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "Ettpre squeegee",
      "text": "Works well as do all ettore priducts but a little pricy",
      "rating": 5.0,
      "verified": true,
      "author": "Tracey Miller",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Love the Ettore squeegees and have used them for over ...",
      "text": "Love the Ettore squeegees and have used them for over 20 years. Delivers a clear performance on glass as well as mirrors.",
      "rating": 5.0,
      "verified": true,
      "author": "Carey L. Douglas",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "Great for the shower",
      "text": "Bought this for the tile & glass in my shower. Works great to prevent spots & exess humidity.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott D. Larson",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Excellent product",
      "text": "Excellent product that actually works. I clean windows for a living and this product works for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Time911",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "If you want clean windows then this is the product for you",
      "text": "Wished I had found out about this product before. Try buffing up any smears with balled up newspaper This cleans windows great. Strongly recommend this product",
      "rating": 5.0,
      "verified": true,
      "author": "Trumper",
      "helpful_votes": 0,
      "publication_date": 20150326
    },
    {
      "title": "My windows never looked so good and I have used many different products to get ...",
      "text": "My friend had this squeegee and used hers before I bought it. I have huge windows that go 12' high by 3'. My windows never looked so good and I have used many different products to get this windows spotless. This squeegee has weight to it and glides so smoothly.",
      "rating": 5.0,
      "verified": true,
      "author": "Tayaa",
      "helpful_votes": 0,
      "publication_date": 20150511
    },
    {
      "title": "Nicely made, doesn't fit standard handle.",
      "text": "Well made but too bad it doesn't screw onto a standard handle.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike R.",
      "helpful_votes": 6,
      "publication_date": 20141010
    },
    {
      "title": "Excellet",
      "text": "Months later and it's working well, the brass finish has held up too. We use it in our shower everyday to dry the walls and glass. I only give 5 stars to exceptional products, this one is excellent.",
      "rating": 4.0,
      "verified": true,
      "author": "Nelson C.",
      "helpful_votes": 0,
      "publication_date": 20150626
    },
    {
      "title": "Best Brass Squeegee made.",
      "text": "Great for all of your glass cleaning needs. Leaves the windows and mirrors sparkling clean for months.",
      "rating": 5.0,
      "verified": true,
      "author": "longbayway",
      "helpful_votes": 0,
      "publication_date": 20150214
    },
    {
      "title": "A necessary home tool",
      "text": "Best squeegee for windows around the house. Ettore makes great products.",
      "rating": 5.0,
      "verified": true,
      "author": "michlind",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "Easy to use",
      "text": "Well made and easy to use. We have several large windows and others with old glass and I was very pleased at how well they cleaned up using the squeegee - no streaks.",
      "rating": 5.0,
      "verified": true,
      "author": "K in MC",
      "helpful_votes": 0,
      "publication_date": 20140607
    },
    {
      "title": "Five Stars",
      "text": "I love this, works great, better than anything else I have tried",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Shetter",
      "helpful_votes": 0,
      "publication_date": 20160325
    },
    {
      "title": "Love it!",
      "text": "Works great, top quality as expected from this brand. This igger squeege is amazing for windows of all sizes.",
      "rating": 5.0,
      "verified": true,
      "author": "Manzy",
      "helpful_votes": 0,
      "publication_date": 20150915
    },
    {
      "title": "Great at cleaning our shower",
      "text": "Great at cleaning our shower. It's well made, sturdy, and long enough that with a few swipes keeps our shower from getting spots from soap or cloudy from hard water.",
      "rating": 5.0,
      "verified": true,
      "author": "Teaching Mom of 3",
      "helpful_votes": 0,
      "publication_date": 20140907
    },
    {
      "title": "Ettore Squeeege",
      "text": "We got set up for all of the utensils. Real nice stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "M. J.",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "Very nice quality and does a great job",
      "text": "This is the one the Pro will use. Very nice quality and does a great job. Makes cleaning your windows inside and out a breeze.",
      "rating": 5.0,
      "verified": true,
      "author": "Gentleman Farmer",
      "helpful_votes": 0,
      "publication_date": 20150209
    },
    {
      "title": "It's a squeegee",
      "text": "Wipe down your boat, put it on a stick and push water out of a flooded garage, put it in your shower, nice quality rubber on the blade, works great.",
      "rating": 5.0,
      "verified": true,
      "author": "LtdSpd",
      "helpful_votes": 0,
      "publication_date": 20140321
    },
    {
      "title": "Fairly good",
      "text": "Rubber strip is not quite the quality that I would have liked, it still leaves a few streaks. Other than that, it's good.",
      "rating": 3.0,
      "verified": true,
      "author": "user_s",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "Great product..",
      "text": "I used mine for 20 years and it was time for a new one.. Still works great but since I live in Costa Rica, did not want to be without one.",
      "rating": 5.0,
      "verified": true,
      "author": "JRH",
      "helpful_votes": 0,
      "publication_date": 20140324
    },
    {
      "title": "Fabulous!",
      "text": "This works great in our newly installed shower with European shower glass. Definitely worth the the money. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140619
    },
    {
      "title": "I love it",
      "text": "Awesome! Streak free, making me want to clean the mirror and window glasses more often because this thing making the job piece of cake!",
      "rating": 5.0,
      "verified": true,
      "author": "Athena",
      "helpful_votes": 0,
      "publication_date": 20151029
    },
    {
      "title": "Brass",
      "text": "This is solid brass, high quality, so it will last a lifetime unless it gets pinched. It does a great job.",
      "rating": 5.0,
      "verified": true,
      "author": "roofit",
      "helpful_votes": 0,
      "publication_date": 20130812
    },
    {
      "title": "Looks great too.",
      "text": "The only squeegee I'll use in my shower. It doesn't leave black marks on grout and lasts for years. Looks great too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill J.",
      "helpful_votes": 0,
      "publication_date": 20141228
    },
    {
      "title": "Great Squeegee!",
      "text": "This is absolutely the best squeegee! I just use a vinegar and water solution. Makes window cleaning less of a chore.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon customer",
      "helpful_votes": 0,
      "publication_date": 20140822
    },
    {
      "title": "Not great for shower glass",
      "text": "Works pretty well. We bought it for the shower to finish squeegee'ing the glass quickly, but it's really too large for the shower. I'm sure it would be fine on a pole for outdoor use.",
      "rating": 3.0,
      "verified": true,
      "author": "FuzzyZ",
      "helpful_votes": 0,
      "publication_date": 20150504
    },
    {
      "title": "Very fast and effective.",
      "text": "Works great. A single swipe clears our shower glass. I would prefer that the finish be chrome to match the shower components.",
      "rating": 4.0,
      "verified": true,
      "author": "dp",
      "helpful_votes": 0,
      "publication_date": 20160108
    }
  ],
  "product_meta": {
    "title": "Ettore 10018 Solid Brass Window Squeegee, 18-Inch",
    "description": "Ettore’s Brass Squeegee is the original squeegee and the #1 choice of professional window cleaners in the world. The professional grade rubber blade is replaceable and guaranteed streak-free. This squeegee is also rustproof solid brass. Ettore squeegees can be used with either hand or combined with a REA-C-H extension pole for high reach window cleaning. This product comes in various sizes.",
    "rating": 4.7,
    "feature_bullets": [
      "18-inch Brass Squeegee professional quality",
      "Professional grade and replaceable streak-free rubber blade",
      "Fits all Ettore REA-CH extension poles for high reach cleaning",
      "The original squeegee; rust proof"
    ],
    "specifications": {
      "Product Dimensions": "6.75 x 19.5 x 1.5 inches",
      "Item Weight": "12.7 ounces",
      "Manufacturer": "Ettore Products",
      "ASIN": "B000BPC2OQ",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "10018",
      "Customer Reviews": "4.7 out of 5 stars290 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#43,621 in Health & Household",
      "Is Discontinued By Manufacturer": "No",
      "Volume": "3195.19 Centiliters",
      "Is Assembly Required?": "No",
      "Warranty Description": "Lifetime warranty.",
      "Batteries Required": "No"
    },
    "categories": [
      "Household Supplies",
      "Home & Kitchen",
      "Health & Household",
      "Squeegees",
      "Cleaning Tools"
    ],
    "price": 14.86
  }
}