{
  "website_summaries": [
    {
      "verdict": "A dependable model that is built to last. You won't find a better choice on today's market.",
      "pros": [
        "Incorporates numerous features for an optimal workout, such as cushioned non-slip top, non-skid riser platforms and rugged construction"
      ],
      "cons": [
        "On the higher end of the price spectrum, but the price is inline with the top quality it provides"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Defective!!! NOT Safe...Two large indented lines on top of board.",
      "text": "This is the second time I have ordered this product and returned it because it is defective due to the two indented lines going down the entire length of the stepper !!! My friend has the same product and the surface is completely flat with more cushion It is very uncomfortable to step on and you can easily lose your balance . I have tried to get in contact with the manufacture but no response . I’m not sure if this is the original or a knock off...either way I am returning it. Hopefully the manufacture will get in contact with me if so I will update this review until then I give it a thumbs down!!!",
      "rating": 1.0,
      "verified": true,
      "author": "IJS ",
      "helpful_votes": 59,
      "publication_date": 20190114
    },
    {
      "title": "It is commercial grade/quality and size - just like the steps I remember",
      "text": "This is exactly the step I remember from fitness classes at the gym. It is commercial grade/quality and size - just like the steps I remember. It is just as described and pictured. I just used it for the first time and it worked exactly as I remembered. Some of the other steps for sale are much smaller, so if you're looking for the large step that you use at the gym, this is it.",
      "rating": 5.0,
      "verified": true,
      "author": "William I.",
      "helpful_votes": 33,
      "publication_date": 20170319
    },
    {
      "title": "Excellent. Be sure to get \"health club\" size.",
      "text": "excellent. Same as ones at gym. Fyi, the non \"step\" brands are not as good. Also, stepper come in two sizes. The \"health club\" size is the one people think of but it also comes smaller which makes certain exercises more difficult and can be dangerous if you wear a woman's size 7+ in shoes. I usually go for cheaper versions of things but I don't recommend it in this instance.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 23,
      "publication_date": 20180221
    },
    {
      "title": "The Step Original Aerobic Platform",
      "text": "Love this step. Wide enough in both directions to not tip up if you step on the edge. I did return another step which was not as wide and would on occasion tilt up to one side if I stepped on the edge. I saw this as a safety issue. No step should tilt up. I know it's important to watch your step but at times when your leaping from one foot to the other, you might step on the edge and you need a step that will not move. Maybe that's just me. I use 1 riser per side or a 6 inch rise to workout. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Stone",
      "helpful_votes": 16,
      "publication_date": 20180101
    },
    {
      "title": "Missing streaming video",
      "text": "The step platform is great! bigger than I thought it would be. Sadly I didn't receive digital streaming video. Amazon assistance told me to contact manufacturer. I did try to call manufacturer many times today. Hopeless now. I emailed them and hope I will get answer soon. SIGH!! Update: Manufacturer send me 2 YouTube links. It's not that good.",
      "rating": 3.0,
      "verified": true,
      "author": "Mimi",
      "helpful_votes": 12,
      "publication_date": 20171016
    },
    {
      "title": "but it is perfect being this big for easily doing workouts",
      "text": "This step is big! Much bigger than I anticipated, I didn't pay attention to measurements..but it is perfect being this big for easily doing workouts. Also, if you are a prime member, Amazon has step videos you can use with the step.",
      "rating": 5.0,
      "verified": true,
      "author": "Aimers",
      "helpful_votes": 16,
      "publication_date": 20170311
    },
    {
      "title": "Great addition to any workout",
      "text": "Very sturdy and convenient to store once you complete your workout. Steps can be loaded on one side to give a sloped bench. Great to use with weights or for cardio and core training. I even prop my feet up on it and do push ups and triceps work. Grear quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Just me",
      "helpful_votes": 16,
      "publication_date": 20160731
    },
    {
      "title": "Good workout bench",
      "text": "These are exactly what I was hoping for when I ordered them. Large, sturdy and built to last. They are almost exactly like the ones from my HIIT program. I purchased 2 of these so that I could practice the drills we do at home. After trying them out for a bit I am EXTREMELY satisfied with my purchase. UPDATE - After three uses I am not as satisfied and changing my review. During the third work out I started to get bubbling in the grip tape on one of my benches. The bubbles are huge probably about an inch in diameter and there are three of them.",
      "rating": 2.0,
      "verified": true,
      "author": "Mr. Cinnamon",
      "helpful_votes": 3,
      "publication_date": 20200218
    },
    {
      "title": "Identical to the one at the local fitness center",
      "text": "So, if it can stand up to heavy use there, it should last me a good, long time. I use only the two pairs of risers that came with it, as I don't need anything taller. If you're looking for the kind of platform onto which you can jump, this ain't it! The manufacturer explicitly warns you to step in a controlled manner. OTOH, jumping is the last thing this old dude needs. Just stepping up and down for a few minutes gets my pulse rate up nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Ervin Jr.",
      "helpful_votes": 4,
      "publication_date": 20190116
    },
    {
      "title": "Don't Waste Your Money!",
      "text": "What a waste of money. Item arrived with the \"premium nonslip comfort cushion top\" completely peeled off. It was a very thin nonslip layer (not at all cushioned), that was cheaply, and flimsily glued to the plastic platform surface. The nonslip layer will not stay on the platform, and will slip off while trying to use the platform. And without it, the plastic platform surface is full of glue, therefore rendering this device useless. All in all F-.",
      "rating": 1.0,
      "verified": true,
      "author": "Mac1",
      "helpful_votes": 3,
      "publication_date": 20191204
    },
    {
      "title": "Got product that didn't go through QA",
      "text": "Product does not feel sturdy when being used. Noticed that the board is missing 4 rubber pads (missing 2 on both sides) that are used to link with the feet, making it very noisy with feet attached. Overall can still use it, but feel I got a unfinished product. Especially at this price, is very disappointing",
      "rating": 1.0,
      "verified": true,
      "author": "Kova Nova",
      "helpful_votes": 6,
      "publication_date": 20181223
    },
    {
      "title": "Solid product",
      "text": "This product was an unexpected surprise as to how sturdy it is. It stays together, it has an excellent anti-slip surface that's the envy of regular stairways everywhere-including my own, is about as wide as most stairways-unlike competing products, and does not feel cheap whatsoever. The only, very minor things to note are that it does take up slightly more space than some competing products and, because it's a more solid product, it is a bit more of a challenge to move around.",
      "rating": 5.0,
      "verified": true,
      "author": "brifd1",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Not counterfeit, called and confirmed.",
      "text": "Due to concerns from other reviews, I called The Step. They then referred me to their manufacturer. I called and confirmed the listings on here, are true. They even stated they changed the design at some point which raised some people's concerns. Call for yourself and confirm.",
      "rating": 4.0,
      "verified": true,
      "author": "OptimusAmazonPrime",
      "helpful_votes": 2,
      "publication_date": 20200424
    },
    {
      "title": "Not what I expected",
      "text": "Received my stepper with air bubbles all over the top rubber mat that can not be replaced according to the packing. Don’t like that the steps don’t snap together just sits under making moving difficult",
      "rating": 1.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 3,
      "publication_date": 20200108
    },
    {
      "title": "This step bench is great!",
      "text": "This is similar to the step bench that most health clubs have. The only difference is the step surface. The step surface is smooth instead of grooved. During the COVID quarantine I was using a much smaller bench (in the pictures), and it was too small to do many basic step moves (turn steps, L steps, V steps). So I bought this step bench out of frustration with the smaller step bench. This was a great investment, since I am in a state that has an extended COVID home quarantine. The quality is solid, strong, the steps lock in place, the tread is smooth, provides good grip. I'm happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "MochaLatte64528",
      "helpful_votes": 2,
      "publication_date": 20200524
    },
    {
      "title": "Worst Construction Ever!!!",
      "text": "Do not buy this product! I have never seen one of these steps constructed with staples. The glue holding the rubber in place dropped all over the step. They knew the glue would not hold so they used staples and small nails to keep the rubber on. I received this product yesterday and the rubber is already torn in one corner. The pictures say it all.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 3,
      "publication_date": 20200602
    },
    {
      "title": "Good Quality",
      "text": "I really like this step platform, it works well for me on top of carpet. Feels stable, secure, and strong. I'm using this for physical therapy at home after a knee injury, working my way back up to using the damaged leg to climb stairs. I'm just using the top plank only as a short step, so I can't speak for adding the footers for height yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Becky S.",
      "helpful_votes": 2,
      "publication_date": 20190331
    },
    {
      "title": "Sturdy, stable, effective -- go ahead, buy the colorful one!",
      "text": "I think you could stand a large donkey on this, if it were agile enough. You can get whatever level of aerobic workout you want with this step. If you have issues such as iffy knees, the lowest height will still allow you to get exercise similar to walking. Do it long enough and it has a positive effect. I paid the extra for the colorful setup and am glad I did. Adds some cheer to the workout area!",
      "rating": 5.0,
      "verified": true,
      "author": "Gorman Pedigrew",
      "helpful_votes": 2,
      "publication_date": 20190330
    },
    {
      "title": "This thing is really huge!",
      "text": "I tested it for a few steps and feels very sturdy. My only complaint due to my own negligence is this stepper is really wide. I didn't read the dimensions before buying it. Several reviews mentioned the health club size being the best so that's what I ordered not expecting it to be so big. I'm six foot 2 inches tall 185 pounds and I don't see why anyone would need this thing to be so wide. It could be a foot less wide at least and would be just as good for me. You will have to slide it under a bed for storage. I think I'm going to return it for a smaller size.",
      "rating": 3.0,
      "verified": true,
      "author": "John M. Szczerba",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "and easy to stack",
      "text": "This well made stepper is very durable, handsome looking, and easy to stack. So far, it is very sturdy. I am elated that it actually is wider and longer than I expected. You can certainly get your workout on with this one! I actually have it in my dining area on a rug, so as to perform my exercise routine while watching tv.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. B",
      "helpful_votes": 5,
      "publication_date": 20170620
    },
    {
      "title": "Sturdy, Convenient, Many Uses",
      "text": "A great product for doing a variety of exercises. This can include aerobic stepping. You can also use it as a low bench for exercises with dumbbells, lying on back exercises with heavy elastic bands, or for stretching. The product is very sturdy and can support a lot of weight. It is easy to store and doesn’t take up a lot of space in the closet. Many thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Theyreplayinggoodstuff81@",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Difficult to set up and expensive to return",
      "text": "Very large and hard to set up, the risers didnt fully snap into place. Don’t buy unless you are sure you want to keep this. Amazon charged over $17 for return shipping even though it was on prime.",
      "rating": 2.0,
      "verified": true,
      "author": "Jaclyn",
      "helpful_votes": 5,
      "publication_date": 20190123
    },
    {
      "title": "Almost identical to the old-style Reebok steps used in clubs",
      "text": "This is the older style of step. It is club size and nearly identical to the ones Reebok originally designed for health clubs and gyms. However, nearly all clubs have switched to the newer Reebok design that self stores its own steps and is also sturdier. If you don't mind the 1990's style step, this works just fine. I have noticed that the rubber feet on the base don't have quite the \"grip\" onto the floor as the ones I used in the club, but if you are looking for a quality club size step that comes with two sets of risers, this will do the job.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Mat has bubbles in it.",
      "text": "Full of bubbles on one side. Overall ok product. Bubbles are annoying more than anything.",
      "rating": 2.0,
      "verified": true,
      "author": "Luis B.",
      "helpful_votes": 5,
      "publication_date": 20190329
    },
    {
      "title": "Great high tempo, varied workouts",
      "text": "Great to add variety to your cardio. I bought this and a medicine ball instead of a spin bike and wow did I make the right decision. I exercise a lot with weights, running, and rowing and bought this to add some cardio variety to my workout. In ten minutes I was maxing my heart rate and sweating a ton. Noise was a concern for me before making this purchase and I’d say noise varies depending on the exercise you do. Quick step taps are louder then other uses but sound wise it’s still manageable because its so easy to use in any room. 1 star deducted because I feel it’s overpriced.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "This is HUGE!!!",
      "text": "Im just starting step aerobics anf wanted a good sturdy board but THIS thing is massive. Takes up a ton of space plus the risers are large as well. Some of the step videos i follow use standard size so when i was following along i had to cross over the huge platform to get to the other end. For reference im 5'1\" 140lbs. Sent this back and ordered the circuit size. Still rating this 5 star bc it is well made and just not for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Haydee Hidalgo",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Used by workout professionals but too hard to move around. The Reebok Professional Step is much better if it meets your needs.",
      "text": "Personally, I like the Reebok Professional step better as it's much easier to move around and set for incline/decline. I got this because I needed to go higher than the reebok but I curse every time I have to move it, or change it to incline/decline.",
      "rating": 3.0,
      "verified": true,
      "author": "Dallas",
      "helpful_votes": 4,
      "publication_date": 20180126
    },
    {
      "title": "This thing is HUGE",
      "text": "I'm a big lady so I wanted a good size platform to work with, but this thing is massive. 2 people could stair step side by side its so long. Not exaggerating. It was really annoying that I had to be home when UPS dropped it off to sign for it. Dude, just set it by my door and take a photo like everyone else.",
      "rating": 3.0,
      "verified": true,
      "author": "Nichole Coleman",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Risers dont click into place; pain to move around.",
      "text": "I have wanted a \"real\" step for about 20 years, so I finally broke down and bought one. I have to say it is disappointing. It is fine and sturdy enough. I do like the length, but the fact that the risers don't click in to place is a real bummer. It is a nightmare to move around on carpet (we don't all have enough space to work out without moving items). It means stopping every time you need to set it up and take it apart.",
      "rating": 4.0,
      "verified": true,
      "author": "LB",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Quality product made in USA",
      "text": "I bought this to use as a bench for some of my free weight exercises, with the option to use it for step aerobics. It works well for both. The platform and risers are very sturdy and well made, and I am pleased to be able to buy and use a product made in the USA. Yes, there are less expensive imported products, but in my opinion, sometimes you buy cheap and you get cheap. I feel that this platform is well worth its price.",
      "rating": 5.0,
      "verified": true,
      "author": "Mamacat3",
      "helpful_votes": 2,
      "publication_date": 20200212
    },
    {
      "title": "I got Body Pump on streaming video and I'm good to go whenever I can make the time",
      "text": "I am stuck at home much of the time caring for my parents. My gym membership was languishing and I was losing ground with my fitness. I purchased this platform and the risers that match which are identical to what the gym uses. I got Body Pump on streaming video and I'm good to go whenever I can make the time. This platform is the exact size and quality of the ones at my gym. Not ready to give up my membership any time soon, but it could happen!",
      "rating": 5.0,
      "verified": true,
      "author": "Joanna V.",
      "helpful_votes": 2,
      "publication_date": 20170716
    },
    {
      "title": "It’s sturdy and stable",
      "text": "I like this stepper. It’s long enough so you don’t fall off the end. Two sets of risers come with it and you can use it with both, only one set of risers, or no risers. I bought it to do step aerobics at home instead of going to a class. It’s sturdy and stable. It’s a little bit heavy but that’s what makes it sturdy and stable, which is the most important thing. It seems to be a professional set.",
      "rating": 5.0,
      "verified": true,
      "author": "PB",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Very stable and slightly flexible",
      "text": "This is exactly what I hoped it would be. So easy to move, raise up and store. It is very large, over 40\" so you have plenty of room. It stays perfectly in place with rubber feet on bottom of the main unit and on the two additional steps. It has just a tiny bit of give when you step on it so it is not hard on the joints. Wish I had it a long time ago. Best of all it is made in the U.S.A!",
      "rating": 5.0,
      "verified": true,
      "author": "TigshadTabbyLove",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Look out '90s, I'm going to be stepping to the oldies!",
      "text": "I loved step aerobics back in the days of yore and have since tried many different types of cardio workouts. But, for me, they all lack the complete workout a good step routine can give. Don't waste your time on cheap steps; you really need one that is sturdy and long enough for stability and range of motion.",
      "rating": 5.0,
      "verified": true,
      "author": "Voracious reader",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Improved Version of the Original",
      "text": "Love my Step. Replaced my teal and pink from the nineties, and this is every bit as good - even better. The non-slip texture is actually better on this version. It’s not the lines you may remember that were uncomfortable doing bench work - huge improvement. So impressed, I bought two sets.",
      "rating": 5.0,
      "verified": true,
      "author": "Savvy Shopper",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "great for home gym...or lack their of",
      "text": "It is sturdy and durable. I replaced a smaller one that kept sliding. The only concern I have is that it is a little bulky to move around if you have to store it when not in use. One thing that would help is if the two step risers had a way to attach rather than just stack. U have to turn it upside down to carry it cuz the risers only fit together with a groove.",
      "rating": 4.0,
      "verified": true,
      "author": "sshetler",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Gym Quality Step Platform",
      "text": "I love my step platform. It’s the exact kind that I used to use in my step classes when I was a member at 24 Hour Fitness. The gym in my area closed permanently after being closed for a few months due to Covid-19, but who needs a gym when there are thousands of workout videos online! This platform is sturdy and easy to transport around my home as needed. I would recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda B",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "I like my step",
      "text": "I like my step. LIke the size , especially the width. However, the main reason I bought this, aside from size, was that all the descriptions said it had a cushioned top. I wanted some easy on my feet. It doesn't seem cushioned at all, indeed there are two long indented lines on top that hurt if I try to exercise with stocking feet. So, I wear cushioned sneakers inside. A little disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "wendy ronk",
      "helpful_votes": 4,
      "publication_date": 20180308
    },
    {
      "title": "Fantastic GIFT from my wife.",
      "text": "My wife wanted a stepper and I thought, why not get her the original \"The Step\" aerobic exerciser. There is a reason health clubs often use this product. It is durable and well made. My wife loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mickey Maguire",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Works Great!!",
      "text": "Love this!! I am now able to do more with my Cathe workouts. THese steps help give you a good workout. It is also great to add risers and use it as a work out bench as well. My husband was going to buy a bench and realized he could use this. I'm glad cause less equipment and it's something we both can use. Saved us space and money.",
      "rating": 5.0,
      "verified": true,
      "author": "D Lynn",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "The Original and Best",
      "text": "The original and the best. Paired with Gin Miller's \"Step Reebok The Workout\" is killer, and Cathe Freidrich's weight workouts will get you in shape.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200618
    },
    {
      "title": "Very happy with this step",
      "text": "I have taught step aerobics for 20 years. With the lock down I finally decided I needed to buy a proper step for my home use. This is excellent. As a fitness professional this has been exactly what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanette K. Kozak",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "A lot sturdier than I expected",
      "text": "I mainly needed something that was a lot more stable than Our DP step that we purchased years ago. This is sturdy enough to use as a bench for lifting (get a real bench if you're slinging massive weights) and I don't feel like on misstep is going to tip over the step. I also like that if I need more height I can just get additional risers or use the special risers if I need to incline/decline the step.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Thomas",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "BEST Step Platform - Bar-None",
      "text": "This Step Platform is one of the best I have ever used! I attend at \"Cross-Fit\" Step Class twice a week and this Platform as held up beautifully. I would recommend it to anyone who is looking for an excellent quality Platform. Everything detail from construction to packaging and delivery has been exceptional.",
      "rating": 5.0,
      "verified": true,
      "author": "ejd",
      "helpful_votes": 3,
      "publication_date": 20170626
    },
    {
      "title": "Get one!",
      "text": "I love this thing!!! Started using at my job's gym, except it was the colorful purple and teal one. Fell in love with it and ordered one for home. Got the black and grey since it was cheaper. Very sturdy! And I'm 275 pounds. And it came in excellent condition. Love listening to high intensity dance music while using it. And I keep it at the foot of my bed when not in use so it doubles as a cool little stepper to get in and out of bed too. I recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Sanders-W",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Top of the Line Step Platform",
      "text": "Great purchase. This is the top of the line step platform. Solidly built, it is just what you would get at the high end health clubs. You can buy additional risers so that you can make it as high as you need. The surface is non-slip so you don't have to worry when you step up or down about slipping off. Solid so you can use it while holding weights and it will support you. This is quality. Highly recommend it over some of the cheaply made ones that are available. This will last you a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce B.",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Not what I ordered",
      "text": "I ordered the step original with the cushions top. I received one with grooves. Not comfortable at all trying to do exercises laying or sitting on it. So disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Belinda Brine",
      "helpful_votes": 4,
      "publication_date": 20190418
    },
    {
      "title": "Bubbles under the mat",
      "text": "This step is stable and strong. But when it arrived, there were bubbles under the covering right where you will step a lot. I expect this to make it far less durable in the future. For an expensive piece of equipment like this. I want something which will last a long time.",
      "rating": 3.0,
      "verified": true,
      "author": "KH",
      "helpful_votes": 2,
      "publication_date": 20190915
    },
    {
      "title": "Exactly the same as the step used in our health club.",
      "text": "This is exactly the same as the step used at better health clubs. Exactly as expected. I'm over 230 #'s and go hard on this thing. Never any problems. This large size is the way to go. It is non-slip, remains stable. Smaller ones, more likely to \"miss your step\", slip. You may want to put an old yoga mat under-neath to protect your floor and even more non-slip. It is pretty big. However, if you want an aerobic step, (you wouldn't be reading this if you didn't) then this is the one you want...... Caught it on Amazon special so saved twenty bucks. Should have bought two of them. review by a fitness enthusiast.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon customer",
      "helpful_votes": 12,
      "publication_date": 20151225
    },
    {
      "title": "Great product for price",
      "text": "I got this step to replace the step I have had since the 80s which is much smaller. This is a good size step for the classes I fallow. It is sturdy and has worked very well, however I have yet to use the risers. The grip is nice and I like the quality. I would highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "So far so good.",
      "text": "I got the step yesterday just in time for my workout. They look great, it is the same as the ones in the gym, very sturdy on the wood floor, it didn't move an inch while I was jumping around like a gazelle. It felt firm for me. I am 5'8 tall and 160lbs. looks durable, very hard material.",
      "rating": 5.0,
      "verified": true,
      "author": "blackirish7",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Not gym quality",
      "text": "The picture makes these look like they are the same as what they have at my old gym (lifetime fitness). They aren't bad but the top is thin so after using a few times you can start to see the lines from the base. Its fine as a step but I was hoping to use as a mini bench for some dumbell excercises like I do at the gym but the indentations make that uncomfortable.",
      "rating": 3.0,
      "verified": true,
      "author": "Herb Berger",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "It's good quality",
      "text": "This is very solid and sturdy and it works great. Stays put on the floor while using it. The only complaint I have is that the base pieces do not click into place onto the top piece. It would make it so much easier to pick up and put away or to bring back out.",
      "rating": 4.0,
      "verified": true,
      "author": "Georgie",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Stability",
      "text": "I got this to use for the beach body transform 20 and it works so good! It's a little longer than the one they use, but it makes for a better workout!",
      "rating": 5.0,
      "verified": true,
      "author": "Kaitlyn Lehmann",
      "helpful_votes": 4,
      "publication_date": 20190204
    },
    {
      "title": "So far so good",
      "text": "It that it can hold weight. I have a roommate who is up in the 280 lbs plus; she sat in the middle of it, three risers high and it didn't brake. I was so worried. Happy so far.",
      "rating": 3.0,
      "verified": true,
      "author": "Left_T",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Sturdy",
      "text": "Bought this stepper after i had bought a cheaper brand which claimed to be sturdy enough for a 500lb person. Definitely too good to be true as no more than half of that limit used it. This stepper from the 1st step felt strong. Does not move but just for safe measure i place it over a matt.",
      "rating": 5.0,
      "verified": true,
      "author": "yasmin",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Great product!",
      "text": "This is a great buy! I just worked out for half hour and i had the feeling of running ten miles. I used light weights to do upper body also while using the stepper. This way you get entire body workout. I look forward to using it 2-3 times a week to keep my workout routine. Love it!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "GC",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "love this so far",
      "text": "This is def gym quality....love this so far. The rubber topping has just enough grip which I was afraid that it would be slippery from the photos. I have 6 risers under the platform for a 16\" step up and it's secure. I was worried it might be wobbly but I have jumped up on it and it was fine. I'm 165lbs for those pondering how much weight it can handle.",
      "rating": 5.0,
      "verified": true,
      "author": "Solé",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Love it",
      "text": "I love my new step. My old one is not as wide as this one and has the old time ridged rubber top. I love the width so no mater what moves I do I know I will be stepping up rather than miss it or catch the edge. I liked the option of colors rather than the grey. The one I got was a very pretty teal that comes with purple risers. I normally use 1 set of the risers but even with both sets of risers, this step stays put with no movement.",
      "rating": 5.0,
      "verified": true,
      "author": "avidreader",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Sturdy and worth the purchase",
      "text": "Looked at many and settled on this one because of other reviews of it being sturdy. Was unsure of how the top would be as it looked in pictures like it would be slippery but it's not at all. It's got good grippers on bottoms of the risers and the top so your feet won't move around. Worth paying a little more for a quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "It can hold 230lbs",
      "text": "I read the reviews before I purchased & didn't have high expectations. I actually wanted to purchase a different one but Amazon gave a 2 month estimated delivery for that one so I purchased this one. I am 222lbs. I was 230lbs when I purchased. It does give way a little in the middle, but it's clearly not going to break. I jump, etc on it & I feel secure. I have been doing YouTube step aerobics videos & stuff like push ups, burpees & bench digs. I bought a smaller Gold Gym step from Walmart & it was good, but the smaller size limited my movement. I love the larger size of this step.",
      "rating": 4.0,
      "verified": true,
      "author": "Axal12",
      "helpful_votes": 4,
      "publication_date": 20160306
    },
    {
      "title": "Happy but Not happy",
      "text": "Product has a air bubble under the no-slip mat and I haven't even used the product yet. Hoping it goes away in time. Just expected the mat to be flawless, but not up to expectations.",
      "rating": 3.0,
      "verified": true,
      "author": "Amber Shifflett",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Perfect Size",
      "text": "This Stepper is Perfect for me! The perfect size, and depending on my level of energy, I can take it down to the floor, or I can stack it up one level or to the max (two levels). It is lightweight enough to move around and store and it is heavy enough to stay in place and not move on you when stepping!",
      "rating": 5.0,
      "verified": true,
      "author": "Lex",
      "helpful_votes": 3,
      "publication_date": 20170114
    },
    {
      "title": "Great stability, height adjustments, length.",
      "text": "Great stability and length. Used as aerobic step with hand weights and seated body lifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 2,
      "publication_date": 20190103
    },
    {
      "title": "PERFECT!",
      "text": "Just like the originals back in the 90's when I was the \"Queen of Step\" (in my own mind anyway) I am so thrilled. Best thing I bought and the price is very reasonable for the quality and durability. I wish I had the colored version but it is totally not worth the the huge price difference just for a different color!",
      "rating": 5.0,
      "verified": true,
      "author": "xyz123",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "It really is Gym/Club SIZE",
      "text": "Its alot bigger and longer than I expected. Its approximately 34\" x 15\". Make sure you have a place large enough for it to fit. I ordered two more pieces to make it higher for my workout. I hope this will help my cardio.",
      "rating": 4.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 2,
      "publication_date": 20180625
    },
    {
      "title": "Bubbles in rubber coating",
      "text": "Will probably need to return due to 2 large bubbles in rubber top on platform.",
      "rating": 2.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Works OK but too expensive.",
      "text": "I weigh 235 and it bends a little when i step on it. So its not a sturdy as you would expect. For lighter people it should be OK. Way too expensive for a plastic step.",
      "rating": 3.0,
      "verified": true,
      "author": "Rummy",
      "helpful_votes": 4,
      "publication_date": 20170309
    },
    {
      "title": "Price increased drastically!",
      "text": "Well it’s great but not for the current price. I bought this one year ago for fifty bucks! What a rip off.",
      "rating": 5.0,
      "verified": true,
      "author": "mia",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Great purchase for home exercise!",
      "text": "My physical therapist recommended a stepper for leg strengthening after my knee surgery. Recently diagnosed with RA, I have made it a permanent part of my exercise routine. I shopped around and found this one to be a great buy with high quality. It is useful for a variety of leg toning, balancing, and strengthening routines. It is very well built, adaptable, comfortable to use, easy to store and set up or move. The black surface is strong and sturdy and does not flex or wobble, but is also very shock absorbing. It even has tiny grooves and a matt finish to make it slip-resistent. A great purchase at a good price!",
      "rating": 5.0,
      "verified": true,
      "author": "N. Y. Quentin",
      "helpful_votes": 0,
      "publication_date": 20150402
    },
    {
      "title": "Def need to buy an add on for height",
      "text": "It’s soft surprisingly long but also way to close to the ground I was hoping for the price it would be a little taller.. just bought the height stuff separately for another $18. Hopefully just one will do it...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "It is nice and wide to prevent my big feet from coming ...",
      "text": "I've had this product for a few months now and I would say that in the beginning it did appear to peel off from the top at first. I just think these are begin massed produced too quickly. I just pressed it down before really using it and the top has no lifted at all. It is nice and wide to prevent my big feet from coming off. I also use it as a bench for presses and ab work. It is sturdy and easy to assemble and disassemble. It would fit under a bed dissembled and under a crib assembled. You can order more pieces to raise it to your comfort level.",
      "rating": 5.0,
      "verified": true,
      "author": "BronxTeacher",
      "helpful_votes": 3,
      "publication_date": 20140714
    },
    {
      "title": "Great Step",
      "text": "Been using it for two weeks in a row and nothing to complain about. Sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "leticia",
      "helpful_votes": 2,
      "publication_date": 20181226
    },
    {
      "title": "It arrived used, and the plastic is not the best",
      "text": "They did not even remove the shipping label from the previous purchaser... In addition, it has signs of use, and those signs of use lead me to feel that the plastic this is made of is a bit too soft/thin. This is an expensive item so I was anticipating a bit more of a durable feel.",
      "rating": 3.0,
      "verified": true,
      "author": "ConsciousConsuma",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Gym quality",
      "text": "I bought a cheaper one from Walmart and it was so small , not sturdy and only 6 inches tall also buckled in the middle, I returned it and spent the extra money on this one and so glad I did I can do all kinds of different exercise with this one, without worrying about hurting myself on it. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Sturdy and well-made",
      "text": "Works great! I can do everything I want to with it when my workouts and in addition it's dirty enough to stand up to my toddler's playing on or around it.we bought ours at a discount in a damaged box and it worked perfectly fine no damage to the product.",
      "rating": 5.0,
      "verified": true,
      "author": "CD",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "The best ever!",
      "text": "The original Step is such great quality. If you are seriously looking to purchase a step, definitely go for this one. The durability cannot be matched by any other step out there. LOVE IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer A Ninham",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Works if you use it.",
      "text": "To lazy to exercise? Then it is useless. If you actually use it to step, it works perfectly. I actually prefer a milk crate with a ceramic tile glued to the top, less expensive and higher.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Thomas",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Bubbles on surface",
      "text": "I have had it for one day and the top layer is already starting to bubble up! Too expensive to be having this issue so soon!!",
      "rating": 1.0,
      "verified": true,
      "author": "Court78",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Put together improperly unsafe to use!",
      "text": "I am positive the steps are supposed to “snap” together and stay when picked up or moved. There seem to be stoppers or something missing. It’s unstable and the risers move.",
      "rating": 1.0,
      "verified": true,
      "author": "voracious reader",
      "helpful_votes": 3,
      "publication_date": 20180817
    },
    {
      "title": "The Original",
      "text": "Bought two of these for home use and for my husband to use with his clients. This is the same step used at gyms and fitness centers. Very happy with the purchase and a great way to stay fit while pregnant.",
      "rating": 5.0,
      "verified": true,
      "author": "star81",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Very well-made but very heavy, too",
      "text": "Very well made and does the job. But it is very heavy and somewhat difficult to manage after knee surgery. I plan to donate it to my physical therapy center when I am stronger and it won't be so awkward to transport. I could have used one half this big, too - be sure of the size you need before ordering.",
      "rating": 5.0,
      "verified": true,
      "author": "JRiley",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Love this Step!!!",
      "text": "WOW! Really nice! Bigger than expected (only because I did not pay attention to the dimensions), but excellent quality and exactly what I needed!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Worth it",
      "text": "Love this platform. Sturdy and similar to step platforms in the gym. I like that it is long so i am able to extend without fearing I'll trip off of the platform. This really helps since I am not going to the gym due to the pandemic.",
      "rating": 5.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "This step deck is by far superior to any of the others I tried",
      "text": "I bought a couple of cheap step decks and ended up returning them because they either felt unsteady or made a TON of noise when used. This step deck is by far superior to any of the others I tried! Initially I didn't want to fork over so much moolah for a deck, but now that I have, I wish I would have bought it sooner! It's the same one used in gyms. Loving it! If you are debating on other ones because of price, just save yourself some trouble and returns and buy this one. Happy stepping!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161104
    },
    {
      "title": "why pay so much for a step? because you ...",
      "text": "why pay so much for a step? because you get what you pay for. this seemed expensive until I saw the price for other steps that don't come close. This is built to last and is a tank.",
      "rating": 5.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 4,
      "publication_date": 20161208
    },
    {
      "title": "I was sent the wrong item",
      "text": "Instead of receiving the bench and six risers as advertised, I received one pair of risers only. What a waste of time! I am returning this incomplete order.",
      "rating": 1.0,
      "verified": true,
      "author": "Nimesh Goel",
      "helpful_votes": 2,
      "publication_date": 20200110
    },
    {
      "title": "Sturdy and stable",
      "text": "My husband broke his back and our bed was too high for him to get in bed I used this a a solid step up for him to get in bed. Very sturdy and long enough to give him a solid step up",
      "rating": 5.0,
      "verified": true,
      "author": "Judy",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Excellent product.",
      "text": "I use 2 steps on each side, and find the height for this first-time aerobic step exerciser very suitable. The product is sturdy and wide enough for this 105 lbs 5'5 61-year-old woman to develop a strong heart and flexible legs.",
      "rating": 5.0,
      "verified": true,
      "author": "Hope",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Very heavy duty",
      "text": "Very stable, with heavy duty material. I use while watching sports on tv during the winter.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich Hatfield",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Buy them on sale!",
      "text": "I bought two (1 for my trainer). I am pleased with them. I workout in the garage and they don’t move. No bubbles or other defects . I bought them for than $99. Watch the prices.",
      "rating": 5.0,
      "verified": true,
      "author": "dm",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Quality craftsmanship",
      "text": "I started using this about a week ago. Sturdy and well made. Great value for the price. Made in USA 🇺🇸",
      "rating": 5.0,
      "verified": true,
      "author": "It's just me",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Just like the Gym's",
      "text": "Fantastic; exactly as advertised. I work out with LM Body Pump and Body Step online streaming, and wanted to do it at home. I ordered the colored one with the online workout because it was cheaper; and it's just like the gym ones, precisely what was needed. Note---if you want a smaller platform, make sure you get The Step that's labeled \"circuit.\"",
      "rating": 5.0,
      "verified": true,
      "author": "ACE SUPERSTAR",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Sturdy",
      "text": "This step is very sturdy. I use it on carpet and it does not slip. I got extra risers to also use it as e bench. Very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Great quality product!",
      "text": "This is just like I was using in the gym. It is very sturdy and great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Sanderson",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "This is a great stair step platform.",
      "text": "This is a great stair step platform. Very sturdy. I would just be careful that you be sure to get a new platform (with risers) and that you get exactly what you order.",
      "rating": 5.0,
      "verified": true,
      "author": "sally",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Perfect size!",
      "text": "Very happy with my purchase! The step is a nice size and stable. The fact that it includes the additional risers is great. Again, very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "BGG2003",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Great quality, sturdy step!",
      "text": "I love this stepper! It is JUST like the one's I use at LA Fitness when I work out there. This is sturdy and strong. In the instructions, they recommend never stacking it higher than 3 (I think?) platforms high. But I stack it up to 5 or so and jump onto it and haven't had a problem with stability at all. This is great for use as both a step and a bench! As soon as I can order a second one I'm going to so I can do deeper squats.",
      "rating": 5.0,
      "verified": true,
      "author": "AGirl",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Basic Stepping Platform",
      "text": "It's a stepper. Not much I can say. Works as well as you want it to work if you use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cyn",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Heavy Duty Gym Quality",
      "text": "This is one you see at the gyms where heavy use is the norm. I don’t jump up and down on it but I use the middle and not problem.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Carman",
      "helpful_votes": 0,
      "publication_date": 20200225
    }
  ],
  "product_meta": {
    "title": "The Step Original Aerobic Platform for Total Body Fitness – Health Club",
    "rating": 4.7,
    "feature_bullets": [
      "Made in the United States from durable, recyclable high-density polyethylene.",
      "Includes full-size (43” L x 16” W x 4” H) grey aerobic platform and 4 original black risers.",
      "Platform features premium nonslip, comfort cushion top and supports up to 350 lbs.",
      "Four nonskid feet on each riser and platform prevents sliding or scratching floors.",
      "Vary workout difficulty by adjusting platform height from 4” to 6” to 8” using risers."
    ],
    "specifications": {
      "Date First Available": "January 22, 2020",
      "Manufacturer": "The Step",
      "ASIN": "B0844C57ZV",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Accessories",
      "Exercise & Fitness",
      "Sports & Outdoors",
      "Step Platforms",
      "Tools & Home Improvement",
      "Sports & Fitness"
    ],
    "price": 99.99
  }
}