{
  "website_summaries": [
    {
      "verdict": "Panasonic's least-expensive DVD recorder is a good choice for basic TV and video archiving.",
      "pros": [
        "Relatively inexpensive",
        "excellent recording quality in XP and SP modes",
        "simultaneous recording and playback with DVD-RAM",
        "Flexible Recording mode"
      ],
      "cons": [
        "Somewhat difficult to use",
        "no IR blaster for cable box control",
        "soft recording quality in EP mode",
        "no FireWire input"
      ],
      "aspects": {
        "Design": 5.0,
        "Features": 7.0,
        "Performance": 7.0
      },
      "publication_date": 20040831,
      "rating": 6.2,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "I bought this DVD recorder used. There is nothing ...",
      "text": "I bought this DVD recorder used. There is nothing wrong with the machine. The problem is with the remote control but thankfully, I have another remote control from my previous DVD Recorder which it happens to be the same brand. and it works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Elvia G. Ickes",
      "helpful_votes": 2,
      "publication_date": 20150318
    },
    {
      "title": "Didn't work and it cost me $$ just to send it back",
      "text": "The product was sold in \"very good\" condition. It arrived without a power cord. Once I got a power cord the unit played back too fast making all the voices sound like the chipmunks. Then Amazon said it was my responsibility to pay to return it. Shipping was $22.00. Can anyone think of a reason to think my rating is inaccurate?",
      "rating": 1.0,
      "verified": true,
      "author": "JimH-DC",
      "helpful_votes": 3,
      "publication_date": 20130728
    },
    {
      "title": "Fantastic! So simple, even a nearly blind man can use it...",
      "text": "This is one of the best DVR machines out there. Enough bells and wistles to put you in technogeek heven, yet simple enough for someone like me who is severely visually impaired to use and enjoy. All you really have to do is put in a blank disc, hi the record button, and hit the open/close button on the remote when you are done. The greatest thing I like about this machine is that even in EP mode, the recordings you get from it literally blows VHS out of the water. A fantastic machine at a very low price. GET IT!",
      "rating": 5.0,
      "verified": true,
      "author": "David E.Finley",
      "helpful_votes": 9,
      "publication_date": 20041209
    },
    {
      "title": "Panasonic DVD recorder.",
      "text": "I have 6 of these DVD recorders. It is so user friendly. Panasonic sent me a disc update to increase the speed of the drive to 8X. No one was selling the 4X discs anymore. I was in a total panic. I tried a Toshiba DVD recorder and it took a rocket scientist to figure it out and I still had major problems. Needless to say, I returned it. I highly recommed a Panasonic.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn B. Arnado",
      "helpful_votes": 2,
      "publication_date": 20070512
    },
    {
      "title": "Quite Reliable!",
      "text": "I used this extensively for 10 years (March 2005-April 2015). It was so reliable that I am picking up another used one. (FYI, mine says it is the DMR-E55 without the S--I don't know what the difference is.) I often used the DVD-RAM to record shows over and over again.",
      "rating": 5.0,
      "verified": true,
      "author": "WILLIAM P GRIFFIN",
      "helpful_votes": 0,
      "publication_date": 20150507
    },
    {
      "title": "No hassle return.",
      "text": "Item was as described however it did have an unknown flaw. Return was processed quickly and without any hassle.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "One Star",
      "text": "No remote control. No directions for set up or operation!",
      "rating": 1.0,
      "verified": true,
      "author": "henry  c gefers",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Great Recorder!",
      "text": "I've had this recorder for about a month now and it is great! I bought it mainly to record tv shows to replace my VCR and it's doing a great job. It's a snap to set the recorder to record. I like the fact that it tells you how much time you have left on the disk. The price was really great too! I would recommend this to anyone who's looking for a reasonably priced recorder. Only wish it would take DVD-RW instead of DVD-RAM.",
      "rating": 5.0,
      "verified": true,
      "author": "Naomi",
      "helpful_votes": 12,
      "publication_date": 20050119
    },
    {
      "title": "Bad customer",
      "text": "This product was a total piece of junk it doesn't record nor does it read any disc the Customer new this they didn't even send the remote I had to buy one on ebay now I have a new remote an a unit that doesn't work thanks alot",
      "rating": 1.0,
      "verified": true,
      "author": "steven goode",
      "helpful_votes": 0,
      "publication_date": 20150607
    },
    {
      "title": "HAD THIS MODEL BEFORE - LOVED IT GLAD TO GET A REPLACEMENT FOR",
      "text": "HAD THIS MODEL BEFORE - LOVED IT GLAD TO GET A REPLACEMENT FOR MINE",
      "rating": 5.0,
      "verified": true,
      "author": "frank maggio",
      "helpful_votes": 0,
      "publication_date": 20140912
    },
    {
      "title": "Quality",
      "text": "I purchased pansonic model dmr- e 55 I have had it since July 2004 and the year is 2016 bought it brand new in 2004 and still working with no repairs! pansonic makes quality products!",
      "rating": 5.0,
      "verified": false,
      "author": "Charles D Wilson",
      "helpful_votes": 0,
      "publication_date": 20160723
    },
    {
      "title": "Doesn't hold up",
      "text": "This should say it all: I just came back from the repair shop. When they saw me walk in with the unit the clerk said, \"I can't believe how many of these units come in.\" This very model. I used it for a few months, made 20 or 30 recordings, then it just failed. I called tech report, told them the error message I was getting and they told me to bring it in. I have a feeling I'll be returning it often till the warranty expires and then I'll throw it out. For what it's worth it worked well until its demise.",
      "rating": 1.0,
      "verified": false,
      "author": "Steve C",
      "helpful_votes": 33,
      "publication_date": 20050504
    },
    {
      "title": "Great recorder player",
      "text": "This is my first dvd recorder and I am quite satisfied so far. Using the s-video input from my satellite receiver gives a dvd like quality recording. I have had this for a few months now without any compalints so far. This is a great dvd-recorder for anyone wanting to start out in this field. Playback flawlessly on my other panasonic dvd-players(s27 & 32s), not sure about other brands. Menus are asy to use. I recommend highly.",
      "rating": 5.0,
      "verified": false,
      "author": "Denis J. Brown",
      "helpful_votes": 5,
      "publication_date": 20050310
    },
    {
      "title": "Great machine!",
      "text": "You should look at the reviews for this Panasonic DMR-E55 unit with the black outer finish on Amazon for many more reviews of this silver version. All I can add to those informative reviews is how pleased I am with its incredibly easy set-up and very well designed interface and remote control. I'm thrilled with the quality of the recording even without using the higest quality format. I'm actually surprised the unit is so inexpensive considering the quality and number of features.",
      "rating": 5.0,
      "verified": false,
      "author": "Christopher Carneal",
      "helpful_votes": 75,
      "publication_date": 20040730
    },
    {
      "title": "Worth it",
      "text": "This is a simple and complex machine. Simple in the way of how easy it is to use. Just press the REC button and you are done. And complex with all the useful features like MP3 player, CD player, DVD player, and my most surprised feature RF. If you are watching T.V. downstairs and recording upstairs, just press stop on the remote whenever within about 100 ft.",
      "rating": 5.0,
      "verified": false,
      "author": "researcher",
      "helpful_votes": 20,
      "publication_date": 20050604
    },
    {
      "title": "GREAT DVD RECORDER FOR THE PRICE",
      "text": "THIS IS THE FRIST DVD RECORDER THAT I HAVE USED AND THE SETUP WAS EASY AND I WAS RECORDING IN ABOUT 15 MINUTES,THE OWNERS MANUAL WAS A LITTLE TO BE DESIRED ABOUT HOW TO FINALIZE A DVD,BUT IT WAS FAIRLY EASY TO FIGURE OUT AND THE RECORDING IS GREAT",
      "rating": 5.0,
      "verified": false,
      "author": "David",
      "helpful_votes": 7,
      "publication_date": 20041213
    }
  ],
  "product_meta": {
    "title": "Panasonic DMR-E55S Progressive Scan DVD Recorder / Player , Silver",
    "description": "Move into the medium of the future with this Panasonic DVD player and recorder. The sleek, home-theater-size player allows you to record, edit and store digitally on DVD-RAM and DVD-R discs. A high-quality way to preserve your invaluable home movies or record your favorite shows, it also performs as a basic audio and video player with DVD, CD, CD-R and MP3-on-CD playback capabilities. Features progressive scan, hybrid variable bit rate video recording technology with Dolby 2-channel audio recording, 4-mode record (XP/SP/LP/EP) plus FR, 2-channel DVD-Audio play, DVD-Video with surround play, DVD-R and DVD-RAM play, 1-touch record and play function, Time Slip features with chasing playback, playlist playback, 3D Y/C separation, 3D noise reduction, block noise reduction, mosquito noise reduction, A/V and S-video inputs and outputs, and optical digital audio output to Dolby Digital and DTS. Includes remote control. Silver. 3-1/2Hx16-15/16Wx11D\".\n\nAMAZON.COM\nAmazon.com Product Description Panasonic's DMR-E55S DVD player/recorder grants unprecedented recording time on double-sided 9.4 GB recordable DVDs--up to 16 hours, or 8 hours per side (and on standard 4.7 GB discs, in EP mode). The DMR-E55S's joint support of DVD-RAM and DVD-R media provides the best of both worlds: DVD-R for the highest compatibility (letting you share video recordings with virtually anyone with a DVD player) and DVD-RAM (for rewritability and benefits like TimeSlip, chasing playback, and simultaneous play and record). DVD-RAM offers the perfect method for recording and rerecording favorite programs--over 100,000 times on the same disc. Using DVD-RAM, you can also edit your videos on a multi-media computer with video editing/production software. \n\n You can take DVD-RAM discs out of their protective cartridges and play them on PCs equipped with a 4.7 GB/9.4 GB DVD-RAM drive or DVD-ROM drive that's compatible with 4.7 GB/9.4 GB DVD-RAM. In addition to an attractive price tag, the feature-rich DMR-E55S offers the benefits of progressive scan video playback (for use with high-definition and HD-ready TVs), MP3 CD playback, enhanced time-shifting, and instant access times. \n\n With instant recording onto a DVD disc, there's no need to have to find blank space, as with a VHS tape. Just press record and the unit will automatically find space on the disc, much like a computer's disk drive. Panasonic's Time Slip feature lets you replay a scene recorded earlier while a program is still in progress, without disrupting the recording process. And chasing playback lets you watch from the beginning a show whose recording is still in progress. \n\n You can easily transfer your favorite VHS tape recordings to space-saving discs. Personal movie libraries and family videos can be archived, preserved, easily cataloged and accessed, and even edited right from the disc.\n\n Input TBC (time base corrector) removes jitter from the input signal, while 3D Y/C separation circuitry precisely separates the luminance (Y) and chrominance (C) portions of the video signal to minimize dot crawl and color smearing caused by interference between the video signal's Y and C color subcomponents. These functions are particularly effective when recording from analog video sources such as a conventional VCR and camcorder. Combined with the 3D DNR applied during playback, the result can be a surprising restoration of image quality from old videocassettes. \n\n \n\nAbout Progressive Scanning\nAs a player, the DMR-E55K offers a progressive-scan video output for optimum picture quality when viewing a DVD movie on a high-definition or HD-ready TV. With standard interlaced signals (480i), it takes two passes to build one frame of video: first the even scan lines, then the odd. Progressive scanning doubles the scan lines of an interlaced signal by scanning all 525 lines in 1/60 of a second for each full pass. The higher-density video signal creates film-like DVD images with rich detail, extraordinary depth of field, and precise color reproduction.  Connections include component-, composite-, and S-video outputs, multiple composite- and S-video inputs, an optical digital-audio output for surround-sound passthrough to a compatible (Dolby Digital/DTS 5.1) audio/video surround receiver, and RCA stereo analog audio inputs. \n\n What's in the Box\nDVD player/recorder, remote control, remote batteries, user's manual, and a stereo analog audio interconnect/composite-video cable.\n\nFROM THE MANUFACTURER\nThe Panasonic DMR-E55S offers an affordable entry in to the world of DVD recordable. This DVD recorder has convenient features such as time slip recording, which allows you to watch the start of a program while still recording the end. This model comes in silver (as well as black). \n\n Features:\n\n\n * Plays pre-recorded DVD's and CD's \n * Analog TV tuner built in with RF pass through \n * Chasing playback allows you to watch the start of a program while still recording it \n * Non-linear minidisc-style editing \n * MP3 Playback \n * Records on DVD-RAM and lower cost DVD-R \n * Will make discs that will play in most existing DVD players (DVD-R only) \n * Simultaneous playback while recording is possible (DVD-RAM) \n * High speed transfer (22 Mbps) to and from DVD-RAM for time-shifting \n * Uses the single layer 4.7GB DVD-R (once only) system and DVD-RAM 4.7Gb systems \n * Records in real-time using MPEGII compression-Up to 6 hours per DVD-RAM disc \n * Quick recording function automatically finds the blank part of the disc \n * Variable Data rate settings \n * Flexible recording mode (VBR) for optimised bitrate for the type and length of recording \n * Built-in time base corrector that delivers highly stable, natural images \n * Front A/V input \n * Full RGB in and out \n * Flexible recording mode allows you to manually a time for recording and the player will set the best possible bit rate for that time, say 1 hour 15 minutes to fill a disc \n * Can record and playback NTSC and PAL \n * Progressive Scan (PAL) \n\n\n\nSee more",
    "rating": 4,
    "feature_bullets": [
      "Records DVD-R, DVD-RAM for best of both worlds; plays DVD-Video, DVD-R, DVD-RAM, CD-R/RW, and MP3 CD",
      "Up to 16 hours on a double-sided 9.4 GB DVD-RAM disc; up to 8 hours on a single-sided 4.7 GB DVD-RAM or DVD-R",
      "Offers one-touch record, TimeSlip, chasing playback (watching a recording in progress from the beginning), on-disc video editing",
      "Progressive-scan video output for seamless, flicker-free picture on high-definition and HD-ready televisions",
      "Measures 16.9 x 3.125 x 11.2 inches (W x H x D)"
    ],
    "specifications": {
      "Brand Name": "Panasonic",
      "Item Weight": "8.58 pounds",
      "Product Dimensions": "10.87 x 16.94 x 3.13 inches",
      "Item model number": "DMR-E55S",
      "Batteries": "2 AA batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Color Name": "Silver",
      "ASIN": "B0001G0FFS",
      "Customer Reviews": "4.0 out of 5 stars46 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#96,832 in Electronics",
      "Date First Available": "February 4, 2004"
    },
    "categories": [
      "Television & Video",
      "Electronics",
      "DVD Players & Recorders",
      "DVD Recorders"
    ],
    "price": ""
  }
}