{
  "website_summaries": [
    {
      "verdict": "A simple and inexpensive design for those cooks who just want a nice-looking cruet that quickly and easily dispenses oil.",
      "pros": [
        "Simple glass bottle and stainless-steel pour design",
        "Bottle holds 16 ounces",
        "Glass is tinted light green",
        "Easy to clean",
        "Pours well",
        "Also available in a 12-pack",
        "Economical"
      ],
      "cons": [
        "Some reports of quality issues with the spout"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I used this bottle to hold dish liquid. Added ...",
      "text": "I used this bottle to hold dish liquid. Added adhesive beads (purchased at Michaels) to give it a decorative design. I will be purchasing more for this use.",
      "rating": 5.0,
      "verified": true,
      "author": "Inky",
      "helpful_votes": 41,
      "publication_date": 20161009
    },
    {
      "title": "Pricey considering quality",
      "text": "This was fairly expensive considering the price of comparable oil bottles I have had in the past. It is less than 3 months old. I tried to remove the stopper to refill the oil and the glass broke off with it.",
      "rating": 1.0,
      "verified": true,
      "author": "KD",
      "helpful_votes": 17,
      "publication_date": 20180906
    },
    {
      "title": "Purchased a bunch and absolutely love them!",
      "text": "I purchased several of these to house various oils and vinegars next to the stove. I know you’re not supposed to do that, but I go through them so fast I haven’t noticed in change in the products. If they start to look grimy, you can easily wipe the outside and they look good as new. If I need to clean the inside, I pop the glass bottle in the dish washer and hand wash the nozzle. Not sure if either is dishwasher safe, but the bottle does fine and I didn’t want to risk the stopper. I plan on buying a few more.",
      "rating": 5.0,
      "verified": true,
      "author": "Rayna",
      "helpful_votes": 9,
      "publication_date": 20180919
    },
    {
      "title": "Awesome value (edited: not a good value)",
      "text": "Awesome sturdy product. no leaks at all, oil doesn't seem over onto the glass exterior. Edit: product did not last very long, just before two months of owning this product I threw it away because the spout part was so incredibly leaky and almost fell right off when I was pouring multiple times. Learned my lesson, and found one of these for less than two dollars and it has lasted much longer!",
      "rating": 1.0,
      "verified": true,
      "author": "Angel Ancheta",
      "helpful_votes": 13,
      "publication_date": 20171101
    },
    {
      "title": "Spend a little more buy a better quality one.",
      "text": "Junk, dont waste your $. The stopper comes right off, no pressure to hold it on. I am going to have to return it. It's useless. The glass is also very thin.",
      "rating": 1.0,
      "verified": true,
      "author": "Kman",
      "helpful_votes": 6,
      "publication_date": 20190821
    },
    {
      "title": "Sturdy glass dispenser--great for dispensing dish soap and saving $$$",
      "text": "I bought this to dispense dish soap in a pretty, functional container. The nice thing about putting dish soap in one of these is that it dispenses quite slowly which actually saves you money. I use Dawn dish soap which is already very powerful. A little goes a long way. It takes a few seconds to dispense due to the viscosity of the soap against the small tube but I got used to it and am quite happy knowing that my giant Costco sized container of Dawn will probably last me until I die. The glass itself is very sturdy and I am not afraid to manhandle it in my normal dishwashing.",
      "rating": 5.0,
      "verified": true,
      "author": "April P.",
      "helpful_votes": 12,
      "publication_date": 20161024
    },
    {
      "title": "... after a couple months until it was eventually rendered useless.",
      "text": "Rubber start falling off into dispenser after a couple months until it was eventually rendered useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Buddy",
      "helpful_votes": 8,
      "publication_date": 20180715
    },
    {
      "title": "Cute Dish Soap Upgrade",
      "text": "Overall I am pleased with this product. My only complaint is that it’s starting to get small rust marks around the tip where it dispenses the dish soap. It does look very elegant compared to a plastic bottle of dish detergent. The flow is pretty good as well I’m just not pleased with the rust and I’m trying to find a way to get them to stay away.",
      "rating": 4.0,
      "verified": true,
      "author": "Jordan Sumner",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Large enough for normal use",
      "text": "We bought 2 of these units for both oil and vinegar. The large size means that we don't have to refill the bottles after minimal use. In addition the cap is easy to remove for refilling. Others we have had the cap is not secure and a number of times the rubber neck has fallen into the liquid (oil or vinegar). Very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "HM05",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Great for everyday use.",
      "text": "I buy olive oil by the big jug and needed something smaller to keep in the kichen--- not the pantry. This is a good size-- nice capacity, so you shouldn't have to refill it every day or two. It's easier to hold and pour from than the large square bottles the olive oil comes in. I had a plastic one that I used for years but this is so much better! And, by having it closer to the stove, will be using the olive oil all the time again.",
      "rating": 5.0,
      "verified": true,
      "author": "ricracTop Contributor: Baking",
      "helpful_votes": 2,
      "publication_date": 20161219
    },
    {
      "title": "Exactly what I needed",
      "text": "I used olive oil on a regular basis due to its health benefits, but found it cumbersome and messy to pull the big bottle (I buy huge bottles at Costco) out of the cabinet each time I needed a tablespoon. This container is attractive enough that I keep it on the counter right beside the stove. It pours evenly, easily, and with zero mess. I absolutely love it. It also seems very well made. I don't expect a need to replace it for years.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Many uses",
      "text": "I bought this a few months ago and I received the product as pictured. I am using mine on my bathroom counter. I use a pink mouthwash in the container and that matches the color in my bathroom. I have Dixie cups in a tabletop dispenser to use with it and it looks really nice. I like that I could use it for many reasons, oil, vinegar, mouth wash and dish soap. I think I will get another for my kitchen for soap, it works so well in the restroom I think it would look better than a spdish soap bottle on the counter next to the sink. There are a lot of other ideas on line for these bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "rae's reviews",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Nice product",
      "text": "I’m using this for dish soap and I like it a lot. I ordered, I thought one, and I received two which was fine. I went online and got a coupon so the price was cut in half and I’m very happy with my purchase. The soap comes out fine (I did add a bit of water) and it looks great on my counter. I did add a little bit of plumbers tape to the stopper because it felt a bit loose and I didn’t want to take any chances of the stopper popping out.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Waste of money",
      "text": "Bad seal. The very first time i opened it up to do a refill the seal somehow got loose and now it does not even close right and leaks oil from where its not suppose to. The too Is cheap plastic that does not fit right. Bad quality item and difficult to open.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Ali",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Buy this item.",
      "text": "I was pouring directly from a 32oz bottle of olive oil, and had little control how much came out, and now I do. The much smaller container is easier to work with, and is not getting olive oil all over it, simply from using it. I am very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond W. Kent",
      "helpful_votes": 5,
      "publication_date": 20170409
    },
    {
      "title": "Great for olive oil",
      "text": "Great for olive oil. Made of thick enough glass to feel like it is of quality but not to thick where it is too heavy. This container is nice enough looking to leave out on the countertop and we have had no issues with it leaking. PROS: - No leaking - Quality built - Nice looking - Works very well - Easy to fill - Inexpensive - Fast shipping CONS - I have NONE at this time",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony & Sarah",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "great for dish soap!",
      "text": "I use this as a dish soap dispenser. the metal doesn't get rusty & it is easy to keep clean. I love this for soap because we no longer waste so much soap washing dishes! it lets out the perfect amount! I compare it also to the cheap dispensers from the dollar store--- no comparison. The glass in this is thick and doesn't break when it hits the granite counters. The size is great, it is almost 3x the size of the dollar store one. I love how much soap it holds and how long it lasts. I usually put the big bottle of dawn soap and that lasts me months of daily dish cleaning!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 0,
      "publication_date": 20151023
    },
    {
      "title": "Weak",
      "text": "Update:. I only had this for a few weeks when it slipped and fell a couple inches. It broke in several pieces. Very disappointing. My last one lasted for years. I use this for my dish soap by the sink. It looks nice and comes out easily. The soap does come out a bit slow.",
      "rating": 1.0,
      "verified": true,
      "author": "TechGalt",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "This bottle was poor quality out of the box and fell apart in 2 weeks",
      "text": "When I received this the stopper was in pieces. I tried to fit it together and use the bottle Over a couple of weeks the nozzle somehow worked loose and fell down into the bottle. This is under light home use. My previous bottle from B&B and Beyond lasted for years.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff C.",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "No Oil!",
      "text": "Had this product 15 days went to add more oil and the silver part came off and would not go back on product is defected would not sugest you buy! Product is a good for show off kitchen piece! Not suggested for use .",
      "rating": 1.0,
      "verified": true,
      "author": "landk",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Works exactly how it should",
      "text": "I have had this for 4 years, and it is a workhorse. Easy to refill, and never pours out too fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison L.",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Great but won’t last forever.",
      "text": "We loved this thing... but keep in mind the nozzle won’t last forever. Ours got so gummed up after about a year that it was going to need to be replaced. Before I did that, however, I knocked it down on the granite countertop and it shattered into 1 million pieces. Anyway, definitely worth the 8 bucks... I’m back again buying another.",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20171123
    },
    {
      "title": "Disappointed, Dysfunctional, Non-Returnable",
      "text": "Glass bottle is perfect... Stopper never fit inside the bottle even from day one. I pulled it straight out of the box and I couldnt get stopper in. Tried to print return label, and this product is unavailable for returns. SUPER DISAPPOINTED. Hubby took me to \" Bed, Bathtub, and Beyond\" if you catch my drift, and I was able to buy two stoppers for $4 and a new bottle for cheaper than this one was. Looking back I wish I had just gone there to begin with.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah Ann Hosford",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Cracked",
      "text": "Just organized my kitchen at our new home. Opened the box for this item and pour the olive oil into the bottle. Only to see that there is a crack (See photo)!!! Do not want to use cracked bottle in my kitchen. Will probably throw out my oil. Not happy :( I hope the seller can correct the situation – either replace or refund!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Shikshya",
      "helpful_votes": 2,
      "publication_date": 20180909
    },
    {
      "title": "Quaility",
      "text": "Love the light green color. The glass is nice and thick. The stopper holds nice and tight. I like that the stopper is plastic and not a cork. My old one got moldy around the cork. Great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Carlee ",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "I love this pourer",
      "text": "This is my first time buying a product like this. So far it is excellent. I have been wanting more control with how much oil gets dispensed and this works like a charm. I have been using it for Canola oil. I think I recall some people complaining about it being hard to remove the lid but it is actually pretty straight forward you just have to pull up and slightly shift back and forth. I hope this helps!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "It is ok",
      "text": "Makes your oil look green because the glass is blue, it is what I wanted but I found out they have them at dollar tree! I could have gotten it for literally a dollar!",
      "rating": 3.0,
      "verified": true,
      "author": "Monica Canjura",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Gets the job done",
      "text": "I broke our oil cruet recently and replaced it with a fancy one with a measuring area at the top you pumped the oil into. It was terrible. I then ordered this one and it has been perfect. It's not fancy at all... straight up container and dispenser. But it works without question and does exactly the job it was meant to do. Seems sturdy too.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Lawton",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Started to leak after a year",
      "text": "I was using this happily for a year but lately oil leaks every time I use it. I tried filling less, double-checked the nozzle and even tried changing the angle I use at but the issue is persistent.",
      "rating": 2.0,
      "verified": true,
      "author": "NS",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Item received was different than item described.",
      "text": "The item I received was different than the picture and description listed. I ordered this as I have a small shelf basket that would fit a 2 x2 in. squared bottle perfectly, but instead I got a large round dispenser. If I had needed a round one, I would have ordered one. Although it looks nice, it’s not what I needed and now serves me no purpose.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Good for the price",
      "text": "After I had a $30 similar item break out of no where I bought this as a quick fix solution. So far I've been impressed. The spout isn't as sturdy as my old one but for such a deal I didn't expect much. However, the day after I bought this I accidentally knocked it off my counter and it didn't break. The spout broke into 3 pieces that were easily assembled again. I use it daily and I love it. It's holding up to daily use quite well.",
      "rating": 4.0,
      "verified": true,
      "author": "RSars",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "... to use with dish soap so it would look pretty on my counter",
      "text": "I purchased this to use with dish soap so it would look pretty on my counter. The dish soap does look pretty in the glass, but the top has too slow of a flow to dispense dish soap. It ended up being way more trouble than it was worth. I've purchased some different tops to try out, so hopefully those dispense faster and will work with dish soap. Fingers crossed!",
      "rating": 3.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 2,
      "publication_date": 20160329
    },
    {
      "title": "Top just falls out when turn it over",
      "text": "The top does not stay in. Just falls out when I turn it over. Cannot return, I guess. Ugh. Also, looks like the whole at the top is big and oil or vinegar would come out very/too fast. Note: The bottle is 16 oz so might be much bigger than what you're expected. Do not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "kt",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Good but mismatched",
      "text": "Nice bottles but I ordered 2 and received 2 different ones. Not a huge deal as there are subtle differences but just something to note. One is a little taller, clear, different nozzle and has a cover the second had a greenish tint and a shorter nozzle with no cover. Also when it was packaged it was just thrown in the box with a couple air pillows. Very poor protection",
      "rating": 4.0,
      "verified": true,
      "author": "Amy J",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Great for dish soap!",
      "text": "Bought this to hold my dawn dish soap. We have to hand wash a lot of baby bottles and sippy cups and I couldn’t stand how much room the dish soap canister took by the sink. This is the perfect way to store it, and have it look nice!",
      "rating": 5.0,
      "verified": true,
      "author": "Katy Malone",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Perfect!",
      "text": "This is perfect for making my own dressing while on a diet. Very easy to use and no drips down the side of the bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "Kit627",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Nice but leaks",
      "text": "Now that I have been using this bottle it has started to leak around the rubber stopper. Makes my hand a mess when I turn the bottle upright. I really like the convenience of the bottle. I would like it a lot more if it didn't leak..",
      "rating": 3.0,
      "verified": true,
      "author": "Crossdrawjohn",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Works great",
      "text": "Helpful hint if you use this for dish soap: put a small amount of water mixed in with the soap and it will pour out faster. At first I didn't like how slow the soap came out then my mom told me this trick. It's great!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Sturdy glass and smooth pour spout",
      "text": "I used this to store simple syrup and it works well. The glass is nice and sturdy and the pour spout is really smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "Kirsten Lindblom",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Does the job",
      "text": "This is basic, but attractive and functional. Reasonably priced, too. Recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "ROYGBIV",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Fell apart",
      "text": "I was really excited to use this & bought it after I had just moved to a new apartment (about Mid-Late August). I had a cruet for about 3 years that I left with my previous roommate since I moved across the country, but unfortunately the dispenser fell apart, and now there's a little rod of metal in my oil and the rest of it is in the trash. I'm going to hang on to the glass part, but I'm kind of sad that it lasted only about 3.5 mos.",
      "rating": 2.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Great for cooking oil",
      "text": "Use it to hold cooking oil by the stove. Works great. Run it through the dishwasher between refills and it’s nice and clean. I have seen none of the issues others have reported.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Armour",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "NO LEAKS",
      "text": "very impressed with this simple way to dress up your kitchen table or counter vs. an ugly oil bottle. I love it easy to clean, durable, and NO LEAKS!",
      "rating": 5.0,
      "verified": true,
      "author": "Kam",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "It definitely fits my purpose to have a elegant and ...",
      "text": "It definitely fits my purpose to have an elegant and non-dripping oil vessel. I would buy it again in the future for similar liquid in the kitchen. ---------- Coming back for the second review (10/31/18). The second one I bought works great as well. I love it. No greasy bottle nor greasy finger anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Ordinary Customer ",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "Easy to refill and doesn’t pour out to fast.",
      "text": "Great clean way to dispense oil for cooking and it looks nice on the counter top.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Works beautifully! I was previously using a dollar store variety ...",
      "text": "Works beautifully! I was previously using a dollar store variety and the oil spilled out of the top and down the sides. This bottle is large, so it holds a good amount of EVOO. It pours smoothly and doesn't leak all over the place. Beautiful bottle.. happy with my investment!",
      "rating": 5.0,
      "verified": true,
      "author": "Larissa",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Works well for oil and more",
      "text": "I like it for oil makes pouring oil a lot easier. Don't get to much",
      "rating": 5.0,
      "verified": true,
      "author": "Marcella Layden",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Does the job, no wobble.",
      "text": "You might think these kind of purchases are straight forward. You buy an oil dispenser for your olive oil, you are done with ever having to worry about it again. Sometimes you do this and are wrong. My old Oil Cruet top would wobble, leak, and get slimey. It seemed that every use I would have to wash the sides because oil would seep out. Not with this one. Tablecraft made a Cruet that actually prevents the leakage and I have been very satisfied with my order.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Morin",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Perfect for dish soap",
      "text": "I actually bought this for my dish soap, and it works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Tang",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Just go to the dollar store.",
      "text": "For the price, I though it would be quality glass. It's about the same as any other bottle you can pick up at the discount store. The one I received also had a hairline crack along the side. Not sure if it was due to quality control or shipping. Definitely not worth the price.",
      "rating": 1.0,
      "verified": true,
      "author": "PoNG",
      "helpful_votes": 2,
      "publication_date": 20171115
    },
    {
      "title": "Nice bottle for olive oil",
      "text": "I bought this to house my olive oil for cooking. It does the job for the most part. There is nothing wrong with it per se, but it can be hard to fill without a funnel. The spout works, but it isn't the smoothest pour. There is an air hole to help with flow, but it doesn't seem to work great. The glass is thick and durable. I haven't found a better option so this is a good bottle, but just not perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "SO CO PO PO",
      "helpful_votes": 0,
      "publication_date": 20160110
    },
    {
      "title": "I did have to glue the metal top to the rubber stopper as it came undone but I am not sure if it was a bad unit or another issue but the super glue did ...",
      "text": "What can I say about this, it came I filled it with olive oil and it worked well. I did have to glue the metal top to the rubber stopper as it came undone but I am not sure if it was a bad unit or another issue but the super glue did the trick.",
      "rating": 3.0,
      "verified": true,
      "author": "GchanMako",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Works great and looks nice",
      "text": "Works great and looks good! No complaints here. Holds a whole small bottle of olive oil (not sure how many ounces, but the standard small bottle size you can get at any grocery store). Oil comes out at a reasonable rate and one quick turn of the bottle is usually enough to coat a pan before sauteeing.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "perfect",
      "text": "haven't cleaned it yet ( just rinsed it out) but it is exactly what I was looking for",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Crouse",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "very nice bottle",
      "text": "easy to use. finally not spilling oil everywhere while cooking!",
      "rating": 5.0,
      "verified": true,
      "author": "Vladislav Goncharenko",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Can be used for many things!!",
      "text": "I wasn’t expecting this item to be delivered so super fast and it was a great surprise!! I’m so excited to use this at my kitchen sink for dish soap!!! This condition of the glass and top attachment is so elegant and fresh!!! Thank you!!!",
      "rating": 5.0,
      "verified": true,
      "author": "BReanna",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "FAVORITE PURCHASE. I am SO glad I finally bought ...",
      "text": "FAVORITE PURCHASE. I am SO glad I finally bought one of these, and this works so well. It sits right next to my stove and makes things so convenient. When I only have one free/clean hand this is so much nicer than opening a giant bottle of EVOO. It also allows more control when pouring. I would purchase this 100 more times.",
      "rating": 5.0,
      "verified": true,
      "author": "Meagan Brandon",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Great for more than just olive oil!",
      "text": "I only wish I had gotten two! I originally purchased this for my dish soap as a more aesthetic way of storing it on my counter near my kitchen sink. However, now I am inclined to use it for its original purpose and store my olive oil in it...Oh, the dilemma! Haha! Looks like I'll have to get another one...or maybe even two!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Goins",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "Works fine as a bottle for dish washing liquid",
      "text": "I bought this for dish detergent. It looks nice on my sink and is easy to use. The only downside is that the smooth glass surface gets slippery, so I put a nice purple rubber band on it and that stops it from sliding out of my hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Hauenstein",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Pretty & Practical",
      "text": "This product is the right size for sitting on counter to have handy. Its pretty, with a tint of green, and practical because the pour spout is fantastic. It doesn't drip, its great for drizzling and easy for straight pouring if needed. I have small hands and arthritis and this bottle is very easy to grip and hold on to. I have used this for a couple months now and the more I use it the more I like it. Also, you can buy replacement pour spouts from Amazon at a really good price. I think it probably will be a very long time before I need them, but I purchased them anyway just for emergency backup.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa P.",
      "helpful_votes": 0,
      "publication_date": 20140114
    },
    {
      "title": "Great way to display liquids",
      "text": "Keeps a lot of liquid and despenses easily, makes a nice touch to the countertop onsomble",
      "rating": 5.0,
      "verified": true,
      "author": "El Conquestidor",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Came Broken, not returnable",
      "text": "This item arrived shattered. You cannot return this item, even if it came broken.",
      "rating": 1.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "very useful",
      "text": "I really like that this holds a good amount (maybe a little less than a quart?) and the stream when I pour is just right, and not glopping all over as when I pored it straight from the big container the olive oil comes in. The only reason I didn't give it five stars is because it's a clear bottle. It's very important to either store oil in a dark bottle or in a dark place (as I do) to prevent light from taking away antioxidants in the oil.",
      "rating": 4.0,
      "verified": true,
      "author": "Miss T.",
      "helpful_votes": 0,
      "publication_date": 20140514
    },
    {
      "title": "Great Alternative Dish Detergent Dispenser",
      "text": "Great product! I bought two, and I'm using one as a dish detergent dispenser to add a different, \"fancier\" look to my kitchen. Since dish detergent is thicker than olive oil, it takes a second or two to start to flow, but once it does, it does not come out to fast or slow. I haven't used the other one that I purchased yet, but plan to actually use it as an olive oil dispenser. Since it works so well with a thicker liquid, I think it would also be great with the oil since it is only slightly less viscous.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150116
    },
    {
      "title": "Look great and work well next to the stove",
      "text": "People say you arnt supposed to leave oil in a breathable vessel due to the air exchange making it go bad. I have not had that experience with these. We use oil at a fairly quick pace and havent noticed any issues. I guess if you have some top notch oil direct from the hills of italy, maybe dont put it in these. But some canola oil or run of the mill olive oil works great. Pour from the spout is even and they are easy to refill.",
      "rating": 5.0,
      "verified": true,
      "author": "Zach M.",
      "helpful_votes": 0,
      "publication_date": 20140615
    },
    {
      "title": "Great for even coating veggies!",
      "text": "Bottle works great. It does not leak and is exactly what I was looking for to evenly coat my veggies before oven roasting. Note that this is not dishwasher safe.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "No mess and easy use",
      "text": "Easy to use and doesn’t leave a mess or leak. I use it for cooking oil.",
      "rating": 5.0,
      "verified": true,
      "author": "Jayce One",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Cheap",
      "text": "Poorly made. The little metal disc around the top of the spout came off the first time i used it. The dispenser seems to work without it still so I'm not returning it, just disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Facepalm",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "i like my olive oil cruet",
      "text": "i really liked it but sadly last week i dropped it and a bottle of olive oil on my floor and both broke. What a mess! I ordered another cruet!",
      "rating": 5.0,
      "verified": true,
      "author": "sandra toerpe",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Solid purchase",
      "text": "Works great. Arrived completely perfect and in tact (which I was nervous about from reading other reviews but it came fine!). I love it! Great size too",
      "rating": 5.0,
      "verified": true,
      "author": "kendalldang",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "It's great!",
      "text": "Came without any damages or scratches. The sticker label came off with little fuss and any remaining sticker residue was easily washed off. The dispenser holds a good amount and is not hard to refill. I would definitely recommend it for people without one. I find it very convenient and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Leaks",
      "text": "The spout isn't adequately sealed and therefore leaks and runs down the container.",
      "rating": 1.0,
      "verified": true,
      "author": "tqroljoe",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Great",
      "text": "It does it's job as expected! It's not super big/tall so keep that in mind",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Kruger",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Cap Rusted Immediately",
      "text": "The cap started rusted after I washed for the first time. Need a replacement cap.",
      "rating": 1.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 2,
      "publication_date": 20171220
    },
    {
      "title": "Great quality for the glass and the pourer...you'll never need to replace",
      "text": "Exactly what I needed. I had one that I broke and was thankful that I could find the same one. Great quality and never a problem with the pourer. Great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "K Gibson",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Perfect!",
      "text": "Exactly what we needed! We usually buy olive oil in bulk and it's hard to pour it out of the large container. We finally decided to purchase one of these cruets and it is perfect. Great size, nice glass, pours easily, and does not leak.",
      "rating": 5.0,
      "verified": true,
      "author": "Sonya Weasner",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Simple and Easy",
      "text": "I ordered two of these, one for regular EVOO and another for light EVOO they are perfect it and looks great on the counter.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Brown",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "A gem",
      "text": "My son bought me one of these to use with olive oil, which I use with most meals.. However, I broke his, and found this gem on Amazon. I replaced it and no one could tell the difference. I love the real glass and slight green tint.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Rogan",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "Nice",
      "text": "Does not drip/leak like most other oil dispensers. Very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Great dispensers!",
      "text": "I glass etch these bottles with the name of what's inside; olive oil, canola oil, etc. and give them as gifts. Folks just love them! It's so much easier to drizzle a bit of what you need in a pan or over a salad. It's also a better price here on Amazon than what I've found in the stores AND it comes to your front door! :) Another great use is for dish soap.",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine B",
      "helpful_votes": 0,
      "publication_date": 20140924
    },
    {
      "title": "Fun and durable",
      "text": "I got this for my husband along with other items. He said this is his ‘best’ gift. It’s fun to use and only takes a few mins to clean using a long brush.",
      "rating": 5.0,
      "verified": true,
      "author": "BROOKE L KING",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Not the item that you see on the picture",
      "text": "I have ordered this item in 2018 and I liked it a lot, so I decided to get another one for a different kind of oil. I've got a bottle of different quality and size. The tube was awful, barely held in the bottle and was definitely made of a different material.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Convenient for drizzling oil over your dishes.",
      "text": "Great for drizzling olive oil over your dishes. It’s a bit too tall for me. I’ve toppled it over several times but it remained intact. It’s pretty durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandy Peace",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Well-Made, allows for smooth flow of oil",
      "text": "Excellent well-made bottle that allows an uninterrupted flow of oil. Some oil dispensers only allow a minimal amount out at a time which is irritating when cooking, but this bottle thankfully works beautifully and smoothly and is a great addition to my kitchen. It does not have a \"cap\" on the spout that some people prefer in their kitchens, so if you are looking for a product with a \"cap\", pick a different bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "tandra l’amour",
      "helpful_votes": 0,
      "publication_date": 20140809
    },
    {
      "title": "Choose another one",
      "text": "I got this product today, filled it up with my oil and the top won’t even stay on. Product isn’t able to be returned either.",
      "rating": 1.0,
      "verified": true,
      "author": "lauren",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Great",
      "text": "It dispenses oil. Not much else to say other than it works, and that's all it needs to do. I alread had one of these from Kohl's but they don't sell them any more. The glass is easy to clean if it gets greasy and the plastic air spout is sturdier than some other ones that I've seen at places like Target. Definitely recommend this for anyone who needs a basic olive oil dispenser.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20140603
    },
    {
      "title": "The bottle is pretty much what I expected",
      "text": "The bottle is pretty much what I expected. The photo on the posting doesn't give the consumer a great perception of the bottle's size; it was a bit larger than I thought it would be. Still, the pour spout is smooth, and the bottle does a great job of keeping all of my olive oil in one place, so that's good. It's not an eyesore in my kitchen. Good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Sterling H.",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Simple and good looking",
      "text": "Absolutely enjoy having these at the ready filled with different cooking oils, I have 6 of these and not disappointed, to clean them, I simply soak them in hot soapy water, rinse, and turn upside down to dry over night.",
      "rating": 5.0,
      "verified": true,
      "author": "Riley",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Perfect for dish soap",
      "text": "Perfect for my dish soap. I buy dish soap in bulk and refilled the original plastic container. It was unsightly so I purchased this. It works perfectly, it is easy to handle, the perfect weight and the soap dispenses slowly saving soap. Plus it is far more attractive.",
      "rating": 5.0,
      "verified": true,
      "author": "BAC",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Good product",
      "text": "This is great for dish soap if you want to get rid of the tacky fish soap container on the edge of your sink",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Great product that doesn’t leak",
      "text": "I bought this because my old one would leak every time I used it. The rubber stopper seems to seal very well and I have not had any leaks. Definitely would but again.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan Mahaffey",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "useful",
      "text": "I didn't know I needed this cruet. I use it for olive oil and am very happy with the purchase. It is easy to clean and looks nice on my kitchen counter.",
      "rating": 4.0,
      "verified": true,
      "author": "cc",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Chefs dream",
      "text": "Love it. I’ve been wanting one for a while and now I’m a happy cook!",
      "rating": 5.0,
      "verified": true,
      "author": "TexanJD",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Good",
      "text": "Love having this on my counter for cooking oil. Like most oil dispensers, the narrow neck makes it harder to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey Huang",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Love this item!!!",
      "text": "This item has made using oil so much easier!!! It sits on my counter and is easy to access.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Martin",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Rusted! Not safe!",
      "text": "I've had this for two weeks and the top has rusted. I live near the coastal water, so perhaps the added moisture in the air aided in the rusting, but nothing else in my kitchen has rusting problems. Not safe for food!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Tricia",
      "helpful_votes": 3,
      "publication_date": 20150327
    },
    {
      "title": "Love this!",
      "text": "I finally bought myself something great! I've been putting this purchase off and am so happy I finally purchased this much needed household item. I think I will have to buy another for my balsamic vinegar. It works wonderfully!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Drew",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "They are durable and good quality. I love them and they pour out ...",
      "text": "I use these bottles for my different oils. They are durable and good quality. I love them and they pour out oil evenly. I would definitely recommend them!",
      "rating": 5.0,
      "verified": true,
      "author": "Christin Tobey",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Lovely bottle!",
      "text": "Beautiful cruet. Easy to handle. Pours nicely. I purchased mine the hold my dish detergent at the kitchen sink and it works very well for this. Much better than looking at an ugly plastic bottle. Would recommend - even for olive oil (it's intended us)! Recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie",
      "helpful_votes": 0,
      "publication_date": 20160712
    },
    {
      "title": "Great quality product.",
      "text": "Fast shipping - well packaged. Nice product - solid glass with what appears to be a pretty good quality spout. Great for the price. Only downside is that is it listed as an add-on, which isn't the sellers fault. We have one for olive oil and one for dish soap.",
      "rating": 5.0,
      "verified": true,
      "author": "EricOhio",
      "helpful_votes": 0,
      "publication_date": 20161015
    }
  ],
  "product_meta": {
    "title": "Tablecraft 16 oz Oil & Vinegar Cruet",
    "description": "Number of Items:1This oil and vinegar cruets are excellent addition to your table setting if you serve bread baskets. Made of glass material. The green tinted glass bottle comes with a stainless steel pourer for simple dispensing and minimal cleanup. Comes in 16-ounce capacity.",
    "rating": 4.5,
    "feature_bullets": [
      "16-ounce capacity",
      "Creates classy look for serving oils and vinegars",
      "Pouring spout makes dispensing easy and keeps spills to a minimal",
      "Glass has a slight green tint",
      "Glass Oil and Vinegar Cruet Made with stainless steel pourer and glass bottle"
    ],
    "specifications": {
      "Product Dimensions": "2.25 x 2.25 x 12.13 inches",
      "Item model number": "916M",
      "ASIN": "B0001MSDOC",
      "Customer Reviews": "4.5 out of 5 stars2,100 ratings4.5 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "1 pounds",
      "Department": "Dining Room",
      "Manufacturer": "food service warehouse",
      "Date First Available": "June 29, 2004"
    },
    "categories": [
      "Bottles",
      "Home & Kitchen",
      "Kitchen Utensils & Gadgets",
      "Oil Sprayers & Dispensers",
      "Kitchen & Dining"
    ],
    "price": 10.09
  }
}