{
  "website_summaries": [
    {
      "verdict": "A heavy-duty pitching rebound net that is strong enough for larger sports such as soccer and basketball.",
      "pros": [
        "Heavy-duty frame construction keeps the net firmly in place when used with heavier, larger sport balls",
        "Can handle high velocity throws and kicks without buckling or folding inward",
        "Adjustments are simple and easy due to the quick release design"
      ],
      "cons": [
        "Elastic attachments that connect the net to the frame can become brittle in cold weather"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "... the outdoor elements so they become brittle and break easily. I've had this since May in Michigan and ...",
      "text": "Elasticity attached to the hooks don't hold up real well in the outdoor elements so they become brittle and break easily. I've had this since May in Michigan and as of September, about 1/3 of the hooks have broken. That's with minimal play. Most damage is due to the brittle elasticity of the hooks.",
      "rating": 3.0,
      "verified": true,
      "author": "scottie",
      "helpful_votes": 8,
      "publication_date": 20171205
    },
    {
      "title": "Poor Quality, Cannot Recommend",
      "text": "Many of the bungee cords rotted and broke off after less than a year after purchase rendering this pitch back basically useless. You cannot buy replacement ones anywhere. I called the manufacturer and they said starting in October dealers could order a replacement net and bungee cord pack. I don't need a new net, I just need the bungees. And I'm not a dealer so no telling how much cost and time all of that would end up being. In the meantime my only option is to buy a new pitch back or use small universal bungee cords that are not the right tension and do not support the net properly. Poor customer service and poor product.",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas H",
      "helpful_votes": 8,
      "publication_date": 20160902
    },
    {
      "title": "5 stars based on cost",
      "text": "I paid about $60 for this... If I had paid over $100 I’d expect a bit more but for the money it’s pretty good. I use it for a portable hoop b-ball return/passer. And for what I’m using it for it’s great. It helps to return what can be some pretty funky bounces on makes. For a passer...it’s not great. It’s too light weight for the heavy basketball and the force of a pass into it, so I’d say use it for a rebounder. Probably works great w baseball/softballs though I have not tried. Fairly easy to assemble. I will bring inside after reading other reviews as I think the bands would deteriorate over time in the elements.",
      "rating": 5.0,
      "verified": true,
      "author": "MATTY",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Rebounder works well for Lacrosse",
      "text": "The first one we received was broken in shipping. The 2nd one Amazon sent out was in good shape. The instructions are poor. The orientation of the net is not clear. Basically, if you find the double net side, that goes on top. The 2 single net wing sections go on the bottom. The re-bounder works great with a Lacrosse ball and both my kids are using it. You do need 2 people for the very final assembly to stretch the last part of the netting over the hooks. My 11 year old was a great helper.",
      "rating": 4.0,
      "verified": true,
      "author": "Ira Hart",
      "helpful_votes": 22,
      "publication_date": 20150406
    },
    {
      "title": "My son uses it for lacrosse and it works great! To answer some questions I saw before I ...",
      "text": "Very well built, heavy duty. It did not require any tools to put together but it did take some time. My son uses it for lacrosse and it works great! To answer some questions I saw before I purchsed- it does not break down. You could probably keep it outside but the sides have many bungee cords which would probably lose some stretch over time. The mesh is nylon so that should not be an issue outside. It does not come with stakes but it is heavy enough to where it does not move at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Decent backstop",
      "text": "I think this is a great product. The one problem is that the square is too high for a strike zone. If you lower the square on the net it ends up being on the angled leg area and it pops the ball up. Perhaps if I had to do it over maybe I would have gotten something with a strike zone in the right spot. Otherwise, this backstop works rather well.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim Dodds",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "works great for lacrosse",
      "text": "I didn't want to spend a fortune on one of these and this seems to fit the bill. This was easy to assemble (fortunately because the instructions are lame) although it's kind of a 2 person job. The bottom part of the frame is set at an angle but the top is adjustable. There are stakes to anchor it to the ground but it seems to be study enough without them. My daughter uses it for lacrosse and It works great; nice bounce and sturdy. For soccer or baseball you might want to use the stakes. If you're looking for a relatively inexpensive, sturdy rebounder for the yard this is probably going to be a good choice.",
      "rating": 5.0,
      "verified": true,
      "author": "branfont",
      "helpful_votes": 2,
      "publication_date": 20160601
    },
    {
      "title": "Solid, inexpensive bounce back...",
      "text": "This bounce back is decent quality for the money. I purchased one 5 years ago and was going to look for a new net (only because our 6 year old decided to cut parts of it with a scissor). I decided to just buy another after seeing that a new net would be $40. The clips that come with the bounce back aren't very good. I use tie backs and now have two we can use. Definitely recommend for cost and durability.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Great volleyball pepper net!",
      "text": "Two of the poles were missing retractable pins. The net does not look like the one pictured. The net is entirely royal blue. Despite this, the net works great! I paid $60 for this - sometimes they jack up the price to $90. You just have to be patient.",
      "rating": 3.0,
      "verified": true,
      "author": "ZumbaChick",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Great Product for the Price",
      "text": "As previously stated by multiple people, the instructions for set up are incredibly useless. However, if you have a tiny bit of common sense, the set up is relatively simple. I purchased this product to help rehab my twice reconstructed throwing shoulder for the softball season. I have put about 10 hours of use into this product so far and it seems to be a great product for the price. Pros: Less expensive than similar products, Adjustable Cons: Does not break down for easy storage, Pretty lightweight (use the stakes provided) Overall, I would definitely recommend this product to another consumer (assuming they have space to store it).",
      "rating": 5.0,
      "verified": true,
      "author": "Scott J. E.",
      "helpful_votes": 0,
      "publication_date": 20160615
    },
    {
      "title": "Bad Customer Service",
      "text": "The instructions are worthless, but you should be able to figure it out. The straight poles go between the horizontal spans (two on the bottom, one on the top). What I don't like is one of the straight poles came without the spring-loaded nipple. So, I called the company, got their customer service and was told, \"We dont' have parts.\" Just return it. So, that's what I'm going to do...take it apart, put it back in the box and return it to Amazon. On the positive side, it does appear to be pretty heavy duty...so once I get one that is complete I'm hoping it should last for a bit.",
      "rating": 2.0,
      "verified": true,
      "author": "Ken Esq",
      "helpful_votes": 2,
      "publication_date": 20150609
    },
    {
      "title": "it's nice",
      "text": "it should last. it is a two person assembly just like it says. there is word about the durability of the tie-down bungee hooks breaking or not lasting long. if this happens it's a easy and very cheap fix. just get some thick hair tie-backs, they're easy to find, same size and strength. reuse the hook.",
      "rating": 5.0,
      "verified": true,
      "author": "MCS",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "so WE love it! I would recommend this for any youngster ...",
      "text": "We bought this for our grandson's Christmas present. Although they live in Northern Washington state, he practices/plays with it daily...regardless of snow, rain or mud. He LOVES it...so WE love it! I would recommend this for any youngster and/or adult who desires practice hitting baseballs, footballs and/or lacrosse balls! Very sturdy construction, too.",
      "rating": 5.0,
      "verified": true,
      "author": "The Agora",
      "helpful_votes": 2,
      "publication_date": 20170203
    },
    {
      "title": "Brought back fond memories",
      "text": "Putting this together for my son brought back fond memories of the one I had when I was his age. The way it's put together is different, but the concept's the same. The only thing I wish is that it'd fold up more compactly. Mine had 2 legs that you could swing in and out, so you could make it flat, where this unit has the angled sections on the bottom. Also, I haven't found the need for the spikes yet, but that's only with a tennis ball. Lastly, putting it together is defnitely a job for 2 people since you really need to stretch the netting to get it around the hooks.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald F. Freeman",
      "helpful_votes": 0,
      "publication_date": 20140728
    },
    {
      "title": "Good Product",
      "text": "Very solid product. Easy to assemble the netting and tubes. My kids really enjoy it as it lets them work on several items. Wish i had a way to sturdy it more as the ground is very hard here in Alabama during the summer time and the stakes just bend. Other than that, great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Check the net before constructing",
      "text": "The net was looped and melted/attached to itself. Not even sure how it was possible... Luckily, I had a couple days before Xmas to find a similar item locally.",
      "rating": 1.0,
      "verified": true,
      "author": "Waterproof in Oregon",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "DO NOT BUY - Cannot be kept outdoors",
      "text": "The net works great. The problem is that this is an outdoor product. In less than a year of keeping it in my backyard, so that my son could use it, the hooks on the bungee cords started to rust. Shortly after that they started to break one by one. I finally decided to call Champion Sports and they told me that they don't offer any replacement parts. Find a different company to deal with.",
      "rating": 1.0,
      "verified": true,
      "author": "MikeD",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Provides hours of fun (and training at the same time)",
      "text": "High quality pitch back. It does exactly what it is supposed to. Provides hours of fun (and training at the same time). The kids go out and throw at that thing all the time. It is improving their skills and they have a blast doing it. Great investment. Well worth the money. If you have kids that are interested in baseball then I would recommend this. My boys are fanatics so they love it. If you have kids that need to work on their skills this is great too.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Mellon",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "Great net for Lacrosse",
      "text": "Excellent! kids like the bottom portion alot for lacrosse that the nets specifically marked for lacross don't have. In fact don't worry when it comes and only shows baseball on it and maybe says its for baseball - works great for lacrosse too. great price compared to our sporting goods store - significantly less.",
      "rating": 5.0,
      "verified": true,
      "author": "TMcManus ",
      "helpful_votes": 2,
      "publication_date": 20160520
    },
    {
      "title": "Good Screen",
      "text": "Nice pitch back screen. Took a little getting used to but was very helpful for anytime throw and catch sessions to get ready for softball season.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter Gibson",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "A great tool for general throwing, pitching and fielding",
      "text": "Our 10 year old son loves his new pitch back. Thick frame, durable nylon/hook attachments and light weight. We were looking into something that can be used to work on general throwing accuracy and pitching. Love the fact we can now incorporate fielding into the practices. Don't get me wrong I am out there every day practicing with him, this is a nice tool for summer break when I am at the office! :) Great buy",
      "rating": 5.0,
      "verified": true,
      "author": "Mr G",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Sturdy and easily assembled.",
      "text": "Put together easily by my 13 year old this has been used for lacrosse practice for the past few months. It is sturdy and has stayed in place (anchored down with supplied pegs). It doesn’t show signs of wear tear, even though we leave it outside, but it’s only been a few months.",
      "rating": 5.0,
      "verified": true,
      "author": "amanda botwood",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Really Good Pitch-Back",
      "text": "This pitch-back is way better than the flimsy one I had as a kid. The poles are 1-1/4\" tubes that connect with spring plunger detents. The bungees and nylon net provide good spring back. My kids are using it to practice their throwing and catching for little league. I may even use it if they let it sit idle long enough. One drawback is it doesn't fold flat for storage. But you know what? I'd rather have something that is built solid and works well. I'll disassemble it for winter storage.",
      "rating": 5.0,
      "verified": true,
      "author": "no name",
      "helpful_votes": 0,
      "publication_date": 20150624
    },
    {
      "title": "Works fine, but straps break easily when slid across driveway",
      "text": "Works just fine for a stationary bounce back. The straps are thinner than I've had on previous versions and hence break easily...especially when you drag the unit around the yard. Best to avoid dragging it on driveway...but it's too heavy and awkward for a child to lift it.",
      "rating": 3.0,
      "verified": true,
      "author": "Michele B.",
      "helpful_votes": 2,
      "publication_date": 20160708
    },
    {
      "title": "Nice rebounder",
      "text": "Solid construction and very springy. Will see how it holds up.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry45",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Nice product",
      "text": "It is easier to put together with two people. It works very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Satisfied Customer",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Great purchase, excellent materials",
      "text": "I've been using this almost every day for a few weeks and it works great. Took me about 45 minutes to set it up, but the process wasn't too difficult. I'm 27 years old and have played baseball since I was 6 and this works perfect for me. I have set it up on grass primarily and it stays in place just fine. The one time I put it on my driveway it slid a bit but not bad. It bounces back very well and the materials do not seem cheap at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Cory P",
      "helpful_votes": 2,
      "publication_date": 20160209
    },
    {
      "title": "Grandsons love it!!!",
      "text": "I bought this for my grandsons and they love it. The only problem they reported to me was that the net hooks rusted after the first rain. Other than that it works great and they use it every day. One grandson says it made a big difference in his ability to throw accurately and directly responsible for his teams ability to finish first in his league this year. Thanks Amazon for providing a high quality baseball backstop which gave me the ability to make my grandsons so happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry A. Waters",
      "helpful_votes": 0,
      "publication_date": 20131019
    },
    {
      "title": "Don't like the angle",
      "text": "very sturdy, as promised, but while the frame is rust proof, some of the small parts are not. Also, we do not like the angled frame, as it is difficult to get the ball to return to you in an easily catchable way. It would be great to practice fielding, but we had hoped to use it more for practicing pitching.",
      "rating": 3.0,
      "verified": true,
      "author": "Lisa M",
      "helpful_votes": 3,
      "publication_date": 20151023
    },
    {
      "title": "Great quality. Sturdy and tight",
      "text": "Perfect for my 10 year old son for baseball. We tried a less expensive pitch back and we got what we paid for. This was still very reasonable yet easy to assemble, sturdy, and durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Gransdon Loves It",
      "text": "This is our second purchase. Bought it for our grandson. He used it a lot and eventually it wore out. He asked for another one because he liked it so much.",
      "rating": 5.0,
      "verified": true,
      "author": "GumbyGirl",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Very nice pitch back",
      "text": "This is the Cadillac of pitch back screens. It is easily twice the heft of your typical cheapo version. The lower base section is basically an inverted 'V', and there's a hinge that allows angle adjustment of the upper screen. My only complaint is that there doesn't seem to be as much bounce energy from this setup as I expected. I've tried adjusting the net hooks to different areas to adjust/even out the tension across the screen, but it hasn't made much of a difference. Still, very happy with the purchase. It's worth the extra cost in my opinion.",
      "rating": 4.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 0,
      "publication_date": 20140325
    },
    {
      "title": "Good solid product",
      "text": "Yes this is awesome. Good quality and sturdiness and has many throwing options",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Very happy with pitchback for Lacrosse",
      "text": "Great product for the price! We bought this to practice lacrosse for a middle schooler. Set up was easy and took about 40 min with one person (a mexhanically inclined woman 😊) I read the other reviews and we plan to move it with care and take out of the elements when not using to extend its life.",
      "rating": 5.0,
      "verified": true,
      "author": "GP",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Used?",
      "text": "This seems like a pretty great product, but ours arrived with some dings and with rusty components. Perhaps we got a used one or a floor model? We plan to keep it because our son is using it and repackaging would be very difficult, but disappointed in getting a product that is not as advertised.",
      "rating": 2.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 4,
      "publication_date": 20160604
    },
    {
      "title": "My son plays lacrosse and was looking for a good re-bounder to practice with",
      "text": "My son plays lacrosse and was looking for a good re-bounder to practice with. This works perfectly! It is sturdy and easy to use. It was also a better price than some of the others out there. Overall a great buy. We are really happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "RH27",
      "helpful_votes": 2,
      "publication_date": 20150611
    },
    {
      "title": "Great for Volleyball",
      "text": "This was the second rebounder we've tried and it works very well. Our daughter's season was throttled by the coronavirus, like so many other athletes. With courts closed and social distancing in place, it's been difficult to do any drills or practice. She's really enjoyed using this rebounder.",
      "rating": 5.0,
      "verified": true,
      "author": "BookWurm",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Great--Thanks Amazon!!",
      "text": "After reading a bunch of reviews (on Amazon) I went with this for my 13 year old. It's great---no doubt about it---just what a sports pitch back should be. I love the multiple angles for various play. My only complaint---the instructions are terrible!!!! I had to go on Amazon's website and print pictures so I could figure out how to put it all together.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Winow",
      "helpful_votes": 0,
      "publication_date": 20130706
    },
    {
      "title": "Great Pitch Back",
      "text": "This might be one of my all time best purchases on Amazon. This pitch back is sturdy and performs great. The red ribbon seemed to make the ball not bounce back as well, but we just removed it and it was fine. The only problem you may have is that it is so big. Storage may be an issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Tate",
      "helpful_votes": 0,
      "publication_date": 20150821
    },
    {
      "title": "Seems well made. Not that hard to assemble.",
      "text": "Sturdy and well made. Not that hard to assemble. My boys LOVE it! Just got it this week. We will see how well it holds up. So far so good!",
      "rating": 5.0,
      "verified": true,
      "author": "84fordltd",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "they are not coated like they should be for outdoor",
      "text": "the net has been working very well and it is used often. the only issue I have is after a few months of use, some of the rubber bands that pull the net to the frame have frayed and broke due to the friction of rubbing against the ground. also, all of the hooks are rusting. they are not coated like they should be for outdoor use",
      "rating": 4.0,
      "verified": true,
      "author": "EricB",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "This net was great for the first five months with very little use ...",
      "text": "This net was great for the first five months with very little use through the winter, but as we began to use it more and more the bungee cords that pull the net for tension began to break. Unfortunately, it's past the return window and the net doesn't have the tension now to be useful. Very fun while it lasted - but short life-span for the price.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160614
    },
    {
      "title": "Great help for Lacrosse",
      "text": "We use this for lacrosse. My 10 year old son can break it down and carry the parts. It's easy to put up and take apart. We store it on our patio when not using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Adrienne",
      "helpful_votes": 0,
      "publication_date": 20160518
    },
    {
      "title": "Great to use alone!",
      "text": "Still working after using all summer. Does what it should.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Perfect gift for my 5 year old",
      "text": "Perfect gift for my 5 year old. He always wants someone to play catch with him and now he can practice without help.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley J",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Totally worth it",
      "text": "My kids love this. Currently we use it for baseball and soccer.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph W. Yang",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "Worth the money!",
      "text": "The quality of this was better than expected. There were a few dents in the frame, but nothing to compromise the integrity of the unit. It doesn't rock back when a ball is thrown at it like some other nets. I think this is the best one of these type of items I have bought.",
      "rating": 5.0,
      "verified": true,
      "author": "KrH",
      "helpful_votes": 0,
      "publication_date": 20150110
    },
    {
      "title": "This is being used as a LaCrosse net and it's ...",
      "text": "This is being used as a LaCrosse net and it's working perfectly. It is outdoors constantly and holding up fantastically",
      "rating": 4.0,
      "verified": true,
      "author": "David & Peggy Ray",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "good construction. Will last and it works better than others.",
      "text": "Way better than others we have bought. This one will last and it works really well. It was not hard to assemble and the construction goes above and beyond the low cost. My son loves it and uses this everyday. We just leave it up and outside because it's size will not fit through a standard door frame.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaime Q. Willmann",
      "helpful_votes": 0,
      "publication_date": 20140123
    },
    {
      "title": "Good quality net and frame",
      "text": "This is a pretty good quality net and solid frame system. I've seen far less sturdy frames and lighter duty nets on other systems. The thin metal ground pegs are worthless. You'll need to improvise some better quality ground stakes as what's supplied will pull out of the ground every few throws. I substituted 16 inch long tent stakes connected over the frame by strap ties. Once I installed my own ground stakes the frame never moved again. It must be staked down solidly to work properly. I'm throwing a heavy softball and once anchored this is a good quality product.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff H.",
      "helpful_votes": 5,
      "publication_date": 20100912
    },
    {
      "title": "pretty darn good",
      "text": "came in a small box so i was nervous that i had, yet again, purchased a junky bounce back. very easy to put together...though figuring out the net took a little bit. has held up well over the last month with great bounce. i'd recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Amy O",
      "helpful_votes": 0,
      "publication_date": 20140611
    },
    {
      "title": "I thought it would be a bit different but it's good for the job",
      "text": "My son likes it. I thought it would be a bit different but it's good for the job.",
      "rating": 4.0,
      "verified": true,
      "author": "Cheyenne Kellogg",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Awesome net! Really surprised how well it throw back ...",
      "text": "Awesome net! Really surprised how well it throw back without any reinforcement - my son is digging practicing lacrosse, soccer, and football with this net. We've had 4 months now, and it is still used every day!",
      "rating": 5.0,
      "verified": true,
      "author": "Robin",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "Very nice pitchback.",
      "text": "So far so good.....assembly was easy, adjustments are easy, and works as intended. My 12-year-old son uses it about 2 hours a day and loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "bri",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "are pleased with the quality of this particular pitch back",
      "text": "My 7 year old Grandson loves this gift! We, too, are pleased with the quality of this particular pitch back. Assembly directions could be improved, but even still, my husband had it together in a reasonable time. I would choose this particular one again.",
      "rating": 5.0,
      "verified": true,
      "author": "GaGa",
      "helpful_votes": 0,
      "publication_date": 20150526
    },
    {
      "title": "Doesn't last",
      "text": "I bought my son this 10 months ago, and it was amazing for about 8 months... then the cords started to wear out and snap, killing the tension in the net. Weirdly, there's no easy way to buy replacements for these cords. I e-mailed with Champion about this, and their customer service person blew me off.",
      "rating": 2.0,
      "verified": true,
      "author": "Oracle of Adelphi",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "Great alternative to playing catch",
      "text": "Bought this for our 10-year-old son who loves to play catch but can never talk his siblings into joining him in the yard. It seems best for practice on grounders, but can do some other \"tricks\" depending on the angle of the net. It is durable and folds for somewhat easy storage. Good value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "S. DiGrazia",
      "helpful_votes": 0,
      "publication_date": 20140120
    },
    {
      "title": "Five Stars",
      "text": "This was actually fun to assemble. Well built and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "We love this. The only issue is if it gets ...",
      "text": "We love this. The only issue is if it gets dragged across the driveway the bands that hold the net to the metal frame will fray and break. We have had hours of fun and use it for baseball, soccer and lacrosse.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Mullen",
      "helpful_votes": 0,
      "publication_date": 20161004
    },
    {
      "title": "Does what it says",
      "text": "This product is \"as advertised.\" Set-up instructions leave a bit to be desired, but with a little imagination it's not too hard to assemble. After that, the only downside is finding a place for it when it's not in use.",
      "rating": 4.0,
      "verified": true,
      "author": "gr8tfuldad2003",
      "helpful_votes": 0,
      "publication_date": 20140207
    },
    {
      "title": "Very sturdy product. Grandson 8 loves it",
      "text": "Very sturdy product . Grandson 8 loves it! Highly recommend it. Easy to put together with patience! Really appreciate the reviews on it. It helped me to make my choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorraine Ruppert",
      "helpful_votes": 0,
      "publication_date": 20150826
    },
    {
      "title": "bungee cords rot and break",
      "text": "this is only 6 months old and probably only 4 months of use---and the bottom bungee cords are starting to rot and pop off. I saw other posts that calling customer service is a waste of time, so i won't bother.",
      "rating": 1.0,
      "verified": true,
      "author": "giant freakhead",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Great for learning to play catch a baseball",
      "text": "My grandson loves this. He is going to play T-ball this summer and can practice when nobody is available to play catch with him.He play with this for hours.I looked at cheaper models and would not buy one, as they are not built as good.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Meehan",
      "helpful_votes": 0,
      "publication_date": 20130714
    },
    {
      "title": "PITCHBACK",
      "text": "NO INSTRUCTIONS, NO ONE TO WRITE, NO 800 NUMBER, SO NO REPLACEMENT PARTS TO ORDER IF ANYTHING IS MISSING OR BREAKS. OTHER THAN THESE COMPLAINTS, PITCHBACK WORKS GREAT.",
      "rating": 4.0,
      "verified": true,
      "author": "Garry Zodda",
      "helpful_votes": 0,
      "publication_date": 20140307
    },
    {
      "title": "Gift for my grandsons 5th birthday. He's loving it ...",
      "text": "Gift for my grandsons 5th birthday. He's loving it for baseball, hurling and soccer. I think his dad is jealous.",
      "rating": 5.0,
      "verified": true,
      "author": "DuffyDawg",
      "helpful_votes": 2,
      "publication_date": 20141002
    },
    {
      "title": "Sturdy construction. INSTRUCTIONS ARE EXTREMELY LACKING IN DETAIL",
      "text": "Performs exactly as advertised. Sturdy construction. INSTRUCTIONS ARE EXTREMELY LACKING IN DETAIL. Better off just looking at the picture on the front of the box.",
      "rating": 5.0,
      "verified": true,
      "author": "RickR",
      "helpful_votes": 0,
      "publication_date": 20150312
    },
    {
      "title": "Evan's Nana",
      "text": "We bought this for our 8 year old grandson and hoped it would \"fit the bill\" and it sure did. It is stable and also allows our granddaughter to use it as a soccer net. The kids love it and that was all we were looking for along with being a really useful \"practice\" session.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Eagle",
      "helpful_votes": 0,
      "publication_date": 20110717
    },
    {
      "title": "Great product",
      "text": "My 12 year old daughter uses this to practice pitching for softball. It seems very sturdy and works well. The bounce back has also been great to help her with her catching. My younger daughter, 7 years old, also uses it to practice kicking her soccer ball and getting the bounce back. We've had it for almost a month and I think it will last for some time. The kids do take it in the garage after they use it because we get fairly high winds where we live.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenna Harris",
      "helpful_votes": 0,
      "publication_date": 20150601
    },
    {
      "title": "Had to clamp 2 2x4's to the bottom to keep ...",
      "text": "Had to clamp 2 2x4's to the bottom to keep it from tipping over.",
      "rating": 3.0,
      "verified": true,
      "author": "H. Adk.....",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "Easy to set up",
      "text": "Easy to set up, and my kid loves pitching into it. I do not recommend using it to hit a ball into, unless getting hit in the face with balls is your thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Quacktor",
      "helpful_votes": 0,
      "publication_date": 20150724
    },
    {
      "title": "My grandsons enjoy using this sports equipment",
      "text": "This was a gift for my grandsons. They love it.",
      "rating": 5.0,
      "verified": true,
      "author": "beth",
      "helpful_votes": 0,
      "publication_date": 20170305
    },
    {
      "title": "Five Stars",
      "text": "was easy to put together for my husband and is just as described",
      "rating": 5.0,
      "verified": true,
      "author": "tequilla",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Very well built.",
      "text": "This is a heavy duty pitch back. Not at all like the cheaper ones. The kids love it. It could used a little more angle on the bottom part for pop ups but well worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "James M. Laclair",
      "helpful_votes": 0,
      "publication_date": 20130522
    },
    {
      "title": "We didn't set it up until May when the weather was nice outside. Rebounder works great the but quality of ...",
      "text": "My son received this item for his birthday gift in February. We didn't set it up until May when the weather was nice outside. Rebounder works great the but quality of this item is terrible. After just a few weeks, the clips holding the net onto the frame have broken or cracked. The frame has also started to rust from being outside. It should have lasted more than 6 weeks.",
      "rating": 2.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20160624
    },
    {
      "title": "Excellent",
      "text": "We use it for my daughter to practice Lacrosse and for my son who catches Tennis balls for football. Excellent",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160509
    },
    {
      "title": "Heavy duty steel frame makes this a good choice. Assembly is easy in about 15 minutes",
      "text": "Heavy duty steel frame makes this a good choice. Assembly is easy in about 15 minutes. Two angles of pitch back net allow for all types of practice. Well worth the few extra dollars over the light weight aluminum frame sets.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom R",
      "helpful_votes": 0,
      "publication_date": 20160610
    },
    {
      "title": "Great for Kids but Hard to Store",
      "text": "Great product for 6 year old son. Beats him throw a ball off the wood fence. Only concern is legs won't fold flat. It is fine in the rain, but you need to bring it in for the winter. It takes up a lot of space.",
      "rating": 3.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20140522
    },
    {
      "title": "Fun multi-sport net",
      "text": "Fun multi-sport net. My nephew is enjoying using this net for multiple purposes. So far, the quality has been good.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20141104
    },
    {
      "title": "Great investment!",
      "text": "My 8 year old loves it and can use it on the back patio and I know he has improved throwing and catching the ball. Great investment!",
      "rating": 5.0,
      "verified": true,
      "author": "sfl15",
      "helpful_votes": 0,
      "publication_date": 20160613
    },
    {
      "title": "Easy to assemble and hours of fun",
      "text": "My 11 year old son put this together on his own with a little help from me. He now can spend literally hours refining his throwing motion and working on pop ups and grounders.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Gaskins",
      "helpful_votes": 0,
      "publication_date": 20130605
    },
    {
      "title": "A great item",
      "text": "Well built and sturdy. Great for baseball, softball and soccer. The downside is it does not fold down flat so storing it is a bit of a pain if you have limited space.",
      "rating": 4.0,
      "verified": true,
      "author": "Michelle Livermore",
      "helpful_votes": 0,
      "publication_date": 20131003
    },
    {
      "title": "Great product",
      "text": "My kids love it. Shoot lacrosse balls & baseballs at it daily.",
      "rating": 5.0,
      "verified": true,
      "author": "JESSICA SMITH",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Very durable and sturdy and will last a long time",
      "text": "Very durable and sturdy and will last a long time. The metallic material for the frame should last a long time and avoid rusting away like cheaper models from other competitors. Probably recommend storing during winter months. Great for fielding and pitching. It was rather easy to assemble. I liked having the additional hooks to secure into the ground as well as spare hooks for the net. Looking forward to several more seasons. Play ball!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Campbell",
      "helpful_votes": 0,
      "publication_date": 20140921
    },
    {
      "title": "This is a truly excellent, first class",
      "text": "This is a truly excellent, first class, well made, and heavy duty piece of equipment!!! And when AOL dropped the price from $75. to $50. just before I ordered it that was even better.",
      "rating": 5.0,
      "verified": true,
      "author": "Rudy",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "A good net at a great price",
      "text": "Got this so my boys could practice lacrosse. I read in another review that it works well for lacrosse, and it does. Assembly was a bit of a pain. There was little guidance as to where to put the springs. Still I muddled through an in about 30 minutes or so the net was set up in the back yard. The angle of the net is adjustable, so you can make the balls pop up a bit when they come off the net or get deflected towards the ground. It's not really a substitute for another person to have a catch with, but all-in-all it was money well spent.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Cullen",
      "helpful_votes": 2,
      "publication_date": 20120426
    },
    {
      "title": "Five Stars",
      "text": "Sits outside through all our Wisconsin elements and has held up. Worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "jason warzynski",
      "helpful_votes": 0,
      "publication_date": 20150218
    },
    {
      "title": "Sturdy!",
      "text": "Wow! This is a great pitch back! It is really sturdy (love that it's not pvc, it doesn't blow over as easily and won't dry out and crack.) and my boys are outside every day using it.",
      "rating": 5.0,
      "verified": true,
      "author": "DM",
      "helpful_votes": 0,
      "publication_date": 20131121
    },
    {
      "title": "this fits the bill quite nicely for a fraction of the cost",
      "text": "This pitch back is just the thing for lacrosse practice for my 8-year-old grandson, not to mention Dad and Grandpa are having a ball with it too. Pitch back is solidly built and well balanced, returns thrown balls very well. Tilting top part is just what I was looking for in this type of item. Neighbor has something similar for his baseball-playing son, but the top part is stationary. Instead of spending $100 up past $200 for a lacrosse bounce back, this fits the bill quite nicely for a fraction of the cost. Now if you'll excuse me, I need to have some practice with the pitch back so that the grandson doesn't make me look bad!",
      "rating": 5.0,
      "verified": true,
      "author": "James J. Bjaloncik",
      "helpful_votes": 0,
      "publication_date": 20150629
    },
    {
      "title": "Good practice piece",
      "text": "My husband and I had a little trouble getting it put together, but it needs to be tight enough so the balls will spring back at you. Our daughter and son just love practicing with this pitch back.",
      "rating": 4.0,
      "verified": true,
      "author": "twobee",
      "helpful_votes": 0,
      "publication_date": 20121206
    },
    {
      "title": "Quality product for training the kids. Has stood up ...",
      "text": "Quality product for training the kids. Has stood up to a full summer in the direct sun and plenty of rain and winds.",
      "rating": 5.0,
      "verified": true,
      "author": "DIYWATERDOG",
      "helpful_votes": 0,
      "publication_date": 20140826
    },
    {
      "title": "Best of the bunch",
      "text": "Solidly built. I put some concrete blocks as additional weights and it really helps",
      "rating": 5.0,
      "verified": true,
      "author": "jg",
      "helpful_votes": 0,
      "publication_date": 20150515
    },
    {
      "title": "Five Stars",
      "text": "Great quality, easy setup, 10 year old baseball player loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Gooch",
      "helpful_votes": 0,
      "publication_date": 20160415
    },
    {
      "title": "Five Stars",
      "text": "Kids love it. Probably strong enough for 45 mph throw",
      "rating": 5.0,
      "verified": true,
      "author": "NJ arborist",
      "helpful_votes": 0,
      "publication_date": 20160530
    },
    {
      "title": "Perfect. BMG son loves it and uses it all ...",
      "text": "Perfect. BMG son loves it and uses it all the time. I wish it had a little more tension.",
      "rating": 5.0,
      "verified": true,
      "author": "dd",
      "helpful_votes": 0,
      "publication_date": 20160313
    },
    {
      "title": "Good quality. Very versatile",
      "text": "Good quality. Very versatile. I assembled it alone - Assembly took me about an hour - not bad at all.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremy Weinberg",
      "helpful_votes": 0,
      "publication_date": 20150516
    },
    {
      "title": "Easy one person setup",
      "text": "Simple to set up and fun to use. Works well with LAX",
      "rating": 4.0,
      "verified": true,
      "author": "Rex fx",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "Kids really like it. Great for practicing there throws and",
      "text": "Kids really like it. Great for practicing there throws and catches",
      "rating": 4.0,
      "verified": true,
      "author": "CMac",
      "helpful_votes": 0,
      "publication_date": 20151105
    },
    {
      "title": "Great for the price!",
      "text": "My son loves his new pitch back. It was worth it for the price we paid. He uses it all of the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina R.",
      "helpful_votes": 0,
      "publication_date": 20150730
    },
    {
      "title": "Sturdy, easy to assemble",
      "text": "Sturdy, easy to assemble, and works well. Loses one star because it's awkward to store: The inverted V portion does not fold so it cannot go flat against a wall.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephen Ferrari",
      "helpful_votes": 0,
      "publication_date": 20150810
    },
    {
      "title": "Five Stars",
      "text": "Easier to put up than I thought. Me and my 7 year old son put it together.",
      "rating": 5.0,
      "verified": true,
      "author": "Raschel S.",
      "helpful_votes": 0,
      "publication_date": 20141005
    }
  ],
  "product_meta": {
    "title": "Champion Sports BN4272 Rebound Pitchback Net, Adjustable Training Practice Rebounder Bounceback Screen",
    "description": "MULTI-SPORT EQUIPMENT NETTING \nChampion Sports pitch-back rebound nets are ideal for a variety of sports practice training, including baseball, softball, lax, soccer, football, volleyball, basketball or tennis. Whether you are looking for a net for team practice, or want one net at home to allow your multi sport athlete to train, this screen has you covered. \n\nADJUSTABLE REBOUNDING SCREEN \nLarge, heavy-duty netting measures 42 inches wide x 72 inches tall and rotates to several different angles for multi sport drills, including pitching, ground ball practice, pop fly drills or other throwing and kicking accuracy drills. The removable target allows athletes to aim high or low on the screen. \n\nPORTABLE STEEL FRAME \nOur bounce back multisport net has a 1 ¼ inch diameter powder coated steel frame that is extremely durable but still lightweight for easy transportation of your training device from field to home. This screen can withstand strong throws and kicks but won’t break your back when you want to move it inside or to a different area. \n\nSTURDY NYLON NET \nChampion Sports pitch back rebounder is constructed with a durable nylon net screen that can withstand tough shots from baseballs, soccer balls and even basketballs without snapping. Dozens of bungee attachments mean the netting will stay secure no matter what. \n\nIDEAL YOUTH OR ADULT SCREEN \nThis versatile training tool has a quick and easy assembly, meaning you can spend more time playing and training and less time setting up. The screen can withstand throws by youths or adults looking to get in extra practice in a variety of different sports. \n\nProduct Details: \nDimensions: 42 inches wide x 72 inches tall \n1 ¼ inch diameter powder coated steel frame \nDurable nylon netting \nAdjustable for different training exercises \nCan withstand baseballs, soccer balls and even basketballs",
    "rating": 4.4,
    "feature_bullets": [
      "Multi-Sport Equipment Netting: Champion Sports Pitch-Back Rebound Nets Are Ideal for a Variety of Sports Training, Including Baseball, Softball, Lax, Soccer, Football, Volleyball, Basketball or Tennis",
      "Adjustable Rebounding Screen: Large Netting Measures 42 Inches x 72 Inches and Rotates to Different Angles for Multi Sport Drills, Including Pitching, Ground Ball Practice or Other Throwing Accuracy",
      "PORTABLE STEEL FRAME: BOunce back multisport net has a 1 ¼ inch diameter powder coated steel frame that is durable but lightweight for easy transportation of your training device from field to home",
      "STURDY NYLON NET: Champion Sports pitch back rebounder is constructed with a durable nylon net screen that can withstand tough shots from baseballs, soccer balls and even basketballs without snapping",
      "IDEAL YOUTH OR ADULT SCREEN: This versatile training tool has a quick and easy assembly and can withstand throws by youths or adults looking to get in extra practice in a variety of different sports"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "21.4 x 5.5 x 31.8 inches; 1 Pounds",
      "Item model number": "BN4272",
      "Department": "Unisex-adult",
      "Date First Available": "September 16, 2003",
      "Manufacturer": "Champion Sports",
      "ASIN": "B000XQH8FQ",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Pitching Trainers",
      "Training Equipment",
      "Baseball",
      "Sports & Outdoors",
      "Team Sports",
      "Sports & Fitness"
    ],
    "price": 82.23
  }
}