{
  "website_summaries": [
    {
      "verdict": "Fresh and well-balanced on the tongue, and suitable for many types of diets including vegan, low sodium, and kosher, making this a top choice for health-conscious consumers.",
      "pros": [
        "One of the most well-rounded bars on the market, with a blend of fruit and nuts that is kosher, vegan, dairy-free and gluten-free, as well as Whole 30 compliant",
        "Has a fresh, “clean” taste and a great chew"
      ],
      "cons": [
        "Dried apples are a little too tart for some"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Do not buy, boxes are opened and tainted",
      "text": "Reciever with box open and 2 bars missing. The other 3 flavors of bars I opened all had correct amount but ripped and scotch taped boxes..... Won't be eating any of these!!!",
      "rating": 1.0,
      "verified": true,
      "author": "TO",
      "helpful_votes": 53,
      "publication_date": 20170415
    },
    {
      "title": "Don't buy!!!",
      "text": "Buyer beware! Like everyone else is saying I received these bars today, opened and tampered with. The packages are sticky and clearly not worth $16/box. I did not have any bars missing like others were saying but I will not be feeding any of these bars to my family due to the shape these were in when I opened my package. See pictures attached.",
      "rating": 1.0,
      "verified": true,
      "author": "krista",
      "helpful_votes": 9,
      "publication_date": 20190406
    },
    {
      "title": "Bars came with a one month date to be eaten ...",
      "text": "Bars came with a one month date to be eaten by. Bars still within that date range had mold.",
      "rating": 1.0,
      "verified": true,
      "author": "Janelle",
      "helpful_votes": 18,
      "publication_date": 20180212
    },
    {
      "title": "Damaged/Open Box",
      "text": "Was really excited to stock up on a bunch of Lara bars, and was disappointed when all three boxes I ordered came damaged, partially open (seal not only broken but halfway pulled back) and poorly taped together. I'm not one to care at all about the aesthetic or appearance of my food, but isn't there some kind of global rule that you never eat anything that's already been opened?! Maybe it's just me, but I would prefer if the whole box had come sealed for how much I'm paying for peace of mind...",
      "rating": 3.0,
      "verified": true,
      "author": "MaryJ44319",
      "helpful_votes": 2,
      "publication_date": 20180915
    },
    {
      "title": "Update: This are actually quite good",
      "text": "So not sure what happened with my original order, but the bars in it were dry and fairly tasteless. After a friend gave me a few bars she had purchased, I have decided my original order was a fluke. I have purchased again and the bars are very good. These and the peanut butter are my favorite Larabars.",
      "rating": 4.0,
      "verified": true,
      "author": "WayfarerK",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "These are good, but I will definitely buy other flavors instead",
      "text": "These are good, but I will definitely buy other flavors instead. I have tried 5 flavors of Larabars, here's my ranking: 1. Peanut Butter Chocolate Chip 2. Chocolate Chip Cookie Dough (close second) 3. Blueberry Muffin (close third, get these if you don't love chocolate) 4. Apple Pie 5. Fruits + Grains Mango Spinach Cashew (these not good but edible)",
      "rating": 4.0,
      "verified": true,
      "author": "Gary S",
      "helpful_votes": 2,
      "publication_date": 20170905
    },
    {
      "title": "I USED to like Lara bars",
      "text": "For years I bought larabars in grocery stores and they were delicious. But these boxes I bought are terrible! The bars are so dried out and stale they taste like cardboard. Too bad the box is opened or I'd send them back for a refund. I'm NEVER buying larabar again! Bet you won't publish this review.",
      "rating": 1.0,
      "verified": true,
      "author": "feralcat",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Great Food-Bars, Horrible Shipment",
      "text": "These are very yummy food bars and they are great in giving you a boost of energy! I was very disappointed, though, in how they arrived. This is why for “freshness” I put a one star. The bars where dumped completely out of their cardboard box, and the packaging had been destroyed. At least the plastic wrappers were not effected.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "The only thing right in the world.",
      "text": "You know how you'd think fruit and nut bars are healthy? And then you read the ingredient list and it's all flour and sugar? And you start to doubt everything down to the very fibers of the universe? These bars with set you straight. They will restore your faith in righteousness. They will balance the force. They are FRUIT and NUT and nothing else.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonian",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "This is NOT ACCEPTABLE !!!",
      "text": "Bought these for myself and grand kids. I usually find the apple pie luna bars especially tasty, however these were NOT. Something made me check the expiration date cause they really tasted OLD. Sure enough they were TWO WEEKS FROM EXPIRATION !!!",
      "rating": 1.0,
      "verified": true,
      "author": "catherine",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Yummy and filling",
      "text": "I was really happy to find these on Amazon for such a good price (1 box of 16 bars). Shipping was quick as always. These gluten free bars are really tasty, considering they’re gluten free. The apple pie variety has been my absolute favorite for a while, fallowed by the cashew cookie ones. They are super tasty and filling at the same time. Great on the go or for breakfast with a glass of milk. That’s how my kids eat them, and they don’t like gluten free things so that’s a real complement. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Roblox_Mom",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Try before you buy",
      "text": "These are awful. They are chewy and gummy. This is prolly the worst flavor I've had. Honestly... I'd rather go without. The amount of money I spent for the entire box was my fault. I should have tried before I bought. Gross.",
      "rating": 1.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "This is my favorite flavor Lara bar",
      "text": "I love Lara bars simple, natural and gluten free ingredients. We eat Lara bars (along with a couple other staples) mainly during travel as they keep really well and have all natural ingredients which is good when you don’t know what’s you’re going to be able to eat. This flavor isn’t too sweet and doesn’t have chocolate in it so it won’t melt. Since there aren’t that many gluten free apple pies this can also be a sweet occasional treat for those following the whole 30 or other low carb type diets.",
      "rating": 5.0,
      "verified": true,
      "author": "Alessandra",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Amazon Ate My LaraBars",
      "text": "Box had been tampered with! Only 12 out of the 16 bars in my box. Someone at amazon was hungry lol",
      "rating": 1.0,
      "verified": true,
      "author": "Mariah Rice",
      "helpful_votes": 3,
      "publication_date": 20190205
    },
    {
      "title": "Beware of epxiration date on products. Will not buy again",
      "text": "Received the products and noticed it tasted different from bars I purchased at local stores. Found out all the bars had expired. All 40 bars were expired. Very disappointing. Will not purchase again. You would think the seller would send unexpired products. Integrity",
      "rating": 1.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Larabar",
      "text": "I love these. The apple flavor I chose is delicious. They are packed well and each bar is very fresh and tasty. I have digestive issues and I can eat these bars and feel good afterwards. The price is great for a box of these. I will order again for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Macchiaverna",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Disappointed",
      "text": "Bought for hub to take to work as a snack. After eating he said no more so I tried one. I can eat about anything but did not set well with me either. May have possible laxative effect. You've been warned. Not worth the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Online Shopper",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Cheaper than my local store.",
      "text": "For years my local store's price was the same as Amazon. Now it seems there was a price drop and I welcome that fact. Such a great product for a quick \"snack\" fix. I'll continue buying them for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Webwar",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Varying Degrees of Freshness",
      "text": "Old, dried out and discolored. Maybe the tractor trailer broke down in Arizona last summer and they cooked for a few days. A shrewd business man/woman marked them down and then they landed on my doorstep.",
      "rating": 1.0,
      "verified": true,
      "author": "Mickey C",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Health",
      "text": "I like these bars over most other store brands because of they're made of just a few healthy ingredients and no preservatives. I'm going to start making them at home to save myself ~$0.50/day but will probably use the same ingredients as these. Excellent taste!",
      "rating": 5.0,
      "verified": true,
      "author": "Grace Kummerfeld",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "my go-to larabar.....",
      "text": "for me, it's hard to beat chocolate, but I actually think this particular strain of larabar is my favorite. it seems appropriate at any time of the day and tastes good. also appreciate the low level of sodium in their snacks. if you don't like the apple pie larabar, my bet is you won't like any of 'em.",
      "rating": 5.0,
      "verified": true,
      "author": "gdb",
      "helpful_votes": 2,
      "publication_date": 20170707
    },
    {
      "title": "Tastes Great but won't buy from here",
      "text": "These bars taste great but the package was opened when I received it and only had 15 bars instead of the 16 stated on the box. Will get these from a store next time to ensure that I'm getting all I paid for.",
      "rating": 3.0,
      "verified": true,
      "author": "Jess4456",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Not to rely on a product til you try it.",
      "text": "First time I ever had this product and it tasted nothing like apple pie. I did not like the taste and couldn't even tell what it tasted like, it was that bad. I do not recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "diane",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Great taste and Price",
      "text": "My boys love Lara Bars. They are a healthy and convenient snack for when we’re out on the trails and camping. Buying them by the box makes so much more sense then individually at the store. Saves a ton.",
      "rating": 5.0,
      "verified": true,
      "author": "DutRibs",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "helps me track my macros/healthy option for kid's lunches!",
      "text": "I eat this because it has healthy ingredients... it IS high in carbs, but nutritious carbs! my toddler loves having these in his school lunches, this particular flavor, and the peanu tbutter ones are a bit higher in protein than some of the others.",
      "rating": 5.0,
      "verified": true,
      "author": "Cross-eyed catTop Contributor: Star Wars",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "wonderful",
      "text": "larabar it seems impossible to get the flavor you do from so few ingredients. how come you do not list love on the ingredients ?. you go",
      "rating": 5.0,
      "verified": true,
      "author": "MOON",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Expecting more apple flavor",
      "text": "The apple flavor is barely there. It is more to slightly tangy flavor with dates and cinnamon flavor. But still, nice options when hungry.",
      "rating": 2.0,
      "verified": true,
      "author": "Winnie P.",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Good product but the flimsy box is not good",
      "text": "We love the product but the flimsy box and Amazon delivery bag is not good. The bars are smashed quite frequently.",
      "rating": 3.0,
      "verified": true,
      "author": "R. D. Waters",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Not expired but stiff and dry",
      "text": "Which makes most of the taste go away! Not siure why the whole box was so dry. Afraid to re-buy",
      "rating": 2.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Delicious!!",
      "text": "Wow! These are delicious! A little high on carbs but I do splurge once on awhile. So good!!!",
      "rating": 5.0,
      "verified": true,
      "author": "DS",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Larabars is a great meal replacement.",
      "text": "Larabars are wonderful for me to carry as a meal replacement. They taste great and keep my Blood Sugar level. The Amazon price is great, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Joy K. Noll",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "It’s a larabar",
      "text": "Normal expectations of a Larabar, dry but flavorful, works good for a Whole30 snack",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "contaminated",
      "text": "I am shocked by what I saw when we opened the package. May of the bars are opened on one or more sides and some are smaller than normal. They are contaminated and I would not trust eating any of them.",
      "rating": 1.0,
      "verified": true,
      "author": "Lori C.",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Great for a light snack at work.",
      "text": "I really like these. Great for a quick snack at work and it's nice knowing that I'm not downing artificial chemicals as sweeteners. The taste is not too strong and they are not super soft, but that's not a complaint. The freshness seemed fine as well.",
      "rating": 5.0,
      "verified": true,
      "author": "BWhitTop Contributor: Batman",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Love me some Larabar!",
      "text": "I like Larabars a lot and these are my favorite!! I would continue ordering but the cost started adding up and I learned how to make a decent larabar :)",
      "rating": 4.0,
      "verified": true,
      "author": "TAnK",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Do not buy",
      "text": "Won’t buy again. Package was old. Looks like it was is storage for years.",
      "rating": 1.0,
      "verified": true,
      "author": "Ken B.",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "These are so-so flavor",
      "text": "Ok in a pinch. I wouldn't buy them again. The flavor is only ok, and the texture is a bit off.",
      "rating": 3.0,
      "verified": true,
      "author": "Charles A. Knutson",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "If you know how Laramar bars taste ill say this...",
      "text": "This is the best tasting one, my personal fave. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "David In Dallas",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Love the purity of this product",
      "text": "Perfect snack while dieting and I don’t have to feel guilty about putting it in my body.",
      "rating": 4.0,
      "verified": true,
      "author": "Madison B",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Not much to look at, but taste is great.",
      "text": "When I first opened the individual package I was a bit grossed out honestly. It looked like a candybar-shaped turd. But then I ate it, and the texture wasn't that great either so I was still grossed out with the image of the turd, but kept eating it. To my great relief it tasted really nice. There is a lot of flavor for how few of ingredients there are. Also, I really liked the minimalistic ingredient list. My advice, just don't look at it when you eat it.",
      "rating": 3.0,
      "verified": true,
      "author": "tela",
      "helpful_votes": 0,
      "publication_date": 20120403
    },
    {
      "title": "really does remind me of apple pie or cinnamon roll",
      "text": "has more protein than other Lara bars, important to compare protein content! I think this one and the peanut butter and one other have the most protein.",
      "rating": 5.0,
      "verified": true,
      "author": "Cross-eyed catTop Contributor: Star Wars",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Great flavor",
      "text": "I tried this because of a friend and love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Susanhe",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Loved",
      "text": "Didn't know what to expect with the Apple flavor but I loved it, and my toddler really likes it to.",
      "rating": 5.0,
      "verified": true,
      "author": "Buyer92302",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Wonderful",
      "text": "Packaging was great, item is fresh and great delivery. Thankyou.",
      "rating": 5.0,
      "verified": true,
      "author": "Regina Pulliam",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Yum!",
      "text": "Nice for when you're craving dessert but don't need all the sugar and junk",
      "rating": 5.0,
      "verified": true,
      "author": "Garza",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Recommend",
      "text": "These are a really good price. I buy this flavor because they are the only edible ones without added sugar.",
      "rating": 5.0,
      "verified": true,
      "author": "clarrissa",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Not edible.  No return policy... waste of money.",
      "text": "Beware. Very disappointed. Box came in with multiple labels covering over original expiration date that was scratched out. All bars hard and dry, unlike store ones I have had before. Return policy did not exist. Stuck with box of bars that are not edible and going straight into trash.",
      "rating": 1.0,
      "verified": true,
      "author": "David Marrano",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "Old Batch?",
      "text": "Had ordered previously and they were great. This batch tasted and smelled rancid",
      "rating": 2.0,
      "verified": true,
      "author": "JDA",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Yummy",
      "text": "I like this brand and apple pie is one of my favorite. I like it’s not too sweet, I believe it’s even healthy snack.",
      "rating": 5.0,
      "verified": true,
      "author": "Danica",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Opened Package! Missing Bars",
      "text": "These are tasty treats no doubt. However, the package I received was opened and only contained 13 of the advertised 16 bars! Scam",
      "rating": 1.0,
      "verified": true,
      "author": "Gregory",
      "helpful_votes": 2,
      "publication_date": 20190212
    },
    {
      "title": "Apple Pie in a bar form",
      "text": "These taste very similar an apple pie! It's made from fruit and it's one of my favorite snack bars.",
      "rating": 5.0,
      "verified": true,
      "author": "Cliff",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "No good!",
      "text": "This were not my cup of tea. The flavor was not so good.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennie Glancy",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Great price and good snack bar",
      "text": "I started getting these when on whole 30 and like having as a quick healthy snack when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Ljgodfrey",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "The best!",
      "text": "These bars are really great. I love the simplicity of the ingredients and the taste is amazing. Healthy snack that brings in the nutritional punch.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "If you're into these types of on the go hiking bar this is ok.",
      "text": "Not my favorite, but nothing wrong with it at all. I prefer the blueberry muffin tho.",
      "rating": 3.0,
      "verified": true,
      "author": "mjcali",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Sweet",
      "text": "This are very tasty and sweet. They may make your sugars go up, because they are fruit.",
      "rating": 4.0,
      "verified": true,
      "author": "Consumer",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Great product!",
      "text": "Read some bad reviews, but tried anyway. Arrived quick and all product was in excellent condition. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Bishop",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Thank you!",
      "text": "I’ve tried so many and most of them are good, only the chocolate chips brownies isn’t that tasty.... overall Larabar is a great brand",
      "rating": 5.0,
      "verified": true,
      "author": "Lorraine",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Delicious and no franken-foods",
      "text": "I gave these to my nephew at a wrestling tournament (he's state-ranked and eats enough for 5 adults even though he's only 13 - seriously - 5 adults.) He loved them so much his dad bought 6 cases and 2 weeks later they were gone. Love that they're made with whole, real ingredients and not some franken-food monstrosity.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Snyder",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "Delicious!",
      "text": "I am not that into fruit bars, but this one is delicious. Just the right level of sweetness, and the flavor is natural and fresh.",
      "rating": 5.0,
      "verified": true,
      "author": "Zhaorong M.",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "The perfect gluten free snack attack solution",
      "text": "I was so happy to find these online at such an affordable price! I recently started eating gluten free due to finding out I have a gluten intolerance and these are the perfect snacks to keep in my purse for situations when everyone else can grab something at a drive through. Also, i am impressed at how well they hold up in the bottom of my purse! At my local grocery store the bars work out to be twice the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Dazeek",
      "helpful_votes": 0,
      "publication_date": 20131114
    },
    {
      "title": "Good stuff",
      "text": "Does taste like apple pie. Not sure how healthy it is but sure tastes good",
      "rating": 5.0,
      "verified": true,
      "author": "Camilla",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Product is awesome",
      "text": "Great taste, perfect go to bar when in a hurry I have these on my subscribe and save",
      "rating": 5.0,
      "verified": true,
      "author": "Nick D.",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Always good.",
      "text": "Larabars are always good and healthy. We use them for snacks and like all the flavors.",
      "rating": 4.0,
      "verified": true,
      "author": "Carolyn",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Two Stars",
      "text": "The nuts in the bars were rancid even though the product wasn't expired.",
      "rating": 2.0,
      "verified": true,
      "author": "JEM",
      "helpful_votes": 2,
      "publication_date": 20170702
    },
    {
      "title": "Limited shelf life item sent for my order",
      "text": "Product is good but the items sent had just s few days of shelf life left. See photo.",
      "rating": 1.0,
      "verified": true,
      "author": "dave throne",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Yummy!",
      "text": "These are great. Hubby took them on deployment with him as a night snack for cravings.",
      "rating": 5.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "One of the only healthy snacks out there",
      "text": "I really like Larabars and go through dozens each week. It is an indulgence that I feel ok about.",
      "rating": 5.0,
      "verified": true,
      "author": "JZ",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Great product, perhaps make smaller sizes for children!!!",
      "text": "I like it, and I share it with my friends, children and even my doctors. We all love natural snacks.",
      "rating": 5.0,
      "verified": true,
      "author": "Misbee - ",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Favorite flavor",
      "text": "In our household, Larabars are a staple snack. My children especially love the apple pie flavor. Love the fact the there are so few ingredients!",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Looking for food which is food",
      "text": "I saw these on Rachel R's Show. They truly have only nuts and fruit. They are good. They are very, very sweet. Is there any truth that fructose will metabolize more slowly than processed sugars? If it is true, and I hope so, these are good food. I was glad to find these. I would buy them just to encourage more food which is food.",
      "rating": 5.0,
      "verified": true,
      "author": "skylarkspur",
      "helpful_votes": 0,
      "publication_date": 20150101
    },
    {
      "title": "Great",
      "text": "Great product, as advertised, on time delivery and great value",
      "rating": 5.0,
      "verified": true,
      "author": "Vladimir T",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Tasty and great value",
      "text": "woah I usually pick up a protein bar on the way to my soccer game for ~$4, these bars actually taste good and cost ~$1 per bar..",
      "rating": 5.0,
      "verified": true,
      "author": "buyguy",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Simple Ingredients With No X",
      "text": "I can actually understand every ingredient and not a single one has an X in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy S",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Awesome, healthy school snacks",
      "text": "Love the short ingredient list. Great healthy snack for the Little Ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Mom",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Delicious!",
      "text": "This is perfect for a change-up from Clif Bars and other energy bars that can sometimes feel a little too filling or just get old after awhile. I'm a slow eater, especially in the mornings, but the fruit base of these make them so light and yummy and kept my energy sustained for long hikes!",
      "rating": 5.0,
      "verified": true,
      "author": "Team K",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "pretty good",
      "text": "pretty tasty for Whole30 approved food; no complaints. doesn't have that weird 'healthy' taste. I definitely recommend this product",
      "rating": 5.0,
      "verified": true,
      "author": "Lyce",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Taste like paper",
      "text": "This bar did not take good and it was a struggle to swallow.",
      "rating": 2.0,
      "verified": true,
      "author": "Mariama",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Tasty power boost",
      "text": "The flavor of these Larabars is really great! I have them around for quick boosts of energy and for satisfying an occasional sweet tooth. The Apple flavor is a bit like a Granny Smith but less tart.",
      "rating": 5.0,
      "verified": true,
      "author": "GreenKitty",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Not normally a Larabar fan but...",
      "text": "I’ve tried a few different Larabar flavors before and wasn’t a fan at all, but the apple pie bar really taste like apple pie! These are wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Dense and not apply",
      "text": "Pretty dense and not very apple tasting. But if cut in half inch slices it is acceptable",
      "rating": 3.0,
      "verified": true,
      "author": "fiddler",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "i love this bar",
      "text": "this bar is my fav from lara bars. there are so many flavors and i've tried most but this remains the best. i bring it on the go with me when i travel or just keep on in the car and in my purse and when i'm hungry. voila!!! it's a much healthier alternative to just random snacking. great!!!",
      "rating": 5.0,
      "verified": true,
      "author": "S Lee",
      "helpful_votes": 0,
      "publication_date": 20140328
    },
    {
      "title": "Tastes Great!",
      "text": "Tastes Great, chewy and filling. They aren't cheap, but taste much better than the normal breakfast bars available.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert S.",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Fresh and healthy snack or light meal.",
      "text": "I love this flavor of Larabar. Makes a healthy light 1st meal of the day with coffee.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay Em",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Dairy and gluten free",
      "text": "These don't taste as good as most of the other varieties. I'll eat them in a pinch, but definitely prefer other flavors.",
      "rating": 4.0,
      "verified": true,
      "author": "Samantha R M Jarrett",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Delicious!",
      "text": "These taste great and are an awesome option to be able to eat something natural without and additions that aren't necessary.",
      "rating": 5.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "OH LARA BAR, I  LOVE YOUR APPLE PIE",
      "text": "just like its title - an explosion of apple pie with every bite and good clean ingredients",
      "rating": 5.0,
      "verified": true,
      "author": "L. M. Duncan",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Great snack on the go",
      "text": "A family member turned me on to Larabar and Kind bars, both are great products. The Larabar, Apple Pie bar has the following ingredients, Dates, Almonds, Unsweetened Apples, Walnuts, Raisins and Cinnamon. No Added Sugar, Gluten Free, Dairy Free, Soy Free, Non-GMO, Vegan, Kosher 1 Bar = 1/2 cup of fruit What more could one want?",
      "rating": 5.0,
      "verified": true,
      "author": "smitty",
      "helpful_votes": 0,
      "publication_date": 20120718
    },
    {
      "title": "Great bars!",
      "text": "I love these bars. Good ingredients and you when you read the ingredients you know what it is!",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda Scholtz",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Whole 30 approved",
      "text": "Great taste and is whole 30 approved. Great for on the go.",
      "rating": 5.0,
      "verified": true,
      "author": "D Crider",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "So Good It's Like a Dessert!",
      "text": "I bought these for a healthy energy snack on my long bicycle rides. They a delicious! I now keep a few in my desk at work for an afternoon treat. They do taste like apple pie. They taste so good it seems like they should be bad for you. I love these and the cherry pie bars. Peanut butter and jelly bars are a close second.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20131023
    },
    {
      "title": "Watch the product date. Mine came with an expiration ...",
      "text": "Watch the product date. Mine came with an expiration date only two months from my delivery date.",
      "rating": 5.0,
      "verified": true,
      "author": "Floridian",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Great Tasting",
      "text": "I recommend this flavor above the others. You can taste the apples and it pairs well with the dates.",
      "rating": 5.0,
      "verified": true,
      "author": "KnLs2841",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "Truly Healthy snack",
      "text": "My kids LOVE Lara Bars. Apple pie is one of their favorites. It basically tastes like cinnamon. These are great for taking with us when we are out and about (I have 5 kids) and are much more healthy snack than almost anything else convenient. You can make them yourself easily but when you dont want to or cant, Lara bars are the perfect solution.",
      "rating": 5.0,
      "verified": true,
      "author": "SRL",
      "helpful_votes": 0,
      "publication_date": 20120407
    },
    {
      "title": "Delicious!",
      "text": "Such a great treat with simple, straight-forward ingredients with no sugar added. Truly a blessing.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackson Otto",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "My favorite snack bar",
      "text": "It almost taste like an apple pie. I love the sweet taste of the dates. Clean ingredients. It’s a little pricey at the store but it’s worth it! You get what you pay for :)",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha M.",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Great price for these Larabars",
      "text": "Great price for these Larabars! I like to have these around for afternoon snacks or breakfasts on the go. They're also great for the Whole30 or Paleo if you're into that kind of thing.",
      "rating": 5.0,
      "verified": true,
      "author": "sarah+",
      "helpful_votes": 0,
      "publication_date": 20160811
    },
    {
      "title": "Just like a real apple pie",
      "text": "I love these, they taste just like an apple pie with some walnuts!",
      "rating": 5.0,
      "verified": true,
      "author": "amazonpenname",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Super disappointed!",
      "text": "I ordered the Apple Pie flavor and it only came with 15 bars instead of 16. Super disappointed!",
      "rating": 2.0,
      "verified": true,
      "author": "lemoncase",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Delicious",
      "text": "Larabars are delicious. These didn't last long in our house.",
      "rating": 5.0,
      "verified": true,
      "author": "rebeccag",
      "helpful_votes": 0,
      "publication_date": 20180911
    }
  ],
  "product_meta": {
    "title": "Larabar, Gluten Free Bar, Apple Pie, Vegan (16 Bars)",
    "description": "Size:16 Count (Pack of 1)Gluten-Free, Non-GMO",
    "rating": 4.6,
    "feature_bullets": [
      "Breakfast"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "8.1 x 5.1 x 2.4 inches; 1.63 Pounds",
      "Item model number": "645302",
      "UPC": "854818000017 021908453026",
      "Manufacturer": "GENERAL MILLS SALES INC.",
      "ASIN": "B000ENUC3S",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Fruit & Nut",
      "Grocery & Gourmet Food",
      "Snack Foods",
      "Bars"
    ],
    "price": 23.0
  }
}