{
  "website_summaries": [
    {
      "verdict": "As an upgrade, Norton Internet Security 2003 is a solid package for the price. However, you can expect to pay a lot for technical support.",
      "pros": [
        "Intrusion detection sniffs out Nimda-like worms",
        "shuts down your Net connection after a period of inactivity",
        "easier-to-use interface"
      ],
      "cons": [
        "Support costs $30 per call"
      ],
      "aspects": {},
      "publication_date": 20021010,
      "rating": 8.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not up to par",
      "text": "I've always heard about the integrity of Symantec/Norton products to take care of my pc issues. However I have been greatly disappointed. Even when the suite was installed and updated I had problems I could not identify and resolve. Finally in frustration I uninstalled the program and tried another product. Immediately 39 problems were found and corrected that Norton did not. When my licenses expire I will be switching all my pc's to internet security with McAfee.",
      "rating": 2.0,
      "verified": true,
      "author": "D Larry B",
      "helpful_votes": 0,
      "publication_date": 20041114
    },
    {
      "title": "Internet Security and Windows XP",
      "text": "This product has not been debugged for use with Windows XP. I spent 2 hours trying to get my computer to reconnect with the internet after installing it. It would not deinstall properly no matter what and I finally got it to work by installing it again and deinstalling it twice. Then it pointed me to an internet provider I had never used before in my life! I had to deinstall it again, program by program, using the control panel's remove programs feature instead of the software's deinstall feature. All together, A giant pain in the sit-upon!!!",
      "rating": 1.0,
      "verified": true,
      "author": "JBD",
      "helpful_votes": 6,
      "publication_date": 20021024
    },
    {
      "title": "Dont buy it - I hope 2004 Version Works",
      "text": "Install on Win ME was a living hell. I did not install controls but within 1 hour I was locked out of the program. I could not even uninstall it the right way. (Control Panel) kept telling me I needed the \" Administrators Permission\" I have used their Antivirus for years and had no problems with Internet Security 2002. Reinstalled the old 2002 and it works fine.",
      "rating": 1.0,
      "verified": true,
      "author": "Edward Caldwell",
      "helpful_votes": 2,
      "publication_date": 20030914
    },
    {
      "title": "it was ok",
      "text": "If you are looking up a review on this product, you need to walk, no run back to your time machine and come back to the present. We're talking about a 11 year old product.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeff S.",
      "helpful_votes": 0,
      "publication_date": 20140118
    },
    {
      "title": "Good updates.",
      "text": "As goog as any such product on the market. Good updates.",
      "rating": 5.0,
      "verified": true,
      "author": "FAH",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "Could Be Better - Slows PC's Big Time",
      "text": "I had the Norton 2002 edition pre-installed on my Compaq 6350 computer and kept getting updates since. I only recently noticed that it was using up CPU big time and slowed my recently installed DSL connection. Also, it kept blocking javascript photo-enlargers and just by trial and error, I had to set adjustments for individual sites just to get them to open things like polls, message boards, etc. AT&T/Yahoo has it's own security as long as I keep my DSL account with them, so I dropped Norton with no regrets. If you're a Norton die-hard, just get the anti-virus, not the whole suite.",
      "rating": 2.0,
      "verified": false,
      "author": "TomAzon",
      "helpful_votes": 0,
      "publication_date": 20051210
    },
    {
      "title": "No problems here.",
      "text": "Maybe I got lucky, but I've installed NIS 2003 on three different computers (2 with 98SE and 1 with XP Home) and I have had no problems whatsoever. Installation was a breeze on all three. I have yet to look at the owners manual as the programs are very intuitive. Because I wanted to network all three computers together, getting a personal firewall was priority one. In short, I would recommend this program to anyone. Just be sure to remove any previous virus/firewall programs on your PC.",
      "rating": 5.0,
      "verified": false,
      "author": "Kobra",
      "helpful_votes": 5,
      "publication_date": 20030716
    },
    {
      "title": "Great Software",
      "text": "I have been using Symantec products for years, and Norton Internet Security is a great way to protect your computer from hackers and viruses. The firewall is easy to use and customize, and the Norton Antivirus software is in my opinion second to none. In fact a friend of mine had McAfee Antivirus and bought Norton's Antivirus later on, seems he had two viruses on his pc that McAfee never caught. I will not buy any other internet security software.",
      "rating": 5.0,
      "verified": false,
      "author": "Madisonville Animal Hospital",
      "helpful_votes": 0,
      "publication_date": 20040126
    },
    {
      "title": "Good but buggy",
      "text": "My nonexpert view: I do actually like this product but have found it very buggy, especially during updates. Support tends to be baffling--of the 3 problems that have come up, I was able to solve 2 more simply myself than by following the support recommendations. And then, why should 3 problems come up on a new product??? On the whole, I kind of wish I had resisted the steep price cut and just renewed my antivirus package. That's what I did on my other machine, plus Google toolbar to block popups.",
      "rating": 2.0,
      "verified": false,
      "author": "Timothy O'Brien",
      "helpful_votes": 0,
      "publication_date": 20030909
    },
    {
      "title": "Stopped 3 attacks first month, uses up some resources",
      "text": "Bought Norton Internet Sec. 2003 almost a month ago, very pleased. I have seen 3 attacks so far. The program uses this cool \"IP Caller ID\" thing (not their terms), but it traces the intrusion source geographically, plots it on a map, then gives you the Provider's name to report the attack. So far, it traced attacks to L.A., NJ, and China. I must say the piece of mind this product provides is certainly worth the free post-rebate pricetag. It did bring my available resources from ~85% to about 63-58%. I have broadband, so it's not a killer, but I refrain from running the virus-blocker, doing manual scans instead. UNINSTALL ALL PREVIOUS VERSIONS/ANTIVIRUS PRIOR TO INSTALLING!!!!!",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20030702
    },
    {
      "title": "They Shocked Me",
      "text": "I had heard all of the negative comments about NIS 2003 and was expecting a real compatibility problem moving from Personal Firewall 2002 and System Works 2002 . The download from Symantec was actually quite painless. The program even maintained my current security settings. I just sat back and Symantec shocked me. It works great and even removed the old files. It even integrated into Systems Works without even asking. Personally, I have no problem accessing adobe, microsoft, amazon.com or any other reputable site. Good job guys",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20030206
    },
    {
      "title": "beats mcafee virusscan 7.0",
      "text": "Okay you know I am getting sick of all the negative reviews for this product. This product beats mcafee. On windows 98 Mcafee Virusscan does not work right. You get all kinds of errors. I got fed up with it, and downloaded a trial of norton internet security which is working much better. Don't tell me to upgrade my os either. When something says it will work with a certain os, then i expect it to work. Which mcafee virusscan 7.0 clearly says it works with windows 98, and it don't. Not right anyway. Norton does.",
      "rating": 5.0,
      "verified": false,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20030830
    },
    {
      "title": "Worked Fine for me",
      "text": "When my free Norton Antivirus subscription expired on my Dell Laptop, I upgraded to Internet Security 2003. I use XP and have had no problems. Internet works great. Pop ups and Spam all get blocked as advertised. I would give it 5 stars but for one hitch. Since I upgraded about a month before my free subscription was to run out, they only renewed the subscription for one year from the date of the upgrade. [...] Otherwise I am very happy.",
      "rating": 4.0,
      "verified": false,
      "author": "R. Sutton",
      "helpful_votes": 4,
      "publication_date": 20021121
    },
    {
      "title": "not as good",
      "text": "Ever since I installed the my 2007 Norton Internet Security, I have received more pop-ups than ever. I never had problems with pop ups until I installed Norton. Does anyone know why I am suddenly getting the popups? Did I skip a step when I installed the software? Any help would be great!",
      "rating": 1.0,
      "verified": false,
      "author": "Ernie Tam",
      "helpful_votes": 0,
      "publication_date": 20070315
    },
    {
      "title": "HIGHLY PLEASED TECHIE",
      "text": "Ok , granted nothing in this world is perfect. But this program has never done me wrong until I let my subscription lapse. Other than that I have been quite pleased with it and I have 7 years of being a Technical Analyst III under my belt.",
      "rating": 4.0,
      "verified": false,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20050414
    },
    {
      "title": "Norton Internet Security 2003 Thumbs down",
      "text": "I was extremely disappointed with Norton Internet Security 2003. I expected better from Norton, their products are usually decent. This software does not do what it's supposed to do for content filtering. It blocks at best 60% of the web sites that it should. And it lets about 40% of the hardcore porn sites through. Do not use this product for content filtering. Parents this could lead you to believe your children are safe, when in fact they are not. Two thumbs down, I wasted the money.",
      "rating": 1.0,
      "verified": false,
      "author": "Mitchd 123",
      "helpful_votes": 0,
      "publication_date": 20040915
    },
    {
      "title": "Exactly what I wanted it to do!",
      "text": "I already have an SMC router/switch so my firewall protection is taken care of. But as soon as I installed the Norton Ad Blocker and Pop-up Blocker, they went away. The status screen told me that Norton had blocked 52 ads within minutes. The program does take some work, however. You need to tell it how much security that you want. You need to tell it what to do with the \"Spam E-Mail\" that it detects. It comes with a 200+ page Users Guide and In Program Wizards to aid in set-up. I had the program installed and running within an hour.",
      "rating": 5.0,
      "verified": false,
      "author": "L. Smith",
      "helpful_votes": 4,
      "publication_date": 20021207
    },
    {
      "title": "No problem here",
      "text": "I have been using Norton Internet Security 2003 for just under a year now, I have had no problems what so ever. The fire wall has caught numerous problems in the past and I have had no ill effects on my internet access. It has caught numerous virus attacks via websites and email. With virus protection so critical now, I don't see any better product on the market. I liked it so much, I bought it for my wife's business.",
      "rating": 5.0,
      "verified": false,
      "author": "C. McDonald",
      "helpful_votes": 0,
      "publication_date": 20040307
    },
    {
      "title": "Customer Service a Big Minus",
      "text": "Symantec does not offer much in the way of customer support. The website is difficult to navigate; there is no on-line support other than a \"virtual\" assistant--no live on-line help. The company discourages telephone support: there is no 800 number. Customers must pay to call in to a west coast number, and there is a warning that wait times could be extensive. I do not find them at all user-friendly, and for that reason will not renew my subscription when it expires.",
      "rating": 2.0,
      "verified": false,
      "author": "Lizzie 2",
      "helpful_votes": 2,
      "publication_date": 20040730
    },
    {
      "title": "Perfect product...just follow the directions",
      "text": "Norton Internet Security 2003 is a great product. It does everything as advertised. Many of the negative reviews are from people that did not fully uninstall any previous Norton products. If you do everything as stated in the guide there should be no problems. The one down side of the product is that it does slightly slow down Internet activity. Everything else is as expected. I have already blocked 26 attempted attacks to my system, in only 9 days.",
      "rating": 4.0,
      "verified": false,
      "author": "Don",
      "helpful_votes": 14,
      "publication_date": 20030529
    },
    {
      "title": "Invasion of Space",
      "text": "I am a web developer who has been having to deal with this software. Symantec doesn't tell you, but this program actually reads *all* incoming HTML pages and then just decides what images to show or not. It also *injects* scripts into each page that will cause JavaScript to break, to many websites will not render properly. And the worst part is, you wont know it! I would not recommend this software for anyone. There are many better solutions for AD and popup blocking, as well as Firewall control. Many are free.",
      "rating": 1.0,
      "verified": false,
      "author": "Aaron N. Prenot",
      "helpful_votes": 2,
      "publication_date": 20041018
    },
    {
      "title": "Definitely worth it!",
      "text": "This is an excellent product! Just the fact that I don't have to deal with any pop-ups or banner ads is worth the price alone -- and because it blocks these things, I can surf the 'net much faster and more efficiently. The virus scan is also much more effective and comprehensive -- it caught viruses that my older version of Norton Anti-virus did not catch. It was also easy to install; I didn't have any problems at all. I also have peace of mind knowing that I, at last, have a secure internet connection. Buy it!!",
      "rating": 5.0,
      "verified": false,
      "author": "Donna Romano",
      "helpful_votes": 0,
      "publication_date": 20030408
    },
    {
      "title": "Norton Internet Security 2003",
      "text": "Great product, installation was a breeze! Upgraded from Norton AntiVirus 2002 and Zone Alarm Pro 3.1 on an HP Intel P4 1.8 ghz running Windows XP with SP 1. Only complaint is Zone Alarm was still active after installation and needed to be uninstalled manually.",
      "rating": 4.0,
      "verified": false,
      "author": "JimV",
      "helpful_votes": 0,
      "publication_date": 20021221
    },
    {
      "title": "Do not buy this product!",
      "text": "This software is a mortal disaster. Even when I tried to uninstall it, it would not uninstall properly and, of course, I cannot reinstall it properly either. Support from Symantec is nonexistent. 6 emails to them have gone unanswered, as soon as they take your money, they want nothing more to do with you. I cannot recommend this prodect in the slightest, it can destroy your computer ( as it seems to have done to mine ) and is, ironically, worse than the worse virus you could ever encounter to remove.",
      "rating": 1.0,
      "verified": false,
      "author": "James Peden",
      "helpful_votes": 7,
      "publication_date": 20021211
    },
    {
      "title": "A Must for your computer....",
      "text": "Just follow the intructions to the T which I did and there was no problmes installing it. I installed it along with NSW 2003 and there was no clashing. I love the new interface and new updated Ad-blocking. PLus for parents there is a parental control feature which is a must considering times now.",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20030107
    },
    {
      "title": "Disables autoplay on your CDROM drive.",
      "text": "This program disabled autoplay on my CDROM drive and Symantec tech support was no help at all. I, therefore, reverted my machine to a prior state using GoBack and got rid of the darn thing.",
      "rating": 1.0,
      "verified": false,
      "author": "rednitas",
      "helpful_votes": 0,
      "publication_date": 20031211
    },
    {
      "title": "Excellent product",
      "text": "I was running Systems Works 2002 so after reading some reviews here I was a bit nervous to install this on my computer running XP. However, setup was a breeze, I love the fact it just blocks those annoying pop ups, scans my emails for spam, and protects my computer. Great program, highly recommend.",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20030408
    },
    {
      "title": "DO NOT BUY THIS!!",
      "text": "I have just spent the last three hours of my life trying to load symantec's Internet Security 2003 to my new computer. I am completely frustrated with the entire process. I should have listened to previous reviewers who recommended NOT buying this product. I am very disappointed and look forward to spending the next few days fixing this mess. Thanks Symantec!",
      "rating": 1.0,
      "verified": false,
      "author": "T Mead",
      "helpful_votes": 6,
      "publication_date": 20030101
    },
    {
      "title": "Best protection offered",
      "text": "If you realize the risk that goes with using the Internet you probably have this already. If you are looking around for some protection, look no further. You have found ALL you need with NIS 2003 or any version. This has proven to be the BEST of the BEST. I use it since it became available, and after comparing, there is no competition.",
      "rating": 5.0,
      "verified": false,
      "author": "Happy consumer/customer",
      "helpful_votes": 0,
      "publication_date": 20031021
    },
    {
      "title": "Norton Internet Security 2003",
      "text": "If you connect to the net a good Fire Wall is a must. This has caught at least one \"ping\" that was reported. 5 Stars.........",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20030908
    },
    {
      "title": "Stops the nasty Pop-ups and removes all Spam",
      "text": "Recently purchased this for the office and it removed all nasty Pop-Ups that would constantly pop up on my screen. It also removed all spam emails - ALL! The only downside in my opinion - it scans all emails and this takes a bit of time.",
      "rating": 4.0,
      "verified": false,
      "author": "NKatie",
      "helpful_votes": 0,
      "publication_date": 20060512
    },
    {
      "title": "Mediasales2000",
      "text": "Just wanted to warn people not to buy from mediasales2000. I ordered a Norton Internet Security 2003 from them. Never got the CD. Wanted Norton Internet Security 2003 because heard there were problems with Norton Internet Security 2004. Got new computer with Antivirus on it. Think Norton is still good product.",
      "rating": 1.0,
      "verified": false,
      "author": "Helen M. Christensen",
      "helpful_votes": 0,
      "publication_date": 20040303
    },
    {
      "title": "RUN AWAY AS QUICKLY AS YOU CAN; it gets a zero",
      "text": "... i've had friendlier virus infections. had to create a new partition and reinstall OS and move my files before i could finally undo the damage and rid the computer of the \"program\". goodbye symantec.",
      "rating": 1.0,
      "verified": false,
      "author": "Steve Cornwall",
      "helpful_votes": 0,
      "publication_date": 20021121
    },
    {
      "title": "# 1",
      "text": "# 1 for xp win if you have 98 or 2000 zone alarm is ok but i do not trust zalarm , sygate pro is good ..... no money z alarm . 5 stars $ sygate pro. 4 31/32 stars xp norton a one fire wall that has all .",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20030105
    }
  ],
  "product_meta": {
    "title": "Norton Internet Security 2003",
    "description": "Clean out Internet buildup with Norton CleanSweep¿ from Symantec. Its powerful tools improve your PC¿s performance by removing unwanted programs and other files that waste disk space. Internet Sweep cleans away the clutter accumulated by Web surfing, including cookies that track your Internet activities. Fast & Safe Cleanup automatically removes files you no longer need, while Safety Sweep¿ prevents the accidental deletion of critical files. The Uninstall Wizard guides you safely step by step through removing old programs. Now Windows¿ XP users can also enjoy the benefits of this award-winning program. Trust Norton CleanSweep 2002 for safe, easy, complete hard drive cleanup.¿¿¿¿¿\n\nAMAZON.COM\nSymantec's Norton Internet Security 2003 provides essential protection from viruses, hackers, and privacy threats. This easy-to-use, integrated suite includes full versions of Norton AntiVirus and Norton Personal Firewall to defend your PC against the most common Internet dangers. Norton AntiVirus, a trusted antivirus solution, removes infections automatically, without interrupting your work. Now it scans and cleans instant-message attachments as well as e-mail messages. Norton Personal Firewall keeps hackers out and personal data in. The Norton Intrusion Detection feature adds an extra layer of protection by automatically intercepting suspicious connections. And Norton Privacy Control prevents confidential information from being sent out accidentally via Web forms, e-mail messages, instant messages, and Microsoft Office attachments.\n\n Norton Internet Security also includes Norton Spam Alert, which helps you detect and filter unwanted e-mail. And Norton Parental Control keeps your children safe online by letting you block objectionable Web sites and set up separate Internet access privileges for each member of your household. Automatic downloads keep Norton Internet Security updated against new security threats.",
    "rating": 3,
    "specifications": {
      "Is Discontinued By Manufacturer": "Yes",
      "Package Dimensions": "5.7 x 4.8 x 0.3 inches; 1.6 Ounces",
      "Date First Available": "September 15, 2002",
      "Manufacturer": "Symantec",
      "ASIN": "B00006FI0N",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Internet Security Suites",
      "Antivirus & Security",
      "Software"
    ],
    "price": ""
  }
}