{
  "website_summaries": [
    {
      "verdict": "Replicates a real-life stroller with attention on the details.",
      "pros": [
        "Noted to inspire imaginations of young ones while also tapping into parent's own memories",
        "Simple assembly and sturdy enough to tote around small pets in addition to dolls",
        "A perfect gift that any generation could give"
      ],
      "cons": [
        "Engineered with clasps that maintain its structure, however this stroller may require a few tries to properly secure"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Love, love, love it!!!",
      "text": "We bought this for my daughter's 7th birthday for the reborn doll we also bought her. She absolutely loves this. Seems sturdy. Way better than I anticipated. She used to have a plastic stroller that costed twice as much and was garbage. Was very easily put together in minutes. Her cat Mishie loves rides with the 22\" reborn doll. Everyone is happy with this purchase. I'll recommend it to anyone I know with little girls.",
      "rating": 5.0,
      "verified": true,
      "author": "Carole Abbey",
      "helpful_votes": 14,
      "publication_date": 20161017
    },
    {
      "title": "Needs pins to hold on wheels missing 2",
      "text": "Missing 2 wheel pins.... Unfortunately when I asked to return it I went immediately on to re-order it because it’s for my granddaughter‘s birthday and the print we wanted was gone I really needed the two missing pins to hold the wheels but they were unable to do that, so returning was my only option, thankfully my brother-in-law was able to fix it so we could keep it. Thank God for paper clips!!! Very cute however!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Falls apart and don’t turn wheels",
      "text": "This design is not good. Very flimsy product and the tires don’t turn. When you put the full bassinet on it takes not much effort to fall down again. My daughter gets very frustrated because every time she walks with it everything falls apart. It became a torture this product rather than a fun toy for Ku daughter. Would only recommend for a 8-9yo kid w lots of strength to move around and snap it back again every time it falls apart. Wouldn’t recommend it",
      "rating": 3.0,
      "verified": true,
      "author": "WTCB",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Very disappointed with buggy.",
      "text": "I love this buggy because it is so cute but that’s it. It will not stay together. The top part of buggy will not stay on. You can’t hook the bed to the frame so it just slips down.. My grandaughter does not use it because when she tries to wheel it the frame Goes down and the bed of the buggy falls off. There should be a way to clip the bed of the buggy to the frame. What they have for this is dumb and does not work. Very disappointed and so is my 3 year old grandaughter I wish I could return it but do not have box it came in. Very sad in California.",
      "rating": 1.0,
      "verified": true,
      "author": "Barbie 7",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Beautiful little pram",
      "text": "It’s beautiful, but my 4 year old Granddaughter was too rough on it. If you have a princess rather than a tomboy princess this is highly recommended. It glides along smoothly.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy M",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Adorable and sturdy",
      "text": "My 7 year old loves this. It is a great height for her. She got this for Christmas and it was missing a rod in the basket at the bottom to hold it up. So the bottom half just flopped around. The company sent us a new basket. Works great now. She plays with this a lot. It is adorable. I love the rosebud print. It wasn’t too difficult to put together either.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Odd",
      "text": "Came with paint peeling off the wheel rod, rust on it. The plastic cover on the handle is sliding left and right- very annoying for a toddler, no grip if she wants to turn Cheap plastic hinging mechanism - it will surely break in a couple of months Overall, at the same time nice and faulty.",
      "rating": 1.0,
      "verified": true,
      "author": "Yevheniia Syrevych",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Amazing",
      "text": "I cannot express how much I love this baby doll stroller. It totally exceeded my high expectations. It is super heavy duty yet easy for my 2 year old to use. Super smooth to push. Love the flower print!! Love how versatile it is. My daughter loves to “walk” her babies and then park the cart and take out the bassinet to carry them. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Rhea Porter",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Absolutely Beautiful Baby Buggy",
      "text": "Absolutely Beautiful Baby Buggy.. Every little girls dream .. Made well.. Easy to assemble, practically no assembly required.. Every detail was thought of .. So so Happy with this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Stu Jacobsen",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Beautiful stroller for dolls",
      "text": "I love this stroller! I was looking for a new one for my daughter. I was iffy on the price for a doll stroller but decided to purchase since I couldn’t find one similar to this. I don’t regret it at all. It’s perfect!! My daughter fell in love.",
      "rating": 5.0,
      "verified": true,
      "author": "Gaby Perez",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "very sad 3year old",
      "text": "My Foster child got one from me for Christmas. She weighed 34lbs and was 3 years old. She was not looking where she was going and fell over it. It buckled under her weight and when we tried to put it back together the frame was bent...sad cause it looked so sturdy and she felt so bad cause she broke it! Now she just plays with the basket ( was not attached at the time just the stroller part). Have thought about contacting Company in case it was just a defective frame...stuff happens!",
      "rating": 1.0,
      "verified": true,
      "author": "cathie",
      "helpful_votes": 3,
      "publication_date": 20140203
    },
    {
      "title": "Easy to assemble. Great quality.",
      "text": "Love this! We got the rosebud pram for a Christmas gift a month ago and just put it together tonight. We thought it would be a lot of pieces and a headache but it was SO easy to assemble, my 3 year old could’ve done it. I can tell this is going to last a long time. Great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Perez",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "cute",
      "text": "my granddaughter loves it, but she doesn't like the fact that the front wheels don't turn. my bad for not seen that..",
      "rating": 3.0,
      "verified": true,
      "author": "Veronica",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Nope!",
      "text": "Not happy. After my 5 year old daughter using it indoors only for the bassinet is to heavy. Doesn't stay in place. Frustrating. Returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Mc1983",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Love it",
      "text": "I bought this for my granddaughters and they love them. Perfect gift for a 3&5 years. My son assembled them and had no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Collins",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Isn’t sturdy. Doesn’t stay connected.",
      "text": "Such a darling carriage however it started coming apart the first time our daughter used it and since that day doesn’t stay together as she pushes it around.",
      "rating": 1.0,
      "verified": true,
      "author": "Mama510",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "This stroller is unique and adorable. Great quality",
      "text": "This stroller is unique and adorable. Great quality. I purchased this along with other items from the same seller for Christmas and she absolutely loves all of them! She spends hours playing with these. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "LIsa Vatala",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "nice but not quite sturdy",
      "text": "Nice pram but the wheels are really not sturdy....one of them came off when my LO pushed it across the lawn in my backyard....",
      "rating": 3.0,
      "verified": true,
      "author": "JZ",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "annoying",
      "text": "The badger basket just sits on top and isn't fixed to the bottom part so it slides off with regularity but other than that its ok",
      "rating": 3.0,
      "verified": true,
      "author": "blarneygirl",
      "helpful_votes": 2,
      "publication_date": 20170905
    },
    {
      "title": "It’s big; will work up to age 9",
      "text": "Bought this cute buggy for my 2 year old granddaughter for her birthday, she loves it! Looks Exactly as shown in the stroller exactly as shown, stroller or buggy.... Very happy with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "My girl loves it!!",
      "text": "My almost 3 year old loves this toy!!! Unlike what some other reviewers said, the bassinet CAN be attached and secured in place on the stroller, so your kid can run and it won't fall off of it. I don't know if this has been a recently added feature though. Stroller is sturdy, but delicate so I wouldn't recommend it for rough or young kids. We are very pleased with this purchase. The stroller is super cute and super easy to be put together. :) It is also just like it is in the pictures. :) cute cute cute cute!!",
      "rating": 5.0,
      "verified": true,
      "author": "Thais P",
      "helpful_votes": 0,
      "publication_date": 20140116
    },
    {
      "title": "Two year old loves this!",
      "text": "This is the cutest cradle ever! We gave our two year old this for Christmas and she loved it. It is good quality and was simple to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "chelsea melsha",
      "helpful_votes": 6,
      "publication_date": 20160111
    },
    {
      "title": "Not a bad purchase if you dont expect it to last a long time.",
      "text": "My granddaughter loves it. The bottom of the basket is cardboard so I'm sure it wont last long. The pink grip on the white handle slides and makes it hard to control it. It's very cute. Just not very durable.",
      "rating": 3.0,
      "verified": true,
      "author": "J.Lacy",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Not with the price",
      "text": "Ordered one never received it he ordered it again and putting it together one of the pieces fell off I gave up the carriage is beautiful but to me it was not worth it very Wiggly",
      "rating": 2.0,
      "verified": true,
      "author": "Nevaeh",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "This buggy is so adorable. I looked and looked before I bought it",
      "text": "This buggy is so adorable.I looked and looked before I bought it. I only gave it 5 stars because the top part slides around. I found a solution though as I wound up tying it down in four places anchoring the top basket to the frame. It will make into a stroller but I didn't tell my grandchild as I would have to undo my handywork. tie downs It holds quite a few dolls. It is so cute and my granddaughter, age 4, LOVES it!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Lover of Dolls and Stuffed Animals",
      "helpful_votes": 0,
      "publication_date": 20150302
    },
    {
      "title": "Very good product",
      "text": "After having had to return several strollers I purchased locally for my daughter (because they were complete garbage) I ordered this one in desperation. And it's perfect! Well designed and well made - the basket can be removed and carried. The under-section can be a stroller in its own right. Or the two can be joined (as in the picture) for a (as my daughter puts it) \"Mary Poppins stroller\". A very good value for the money - much better than most of the others available till you get into serious $$",
      "rating": 5.0,
      "verified": true,
      "author": "mde",
      "helpful_votes": 4,
      "publication_date": 20131227
    },
    {
      "title": "a favorite",
      "text": "Our four-year-old granddaughter was instantly smitten by this pram. The wheels glide easily, and the multiple features of this pram/stroller/carrier make it very versatile for a little mommie. The only negative is the hinges that raise and lower the \"hood\". If you place them in the fully open/locked position they are too hard for a child (or arthritic grandmother!) to open and lower. But the great thing is that the hood stays up fine without placing the hinges in the fully-extended position. It is easy for our granddaughter to maneuver.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20121229
    },
    {
      "title": "Too big for a three year old and front wheels are fixed- hard to turn.",
      "text": "I really was hoping to love this. It isn't really practical. It is very challenging for a small child (regular sized three year old) to use since the handle is so high and the front wheels don't turn on function I give it ZERO stars- but it is very cute so it balances out to two stars. I'm going to try to return but it was already expensive, I hate to pay more to ship it back.",
      "rating": 2.0,
      "verified": true,
      "author": "Courtney O'Gorman",
      "helpful_votes": 0,
      "publication_date": 20150608
    },
    {
      "title": "Not a cheap-o kid stroller",
      "text": "Got this for my daughter who has been through many baby doll strollers. This one is more robust than the standard toy stroller and actually provides a 3 in 1 set-up.",
      "rating": 4.0,
      "verified": true,
      "author": "Bobb Webb",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Too many options",
      "text": "Too many bells and whistles to be a kids stroller More complicated then a real stroller",
      "rating": 4.0,
      "verified": true,
      "author": "Michelle C ",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Great Colors!",
      "text": "I love the colors and the quality of this 3-in-1 Doll Pram.I got one in a Polka Dot one too.My niece would definitely love this for Christmas.She already has one in a navy blue color before and it's amazing. Got it shipped so quick too! This is great for girls who love to play with their dolls most of the time and can get a little bit rough because the parts are durable.",
      "rating": 5.0,
      "verified": true,
      "author": "pure_intentions",
      "helpful_votes": 4,
      "publication_date": 20121121
    },
    {
      "title": "Not the best design",
      "text": "Wheels do not turn. Hard to navigate. Too hard for toddler fo use.",
      "rating": 1.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Perfect!",
      "text": "My daughter wanted a new stroller. She turned 6 and the “old stroller” was too short for her now so I thought this would be the perfect birthday present for her and IT WAS!! It is was we were expecting, tall enough, strong enough and so fancy and classic at the same time. The fabric is beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Ospina",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Rosebud Doll Pram 3-in-1!",
      "text": "We recieved the doll pram sooner than expected- we were pleasantly surprised at the quality & easy assembly. It is as cute as the picture- so sweet. Our granddaughter has not 'test-driven' it yet, as Santa is not due for a few more days, but i think she will love strolling her toy kitty cats around in it! Pops and I are very satisfied with purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "LC",
      "helpful_votes": 0,
      "publication_date": 20131221
    },
    {
      "title": "Was missing a wheel clip.",
      "text": "Great product! Clipping the bed down needs more development. Ended up just using tie wraps because the clips kept popping off. This is a problem everytime she wants to take it off. Was also missing one clip for the wheels. Glued it. Great product though! She loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Brendon Post",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Good product",
      "text": "Bought it for my daughter and she loves it worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie  vanagtmael",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Adorable!!!!",
      "text": "Adorable!!! My daughter loves it!!! Great quality, so beautifully designed! On time and Thank You !",
      "rating": 5.0,
      "verified": true,
      "author": "Cole",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Terrible",
      "text": "Worst thing in the world. So flimsy, don’t buy this crap. This is a junky toy. Whoever buys this is an idiot and they are throwing their money down the drain.",
      "rating": 1.0,
      "verified": true,
      "author": "Bcoll",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Not worth it",
      "text": "The bars to hold bassinet to the stroller broke off within a few uses. Bars that held stroller seat broke. My daughter’s $8 doll Stroller Black Friday deal lasted longer. I guess it’s ok, if it’s just for looks.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Daughter loves it. Just wished the wheels turned. ...",
      "text": "Daughter loves it. Just wished the wheels turned. But to her it doesn't matter. Over a year bow and she still plays with it. And it has withstood a lot!",
      "rating": 4.0,
      "verified": true,
      "author": "Trisha Stafford",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "Sturdy well made",
      "text": "Excellant cute adorable sturdy 2 in 1. Love it for my 5 yr old granddaughter. She loves it too. Excellent quality",
      "rating": 5.0,
      "verified": true,
      "author": "Scraps",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "... this for my granddaughter 3rd birthday and it looks better than the picture",
      "text": "I bought this for my granddaughter 3rd birthday and it looks better than the picture. I was honestly surprised given the price. My granddaughter cannot stop rolling it around the house with her beloved Adora doll (another birthday present) inside. I'm happy to see her so excited and \"engaged\". I'm hoping it will last long enough for her enjoyment.",
      "rating": 5.0,
      "verified": true,
      "author": "Adriana M Loghin",
      "helpful_votes": 2,
      "publication_date": 20160717
    },
    {
      "title": "Great basket",
      "text": "This is a great stroller. It appears very sturdy and easy to put together. The pattern is nice. Had bought a stroller similar to this one at Wal-mart and it did not survive my children but I am hopeful for this one. My only complaint is that it arrived in the box that had the picture of the stroller which could have been a problem if the kids saw it since it was a Christmas present. I would definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Delanie",
      "helpful_votes": 0,
      "publication_date": 20121204
    },
    {
      "title": "It’s what ever little girl wants.",
      "text": "Best one I have ordered. It’s so pretty and every little girl would love.",
      "rating": 5.0,
      "verified": true,
      "author": "Tonya Neal",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Not sturdy",
      "text": "Although the stroller is adorable, it isn't sturdy. The directions were very difficult to follow.",
      "rating": 3.0,
      "verified": true,
      "author": "Anne Gruett",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Pram",
      "text": "Christmas gift for our granddaughter and it is even cuter than represented. It's large enough for her \"big babies\" with room to spare. The large when las make it easy to maneuver on all surfaces and carrier disconnects easily. This was one of several Badger products we purchased for MaKenna and recommend all highly and will continue to purchase their products.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Sisto",
      "helpful_votes": 0,
      "publication_date": 20130102
    },
    {
      "title": "Super cute!",
      "text": "I can’t wait to give these to my grand daughters on Christmas! They are so cute!",
      "rating": 5.0,
      "verified": true,
      "author": "Ally",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Easy to install",
      "text": "It's solid, it's safe for the baby to lie in, and I can reat assured that it's of great quality",
      "rating": 5.0,
      "verified": true,
      "author": "Joy C. Hibsher",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "I love this baby buggy",
      "text": "I love this baby buggy, it's made great, it's not flimsy, it's well secured, easy to attach and put together. It's tall enough for a 6 year old (not short like many out there are). This was a great and happy buy, admired by all her little friends.",
      "rating": 5.0,
      "verified": true,
      "author": "denise",
      "helpful_votes": 0,
      "publication_date": 20150106
    },
    {
      "title": "Junk",
      "text": "This carriage was a problem from day one The body does not stay on the frame. it's just a piece of junk for the money So frustrating its in the garbage already. Don't buy this. Not made well",
      "rating": 1.0,
      "verified": true,
      "author": "JERSEY GIRL",
      "helpful_votes": 2,
      "publication_date": 20140120
    },
    {
      "title": "Always needs to be reassembled",
      "text": "Easily comes apart when my daughter is using it and constantly have to reassemble it for her during play.",
      "rating": 2.0,
      "verified": true,
      "author": "Matthew Nowen",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "So Cute",
      "text": "I got two of these for both of my little grandaughters. They are really cute. The quality is nice and they were very easy to put together. Basically all you have to do is put the wheels on. I would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "lucy",
      "helpful_votes": 0,
      "publication_date": 20140118
    },
    {
      "title": "So cute!",
      "text": "This stroller is soooo cute! It’s taller than most toy strollers, and I love that the basinet part can come off. My 4 year old loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Denny",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Adorable and well made",
      "text": "Adorable and well made. Bought it for 2 year old grand daughter for Christmas. She is going to love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles C. Cox",
      "helpful_votes": 0,
      "publication_date": 20161117
    },
    {
      "title": "Pretty Basket but Beware of parts",
      "text": "Beautiful doll carrier but it came to us already broken and missing a wheel. I snagged one from a cheaper model from walmart but had to pay $25.00 to get that one so I would not suggest this to a friend.",
      "rating": 3.0,
      "verified": true,
      "author": "K. Fontaine",
      "helpful_votes": 0,
      "publication_date": 20131114
    },
    {
      "title": "... break and that money will end up in the garbage. my daughter and I loved it but she ...",
      "text": "cute but if your child is rough it will break and that money will end up in the garbage. my daughter and I loved it but she was too young for this (3) she broke the wheels.",
      "rating": 4.0,
      "verified": true,
      "author": "MandaS. ",
      "helpful_votes": 0,
      "publication_date": 20150224
    },
    {
      "title": "Great stroller. Very easy to put together",
      "text": "Great stroller. Very easy to put together. The only problem we have had is a wheel did not lock into place so it falls off every so often. My grand-daughter loves it and is 4.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20140906
    },
    {
      "title": "Breaks easily",
      "text": "We love this, it's the perfect height for my daughter since she's on the tall side. Only downside is how easily it breaks! She loves this but I keep having to re-straighten out the canopy on the basket and put the tires back on.",
      "rating": 4.0,
      "verified": true,
      "author": "Chibikittay",
      "helpful_votes": 0,
      "publication_date": 20140218
    },
    {
      "title": "Great product!",
      "text": "Great product, very sturdy and great for a little girl to play with her baby dolls with!",
      "rating": 5.0,
      "verified": true,
      "author": "SJenkins",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Perfect!",
      "text": "It is the perfect doll stroller for my 4 year old daughter. She loves it and her baby dolls!!",
      "rating": 5.0,
      "verified": true,
      "author": "ARW",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "How sad",
      "text": "My package arrived late and broken I was so disappointed I was really looking forward for my daughter to have this",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Great product, reasonably priced!",
      "text": "Great product for the price! It is much prettier in person and it is very good quality, I was pleasantly surprised. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Dinah G",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "Old is new again!",
      "text": "Granddaughter loves the buggy. She had never seen anything except the strollers - and liked the novelty of the baby buggy.",
      "rating": 5.0,
      "verified": true,
      "author": "okstomper",
      "helpful_votes": 0,
      "publication_date": 20150826
    },
    {
      "title": "You won't go wrong if you buy this product",
      "text": "Got this present for my eight year old. It is perfect fit in height for my tall girl and for her baby. Her baby is an 18in baby doll but it will hold a bit bigger baby doll. Quality product, metal frame, good craftmenship.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara W.",
      "helpful_votes": 0,
      "publication_date": 20131226
    },
    {
      "title": "Beautiful!",
      "text": "Granddaughter's 1st carriage for her 1st birthday. She strolls all her stuffed animals and baby dolls in it. Beautiful!",
      "rating": 5.0,
      "verified": true,
      "author": "SimplyRosa",
      "helpful_votes": 0,
      "publication_date": 20141029
    },
    {
      "title": "Rosebud",
      "text": "Our grandaughter loves her new Rosebud Doll Carrier very much. She has just started walking and has no problem pushing her dolls around the house with the Stroller.",
      "rating": 4.0,
      "verified": true,
      "author": "Potbelinick",
      "helpful_votes": 0,
      "publication_date": 20120526
    },
    {
      "title": "Lovely and big enough to grow with",
      "text": "I got this for my 3 1/2 year old daughter for Christmas. She is really tall and has to hunch over on most of the toys designed for her age. This is perfect. It is a really good size, she can even grow with it. It is a lovely little thing. Sturdy and not too much to put together. We have only used the pram and not the other 2 features. She loves it.",
      "rating": 4.0,
      "verified": true,
      "author": "E. Mulheisen",
      "helpful_votes": 0,
      "publication_date": 20121230
    },
    {
      "title": "very nice and well made",
      "text": "very easy to put together and very cute. Tall enough so my grand daughter can use it for a long time. Very well made and love the print on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcie",
      "helpful_votes": 0,
      "publication_date": 20130429
    },
    {
      "title": "Loved It!",
      "text": "She loved it and played it until its dear departure. She like how you could detatch the bassinet and use it as a bed.",
      "rating": 5.0,
      "verified": true,
      "author": "KittyMomma",
      "helpful_votes": 0,
      "publication_date": 20140508
    },
    {
      "title": "Really well made",
      "text": "This doll stroller could be used for a real baby! It is cuter than it looks and my granddaughter loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "AJM",
      "helpful_votes": 0,
      "publication_date": 20131101
    },
    {
      "title": "Perfect little stroller",
      "text": "Great little stroller mine one and a half year old loves it! Totally worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "anna",
      "helpful_votes": 0,
      "publication_date": 20151012
    },
    {
      "title": "Love IT!",
      "text": "This is the most darling baby buggy! It's well made and good quality materials. The best part is that my daughter won't outgrow is any time soon. It's tall enough for her to use for many years.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Herman",
      "helpful_votes": 0,
      "publication_date": 20131017
    },
    {
      "title": "you get your money's worth",
      "text": "We gave this to our granddaughter for her second birthday, She loves it and seems to prefer the stroller but still uses the pram part as a baby crib. It was not very difficult to put together either. It seems pretty sturdy so far and she has a 4 year old brother who can be very rough at times. Guess what! He loves it too. It shipped on time. It was perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "MarilynT",
      "helpful_votes": 0,
      "publication_date": 20120803
    },
    {
      "title": "great toy baby stroller",
      "text": "it took me all of 5 minutes to assemble the stroller. very easy. it rolls very easily and is very easy to go from 1 kind of stroller to the next. my 4 year old can pretty much change it herself",
      "rating": 5.0,
      "verified": true,
      "author": "JOE HARKINS",
      "helpful_votes": 0,
      "publication_date": 20140202
    },
    {
      "title": "My badger basket",
      "text": "Iam very happy with the badger basket, the only thing im not so happy is with the handle it has a plastic that moves a lot",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160815
    },
    {
      "title": "My granddaughter loves this carriage!",
      "text": "I purchased this for my granddaughter and she has not quit playing with it since she got it. It is very versatile and appears to be very sturdy. There was very little assembly and it was very easy.",
      "rating": 5.0,
      "verified": true,
      "author": "MaryArm99",
      "helpful_votes": 0,
      "publication_date": 20120928
    },
    {
      "title": "Great carriage, holds up to lots of use.",
      "text": "Purchased for my granddaughter. Other carriages did not last long. This one stood up to lots of use and some brothers taking it as well. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen D.",
      "helpful_votes": 0,
      "publication_date": 20140603
    },
    {
      "title": "Rosebud Basket",
      "text": "My granddaughter loves it. She packs it and is ready at the door anytime the family goes out - she has her basket (at least the carrier) and insists that it go, too. I was pleased that it was so well made with a nice \"finished\" look.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130113
    },
    {
      "title": "Five Stars",
      "text": "Can't say enough about how wonderful this product is.. very sturdy and great height!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jumawil",
      "helpful_votes": 0,
      "publication_date": 20141029
    },
    {
      "title": "Five Stars",
      "text": "Kids love the stroller. Very well built and the dual carrier is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Monica L D'Accio",
      "helpful_votes": 0,
      "publication_date": 20140930
    },
    {
      "title": "Not sure how good it is as its a Christmas gift for my ...",
      "text": "Not sure how good it is as its a Christmas gift for my daughter but for $30 ill give 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Sylvia Higuera",
      "helpful_votes": 0,
      "publication_date": 20151128
    },
    {
      "title": "So cute and fun",
      "text": "My granddaughter loves this buggy. I was impressed but the quality and the versatility. We did have to take some time to figure out how to secure the Pram Carrier to the stroller and I was worried that it wouldn't hold but so far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon T.",
      "helpful_votes": 0,
      "publication_date": 20140103
    },
    {
      "title": "Very happy with this stroller!",
      "text": "Very happy with the quality of this play stroller and my 2 and 4 year old love playing with it. The rose pattern is adorable.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Jordan",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "beautiful",
      "text": "My granddaughters LOVED this stroller. They both got it for Christmas and used it for the 3 days I spent with them!",
      "rating": 5.0,
      "verified": true,
      "author": "tuckerman",
      "helpful_votes": 0,
      "publication_date": 20130108
    },
    {
      "title": "Absolutely adorable!!",
      "text": "Absolutely adorable!!! My 3 yr. old granddaughter loves taking her baby for a ride - uses it as a bassinet & to have her sit up in. Great item - great price!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Toni",
      "helpful_votes": 0,
      "publication_date": 20150821
    },
    {
      "title": "Doll Stroller",
      "text": "The stroller was received quickly and was nicely packaged. The build quality is great, I love the 3-in-1 feature, three times the fun. The kids also love it.",
      "rating": 5.0,
      "verified": true,
      "author": "V. B.",
      "helpful_votes": 0,
      "publication_date": 20130612
    },
    {
      "title": "Adorable! A little big for my 1",
      "text": "Adorable! A little big for my 1.5 year old but she will grow into it. My 3.5 year old son loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160615
    },
    {
      "title": "Lovely!",
      "text": "Grand-daughter loved it. Has a two types of items stroller seat and the basket that can be removed and carried. Very nice. Easy to put together!",
      "rating": 5.0,
      "verified": true,
      "author": "Shelley Curran",
      "helpful_votes": 0,
      "publication_date": 20150104
    },
    {
      "title": "\" very good quality and very pretty",
      "text": "Grandaughter loves her \"baby buggy..\" very good quality and very pretty.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheryl Morgan",
      "helpful_votes": 0,
      "publication_date": 20150217
    },
    {
      "title": "cute as a button",
      "text": "Daughter loves this! It is the hold all for many cherished dolls and stuffed pets. Holding up well to daily use.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristine Campbell",
      "helpful_votes": 0,
      "publication_date": 20130605
    },
    {
      "title": "Bigger than expected",
      "text": "I bought this for my two year old but it is a bit tall for now. She will grown into it though. My six yr old loves it though because most strollers are too small for her anymore.",
      "rating": 4.0,
      "verified": true,
      "author": "murlaine",
      "helpful_votes": 0,
      "publication_date": 20130714
    },
    {
      "title": "Five Stars",
      "text": "My Granddaughter just love it it was the perfect size for height, also she loved the Jenna Doll",
      "rating": 5.0,
      "verified": true,
      "author": "Joan Markovich",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "What a piece of junk!",
      "text": "Folks, As great looking this toy is...it is a piece of junk! It breaks easily, and it is rather dangerous. It is practically made out of a cardboard and cheap, plastic pieces...not worth the money. All in all its a great idea, but a very poor product.",
      "rating": 1.0,
      "verified": true,
      "author": "Anna from VA",
      "helpful_votes": 7,
      "publication_date": 20120827
    },
    {
      "title": "Great Baby Carriage - Great Value!",
      "text": "This stroller is very well made! I was pleasantly surprise with the excellent quality! Also, quite easy to put together. Any little girl would love this for her dollies!",
      "rating": 5.0,
      "verified": true,
      "author": "Sal",
      "helpful_votes": 0,
      "publication_date": 20130715
    },
    {
      "title": "Okay for price",
      "text": "The quality is not so great but my girls love it, we had a little difficulty putting it together but it is super cute!",
      "rating": 3.0,
      "verified": true,
      "author": "Debbie A. Schlosser",
      "helpful_votes": 0,
      "publication_date": 20130906
    },
    {
      "title": "Badger Basket Rosebut 3--in-1 Doll Pram Carrier and Stoller - Pink",
      "text": "It's cute but when it came it was a pink with small flowers on it, and I ordered the pink with white polka dots pattern. It was a birthday gift for our 2 yr. old great granddaughter. She loved it and immediately played with it.",
      "rating": 4.0,
      "verified": true,
      "author": "THE LCDRS LADY",
      "helpful_votes": 0,
      "publication_date": 20120613
    },
    {
      "title": "I rate it 5 stars!",
      "text": "My grandaughter loves it and plays with it often. Great replica for an old fashioned pram and perfect size for a 4 year old.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy Fender",
      "helpful_votes": 0,
      "publication_date": 20130521
    },
    {
      "title": "Five Stars",
      "text": "Multiple uses for lots of fun, fit each of the grandchildren ages 2-10",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce T.",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "awesome",
      "text": "Thie was a birthday gift for granddaughter, was so much bigger then I was thinking it would be.It was just great all the way ..And she just loved it..",
      "rating": 5.0,
      "verified": true,
      "author": "bobbie hackett",
      "helpful_votes": 0,
      "publication_date": 20131001
    },
    {
      "title": "carriage",
      "text": "The stroller is well built, sturdy and easy to use. My four year old loves it. Can hold several dolls.",
      "rating": 4.0,
      "verified": true,
      "author": "Dallas Ingram",
      "helpful_votes": 0,
      "publication_date": 20130124
    }
  ],
  "product_meta": {
    "title": "Badger Basket Pink Rosebud 3-in-1 Doll Pram, Carrier, and Stroller (fits American Girl Dolls)",
    "description": "Color:Pink/RosebudBadger Basket’s exciting Just Like Mommy 3-in-1 Doll Pram includes a fancy doll carriage, a doll stroller, and a doll carrier with carrying handles all in one! Your child can push or carry her baby doll everywhere in comfort and style. Change the look on the fly – no tools needed to convert from one style to another. The three, fun configurations, and additional realistic features, offer extra play value and numerous opportunities for your child to make thoughtful baby care decisions during play. Use the carrier and stroller separately for different baby dolls. Carrier can be attached to the frame so that the pram faces forward or back. Carrier also includes a fabric cover, interior padding, and adjustable canopy. Adjustable stroller seat with three-point harness. Rubber grip on the stroller/pram handle. Stroller frame easily folds down. Made with fabric, PP plastic, EVA wheel tread, metal tubing, PVC-free synthetic rubber, and MDF. For dolls up to 22 inches. Fits 18 inch dolls such as American Girl, My Life As, Madame Alexander, and Our Generation; and also fits 15 inch American Girl Bitty Baby dolls and 14.5 inch American Girl WellieWishers dolls. Overall pram measures approximately 30 inches L x 15.5 inches W x 32 inches H. Wheels: 7.5 inches diameter. Height from floor to top of handle: 26 inches H. Carrier: 24 inches L x 12 inches W x 9 inches H (7 inches H not including folded hood, 17 inches H with hood up). Interior of the carrier: 22.5 inches L x 9.5 inches W x 6.75 inches H. Stroller: 30 inches L x 15.5 inches W x 26 inches H. Interior of stroller seat: 9 inches W x 19.5 inches H. Wipe and spot clean as needed. For children from three years old and up. This item is a toy only. Adult assembly required. /!\\ WARNING: CHOKING HAZARD - Small parts. Not for children under 3 yrs. Doll not included. Product may vary slightly from shown. Props shown are for illustration only and are not included. Item ships in its original carton which may include a product photo.\n\nFROM THE MANUFACTURER\nThis exciting item includes a Doll Pram, Carrier, and Stroller all in one. Designed so that your child can take her dolls everywhere in comfort and style. Sweet Pink Rosebud fabric completes the fashionable look. Lift the carrier off the pram to reveal a reclining stroller. Pram rocks and has 7.5\" wheels. Carrier is 6.5\" deep and can be attached to the frame so that the pram faces forward or faces your child as she pushes the carriage. Carrier also includes a fabric boot/cover, a fabric-covered-foam pad, and carrying handles. For dolls up to 24\" . Measures approximately 15\" x 30\" x 32\" . Height of 27.5\" to the top of the handle. Stroller/pram frame is easy-to-fold and is made of powder coated steel. Fabric parts are poly/cotton and can be spot cleaned. Wheels are plastic with plastic tread. Also includes a rubber grip on the stroller/pram handle. Can be enjoyed by children from three years old and up. Small parts - not for children under three. All paints and finishes are non-toxic built to exacting standards for safety and quality. Some adult assembly required. Illustrated instructions included. This item is a toy for use with dolls only. It is never to be used with real infants or pets. Additional picture shown for this item is not shown in the Pink Rosebud fabric. This item ships in its original carton which may include a photo of the product.",
    "rating": 4.2,
    "feature_bullets": [
      "With this convertible all-in-one doll pram your child can push or carry a favorite doll in comfort and style",
      "Fits dolls up to 22 inches (doll not included)",
      "Made with metal, fabric, plastic, and EVA tread on the wheels",
      "Overall measures approximately 30 inches L x 15.5 inches W x 32 inches H (26 inch handle height)",
      "Fits 18, 15, and 14.5 inch dolls such as American Girl, My Life As, Madame Alexander, Our Generation, Bitty Baby, and WellieWishers",
      "Wipe and spot clean as needed",
      "For children ages three and up (adult assembly required)",
      "Manufacturer's 30 Day Limited Warranty",
      "Includes multiple play options - pram, carrier, and stroller",
      "Rolls smoothly",
      "Rubber grip on handle for comfortable pushing"
    ],
    "specifications": {
      "Item Weight": "7.2 pounds",
      "Product Dimensions": "30 x 15.5 x 32 inches",
      "Item model number": "00561",
      "Is Discontinued By Manufacturer": "No",
      "Assembled Height": "32 inches",
      "Assembled Width": "15 inches",
      "Assembled Length": "30 inches",
      "Weight": "15 Pounds",
      "ASIN": "B0007ZKN5U",
      "Customer Reviews": "4.2 out of 5 stars214 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#32,982 in Toys & Games",
      "Date First Available": "June 15, 2005"
    },
    "categories": [
      "Dolls & Accessories",
      "Doll Accessories",
      "Strollers",
      "Toys & Games"
    ],
    "price": 41.99
  }
}