{
  "website_summaries": [
    {
      "verdict": "Plano’s compact bow case is a simple, effective, and inexpensive equipment storage solution that does its job well.",
      "pros": [
        "Crushproof plastic case",
        "Stores 5 arrows under lid",
        "High-density foam insert",
        "Includes tie-down straps",
        "Plastic molded handle",
        "Affordable"
      ],
      "cons": [
        "Although the outer case is strong, it would have been nice if the foam insert featured an indent to cradle your bow"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Hoyt PowerMax owners",
      "text": "To those that own a Hoyt PowerMax this case WILL NOT FIT your bow. As you can see from the photo the two posts that support the center of the case get in the way of the bow. I fixed this by using a Dremel to cut out the posts, then used an exacto knife to clean up the cuts and then patched both the inside and outside of the holes in black duck tape. It's nothing fancy but my bow fits nicely now. I still gave it 5 stars because this is a low cost decent case for many other smaller bows.",
      "rating": 5.0,
      "verified": true,
      "author": "Reviewer",
      "helpful_votes": 50,
      "publication_date": 20170421
    },
    {
      "title": "Perfect fit",
      "text": "Just came in and in less than 5 minutes I set it up. Pretty simple. My hoyt charger fits in very snug. Any larger of a bow and I'd have to force it in. I do not have a quiver attached so I wonder how'd it fit later but for now it's good. Also holds 6 arrows. Plastic may seem a little flimsy but I don't plan on throwing it around so it'll do the job just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Karl",
      "helpful_votes": 66,
      "publication_date": 20141001
    },
    {
      "title": "Missing Parts",
      "text": "I have tried 3 times to contact plano with no resolve inside. I purchased 2 of these cases . I open the first and everything looked as they described. I opened the second plano case to find nothing inside it. All I'm asking is is to send me the missing parts please.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200309
    },
    {
      "title": "Sturdy bow case and a great value.",
      "text": "I use this bow case as just that, a bow case. This is my third as I'm adding another bow. There's plenty of room for my BowTech, with the sight on. There's also enough room to store a detached quiver and the loop arrow draw. The two pylons prevent the case from getting crushed down around the bow if stepped on or as an airline checked item. There is storage for arrows and I do store some without any broadheads or field points so as not to damage the string or cables. All in all it has worked for me for a number of years now, and I cannot complain.",
      "rating": 5.0,
      "verified": true,
      "author": "K Moore",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Would probably be great if they included the foam, straps and arrow holders",
      "text": "The case seems pretty good. I wouldn't expect any thicker plastic for the price and it looks like it would have served its purpose well if it arrived complete. But while I received an unopened box with the plastic case, there was no foam, no straps, and no inserts to hold arrows. Nothing but the case and the tag attached to it. I'd guess there's a way to get Plano to send it all to me, but why should I jump through hoops when they can't pack their products correctly? A return to Amazon will be easier and faster. And maybe it will encourage Plano to step up their quality control.",
      "rating": 2.0,
      "verified": true,
      "author": "Are Viewer",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Very satisfied",
      "text": "The first case I received didn't attach at the hinges. Received a second case after returning the first one. The second case works great! Has a ton of room to fit all of my bows accessories and replacement parts, which is quite a lot. The foam is perfect for protecting the bow and there is a velcro strip that holds the bow and arrow holder in place. There is also extra room to hold more arrows in a built in holder on the top part of the case. Very satisfied with this purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Rebel G.",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Perfect Case for my Bear Authority Compound",
      "text": "I love everything about this case. Even better, I took a chance on getting it from Amazon Warehouse and it looked brand new and unused. I attached the components as instructed and it's been a perfect solution ever since. This case provides the security and protection I was looking for. I don't mind spending more since it's protecting equipment that's not cheap, but why spend more if you can get quality at this price point! Besides that, Plano has a great reputation.",
      "rating": 5.0,
      "verified": true,
      "author": "James Anderson",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Missing Parts",
      "text": "The case seems pretty good and it looks like it would have worked if it had arrived complete. There was no foam, no straps, and no inserts to hold arrows. Nothing but the case and the tag attached to it. I’m returning to Amazon for a replacement. If it is missing parts also I’ll try another brand with better ratings. Should have paid attention to others complaining of missing parts. Helpful",
      "rating": 1.0,
      "verified": true,
      "author": "elkaybe",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Very Disappointed in Amazon for the first Time In Years!",
      "text": "Ordered this for my Son it arrived in on time, box was undamaged and in good shape. When we opened box the case was great and in good shape but it didn't have the arrow holder or straps included in the case as it says on the box and in the ad. Had a very disappointed kid he was so excited to get this in before his first Archery tournament. This was one of his Birthday gifts. Have tried to contact Plano but can't get an answer as of yet.",
      "rating": 1.0,
      "verified": true,
      "author": "Bobbie",
      "helpful_votes": 3,
      "publication_date": 20181126
    },
    {
      "title": "Go ahead and spend more money on a better quality product",
      "text": "Very dissatisfied with this product. I read all of the reviews and I was really hoping that maybe I would have a different experience than some other people with the quality of this product, but Alas, that was not the case. Gave it to my husband for Christmas, he was so excited and once he opened the box and opened the case, it fell apart..there weren't metal rods in two of the three hinges to hold the two sides together. Poorly made and so disappointed as this was his big present on Christmas morning.",
      "rating": 1.0,
      "verified": true,
      "author": "Kat T",
      "helpful_votes": 3,
      "publication_date": 20171225
    },
    {
      "title": "Hard to lock",
      "text": "Got this for my 9yr old for her bow, she is able to carry it fine, and secure her bow in it by herself after set up. The reason I gave it a 4 is because it is hard for her to lock, I have to do it and the latch is a hard lock. I hope with some wear and tear the latch will loosen up a bit. I also thought it should be a little bigger, her arrow holder barely fits and that over part of her bow.",
      "rating": 3.0,
      "verified": true,
      "author": "Salsa Gal",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Nice case for everyday use",
      "text": "Great case for the money. Mathews solo cam fits like a glove and you can mount the quiver to the top, using Velcro straps routed through the molded in tabs, right above the supplied arrow storage slots. Its not something I would take to the airport, but, any other time its great protection, small enough to tuck away and light enough to not make hauling it around a hassle.",
      "rating": 5.0,
      "verified": true,
      "author": "Lakestang",
      "helpful_votes": 60,
      "publication_date": 20150210
    },
    {
      "title": "Great case for my compound bow",
      "text": "Great case for my compound bow. The price is right and the case has held up for one year of use. Light weight yet sturdy this case is everything I asked for. Not compliant for airline travel however that case was not designed for that application. I live Colorado and I have taken this case all over the state and it has held up well and protected my bow from damage.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark DeZuba",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Just a case to store your bow...",
      "text": "I have a Bear Species Compound Bow and it fits fine. Very little assembly when you receive the case. Must attach rubber arrow holder to lid and screw on the velcro strap, which holds the bow secure inside. Case is decent for the price. I only gave 4 stars because the handle feels a little cheap and does not always line up together. If you need a case to store your bow, then this is it for the price. Short trips are ok to travel with this case. If your going on a flight to travel for that big hunt, I would not recommend this case.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeffrey L Stull",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Best hard case for a compound bow for the price!",
      "text": "Great bow case for any standard compund bow! The case does a wonderful job in securing the bow to the foam pad with these tough Velcro straps that allow no movement while the case is moving, which is very nice. Can also fit a small bundle of arrows in addition to the bow! Overall a great case and the only knock I can make on it is that it is a bit big relative to other more compact had cases out there, but this is such a minor gripe it's almost irrelevant.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathon Gimenez",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "If you need a case this one is cheap.",
      "text": "Cheap case that gets the job done. The case feels flimsy when you open it up. I wish there was more attachment points in the case. I had to glue some velcro into the case so I could keep a little pack of essentials in the case incase I needed to do any work to the bow. I holds just 6 arrows in it. The bow feels very secure in it and I have never worried about it inside of it. This case is very nice if you don't want to spend a lot of money on a case and just want a place to keep your bow when you are not using it.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 2,
      "publication_date": 20160723
    },
    {
      "title": "Great case for the price",
      "text": "I was a little upset at first that there was no camouflage coloring, but checked my order again and realized that in the description, it says \"(black)\". Its a little deceiving when the picture clearly shows camouflage, but oh well. The case seems pretty durable, and it wasn't that hard to set up. The whole, \"some assembly required\" part was a bit of a downer too. In the end, a screwdriver and a little elbow grease were all that's needed, and my wifes happy with a new case to protect her new bow. It easily fits her Diamond Edge Compound bow.",
      "rating": 5.0,
      "verified": true,
      "author": "Stringer",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "Protects the bow and has room to spare.",
      "text": "This bow case is wonderful! Fits my husband’s bow, six arrows, and all of his bow accessories (release, quiver, sight, etc.). The Velcro straps keep the bow from knocking around when moving it and there is a small loop on the outside for a padlock in case of travel. We have a Bear and a Diamond Archery bow and both fit well.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Keeps my son’s bow & arrows safe so we’re happy!",
      "text": "Case came and was gray and not black, so that was odd. We didn’t really care about the color though- so no biggie! We had to lug it around 2 archery tournaments two weekends in a row and it’s definitely a bit bulkier and heavier than some hard cases that we’ve seen, but it does the job.",
      "rating": 4.0,
      "verified": true,
      "author": "G. Behm",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Great value!!",
      "text": "Great value. If you don’t want to spend a ton of money but still want your bow protected and easy to carry everything around, this is the case for you. I mounted a little clear tackle box for tools and extra tips and heads. Works great!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Lynch",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Good price and solid protection.",
      "text": "This case can hold a bow from youth to full size. It is lightweight enough that my 12 year old can carry it with her bow and several dozen youth arrows in it. Capacity for adult arrows would probably be a little less since they are bigger.",
      "rating": 5.0,
      "verified": true,
      "author": "MireilleTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Note: Incomplete Bow Case!",
      "text": "Note: Did not come with three Nylon Tie-Down Straps to Secure Bow and also did not come with Arrow Holder for Six Arrows which should had been included with bow case. 😤",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Very Good.",
      "text": "Plano Protector Compact Bow Case (Black) - Fits the Genesis Bow and has room for accessories such as extra arrows, stabilizer, etc. It is wider than the compact case for the Genesis (and a little heavier), but the ability to carry everything in one case makes that less of an issue. 10 year old boy will be able to carry it with bow, arrows, quiver, and some other small accessories. It is pretty sturdy for protection (it has pillars) but I would probably not count on it making it through baggage handling on an airline...",
      "rating": 5.0,
      "verified": true,
      "author": "gogo",
      "helpful_votes": 4,
      "publication_date": 20141103
    },
    {
      "title": "Good sized bow case",
      "text": "The biggest issue I usually have when I look at cases is the internal size and whether the bow will fit with the sight on it. This case seems to hit a sweet spot between too small (bow doesn't fit with sight) and too big (doesn't fit into the car). The pictures show my son's bow (Genesis Original with Trophy Ridge Joker 3 Pin Bow Sight) and mine (Genesis GenX with Trophy Ridge Fix Series Sight 5 Pin Bow Sight). I would have given it 5 stars if the padding was thicker.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Great quality",
      "text": "This bow case is extremely durable and protects my sons now really well. It’s lightweight for him to carry and to lock and open. It fits his bow nicely. He has a diamond prism and his nice and snug and enough room for his quiver and his arrows.",
      "rating": 5.0,
      "verified": true,
      "author": "Thatonegirl",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Must get one of these!",
      "text": "Bow and arrows and some other gear fit great in this carrying case. No more have to put my bow in a truck or trunk with other hunter’s gear who don’t have the same respect for the gear like I do. My only regret is that didn’t get one of these years ago. And, it is reasonably priced.",
      "rating": 5.0,
      "verified": true,
      "author": "Bobby B",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Great quality bow case",
      "text": "Great quality case for my diamond infinite bow. It doesn’t hold all my arrows in the separate holders but still fits well! I bought one for my husband too for his $1300 dollar bow and we love it!",
      "rating": 5.0,
      "verified": true,
      "author": "wtanner5",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Overall good value and quality... but assembly is annoying!",
      "text": "The case seems nice, and fairly solid. It holds 6 arrows, which is sufficient for a compact case. Overall happy with my purchase. My main issues/complaints are: 1. The assembly instructions are crap! The pictures are too dark to see anything and they don't provide a video online or on Youtube. I'm not saying it was difficult to figure out... but it should be more user friendly. 2. It should really come assembled. 3. The bow doesn't fit with a quiver on it. you have to take it off and set it in separate.",
      "rating": 4.0,
      "verified": true,
      "author": "Brett P",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "Huge",
      "text": "This is HUGE! I bought three one for my husband and two for my kids. The ones for our kids were recommend under the bows, but these are not for kid size bows. These are almost 5 ft tall!",
      "rating": 4.0,
      "verified": true,
      "author": "laura",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Works Great",
      "text": "This case works very well. We mostly just use it as a place to store the bow/arrows and use when needed. The quality is good enough. If you want something that will be so stout that nothing could hurt your bow, you probably better spend a little more money. But for the average hunter and sportsman, it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Shopper",
      "helpful_votes": 3,
      "publication_date": 20161019
    },
    {
      "title": "Solidly built case for the money with good attachment points for the arrows that are easy to ...",
      "text": "Solidly built case for the money with good attachment points for the arrows that are easy to install. But, don't let the \"Compact\" in the name fool you. This is a big case - it's significantly larger than the \"ultra compact\". If you're looking to store a smaller or youth bow, you might want to consider the ultra compact model.",
      "rating": 4.0,
      "verified": true,
      "author": "Constantine",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Awesome Case! Diamond Infinate Edge",
      "text": "This is an AWESOME basic case for the price you really cant beat it. Fits my Diamond Infinate Edge perfectly with the quiver attached. Comes with additional holders for more arrows (6) which are super easy to install. My bow doesnt budge. I tossed in a large silica gel packet under the foam cushion for moisture control.",
      "rating": 5.0,
      "verified": true,
      "author": "SarahReviewsEverything",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Great case, lockable good for young children around.",
      "text": "Great brand, I use Plano cases for a lot of my container needs. Only issues I have is: it requires two locks to secure the case. Those locks are appear to be for only young children, theft is not the primary concern. Obviously due to size but would be easy to cut into the place where the lock attaches.",
      "rating": 5.0,
      "verified": true,
      "author": "Will W.",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Parker Trailblazer XP fits perfectly!",
      "text": "Ordered this for my Parker Trailblazer XP and it fit perfectly! I don't think I would trust this on a plane by any means, but it will work fine for my truck ride to the woods. After reading the reviews, I figured it would be a pain to install arrow storage mounts. I was pleasantly surprised that the push tool didn't break. Everything was included and assembled easily. My bow fit with room and then some. I would like to have had a place to store my release and extra broad heads. For the money, this purchase was a no-brainer. I recommend this product for anyone who is after standard protection. Again, I wouldn't use this for plane travel.",
      "rating": 5.0,
      "verified": true,
      "author": "David C.",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "Some assembly required",
      "text": "The case is a nice size and durable. Padding, straps, and arrow holder inside. However you do have some assembly required for the arrow holder, which surprised me because there's no reason that couldn't be done at the factory.",
      "rating": 4.0,
      "verified": true,
      "author": "Roxy",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Protect your bow.  Try this case.",
      "text": "I purchased this case to fit my Genesis compound bow and the Easton Genesis II arrows. Great case. Easy to put together. It holds the arrows securely. The bow is fastened to the case using Velcro straps. I actually fit everything else like the wax, sites, tools. It's not an extravagant case by any means, but it is molded plastic and designed to protect the bow and the arrows. The arrows are secured by plastic inserts that you insert the arrow into. They don't move around much at all. The inside of the case has foam padding lined against the walls of the case. Nice case for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "TRFBTop Contributor: Drums",
      "helpful_votes": 0,
      "publication_date": 20140704
    },
    {
      "title": "Great durable bow case",
      "text": "Bass pro had these on sale for 40 bucks. I s ores it cheaper on here. Great bow case only issue is I hve to turn my quiver on the bow a bit to get it to close but no big deal. Holds the arrows on the top and straps the bow in to prevent it from rolling. Just kinda bulky in the trunk of a Mazda 3",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "plano compound bow",
      "text": "Holds my compound perfect even with the quiver attach. Much better than the soft case. I notice the fletching was being press by the soft case. There's no seal but it does have holes to add locks. Not bad for the price. Instructions are hard to see with the pics cause they're not in color plus it's kind of dark.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Phan",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "bow case",
      "text": "This is nice cheap case to store bow in. Got one a year ago for my son and he loves his. Not for airline travel but for from home to camp or hunting spot it works great. My diamond infinte edge pro fit good and even got quiver to snap in where extra arrows go so it all fit in good. For everyday use to and from hunting spot it is great.",
      "rating": 5.0,
      "verified": true,
      "author": "greg denton",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Great product",
      "text": "I had previously purchased a bow case for my son and I paid way more than this for it. It lasted six months and then broke. I replaced it with this one and it’s much better, much bigger, and a cheaper price",
      "rating": 5.0,
      "verified": true,
      "author": "Amy S.",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Great case and you can easily add extra storage with some more velcro.",
      "text": "Awesome case for $30. I added some double sided Velcro (not sticky kind) and used it on the top where the strap holders are for my release and quiver. Worked great! For my Diamond 320 great.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian G.",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Terrific for the price",
      "text": "Very happy with the case! Super protective, holds my compound bow, quiver with arrows and some other trinkets without any issue. I like that it has two openings to close the case with a lock. My only comment is that I wish both sides were padded, not just one. However, the side that is not padded does come with some holders were the quiver can be placed so",
      "rating": 5.0,
      "verified": true,
      "author": "SilentBob890",
      "helpful_votes": 0,
      "publication_date": 20170317
    },
    {
      "title": "Exactly what I needed.",
      "text": "Bought this case to protect my bow. It holds the bow, arrows, and extra pieces. It makes transporting my bow much easier and it keeps my bow safe. The case is sturdy but not too heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon L Williams",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "came with great instructions/hardware/foam padding/straps/screw in rack for 6 arrows",
      "text": "My Bowtech Equalizer fit with room to spare; came with great instructions/hardware/foam padding/straps/screw in rack for 6 arrows.It went together in minuets.The case locks securely & firmly for easy transport; it opens & closes without any fuss. Other small items can be stored beneath the foam pad. Shipment was very fast to my front door. I wanted a bow case to protect & transport to my local shooting range; I don't know how this would do for air travel. For my needs this is perfect and a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Toriumi",
      "helpful_votes": 0,
      "publication_date": 20160228
    },
    {
      "title": "I received a returned item that is missing parts!",
      "text": "Case is ok for the price. I received a returned item that is missing all of the interior parts. No straps, No arrow holder, no paperwork. I know it was retuned because the box had an old shipping label that had been stripped off. The Plano tag had been removed and was in the case, and the box had been poorly resealed with tape",
      "rating": 1.0,
      "verified": true,
      "author": "Mark H",
      "helpful_votes": 2,
      "publication_date": 20180322
    },
    {
      "title": "Perfect all around!!!!",
      "text": "Received this case and it’s perfect!! It doesn’t break the bank and secures my bow and arrows and plenty of room for extras. I can fit my bow, stabilizer, 4 arrow quiver, release and still much more room for anything else. And has the ability to lock to top it off!! Very satisfied would recommend to anyone and would buy again!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tomi",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Big for a NASP Genesis Original bow, which isn't altogether bad",
      "text": "Big for a NASP bow (Genesis original), so it's more space on the school bus and when stored. Most NASP kids opt for a, but this one has a MUCH BETTER PRICE POINT. It gives my archer more room for award stickers and a place to stow a coat or sweatshoot when at the practice range.",
      "rating": 4.0,
      "verified": true,
      "author": "Adrienne Jones",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "I don't know if I'd want to take it on an airlines but it does a great job of protecting my bow in the back of ...",
      "text": "Seems flimsy when you unpack it but does the job well. I don't know if I'd want to take it on an airlines but it does a great job of protecting my bow in the back of the truck and has plenty of room for a broad head box, releases and extra arrows, for the price a great bow case.",
      "rating": 4.0,
      "verified": true,
      "author": "Ebookit",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Great bow case...",
      "text": "Great case and cheapest price compared to any retailer other than eBay. Easy to assemble and holds bow in place with lots of room.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Great bow case,  a deffinite keeper!",
      "text": "This case has a hard shell, The inside has a soft mesh.to protect your bow. It won’t scratch the surfaces of the areas you store it! I own a diamond Edge Sb-1 compound bow and it fits like a charm! On a side note you look awesome walking around with this thing! I guarantee your bow won’t fall out and be damaged!",
      "rating": 5.0,
      "verified": true,
      "author": "Jayson G.",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "always uses protection..for your bow.",
      "text": "not a bad option for protecting your bow. I would not use this for transport on an airplane. but for storage and taking it to and from behind or the range I think this is an affordable option. Some things to consider; the plastic is not very thick, limited interior storage(6 arrows), the arrow holder installation the obvious is a little cumbersome, the lashing system could use improvement, and bow placement is a little tight with my limb driven arrow rest. I have a pse prophecy.",
      "rating": 4.0,
      "verified": true,
      "author": "GenericJoe",
      "helpful_votes": 0,
      "publication_date": 20150712
    },
    {
      "title": "A lack of latches...",
      "text": "My bow fits in the case, and it holds my arrows nicely. The only gripe i have with it is that it came with one less latch and it makes carrying the damn feel awkward. I’d return but i got boot camp within two weeks from now and i cannot be bothered to asked the seller (who from what i’ve heard doesn’t respond fast or ever) for a replacement.",
      "rating": 3.0,
      "verified": true,
      "author": "Xavier Hernandez",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "perfect for my compound bow",
      "text": "this case is perfect for my compound bow and arrows. it has a holder of the arrow and protects your bow when traveling. Ive been overseas with this case and it holds up fine! great price too!",
      "rating": 5.0,
      "verified": true,
      "author": "Chaka",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Great case at an awesome price!",
      "text": "Brought this case out bowhunting this year and it held up just find. Keeps the bow in place without moving, holds all my arrows, and has plenty of room for other accessories to fit in. My stabilizer doesn't fit while on the bow, so I have to remove it which is not a big deal. I have a 9'' trophy ridge on my PSE bow. Definitely a great case at a super reasonable price!",
      "rating": 5.0,
      "verified": true,
      "author": "Bill BTop Contributor: Golf",
      "helpful_votes": 0,
      "publication_date": 20161116
    },
    {
      "title": "Perfect budget case",
      "text": "Great budget bow case! It's not the fanciest or sturdiest case, but it is perfect for those that want something simple to store the bow in and for general transportation that it's not going to get thrown around in. The straps hold the bow nicely in place and really doesn't let it move around all that much.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Awesome Case For Your Bow",
      "text": "This is honestly a nice case to have, especially for the price! Not only was the set up quick and easy, the case itself is the perfect size and fits my bow, bow quiver, and 6 arrows. You can even put up to 2 locks to secure it better. Definitely a great buy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. FountainTop Contributor: DC Comics",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Good case",
      "text": "The initial case came without straps or the arrows clips but amazon was great about returning and replacing the case. The second case seems great. My husband has the same case and although it’s big and bulky, it seems to be very protective.",
      "rating": 4.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Good compound bow case for future hunting trips",
      "text": "Worked well for both compound bows I purchased. My first was a 70lb draw, no name, and made in China Bow. The second bow was my Bear Approach HC. Great foam protection and arrow holder works well. Seems to be really tough and sturdy, better than expected quality of plastic at this price level.",
      "rating": 5.0,
      "verified": true,
      "author": "james",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Hard to install nuts on the arrow holder...",
      "text": "This bow case does what it needs to do. Hold my diamond infinite edge in place along with all the tools and arrows that i use for my bow. The only problem i have with this case is the bow needed to mount the arrow holder in place. The tool used to place those bolt in place is really short and hard to use. I have to hammer them into the slow. The manual is really dark, the picture in the description has such low definition that you don't know what your looking at. But the installation is really easy. It shouldn't be a problem if you use a little brain power...",
      "rating": 4.0,
      "verified": true,
      "author": "Skyo",
      "helpful_votes": 0,
      "publication_date": 20141022
    },
    {
      "title": "Great product",
      "text": "Great product. Bigger than I thought. Has three velcro straps to secure the bow, and slots for 6 arrows to be secured. Great product, seems durable. Four stars instead of five because the box was practically open and falling apart when it arrived.",
      "rating": 4.0,
      "verified": true,
      "author": "Brianna Roe",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "You get what you pay for.",
      "text": "Bought this for the back of my can am x3. It fits good but very thin plastic and doesn't match very well. Doubt it would survive the desert sun. I recommend the se44 box. Fit is tight but looks much better. Too bad its going to cost more than 1/2 the price ro ship it back. Prime my @$$..",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Great case for a decent price",
      "text": "Can beat this one for the price. Got a really good deal and this case is all that it describes itself to be. Easy to put together the few small things that you need to assembled upon receiving the case. Fits my box nicely and has the space for 6 arrows. Gonna add some velcro to the sides to attach some small containers to for my miscellaneous items as there is plenty of room in the case for additional things to be added. Could not be happier with this buy.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Stuhr",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Dont buy an overpriced case, buy this one!",
      "text": "Dont spend hundreds on an overpriced case, this one is solid and does the job for only $50! It is easy to fit to your bow, with room for extra items like your realease and wax and such. I wish it had a pocket, but I just put my wax and tools in a ziplock in the corner of the case and it stays put. Straps are good quality and hold the bow in place, I dropped it and nithing came loose. Has a spot for 6 arrows, so I can leave my broadheads on my hunting arrows, but I made a leather cover for them to avoid cuts. I would highly recommend this case.",
      "rating": 5.0,
      "verified": true,
      "author": "robert labonte",
      "helpful_votes": 0,
      "publication_date": 20140507
    },
    {
      "title": "Should Work Great",
      "text": "My son needed this case for transporting his bow back to college via the airlines. The bow fits so this should work just fine. The latches seem to be well made and it has two locations for padlocks, so that will be nice to secure the contents. The price was great.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Fits Genesis original",
      "text": "Got this hardshell case for my daughter's Genesis Original bow to her school archery program. It fits PERFECTLY. It's locking mechanisms work perfect. Has a foam insert to protect. Great item!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica L.",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Good deal for the price BUT,",
      "text": "Good deal for the price. All the pictures shown are a bit misleading with the quiver mounted on the bow full of arrows and the arrow holders on the lid full as well. That just would never be possible no matter how small your bow is. I have a smaller Hoyt Klash and it’s pretty tight with my 8” stabilizer. Definitely have to remove my quiver to be able to close.",
      "rating": 3.0,
      "verified": true,
      "author": "Leah Hodge",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Sturdy, secure compound case.",
      "text": "Very nice case. Fits my son's Bear Cruzer Lite with a lot of room to spare. It will definitely hold a larger compound when he outgrows his youth bow. Would be nice if it had some way to secure accessories (release, stabilizer, etc...), although it does have space for 6 arrows in the lid.",
      "rating": 4.0,
      "verified": true,
      "author": "Neuro doc",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Great Case for the Mission Craze and Others!",
      "text": "We bought our children Mathew's Mission Craze bows this fall. I purchased one case at a local sporting goods store and then purchased this one online. Save yourself some money and buy it here. I think I saved about $10.00. The case itself is very nice. It has a lot of cushion and space for extras. It is large, but it's always nice to have more room than too little room. Plus, the case is hard and prevents your expensive bow from getting damaged.",
      "rating": 5.0,
      "verified": true,
      "author": "UPNorthMom",
      "helpful_votes": 0,
      "publication_date": 20151222
    },
    {
      "title": "Perfect for a beginner and a great price!",
      "text": "I bought this for myself and my son. These are very sturdy and a really great price, although it is not waterproof, but that is not a problem for us. It is symmetrical and there is foam on the inside so you choose which side is top and bottom. It was very easy to install the velcro straps and quiver. Just a little tip, if your bow has a quiver attached to it, you will have to set it at an angle because it will get in the way of the \"braces\" and you will not be able to close it.",
      "rating": 5.0,
      "verified": true,
      "author": "Madison",
      "helpful_votes": 0,
      "publication_date": 20150209
    },
    {
      "title": "👎👎👎👎",
      "text": "Not happy at all with the case, in the picture it shows the arrows attached to something and there isnt anything to attach any arrows to! And there's no straps to strap the bow down so everything moves around. If you're looking for a case that you don't care how your bow is treated then this is the one.",
      "rating": 2.0,
      "verified": true,
      "author": "Kenneth J. Buntjer",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "Great case, plenty of room.",
      "text": "We bought this for our sons first youth bow was easy to put together, has plenty of space if we decide to get a larger bowl. Seems made of good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Strong",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Missing Parts",
      "text": "Returned this item as it was missing the straps and hardware. Case was not big enough for our old vintage bow. It is a nice case if all of the parts are there and you have a smaller bow. Since this was bought from Amazon directly, the return was super easy and no hassle.",
      "rating": 3.0,
      "verified": true,
      "author": "John and Gayle",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Decent",
      "text": "Arrived today... on time. Decent case. The material is a little thin but seems ok so far. I wish the arrow storage rack held more arrows than just six. Seems decent though... I like the fact that it can be locked (with your own pad lock).",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Unger",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Perfect",
      "text": "Have several compound bows and need a case for hauling them around. Really good for the price and cheap shipping if ordered through prime. eBay wants to charge an arm and leg for shipping them cause they are so bulky.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig J Eves",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Good basic bow case for the money",
      "text": "A good basic case to carry my sons bow, release and arrows. Provides the basic protection needed to transport from home to practice and tournaments. You will need to be careful attaching the bow string strap. Metal screw into plastic can strip or break the plastic pretty easily if not careful. Attaching the arrow holder requires significant pressure to press the locking washers into place. Initial impression is that it will do fine for what we needed.",
      "rating": 4.0,
      "verified": true,
      "author": "kduit65",
      "helpful_votes": 0,
      "publication_date": 20141219
    },
    {
      "title": "Good Case for the Price. Poor Customer Service and Quality Control.",
      "text": "Good case for the price. I purchased (2) for my children's Genesis bows. One of the (2) cases did not come with any hardware. (Velcro straps to secure the bow or the arrow holder that is affixed to the inside of the case. I called Plano direct, but there phone system is setup primarily for distributors or vendors. I have emailed twice in the past 2 months through their website without any answer. I will update my review and rating if their customer service improves.",
      "rating": 3.0,
      "verified": true,
      "author": "Erik M.",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Can't beat the price",
      "text": "For $30, look no further. My husband has a 2019 Mathews Tactic bow and it reaches the edges on this box though on the inside--any wider and he'd need a bigger box--I have a Bear Prowess and there's plenty of room. Really no need for any case more expensive, this does the job",
      "rating": 5.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Sturdy Case",
      "text": "The case works great hold everything in place. I wish it had some additional holders but it has good construction. Holds my Dimond in place and holds 6 arrows. Don't mind the velcro on my triggers I just didn't want them flying around in the case. 🤷",
      "rating": 4.0,
      "verified": true,
      "author": "Robin Frith",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "She is very happy with it and has had it for 6 months ...",
      "text": "I purchased this for my friend as a Christmas gift to go with her bow she had gotten. She loves it. She got a diamond brand bow, can’t remember the model, and it fits perfectly for her and her set up. She is very happy with it and has had it for 6 months now.",
      "rating": 5.0,
      "verified": true,
      "author": "Amos Gallegos",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Cheaper than BassPro",
      "text": "Solid quality, seems pretty durable. Has optional feature of mounting arrows in case. Amazon was cheaper than BassPro.",
      "rating": 5.0,
      "verified": true,
      "author": "chris christiansen",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Good for the price",
      "text": "It's a good case for the price. A little bit bulky. Has lots of nooks and crannies so it gets water in all sorts of places in the rain. However, the inside has a thick foam insert, so my bow has remained dry so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Knightly Blackness",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Affordable, Great Quality",
      "text": "I bought this for my boyfriend for Christmas. I was a little nervous being as, I know nothing about bows or cases. I was also worried about how affordable it was, sometimes the quality isn’t as good. He loves it and I didn’t break the bank getting it for him! Highly recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Marlana",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Does not fir PSE Carbon Air 34.",
      "text": "Looks good and seems like it would be good protection but it doesnt fit my bow. PSE Carbon Air 34 does not fit. The two pillars that protect the case from being crushed are right in the way and ther is no way to move the bow around to fit. Also my Optimizer King Pin sight is to long for the bow to fit. Maybe if I cut the pillars off it might fit.",
      "rating": 3.0,
      "verified": true,
      "author": "sonorajeep",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "I have been airing mine out in the garage for a week and it still smells horribly. Fits my bear encounter",
      "text": "I am surprised no one has mentioned how disgustingly putrid the smell of the foam is. I have been airing mine out in the garage for a week and it still smells horribly. Fits my bear encounter, but not with my bow mount quiver. I had to buy a separate MTM case. Good price though. I was going to buy a soft case for more money until I saw this. If the foam smell doesn't go away I will have to buy new foam and replace it. It is truly awful.",
      "rating": 3.0,
      "verified": true,
      "author": "Reindeer",
      "helpful_votes": 0,
      "publication_date": 20150228
    },
    {
      "title": "Perfect for compound hunting bow",
      "text": "Works very well for compound bows intended for hunting. Could use a bit more space for bow accessories like a bow wrench and manual trigger. This case is not suitable for travel on an airline. It is just for storage and transport in a car to the archery range.",
      "rating": 4.0,
      "verified": true,
      "author": "L. M. Calif",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Spacious affordable case",
      "text": "Fits my Diamond Edge and quiver. Requires a little setup, but comes with storage for arrows, straps to hold the bow in place, and a foam lining. So far so good!",
      "rating": 5.0,
      "verified": true,
      "author": "bexter91",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Parallel bow? Get a totally square case.",
      "text": "Doesn't fit more square, parallel limb bows very well. I have a prime alloy and it barely fits. I had to pad the front wall because my limb pockets are touching. I also had to modify one of the posts to fit my string stop (Ktech). If you have a parallel it parallel-ish limb bow, get a square case. Even though the specs said it fit my bow's length, the shape is too conventional for lots of modern bows.",
      "rating": 3.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20151212
    },
    {
      "title": "Solid Bow Case",
      "text": "Case is durable and well constructed. All features work and it is perfect for my compound bow.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Good quality",
      "text": "For the price, this is a good quality case. This is probably for the average hunter, who doesn't need to carry a lot with them. There's storage, but not a lot. Secure case!!",
      "rating": 4.0,
      "verified": true,
      "author": "erika geist",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Good Proection But Very Large",
      "text": "The case is well made. The straps retain the bow securely and there is a holder for six arrows. The downside is it is huge compared to a soft case. Of course it offers much more protection and I'll use it sometimes but it is too bulky for normal use.",
      "rating": 3.0,
      "verified": true,
      "author": "R. Bowman",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Good deal, had absolutely no problem installing the arrow ...",
      "text": "Good deal, had absolutely no problem installing the arrow holder even though the tool is a bit cheesey. You could alway use an 8mm socket if you break the tool. Case closes fine and no gapping issue at the handle. My only issue would be the arrow holder itself, it's a bit over sized for smaller carbon arrow shafts. I'll be lining that with some mole skin. Overall, good product at a good price. I just priced this at BP for 40 bux on sale, so no major complaints here.",
      "rating": 4.0,
      "verified": true,
      "author": "xtremejyhk",
      "helpful_votes": 0,
      "publication_date": 20151121
    },
    {
      "title": "junk pos NO LOCKING SYSTEM uNLESS YOU zip TIE IT EVERY time!!!!!!!!!!!!!!!!!!!!",
      "text": "junk pos NO LOCKING SYSTEM uNLESS YOU zip TIE IT EVERY time!!!!!!!!!!!!!!!!!!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Stanley Robinson",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Missing items",
      "text": "The case fits my bow perfectly, however I was missing the straps and clips to be included. I emailed the company twice to see if they could send them to me and never received a response.",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah Godsey",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Missing parts.",
      "text": "The case shipped fast and will get the job done. However, it arrived missing the straps to secure bow and the advertised arrow holder. No biggie, I can make my own straps and arrow holder. It really should arrive as advertised though. Better buy some webbing and foam...",
      "rating": 3.0,
      "verified": true,
      "author": "Mo Gotts",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Great quality product!",
      "text": "Great, lightweight case. Excellent quality. Easy open and close locks. I would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "This is a steal, you can pay about twice ...",
      "text": "This is a steal, you can pay about twice this is the store for the same brand. I don't mind the minimal assembly required if it means that money can stay in my wallet. Holds bow secure, string secure, and 6 arrows no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Mondoness",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Bought this for my wife's new archery hobby",
      "text": "We decided to buy this case for my wife's bow and equipment before we moved to another state. She recently had her bow finished and wanted to protected during the trip. I recently saw this case at a retailer for $30 more than Amazon. This is a great buy and serves its purpose well. I feel this will last a long time although it seems flimsy when not latched. I guess that's how they keep prices competitive while also engineering it to last. Overall I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20130720
    },
    {
      "title": "not so good as a case.",
      "text": "It looks cheap. It feels cheap. Its heavy. It's difficult to close because it flexes. It's difficult to open because of the way that flex interacts with the handle clasp. I don't know how long the hinges will last; I know hinges hate being twisted, and this thing flexes and twists like a drunken tornado. It requires assembly, which is OK and easy enough. It seem strong enough when closed and would probably survive an airport.",
      "rating": 2.0,
      "verified": true,
      "author": "Seth",
      "helpful_votes": 0,
      "publication_date": 20141004
    },
    {
      "title": "It works.",
      "text": "It only comes with one set of inner straps, so you can lock down your bow, but your quiver is danging loose in there and you have to figure out a solution for it. It is pretty bulky for my BowTech Core, but at least I know its well protected and has room for miscellaneous items. Ideal for protection during transport inside a vehicle, but not for taking into the field or throwing in the back of your truck if its raining. Dry conditions is OK and sturdy enough for it.",
      "rating": 3.0,
      "verified": true,
      "author": "Allen S",
      "helpful_votes": 0,
      "publication_date": 20150219
    },
    {
      "title": "For the money, and for local use, this does a good job.",
      "text": "Not recommended for most airline travel, although it will work.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200410
    }
  ],
  "product_meta": {
    "title": "Plano Protector Compact Bow Case (Black)",
    "description": "Lockable and airline approved, the Plano PillarLock Compact Bow Case features a thick wall construction and patented PillarLock system for protection. The Protector contains high-density foam and holds parallel limb bows. It also features extra arrow storage under the lid.",
    "rating": 4.6,
    "feature_bullets": [
      "Plano Molding | Protecting your passion since 1952",
      "Lockable and airline approved bowcase",
      "Patented PillarLock system for protection | High density foam",
      "Arrow storage under the lid | Holds parallel limb bows",
      "Dimensions: 43.25 inches x 19 inches x 6.75 inches | Made in the USA"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "6.75 x 43.25 x 19 inches; 0.8 Ounces",
      "Item model number": "111000",
      "Department": "Unisex-adult",
      "Date First Available": "June 8, 2005",
      "Manufacturer": "Plano",
      "ASIN": "B000P40UJC",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Archery",
      "Bow Cases",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Hunting & Fishing"
    ],
    "price": ""
  }
}