{
  "website_summaries": [
    {
      "verdict": "Its $200-plus price tag might surprise you, but Wacom's new Intuos3 Tablet makes it easy for anyone to draw or write accurately on a computer.",
      "pros": [
        "Digital pen has 1,024 levels of pressure sensitivity",
        "easy and intuitive to use",
        "customizable buttons"
      ],
      "cons": [
        "Expensive",
        "the small 4x5 model doesn't have a large enough work space for the mouse"
      ],
      "aspects": {},
      "publication_date": 20041108,
      "rating": 8.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good purchase",
      "text": "I am so happy with this purchase. I own the big brother of the Intuos 3 line (PTZ-930) and years of use has worn out the pen and mouse. Those who own this model understand how difficult and expensive it is to find a pen replacement, new or old. Finding this offer was a blessing. Though there were minor scratches, as expected, the pen and mouse work flawlessly with my tablet and their condition were less worn out than mine. I would have given the purchase 5 stars, however for me, the bite marks on the pen cost the review one star.",
      "rating": 4.0,
      "verified": true,
      "author": "Mickulitz",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Excellent Tool - Perfect Size",
      "text": "Initially I was leaning toward the next step up in size but after reading the reviews, I felt that the smaller one was right for me. ...and it was! I'm not sure why I would need a bigger size. This thing is just perfect for what I do. It really didn't take much getting used to. At first, I was holding my hand away from the pad because I thought it was similar to a laptop touchpad (where fingers or anything else cause the cursor to move)...but you can rest your hand on it or whatever feels natural - just like with paper - and only the pen effects the cursor movement. I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Ladfam",
      "helpful_votes": 17,
      "publication_date": 20051013
    },
    {
      "title": "Superb",
      "text": "Excellent product. Despite people's recommendations I prefer this small size for photo retouching, I find with the larger tablets my arm was touching the tablet and getting in the way - this is perfect works flawlessly right out of the box with my Powerbook on two monitors, easy to configure. For anyone thinking about this or the cheaper graphire product (which I also own), the Intuos3 is so far advanced and sensitive compared to the Graphire its amazing. The graphire has about 1/2 of the pressure points this has, this is so much better its amazing. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "rhodyfresh",
      "helpful_votes": 5,
      "publication_date": 20060811
    },
    {
      "title": "Wonderful graphics tablet at an irresistible price!!!!",
      "text": "It may be an older model Wacom tablet, but I snagged it for a nice, low price & it comes with a wireless mouse as well as a stylus. I wouldn't have been able to afford one of these babies when they were first released, so it's nice to see how low the purchase price has fallen since then. I'd recommend this tablet to anyone who is on a budget and wants a great tablet, stylus, and a wireless mouse at no extra charge.",
      "rating": 5.0,
      "verified": true,
      "author": "AParkRTop Contributor: DC Comics",
      "helpful_votes": 0,
      "publication_date": 20141109
    },
    {
      "title": "A must tool for PhotoShop users.",
      "text": "Do a lot of PhotoShop work and always wanted one of these. The pen works great for real small delicate work with more control than the mouse. Piece of cake to set up...no issues there. Works great. One thing needs to be plug in directly to the computer not a hub.....not enough power through a hub.",
      "rating": 5.0,
      "verified": true,
      "author": "Pixelman",
      "helpful_votes": 0,
      "publication_date": 20150317
    },
    {
      "title": "Not even a year!",
      "text": "I purchased this almost exactly a year ago and it suddenly stopped working, it was extremely random. I was drawing when the tablet immediately stopped responding to my pen. I did the usual - restarted, changed USB, reinstalled driver, replaced the nib, but it turns out my tablet only responded to anywhere other than the center of the drawing area and now after trying to fix the problem, none of it works. My guess is the sensors died. Considering my Wacom Ruby lasted me 11 years, this is junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160210
    },
    {
      "title": "If You Like To Draw, Sketch, or Paint",
      "text": "I purchased this for my daughter, who is an aspiring Manga artist and she has nothing but good things to say about it. It's size, weight, and functionality seems spot on for what she whats to accomplish; honestly, I have yet hear her complain about this in any way, unlike her Bamboo, for she had a love/hate relationship with.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Benjamin Roy",
      "helpful_votes": 0,
      "publication_date": 20140716
    },
    {
      "title": "The best one I've ever had",
      "text": "The best one I've ever had. I don't go for their gigantic, expensive ones. But this replaced the Bamboo. As a graphic Designer it's indispensable.",
      "rating": 5.0,
      "verified": true,
      "author": "DeekVon",
      "helpful_votes": 0,
      "publication_date": 20160301
    },
    {
      "title": "Excellent",
      "text": "Rugged and dependable, works every time even after getting knocked around in a laptop bag. Never had a problem with it at all. Simple installation with no issues running under WIN 8 or WIN 8.1.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Sacerdote",
      "helpful_votes": 0,
      "publication_date": 20141218
    },
    {
      "title": "The little engine that could!!!!!",
      "text": "I bought this years ago from Amazon as a gift for my very talented father in-law, He has been using it daily ever since and it has performed without hickup in Corel painter and Photoshop thank you Wacom & thank you Amazon",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "awesome",
      "text": "i just received my tablet today and i couldn't be happier. it took me about 10 mintues to get used to the pen but after that...no problem at all. i am a graphic/web designer and digital artist and this is perfect for me. i was a little worried about the size but its perfect since it adjusts to the size of my screen. great product!",
      "rating": 5.0,
      "verified": true,
      "author": "avid reader",
      "helpful_votes": 10,
      "publication_date": 20051007
    },
    {
      "title": "SWEET",
      "text": "Very nice. Might sound small but I've been able to make really good use of it for line drawing, diagrams, demos and photographic toughups in photoshop. Included Waacom software for windows is pretty good too.",
      "rating": 5.0,
      "verified": true,
      "author": "Cory J. Trese",
      "helpful_votes": 0,
      "publication_date": 20070331
    },
    {
      "title": "If you use photoshop you need this!",
      "text": "Bought the largest one 5 years ago. It was way to much territory to use. This is a perfect size for my retouching.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Green",
      "helpful_votes": 0,
      "publication_date": 20140909
    },
    {
      "title": "Too Old and No Driver Support from Wacom",
      "text": "This is a Wacom, so it is made well. Problem is they have discontinued driver support for their older tablets, and Windows will eventually not be able to update driver and will no longer recognize device. Get a newer one even though it costs a bit more, and you'll be much happier in the long run.",
      "rating": 3.0,
      "verified": true,
      "author": "Morgaine",
      "helpful_votes": 4,
      "publication_date": 20131122
    },
    {
      "title": "wacom tablet",
      "text": "I am very pleased with my intuos 3 tablet. The only problem I have is the touchnstrip,I cannot program some of the touch pads as I would like other than that it works very well,much better than a mouse. This is the only way to work in Photoshop or PSP X.I have the 4x5 and thought I made a mistake in not getting the larger tablet but after working with the 4x5 I think its better for me than the larger tablets.",
      "rating": 5.0,
      "verified": true,
      "author": "BUG",
      "helpful_votes": 3,
      "publication_date": 20061103
    },
    {
      "title": "Real nice",
      "text": "Took me a little time getting used to the pen as an input device but works great. Nice to have the option of using the mouse with the tablet too.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20060825
    },
    {
      "title": "DRIVERS & BUNDLED SOFTWARE WON'T RUN ON MAC 10X!!!!!",
      "text": "The drivers & bundled software will not run on my Mac 10.7.5 operating system as PowerPC apps are no longer supported! THIS INFO NEEDS TO BE LISTED IN THE ITEM DESCRIPTION!!!!!!!!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "chrisl",
      "helpful_votes": 4,
      "publication_date": 20131116
    },
    {
      "title": "Outdated and unusable",
      "text": "I bought this without researching it because Amazon spammed me (I had been looking at other Wacom tablets for my daughter). It was so old, so outdated, we couldn't even get our computers to recognize it. I didn't return it. I spent $63. I feel totally burned and sad. Decided to write a review so someone like me WON'T buy this totally useless, out-of-date product. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Adjunct Labor",
      "helpful_votes": 0,
      "publication_date": 20141215
    },
    {
      "title": "Can't go wrong with industry standard!",
      "text": "Always a great choice to go with Wacom! I lost my pen to this exact model and was however able to find a pen out here on Amazon, but, it was nearly the same price to just get the whole set. I have been using this same kit for many years to do simple touch up work in Photoshop. No mouse can accomplish the same precise tasks for me. However, I finally found my original pen, but I'm glad I have two now, one for home AND the office :)",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Green",
      "helpful_votes": 0,
      "publication_date": 20150615
    },
    {
      "title": "Still a great tablet!",
      "text": "I had the larger intuos a year ago loved it. It broke recently and I went through a string of off brand tablets like monoprice and huion but the drivers for those tablets were always so un-stable. to make a long story short I decided to buy an intous 3 again since I like the build of the older wacoms better than the nib eating newer models. allot of people are having trouble with the driver for this model. Just download the driver for the intuos pro, works like a charm! here's the link:[...]",
      "rating": 4.0,
      "verified": false,
      "author": "hryder77",
      "helpful_votes": 2,
      "publication_date": 20140329
    },
    {
      "title": "Awesome!",
      "text": "I owned the Intous2 Platinum 6x8 tablet first and didn't use it much because I have a small work area but it is great. Now I own this Intous3 4x5 tablet and it actually got better. The touch strip and keys are much better and the different pen nibs are great. I thought it may be too small but its not. I draw and paint with it & it works out well. If I had the space, I'd get the bigger ones but since I really don't have any complaints. Bigger would be nice but its definitely not needed.",
      "rating": 5.0,
      "verified": false,
      "author": "LiLex",
      "helpful_votes": 70,
      "publication_date": 20041021
    },
    {
      "title": "Improves On Intuos 2, but...",
      "text": "I bought a wide aspect ratio LCD monitor so that I could have more room to work when doing digital painting, and getting the 4:3 aspect ratio of the tablet to map to the screen makes the vertical tracking seem like it's dragging. I had to resize the tablet mapping area to something around 3x5 inches to make it feel more natural. The obvious drawback is that there is a much smaller workable area on the tablet surface.",
      "rating": 5.0,
      "verified": false,
      "author": "Minh A. Do",
      "helpful_votes": 3,
      "publication_date": 20050826
    },
    {
      "title": "LOVE IT!!",
      "text": "This co. makes the best tablets on earth, they play happily with multiple software & hardware devises. Plug in play is supreme after you install the driver you can plug the usb... I am always transferring my tablet from desk top to lap top as easy as you move a lamp to another room. If you are new to tablets and wondering about them..go for it, after a short time to get used to it it will feel as natural as a pencil in your hand on paper!",
      "rating": 5.0,
      "verified": false,
      "author": "K. Freitas",
      "helpful_votes": 4,
      "publication_date": 20050920
    },
    {
      "title": "Works well",
      "text": "Works as promised and 4x5 is plenty of editing space. The stylus is extremely helpful for photo retouching. My only complaint is that the mouse does not always respond in a predictable way.",
      "rating": 4.0,
      "verified": false,
      "author": "KB",
      "helpful_votes": 5,
      "publication_date": 20060223
    },
    {
      "title": "Pretty great experience",
      "text": "I bought this to help combat my repetitive stress problems using regular mice of all sorts. I am not using it for the complex graphics/design purposes it is best suited to - just as a mouse replacement. That said, I think it's great. It took about a week to get used to the completely new interface, but it works very well and I can switch hands as needed during the day to avoid repetitive stress. The stylus can be held in a variety of hand positions as well, to further mix things up.",
      "rating": 4.0,
      "verified": false,
      "author": "ProgGrrl",
      "helpful_votes": 6,
      "publication_date": 20060903
    },
    {
      "title": "More a Question than a review",
      "text": "I too am a left handed designer. Here is my problem. When I write or draw, my paper is at a 45 degree angle. Meaning that that page is flat on the surface, but I tilt it almost sideways so the lines are diagonal to write or draw. The previous pads I had could not accommodate this and working with then was beyond frustrating. Does this new tablet function if it is placed at a diagonal slant? Thank you.",
      "rating": 3.0,
      "verified": false,
      "author": "Kimberly",
      "helpful_votes": 0,
      "publication_date": 20110629
    },
    {
      "title": "Wacom Intuos3 4x5 Pen Tablet",
      "text": "The product works great! I have been using it for about a month now and have had no trouble getting the hang of it. The pressure sensitivity is much better than the graphire tablet. I would recommend this tablet to anyone.",
      "rating": 5.0,
      "verified": false,
      "author": "John Priess",
      "helpful_votes": 0,
      "publication_date": 20070725
    },
    {
      "title": "Amazingly Awesome!",
      "text": "I love this thing so much! Honestly, if you do any kind of art you want this its so much easier. It takes like 5minutes to get used to but once your used to it its like drawing on paper. GREAT BUY! and the size is jsut right i dont know why youd need one any bigger!",
      "rating": 5.0,
      "verified": false,
      "author": "Floridan H. Hayes",
      "helpful_votes": 3,
      "publication_date": 20070115
    },
    {
      "title": "wacom tablet",
      "text": "i love love love the wacom tablet. it saves the day as far as deadlines go when it comes to my photoshop projects.",
      "rating": 5.0,
      "verified": false,
      "author": "M. Hughes",
      "helpful_votes": 0,
      "publication_date": 20070321
    },
    {
      "title": "tablet that works",
      "text": "pen and mouse work well. Tablet keys add ease of use to graphics programs.",
      "rating": 5.0,
      "verified": false,
      "author": "susan hanna",
      "helpful_votes": 4,
      "publication_date": 20060129
    },
    {
      "title": "To hard to use and too small",
      "text": "I got a deal on it but it is to hard to use and to small. Get a larger one!",
      "rating": 1.0,
      "verified": false,
      "author": "sugar Woods",
      "helpful_votes": 0,
      "publication_date": 20080227
    }
  ],
  "product_meta": {
    "title": "Wacom Intuos3 4x5 Pen Tablet, PTZ430",
    "description": "The Intuos3 tablet is perfect for photographers, designers, artists, illustrators, digital camera owners, high school and higher-education students. The patented, pressure-sensitive pen and hassle-free ambidextrous mouse (with no ball or optical parts) are both cordless and battery-free. The included, valuable software bundle (worth about $200) makes Intuos3 an exceptional value.",
    "rating": 3.5,
    "feature_bullets": [
      "Pen tablet with USB connection",
      "1024 levels of pressure sensitivity",
      "Customizable menu shortcut buttons",
      "Thick, durable overlay",
      "Limited Lifetime warranty"
    ],
    "specifications": {
      "Product Dimensions": "12.9 x 10.3 x 2.7 inches",
      "Item Weight": "2.75 pounds",
      "ASIN": "B0003009BC",
      "Item model number": "PTZ430",
      "Customer Reviews": "3.5 out of 5 stars54 ratings3.5 out of 5 stars",
      "Best Sellers Rank": "#2,313 in Computer Graphics Tablets",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 2, 2004",
      "Manufacturer": "WACOM",
      "Language:": "English"
    },
    "categories": [
      "Computers & Accessories",
      "Graphics Tablets",
      "Computer Accessories & Peripherals",
      "Input Devices",
      "Electronics"
    ],
    "price": ""
  }
}