{
  "website_summaries": [
    {
      "verdict": "Though they're on the pricier side, these ramps are well constructed and sturdy.",
      "pros": [
        "These lightweight aluminum ramps are long enough to provide a gentle incline, and the width can accommodate most ATV or lawn mower tires",
        "Each ramp measures 89 inches long and 11.3 inches wide",
        "When folded, each ramp measures 45.12 inches long by 11.3 inches wide by 6.25 inches high",
        "29 pounds altogether, with a max capacity of 1,500 pounds between both ramps"
      ],
      "cons": [
        "The arch is minimal, so these ramps may flex under heavier loads"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "VERY NICE! DO THE JOB PERFECTLY!",
      "text": "I have used these once. They worked very well getting my 4wheeler, that has less than 7\" of ground clearance, into my 4x4 truck that has a tailgate height of 36\". They felt sturdy. Stayed in place with the supplied straps even if the straps do feel a bit cheap. The ramps themselves DO NOT feel or look cheaply made. They feel very sturdy and VERY light. I would buy them again if I needed another set.",
      "rating": 5.0,
      "verified": true,
      "author": "Ted K.",
      "helpful_votes": 13,
      "publication_date": 20171122
    },
    {
      "title": "Great ramps for my truck",
      "text": "I have seen quite a bit of welding in 50 years as a process engineer. The welds are these ramps were fine...well formed and suitable for purpose. In addition the manufacturer listened to reviewers and includes a great set of straps (USA made) with note to discard the original straps (still included) and not to use. Excellent buy. I loaded my 350 pound snow blower w/o any problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Chemical Engineer",
      "helpful_votes": 7,
      "publication_date": 20180814
    },
    {
      "title": "Excellent!",
      "text": "These ramps are a great buy at a reasonable price. Very heavy duty. They offer excellent traction and come with several sets of straps (with a note inside to discard the red straps that are included and to use the heavy duty black straps that were also in the box). I would recommend these to anyone looking for a foldable, lightweight set of ramps.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Austin",
      "helpful_votes": 6,
      "publication_date": 20180916
    },
    {
      "title": "Great ramps",
      "text": "I would consider these ramps one of the best purchases I have ever made from Amazon. They are so high quality I was actually surprised when I opened the package. The amount of aluminum on the ramps alone makes them worth the cost. All of the welds are very well done. They are light enough to carry both at once. I am using them right now to load my snowblower onto my truck. The blower has small tires and it has no problem getting up and down the ramps. I plan to use it for my small Honda lawnmower as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin J. Reulbach",
      "helpful_votes": 15,
      "publication_date": 20150213
    },
    {
      "title": "GREAT ramps, throw out the straps",
      "text": "Light, strong, stable, zero traction problems. These things rock, and for this price, unbelievable. Loaded 500lb bike with 200lb helper chasing it up the ramp, second ramp is a must, so thankfully this is a pair. Large bolts, solid welds, good build quality, excellent design. Lost a star because the straps it comes with are garbage. Why even include them? If you buy this, buy ratchet straps, and use those instead. Probably unsafe to use the included ones, as you can't tighten them enough to hold the ramps in place. Not the ramp's fault, but putting them in is less safe than just a big warning sticker that says \"strap me down\" or something.",
      "rating": 4.0,
      "verified": true,
      "author": "Reerr",
      "helpful_votes": 4,
      "publication_date": 20160322
    },
    {
      "title": "Sturdy and well made.",
      "text": "They are well built and sturdy. These work for putting my polaris 850 into the back of my 3/4 ton pickup. Comes with upgraded straps. Update: after more than a year, these ramps are still great! I got stuck in deep mud with my 3/4 ton gmc pickup, and used these ramps to climb out of the 2 foot ruts. These held up to a 9k lb pickup and still fold and unfold straight. I can't get over the strength of these ramps. If I were to buy again, I would buy them about 2 feet longer, but these work just fine for putting a 4 wheeler or snowblower into the back of a pickup.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan K",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Worth the Price!",
      "text": "I needed something simple to get my riding mower up on my pick up truck. This did the trick up until the front of the mover crossed the top. It doesn't have high enough of an arc to get the blade deck up and over, but at least I could get off the mower and push it up and onto the truck bed. For the price compared to others, this was a nice investment. Very light and very easy to fold up and store away.",
      "rating": 5.0,
      "verified": true,
      "author": "jpseagull",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Great for loading ATV",
      "text": "These are perfect for loading my Honda Rancher 420 into my GMC Sierra. They are plenty strong to handle the weight. I think the straps are perfect. They hold tight if you feed the strap through correctly. Other reviewers must have fed the strap the wrong way. I also use the straps to tie the ramps in their folded position for storage. The ramps fit perfect on the atv rack or behind the atv when it is in the bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonah Phillips",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "USE THE STRAPS!!",
      "text": "I was a little concerned about the hinge in the middle. After using these a few times I'm very happy with them. They are small enough, when closed to fit in the back seat of my truck. I suggest using the straps, as they do flex and move a little bit with loading and unloading. So far so good! Really like the fact that I can park my truck and store these in the cab, gives me a little peace of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Good Product",
      "text": "Good quality for the price. Made in china but they are fairly nice. I use them to load a 700 lb atv into my pickup, which fully loaded with me on it weighs at least 950 lbs, and these ramps do the job just fine. The straps seem fine to me, they do a good job of holding the ramps to the truck so they dont kick out. Would recommend these for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "grandamage",
      "helpful_votes": 2,
      "publication_date": 20170519
    },
    {
      "title": "Buyer Beware",
      "text": "They are flimsy, hard to unfold, and scary to try to use. Then the return is a nightmare. You get Amazon credit. Not your money back to go buy somewhere else where you can see the craftsmanship. Amazon obviously knows these are worthless or they'd let you have your money back. Instead they are paid to promote them as a best seller. Buyer beware.",
      "rating": 1.0,
      "verified": true,
      "author": "SL Buckley",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Works great, seems very well made",
      "text": "Happy with this purchase so far. Very well made and love that they fold up for easy hanging on my garage wall. My buddy has ramps and his don't fold making it awkward to store. Have only used once so far to load an aerator in my Tundra and it worked perfectly, so much easier and safer than lifting something so heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "JMSamler",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Nice light ramps",
      "text": "Nice light ramps, only used them a few times but they work great. Long enough so the loading angle isn’t too steep loading into my 2500HD. The only negative so far is that they are a little narrow for my Polaris Sportsman xp 1000 tires, but as long as you’re perfectly centered you won’t have any problems",
      "rating": 4.0,
      "verified": true,
      "author": "Lawrence Griess",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Affordable and does the job",
      "text": "Needed an affordable set of ramps to load my King Quad into my truck. I own an F250 and the tail gate sits pretty high. I've used these ramps about a dozen times now and they work great. Some people haven't been happy with the straps but I'm still using the ones it came with and haven't had any issues with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "These are fantastic ramps for so many reasons",
      "text": "These are fantastic ramps for so many reasons. The lightweight construction makes them easy to maneuver and set up, and the folding capabilities allow them to store easily. I have used these several times to transport my riding lawnmower in the back of my pickup truck. The only negative thing I have to say about this product is the straps that come with this don't allow you to ratchet down the ramps to your hitch like a regular set of ratchet straps do. I just replaced them with a cheap set of ratchet straps and now this product works like a charm!",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle M.",
      "helpful_votes": 0,
      "publication_date": 20161005
    },
    {
      "title": "BAD CRAFTSMANSHIP, WISH THEY MATCHED EACH OTHER!",
      "text": "Not the best craftsmanship. Welds are junk and not very good. Ramps are bent and don’t follow the contour of each other, they were welded up by someone that was in a hurry. You get what you pay for.",
      "rating": 2.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 2,
      "publication_date": 20171230
    },
    {
      "title": "for the money they are good ramps. you get what you paid for",
      "text": "for the money they are good ramps. you get what you paid for, so it's challenging for me to write this review since it has faults, but for the money it's okay. The spaces between rungs are too far apart, easy to get your foot caught in between when not careful. for weight capacity, they seem at the limit when using a sport bike, i'm not sure i would put a big harley on one of these ramps. it comes with safety straps and amazon shipped them quickly. I use this for my dirt bikes and for that they are fine",
      "rating": 4.0,
      "verified": true,
      "author": "Bubbles-Desmo",
      "helpful_votes": 0,
      "publication_date": 20150605
    },
    {
      "title": "While they are helpful they don't have much of a ...",
      "text": "While they are helpful they don't have much of a curve to them. We needed something to get a mower into a trailer. These seemed to have the most curve. However we still have some trouble getting the mower over the edge of the trailer without the deck catching. They are light wight and fold for storage.",
      "rating": 2.0,
      "verified": true,
      "author": "sharyl",
      "helpful_votes": 2,
      "publication_date": 20170214
    },
    {
      "title": "Great ramp for riding lawnmower",
      "text": "This worked out very well for me. Not as lightweight as I would like but then I'm in my 70's. Easy to set up and remove. The included safety straps a safety feature. All at a great price. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "i",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Women not included",
      "text": "So, I thought the women in the picture come the ramps, as well as maybe the truck, but I was satisfied with just the ramps...I suppose. Kidding of course. The ramps are awesome because I can fold them and lock them in the truck when I go riding. I own a Yamaha Raptor 350 and easily handles me riding it up and down the truck. It also comes with great straps for securing the ramps to the tail of the truck. Well built and I would recommend to others to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Cory K.",
      "helpful_votes": 0,
      "publication_date": 20150527
    },
    {
      "title": "Disappointed in the product",
      "text": "I ordered these ramps for my atv witch I use in Colorado with chains on. The ramps I was sent were not even close to the picture witch has serrated bars unlike the ones I receives are only die cut and very slick and flimsy. I wish there was some way to get the better on I need. Please look into what you get I’m very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "James Richardson",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Sturdy ramps",
      "text": "Very light weight, sturdy, easy to maneuver. I am a beginner atv 4 wheeler learning to load atv in pick-up. I thought it may be easier to load with longer ramps but I was wrong. It's still scary!!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven ",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Good, sturdy ramps...",
      "text": "I purchased these to load a Kawasaki Brute Force 750. They have a nice appearance, with clean welds. They are plenty strong enough...there's hardly any deflection when loading (~900 pounds total with rider). The fact that they fold made them the top choice for me. The included anchor straps work great. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "~Chelle",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Good quality, compact, with straps included",
      "text": "For the versatility these are hard to beat. They're not the strongest but folding in half is a huge plus for a short bed pickup with an ATV in it.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Fisher",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Durable and lightweight",
      "text": "These ramps are working great so far. I was very concerned about finding a set of ramps that would be safe to load and unload my atv. These have proven very durable. My atv weighs about 600 lbs and I am an additional 280 lbs. I have had zero issues using these to load and unload my atv on multiple types of surfaces, in rain and mud, and by myself. They also fold up and fit nicely under the machine for transport.",
      "rating": 5.0,
      "verified": true,
      "author": "xhank",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Unbeatable Quality at a Reasonable Price and Super Fast Shipping! 5 * All The Way!",
      "text": "Excellent ramps, love them! As described and lightweight, easily foldable and load right into my short-bed truck. Quality product and easy on the wallet! I was extremely pleased in the delivery time. I did not pay extra for delivery but they were delivered to my door in less than 48 hours. Would do business with Rage Powersports without a doubt, also sending a few of my truckin' buddies their way: after they checked out the ramps sent to me, my buds can't resist!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Lad",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "Great Product.",
      "text": "This was a great buy. I use them to load My Honda Rancher on the back of my truck. They work great and are sturdy. The only thing I would say is the straps that come with it do not get tight. I changed them out with crank style tie downs. No problem. My truck has a 3 inch lift an the wheeler pulls up there no problem. For the money and there durability, you can't beat it.",
      "rating": 5.0,
      "verified": true,
      "author": "AJC",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "love them",
      "text": "i used to use wood planks to load quads and bikes. these aluminum ramps that fold in half take up way less space to store and are light. fold them in half and hang them on the wall in the garage and they are out of your way. great product",
      "rating": 5.0,
      "verified": true,
      "author": "Rob J.",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Does the job for my lawn tractor",
      "text": "These ramps seem very sturdy, handling my 500lb Pony lawn tractor with ease. The deck does catch a little on it going up, but not too bad. The construction seems sturdy and the straps easily lock in place to prevent backsliding. The little arch helps minimize scraping from the deck, but some mowers still catch on it (the Murray and my Pony are two, A Husqavarna did not catch on it). None of the mowers caught during offloading, maybe it was just the blades in the wrong position. This is a great set of ramps well worth the money in my humble opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob Moses & daughter Tiffany",
      "helpful_votes": 0,
      "publication_date": 20130703
    },
    {
      "title": "Solid ramps",
      "text": "Well built, no sharp aluminum to cut yourself on, lightweight, sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "the best out there",
      "text": "came well packed love the rams lightweight and very strong -- look anywhere else but these rock",
      "rating": 5.0,
      "verified": true,
      "author": "gambler",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Perfect",
      "text": "Great purchase that is easy to store and travel with",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Burnett",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Light weight and sturdy",
      "text": "Light, sturdy, easy to secure and makes loading a breeze.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Serves it's purpose well",
      "text": "Serves it's purpose well, Sturdy & good looking. Fairly priced",
      "rating": 4.0,
      "verified": true,
      "author": "Texana Te",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Love em",
      "text": "Perfect ramps for a taller truck. They are longer and better made than most ramps plus their cheaper than harbor freight",
      "rating": 5.0,
      "verified": true,
      "author": "Scott C.",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "It does what I intended it to do",
      "text": "I got this to load up a john deer tractor on top of a pick up bed. This does the job well, and it is sturdy so the metal ramps don't slide around. The ramps are wide enough too so that the tires do not overhang. I am happy with this purchase and would recommend it to anyone who needs to load heavy machinery onto a trailer/pickup truck.",
      "rating": 5.0,
      "verified": true,
      "author": "Mikesz",
      "helpful_votes": 0,
      "publication_date": 20150929
    },
    {
      "title": "Good Ramps",
      "text": "Folding feature is nice and they’re pretty lightweight. I’ve only rolled small quads up then and they’ve held up well.",
      "rating": 4.0,
      "verified": true,
      "author": "Brandon A Collins",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Lightweight,  sturdy,  maneuverable",
      "text": "Used ramps to load riding lawnmower. The slight arch keeps the mower deck from catching on tailgate.",
      "rating": 5.0,
      "verified": true,
      "author": "dmitch",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Works for me",
      "text": "I bought these to load and unload a small John Deere lawn tractor (462 lbs.) into a storage shed. The shed is on a slight incline, resulting in a 2-foot drop at the loading point. The straps help keep the ramps from moving. They fold in the middle and have a latch and handle, so they're easy to store and carry. After several uses, haven't noticed any bending or warping.",
      "rating": 5.0,
      "verified": true,
      "author": "Alabama Guy",
      "helpful_votes": 0,
      "publication_date": 20130423
    },
    {
      "title": "Lightweight",
      "text": "Exactly what I needed wish I had bought it sooner",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Great ramps",
      "text": "Excellent ramps. Light weight making them easy to handle, transport and store. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "SOMDsailor03",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Good Buy",
      "text": "I purchased these ramps to load an ATV and Lawn Tractor into my RAM 1500 4x4. They appear to be sturdy and well built, They handled the combined weight of my ATV and me (roughly 850 lbs.) no problem. They are light and easy to handle, due to the arch they require a little more space for storage but no big deal. The additional length is great for trucks that sit a little higher. I didn't give them 5 stars because of the welds, they are adequate but complete welds at all joints would have earned 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Black Dog",
      "helpful_votes": 0,
      "publication_date": 20140430
    },
    {
      "title": "Excellent ramps",
      "text": "These are excellent lightweight ramps. I use them to load my Polaris Sportsman 450 that weighs over 700 pounds plus a 15 gallon spot sprayer full of water. They have been holding up great. Would definitely buy again and recommend to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Lane Braun",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Great ramps to load a commercial mower in the back of my truck",
      "text": "Got these ramps to load a 36” walk behind mower in the back of my truck. They worked great. Easy to put in place and secure with the straps. The fact that they fold and are super lightweight makes them easy to store as well. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "cwinter",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "So far so good!!!",
      "text": "So far so good! Used to load King Quad 750 into the back of my truck-some flex on loading, but nothing alarming. Hopefully will stand the test of time with repeated uses. No problem with the straps so far, but have only used the ramps about 10 times.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeeper",
      "helpful_votes": 0,
      "publication_date": 20160816
    },
    {
      "title": "Simply superb",
      "text": "I can't think of anything that hasn't already been said about these ramps by the top reviews, but I felt compelled to concur as to just how perfect they are. Sturdy and safe, lightweight yet strong, and most of all about half the price of other comparable quality ramps. I'm probably more satisfied with this deal/purchase than I've ever been with another.",
      "rating": 5.0,
      "verified": true,
      "author": "Red",
      "helpful_votes": 0,
      "publication_date": 20130809
    },
    {
      "title": "Love Them!",
      "text": "One of the greatest things since sliced bread. I am sorry I did not get a set of these years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "MTK",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Sturdy and lightweight",
      "text": "Excellent ramps! I was a little disappointed bc the description implied they were arched, and they aren’t but they’re sturdy and lightweight for transport.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Folding Aluminum ramps",
      "text": "These ramps are great to have when loading most anything on a pickup bed. They are lightweight and sturdy. The safety strap is an added bonus because the attach to the truck so there is no worry of the ramps slipping. 750 lb each weight capacity.",
      "rating": 5.0,
      "verified": true,
      "author": "K S",
      "helpful_votes": 0,
      "publication_date": 20151116
    },
    {
      "title": "Great ramps for the price",
      "text": "Bought these for a commercial pressure washer I use daily. These ramps are light and easy to setup and collapse. Seems very sturdy but I’m not putting over 200lbs on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Carson",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Great ramps",
      "text": "Worked great loading and unloading lawn tractor and zero turn mower into the bed of my truck. Ramps are very strong and with the straps they are very sturdy as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Boat lift ramps vs. Tractor usage",
      "text": "I use the ramps for taking out docks and boat lifts in Wisconsin. They work great. The extra lengths are welcomed and they seem to be quite well made with good welding. The docks, and especially the large boat lifts, are way heavier than a lawn tractor but the ramps handle both without a problem. Frankly, I would advertise them to also handle docks and lifts in addition to small tractors. For the money, they are a bargain. .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161009
    },
    {
      "title": "Excellent, light, awesome high quality and easy to use ATV ramps.",
      "text": "These ATV Ramps are very high quality, good and clean looking aluminum welds, use the attached security strap locked onto your hitch, and then you go nice and easy. Get these, tremendous value for the money. Keep straps on ramps when folded and secure them for later use, so you don't have to take them on/off each time. Highly recommended, easy folds underneath my atv when loaded on the back of my pickup.",
      "rating": 5.0,
      "verified": true,
      "author": "Montanawoodsman",
      "helpful_votes": 24,
      "publication_date": 20110622
    },
    {
      "title": "Should be a little wider, sturdy",
      "text": "Strap is difficult to get tight enough Seem sturdy, could be a touch wider",
      "rating": 4.0,
      "verified": true,
      "author": "Doug",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Works like it should",
      "text": "Feels sturdy and it is well made. Folds in half and fits in my cars back seat.",
      "rating": 5.0,
      "verified": true,
      "author": "96 warrior",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Perfect for my sno-blowers getting them in the bed of ...",
      "text": "Strong, durable and lightweight. Perfect for my sno-blowers getting them in the bed of my truck",
      "rating": 5.0,
      "verified": true,
      "author": "George DuMont",
      "helpful_votes": 0,
      "publication_date": 20170118
    },
    {
      "title": "Exactly what I needed",
      "text": "These are exactly what I was looking for, in compact form. I also loved to find out this is a small business I was supporting. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Great ramps",
      "text": "Great ramps, lightweight and easy to store away. Seem very sturdy as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris S.",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Quality product for a good price!",
      "text": "This does the job! Product is as described. Nice and lightweight. Easily folded for storage beside or under the ATV in the bed of truck. Sturdy and easily handles weight of the ATV. Great product for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Barb Webb",
      "helpful_votes": 0,
      "publication_date": 20150515
    },
    {
      "title": "Love it!",
      "text": "We love this! It works perfectly and is stable. I love that you can secure it to your truck so that it can't slip. We've used this multiple times in the last two months moving our four wheeler around and do not regret getting this one at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Grubbybao",
      "helpful_votes": 0,
      "publication_date": 20140814
    },
    {
      "title": "Works awesome and not even close to straining",
      "text": "Use these to load a 550 Polaris 4x4 ATV. Works awesome and not even close to straining. Folding option is great for storage and loading in the truck under the four wheeler. Safety straps are quick and convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas S.",
      "helpful_votes": 0,
      "publication_date": 20151026
    },
    {
      "title": "Light weight and very strong.",
      "text": "Works great for my six wheel ATV. Gloss up nice",
      "rating": 5.0,
      "verified": true,
      "author": "Chef Patrick",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Works great. I use it to transport a 48\" John ...",
      "text": "Works great. I use it to transport a 48\" John Deere Stander. Between the mower and I we are within a couple hundred pounds of the ramp limits and they have held up no problem. They are very light as well. Now if only my wheel wells were another 2\" further apart...",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20140902
    },
    {
      "title": "Workmanship???",
      "text": "The welding on the ramps are terrible, all cross bars are just tack welded. Welded together without making sure they are straight. A PROFESSIONAL JOB WAS NOT DONE WHEN PUTTING THEM TOGETHER. Definitely not worth the price for the end product.",
      "rating": 2.0,
      "verified": true,
      "author": "Nancy Rose",
      "helpful_votes": 3,
      "publication_date": 20140114
    },
    {
      "title": "For aluminum great.",
      "text": "Walking up the single ramp l noticed a lot of flex. A 300# man on a 750# ramp.For the price is a concibera purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Filthy",
      "text": "One of the ramps is welded together crooked. Both sections. Works in a pinch. Would not buy them again.",
      "rating": 1.0,
      "verified": true,
      "author": "DoubleLungBandit",
      "helpful_votes": 3,
      "publication_date": 20150222
    },
    {
      "title": "Great",
      "text": "Perfect for my 2 wheeled motor vehicles, to put in my truck!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Great buy",
      "text": "Borrowed these from a friend, liked them so much I bought a pair for myself. Better welds, higher weight rating than others at this price. Nice to have the folding ramps with an arch.",
      "rating": 5.0,
      "verified": true,
      "author": "RZ",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "I have to block up the end on the ground for a better angle to get it to load an unload",
      "text": "It's still a bit too short/too much of an angle to get the riding lawnmowers into the back of my truck without getting hung up right on the edge of the tailgate and ramp. I have to block up the end on the ground for a better angle to get it to load an unload smoothly",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170329
    },
    {
      "title": "Four Stars",
      "text": "have not used them but they look like they should work good.",
      "rating": 4.0,
      "verified": true,
      "author": "none",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "These ramps rock",
      "text": "I have a lifted Dodge 2500 and these things will get my Polaris 550XP into the bed with no problems. I wouldn't trust the straps that come with the ramps though. They are a little flimsy so I got some ratchet straps from WallyWorld for cheap and I use those. Very light and strong.",
      "rating": 5.0,
      "verified": true,
      "author": "The Researcher",
      "helpful_votes": 3,
      "publication_date": 20121221
    },
    {
      "title": "A good value, but weiht limits",
      "text": "The product was a good value, but the weight capacity limitations were less than I needed; not the products fault.",
      "rating": 4.0,
      "verified": true,
      "author": "David & Cindy",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "good ramps overall",
      "text": "great length to the ramp. Am able to load 250 lb motorcycle onto truck much easier now. welds have held up so far and is still durable and working great since i bought them. heavy loads greater than 500 lbs though on one ramp i wouldnt recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Olsen",
      "helpful_votes": 0,
      "publication_date": 20140828
    },
    {
      "title": "Excellent",
      "text": "Exactly as advertised , seems very well built and is very much suitable for the applications that I needed it for( loading and unloading golf cart in back of truck ). Would recommend it to others to want a good sturdy built set of ramps.",
      "rating": 5.0,
      "verified": true,
      "author": "Guinn",
      "helpful_votes": 3,
      "publication_date": 20121108
    },
    {
      "title": "Best ramps",
      "text": "Love these ramps. Best part is that you get 2 of them. Very sturdy but also light. You will not be disappointed with these. I use them for a dirt bike",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Very solid. I had to add 1/4 inch ply ...",
      "text": "Very solid. I had to add 1/4 inch ply wood to the ramps because the holes were too big for my lawn mower wheels and it was a bumpy ride going up the ramp. The wood panels fixed it.",
      "rating": 4.0,
      "verified": true,
      "author": "rwall88",
      "helpful_votes": 0,
      "publication_date": 20151219
    },
    {
      "title": "Great ramps for the price!",
      "text": "Great products for the price, lightweight & easy to store. I used to these to replace a very old pair of 2 by 8 wood ramps that I had been using for years. As a side note mine literally arrived less than 24 hours after I ordered them. I assume I'm just close to the distribution center but it was awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170113
    },
    {
      "title": "Great ramps for the price",
      "text": "Great price for these ramps, and what you get. The welding doesn't look perfect but should be serviceable. All i care is that it works well, and these handle me and my 700 raptor no problem. Time will tell if it is durable, but i think it'll last just fine",
      "rating": 4.0,
      "verified": true,
      "author": "kdraven",
      "helpful_votes": 0,
      "publication_date": 20140119
    },
    {
      "title": "A sturdy well built product",
      "text": "A sturdy well built product. Made of aluminum, it is fairly light weight but can handle most lawn or lawn equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald Teixeira",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "89\" Dual Arched Folding ATV Loading Ramps",
      "text": "These ramps just weigh 17 pds. each, but built to last. Made out of aluminium. Easy to handle and set up to use. Each ramp says they will hold up to 500 pds. but sure they would hold a little more. I would highly recommend these ramps.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Rickert",
      "helpful_votes": 0,
      "publication_date": 20130610
    },
    {
      "title": "Great gift",
      "text": "Great set of ramps. Makes it easier to load 4 wheeler.",
      "rating": 5.0,
      "verified": true,
      "author": "Gene Jones Jr",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Handy, light weight",
      "text": "Very handy for getting the ATV, lawn tractor and even a neighbor's mobility chair in and out of a 4x4 pickup. Light weight enough for strength challenged folks.",
      "rating": 5.0,
      "verified": true,
      "author": "old enough",
      "helpful_votes": 0,
      "publication_date": 20150526
    },
    {
      "title": "meets need well",
      "text": "I have tested the ramps by loading my Kawasaki Bayou 250 on to my Ford Ranger with no problems or issues. When I first received the ramps I had to realign the carter pins holding the hinge bolts. The pins are almost too small diameter so I carefully bent them to stay in place.",
      "rating": 4.0,
      "verified": true,
      "author": "DonnaDuke",
      "helpful_votes": 0,
      "publication_date": 20140514
    },
    {
      "title": "Sturdy",
      "text": "Drove a 2019 Golf cart up into a 10 ft uHaul box truck on these 👍🏼",
      "rating": 5.0,
      "verified": true,
      "author": "El Sujecto",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Good ramps.",
      "text": "I have an F-350 pickup that sits pretty high and these ramps do the trick. I use them to load a 4-wheeler. The only reason they didn't get 5 stars is because they tend to slide a little bit on the snow if it's not smooth level ground. I connect the two ramps with a strap at the bottom and that helps the sliding.",
      "rating": 4.0,
      "verified": true,
      "author": "Luke Stromme",
      "helpful_votes": 3,
      "publication_date": 20140103
    },
    {
      "title": "They are very useful for loading my atv",
      "text": "They are very useful for loading my atv. They do seem to strain a little though, but I have had no problems so far. The price was right.",
      "rating": 4.0,
      "verified": true,
      "author": "asch",
      "helpful_votes": 0,
      "publication_date": 20141112
    },
    {
      "title": "Great Ramps",
      "text": "Bought ramps for my short bed pickup and works great. Folds up and fits perfectly. Better than using the full size ramps that cant fit in the bed of smaller trucks. Great purchase! Look forward to using them in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronni",
      "helpful_votes": 0,
      "publication_date": 20130515
    },
    {
      "title": "Missing ramp",
      "text": "Gave this product 2 stars because I only received one ramp. The one ramp looks to be well built. Waiting on Amazon to ship me a full set. Once I receive the the set of ramps I will repost.",
      "rating": 2.0,
      "verified": true,
      "author": "Matthew Tinsman",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "ATV  Ramps",
      "text": "Very nice Ramps work as they should nice and sturdy",
      "rating": 5.0,
      "verified": true,
      "author": "Dexter Eaton",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "I suggest these for anyone",
      "text": "they work perfectly. Well it's been about oh i don't know 6, 7, or more years now.. These things are solid, I use them for just about everything. What ever i need to put in the back of the truck and i need a ramp. I use these. worked well with all the four wheeler and the lawn tractor too i might add.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20140501
    },
    {
      "title": "happy husband",
      "text": "BOUGHT THESE FOR MY HUSBAND FOR CHRISTMASS HE LOVES THEM NOW HE CAN TAKE THAT FOUR WEELER ANY WARE WITH OUT PULLING A TRAILOR. GLAD I FOUND THEM HE IS A HAPPY MAN.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Barla",
      "helpful_votes": 0,
      "publication_date": 20140108
    },
    {
      "title": "very light and easy to use",
      "text": "very light and easy to use. have test fitted them on my tailgate and seem to be very sturdy, i haven't loaded anything on them as of yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20140813
    },
    {
      "title": "Five Stars",
      "text": "Works well for getting my lawn tractor in and out of the shed. I didn't want a permanent ramp.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny Boy",
      "helpful_votes": 0,
      "publication_date": 20150620
    },
    {
      "title": "Too scary. I guess its not the fault of ...",
      "text": "Too scary. I guess its not the fault of the ramps but I'm not gonna use them. Gonna go back to the trailer.",
      "rating": 2.0,
      "verified": true,
      "author": "eddalex",
      "helpful_votes": 2,
      "publication_date": 20141121
    },
    {
      "title": "great ramps",
      "text": "Work great, light weight and fold up nicely for easy storage. I have a 6in lift on my truck and these are the perfect length. A solid buy!",
      "rating": 5.0,
      "verified": true,
      "author": "HappyCamper",
      "helpful_votes": 0,
      "publication_date": 20141016
    },
    {
      "title": "Good buy, would recomend to others.",
      "text": "The ramps work very well and are light weight. No issues with them at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory Harris",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "easy to use",
      "text": "Light weight, easy to use, sturdy and durable, very secure. Set up in minutes and work perfectly for a 500cc 4 wheeler and CRF 230F. Still waiting for the hot brunettes to show up & sit on my ATV though...",
      "rating": 5.0,
      "verified": true,
      "author": "C P H",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "safety first.",
      "text": "These are great for the price, have seen more expensive one's that are much cheaper made . work great for a tall 4x4 truck .",
      "rating": 5.0,
      "verified": true,
      "author": "et7709",
      "helpful_votes": 0,
      "publication_date": 20141110
    },
    {
      "title": "Absolutely great",
      "text": "I use these ramps every weekend. They are great. The little arch allows me to load the machine in the truck without bottoming out. If there was one way to improve them it would be to beef them up a little more so I can load my garden tractor (it weighs 1800 lbs which is above the 1500 lbs rating for these ramps) and maybe make them fold in three to provide for a smaller package. But even without these improvements, these ramps rock. Lighter than the ones made of steel, yet they will handle any ATV, motorcycle or garden machine up to 1500 lbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrei Calciu",
      "helpful_votes": 20,
      "publication_date": 20120327
    },
    {
      "title": "Excellent Value",
      "text": "Ramps are exactly as described. work great. Easy to set up and use. They stay very secure while loading, as long as the safety straps are used as instructed, which is an absolute must for any atv loading ramps.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan B Smith",
      "helpful_votes": 0,
      "publication_date": 20131101
    }
  ],
  "product_meta": {
    "title": "Rage Powersports Black Widow AFL-9012-2 Aluminum 7' 6 Arched ATV Ramp",
    "description": "The Aluminum Folding Arched Dual Runner ATV Ramps make loading your ATV a breeze! Manufactured from high-strength, lightweight aluminum, these folding ramps are easy to maneuver and can handle loads up to 750 lbs. per ramp. The specially designed arch ensures maximum ground clearance to prevent your ATV from bottoming out while loading. The cross bars feature 3” rung spacing, providing a smooth ride and extra traction for pneumatic tires, even in wet and muddy conditions. The included adjustable safety straps offer secure loading, and the three rubber-coated 4” mounting fingers on each ramp will prevent scratches on your truck bed or trailer. When not in use, these ramps fold in half for easy storage in your garage or vehicle. Please note, these ramps are not recommended for loading golf carts.",
    "rating": 4.7,
    "feature_bullets": [
      "Dual runner arched folding loading ramps for loading and unloading ATVs, UTVs, and more into truck beds and trailers; package includes 2 ramps",
      "Each ramp measures 7' 6\" L x 11.25\" W; maximum 750 lb weight capacity",
      "Arched for maximum engine and tailpipe clearance",
      "Serrated rungs for superior traction in mud, rain or snow; plate-style attaching lip safely supports ramp on vehicle; includes 2 adjustable safety straps to secure ramps to vehicle",
      "High-strength, lightweight aluminum construction"
    ],
    "specifications": {
      "Manufacturer": "Big Boy EZ Rizer",
      "Brand": "Rage Powersports",
      "Model": "AFL-9012-2",
      "Item Weight": "29 pounds",
      "Product Dimensions": "89.25 x 11.13 x 1.5 inches",
      "Item model number": "AFL-9012-2",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "AFL-9012-2",
      "Cover Included": "Ramp",
      "ASIN": "B000AXHPRS",
      "Customer Reviews": "4.7 out of 5 stars385 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#16,762 in Automotive",
      "Date First Available": "February 12, 2010"
    },
    "categories": [
      "Accessories",
      "Motorcycle & Powersports",
      "Loading Ramps",
      "Automotive Parts & Accessories",
      "Automotive"
    ],
    "price": 164.99
  }
}