{
  "website_summaries": [
    {
      "verdict": "Has the ability to complete a wide variety of jobs, as it has up to 5 tons of pulling power.",
      "pros": [
        "Uses zinc plating on the gears to provide a greater level of longevity than some other units",
        "Delivers a long handle, so you easily can apply the leverage required",
        "You can operate it one-handed if needed, thanks to the strong ratchet system"
      ],
      "cons": [
        "Heavy unit that’s not as portable as some others"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "A very well-built come-a-long!",
      "text": "I read a previous purchasers opinion calling this come-a-long \"chinese junk\", and it needed to be welded to strengthen it! I researched this same come-a-long and found that whoever reported this \"false report\" is a JACKASS! I ordered and received this same come-a-long and this is one WELL-MADE, and DURABLE come-a-long! I researched come-a-longs at two different hardware stores where I live in Alaska and couldn't find one this WELL-MADE! This come-a-long is worth what it is priced at!",
      "rating": 5.0,
      "verified": true,
      "author": "Lionel Scotti",
      "helpful_votes": 9,
      "publication_date": 20190701
    },
    {
      "title": "The worst one I have purchased yet",
      "text": "The worst one I have purchased yet. I usually don't write reviews but this thing needs one. First time using it to pull cable to 2000lb doubled up and the gearing system broke. Tekton is so far the better of the ones. Considered masdam but hard to pull the trigger on that much and it may be junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Doug Scheidle",
      "helpful_votes": 15,
      "publication_date": 20161214
    },
    {
      "title": "Does not work",
      "text": "First of all there’s no directions with this winch. It is not obvious how it works and a set of directions would have been very helpful. Second ad best as I could I got it set up and used the winch. When I did the cable got it imbedded in the reell with the other cable such that I could not unwind it. I finally got it disconnected but was never able to free the cable from the reel so I returned it and as usual Amazon gave me a very quick and courteous credit to my account. I would not recommend this winch to anybody for anything.",
      "rating": 1.0,
      "verified": true,
      "author": "Agapemou",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Nice Come-Along.  Recommended",
      "text": "Bought for contingency use in future. But to test, I locked wheels on my truck and used this item to drag my Jeep up the driveway toward the truck. Did the 2_ton weight of the Jeep easily with no issues or concerns. Recommend seller and product.",
      "rating": 5.0,
      "verified": true,
      "author": "Picard321",
      "helpful_votes": 5,
      "publication_date": 20180217
    },
    {
      "title": "Cable length and size is wrong in description.",
      "text": "Description says 3/16-inch x 12 ft galvanized steel aircraft cable. Box says 1/4 x 10ft.",
      "rating": 1.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 2,
      "publication_date": 20200927
    },
    {
      "title": "Yes it is a piece of junk! It can not pull 5 ton!",
      "text": "It can pull 500 lb. That is all. The rope keeps getting stuck on the follower and the pulley. Had to rework the pulley. After two jobs pulling fallen threes it is done. The central rope rail is bent and dose not rotate any more. So after two jobs I have to junk thee thing and find a something of a better quality. I have no idea how this thing can get so many good reviews. Must be one of the review scams plaguing Amazon.",
      "rating": 2.0,
      "verified": true,
      "author": "E",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Effective",
      "text": "I purchased for pulling small shrubs and undesired vegetation out by the roots. It works well for this task. I use a tree saver strap and a strap for the shrub to remove. I think this would have potential retrieve a stuck small vehicle. I had some difficulty with the locking gear. It's an effective low cost tool for the home handyman.",
      "rating": 4.0,
      "verified": true,
      "author": "NC guy",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Junk",
      "text": "On the second use, the handle folded. This is junk and I can’t get hold of anybody at Neiko or Amazon to find out how to get a replacement part",
      "rating": 1.0,
      "verified": true,
      "author": "David Stewart",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Another come-along, but Still No Ragtime Band",
      "text": "good solid two gear ratchet. I just wish the cable was longer. I use it for prejudicing the fall of trees when I drop them in my yard. I team this up with the other come-along to put the max pressure in the most favorable direction. Don't try cutting and dropping trees unless you KNOW WHAT YOU'RE DOING!!!! Trees do what THEY want to do once you cut them... and with a little breeze they can be downright deadly.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig in NE CT",
      "helpful_votes": 6,
      "publication_date": 20150626
    },
    {
      "title": "do not buy this",
      "text": "When it arrived, I looked at the dictions then needed to go to YOUTUBE. I watched a video on how to release it and it won’t release. My spouse is an engineer and between the two of us, we tried repeatedly all for nothing. DO NOT WASTE YOUR TIME OR MONEY. TOO MUCH OF A HEADACHE.",
      "rating": 1.0,
      "verified": true,
      "author": "Kathleen",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "First impression great product.",
      "text": "My first impression is its a great product. I needed it to be heavy duty, 5 tons and durable enough to take on the road as part of my recovery kit. I'll update after several uses, although that means getting stuck several times.",
      "rating": 5.0,
      "verified": true,
      "author": "No Name",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "One shot deal at the high end of its capability",
      "text": "This is a basic, entry level design and not easy to use. I had prior experience with the genre but two handyman friends had difficulty figuring out how it worked. Recommend for single use of a heavy object because it gets trashed early on.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael Leahy",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Helps manipulate trees falling",
      "text": "Great product that I use, along with straps, to get large trees that I’m cutting to fall in a particular direction. Definitely a good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth B. Fowler",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "1/4\" cable is stiff and difficult to use.  Unless you need the 5 ton capacity, get 3/16\" cable pully",
      "text": "Overall a good cable puller. Plastic handles come off easily and have to be pushed back on. The black metal cover on the closed side of the puller is very thin sheet metal and dents easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Barry Stevenson",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Great Cable Puller",
      "text": "Used this product to remove tree stumps and lift a washing machine with additional straps. Worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "Techkie",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Pulled out a huge tree stump",
      "text": "Well made, very powerful, pulled out a stump from a tree that fell with no issues",
      "rating": 5.0,
      "verified": true,
      "author": "Stefan Schade",
      "helpful_votes": 2,
      "publication_date": 20180829
    },
    {
      "title": "Needs updated Instructions and better product labels.",
      "text": "Hand puller instructions need to be revised. Instructions only reference the 1, 1-1/2, 2, 3, and 4 Ton model weight capacity specifications. Only 5 ton weight capacity reference is on the packaging itself. It would be nice to see the products weight capacities for double & single line pulls in the included instructions and on the hand puller itself.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenifer E. Johnson",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Nice",
      "text": "Had to do an adjustment to teeth for gears but after that it worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "steve veenstra",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Good for occasional use",
      "text": "I purchased this item to replace a section of chain link fence but I did not want to spend a lot because this was a one time use. I have used professional Come-a-longs so the short comings of this one were very evident. Most notable is the fact that there is no quick release. After you have tension on it you have to slowly release the tension in the reverse order that you applied it until there is almost no tension left. However if you need something that you will use infrequently and don't want to worry about having to go out and rent one if you need it, then this is not a bad value.",
      "rating": 3.0,
      "verified": true,
      "author": "Leaport",
      "helpful_votes": 10,
      "publication_date": 20091104
    },
    {
      "title": "Pure Junk",
      "text": "Used it once. It's claimed to pull 5 tons, it didn't even last pulling 2. It ate itself while under a load and covered the surface of the trailer with metal shavings. I got the tractor I was pulling halfway up the trailer and the frame of this thing bent, causing the handle to no longer engage with the winch reel. This thing is made from pure liquid junk. DO NOT BUY.",
      "rating": 1.0,
      "verified": true,
      "author": "John C",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "No regrets",
      "text": "I take out stumps the old fashioned way: with shovel and axe. I also use this winch in the effort. Very strong. The length of the cable is long but I wish it were even longer.",
      "rating": 5.0,
      "verified": true,
      "author": "WalterM",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Disappointed",
      "text": "Purchased this 5 ton to replace a 4 ton a had for over 15 years. Big mistake. No way would this unit ever have a list price of $99 as indicated. Definitely not worth the $40 plus I paid. The plastic handle came off the first time I tried to use it. The wire cable already had a broken strand. Really poor quality unit. I would never classify this as \"Heavy duty\". Stay away from this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael Riley",
      "helpful_votes": 7,
      "publication_date": 20120409
    },
    {
      "title": "Very smooth action.",
      "text": "This unit is almost identical to my craftsman cone along that I purchased over 20 years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Cole J.",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Great Product",
      "text": "Best deal of the day. The price made it even better.",
      "rating": 5.0,
      "verified": true,
      "author": "gag1025",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Heavy duty.",
      "text": "High quality well made come-along. Very strong but short pull before you have to rig it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen K.",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "It's a brut",
      "text": "Good heavy duty product. Worked well so far for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Low durability",
      "text": "Low durability. The pawls do not engage properly. It slips under load. In 6 uses the teeth are wearing. This five ton unit was to replace a five-year-old four ton unit and only lasted three months. Poor valve for the money The primary use is to pull a 2500 pound tractor from mid. Spots.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Disappointed",
      "text": "I liked most of the features of these pullers except that they are difficult to release and extend the cable. I rated them low because we were only able to use them a few times before they twisted so that only one of the ratchets engages on the teeth of the cogs which renders them virtually worthless.",
      "rating": 2.0,
      "verified": true,
      "author": "Phil Gilbert",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Broke after short usage",
      "text": "I purchased this come-a-long to pull shrub roots out of the ground. Roots were not large and can be pulled out with 1-2 ton of force. Come-a-long worked fine for about 5 roots. On the fifth root, the spindle of the come-a-long broke. The come-a-long is well built except for the spindle shaft. This come-a-long is rated for 5 tons. Most components of the come-a-long are designed for 5 tons. The spindle is designed for about 1.5 tons. I would recommend not to purchased if you are looking for a come-a-long that can pull more than 2 tons.",
      "rating": 1.0,
      "verified": true,
      "author": "KickMe",
      "helpful_votes": 5,
      "publication_date": 20140420
    },
    {
      "title": "Broke",
      "text": "I am 72 years old and this thing broke under the pressure I could muster. It is one day after the return window, so I am out. But now I am going to a farm supply store for one not made in China.",
      "rating": 1.0,
      "verified": true,
      "author": "Larry M. Decicco",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "better than my last one",
      "text": "I've destroyed 2 ton come alongs and this one is constructed very similar but with heavier gauge steel. I use these things pretty consistantly in a variety of applications and this one has held up very well. No skipping teeth, stuck latches or other issues that plagued my other ones. I've been pretty happy with this one so far and its proved to be pretty tough. Don't know if I'd try 5 tons in a vertical lift situation though.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael C. Emond",
      "helpful_votes": 2,
      "publication_date": 20091227
    },
    {
      "title": "Power cable puller is the best out there",
      "text": "I really like this comalong it works well it did it job at easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Failed first time I used it.",
      "text": "The first time I used the item it would not ratchet. Would have to hold the ratcheting teeth down , this also failed and it became unusable.",
      "rating": 1.0,
      "verified": true,
      "author": "Orie Bramblee",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Does the job...!",
      "text": "I bought this to help re-position a storage shed and it worked fine. Some of the reviews I've read, mentioned having trouble releasing the mechanism but I didn't have any problems. Just don't expect to buy the minimum strength you need and expect it to handle a full load. Again, this did fine for me. The 3 hook design adds some versatility to your project.",
      "rating": 4.0,
      "verified": true,
      "author": "Freddie Eaves",
      "helpful_votes": 0,
      "publication_date": 20110219
    },
    {
      "title": "Don’t buy this piece of junk!",
      "text": "This is the worst piece of junk I have ever bought. I am not a picky person I just expect items I purchase to work. This thing would not pull 2 inches without slipping. I ended up sending it back.",
      "rating": 1.0,
      "verified": true,
      "author": "The Buyer",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Well made & worth every cent!",
      "text": "My husband brags to his friends about this come-a-long!! Sturdy & well worth every cent!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Bestel",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "A waste of MONEY",
      "text": "CHEAPLY MADE. What we used it for it shouldn't of fell a part. The cables wouldn't roll up right and the teeth wouldn't lock and unlock properly and jam. The second time we used it .....It failed so we're off looking for another one. Heavy Duty it is not !! A waste of MONEY.....This is why you don't give a review so quickly!!",
      "rating": 1.0,
      "verified": true,
      "author": "Solara Malenke",
      "helpful_votes": 2,
      "publication_date": 20150801
    },
    {
      "title": "Cheap",
      "text": "Tried to pull my truck out with it. Maxed it out a few times and after some abuse it ended up failing. Will buy more expensive one next time.",
      "rating": 2.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Puller",
      "text": "Works well for pulling 20 inch logs. I have not used it at max capacity but pulling smaller items (9'x20\" logs) it works well. One thing to watch: If the cable does not wind perfectly you can overlap the cable and bind the gears if over-cranked (spool diameter gets too large).",
      "rating": 4.0,
      "verified": true,
      "author": "James Donald Kelley",
      "helpful_votes": 0,
      "publication_date": 20120911
    },
    {
      "title": "Heavy duty construction",
      "text": "Built well. Used it once to pull out a bent fender...worked good. Cable is pretty short but worked good. Release worked good with tension on the cable. Didn't want to fiddle with the release as most of the other come-along reviewers noted on some of the other brands. Think this will work good while building our log home this summer 2011.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimnasium",
      "helpful_votes": 0,
      "publication_date": 20110309
    },
    {
      "title": "Heavy duty",
      "text": "Extra heavy duty. There is only about six foot of cable so make sure you do not need to pull further than that without repositioning. I pulled out several huge shrubs and sage brush with ease. My 4 ton electric winch would not pull out similar shrubs.",
      "rating": 5.0,
      "verified": true,
      "author": "Rea",
      "helpful_votes": 0,
      "publication_date": 20140310
    },
    {
      "title": "Verry poorly designed",
      "text": "This thing just started bending cable was getting stuck, one of the hooks flew of. Definitely not a 5 ton puller, design is pretty bad. But for 50$ it might be worth having just incase.",
      "rating": 2.0,
      "verified": true,
      "author": "Dmitriy Polyashov",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "So Far So Good",
      "text": "My crew and I used it to pull the cable for a Ramada canopy, it was hard at first to get it started when you are ten feet above ground pulling cable. But the sturdiness feels good, I recommend this one.",
      "rating": 3.0,
      "verified": true,
      "author": "Ernest Ramirez",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "I like it used it lots of time and durable",
      "text": "I like it used it lots of time and durable one improvement I would recommend is to add a easier release mechanism",
      "rating": 5.0,
      "verified": true,
      "author": "Belle Szebrak",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "It pulls, not lifts",
      "text": "I needed to lift a couple hundred pounds and thought this would work. After getting it, I noticd it said it was for pulling and NOT for lifing. I figured I'd keep it to pull trees in the direction I want them to fall from cutting them down. So I tested it with no directions that came with it. The cable hook spool when releasing the tension would get caught on the rachet mechanism and you would have to dangerously try to release the built up tension. I returned it easily with a quick refund. I LOVE Amazon!",
      "rating": 1.0,
      "verified": true,
      "author": "Chicagodogs",
      "helpful_votes": 3,
      "publication_date": 20160619
    },
    {
      "title": "CHEAP",
      "text": "Do not buy... Teeth don't into gears unless you manually do it every time you crank the handle.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Not even close!",
      "text": "Pulled 8000 pounds with this winch. Fell apart half way through. Trying to figure out how to return defective.",
      "rating": 1.0,
      "verified": true,
      "author": "Mitchell Smith",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "cable puller",
      "text": "Purchased for farm use, I have no complaints. Seems to be well built even with the load I've put on it. When it breaks I'll start screaming but so far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20140405
    },
    {
      "title": "This is a workhorse",
      "text": "This come-a-long is a great product, and well worth the money. I'm falling trees, and moving logs, and it really is great, especially the three hooks for secuirng things..",
      "rating": 5.0,
      "verified": true,
      "author": "Gary J.",
      "helpful_votes": 0,
      "publication_date": 20130528
    },
    {
      "title": "Decent for limited use",
      "text": "At first use it really performed well but after three or four uses the gears became dislodged and no longer was usable.",
      "rating": 1.0,
      "verified": true,
      "author": "Gregory Timbas",
      "helpful_votes": 2,
      "publication_date": 20170917
    },
    {
      "title": "Well made, good value",
      "text": "Very solidly made. I had bought a cheaper come-along and it fell apart, I'm pretty sure this one will not do so.",
      "rating": 5.0,
      "verified": true,
      "author": "John E. Brown",
      "helpful_votes": 0,
      "publication_date": 20150608
    },
    {
      "title": "Don't expect a lot of uses out of this if ...",
      "text": "Don't expect a lot of uses out of this if you are pulling much weight at all. The locking gear that catches to stop is not solid and bends and jams the action over time.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael Stach",
      "helpful_votes": 3,
      "publication_date": 20150625
    },
    {
      "title": "Five Stars",
      "text": "Nice quality and has done the job for me several times so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas P. Frantz",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "Saved me on more than one occasion.",
      "text": "Great product at a great price. Saved me on more than one occasion.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard G Soto",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "Works as expected",
      "text": "Heavy duty. no problems encountered when pulling and pulls strong. Just heavy and large. Takes up much space in truck.",
      "rating": 4.0,
      "verified": true,
      "author": "Shane Helsley",
      "helpful_votes": 0,
      "publication_date": 20140217
    },
    {
      "title": "Great for my brother",
      "text": "Ordered for my little brother who seems to get into a bit of trouble. He's used this to help get un-stuck many a time.",
      "rating": 5.0,
      "verified": true,
      "author": "sara",
      "helpful_votes": 0,
      "publication_date": 20140129
    },
    {
      "title": "Pulls Trees Down",
      "text": "I hook this to larger trees I am cutting down to make sure they fall in the right direction. As long as the tree isn't too big and is not totally leaning in the oppposite direction, it is helpful. I also carry it in my car in case I get stuck in the mud close enough to a tree to pull myself out.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck Pearson",
      "helpful_votes": 0,
      "publication_date": 20090312
    },
    {
      "title": "Five Stars",
      "text": "Excellent tool. I use it when cutting trees and i cannot say enough good about it.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20150221
    },
    {
      "title": "Great Tool",
      "text": "This come-a-long is easy to use and works as promised. I haven't used it on anything over 3 tons, and I've had no problem with it moving my loads.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert A. Hansen",
      "helpful_votes": 0,
      "publication_date": 20130518
    },
    {
      "title": "Four Stars",
      "text": "I only really used this twice and it was a serious help both times",
      "rating": 4.0,
      "verified": true,
      "author": "chui",
      "helpful_votes": 0,
      "publication_date": 20150705
    },
    {
      "title": "Pwer Puller review",
      "text": "It does fine. Just used it once to pull a tailgate back straight, attached to a telephone pole and it was about to pull the truck front wheels off the ground. It is what it says it is. A power puller. It would have been nice to have had some instructions, though.",
      "rating": 4.0,
      "verified": true,
      "author": "Cool JB",
      "helpful_votes": 3,
      "publication_date": 20081116
    },
    {
      "title": "great",
      "text": "I have one that is not working to well I need a bigger one and now I have it and like it better then the old one",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20111117
    },
    {
      "title": "One Star",
      "text": "It was broken when we got it so had to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Karen Walker",
      "helpful_votes": 0,
      "publication_date": 20150907
    },
    {
      "title": "AMAZON POWER ASSIST COME ALONG",
      "text": "NEEDED POWER ASSIST TO PULL DOWN SMALL STUMPS & THIS COME ALONG DID THE TRICK. IT'S ACTUALLY BIGGER THAN THE ONE I BORROWED FROM A FRIEND & BETTER BUILT, I RECOMMEND IT HIGHLY ESPECIALLY FOR THE PRICE.",
      "rating": 4.0,
      "verified": true,
      "author": "AyeEnJi",
      "helpful_votes": 0,
      "publication_date": 20120418
    },
    {
      "title": "strongly recommend",
      "text": "Heavy duty and has gotten me out of a few jams while logging for winters wood supply.",
      "rating": 5.0,
      "verified": true,
      "author": "Murph",
      "helpful_votes": 0,
      "publication_date": 20141124
    },
    {
      "title": "I recently used this.",
      "text": "This is an item you don't use very often, but when you do need it, nothing else will do! I recently bought a used car that had a very heavy front bumper licence plate backing that had been crumpled back so that the mounting bolts couldn't be accessed. With a chain around a big tree and this wench, I was able to pull it out so that I could remove it without damaging my chrome bumper.",
      "rating": 5.0,
      "verified": true,
      "author": "Gordon Agnew",
      "helpful_votes": 0,
      "publication_date": 20131228
    },
    {
      "title": "Worked great.",
      "text": "I used this tool to pull a concrete mow strip back into allignment. It worked like a champ. Only complaint is that the release system is not too easy to figure out. It requires some study to figure out how to release the tension after you pull with it. Otherwise it is strong.",
      "rating": 5.0,
      "verified": true,
      "author": "RC",
      "helpful_votes": 0,
      "publication_date": 20110117
    },
    {
      "title": "very nice come-along",
      "text": "very nice, the single hook is a little smaller then I would like, but it works very well. You have to reach in and move the spring over for the release trip, instead of a leaver, not bad just different.",
      "rating": 4.0,
      "verified": true,
      "author": "George Huson",
      "helpful_votes": 3,
      "publication_date": 20081030
    },
    {
      "title": "Not \"Heavy-Duty\"",
      "text": "Appears to be make well but when I put it to the \"Heavy-Duty\" it did the job but the cable got jammed and I was unable to release it also when you want to pull the cable back out you need three hands. The cheap little metal guide for the wire bent quickly and need a screw driver to release it. Good for small and light job (maybe).",
      "rating": 3.0,
      "verified": true,
      "author": "Gus",
      "helpful_votes": 2,
      "publication_date": 20141223
    },
    {
      "title": "DO NOT BUY!!!",
      "text": "I just got it out of the box and when I tried to pull the lever back to reel in the cable, the teeth that are supposed to bite into the gears would not engage the gears. Turns out the only way to get the gears to engage is to use one hand to pull the lever back and use your other hand to push the teeth into the gears, but even then if you do not push hard enough, the teeth slip back out of the gears. THis is not how any come along should work. The whole thing is basically garbage, I feel like I just got robbed.",
      "rating": 1.0,
      "verified": true,
      "author": "Zachary",
      "helpful_votes": 0,
      "publication_date": 20151026
    },
    {
      "title": "appears heavy duty",
      "text": "I haven't put it to the test as yet, but to clarify, It is advertised as a 5 ton come along on the box in bold letters, but if you read the fine print it cautions you not to exceed 2 ton a far cry from 5 ton, I would do a little research, which I didn't do, but we live and learn, I hope it will preform well for what little pulling I have to do.",
      "rating": 3.0,
      "verified": true,
      "author": "Marshall F. Flowers Sr.",
      "helpful_votes": 2,
      "publication_date": 20140612
    },
    {
      "title": "Just what I needed",
      "text": "Just what I needed. I do a lot of offroading and I get stuck a lot. LOL! This has helped pull me out a few times when my winch just wasn't enough.",
      "rating": 5.0,
      "verified": true,
      "author": "POE_333",
      "helpful_votes": 3,
      "publication_date": 20120301
    },
    {
      "title": "I wouldn't trust this to pull 5 tons",
      "text": "I have lesser rated come a longs that perform better than this one. Short handle and cheap parts.",
      "rating": 1.0,
      "verified": true,
      "author": "shane",
      "helpful_votes": 2,
      "publication_date": 20151023
    },
    {
      "title": "Five Stars",
      "text": "Just what I needed for the job I had to do. Handy tool to have",
      "rating": 5.0,
      "verified": true,
      "author": "JVO",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "Don't buy it",
      "text": "Why does someone buy a \"heavy-duty\" 5-ton come-a-long? In my case it was to use it. The first time I used this product to pull a cut and snagged tree down it broke. Really not much more needs to be said. My feeling is that you should not be able to break this product by pulling on the handle to ratchet it up by hand. It should just stop before you could break it. Nothing extraordinary was going on. If you plan to actually USE this and expect a heavy duty product you will not be happy.",
      "rating": 1.0,
      "verified": true,
      "author": "hick",
      "helpful_votes": 28,
      "publication_date": 20101231
    },
    {
      "title": "5 Ton Come Along",
      "text": "I like the 5 tom Come Along, however, I wish the drum were just slightly bigger to accomodate about 12 inches more cable. It seems to be just a bit shorter than expected. Other than that, it works great and is what I needed!",
      "rating": 4.0,
      "verified": true,
      "author": "Chuck Klosterman",
      "helpful_votes": 0,
      "publication_date": 20130920
    },
    {
      "title": "Heavy duty",
      "text": "This come along is a very nice unit and does a very good job. It is a heavy duty unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip Meador",
      "helpful_votes": 0,
      "publication_date": 20170323
    },
    {
      "title": "CANCELLED ORDER",
      "text": "N/A. We were not able to use this size Come-a-long for our job, but we will certainly consider this source the next time.",
      "rating": 5.0,
      "verified": true,
      "author": "O. J. Johnson",
      "helpful_votes": 0,
      "publication_date": 20140323
    },
    {
      "title": "Its a one time use deal. No instructions come ...",
      "text": "Its a one time use deal. No instructions come with it but with help I was able to load the car and get it down here. You also are going to need one with more cable, especially if your going to load a inop auto.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170415
    },
    {
      "title": "No 5-Ton ability",
      "text": "This come-along does not seem to have the claimed capacity. On my first use the cable split the metal drum it rolls around and the cable was flattened. If you have a big job to do buy a better one.",
      "rating": 2.0,
      "verified": true,
      "author": "Jim57784",
      "helpful_votes": 3,
      "publication_date": 20100710
    },
    {
      "title": "Five Stars",
      "text": "The hoist was listed correctly and was delivered on time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151117
    },
    {
      "title": "Disposable tools have a place too...",
      "text": "Great for weights under 50% of its rated capacity and occasional use away from the ocean. If you need to pull your quad out of the muck every once in a while... Great. If you need to haul a great white up a pole for a tourist picture... Make sure the tip covers the cost of a new one... Because both the salt and weight just destroyed this one.",
      "rating": 2.0,
      "verified": true,
      "author": "Darn Reddick",
      "helpful_votes": 0,
      "publication_date": 20150508
    },
    {
      "title": "5 TON RATING??",
      "text": "THE PULLEY WHEEL SPLIT IN HALF UNDER THE LOAD. I DID NOT EXPECT THAT TO BE A POINT OF CONCERN.",
      "rating": 1.0,
      "verified": true,
      "author": "greg morgan",
      "helpful_votes": 4,
      "publication_date": 20130702
    },
    {
      "title": "works great!! built the way a puller should",
      "text": "works great !! built the way a puller should .",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Bowen",
      "helpful_votes": 0,
      "publication_date": 20150114
    },
    {
      "title": "Four Stars",
      "text": "Nice puller, worked perfect, for dragging our huge boat up and away from the lake ice",
      "rating": 4.0,
      "verified": true,
      "author": "george van vleet",
      "helpful_votes": 0,
      "publication_date": 20140915
    },
    {
      "title": "The heavy duty tool needed when it comes to pulling.",
      "text": "The Neiko Heavy-Duty 5-Ton come-a-long Power Puller-3 Hooks and 2 gears is a must ,if you are fixing fence,garage door under tension spring,this tool is not designed for lifting but if you are handy you can lift car engine with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel",
      "helpful_votes": 0,
      "publication_date": 20110314
    },
    {
      "title": "not recommended",
      "text": "Chinese junk. I had to repair it before I used it. Chinese junk. I had to repair it before I used it.",
      "rating": 1.0,
      "verified": true,
      "author": "pkerit",
      "helpful_votes": 3,
      "publication_date": 20121224
    },
    {
      "title": "This is totally useless.",
      "text": "Do not buy this item. It cannot be released once it is under load. Also it says on the box that it is for pulling only; not lifting. This is totally useless.",
      "rating": 1.0,
      "verified": true,
      "author": "G. M. Arringdale",
      "helpful_votes": 0,
      "publication_date": 20160703
    },
    {
      "title": "Garbage",
      "text": "Broke the first use trying to pull a stump was using speedy chain couplers rated at 3200# and the entire cable spool collapsed before anything else broke totally worthless way overrated.",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 24,
      "publication_date": 20111023
    },
    {
      "title": "Needed some reinforcement.",
      "text": "The handle seemed a bit flimsy so I reinforced the handle with a pipe. Otherwise, the price was right for the come-a-long.",
      "rating": 3.0,
      "verified": true,
      "author": "Deborah",
      "helpful_votes": 0,
      "publication_date": 20130509
    },
    {
      "title": "Dont buy",
      "text": "Absolute junk. It lasted 1 use for a total of 15 mins before it broke.",
      "rating": 1.0,
      "verified": true,
      "author": "Brad Cooch",
      "helpful_votes": 2,
      "publication_date": 20160401
    },
    {
      "title": "Come-a-long",
      "text": "Quality Product,excellent price,and fast service What's not to like? I highly recommend this item and this seller.",
      "rating": 5.0,
      "verified": true,
      "author": "John R. Shawver",
      "helpful_votes": 0,
      "publication_date": 20091015
    },
    {
      "title": "Almost perfect.",
      "text": "The only bad thing about this is you can't lock it open to pull the cable out it takes two hands to open everything so you can pull the cable and you can't open them and full at the same time it's really difficult 1 switch should open everything.",
      "rating": 5.0,
      "verified": true,
      "author": "Frenchie",
      "helpful_votes": 0,
      "publication_date": 20190628
    }
  ],
  "product_meta": {
    "title": "Neiko 02256A Power Cable Puller, Dual Gears | 5-Ton Pulling Capacity,Clear",
    "description": "Size Name:1Heavy duty durable hand winch power puller with 3/16-inch x 12 ft galvanized steel aircraft cable has a 5 ton pulling capacity.",
    "rating": 4.3,
    "feature_bullets": [
      "Heavy-duty five ton come along hand winch cable puller delivers serious pulling power for construction, home, farms and automotive use",
      "Heavy duty steel construction for added durability; hooks and gears are zinc plated to prevent corrosion and rust",
      "Powerful ratcheting system allows for one-handed operation when pulling even the heaviest loads",
      "Double-gear design locks on for evenly distributed force and easy to gauge notched pulling action",
      "Includes long industrial hand ratchet handle with PVC coated grip for leverage and 3 latching hooks for added safety and versatility"
    ],
    "specifications": {
      "Manufacturer": "Ridgerock Tools Inc.",
      "Part Number": "02256A",
      "Item Weight": "13.38 pounds",
      "Product Dimensions": "28.54 x 5.79 x 4.33 inches",
      "Item model number": "02256A",
      "Is Discontinued By Manufacturer": "No",
      "Size": "1",
      "Color": "Clear",
      "Material": "Includes long industrial hand ratchet handle with PVC coated grip for leverage and 3 latching hooks for added safety and versatility",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B000MBWCIU",
      "Customer Reviews": "4.3 out of 5 stars309 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#12,688 in Automotive",
      "Date First Available": "February 13, 2008"
    },
    "categories": [
      "Tools & Home Improvement",
      "Winches",
      "Towing Products & Winches",
      "Automotive",
      "Exterior Accessories"
    ],
    "price": 55.59
  }
}