{
  "website_summaries": [
    {
      "verdict": "Classic simplicity meets fantastic coffee, thanks to this incredibly popular heat-resistant pour-over glass carafe that doubles as a storage receptacle.",
      "pros": [
        "Coffee flavors really come through",
        "Glass does not absorb extraneous odors",
        "Easy to clean by hand",
        "Has an aesthetically pleasing shape",
        "Thick glass will last for years with careful use",
        "Can purchase a cover and cool off in the refrigerator to make iced coffee"
      ],
      "cons": [
        "Pour-over coffee can take longer than other methods of brewing",
        "Should use only Chemex filters to get the best results"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Cheap glass not durable",
      "text": "And another thing - it does not have 'feet' and the wooden collar does not fit - it is too big. POS I have been using Chemex for 20 years. Chemex makes the best coffee. This is my third beaker. But this glass beaker is about half the thickness of the original. For this price, I expect higher quality. Don't bother with Chemex - buy a less expensive competitor.",
      "rating": 1.0,
      "verified": true,
      "author": "eugene diou",
      "helpful_votes": 18,
      "publication_date": 20190203
    },
    {
      "title": "Not the same product as the original",
      "text": "I purchased this new coffeemaker to replace one I have had over two years that broke. The new Chemex is very fragile in comparison to the older version. The glass is much thinner. I think that it would be very susceptible to chipping and cracking based on it's paper thinness alone. For nearly $50, I expect something that matches the original heftiness and durability similar to the one I originally purchased.",
      "rating": 1.0,
      "verified": true,
      "author": "StayInformed",
      "helpful_votes": 12,
      "publication_date": 20191213
    },
    {
      "title": "NOT ONE BLOODY FILTER FOR A FIFTY DOLLAR PURCHASE ?!",
      "text": "NOT AN INTRODUCTORY FEW ?!?! FILTERS ?!?! and I know I was all TL;DR about the description, but i SRSLY thought there would be a WELCOME NEIGHBOR ! set of FILTERS. boo. VERY VERY boo. BTW, it's one of the most beautiful works of art I've ever seen. p.s., there is NO bottom to the top where the filter goes, this is not your grandma's Melita filter top.",
      "rating": 1.0,
      "verified": true,
      "author": "Country EpiscoPal in the Big City",
      "helpful_votes": 4,
      "publication_date": 20190624
    },
    {
      "title": "Please read",
      "text": "It's a little big and beautifully designed ..... But it Doesn't keep the coffee warm very long. If you forget to take the lid off (sold separately:/) it will drop into your coffee cup and if you are in a hurry for a cup of coffee this is not for you .... BUT the coffee you make in this is delicious :) perfect for a great cup of coffee on the weekends :)",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200317
    },
    {
      "title": "Makes the best cup of coffee  without exception",
      "text": "This has been my coffee maker of choice for decades now. Makes a clean, crystal clear cup of coffee. No residue in your cup as you get with a French press. Easy to clean-it's just one piece. And it is a beautiful, functional piece! Just read this: \"The CHEMEX® can be found in museums throughout the world and is included in the permanent collection at the Brooklyn Museum, Corning Museum of Glass and MOMA, NY. The Museum of Modern Art displayed it as one of the best-designed products in 1943.\" (History-Chemex)",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie Sara",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Best coffee ever, no plastic parts, classy",
      "text": "Stopped brewing hot coffee in the coffee maker with plastic parts. Tried French press and the Chemex. The French press is great, but the coffee is more flavorful when made in the Chemex. It takes a bit longer, but is an easy process. Use good filters to remove bitterness and get a fine grind. A bit hard to clean. A couple of quick rinses are usually all you need, but if you are going to use soap inside, you'll want to get a bottle brush.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 2,
      "publication_date": 20181014
    },
    {
      "title": "Good for larger needs",
      "text": "Bought 10 cup chemex to replace hario V60 ceramic dropper after 3 years. I like that this has a bigger capacity. It is glass so it gets hot but the wood and leather wrap makes it easy to handle. The wood and leather wrap takes more time to put back after you take it off for cleaning. That’s my only complaint since the hario, you just throw away the filter and rinse easily. Coffee tastes good and not bitter. I recommend this if you typically make more than one serving of coffee.",
      "rating": 5.0,
      "verified": true,
      "author": "KAJ5129",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Classic series isn’t the same as original",
      "text": "They changed the design. Thinner glass, deeper sprout groove, weird looking nipple halfway mark. Classic does not me original. We liked our old one better but this will suffice. The old one has the Chemex logo on the bottom, this new says Chemex when you look from the top. It reads Chewex when you look from the bottom.",
      "rating": 4.0,
      "verified": true,
      "author": "David L. Rothman",
      "helpful_votes": 2,
      "publication_date": 20200808
    },
    {
      "title": "LOVE my Chemex!",
      "text": "Recently purchased my second Chemex (upgraded to the 10-cup after having been gifted a smaller one years ago). I long-ago ditched my other coffee makers for this. Surely it takes a little more proactive effort (grinding beans, boiling water, pouring the water over the beans), but it is so worth it for the rich flavor. If you've been on the fence, do yourself a favor and just buy it!",
      "rating": 5.0,
      "verified": true,
      "author": "Karoline",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Highly recommended. Great taste. Classy, sophisticated look. Great gift idea",
      "text": "This product makes delicious coffee and consistently. I chose this coffee maker for health reasons. I love coffee and don’t like how most coffee pots run hot water through plastic to heat it, just doesn’t seem healthy for someone who drinks coffee everyday. I had also tried the steel coffee filters but after some time they acquire a metal taste which I don’t prefer. This glass coffee maker keeps coffee hot for a decent while and I really like the pouring spout. It just looks classy, even when pouring a cup for friends and family. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Karlskin",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Highly recommended for all who love coffee!!",
      "text": "I have several different types of coffee brewer's and this is MY ABSOLUTE FAVORITE!! Coffee tastes clean & smooth (using only tap water) no matter if you like your coffee stronger or mild, there's absolutely no bitterness! The added convenience of keeping the coffee warm on the burner (lowest setting) is wonderful & it's tastes the same down to the last bit. Easy clean up too! I would also highly recommend purchasing the coffee filter's made specifically for it, they're all natural, no chemicals or bleaching. I'm definitely purchasing another for our oldest daughter who's getting married this fall!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lt",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "It works well and looks as hoped.",
      "text": "This method of brewing is second only to the \"American Press\" coffee method. It has a tendency to lose heat quickly, so I would recommend moving the coffee to a good carafe. Cleaning is only a pain if it is left to sit and stain.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 2,
      "publication_date": 20190412
    },
    {
      "title": "Perfect coffee maker for camping or when there is no electric!!",
      "text": "Perfect for camping when there is no electric! I used a reusable filter with this that I was a little hesitant to use but it ended up being perfect. The wooden piece with the leather tie is a little gimmicky but it serves it purpose. I actually replaced the leather tie with a piece of shock cord that keeps it tight. I'd buy this again (and if it ever breaks). I should have bought this years ago instead of using instant coffee on vacations.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael MTop Contributor: Brewing",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "The Best Way to Make Coffee",
      "text": "Already owned this model myself for years and the coffee was so much better I stopped ever buying coffee from a shop and now much prefer to brew my own - I bought this one for my dad as a gift and he’s already so in love with how much better his coffee is he’s in the same boat! It will take a number of tried for you to get your process down perfect, but it’s super easy to use/clean and would recommend this brewing method to anyone who likes a really smooth and bright cup of coffee.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick F.",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Good Coffee",
      "text": "The drip coffee technique was not cutting it. Every morning dreading the taste of the morning joe. Went with the French press for a while but found it a bit messy. Bought this with a metal basket and using the #4 filters from my drip days and was off to the races. Didn't have a slow pouring tea pot. Use a 40 fl oz thermos that allows a slow pour which is essential to wet the grind. Takes a while longer to pour but worth it. This is the way to go. Not looking back.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis R. Young",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Hard to pour with 1 hand",
      "text": "The neck is so narrow, we have a hard time getting down into the bottom to clean and the glass is starting to stain. When I pour it, I'm a woman, my hands are small, so I have to use both hands to pour and if you don't pour slowly, too much coffee comes out at once and makes a mess on the counter. It's cool looking though. Unfortunately, we have gone back to our percolator for coffee. We bring it out when we have company just cuz it's cool looking. Then we transfer the made coffee to a carafe.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Beware how you pour",
      "text": "I love this product, but be careful. Mine broke in three months after normal use, I was pouring a cup of coffee and the wood pressed into the glass and it broke. I will order another but will change the way I hold it when I pour to prevent cracks and breaks. Don't just hold around the wooden collar to pour, maybe try supporting the bottom as you pour relieving the pressure of the wood against the glass.",
      "rating": 3.0,
      "verified": true,
      "author": "Shane Graham",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Simple and Effective",
      "text": "Simple and effective. I've tried a lot of specialty brewing equipment and after a lot of experimentation, the honest truth is that simpler is better. I use a Aeropress for personal use but becomes a pain when we have visitors. This can easily brew for a couple of people with a lot let less effort. Easy to use, easy to clean, no parts to break from use. It can be a little worrying to shatter, haven't tested that yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul D.",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Best coffee ever",
      "text": "Bought this for my husband who has been using a keurig for as long as I can remember. After he used the Chemex for a few days he said, \"I don't even know what I was doing drinking that terrible Keurig coffee. This is the best cup of coffee i've ever had at home.\" Needless to say, he loves it. Takes a bit to figure out ratios but when you do, you will be set!",
      "rating": 5.0,
      "verified": true,
      "author": "ALYSSA THRIFT",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Fantastic coffee.  Not a fan of the wooden collar.",
      "text": "I recently purchased the 10-cup (50oz) coffee maker with the wooden collar. Yes it is beautiful and yes it makes fantastic coffee. The reason for 4 stars instead of 5 is that if I had it to do over I probably would have purchased the glass-handled model instead. When full pouring is awkward and requires both hands to keep it steady. My mother-in-law can't do it at all. Maybe a smaller 3 or 6-cup one is easier to pour from. As for cleaning the exterior so far I have been wiping it down with a warm damp cloth the best I can. I really don't want to untie the collar but suppose I must eventually.",
      "rating": 4.0,
      "verified": true,
      "author": "Jack D. Alfred",
      "helpful_votes": 2,
      "publication_date": 20160513
    },
    {
      "title": "Best coffee ever!",
      "text": "The coffee from this coffee maker is the best ever. It just takes a little time to boil the water and let it drip through the filter. You will need to find-out where you can get your filters; the Chemex filters are not normally sold at markets/department stores but can easily be purchased on-line.",
      "rating": 5.0,
      "verified": true,
      "author": "cmr",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Immersive Experience",
      "text": "The chemex is beautifully designed. It amplifies the experience of making and consuming coffee. I combine the chemex with a burr grinder and a kitchen scale. The pour-over coffee tastes great. I would recommend for anyone looking for an immersive coffee brewing experience.",
      "rating": 5.0,
      "verified": true,
      "author": "A. McQuoid",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Looks Nice But...",
      "text": "Nice design but so impractical. It doesn't hold heat at all. By the time I've put in all the water in the filter (have to wait for water to drip down), the coffee is lukewarm. The glass does get quite hot, so you have to use a potholder to handle it. Also, it is very difficult to clean, even with a bottle brush. I would not purchase this again.",
      "rating": 3.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "The coffee tastes good!",
      "text": "As a retired science teacher, I love the look of the brewer and the fact that it is all glass no plastic. The taste of the coffee is an improvement over our standard brewer. This brewer has opened a new learning adventure; water temp, coffee grounds to water ratios and how to execute an pour over. Interesting and fun not to mention tasty.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Grosnick",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Randomly broke",
      "text": "Ours just broke randomly and for no reason, we have had it about a month ;( so for the price this totally sucked. Not sure if it happened from heat or what?",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Larger size is versatile",
      "text": "We love our new Chemex 10 cup coffee maker! For the two of us it is generous, so we need to adjust how much to make. The bigger size is great for serving guests too. The unbleached folder filters are amazing, giving the coffee a quality taste!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "We love to use it but has a few issues",
      "text": "The spout always drips a few drips of coffee. The glass is not very strong so be careful. It makes about 4 cups of coffee. We love using it, just wish they didn't break so easy.",
      "rating": 2.0,
      "verified": true,
      "author": "bearded love",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Exactly what I was hoping for!",
      "text": "Before buying the Chemex, I had been using a cheap two-cup French press and let me tell you my coffee now is worlds better! I used to get a residue of coffee grounds at the bottom of my glasses but since this item takes coffee filters it’s no longer an issue! The flavor is also much less dirty by comparison as the grounds aren’t pressed to the bottom steeping like tea. If you’re looking for a delicious cup of coffee with a bit of minimalism, this product is for you!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Elegant Coffee",
      "text": "Had this since November 2019 and I’m loving it. This is so easy to use for coffee! I love it! There is nothing negative to say about it. That’s a rarity these days.",
      "rating": 5.0,
      "verified": true,
      "author": "Dalya84",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Everything Chemex claims...it is.",
      "text": "This was everything Chemex claims it is. I have numerous pour over makers but I need one larger decanter that could handle three coffee drinkers and this large Chemex worked. I’ve had it one month with daily use and love the clean cup of coffee. I also use a French press when I’m in the mood for a stronger less refine coffee. But my new “go to” is the Chemex",
      "rating": 5.0,
      "verified": true,
      "author": "Roadguyser",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "MUST HAVE",
      "text": "This was purchased for my son for his Christmas present and he has been thrilled. It makes an exceptionally good cup of coffee! Seamless transaction. He is trying to figure out how to balance the coffee grinds to a smaller amount of coffee, but will figure it out. Excellent coffee maker",
      "rating": 5.0,
      "verified": true,
      "author": "Terri Locke",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "A bit of a learning curve, but can brew excellent coffee",
      "text": "A little bit of a learning curve to figure out how to use this, but after watching a few YouTube videos and practicing it a bit I think I'm starting to get the hang of it. I think the two most important factors apart from pour technique for a good brew are: pre-heating the glass with hot water so your brew holds its heat longer, and putting the thick side of the Chemex filter on the spout side of the funnel. With these things and some good coffee the Chemex can do magic",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20160607
    },
    {
      "title": "This is a nice pour over coffee maker and it makes very good ...",
      "text": "This is a nice pour over coffee maker and it makes very good coffee. Once you get a process down, it doesn't take any longer than any other coffee maker and I kind of like being actively involved in the coffee making process (my wife might disagree). One word of warning - even this relatively large 10 \"cup\" model is a fairly small volume - about four normal coffee mugs is the total capacity. So, if you are going to use it to replace a more conventional perk or drip coffee maker, you might want to go with a large model to have a comparable capacity.",
      "rating": 4.0,
      "verified": true,
      "author": "surffisher",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "Beautiful and simple in appearance and performance",
      "text": "Beautiful carafe. I purchased a titanium gold pour over coffee filter as well and am very pleased with the results. The same coffee in the keurig produces a more bitter and coarse coffee experience. I am pleased tio say that I am happy with both the appearance and performance of this pour over coffee carafe.",
      "rating": 5.0,
      "verified": true,
      "author": "txex",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Great coffee, relaxing pace",
      "text": "I had been making my coffee a Keurig for years using a My K-cup and just accepted the fines in the bottom of my mug. Finally, I decided to try filtering it and the coffee was so much better, duh. This sent me down the rabbit hole of trying to figure out how to make a better cup of coffee and enter the Chemex. My wife and I love this thing! It is not for those in a hurry. The extra time is worth the great cup of coffee. Beware, if you make a full \"pot\" of coffee it will cool quickly. So if you are against having to re-heat your coffee consider alternatives.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Durbin",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Our new daily drip....",
      "text": "Once we understood the correct ratio of beans to water, this turned amazing! We use 55 grams of fresh ground beans to about 980 grams of water for two sixteen ounce coffees. It's a great balance of flavors! We also buy the brown chemex filters to accompany this. Would absolutely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "CE Chia",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Way better than keurig, still prefer my saeco for convenience",
      "text": "I absolutely love my chemex, sure doesn't look big enough to hold 10 cups but I haven't actually measured yet, looks beautiful in my coffee bar though",
      "rating": 5.0,
      "verified": true,
      "author": "Zane Fairchild",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "No plastic aftertaste!!",
      "text": "It’s not your typical coffee maker, but it makes an amazing cup of coffee! Just be sure to use authentic Chemex coffee filters. I boil the water in my ceramic teapot and it goes through coffee and filter into this glass Chemex, no plastic parts involved like a typical coffee maker and you can really taste the difference!",
      "rating": 5.0,
      "verified": true,
      "author": "John C",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Smooth & top notch taste!",
      "text": "Love Chemex coffee, the copper filter & pour over lid! A great addition to my kitchen tools...only the best!",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn Himes",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Worth it!",
      "text": "Man we really debated making this switch but it is absolutely worth it! It takes me about 15 minutes to make a full pot of coffee but it’s SO tasty! I am no longer tempted to run out for coffee shop coffee. This is how coffee should taste!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Favorite",
      "text": "Stopped using “press & brew” maker years ago. Used to having 40oz/8cup, but had a crack so upgraded to this. So great. Best cup of coffee imo. Guests always agree",
      "rating": 5.0,
      "verified": true,
      "author": "C R",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Amazing cup of coffee",
      "text": "This is a replacement gift for my son. He had a 6 cup one that he absolutely loved until he knocked it over and broke it. I replaced it for him because he loves making coffee in this pot! He uses it daily.",
      "rating": 5.0,
      "verified": true,
      "author": "Carmen Zuniga",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Gets extremely heavy when even 1/2 full",
      "text": "Loved this at 1st. It is the large size that I needed and still is, as I will reorder it. But....... It is heavy when even 1/2 full and it just broke on me when slightly bumped in taking it out of the dishwasher. Shattered in many pieces and not a few as would be the case if it were tempered to not shatter. I thought this was tempered glass.",
      "rating": 3.0,
      "verified": true,
      "author": "CHBeule",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Glad I jumped on the bandwagon",
      "text": "Great aroma. Wish the filters weren’t so expensive. Love being able to keep the Chemex on a warm stove top",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "these coffee makers are the best, make great coffee but they are very fragile",
      "text": "these coffee makers are the best, make great coffee but they are very fragile. One bump and they shatter all over the place, still have a piece of one of them in my foot",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley M Lands",
      "helpful_votes": 3,
      "publication_date": 20170402
    },
    {
      "title": "Makes the Best Coffee",
      "text": "Have a had a Chemex for 40 years and still makes the best coffee. My last one broke and Received new one timely.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel W. Squires, Jr.",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "If you love pour over flavor this is a MUST!",
      "text": "Incredible flavor when you you use the right ratio of grounds to water. Beautiful display piece too. I love the clean lines and simple perfection of this vessel. Use this method when you are making several cups to be served at the same time. Otherwise, the coffee will cool fairly quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "J. A. Hall",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Simple and great",
      "text": "I love the simplicity of the pour over coffee Chemex. There is absolutely no way your coffee can't taste great. In the regular coffee pots a lot of time the coffee tastes bad due to the machine needing to be cleaned and even after cleaning the coffee still has a bad taste. The Chemex is so easy and there is nothing in the way of your coffee tasting great.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori Vallerga",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Unbelievable Difference",
      "text": "It is unbelievable how much better a pour over cup of coffee is compared to the standard cup of drip coffee. The Chemex glass coffee maker is high quality as you can tell by the density of the glass, and it feels sturdy. No feeling like you might break it at any time. Has changed my mornings as my coffee's quality is out of this world. Thank you Chemex! A++ product",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Graves",
      "helpful_votes": 0,
      "publication_date": 20161010
    },
    {
      "title": "An excellent, reliable product.",
      "text": "After some 50 years of use, my first Chemex did not survive packing and unpacking during our remodeling. Needless to say, I had to replace it immediately. It is one of several different types of coffee makers I use. It makes consistently good coffee and has a beautiful presentation.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Makes great coffee with a little patience",
      "text": "An older method of making coffee, but still a good one. Chemex, or pour over, makes a smooth and clean cup. If you follow the instructions, you will end up with a crisp cup of coffee. The pot feels thin, and fragile, but I've bumped a number of times without anything more than a glassy ringing. The wood and leather holder work well, look pleasant, and are well sealed. The pot pours smoothly, with the spout shaping a nice stream that does not splatter. Something that always annoyed me when using the Bodum version of the same pot.",
      "rating": 5.0,
      "verified": true,
      "author": "Irrevocable Trust",
      "helpful_votes": 0,
      "publication_date": 20120119
    },
    {
      "title": "Not as I had hoped",
      "text": "Will be returning. Did not like coffee flavor or the fact container is too hot to pour first cup.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Schnell",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Very good",
      "text": "Nice, easy way to make a really good pot of coffee. I order a gold coated titanium cone to use instead of the paper filters (that notoriously break on me when I remove from the pot) and a little glass lid to keep the heat in. Works GREAT!",
      "rating": 5.0,
      "verified": true,
      "author": "ABS",
      "helpful_votes": 2,
      "publication_date": 20170410
    },
    {
      "title": "Great product",
      "text": "Love this product use it every morning. Even my husband can make coffee now as long as I get everything ready.",
      "rating": 5.0,
      "verified": true,
      "author": "ina320",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "A must have for coffee and design lovers alike",
      "text": "As a coffee drinker throughout the day, I have found this to provide a good amount of coffee for two people. The filters are specifically made to filter out the bitterness out of the grounds which makes very good coffee. Not being a black coffee drinker, in a pinch, I have found this coffee to be good without any milk or creamer. It is that good. The design is amazingly perfectly created as the coffee streams straight down the stream like cutout on the carafe, pouring directly down without spilling over the sides. Very pleased with this product. Well done, Chemex!",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny N",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Good coffee.",
      "text": "Love the coffee -- it's probably their filters that make the difference, though. Would give 5 stars, but the thing is so thin I'm afraid I'll break it when I wash it. And the wooden handle, while kinda cool and retro, is a pain to get on and off.",
      "rating": 4.0,
      "verified": true,
      "author": "DiscerningCustomer",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Filters???",
      "text": "Not sure how good the coffee is...Yet! Could very well be 5-star. However, I’m unable to use it until my filters (delivered separately) are delivered in 5 days. Would it kill Chemex to include a few sample filters with the brewer??? Would go a long way to increasing customer satisfaction. Cheap move if I’ve ever seen one!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Joe Pennino",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Not the same...",
      "text": "I’ve had a chemex for 5+ years and mine broke recently (my fault) so I replaced it. The glass is definitely noticeably thinner and the wooden collar is coming apart, right out of the box. I do really love chemex coffee, so I am going to continue to use it, but I’m wondering now how long it’s going to last.",
      "rating": 3.0,
      "verified": true,
      "author": "kyle",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Great value",
      "text": "Still learning how to use this, but for the most part I like it. I bought the coffeesock to go with it, I feel like it takes away from the flavor and the oils. I do normally use a French Press, so the full body and flavor is there. Overall I like the product and definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Meagen Kincaid",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Great",
      "text": "What can I say it’s chemex. It’s great I recommend getting a reusable metal filter.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Best cup of coffee",
      "text": "Just remember to pour the a little water, slowly, and let the beans bloom before adding the rest. It's like decanting but for coffee.",
      "rating": 5.0,
      "verified": true,
      "author": "Chicken Sammich",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Excellent. Will order again as gift",
      "text": "Excellent product. Brand new. Perfect. I will be buying it again for gifts. I just love it",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Nielsen ",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Better (much) than French Press!",
      "text": "I love this thing makes the best coffee! I use it religiously on the weekend with fresh ground beans makes 10 5oz cups with 50oz of 200 degree water. Takes a little while but worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Bellouny",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "Back for more...",
      "text": "This is actually our second Chemex pour-over purchase, as our first one lost a fight with the countertop. *tears* We had the first one for years and, although it is not our main coffee maker, we loved using it. We will just be a bit more careful with this one!",
      "rating": 5.0,
      "verified": true,
      "author": "950sew",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Love it",
      "text": "Works super well. Able to make multiple cups or just one. Easy to clean",
      "rating": 5.0,
      "verified": true,
      "author": "Kera",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Cynical at first",
      "text": "Bought this coffee maker with a closed mind, but decided to give it a try after reading the thousands of glowing reviews I read on-line, plus the price wasn't too high if I ended up hating it. Well, after giving it a try- I love it and can totally tell the difference in taste. Like everyone else said- the magic is in the coffee filters and there is no more bitterness to your coffee! The only drawback is the time it takes to make, but if you have the time it's totally worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Maddely",
      "helpful_votes": 0,
      "publication_date": 20110110
    },
    {
      "title": "Love Chemex Coffee!",
      "text": "This was a replacement for the one we broke. Chemex coffee is great and have never gone back to drip, the flavor is so much better!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Coffee at its best!",
      "text": "Have used a chemex for many years with great satisfaction. I've tried other coffee makers but not one compared to the flavor received using a chemex.",
      "rating": 5.0,
      "verified": true,
      "author": "Audrey Blaney",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "excellent way to brew coffee",
      "text": "It brews an excellent 10 cups of coffee. This is well made and durable. I have no complaints and use it every morning.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Proctor",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Love love love the Chemex my 8 cup broke (our ...",
      "text": "Love love love the Chemex my 8 cup broke (our fault) and needed one right away and to find a 10 cup made my Hubby and I even happier!! Would have taken days to order through other stores lucky and so happy Amazon had it on prime 😃Esp the 10 cup!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Clean Brew",
      "text": "Everything we'd hoped for, although it would be nice to find a warmer tray that fits. Glad we purchased this unit, and would recommend to others.",
      "rating": 5.0,
      "verified": true,
      "author": "cappy102",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Delicious coffee every time!",
      "text": "This carafe has been a staple in my kitchen for decades. Its easy drip system delivers full-bodied, delicious coffee every time.",
      "rating": 5.0,
      "verified": true,
      "author": "trees",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Best coffee maker",
      "text": "Excellent buy. I definitely prefer pour over to the other brew methods I've used. This Chemex is large enough to fill my coffee mug and have plenty for my wife's morning coffee as well. I would probably buy the glass top for this if you plan to have multiple cups without transferring to a travel mug.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "My favorite way to brew coffee! (and I work in the specialty coffee industry)",
      "text": "The Chemex is hands down my favorite way of brewing coffee. I own a vac pot, aeropress, espresso machine, French press, and an ice brewer - the Chemex shines above them all. I love how clean yet loud the coffee flavor is. I also like how the Chemex acts like a decanter and cools the coffee just slightly so it is right in it's peak flavor zone with the first sip. A must buy! Be sure to avoid the natural filters, they leave terrible notes of cardboard (even after a good rinse).",
      "rating": 5.0,
      "verified": true,
      "author": "T. Vincent",
      "helpful_votes": 3,
      "publication_date": 20100518
    },
    {
      "title": "This is a replacement for our old same model which ...",
      "text": "This is a replacement for our old same model which broke. The new one appears to be much lighter the the old one. I am assuming there has been a change in production and am hoping it holds up.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170926
    },
    {
      "title": "Love Chemex!",
      "text": "I needed a larger Chemex to make more coffee when entertaining. The 6 cup is my daily use version, but sometimes need a little more.",
      "rating": 5.0,
      "verified": true,
      "author": "gEoFFTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Life changing!",
      "text": "I have been thinking for a while about getting a Chemex. Was using a French press and was happy with that. Soooo glad I made the move! Was worried it would be time consuming, but I have found that to be not at all true. Best coffee ever. Life changing",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy Bishop",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Wonderful coffee maker",
      "text": "My husband and I both love the Chemex Coffee Maker. We were tired of drinking coffee that was brewed in plastic, and that was often too bitter or acidic. Chemex takes care of both concerns. The coffee is smooth and delicious, so it is worth the slightly longer time it takes to make. The beautiful glass design also looks far more attractive and takes up less space on our kitchen counter than our old ugly plastic auto drip maker did. The unbleached square filters are an absolute must for perfect coffee and easy cleanup.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy",
      "helpful_votes": 0,
      "publication_date": 20110101
    },
    {
      "title": "Outstanding coffee in a beautiful brewer!",
      "text": "I LOVE this product. With Chemex filters, this pot makes the most delicious, rich cup of coffee I have ever had, and uses considerably less ground coffee than other coffee makers use too! I grind my beans just prior to brewing, and take it black, so second-rate coffee need not apply. This purchase did not disappoint!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20160201
    },
    {
      "title": "Makes the best coffee I have ever tasted",
      "text": "Was unsure about this coffee maker, but wanted coffee without plastic. Makes the best coffee I have ever tasted. Definitely worth the \" hands on\" work of pouring water over grounds. Takes a little longer, but results definitely worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Elisabeth K. Thoma",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "Beautiful",
      "text": "I almost purchased at a coffee shop but it was a little cheaper here. It arrived in a box and just as expected !",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia A",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Love my 10x chemex",
      "text": "I loved my 6 cup chemex until my significant other broke it in a freak cleaning accident. In my opinion the 10 cup not only holds more coffee but is better designed and I think the glass might be a little thicker. I hope this prevents future cleaning accidents 🤞",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Henry",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "better than coffee machine",
      "text": "I like it... the only thing i recommend is go buy the filters at the store. If you search on google, you can find where they are sold. I got mine at bed bath and beyond and it was only about 8 or 9 dollars for a 100 pack. On amazon, they seem really expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "Sab",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "Very recommend",
      "text": "The best coffe I ever tasted, is and original product, is just like the pictures and looks great quality",
      "rating": 5.0,
      "verified": true,
      "author": "ALEJANDRA G.",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Best  Cuppa Coffee",
      "text": "What a great cup of coffee!! It takes longer than a Keurig (no surprise), but is worth the effort. The carafe is beautiful, and stays warm on the stove.",
      "rating": 5.0,
      "verified": true,
      "author": "MikiSway",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Best coffee EVER!",
      "text": "Got rid of my Keurig finally, this thing is just as fast and makes far superior coffee. Nothing more to say.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Thompson",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Best Coffee Ever",
      "text": "I love this product, we used to have a Bunn and the coffee always had a plastic taste, but with the Chemex, our coffee is now bold and flavorful. This is definitely more time consuming then other methods, but in my opinion it is worth it. Highly recommend if you like good coffee.",
      "rating": 5.0,
      "verified": true,
      "author": "Christie",
      "helpful_votes": 0,
      "publication_date": 20160424
    },
    {
      "title": "Timeless piece that makes amazing coffee",
      "text": "Have had this for about a week now and it has made some of the best cups of coffee I have had to date. I paired a reusable filter and hand grinder and am extremely happy with the quality and the process that goes into making a cup of coffee.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott McCumber",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "This thing make the best pot of coffee I have enjoyed",
      "text": "This thing makes the best pot of coffee I have enjoyed, and I am a lifelong java drinker Thought the french press was awesome (and it is) but this has topped my expectations",
      "rating": 5.0,
      "verified": true,
      "author": "BR",
      "helpful_votes": 0,
      "publication_date": 20170812
    },
    {
      "title": "Amazing",
      "text": "This is the first ever review that i have bothered writing ever since i started ordering items through amazon. It redefined the way I enjoy my coffee everyday. I am a coffee fanatic but not at the professional dig deep research level but ever since I started using chemex it opened how wonderful a cup of coffee can be. No hassle clean up and an enjoyable experience brewing coffee. I recommend this to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Best Coffee Pot IN THE WORLD",
      "text": "I love this coffee pot. I got one as a wedding present in 1974 and I have loved it ever since. It makes the best coffee ever. I highly recommend it",
      "rating": 5.0,
      "verified": true,
      "author": "DOC KASS",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "This makes amazing coffee",
      "text": "1) buy a chemex 2) buy the filters 3) buy good coffee 4) brew and enjoy",
      "rating": 5.0,
      "verified": true,
      "author": "leslie b",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "but I do think the effort pays off in better coffee.",
      "text": "It's a little bit more work than a drip machine, but I do think the effort pays off in better coffee.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170815
    },
    {
      "title": "Better than expected",
      "text": "Broke old one. This one is bigger and better than last.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Wonderful coffee maker",
      "text": "I held some trepidation when I ordered this coffee maker but, after I received, it it does indeed make great coffee.",
      "rating": 4.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "My dad loves it",
      "text": "My dad asked for this specific coffee pour over because it looks cool and is a better quality than the others he looked at. So I bought it for his birthday. He absolutely loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Misty",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Best coffee maker",
      "text": "This coffee maker is just what I expected. I love it best for my Black Rifle Coffee. Just remember it is a pour over the top you will need a kettle and it obviously will be a little slower than an automatic coffee maker.",
      "rating": 5.0,
      "verified": true,
      "author": "brian s",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "it takes longer to make your coffee but you get such a better tasting coffee than the K-cups and regular coffee maker",
      "text": "We've had this for a little over a month and are completely converted into coffee snobs. Yes, it takes longer to make your coffee but you get such a better tasting coffee than the K-cups and regular coffee maker. Just update your morning routine to include a little more time and this is the best!",
      "rating": 5.0,
      "verified": true,
      "author": "GTJules99",
      "helpful_votes": 0,
      "publication_date": 20150904
    },
    {
      "title": "Great for pour-over coffee.",
      "text": "Got it as a gift for my husband, he really likes it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer R.",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Best way to make coffee.",
      "text": "This is our second time buying this for us! We ha e pitched many of theses as gifts! It’s the only way we make coffee now. I suggest using the brown filters not white.",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor Antone",
      "helpful_votes": 0,
      "publication_date": 20200108
    }
  ],
  "product_meta": {
    "title": "CHEMEX Classic Series, Pour-Over Glass Coffeemaker, 10 Cup - Exclusive Packaging",
    "description": "Color:Clear\n\nInvented in 1941, CHEMEX has been brewing perfect filtered coffee for generations. Its iconic hour glass shape is so beautiful, it can be found in some of the most prestigious museums worldwide. Its design, timeless and functional, has never been altered. The perfect blend of art and science, simple to use and extraordinary results. Accept no imitations.\nThe CHEMEX carafe is made from non-porous, tempered borosilicate glass - like that used for labware. Therefore it is totally pure, imparting no flavors of its own and is also resistant to thermal shock. The Chemex can be used for brewing both hot and iced beverages, including coffee and tea.\n\n\nThe Ten Cup Classic Series used together with the scientifically designed, patented CHEMEX® Bonded Filters, will guarantee that our pour over brewing process will deliver the perfect cup of coffee, without any sediments or bitter elements.\n\nIncludes a polished wood collar with leather tie.\n\nCapacity: 50 Ounce\nHeight: 9 1/4\"\nDiameter: 5 1/8\"\nItem: CM-10A",
    "rating": 4.8,
    "feature_bullets": [
      "CHEMEX - simple, easy to use with timeless, elegant design",
      "All CHEMEX Coffeemakers are made of the highest quality, non-porous Borosilicate glass which will not absorb odors or chemical residues",
      "The patented CHEMEX pour-over design allows coffee to be covered and refrigerated for reheating without losing flavor",
      "All CHEMEX Coffeemakers are measured using 5 oz. as 1 cup",
      "Use CHEMEX Bonded Filters FP-1, FC-100, FS-100, FSU-100"
    ],
    "specifications": {
      "Product Dimensions": "9.7 x 6.4 x 0.7 inches",
      "Item Weight": "11.2 ounces",
      "Manufacturer": "Chemex Coffee Maker",
      "ASIN": "B000NTMHRW",
      "Item model number": "CM-10A",
      "Customer Reviews": "4.8 out of 5 stars914 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#13,377 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 27, 2007"
    },
    "categories": [
      "Home & Kitchen",
      "Coffee Makers",
      "Coffee, Tea & Espresso",
      "Coffee Machines",
      "Kitchen & Dining"
    ],
    "price": 45.13
  }
}