{
  "website_summaries": [
    {
      "verdict": "A good choice for those who like the idea of the ventilation slats, but others we tested are better options for smaller shoes.",
      "pros": [
        "Made of solid cedar and available in 5 sizes",
        "Stands out for having ventilation slats that help keep shoes dry",
        "Rugged design"
      ],
      "cons": [
        "The heel unit is a bit large and might not accurately fit smaller shoes"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Size is too small and the curvature of the shoe trees does not provide a good fit",
      "text": "I bought these shoes trees to protect the longevity of my Allen Edmonds dress shoes. I checked to make sure that these shoe trees were the right product for the dress shoes model and checked the size (8.5 / D) against the sizing chart. While the chart said that it would be borderline but to get a Small, I definitely think that a Medium is a better fit as the shoe tree is very tight inside the shoe. I also don't think that the curvature of the shoe trees provide a great fit. While I had high hopes buying the Manufacturer's product, I think I may have been better off just buying a third party's rendition.",
      "rating": 2.0,
      "verified": true,
      "author": "William Chen",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Keeps Shoe Leather Smooth and Like New",
      "text": "The shoe trees fit very well and really helps undo the leather creases from daily wear. I have the medium shoe tree and use it in a size 11B shoe - per the Allen Edmonds Tree Sizing Chart. The cedar is well shaped and does have the aromatic smell as expected. The heel and toe sections are connected by a black metal rod. Great overall!",
      "rating": 5.0,
      "verified": true,
      "author": "Guy Zoghby",
      "helpful_votes": 0,
      "publication_date": 20160710
    },
    {
      "title": "Not a perfect fit for AE shoes; not well-finished",
      "text": "I picked the Full Toe model for my recently purchased Allen Edmonds Fifth Avenue Cap Toe because the product description said it is was designed specifically for AE shoes. But when inserted, it could not fully occupy the shoe's entire width. I tried using AE Combination which I bought supposedly for my non-AE shoes and it was a better fit because the width of AE Combination widens upon entry in the shoe unlike the Full Toe which is fixed. Moreover, the cedar wood was not well-finished as there are splinters and sharp edges within the two slits that I had to smoothen it with sandpaper.",
      "rating": 3.0,
      "verified": true,
      "author": "sct27",
      "helpful_votes": 2,
      "publication_date": 20140916
    },
    {
      "title": "Use the AE size guidelines!  Comes with two individual trees: one for L, one for R",
      "text": "These Medium shoe tree fits my Madison Park Oxford wingtips (size 10D) perfectly. The fit is more snug than the AE Medium 'Combination' shoe trees, which I purchased for a separate pair of Edmonds. Let me also clarify some of the vagueness of the picture and above description. This product comes as a matched pair -- not a single tree for one shoe. Amazon should update the picture and description accordingly to avoid confusion.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Berg",
      "helpful_votes": 0,
      "publication_date": 20160511
    },
    {
      "title": "Its like a wooden foot for your shoe or something more clever than that.",
      "text": "I wanted to get one pair to try in my Allen Edmonds and of course they are great. They smell nice, fit the shoe well to ensure they will keep their shape over the term of ownership.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared The Geek",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Easy to get in an out and a good cedar ...",
      "text": "I have 9.5EEE Allen Edmonds shoes and this fits perfectly in them (Medium). Easy to get in an out and a good cedar smell.",
      "rating": 5.0,
      "verified": true,
      "author": "SS 56",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Perfecto!",
      "text": "I only wear my Tuxedo shoes a couple of times a year, and I worry about them getting crushed in between. I'm a size 14, so the XXL barely fit, but that's what I wanted. I cleaned the shoes, put these in, then slid them into old cotton socks to keep dust off and put them away. My only concern is a small one, there did appear to be a couple of spots where sap was coming out of the wood...I'm hoping there's not enough to damage the leather.",
      "rating": 5.0,
      "verified": true,
      "author": "HARRISON",
      "helpful_votes": 0,
      "publication_date": 20130424
    },
    {
      "title": "Not like they used to make it",
      "text": "This shoe tree works fine, but the shaft that connects the top to the bottom is made of plastic. Other Allen Edmonds shoe trees that I purchased in the past had a metal shaft, so I do have concerns of this plastic breaking at some point considering that it is under constant pressure.",
      "rating": 3.0,
      "verified": true,
      "author": "FighterHayabusa",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Great wood and solid construction.  Fit could be better.",
      "text": "Very nice rich cedar. But even though I am using the recommended size in an Allen Edmonds shoe it doesn't fit as snug as an expanding toe model. I prefer the snug fit in order to help when shining my shoes.",
      "rating": 4.0,
      "verified": true,
      "author": "Stubb",
      "helpful_votes": 0,
      "publication_date": 20160809
    },
    {
      "title": "A Must Have",
      "text": "Fits the AE Strands perfectly and help keep the shape. Also helps neutralize any odors. You can sometimes find these on sale for as low as $10. Apparently Jos A Bank sell the identical shoe trees with a different badge.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Lafond",
      "helpful_votes": 0,
      "publication_date": 20160102
    },
    {
      "title": "Good",
      "text": "Fits great. Has the strong cedar smell that reminds me of that chest where grandma keeps wool sweaters. I still haven't decided if this style with a single toe piece is better or worse than the split toe style of shoe tree.",
      "rating": 5.0,
      "verified": true,
      "author": "I. Travel",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "Shoe tree",
      "text": "A quality made shoe tree, with fresh smelling Cedar wood and made in US. They forgot to mention automatic spring adjustment that would make finding your size just a little less worrisome. I am a 101/2 D and a large fits great. I wish it was cheaper but then it would be foreign made and being from the US is worth it. I now have 3 of them and will put them on my wish list for birthdays and etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 0,
      "publication_date": 20130617
    },
    {
      "title": "Shoe trees for your new AE shoes  are a must!",
      "text": "If you own Allen Edmonds shoes, this is a MUST. Keep your shoes looking good for many years with AE shoe trees.",
      "rating": 5.0,
      "verified": true,
      "author": "Somer Teleo",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Four Stars",
      "text": "Great spring-loaded action. Wish the toe part was a bit taller.",
      "rating": 4.0,
      "verified": true,
      "author": "trailmug",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Shoe Tree for Allen Edmonds Shoes",
      "text": "I bought two pairs of Allen Edmond Shoes and I ordered 2 pairs of Shoe Trees from Shoe Trees Marketplace (Not Allen Edmonds but a different Brand). The Shoe Trees were very small, the original Allen Edmonds Shoe Trees fit perfect on Allen Edmond Shoes. Do not waste your time with different Brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Juangram",
      "helpful_votes": 0,
      "publication_date": 20131227
    },
    {
      "title": "Fit like a glove",
      "text": "These are very nice shoe trees. They fit my shoes perfectly as I would expect. I have other trees from generic sources that aren't as nice and don't fit my Allen Edmonds shoes as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan",
      "helpful_votes": 0,
      "publication_date": 20160705
    },
    {
      "title": "Worth it if you have quality shoes you want to maintain.",
      "text": "If you own a nice pair of leather shoes. This is a must. Keeps the fit, keeps out the wrinkles. The cedar wood is also a great, who doesn't love the smell of cedar? The spring inside keep the shoe stretched, so if you shoes are not fully broken in yet, this seems to help break them in.",
      "rating": 5.0,
      "verified": true,
      "author": "W. G",
      "helpful_votes": 3,
      "publication_date": 20121225
    },
    {
      "title": "Worth the price for the smell alone",
      "text": "Great product - well-made and reasonably priced, especially once you consider the cost and longevity of AE's product. I'm buying a second pair. Did I mention they smell amazing?",
      "rating": 5.0,
      "verified": true,
      "author": "IFK",
      "helpful_votes": 0,
      "publication_date": 20150604
    },
    {
      "title": "a must have for quality shoes",
      "text": "these are shoes - its a shoe tree I like it - it fits my shoes well and keeps them from creasing too much a much have for quality shoes",
      "rating": 3.0,
      "verified": true,
      "author": "Buyer of Product",
      "helpful_votes": 0,
      "publication_date": 20151214
    },
    {
      "title": "Terrific Product -- Made in USA",
      "text": "Bought to replace some cheap Chinese made shoe trees I had previously been using with my Allen Edmonds shoes. These are made in the USA and fit my shoes perfectly. Obviously higher quality, and really fills out the toes a lot better than a cheaper split toe tree. Very impressed. Wish I had bought them earlier.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike M.",
      "helpful_votes": 2,
      "publication_date": 20101209
    },
    {
      "title": "Made in USA, Excellent product",
      "text": "Medium fits 9.5 men's shoe perfectly. Made in USA. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Raimu II",
      "helpful_votes": 0,
      "publication_date": 20160410
    },
    {
      "title": "It's A Shoe Tree. It's fine. Doesn't Feel As Substantial as the ones I bought in 1985.",
      "text": "It's A Shoe Tree. It's fine. It doesn't feel as substantial as the ones I bought in 1985. I prefer this full-piece toe over the Allen Edmonds split toe. I also prefer this full back piece with the handle, over the shoe trees that have a long rod, with a leather pull.",
      "rating": 4.0,
      "verified": true,
      "author": "RSC - Nyack, NY",
      "helpful_votes": 0,
      "publication_date": 20130125
    },
    {
      "title": "My favorite cedar shoe trees",
      "text": "My favorite cedar shoe trees. I have 5 or 6 of them. They work perfectly and are easy to use / put in place.",
      "rating": 5.0,
      "verified": true,
      "author": "Acitizen",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "Shoe tree arrived split in half, but good product.",
      "text": "I am very pleased with what I received, and it fits my size 8 Liverpools beautiful. The smell is very strong in all the best ways. The only dissatisfaction I have is that one of the shoe trees I received was split in half. It is all that it is advertised, aside from That!",
      "rating": 3.0,
      "verified": true,
      "author": "Wardaddy",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Best of breed",
      "text": "I've tried a number of shoe trees and these are by far the best products that I've come across. The construction at the joints is superb and strong, the foot of my shoes is well filled, and removal is easy because of the tab on top of the heel. Sizing was perfect for me as and described.",
      "rating": 5.0,
      "verified": true,
      "author": "nycebo",
      "helpful_votes": 7,
      "publication_date": 20080331
    },
    {
      "title": "Best cedar shoe tree",
      "text": "It is one of the best wood shoe tree, it fits most shoe styles eliminating moisture and lengthen the life of shoes and recently I discover when the cedar aroma is lost sanding it with fine sandpaper will help the cedar aroma to return.",
      "rating": 5.0,
      "verified": true,
      "author": "frsf",
      "helpful_votes": 0,
      "publication_date": 20140306
    },
    {
      "title": "Bueno",
      "text": "I only buy Allen Edmonds shoe trees after trying many other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "George T. Peters",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "I have 8. 5 EEE and I ordered medium ...",
      "text": "I have 8.5 EEE and I ordered medium. It fits, but it will have to force its way in.",
      "rating": 4.0,
      "verified": true,
      "author": "mingi",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "Fantastic. As always",
      "text": "Fantastic. As always, Allen Edmonds quality is second to no one. These are sturdy and well made. They do wonders keeping shoes the correct shape. I use them in my Park Avenues and Nemouks. They fit tight and smell great too.",
      "rating": 5.0,
      "verified": true,
      "author": "nick",
      "helpful_votes": 0,
      "publication_date": 20151229
    },
    {
      "title": "Very good Cedar Shoe Tree",
      "text": "These are well made and smell very nice. They fit my Allen Edmonds shoes very well as expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua A. Nehlig",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "Three Stars",
      "text": "There's a white stony powder all over the product -and spring is tight. Not happy",
      "rating": 3.0,
      "verified": true,
      "author": "Quintin Paredes",
      "helpful_votes": 0,
      "publication_date": 20160209
    },
    {
      "title": "Five Stars",
      "text": "Great they fit my Strand 10.5 EEE perfectly. Smell great !",
      "rating": 5.0,
      "verified": true,
      "author": "Twil",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "Great craftsmanship.",
      "text": "Was exactly what I was looking for to go with my new Allen Edmonds. Going to get another pair on both shoes and trees.",
      "rating": 5.0,
      "verified": true,
      "author": "Raybina",
      "helpful_votes": 0,
      "publication_date": 20151104
    },
    {
      "title": "Fit my AE Leeds size 7E perfectly. There finishing ...",
      "text": "Fit my AE Leeds size 7E perfectly. There finishing could be improved as rough edges and splinters were found which I touched up accordingly.",
      "rating": 5.0,
      "verified": true,
      "author": "dyiong",
      "helpful_votes": 0,
      "publication_date": 20150531
    },
    {
      "title": "Quality Shoe Tree",
      "text": "Shoes look and feel great after using. Easy to insert feel/look well made.",
      "rating": 5.0,
      "verified": true,
      "author": "2Bark",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "Good product.",
      "text": "Arrived quickly. True to size. Do the job of keeping shoes looking good. Would definitely purchase again. Smell great and hold shape. Non-adjustable front worked good.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Roelant",
      "helpful_votes": 0,
      "publication_date": 20131010
    },
    {
      "title": "Great Quality, Great Value",
      "text": "Works well to keep the form of my Johnston and Murphy cap toe balmoral's. Keeps that fresh cedar smell for longer than other shoe tree's I've used. Fit is pretty much on the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Troy M",
      "helpful_votes": 0,
      "publication_date": 20151215
    },
    {
      "title": "smells nice and keeps the creases / wrinkles",
      "text": "Shoe trees for my AEs, no complaints, smells nice and keeps the creases / wrinkles away",
      "rating": 5.0,
      "verified": true,
      "author": "bill vuong",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "Great Shoe Trees",
      "text": "These Allen Edmond shoe trees are great. I love the smell of cedar. They fit my shoes perfectly. They are worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Franklin",
      "helpful_votes": 0,
      "publication_date": 20141012
    },
    {
      "title": "Five Stars",
      "text": "Worked perfect! Although I believe they can be had directly through Allen Edmonds for cheaper.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin McNamara",
      "helpful_votes": 0,
      "publication_date": 20150929
    },
    {
      "title": "Perfect!",
      "text": "This fit perfectly in my pair of Allen Edmonds Park Avenues. They are indispensable for maintaining the beauty and extending the life of these rather expensive shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Todd",
      "helpful_votes": 0,
      "publication_date": 20130113
    },
    {
      "title": "perfect!!",
      "text": "I have 3 sets of these and they work spectacular. Saves my investment in shoes",
      "rating": 5.0,
      "verified": true,
      "author": "mafrentress",
      "helpful_votes": 0,
      "publication_date": 20150913
    },
    {
      "title": "Five Stars",
      "text": "the size \"small \"fits a size 8 show very well",
      "rating": 5.0,
      "verified": true,
      "author": "A J",
      "helpful_votes": 0,
      "publication_date": 20160504
    },
    {
      "title": "As described. Make sure you use the shoe chart ...",
      "text": "As described. Make sure you use the shoe chart on Allenedmonds.com",
      "rating": 5.0,
      "verified": true,
      "author": "Godric",
      "helpful_votes": 0,
      "publication_date": 20151113
    },
    {
      "title": "A good shoe tree.",
      "text": "This is a good cedar shoe tree, but I recommend the woodlore epic twin tube shoe tree available here on Amazon. I had the wood split on one of the shoe trees where I used the handle to pull it out of my shoe, and had to super glue it back on. The heel can be a little more narrow than the style I recommended, which puts undue stress on the heel of the shoe when storing it .",
      "rating": 3.0,
      "verified": true,
      "author": "Wes Charles",
      "helpful_votes": 8,
      "publication_date": 20120316
    },
    {
      "title": "Four Stars",
      "text": "I'm pretty sure I ordered large, but the ones I received are too wide and longer than the shoes",
      "rating": 4.0,
      "verified": true,
      "author": "Gregory E.",
      "helpful_votes": 0,
      "publication_date": 20160924
    },
    {
      "title": "Five Stars",
      "text": "Great cedar shoe tree, a must need for any good leather shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "John sparks",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Awesome",
      "text": "These cost a bit more but are well worth the cost. More stable and great quality. There is not a better one in the market.",
      "rating": 5.0,
      "verified": true,
      "author": "Love her",
      "helpful_votes": 0,
      "publication_date": 20131228
    },
    {
      "title": "Exactly the same as AE",
      "text": "Sometimes these will be cheaper here and sometimes the AE sale is cheaper but always the same quality I've come to expect.",
      "rating": 4.0,
      "verified": true,
      "author": "RF",
      "helpful_votes": 0,
      "publication_date": 20140208
    },
    {
      "title": "PICTURE COLOR IS NOT ACCURATE",
      "text": "Picture shows silver emblem and connector - which is what I wanted. Arrived and it was bronze.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian S. Curry",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "10/10 Excellent for my size 8 regular Allen Edmunds Copley",
      "text": "I got these at the same time when I got my Allen Edmonds Copley dress shoes. This size small fits perfectly into my size 8R. If you got shoes that are 8 and smaller, this size is it. Great cedar smell and great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Li",
      "helpful_votes": 0,
      "publication_date": 20100207
    },
    {
      "title": "It is what it is!!",
      "text": "I bought an AE wingtip in my size that was just so uncomfortable but with this guy working overnight and my new wool english socks I am happy again with my wingtips!!",
      "rating": 5.0,
      "verified": true,
      "author": "Win Win",
      "helpful_votes": 0,
      "publication_date": 20130516
    },
    {
      "title": "Five Stars",
      "text": "Great quality and they do what they are suppose to do.",
      "rating": 5.0,
      "verified": true,
      "author": "RD",
      "helpful_votes": 0,
      "publication_date": 20151111
    },
    {
      "title": "Five Stars",
      "text": "Appear to be well made and should last a long time",
      "rating": 5.0,
      "verified": true,
      "author": "JeffH",
      "helpful_votes": 0,
      "publication_date": 20151003
    },
    {
      "title": "Why would you buy Shoe Trees?",
      "text": "If you have used different shoe trees and were dissatisfied, let me tell you about the Allen Edmonds Trees. If you have had trees break, bend, or which were simply too wide to fit your shoes, try these. The Allen Edmonds Full Toe Cedar Shoe Tree smells like cedar just like the name says. They fit my shoes perfectly and are obviously made to last. They are intended for people who care about their shoes enough to spend a little more and do the job. If there was a \"10\" on this scale, they would get it. As my other trees fail, I will replace them with Allen Edmonds.",
      "rating": 5.0,
      "verified": true,
      "author": "My Opinion",
      "helpful_votes": 0,
      "publication_date": 20140107
    },
    {
      "title": "Good product to keep your allen edmonds shoes in tip ...",
      "text": "Good product to keep your allen edmonds shoes in tip top shape. Easy to use, can't complain. They function as expected",
      "rating": 5.0,
      "verified": true,
      "author": "Book dude",
      "helpful_votes": 0,
      "publication_date": 20150805
    },
    {
      "title": "Fits",
      "text": "The shoe trees fit my husband's size 11 Allen Edmonds shoes. They smell nice and seem sturdy. Seems like they will last",
      "rating": 5.0,
      "verified": true,
      "author": "Sami",
      "helpful_votes": 0,
      "publication_date": 20130826
    },
    {
      "title": "they don't fit correctly.",
      "text": "they don't fit correctly. they are too big for my shoes and i got the small.",
      "rating": 3.0,
      "verified": true,
      "author": "Chase",
      "helpful_votes": 0,
      "publication_date": 20150626
    },
    {
      "title": "Does its job",
      "text": "It's a nice shoe horn, easy to put in and remove. No finish on it allows it to absorb sweat. Fits my Allen Edmonds shoes well.",
      "rating": 5.0,
      "verified": true,
      "author": "Bence T",
      "helpful_votes": 0,
      "publication_date": 20130625
    },
    {
      "title": "Cedar Shoe Tree",
      "text": "These are very sturdy shoe trees. The shoe trees are pricey so I will see how they perform over the years.",
      "rating": 5.0,
      "verified": true,
      "author": "Bernie",
      "helpful_votes": 0,
      "publication_date": 20140211
    },
    {
      "title": "good fit",
      "text": "Works well. Bought second pair. Keeps boots in shape and dry. Use them everyday to deodorize shoes and dry them out.",
      "rating": 5.0,
      "verified": true,
      "author": "Korner Man",
      "helpful_votes": 0,
      "publication_date": 20130801
    },
    {
      "title": "Does what it is designed to do.",
      "text": "Excellent shoe tree that does exactly what it's supposed to do--keeps my Allen Edmonds fresh and looking great!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Haney",
      "helpful_votes": 0,
      "publication_date": 20150129
    },
    {
      "title": "Excellent",
      "text": "These shoe trees are supposed to be perfect for allen edmonds shoes. I have a couple pairs of shoes, and it is my understanding that shoe trees keep the shoes looking better longer. I can tell you that proper care keeps you shoes looking better longer. Shoe tree, regular polishing, and not wearing the shoes everyday day after day makes a huge difference. These are perfect, they fit my 13 size shoe, and I have a pair for each pair of shoes I own. Definitely reduces creasing.",
      "rating": 5.0,
      "verified": true,
      "author": "DIY Home Mechanic",
      "helpful_votes": 0,
      "publication_date": 20130622
    },
    {
      "title": "Nice Product",
      "text": "I use these in my dress shoes and boots. They are very well made, although the spring takes a little while to loose up at first to compress them enough to get in you shoes. Overall great product. I would recommend these to a friend.",
      "rating": 4.0,
      "verified": true,
      "author": "Bruce Manuel",
      "helpful_votes": 0,
      "publication_date": 20130116
    },
    {
      "title": "Great product and fits well!",
      "text": "These tree shoes are great and I found the size chart to be accurate for all of my Allen Edmonds shoes in a 10.5.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey Whann",
      "helpful_votes": 0,
      "publication_date": 20150920
    },
    {
      "title": "I have purchased these same shoe trees in the past ...",
      "text": "I have purchased these same shoe trees in the past from an Allen Edmonds store and they had a fresh cedar scent . These did not, possibly indicating they had been on a shelf for some time.",
      "rating": 3.0,
      "verified": true,
      "author": "Mario Moreno",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "Four Stars",
      "text": "Very good shoe tree for the price. Does as expected.",
      "rating": 4.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20141221
    },
    {
      "title": "They do their job very well",
      "text": "I have three sets of these shoe trees. I need more!",
      "rating": 5.0,
      "verified": true,
      "author": "Professional Dude",
      "helpful_votes": 0,
      "publication_date": 20150217
    },
    {
      "title": "Work great, make sure you get the correct size.",
      "text": "Slightly over-snug for the Allen Edmonds shoes I bought them for. They do fit into the shoe but can be a challenge to get them out. I think they would be too large for anything smaller than an 11.",
      "rating": 4.0,
      "verified": true,
      "author": "Jon Cobler",
      "helpful_votes": 0,
      "publication_date": 20150120
    },
    {
      "title": "Simply the best",
      "text": "The design and construction of Allen Edmonds shoe trees are exceptional. If you have a quality pair of leather shoes, these are a necessity to ensure a long life of your footwear. They also make your closet smell great.",
      "rating": 5.0,
      "verified": true,
      "author": "CJ Schexnayder",
      "helpful_votes": 0,
      "publication_date": 20141226
    },
    {
      "title": "Follow sizing chart",
      "text": "Bought both XL and XXL for my 13 - 14 shoes. Chart was exactly right: XXL barely fit into the 13 (forced) and tightly into the 14.",
      "rating": 5.0,
      "verified": true,
      "author": "Cutter",
      "helpful_votes": 0,
      "publication_date": 20130508
    },
    {
      "title": "Great quality",
      "text": "These are remarkable. The rose cedar is especially aromatic. The construction is solid, high quality American craftsmanship. Can't go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "MB",
      "helpful_votes": 0,
      "publication_date": 20130929
    },
    {
      "title": "Beautifully made and does its job well",
      "text": "The Allen Edmonds cedar shoe tree is beautifully crafted, does its job well and keeps shoes looking great. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Alok Juyal",
      "helpful_votes": 0,
      "publication_date": 20131209
    },
    {
      "title": "Solid and Smells Great",
      "text": "WHat can I say. This product is exactly as advertised. It's solid, smells wonderfully of cedar, and does its job. Every now and then the stars align and you receive exactly what you hoped for when ordering online... This is one of those times.",
      "rating": 5.0,
      "verified": true,
      "author": "PSimon",
      "helpful_votes": 0,
      "publication_date": 20081213
    },
    {
      "title": "Four Stars",
      "text": "ODDLY SHAPED THICKNESS AT THE BRIDGE OF THE SHOE TREE KEPT IT FROM FITTING IN MY BOOTS.",
      "rating": 4.0,
      "verified": true,
      "author": "Ted Howell",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "Recommended for size 9D is M",
      "text": "Recommended for size 9D is M, but it's a tight fit, very hard to remove the trees from the shoe.",
      "rating": 3.0,
      "verified": true,
      "author": "curly",
      "helpful_votes": 0,
      "publication_date": 20140728
    },
    {
      "title": "Allen Edmonds Full Toe Cedar Shoe Tree, Large",
      "text": "I like this product because it keeps the wrinkles out of my shoes and boots. You can't go wrong with this product if you care about your footwear.",
      "rating": 5.0,
      "verified": true,
      "author": "JazzCque",
      "helpful_votes": 0,
      "publication_date": 20130915
    },
    {
      "title": "Super fast service",
      "text": "Shoe tree came very quickly and fits perfectly. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20141001
    },
    {
      "title": "Perfect fit for my AE park avenues",
      "text": "These shoe trees arrived perfectly fitting my Park Avenues which were an 8 3E. They are crafted well and I expect them to keep my shoes dry and in shape.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20140104
    },
    {
      "title": "Five Stars",
      "text": "Super quality like all of Allen Edmonds products I have purchased so far",
      "rating": 5.0,
      "verified": true,
      "author": "Lumencrazy",
      "helpful_votes": 0,
      "publication_date": 20160908
    },
    {
      "title": "Good bargain",
      "text": "Have only been using these for about a week but from what I've seen so far they get the job done",
      "rating": 4.0,
      "verified": true,
      "author": "Shoaib Haroon",
      "helpful_votes": 0,
      "publication_date": 20140207
    },
    {
      "title": "Happy with the product and the delivery",
      "text": "Delivery to Singapore arrived earlier than expected. Remember to choose a size smaller so the shoe tree fits into the shoe nicely.",
      "rating": 4.0,
      "verified": true,
      "author": "MZ",
      "helpful_votes": 0,
      "publication_date": 20150708
    },
    {
      "title": "Gotta have 'em for your good shoes",
      "text": "Not much can go wrong with shoe trees unless they are junk. I got these to go with my AE shoes. Completely unnecessary, but they do fit the shoes well and appear to be constructed well. I'm sure I could get decent shoe trees for a third less if I keep my eye out, but I am in no way disappointed that I spent a little extra for these.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael T. Parsons",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Great buy",
      "text": "Make sure to go to Allen Edmonds website for correct sizing I ordered 10 !/2 size and they recommended a medium perfect fit! My husband loved them!",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy",
      "helpful_votes": 0,
      "publication_date": 20100716
    },
    {
      "title": "Execllent shoe tree",
      "text": "Best shoe tree that I've ever used. The solid, full-toe design reduces creases without widening the shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "SeaFree",
      "helpful_votes": 3,
      "publication_date": 20080607
    },
    {
      "title": "I highly recommend buying this product for each pair",
      "text": "A must have for your AEs. I highly recommend buying this product for each pair.",
      "rating": 5.0,
      "verified": true,
      "author": "RSS",
      "helpful_votes": 0,
      "publication_date": 20141209
    },
    {
      "title": "Exactly what I expected.",
      "text": "They arrived on time and in great condition ! The large is a little on the bigger side for a size 9 EEE shoe..",
      "rating": 4.0,
      "verified": true,
      "author": "Vinay Sharma",
      "helpful_votes": 0,
      "publication_date": 20121204
    },
    {
      "title": "Perfect fit.",
      "text": "Love this toe cedar shoe tree. Fits perfect for my shoes and recommend this to everyone who has shoes they want to keep nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Marius D Jacobsen",
      "helpful_votes": 0,
      "publication_date": 20140610
    },
    {
      "title": "nice shoe trees",
      "text": "These shoe trees perform their function as advertised. Nice, solid construction. Free cedar. Nice smell.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Kim",
      "helpful_votes": 0,
      "publication_date": 20080124
    },
    {
      "title": "Simple choice",
      "text": "Perfect. Fits great. Smells great. Doesn't jam. What more is it supposed to do?",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart C Cruikshank",
      "helpful_votes": 0,
      "publication_date": 20150418
    },
    {
      "title": "Allen Edmonds shoe trees",
      "text": "I really like the solid toe. The cedar used is very pleasing to the shoe and to look at too.",
      "rating": 5.0,
      "verified": true,
      "author": "David Nolen",
      "helpful_votes": 0,
      "publication_date": 20131007
    },
    {
      "title": "Five Stars",
      "text": "Do exactly what they are suppose to do. Solid build.",
      "rating": 5.0,
      "verified": true,
      "author": "Corby Selvey",
      "helpful_votes": 0,
      "publication_date": 20150611
    },
    {
      "title": "Great Product",
      "text": "I got the large for a size 11 pair of Allen Edmonds. The product is great and fits well, though Amazon sent the combination shoe tree instead of the full toe.",
      "rating": 3.0,
      "verified": true,
      "author": "MP",
      "helpful_votes": 2,
      "publication_date": 20130816
    },
    {
      "title": "Protect your shoes and prolong their life.",
      "text": "This is a great set of quality cedar shoe trees. The price can't be beat for AE branded gear. I can't comment on the durability (hence the 4 stars), but the initial quality is excellent.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan D.",
      "helpful_votes": 0,
      "publication_date": 20140109
    },
    {
      "title": "shoe tree handling",
      "text": "The cupping pull-up not as elevated/high to grab as would prefer. A raw hide pull on top would be more convenient in dealind with removal.",
      "rating": 3.0,
      "verified": true,
      "author": "Rolex2Tophorseman1",
      "helpful_votes": 0,
      "publication_date": 20130827
    },
    {
      "title": "Smooth it down",
      "text": "need to smooth it down so as it doesn't scuff inside of the shoes and hope it does tear the leather . I will buy again",
      "rating": 3.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20131029
    },
    {
      "title": "These shoe trees will not fit a 13E shoe.",
      "text": "Actually I needed to contact someone about these shoe trees. I waer a size 13e in some of my shoes and these trees are supposed to fit a 13E and they will not go into the shoe completely. The toe part is fine but the heel part is to long to completely go into the shoe.",
      "rating": 1.0,
      "verified": true,
      "author": "Tom Smith",
      "helpful_votes": 0,
      "publication_date": 20130506
    }
  ],
  "product_meta": {
    "title": "Allen Edmonds Men's Full Toe Cedar Shoe Tree",
    "description": "Natural odor-absorbing Cedar wood.\n\nKeep your wide toed shoe smooth and odor free with these classic shoe trees from Allen Edmonds. Made from aromatic cedar, the two part construction helps to retain the shape of your shoes. Recommended by most fine shoe manufacturers.\n\nFounded in 1922, Allen-Edmonds Shoe Corporation manufactures premium men's footwear, accessories, and cedar products using the philosophy of quality, service and integrity. Taking shoemaking to the level of an art form, each pair of Allen-Edmonds shoes are carefully crafted by hand in a process that includes 212 separate production steps. No detail is too small, because supreme quality is the cornerstone of the Allen-Edmonds name.\n\nSee more",
    "rating": 4.3,
    "feature_bullets": [
      "100% Cedar",
      "Made in US",
      "Cedar sole",
      "Wide-toe cedar shoe tree with adjustable two-part construction designed to absorb moisture and retain shoe shape"
    ],
    "categories": [
      "Shoe & Boot Trees",
      "Shoe Care & Accessories",
      "Shoe, Jewelry & Watch Accessories",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 25.0,
    "specifications": {}
  }
}