{
  "website_summaries": [
    {
      "verdict": "This silicone pastry brush is specially designed to hold onto large amounts of liquid as you transfer from bowl to food.",
      "pros": [
        "Unique bristle design does not retain odors or clump during cleaning",
        "Features gaps in center to hold liquids better as they are transferred",
        "Tapered outer bristles for delicate pastries",
        "Heat resistant to 600 degrees",
        "Dishwasher safe",
        "Delicate enough to paint pastry without damage"
      ],
      "cons": [
        "Not as good for the thinnest, most delicate pastries"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Poorly made with handle that will easily break in half.",
      "text": "Bought this a few months ago, used it once and then it broke in 2 pieces. See pictures.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 40,
      "publication_date": 20180112
    },
    {
      "title": "nice brush",
      "text": "It's holding up well to all the abuse we give it. I kind of wish it would hold more butter when I'm basting things, but I've learned to just spoon sauce on whatever I'm basting, then use this brush to cover everything well. It cleans up nicely in the dishwasher. Has gotten too close to the burners on the stove a couple of times, but shows no sign of getting burned yet. Love that I can hang it with other utensils and find it when I need it. OH, learned that it works REALLY WELL for buttering the sides of bread you're going to make grilled sandwiches with or garlic bread!",
      "rating": 5.0,
      "verified": true,
      "author": "Encie",
      "helpful_votes": 9,
      "publication_date": 20200505
    },
    {
      "title": "Underwhelmed by quality, but it does work.",
      "text": "I usually really like OXO products, but this one underwhelmed me. Nothing seems quite right with the design, but it gets the job done. I wish there were more silicon bristles, and the handle feels kind of cheap. Again, it does work---but it just leaves me wanting a better version of this tool.",
      "rating": 3.0,
      "verified": true,
      "author": "I.R.M.",
      "helpful_votes": 7,
      "publication_date": 20200501
    },
    {
      "title": "Best silicone brush I’ve found",
      "text": "I will start by saying that I really don’t like silicone brushes because I’ve found that most don’t really hold liquid in the bristles. This is by far the best one that I have used! It works well, not great, but much better than any others I’ve used. I still keep a bristle brush around but I use this where I am going to be putting it in contact with a hot item. I like to use the brush to oil up my cast iron when it’s nice and hot so this fills that need.",
      "rating": 4.0,
      "verified": true,
      "author": "Sterling Rose",
      "helpful_votes": 7,
      "publication_date": 20190622
    },
    {
      "title": "Not just for Sauces and Marinades",
      "text": "Purchased primarily for Cast Iron Seasoning purposes because my old brush melted and had a tendency to lose bristles. This should be able to handle the heat if the description is correct stating they can withstand up to 600 deg. f.. I have used them to reapply oil to a few pans already during the seasoning process, and the brush does seem to withstand a lot of heat without loss of shape. I purchased two and the second one may end up in the garage/shop to sweep away hot metal shavings, to apply various solutions, or things of that nature.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Clifton",
      "helpful_votes": 10,
      "publication_date": 20170708
    },
    {
      "title": "Thinking \"Oooo a basting brush\" - Yes go ahead and buy",
      "text": "This is one of those kitchen tools that rated best of in those equipment testing ratings. I can see why. Works, clever design, I've not melted it, it doesn't mold, the head doesn't come off, I chunk it in the dishwasher. Yes go ahead and buy a basting brush. Trust me, you find uses for it if you don't already",
      "rating": 5.0,
      "verified": true,
      "author": "C & K Ram",
      "helpful_votes": 5,
      "publication_date": 20190529
    },
    {
      "title": "A perfectly designed tool.",
      "text": "I love this thing. Bristles are perfect length and width. First use was not for cooking. I needed to apply mineral oil to a rusty hand-crank mixer, the kind we used to use back in the early ‘60s. I used the brush to get into all of the nooks and crannies. So the bristles were rust colored. That didn’t stop me from using it for another recipe. No rust taste. And the rust stain came out after the second go-round in the dishwasher! It’s perfectly designed. As a result, I’m making dishes that call for a pastry brush, which I avoided before. I just ordered a second one.",
      "rating": 5.0,
      "verified": true,
      "author": "Shy person ",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Bristle brushes are better (for me)",
      "text": "I decided to try one of these to replace two bristle brushes that were worn down beyond usefulness. I use brushes to prepare a chicken and to apply egg-wash to my water bagels so that the seeds stick. This was actually better on the bagels but not so good on the chicken. Bristle brushes are much easier to control but a pita to clean.",
      "rating": 4.0,
      "verified": true,
      "author": "Eyeconic",
      "helpful_votes": 2,
      "publication_date": 20190426
    },
    {
      "title": "So far, so good!",
      "text": "I normally wait about a month after receiving something before reviewing it, unless there's a problem right out of the box. This brush is great - easy to clean (dishwasher safe!), easy to use (like a paintbrush), and seems very durable. I'm pleased with the quality, price point, and speedy delivery. I would definitely recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Black Magister",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Great Basting Brush",
      "text": "I use this thing 4-5 times a week. I use it for our rotisserie, I use it for the grill, I use it for the oven, so far it hasn't melted, its easy to hold and does the job really well. I feel it carries more liquid to my meat and cleans easier than my traditional Basting Brushes my mom would have used.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas C.",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "It's a good thing",
      "text": "You should know I love OXO products for myself and all my friends and family! The always fit so well in the hand! This one is no exception! I've not had an opportunity to use it but can see how it can hold more oil or sauce, etc. The cleanup should be easy by hand or dish washer. As always, if my opinion changes, I will update this review",
      "rating": 5.0,
      "verified": true,
      "author": "HODGEPODGESPVTop Contributor: Coloring",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "Perfect",
      "text": "Love this brush, and I’ve tried many, some are stiff or don’t cover enough surface area - this one is flexible and holds thick sauces well, making it easy and quick to baste for barbecuing. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Agnes O'Neil",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Best silicone brush",
      "text": "I bought this for myself and then ordered two more for my daughter- in - laws. They had been using the wooden handle boar hair brushes. Theses brushes hold bacteria and get pretty gross after so many washings. They love the silicone brush.",
      "rating": 5.0,
      "verified": true,
      "author": "Silverslipperdiva",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Best silicon brush I’ve used",
      "text": "Perfect for my air fryer! Don’t have to worry about the heat. Doesn’t hold oil as well as a normal brush, which causes the oil to fall off more quickly. This is partially mitigated by tilting the brush back and then over when brushing.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Vo",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Excellent product",
      "text": "Recommended by America's Test Kitchen. Never purchased this style of pastry brush before. MUCH easier to clean than the standard 'painted brush' style.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Di Clemente",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "but it actually works like a charm",
      "text": "Works really well, I was skeptical at first of the tab in the middle that's supposed to hold more sauce with each dip, but it actually works like a charm. Easily worked through a bowl of sauce and left very little behind.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 2,
      "publication_date": 20170712
    },
    {
      "title": "Awesome upgrade!",
      "text": "This is a small thing, but it has brought me a lot of joy and made baking with Phyllo dough so much more fun.",
      "rating": 5.0,
      "verified": true,
      "author": "EDL",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "OXO 1071061 Good Grips Silicone Basting & Pastry Brush - Large,Black",
      "text": "All OXO basting brushes are durable, easy to clean, heat resistant and I like them very much.",
      "rating": 5.0,
      "verified": true,
      "author": "Lenore S.",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Well-designed, well-built basting brush.",
      "text": "This is a clever, well-designed basting brush. There are some flat silicone strips with holes in them which help retain the sauce or juice in the brush so you can apply it to whatever you are cooking. The angled head keeps the bristles off of the counter surface. And they can be safely used outdoors on the BBQ, since the silicone will not melt or burn like other basting brushes. A welcome addition to my arsenal of cooking supplies.",
      "rating": 5.0,
      "verified": true,
      "author": "-=Rudy=-Top Contributor: Cycling",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "Good quality product.",
      "text": "I like having both this kind as well as the plastic kind to baste my baked goods.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee Rhodes",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Great brush with one weakness",
      "text": "Works great at spreading out bbq sauce and garlic butter when grilling. I ordered this twice, the first one I ordered had a broken handle where the rubber handle separates from the rest of the plastic part. I think this is the only weakness in the brush so removed 1 star.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "Kitchen must have",
      "text": "Had the smaller version for a while and finally got the bigger one. They last and are great to use.",
      "rating": 5.0,
      "verified": true,
      "author": "jeff w",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Strong chemical odor",
      "text": "I buy a lot of oxo products. This is the only one I have returned. Seems very durable and looks like it will be difficult to clean because of the holes in the middle bristles.",
      "rating": 3.0,
      "verified": true,
      "author": "VitaTTop Contributor: Sunglasses",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Wonderful cooking utensils",
      "text": "I was very surprised at the quality of the product. Very nice and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Lusso2k",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Great barbecue sauce brush!",
      "text": "The OXO Good Grips silicone basting/pastry brush holds much more grilling sauce than our old plastic basting brush.",
      "rating": 5.0,
      "verified": true,
      "author": "DB",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Was skeptical but I love it",
      "text": "Always used a regular bristle like brush.. but I like it.. it holds more liquid than my old one",
      "rating": 5.0,
      "verified": true,
      "author": "NJ resident",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Great product",
      "text": "Great product, cleans easily and holds a lot of liquid to brush and apply to food. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea Crawford",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Keep brush away from high heat.",
      "text": "Barbecue chicken and use for basting corn on the cob with butter",
      "rating": 5.0,
      "verified": true,
      "author": "Michael K. Scott",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Washing after use",
      "text": "Use it for any type of basting. I do leave it out of the drawer until it has completely dried after washing.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Maron",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "VERY HANDY, WORKS GREAT!",
      "text": "Two in the photo, but realize you only get one. I went for the large one, and it works great. The rubber bristles are soft. There's another rubber piece in there. I don't know what it's there for, but it doesn't cause any trouble. It might be helping the usability of the thing.",
      "rating": 5.0,
      "verified": true,
      "author": "King'sCrown",
      "helpful_votes": 0,
      "publication_date": 20151218
    },
    {
      "title": "As described. Doesn't leave little \"hairs\" on what your ...",
      "text": "As described. Doesn't leave little \"hairs\" on what your basting.",
      "rating": 5.0,
      "verified": true,
      "author": "mgeiken",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Great for Sheet Pan Baking",
      "text": "We use this to spread the oil on our sheet pan, and for basting our meats and vegetables.",
      "rating": 5.0,
      "verified": true,
      "author": "L Maurer",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Works just fine, holds a lot of sauce",
      "text": "Works just fine, holds a lot of sauce. This product made me not want to mop foods since it's very messy and wasteful. Quite a bit stays on the brush itself, which should be expected. Survives just fine in the dishwasher. Can stain from dark BBQ sauces, a couple more washes will clean it out better.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott Hull",
      "helpful_votes": 0,
      "publication_date": 20141220
    },
    {
      "title": "I'd definitely buy again!",
      "text": "Love this brush! It has an inner layer that allows you to spread runnier sauces with no problem. Definitely recommend this product. It's probably the 5th or 6th brush I've purchased and this one is my favorite.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Ledermann",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "Nice item works great",
      "text": "I ordered this to replace an old brush from some company I can't recall. This thing works great, and as with *all* OXO products I own I'm glad I spent a little more and got quality. It even has these tiny holes in the base of the brush to hold extra liquid for basting. I love this item, and it also works great as a turkey basting brush.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130317
    },
    {
      "title": "... smaller outter fingers to help with application is a nice design. Bought it because it looked similar to ...",
      "text": "The design is very nice: the middle bristles have holes to help keep oil/sauce locked in to the brush and the smaller outer bristles help with even application. Bought it because it looked similar to something Alton Brown recommended on Good Eats, and it's been working really well for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe J.",
      "helpful_votes": 0,
      "publication_date": 20141210
    },
    {
      "title": "Great for use on the grill",
      "text": "I bought this \"brush\" to baste meats on the grill. It feels very well made. In use, it holds a reasonable volume of sauce and because it is silicon, it can take the heat. And best of all, it is easy to clean and doesn't become a matted mess like most basting brushes after a summer of use on the grill. For me, the right tool for the job.",
      "rating": 5.0,
      "verified": true,
      "author": "John Bruton",
      "helpful_votes": 0,
      "publication_date": 20130711
    },
    {
      "title": "Nice basting brush",
      "text": "Works as expected. Use a lot of Oxo products. They never fail me!",
      "rating": 5.0,
      "verified": true,
      "author": "KL",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Great product",
      "text": "A good quality Bastet brush - easy to handle & use. Also very flexible & durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Benay Brawley",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "... was concerned that this product might not hold a good amount of sauce or drippings but its unique design ...",
      "text": "I was concerned that this product might not hold a good amount of sauce or drippings but its unique design hold a lot of liquid making the basting job easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Spitzerone",
      "helpful_votes": 0,
      "publication_date": 20160305
    },
    {
      "title": "I think it's good, and I recommend you to buy it.",
      "text": "I bought it for grilling and used it to brush the oil, which I think is not bad and is enough for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenni acosta",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Best basting brush I've ever used",
      "text": "Best basting brush I've ever used, but I already knew that before buying. We got one of these a few years ago, and I bought two more because we use it all the time. Would buy again, and have done so twice.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20140816
    },
    {
      "title": "HUGE! BASTING BRUSH, not a pastry brush.",
      "text": "The product itself is great, but I think it may be mislabeled. The brush is way too large to be a pastry brush and the silicone bristles are too large for delicate goods, or even pie for that matter. This is definitely a BASTING BRUSH.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Kim",
      "helpful_votes": 5,
      "publication_date": 20101008
    },
    {
      "title": "One Brush",
      "text": "First non boar bristle brush and works better than I expected. I was fooled by the photo .... you only get one brush! but thats ok.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter D Gent",
      "helpful_votes": 0,
      "publication_date": 20160404
    },
    {
      "title": "Great for the grill on coating your grub",
      "text": "+ works nicely to coat your BBQ chicken - the angle is only good one direction",
      "rating": 4.0,
      "verified": true,
      "author": "Mark Niagara",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Great for challah",
      "text": "I used for egg washing challah bread. I have used it for basting meat. It works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Celia",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Holds lots of juice",
      "text": "I bought this for my wife after I got the large brush for the BBQ. She was jealous and made me order one for her in the kitchen. It holds lots of juice/butter/sauce and is easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Doug K.",
      "helpful_votes": 0,
      "publication_date": 20140613
    },
    {
      "title": "OXO Silicone Pastry Brush:",
      "text": "Awesome basting brush and I love the slanted shape! OXO products are the best!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda L.",
      "helpful_votes": 0,
      "publication_date": 20161108
    },
    {
      "title": "Look no further.",
      "text": "By far the best pastry brush I've ever owned, and I've worn out a few. Love that you can place it on a counter without the bristles touching. It picks up lots of butter/sauces and evenly distributes it. Buy this brush!",
      "rating": 5.0,
      "verified": true,
      "author": "Cymama",
      "helpful_votes": 0,
      "publication_date": 20140919
    },
    {
      "title": "Very satisfied",
      "text": "Works very well and very easy to clean. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Bronwyn",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Versatile Brush",
      "text": "Grabs and holds barbecue sauce as well as melted butter. Great all-around basting brush. I am going to look for a longer handled to use while cooking on the grill.",
      "rating": 5.0,
      "verified": true,
      "author": "pookatunie",
      "helpful_votes": 0,
      "publication_date": 20131103
    },
    {
      "title": "Finally a brush that is easy to clean and stays clean!",
      "text": "Finally a brush that is easy to clean and stays clean! Nice sturdy handle and design. Easy to apply oil evenly to foods and pans. Perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Devine",
      "helpful_votes": 0,
      "publication_date": 20140225
    },
    {
      "title": "Four Stars",
      "text": "Much bigger than i was expecting. But so far so good",
      "rating": 4.0,
      "verified": true,
      "author": "A M",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "This is a great brush for Barbecuing",
      "text": "This is a great brush for Barbecuing. With every other brush I have used over the years, the bristles either burned or melted. Not with this brush. It cleans up nicely with soapy water or in the dishwasher.",
      "rating": 5.0,
      "verified": true,
      "author": "RL",
      "helpful_votes": 0,
      "publication_date": 20140902
    },
    {
      "title": "Works good!",
      "text": "Just used once & it appears to work well. Haven't had much experience with the silicon brushes, but I think I'm going to really like them.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeannie Woo",
      "helpful_votes": 0,
      "publication_date": 20130119
    },
    {
      "title": "So easy to wash",
      "text": "Works so well. Grips bque sauce and spreads so well. So easy to wash. Love oxo",
      "rating": 5.0,
      "verified": true,
      "author": "winston",
      "helpful_votes": 0,
      "publication_date": 20150102
    },
    {
      "title": "One Star",
      "text": "Should eventually work. Arrived broken at point where handle is pieced together. Will be gluing it.",
      "rating": 1.0,
      "verified": true,
      "author": "LandLocked",
      "helpful_votes": 7,
      "publication_date": 20180106
    },
    {
      "title": "go ahead..",
      "text": "go ahead and lay it on thick - this brush holds a serious load of sauce without dripping and makes uniform application easy",
      "rating": 5.0,
      "verified": true,
      "author": "MD Gidding",
      "helpful_votes": 0,
      "publication_date": 20130105
    },
    {
      "title": "Excellent quality",
      "text": "One of the best brushes! Top quality. I still use it and looks like brand new",
      "rating": 5.0,
      "verified": true,
      "author": "RyanF",
      "helpful_votes": 0,
      "publication_date": 20171004
    },
    {
      "title": "Five Stars",
      "text": "The quality that I have come to expect from Oxo.",
      "rating": 5.0,
      "verified": true,
      "author": "Cameron Hahn",
      "helpful_votes": 0,
      "publication_date": 20161109
    },
    {
      "title": "Works great.....",
      "text": "I was looking for a nice light easy to clean brush and this fits the bill.",
      "rating": 4.0,
      "verified": true,
      "author": "Jill Ayers",
      "helpful_votes": 0,
      "publication_date": 20090216
    },
    {
      "title": "Great Brush",
      "text": "This was an excellent replacement for my aging basting brush. Holds liquids very well. Toss it in the dishwasher when done. No muss, no fuss.",
      "rating": 5.0,
      "verified": true,
      "author": "James E. Robinson III",
      "helpful_votes": 6,
      "publication_date": 20071113
    },
    {
      "title": "Superior",
      "text": "Heat resistant & brace inside the bristles actually holds liquids so you can brush them on food. Also Alton Brown recommended buying this type.",
      "rating": 5.0,
      "verified": true,
      "author": "Austin Frazee",
      "helpful_votes": 0,
      "publication_date": 20140228
    },
    {
      "title": "Love it!",
      "text": "Finally got rid of my old wooden, natural hair basting brush! Love the silicone technology for a brush! Easy to clean and no residual odor from previous use. Will def re-visit Oxo for more upgrades. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula Schwenn",
      "helpful_votes": 0,
      "publication_date": 20130510
    },
    {
      "title": "Great for cast iron maintenance",
      "text": "I bought this brush to apply oil to my cast iron skillet. Works great. It is easy to clean with soap and hot water from my sink's sprayer.",
      "rating": 5.0,
      "verified": true,
      "author": "David Allen Priebe",
      "helpful_votes": 2,
      "publication_date": 20110529
    },
    {
      "title": "A little disappointed",
      "text": "I wanted to love these because I love everything OXO but I didn't think they held as much or were as easy to use as traditional basting brushes.",
      "rating": 3.0,
      "verified": true,
      "author": "Kristen & Ray Whitaker",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "Probably perfect for basting on the grill",
      "text": "Interestingly unusable for use in spreading plaster on dioramas, but OXO makes awesome products, so on to basting grilled chicken we go!",
      "rating": 4.0,
      "verified": true,
      "author": "SFO Bro",
      "helpful_votes": 0,
      "publication_date": 20150406
    },
    {
      "title": "\" WONDERFUL PRODUCT & EXCELLENT SERVICE!!! \"",
      "text": "Nicely Made Handy Kitchen Utensil For Basting & Working With Holiday Pasteries!!!",
      "rating": 5.0,
      "verified": true,
      "author": "NICK CHIUSANO",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "Bigger than I thought",
      "text": "When I read \"pastry\" brush, I thought this would be quite dainty and I was considering buying the larger model. I am glad I did not as this brush is quite beefy. (see my video review) I haven't used for any basting yet, but like most of Oxo products it looks and feels well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Researcher",
      "helpful_votes": 48,
      "publication_date": 20091104
    },
    {
      "title": "Watch out, the picture shows 2 brushes. You'll ...",
      "text": "Watch out, the picture shows 2 brushes. You'll only get one. No reduction in price. Thank goodness it's the basting and not the pastry brush.",
      "rating": 1.0,
      "verified": true,
      "author": "Norm",
      "helpful_votes": 3,
      "publication_date": 20151015
    },
    {
      "title": "Deceptive",
      "text": "Product picture and description are misleading. Description states basting brush AND pastry brush. Picture depicts both a large and a small brush. Order is filled with only one brush.",
      "rating": 1.0,
      "verified": true,
      "author": "out livin my life",
      "helpful_votes": 0,
      "publication_date": 20160210
    },
    {
      "title": "It works",
      "text": "This is replacing a previous one that disappeared mysteriously like things like these do. My previous one was smaller, easier to handle for the kind of use I have for it. The bristles - I assume that's the proper word - are thicker and less number of them than my previous one. It makes it easier to clean, but less capable of \"painting the food\" with sauce or whatever I am adding.",
      "rating": 4.0,
      "verified": true,
      "author": "alex",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Great for grilling",
      "text": "I use this to apply sauces to food on my grill & it does a great job. It holds up to the high heat like a champ. It's incredibly easy to clean & goes through the dishwasher fine. I didn't initially like the slight bend near the bristles until I realized that it holds the sauce side off of a flat surface. It's a cool feature that keeps my work surfaces clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Fuller",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "An olive oil essential for the kitchen!",
      "text": "After being tired of messing with olive oil spouts and bottles, this has been a life-saver. Great for quickly oiling a pan, or adding a thin, even layer of oil on anything before cooking/baking in the oven.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie T",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Makes coating with barbecue sauce or olive oil a snap",
      "text": "The cup-shape formed by the edges of the soft bristles really does hold sauce or olive oil as advertised. The brush is easy to clean, and the bristles retain their pliability after being put the the dishwasher.",
      "rating": 5.0,
      "verified": true,
      "author": "Dwayne D",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Seems great so far",
      "text": "Not much to say about a basting brush. Nice solid handle, replaces one that the nylon bristles used to fall out of periodically. Works fine. I mean, it's a brush so...",
      "rating": 5.0,
      "verified": true,
      "author": "Guitar Johnny",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Easy dishwasher cleanup!",
      "text": "These are not as nice as the ones I have purchased in the fancy home stores - but so much better than the garbage in the local stores. And I really like that it can go in the dishwasher, as it would otherwise be nearly impossible to get thoroughly clean!",
      "rating": 5.0,
      "verified": true,
      "author": "Carpe Diem",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Unless using at a grill, handle is too long",
      "text": "If you are purchasing this for use at an outdoor grill, I guess the longish handle is a benefit. For use in a kitchen, seems a bit too clumsy and big.",
      "rating": 4.0,
      "verified": true,
      "author": "melwest",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "These are great. The pair is good for bigger pieces like ...",
      "text": "These are great. The pair is good for bigger pieces like rib racks or large Phyllo butter coverage, and the small for glazing fish or chicken pieces. The inside brushes are designed to hold some extras sauce or whatever you are using. Its a consumer brand product that works pretty well in a professional environment. The whole thing is durable plastic and silicon. So it holds up to heat and can be sanitized very well. The brushes can be cleaned very well and do not retain old flavors or smells with a good hot soapy washing.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas Tunstall",
      "helpful_votes": 0,
      "publication_date": 20150913
    },
    {
      "title": "A fav...",
      "text": "These basting brushes are the best. It’s longer length perfect for indoor or outdoor cooking. The ‘bristles’ do not splay, and hold just the right amount of application.",
      "rating": 5.0,
      "verified": true,
      "author": "An Educated Consumer",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Good stuff",
      "text": "I am very happy with this purchase.This is really what I was looking for - expensive, but I really like it and do it with the thought of a customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Bohdan Kopanskyy",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "nice basting brush",
      "text": "this is what I needed to baste my chicken , pork , and veggies on the grill",
      "rating": 5.0,
      "verified": true,
      "author": "ang nc",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Nifty!",
      "text": "Great brush for putting barbecue sauce on ribs. I've always used natural bristle brushes, but this applies sauce well and cleans up easily.",
      "rating": 5.0,
      "verified": true,
      "author": "nclinnea",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Better Than I Expected !",
      "text": "This item was better than I expected it to be. A silicone brush didn't make sense to me for basting poultry but it works. Easy clean up.",
      "rating": 5.0,
      "verified": true,
      "author": "paul",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Works like a charm on even the stickiest sauces",
      "text": "Works like a charm on even the stickiest sauces. Drop it in the dishwasher and its clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin Lobel",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Great brush.",
      "text": "My wife uses this brush in the kitchen when baking. Very good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "HG",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Good size brush but hair falls off.",
      "text": "It’s wide enough however the hair falls off on the first wash.",
      "rating": 3.0,
      "verified": true,
      "author": "Zenobia Chien",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Great silicone basting brush",
      "text": "Great silicone basting brush that I can use over the heat and not worry about it melting. Easy to clean and use.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Best out there, performance as promised, Would buy again even as a gift",
      "text": "Recommended by Cooks Country (PBS Sundays) the grid shaped paddle in the center is supposed to hold more (Sauce butter liquid) for application. I have used for pastry and it’s just great!",
      "rating": 5.0,
      "verified": true,
      "author": "clm",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Another Great Oxo Product",
      "text": "Perfect size. It holds a much larger quantity of basting liquid than my previous brush. It's delicate enough to spread an egg wash on risen bread dough before baking. It cleans up easily and the angled head keeps the counter clean when you set it down.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob P",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "All OXO products are of excellent quality. This brush has a silicon mat in ...",
      "text": "All OXO products are of excellent quality. This brush has a silicon mat in the middle that holds a lot of liquid. A very good thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Goldberg",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "re: does the job",
      "text": "this has been my favorite bbq brush ever for easy to clean, hold and use!",
      "rating": 5.0,
      "verified": true,
      "author": "glorygirl",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Holds a lot of sauce and is easy to clean",
      "text": "Great brush! Durable, machine-washable, and holds a lot of sauce, oil, or melted butter.",
      "rating": 5.0,
      "verified": true,
      "author": "wolfboy001",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Works great",
      "text": "Works great! I love that it's silicone which is much easier to clean than the synthetic brushes. I feel like it's more sanitary than the synthetic brushes too. And it seems to last longer.",
      "rating": 5.0,
      "verified": true,
      "author": "tina",
      "helpful_votes": 0,
      "publication_date": 20161007
    },
    {
      "title": "Best of the class",
      "text": "does the job. seem to be holding up okay. Will do until I find a better one!",
      "rating": 4.0,
      "verified": true,
      "author": "Robert V",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "A true advance in pastry brushes!",
      "text": "This is the best! The traditional ones basically never come clean. Most silicone ones don't actually hold and release the oil properly. This one comes clean and holds and releases oil. It is a true advance in pastry brushes!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather E. Campbell",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "Good quality.",
      "text": "Excellent quality. Works great, no complaints other than how much of a pain it is to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "MAG",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Nice Basting Brush",
      "text": "Very nice basting brush. I'd like the handle a little shorter but it is fine and I have no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Raleigh man",
      "helpful_votes": 2,
      "publication_date": 20161117
    },
    {
      "title": "This is a big baster",
      "text": "This was much bigger than I thought. Not good for basting small items.",
      "rating": 2.0,
      "verified": true,
      "author": "Beach Bum 81",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "I was skeptical",
      "text": "I've put off buying a silicone basting brush - they just didn't look efficient. But, I used a friend's and was totally sold on them. I love this particular OXO - it holds a lot of basting sauce/liquid, washes up like a dream and doesn't mess up the counter when you place it down between bastings. I use it for everything, not just baking. Will buy one with a longer handle for bbq.",
      "rating": 5.0,
      "verified": true,
      "author": "Candy",
      "helpful_votes": 10,
      "publication_date": 20070928
    }
  ],
  "product_meta": {
    "title": "OXO Good Grips Silicone Basting & Pastry Brush - Large",
    "description": "Size:LargeHappy with your basting brush but unhappy with how it retains odors and clumps when you clean it? Try the OXO Good Grips Silicone Basting Brush, which works like a natural bristle brush but with the added conveniences of heat resistance, odor resistance and cleanability. Multiple layers of silicone bristles tackle all tasks. Gaps in the center bristles hold liquid as you transfer sauce from the bowl to the work surface, and tapered outer bristles let you baste poultry and roasts with ease. The silicone bristles are heat resistant to 600 degrees F so you can baste in a hot pan or on the grill, and the angled Brush head keeps bristles off the countertop. Cleanup is easy in the dishwasher, and these bristles won't clump, frizz or retain odors.",
    "rating": 4.7,
    "feature_bullets": [
      "Gaps in center bristles hold liquids for easy transport and spreading",
      "Tapered outer bristles baste poultry and roasts with ease",
      "Heat resistant to 600°F; Angled head keeps bristles off countertop",
      "Bristles will not scorch when greasing a hot pan",
      "Bristles never clump or frizz; Easy to clean and odor resistant",
      "Soft, comfortable grip; Dishwasher safe"
    ],
    "specifications": {
      "Product Dimensions": "12 x 4.25 x 1 inches",
      "Item Weight": "1.6 ounces",
      "Manufacturer": "OXO",
      "ASIN": "B000HD7FJ4",
      "Item model number": "1071061",
      "Customer Reviews": "4.7 out of 5 stars1,174 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#731 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Volume": "1 Milliliters",
      "Material Care Instructions": "Hand Wash",
      "Is Assembly Required?": "No",
      "Number of Pieces": "1",
      "Warranty Description": "Satisfaction Guaranteed! If for any reason you are not satisfied with an OXO product, return it for replacement or refund.",
      "Batteries Required": "No",
      "Included Components": "OXO Good Grips Silicone Basting & Pastry Brush - Large"
    },
    "categories": [
      "Home & Kitchen",
      "Pastry Brushes",
      "Baking Tools & Accessories",
      "Baking & Pastry Utensils",
      "Bakeware",
      "Kitchen & Dining"
    ],
    "price": 9.99
  }
}