{
  "website_summaries": [
    {
      "verdict": "A combination toner, refresher, and moisturizer with anti-aging effects.",
      "pros": [
        "Smells great and works well for all skin types, from dry to oily",
        "Helps clarify skin to prevent damage from pollution and aging"
      ],
      "cons": [
        "Not hydrating enough to replace a moisturizing lotion or cream entirely"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Yippee",
      "text": "I have had rosacea for years. This product was used at a spa I went to for a facial. It was highly recommended. Now, 3 months later, I use it every day. Why? Within one week my rosacea was at peace. Week two it was gone. In six weeks most of the scarring was gone and now, just a little tiny bit is showing. No one knows but me. I love it and use it for my entire face.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracey",
      "helpful_votes": 5,
      "publication_date": 20170925
    },
    {
      "title": "great line of products",
      "text": "I use & recommend the Eminence products. I know I am just words on a web page but I am old as dirt and have amazing skin, I think these products are part of the reason why (genetics too, of course)",
      "rating": 5.0,
      "verified": true,
      "author": "M. Goodman",
      "helpful_votes": 14,
      "publication_date": 20140530
    },
    {
      "title": "Love this Serum",
      "text": "This serum makes me a fan of Eminence products. It helps with my sensitive, dry, rocacea prone skin. This serum calms my skin and minimizes the look of broken capillaries on my cheeks.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20150621
    },
    {
      "title": "Truly combats redness",
      "text": "My skin hasn't looked this great in years. My mom and I both have been struggling with allergic eczema around the nose and we both love this product because it balances out the skin and combats sensitive blotchiness.",
      "rating": 5.0,
      "verified": true,
      "author": "CANDYland",
      "helpful_votes": 2,
      "publication_date": 20160418
    },
    {
      "title": "Great for Rosacea.",
      "text": "I love this product and have been using it for years! I have dry skin and mild rosacea which gets worse during the winter. This product really helps keep it in check. I also appreciate that Eminence products are cruelty-free and never tested on animals.",
      "rating": 5.0,
      "verified": true,
      "author": "shoe shopper",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Helps to Heal Rosacea",
      "text": "Recommend this for anyone who suffers from Rosacea. Use it with all of the chamomile products from Eminence~ cleanser, moisturizer, serum and masque. Even though they say there is no \"cure\" for rosacea, this comes close.",
      "rating": 5.0,
      "verified": true,
      "author": "Loveislikely",
      "helpful_votes": 4,
      "publication_date": 20141129
    },
    {
      "title": "Love this serum",
      "text": "I have used many skin care serums and moisturizers during the year. The Eminence line is my favorite. It has natural ingredients and makes my skin very soft. I get compliments on my skin and people think I look younger than my 40s. The serum is not miracle against lines but I believe it softens them. I will be staying with the Eminence skin care products.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20140717
    },
    {
      "title": "I have used this now for over 7 months and ...",
      "text": "I have used this now for over 7 months and have not seen a reduction of forehead lines. Yet, I have not seen an increase. So I rate as a three. As I have not come across anything else to switch to I shall continue with the product.",
      "rating": 3.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 0,
      "publication_date": 20141205
    },
    {
      "title": "It's gentle on your face & softens deep lines beautifully. I'm on my 2nd bottle & will reorder ...",
      "text": "Powerful little bottle of serum. It's gentle on your face & softens deep lines beautifully. I'm on my 2nd bottle & will reorder when it runs out",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Miller",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "Three Stars",
      "text": "I am not even sure it does anything, just kinda moisturizes skin...",
      "rating": 3.0,
      "verified": true,
      "author": "Veronica Lakes",
      "helpful_votes": 0,
      "publication_date": 20170812
    },
    {
      "title": "My favorite serum!",
      "text": "I use this everyday! It's the best ever. Leaves my skin feeling smooth and also helps with any little outbreaks that pop up.",
      "rating": 5.0,
      "verified": true,
      "author": "catlady",
      "helpful_votes": 0,
      "publication_date": 20130211
    },
    {
      "title": "I've been using this every morning and night after I ...",
      "text": "I've been using this every morning and night after I wash my face and I think it's made a difference. My skin feels more supple",
      "rating": 5.0,
      "verified": true,
      "author": "L526",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "Works well",
      "text": "Use it to get rid of Rosetta. Seems to work",
      "rating": 5.0,
      "verified": true,
      "author": "Michael P. Mcintire",
      "helpful_votes": 0,
      "publication_date": 20160222
    },
    {
      "title": "Product works Execellent",
      "text": "I love this product. Using it has decreased greatly my need for traditional moisturizers. My skin feels soft and moisturized.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Werman",
      "helpful_votes": 0,
      "publication_date": 20131117
    },
    {
      "title": "Great product",
      "text": "This is a great product and a good price. I use it day and night right after cleanser. I am in my 60's and look much younger. I have tried more expensive products and like this better. Even my dermotoligist thinks has good ingredients.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20121230
    },
    {
      "title": "Five Stars",
      "text": "Awesome serum! Use in conjuction with lotion or face oil, feels so fresh!",
      "rating": 5.0,
      "verified": true,
      "author": "LK",
      "helpful_votes": 0,
      "publication_date": 20160410
    },
    {
      "title": "I am a fan of Eminence Products. However, ...",
      "text": "I am a fan of Eminence Products. However, I have very sensitive skin and this product seemed to agitate it. No issues with the seller. Just not the right product for me.",
      "rating": 2.0,
      "verified": true,
      "author": "MP",
      "helpful_votes": 0,
      "publication_date": 20140911
    },
    {
      "title": "Eminence Couperose-c Serum",
      "text": "I chose this particular Eminence serum product for my type of skin concern. It's okay. Makes my skin soft but I really don't notice that it is helping my facial redness.",
      "rating": 3.0,
      "verified": true,
      "author": "Janine",
      "helpful_votes": 0,
      "publication_date": 20131026
    },
    {
      "title": "vit. c for the face",
      "text": "I don't think I ever want to go without Eminince Courperose-c serum. Since I have been using it my face has benefitted highly from the serum. In fact, most people have no idea I am over 60, but think, due to my complexion that I am in my 40's.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth J. Swanson",
      "helpful_votes": 0,
      "publication_date": 20130301
    },
    {
      "title": "Best Product for Reducing Redness",
      "text": "I have mild rosacea and Eminence Couperose-C Serum works as well, or better, than the prescription medicine I had. I use it once, in the morning, under my make-up. I'd highly recommend it. BTW: The other Eminence products are excellent also.",
      "rating": 5.0,
      "verified": true,
      "author": "Love2Read",
      "helpful_votes": 12,
      "publication_date": 20110325
    },
    {
      "title": "My one and only facial serum...",
      "text": "Love this as my morning moisturizer. The tiniest drop covers my entire face and a bottle lasts me a good 3-4 months. Really an excellent product and worth a try if you're on the fence about spending the money.",
      "rating": 5.0,
      "verified": true,
      "author": "runningshell",
      "helpful_votes": 0,
      "publication_date": 20131126
    },
    {
      "title": "Worth every penny",
      "text": "I love knowing I am using a product that is completely natural, very little needs to be applied,and it works",
      "rating": 5.0,
      "verified": true,
      "author": "vicki ruiz",
      "helpful_votes": 0,
      "publication_date": 20130602
    },
    {
      "title": "My mom was recommended this after her double mastectomy to help with the ...",
      "text": "My mom was recommended this after her double mastectomy to help with the scarring. Although she has seen some change in the few months she's used it, it has not helped as much as she had hoped and told it would",
      "rating": 3.0,
      "verified": true,
      "author": "Kate B.",
      "helpful_votes": 0,
      "publication_date": 20160426
    },
    {
      "title": "Awesome serum for evening skin tone!",
      "text": "This stuff is GREAT! I use it at night with my sweet red rose whip moisturizer and BAM in the am I have beautifully toned, moisturized skin. The age spots are kept at bay (I'm 38 and oily/combination hyper SENSITIVE skin) and I love this stuff. It only takes a DROP on a wet hand, mix with other wet hand and PAT all over face and neck. I wonder if people realize that patting product on gets a more even distribution than smearing it all over?? Pat people. PAT. PAT. PAT. You will know what I mean after a month (it takes 28 days about, for your skin to turn over so be patient!!)",
      "rating": 5.0,
      "verified": true,
      "author": "Picky Readers",
      "helpful_votes": 0,
      "publication_date": 20141219
    },
    {
      "title": "rosacea-skin looks and feels way better",
      "text": "After 3 weeks, my rosacea-skin looks and feels way better. I have less redness, bumps and flushing after eating certain food is also less. I would order it again, because I have the idea that this is the only product that can help my skin feeling more or less normal. No reduction in skin flakes though.. If someone knows a solution for those, please let me know!",
      "rating": 4.0,
      "verified": true,
      "author": "Mandy",
      "helpful_votes": 0,
      "publication_date": 20150316
    },
    {
      "title": "No improvement for broken capillaries",
      "text": "Almost done with the bottle and seeing no improvement for broken capillaries. I chose this product because it claimed to help remedy this facial embarrassment. Also, not as moisturizing as I thought. There are other facial serums on the market that work much better.",
      "rating": 2.0,
      "verified": true,
      "author": "fois99",
      "helpful_votes": 9,
      "publication_date": 20140306
    },
    {
      "title": "...Made with organic fruits and vegetable and is great for oily skin",
      "text": "!I am an esthetician and I have oily and acne prone skin and in the summer months I use different moisturizers. In the summer I tend to go lighter and use water based moisturizers. Eminence is great for my skin type and the best part is that their products are derived from fruits and vegetable. I was introduced to Eminence while a student at Miller Motte Esthetic school located in Cary, NC and have been hooked ever since. www.frommetouessentials.com",
      "rating": 4.0,
      "verified": true,
      "author": "MsNC",
      "helpful_votes": 0,
      "publication_date": 20150623
    },
    {
      "title": "no more rosacea",
      "text": "I purchased this product because I get rosacea in the wintertime with the dry heat in the house. I started using this and have found a significant improvement. I only use it on my cheeks. I love this product because it contains natural ingredients. I try to avoid pharmaceutical drugs whenever possible.",
      "rating": 5.0,
      "verified": true,
      "author": "Weezy",
      "helpful_votes": 4,
      "publication_date": 20120722
    },
    {
      "title": "Five Stars",
      "text": "Smells great & I think it helps with my skin regimen.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan McGonigal",
      "helpful_votes": 0,
      "publication_date": 20140928
    },
    {
      "title": "love it!",
      "text": "use this along with cleanser and moisturizer from this line. do your research as there are many types to choose from!",
      "rating": 5.0,
      "verified": true,
      "author": "bigsass",
      "helpful_votes": 0,
      "publication_date": 20121227
    },
    {
      "title": "Totally disappointed in quality of the product .",
      "text": "Very disappointing in quality in compare to what I have been using . Never buy this product from this seller ever . It's a totally waste of time and money , I thought I was saving some money but in reality I lost . Sorry guys but it was not good at all .",
      "rating": 1.0,
      "verified": true,
      "author": "rizwan a syed",
      "helpful_votes": 0,
      "publication_date": 20151205
    },
    {
      "title": "Excellent Product for Spider Veins on your Face",
      "text": "Small red veins on your face are not attractive. Have not had luck with many products, but this one definitely minimizes the veins. I have only used it about 6 nights, but already attention is not drawn to the sides of my nose and the redness in the middle of my chin is fading. Every ingredient is natural and I am familiar with most of the ingredients. However, I am really surprised that once put together, they are working nicely to shrink and fade away my red veins. Many thanks to the person who took the time to figure out this very nice product.",
      "rating": 5.0,
      "verified": true,
      "author": "Delight",
      "helpful_votes": 3,
      "publication_date": 20150601
    },
    {
      "title": "A great brand! Beware of authenticity~~~",
      "text": "This is a serum I love. It helps improve texture and lightens my complexion. However, I've found that my purchase came in a disappointing condition - no seal; no box. I doubt its authenticity. I've read reviews of some Eminence products and found that I'm not the only one who receive suspected products. What we can do is to find a trustworthy seller. Hope it helps.",
      "rating": 3.0,
      "verified": true,
      "author": "Phoe nix",
      "helpful_votes": 5,
      "publication_date": 20150417
    },
    {
      "title": "Love it!",
      "text": "I am using this serum along with four other serums. And I can't say which ones are working or if it's the combination of all serums but I feel that my skin is looking so much better and starting to glow beautifully. I had so much acne and scars and slowing they are fading and my skin is smoothing out. I'm so glad that my skin didn't get so damaged when I had acne. I plan to keep using eminence products because they are organic, chemical-free, gmo-free, and they just smell awesome! I Love Eminence!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Debra Pena",
      "helpful_votes": 0,
      "publication_date": 20140521
    },
    {
      "title": "Not for me",
      "text": "Reacted poorly to this Line. It smells terrific and feels nice. It just breaks me out.",
      "rating": 2.0,
      "verified": true,
      "author": "Charlotte",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "No change in broken capillaries.",
      "text": "Finished the bottle, see no change in the broken capillaries . I used it as a moisturiser at night half way through, when I realized that it does not work. It was OK, has natural ingredients, but I do not see much value in it.",
      "rating": 2.0,
      "verified": true,
      "author": "Ola",
      "helpful_votes": 2,
      "publication_date": 20140924
    },
    {
      "title": "i've had this for about six months and it hasn't ...",
      "text": "i've had this for about six months and it hasn't really done anything to help redness. it reduces my redness a little bit right after applying it, though i wouldn't say it helps long term",
      "rating": 2.0,
      "verified": true,
      "author": "Emma Strickland",
      "helpful_votes": 2,
      "publication_date": 20160131
    },
    {
      "title": "love it!",
      "text": "I love this product! It evens out my skin tone and heals blemishes quickly. No sting, no smell, doesn't dry out my skin. I use it every night before moisturizing.",
      "rating": 5.0,
      "verified": true,
      "author": "Music lover",
      "helpful_votes": 0,
      "publication_date": 20151230
    },
    {
      "title": "Emnence Organic products are simply the best, I love them for my sensitive skin",
      "text": "Emnence Organic products are simply the best, I love them for my sensitive skin. It was delivered quickly and no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "West Coast Mom",
      "helpful_votes": 0,
      "publication_date": 20150226
    },
    {
      "title": "very good, I recommended it",
      "text": "An excelente product for rosácea, very, very good, I recommended it.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn Castro Santiago",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "This is my absolutely nuber 1 product from Eninence. ...",
      "text": "This is my absolutely nuber 1 product from Eninence. Makes my skin look brighter and fresh. Have beeing using it for many years.",
      "rating": 5.0,
      "verified": true,
      "author": "N. G.",
      "helpful_votes": 0,
      "publication_date": 20150521
    },
    {
      "title": "Five Stars",
      "text": "Excellent serum, has helped control my rosacea and my skin is the best it’s been in a long time",
      "rating": 5.0,
      "verified": true,
      "author": "L. Burns",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Not Good for Rosacea-Bump prone Skin",
      "text": "Caused massive rosacea bump breakout on me, so if you have that type of skin problem, I'd avoid this.",
      "rating": 3.0,
      "verified": true,
      "author": "DashOneCharlie",
      "helpful_votes": 0,
      "publication_date": 20151023
    },
    {
      "title": "Five Stars",
      "text": "this keeps the skin supple and great for anti aging",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph DePena",
      "helpful_votes": 0,
      "publication_date": 20150319
    },
    {
      "title": "This is great product",
      "text": "This is great product I have used this for a few years. It makes the skin feel smooth and soft. One bottle lasts a long time",
      "rating": 5.0,
      "verified": true,
      "author": "Just Tess",
      "helpful_votes": 0,
      "publication_date": 20131123
    },
    {
      "title": "Just came",
      "text": "I was hesitant getting this because it's so difficult to try to find the right Eminence serum. I love this serum...feels wonderful on and my essential oils absorb better with this serum. I like this one more than the Acai Booster Firm skin serum by Eminence but maybe because my skin does not need the firm skin serum since I'm not at this stage of aging yet. I bought the Acai Booster serum because of the anti aging and not for the firmer skin benefits. This Couperosa-c serum feels better on my skin than the Acai Booster because it really absorbs unlike the Acai Booster.",
      "rating": 5.0,
      "verified": true,
      "author": "RD",
      "helpful_votes": 0,
      "publication_date": 20140612
    },
    {
      "title": "Five Stars",
      "text": "My husband loves to use this product for his Rosacea.",
      "rating": 5.0,
      "verified": true,
      "author": "SKuts",
      "helpful_votes": 0,
      "publication_date": 20150320
    },
    {
      "title": "Very moisturising",
      "text": "This oil/serum is very moisturising and healing. If you are looking to avoid wrinkles, or want to reduce the ones you already have, you should give it a try!",
      "rating": 5.0,
      "verified": true,
      "author": "shannon",
      "helpful_votes": 0,
      "publication_date": 20140602
    },
    {
      "title": "Good stuff",
      "text": "I use this in conjunction with the Derma Roller and my skin loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Graphic Designer",
      "helpful_votes": 0,
      "publication_date": 20150328
    },
    {
      "title": "love couperose C serum",
      "text": "I love this serum! I recently developed rosacea and would get red itchy bumps on my face. None of the prescription creams the dermatologist prescribed worked anywhere near as well as this serum. I keep getting told I have great skin again now that I've found this serum. The other products I've tried have also been great such as the sweet red rose cleanser, rosewhip moisturizer and the calming arnica masque are all fantastic!",
      "rating": 5.0,
      "verified": true,
      "author": "West Coast Mom",
      "helpful_votes": 16,
      "publication_date": 20110812
    },
    {
      "title": "LOVE",
      "text": "I started to get broken red blood vessels on my face for some reason i googled and saw this, i am so glad i bought it...after 4 days in the morning and night of use i would say its at least 50% better , its not noticable to anyone else anymore but myself..I am so happy thank you!!!",
      "rating": 5.0,
      "verified": true,
      "author": "jocelyn laursen",
      "helpful_votes": 8,
      "publication_date": 20140213
    },
    {
      "title": "I love this product",
      "text": "I love this product. I have had rosacea for the years, and this is the only product that has actually improved it. I order from this company because they are always prompt on sending the product.",
      "rating": 5.0,
      "verified": true,
      "author": "girlwholikestohavefun",
      "helpful_votes": 0,
      "publication_date": 20131019
    },
    {
      "title": "Five Stars",
      "text": "Perfect product! Tried to use some thing else but worse",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah N",
      "helpful_votes": 0,
      "publication_date": 20150331
    },
    {
      "title": "love this stuff.",
      "text": "i've ordered this product at least 3 times now. it's great, organic vitamin c...my skin is so happy and loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin Lee Geisler",
      "helpful_votes": 0,
      "publication_date": 20130729
    },
    {
      "title": "Excellent serum",
      "text": "I have used this serum for years and it is hands down the best facial serum. You can not go wrong with any Eminence product.",
      "rating": 5.0,
      "verified": true,
      "author": "Mamaof3",
      "helpful_votes": 0,
      "publication_date": 20140401
    },
    {
      "title": "Good moisturizer",
      "text": "I bought it for my rosacea. It definetely makes my cheeks look less dry. I have a mild form of rosacea. I expected the serum to reduce redness. It actually does but just a bit. I like the sensations though. It smells nice. I use only a drop for the red spots. I am pretty satisfied. I did not expect a miracle. Was delivered earlier than I expected.",
      "rating": 4.0,
      "verified": true,
      "author": "Lana",
      "helpful_votes": 0,
      "publication_date": 20140422
    },
    {
      "title": "useless",
      "text": "if you want to spend money for nothing in return, then this is your product. Useless and too expensive! Not worth trying.",
      "rating": 2.0,
      "verified": true,
      "author": "Pascale Hartmann",
      "helpful_votes": 0,
      "publication_date": 20130807
    },
    {
      "title": "OK",
      "text": "I HAVE BEEN USING THIS MOSTLY ON MY NECK AND UPPER CHEST AREA WHERE DAMAGE WAS FROM SUN BATHING AND TANNING BEDS AND IT SEEMS TO BE SLOWLY LESSENING THE PERMANANT REDDENING AND DAMAGE.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20131025
    },
    {
      "title": "Nice Serum",
      "text": "Awesome serum. I can't really afford to keep buying it but someday in the future I will treat myself to it. It helps balance out the skin tone.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Nicole",
      "helpful_votes": 0,
      "publication_date": 20140113
    },
    {
      "title": "Excellent value",
      "text": "One quarter of the price I paid at the spa. This serum has made a huge difference in my complexion. One ounce lasted me 11 months. BUY IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Stellmaker",
      "helpful_votes": 3,
      "publication_date": 20140101
    },
    {
      "title": "Five Stars",
      "text": "Wow this is the best C serum I've ever found. Really makes me skin glow",
      "rating": 5.0,
      "verified": true,
      "author": "kimberlandia",
      "helpful_votes": 0,
      "publication_date": 20150223
    }
  ],
  "product_meta": {
    "title": "Eminence Couperose-c Serum, 1 Ounce",
    "description": "Eminence Organics Couperose-C Serum(1 oz./30 ml)Benefits For sensitive, reactive, oily, rocacea, dehydrated and dry skin types This serum is an intensive nourishing, anti-irritant designed to assist in reducing inflamed or irritated areas immediately Couperose-C assists in the treatment of broken capillaries and rosacea, supplies high levels of Vitamin C and bioflavonoids Reduces trans-epidermal water lossThe epidermis will become visibly tighter with the natural abilities of lavender Skin tissues are deeply moisturized, and cells are repaired and duplicated by supplying essential nutrients Features Lavender and peppermint acts as an natural antiseptic Rosehip assists in regeneration Horsetail reduces inflammation and calms irritationEminence Organics is a highly effective, entirely organic skin care line. With all naturally organic ingredients these hand-made products are effective and extremely healing. Rich in vitamins, active ingredients and nutrients, Eminence products will give you immediate results that you will see and feel.",
    "rating": 3.9,
    "feature_bullets": [
      "Intensive nourishing, anti-irritant designed to assist in reducing inflamed or irritated areas immediately",
      "Epidermis will become visibly tighter",
      "Acts as a natural antiseptic along with the peppermint"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "2.8 x 2.8 x 2.8 inches; 0.96 Ounces",
      "Item model number": "141/Em",
      "UPC": "885714803600 885739740744 885204360026 885494686899 140269233013 827131201904 885157717212 827147382956 827142689647 885184720582 608866336082 827147670886 827184322588 887854682039 885450207083 885910894044 680474606641 887366753227 885464035900 827114269464 827122496074 884433639767 885561970128 885172874754 881321505609 885371094519 885372363911 885136937969 884771412398 885220814459 827169101627 885478514231 701992509549",
      "Manufacturer": "Eminence",
      "ASIN": "B001CL9XHW",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Treatments & Masks",
      "Face",
      "Beauty & Personal Care",
      "Serums"
    ],
    "price": ""
  }
}