{
  "website_summaries": [
    {
      "verdict": "Common type of prime lens has hundreds of uses. Reasonable price for a fixed focal lens.",
      "pros": [
        "Excellent photographic quality",
        "Fast aperture lens helps with shooting portraits",
        "Compact, lightweight design",
        "Works with both manual and automatic focus",
        "You'll have success with close-up photography"
      ],
      "cons": [
        "No zoom or telephoto option for shooting photos of far-off subjects"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "A must for Portrait photography",
      "text": "Love love love!! Ive been DYING to get this lens forever. This is my second time buying this type of lens and this one takes the cake. came brand spanking new great condition, box was safe and secure. And the photos it produces are beautiful with amazing depth of field!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ripley",
      "helpful_votes": 240,
      "publication_date": 20160527
    },
    {
      "title": "Fabulous lens and affordable",
      "text": "I use it with Nikon D7200. I had it with kit lenses 18-55 and 55-300. While that covers the entire spectrum, the lenses aren't that fast. Picked up this one as I always had a 50mm 1.4 with my 35mm SLR. This one is roughly equivalent. About 52mm equivalent. Since buying, I have stopped using the zoom lenses practically. This is fast and gives a natural viewing angle with razor sharp pictures. This is a high quality glass. Don't slap on additional filters in the front. Use bare lens and it will do the magic.",
      "rating": 5.0,
      "verified": true,
      "author": "Debasis Goswami",
      "helpful_votes": 43,
      "publication_date": 20170502
    },
    {
      "title": "Excellent lens",
      "text": "I have a Nikon D7000 and my wife has a D5100. I have a 50mm prime lens that offers great shots, but this 35mm lens offers AWESOME shots! I love this lens. Great color, ease of use, wider aperture. Built well. This is the only lens I have been carrying around along with a telephoto lens. You cannot go wrong for the price. You can let the camera focus for you or just turn the lens and manually focus. I allow the camera to do it. The lens doesn't move when focusing, only the focus ring. Great shots in low light.",
      "rating": 5.0,
      "verified": true,
      "author": "wilddog",
      "helpful_votes": 61,
      "publication_date": 20161018
    },
    {
      "title": "Astrophotography hobby.",
      "text": "Excelente lens for night photography (astrophotography) which is what I was looking for. I have a nikon d3400 paired with this lens. Affordable solution combination between lense and camera. f1.8 20 seconds shutter speed. I live in city with lots of light pollution, but was still able to capture them. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Jorge",
      "helpful_votes": 19,
      "publication_date": 20171112
    },
    {
      "title": "It takes amazing photos, very detailed and crisp",
      "text": "I have a Nikon D3200 that up until now I've only had the 18-55mm kit lens for. I was about to give up on casual photography because I was frustrated that I couldn't get the photos I wanted, I thought my camera was the issue. After doing some research, I purchased this prime lens. Turns out that's all I needed! It takes amazing photos, very detailed and crisp, fantastic focusing capabilities. I can't wait to use it more and really see what it can do. This is a good option for anyone who's ready to move on from a kit lens but not necessarily interested in a more expensive lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Tori",
      "helpful_votes": 7,
      "publication_date": 20180401
    },
    {
      "title": "Shhh, don't anyone tell Nikon they under-priced this lens",
      "text": "Absolutely loving this lens! A good quality lens can be VERY expensive, this lens is not (not expensive that is). Can you buy a better lens? Absolutely. Can you buy a better lens at this price point? I doubt it. I'm currently using this lens on a Nikon D7200 and couldn't be happier with the pictures it's producing. The best part? Fantastic low light performance. I keep taking pictures as I'm thinking to myself \"yeah, I'm going to need to use a flash if I want this one to come out...\" and then when I take a look at the picture I\"m like \"where in the #&%@ did all that light come from?!?!\"",
      "rating": 5.0,
      "verified": true,
      "author": "Larry D",
      "helpful_votes": 21,
      "publication_date": 20161228
    },
    {
      "title": "This is such a great value lens for DX Nikon cameras",
      "text": "This is such a great value lens for DX Nikon cameras. It is very sharp at f/1.8, and the 35mm focal length is great for travel, street, and even portrait shooting. Instant focus override is so much more convenient than having to change the focus mode manually like on the 50mm f/1.4D.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared Murray",
      "helpful_votes": 33,
      "publication_date": 20150213
    },
    {
      "title": "Arrived on time & in great safe packaging",
      "text": "Arrived on time & in great safe packaging. I was really excited to get this lens. It would be my first lens purchase aside from my kit lenses. WOW it really blows those out of the water! It is a prime lens, that means its not zoomable. You must zoom with your feet! I am a beginner photographer and needed my photos to look a little more professional. Very pleased with this lens! I have attached 3 sample photos!",
      "rating": 5.0,
      "verified": true,
      "author": "Tj bounds",
      "helpful_votes": 19,
      "publication_date": 20160312
    },
    {
      "title": "Renewed my love for photography.",
      "text": "I love this new portrait lens. It breathes new life into my camera. The photos really look amazing without any setting tweaking. This lens has a very specific task and it does it very well. Its not an end all lens, but its a really great addition to my camera bag. I'm so glad I made this purchase. It really renewed my interest in photography again and gets me to choose my dslr again and again over my smaller more convenient cameras. The picture quality is really something else even though I have a 8 year old camera. If your thinking about it, just get it, you'll be glad you did.",
      "rating": 5.0,
      "verified": true,
      "author": "Maddog",
      "helpful_votes": 4,
      "publication_date": 20171220
    },
    {
      "title": "Love the Bokeh!!",
      "text": "Love this lens. Even though people said it, I was still really surprised at how well my pictures could look with a better lens. Just for the record, I am a photography noob, I only recently purchased the Nikon D3400. Still, despite being a novice this lens is dead simple to use. All you need to do is attach it. With Auto focus enabled you can get great shots right out of the box. And, it has beautiful bokeh!! (Yay, I learned a photography word :-) I'm still getting used to the staggering price of lenses, but for less than $200 and you can't got wrong with this lens.",
      "rating": 5.0,
      "verified": true,
      "author": "APOLLOSTEES",
      "helpful_votes": 4,
      "publication_date": 20171029
    },
    {
      "title": "Changing the game for ever!",
      "text": "I bought this about 3 years ago. It changed my basic Nikon D3200 into something that I love so much more. I do a lot of people photography and same with local shows with friends. These are all on my Nikon D3200 with this lens. The camera itself really holds up at night most of the time. So glad I bought this.",
      "rating": 5.0,
      "verified": true,
      "author": "Shayna O'callaghan",
      "helpful_votes": 7,
      "publication_date": 20180313
    },
    {
      "title": "...Not so much with the re-build quality...",
      "text": "Focus ring on lens operates incredibly hard. Checked this on a brand new nikon 35mm and it was smooth. Refurbished lens is garbage. A brand new one is less than 20 dollars more than the refurbished one. Returning this item and buying a new one. I would not recommend buying a refurbished lens to anyone",
      "rating": 1.0,
      "verified": true,
      "author": "matthew",
      "helpful_votes": 8,
      "publication_date": 20170705
    },
    {
      "title": "Best purchase for my camera so far",
      "text": "I purchased a D3400 kit that came with two lenses, and I knew immediately that I would also want a 35mm lens to go with it. If I could go back in time I would just order the camera without the kit, because this lens goes way above and beyond what I could hope to get with those kit lenses. I only need the camera for photographing my pets and baby (coming soon!), so I don't need anything super fancy. I still haven't gotten all of the settings on the camera 100% how I want them, but I'm really happy with the photos I was able to get using the lens and some test shots yesterday (while overcast) indoors.",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla Sharp",
      "helpful_votes": 4,
      "publication_date": 20180522
    },
    {
      "title": "Great value, large aperture and nikkor glass.",
      "text": "If you have a nikon dx camera you need to treat yourself to this lens. Great value and you do need at least one prime lens in your kit. Focuses silently and is sharp and fast. Sharpest at around f2.2 but very acceptable at any stop. Great for low light and indoor stuff and really does allow you to get creative with soft backgrounds and depth of field. I mostly use my 18-250 superzoom for the versatility but this lens spends more and more time on my camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Fodder",
      "helpful_votes": 3,
      "publication_date": 20180120
    },
    {
      "title": "Fantastic lens. I could not believe the difference this ...",
      "text": "Fantastic lens. I could not believe the difference this lens made. I have replaced the lenses that came with my Nikon D3400. This lens produces crisp photos. With such a fast shutter it’s easier to catch the best shots of my constantly moving kids. There’s no zoom obviously so you have to position yourself for the best shots. The lens creates great depth of field and is good for bokeh shots. Highly recommend!!!!!📷",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Conner",
      "helpful_votes": 5,
      "publication_date": 20180107
    },
    {
      "title": "Good quality - d3400",
      "text": "I'm using this on a crop sensor of my d3400 so it translates into roughly a 50mm which I personally consider a great and very versatile focal length. I shoot portraits and have this one paired with my 85mm. Very reliable lens for 3/4 and full body shots. Nice picture quality and sharpness. Note that full-frame users will see some more vignetting as this one is specifically designed for compatibility with DX sensors.",
      "rating": 5.0,
      "verified": true,
      "author": "Oscar",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "You won't regret this lens.",
      "text": "This lens is the best lens I own. I don't know why I even try to take photos with any other lens. The photos are so sharp. The colors vibrant. The two photos I included here are completely untouched in post. Taken on a Nikon D3500, which is a decent camera... Although I am sure there are better cameras. This lens makes the camera seem even better.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Great Sharp Lens",
      "text": "Good lens. This lens takes in a lot of light which is great indoors or other challenging conditions. I'm using the Nikon D5500 and with the crop, this lens isn't tight enough for true portrait photography, but I love it. This angle is wide enough to capture the man and the horse, or the child and the toys. Step back and this focal length is great for some wider shots too. Bokeh is okay. The autofocus is a bit loud.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 4,
      "publication_date": 20170131
    },
    {
      "title": "My Favorite Lens",
      "text": "This was my first prime lens. It is so perfect for what I need. I take a lot of pictures of animals & animals are constantly moving so I need my shutter speed to be able to keep up with them. This lens does that and more. It's also really hard to get animals to sit still once you've found the picture perfect background, so the shallow depth of field really works in my favor when they wander out of the framing I've set up in my mind. I love this lens & I use it more than any other lens I have.",
      "rating": 5.0,
      "verified": true,
      "author": "Becki Mayo",
      "helpful_votes": 15,
      "publication_date": 20161218
    },
    {
      "title": "Cheap, but Great",
      "text": "This lens is great in everyday photography! It is very fast, light, and great in low light. Gives some great bokeh, even at 1.8, but it becomes better at 2.5 - 2.8. Great for street photography and for portraits. It also works great when filming, very useful at parties. Here's a sample of a video with 35mm:  . Get it! It's too cheap to pass it on!",
      "rating": 5.0,
      "verified": true,
      "author": "Public Name",
      "helpful_votes": 14,
      "publication_date": 20150312
    },
    {
      "title": "You'll love this 35mm lens",
      "text": "I can't believe Ive never invested in other lenses before, I currently own a Nikon D7200 and I had always just used the lens kit it came with ( the 18-55 mm zoom lens ) but lately Ive been taking photography more serious and decided to invest in my first prime lense and oh my god Im so glad I did. I feel that it gives photos ( especially portraits ) more depth and a different perspective. This photo I took of my Cousin is completely unedited was taken in natural lighting. If you want to see more examples of photos that I took with this 35mm prime lens follow me on my Instagram @guadalupekfacundo , thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Moonbeam 🌙",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Love, love, love",
      "text": "Ok, first off I've wanted this lense for SO long. Finally I have it and I gotta say it's my favorite lense. It's great as an everyday lense if you're far away enough and don't need to be zooming in and out. But it's absolutely amazing for portrait photography. If your having doubts about this lense. Dont. Particularly if you're doing portraits! I have much fun using it. The auto focus is great, though I prefer the manual mode. There is nothing I don't love about this lense.",
      "rating": 5.0,
      "verified": true,
      "author": "Lmon95",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Quality and price make it highly recommended",
      "text": "If you are not a very knowledgeable photographer, the bottom line is this lens makes good pictures from relatively close and indoors, possibly under dimmer light (not fully tested by me, but I believe that) . If you want to take pictures outdoors, especially birds, animals or landscape, it is probably not much better than the stock lens of the camera. This being said, I carry it and has replaced the original stock lens in daily usage.",
      "rating": 5.0,
      "verified": true,
      "author": "Randomly",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Better blur effect than adjustable lens",
      "text": "Nice and simple, a great value. If you're a photography amateur, like me, you probably are looking for a lens that can get you better fancy blur effects than your Nikon's adjustable lens that came with it. This is that lens. The gist of why this is better is that adjustable lenses give up some quality in exchange for adjustability. So if you're willing to take on the additional challenge of moving your camera closer to your subject to zoom in, and farther away to zoom out, you will get superior photos with this lens. It's also super small, which makes carrying the camera around even easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "The photo clarity is great in low light",
      "text": "Got this lens for the holidays and wow!! I turn the camera to A mode, f/1.8, AF-S, auto area AF mode and shoot. The photo clarity is great in low light ,great lens for indoor Christmas and out door Christmas lights. Nice and light easy to carry. Has an outer fine focus ring that works well and makes this lens fun to work. I use the lens on a D5100 and use my D5300 for using AF-P lens, makes a great tandem. So far i see no draw backs to this lens and am very glade to have it.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy B",
      "helpful_votes": 3,
      "publication_date": 20171227
    },
    {
      "title": "Worth the money",
      "text": "Gorgeous lens. I have an older body with a crop sensor (Nikon D3300) but it works beautifully with this lens and creates some really gorgeous images. Autofocus can sometimes be a little finnicky, but the MF/AF mode lets you adjust as necessary anyway, or it's easy enough to click over to manual and adjust as needed. Sharp images, minimal chromatic aberration, absolutely worth the price that I paid for it!",
      "rating": 5.0,
      "verified": true,
      "author": "Maddie",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "The only lens you need",
      "text": "I'm no professional but this lens makes me feel like one. I've heard so many photographers tell me this is the best bang for the buck and I'd have to agree. Fast as all get out. And for the price, I have already captured enough memories to make this thing pay for itself 10 times. I have no problem investing in photography equipment and this isn't even much of an investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Perfect for Amateurs. Best must buy cheap lens to buy.",
      "text": "Oh my goodness. I initially had my doubts about the performance of this lens. Being so cheap and hearing some reviews I was a bit worried about the bokeh and overall performance of the lens. But holy moley! this lens performs so well. Compared to the kit lens of my D3300 this is so much sharp and the bokeh hmmm... so good. I know that compared to more expensive/pro lenses this one falls short in every way but for an amateur like me is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "JC Cruz",
      "helpful_votes": 2,
      "publication_date": 20170824
    },
    {
      "title": "If you want sharp images buy the better glass.",
      "text": "After I have heard many photographers say how well this lens shoots and its sharpness is equal to the 1.4, I purchased this lense. It is not what everyone says and now I will be selling it to purchase the 35mm 1.4. Overall there is nothing wrong with the lens, but being a portrait photographer I am a stickler for sharpness which this lens does not deliver on.",
      "rating": 3.0,
      "verified": true,
      "author": "TheShue",
      "helpful_votes": 5,
      "publication_date": 20160529
    },
    {
      "title": "Stellar Lens - A must have for anyone looking to take great photos.",
      "text": "I gave this lens to my wife as a present and it's been one of the greatest gifts. It is great for taking portraits of people and makes for amazing looking photos. It's not great for taking pictures of landscapes though. The quality of the lens is nice and it came with a great carrying case that fits our other lens as well. I recommend this lens.",
      "rating": 5.0,
      "verified": true,
      "author": "MKBalla",
      "helpful_votes": 5,
      "publication_date": 20160822
    },
    {
      "title": "The best starter lens you can get!",
      "text": "I absolutely love this lens! The 35mm on my d3200 works great and mimics a 50mm due to the crop factor of my camera. The build on the lens is very solid and it comes with a hood/shroud, carrying bag and caps for rear and front of the lens. Pictures with this are very nice and very accurate needing very little adjustments. I would highly recommend this as a first purchase for people looking to get a lens beyond the kit lens",
      "rating": 5.0,
      "verified": true,
      "author": "James Z Langill",
      "helpful_votes": 6,
      "publication_date": 20160611
    },
    {
      "title": "Perfect for its intended purpose",
      "text": "This is way too good of a lens for the price. Needed a fast lens for low light photos, and was leery of spending less than $200 for a lens whose competitors can run into the thousands. But having others that won't open up to anything near f/1.8, this seemed to fill the gap. It's tack sharp, auto-focuses quickly and, not the least of its benefits, it's feather light--the incremental weight on a camera is negligible to nonexistent. Finally, it seemed as if the fixed focal length would be a shortcoming, but being 'forced' to walk around for composition opens up new perspectives that a stationary zoom can't reveal. Enough said.",
      "rating": 5.0,
      "verified": true,
      "author": "jowct",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "This lens is awesome. I bought it as my first investment for ...",
      "text": "This lens is awesome. I bought it as my first investment for my Nikon 3400. I'm amazed at the versatility and photo quality. I was skeptical about getting a 35 prime. It's quickly become my go to for all sorts of photo ops.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 6,
      "publication_date": 20170805
    },
    {
      "title": "Overall would recommend!",
      "text": "Overall I really like this lens. I'm using the Nikon D5200 and I get some beautiful portraits out of it in good lighting, however it tends to suffer in low light which I was surprised by, even when cranking up the ISO and lowering the shutter speed. To get the correct exposure I would have to lower the shutter speed to the point that the photo blurs. So this is not great for hand-held indoor photography like shooting a reception or party. However the minute you step outside, the photos are crisp and the bokeh is beautiful!",
      "rating": 4.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Great lens on my D5200",
      "text": "If you own an SLR, it's probably worth your while to purchase this lens - it will clarify what \"sharp\" means. With the aperture opened up, you can create some extremely small focus depths; and you can shut it down to gain more depth, if needed. Portrait shots look fantastic, even in low light. It's very nice to be able to shoot handheld pics in low light without having to use the flash. The lack of zoom could be considered a drawback to some, but you can crop pics with this lens and achieve the same effect. It's definitely my go-to lens.",
      "rating": 5.0,
      "verified": true,
      "author": "idcuda",
      "helpful_votes": 4,
      "publication_date": 20141226
    },
    {
      "title": "Best all-rounder!",
      "text": "If there's just one lens you can get, it's this one! Takes super nice pictures. Beautiful bokeh (blurry background) very crisp pictures and superb in low light! I'm a bloody beginner and still take terrific pictures with this lens on my Nikon D3300. Great for portraits, landscape as well as street photography.",
      "rating": 5.0,
      "verified": true,
      "author": "Feeij",
      "helpful_votes": 3,
      "publication_date": 20170404
    },
    {
      "title": "Great Lens",
      "text": "Only had this for a day, but as you can see from the UNTOUCHED pictures I posted that were taken immediately after opening the lens box, this is an awesome lens. The clarity is unbelievable. I'll be using this for a lot of portraits. I like this lens so much that I even ordered the 50mm 1.8G lens this morning, as I do want to play with different depths of field, both indoor and outdoor. Will update my review in the coming weeks as I get a chance to play with this lens more.",
      "rating": 5.0,
      "verified": true,
      "author": "Sgt V.",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Best all around lens you can buy",
      "text": "This lens brought the level of detail and presentation of my photos to an incredible level. What I used to have to do in photoshop after the fact I can now do with a simple shot. Some of the recent photos with the lens attached.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Great lens",
      "text": "I’m not a professional photographer. I just take pictures sometimes for fun. I have a D7100 and it came with a 18mm-140mm lens which is good all around. I wanted a prime lease and purchased this on accident thinking I was viewing the 50mm. But I actually was pleased with it and kept it while still ordering the 50mm anyway. It seems to have decent wide view and a good bokeh. Which is what I actually wanted. It’s fun an easy to get a decent shot with it for portrait images so I’d recommend it for that.",
      "rating": 5.0,
      "verified": true,
      "author": "Eliezer",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Nice step up from standard lens",
      "text": "I have really enjoyed using this lens. The quality is amazing and you can tell a huge difference when switching from the standard Nikon lens. There is not a true autofocus setting, but a manual/auto feature where you still need to manually adjust the focus in the right ballpark before it will auto focus. There is also no zoom feature, but not usually an issue with portrait photography.",
      "rating": 4.0,
      "verified": true,
      "author": "Courtney M. Jones",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Great lens for tot shots",
      "text": "I love this lens for getting fast and beautiful photos of my son and my friend's children. It takes bright and beautiful portraits. The one downfall is the manual focus is time consuming and the automatic focus has a problem detecting faces. It is difficult at times to not get it to focus on a child's shoulders instead of their face. I hate getting a perfect shot and then uploading it just to realize on the computer that the face is just so slightly out of focus.",
      "rating": 4.0,
      "verified": true,
      "author": "Becky Hundeby",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Best bang for a beginner",
      "text": "It's not the Best Lens EVAR!!111!!2!11!! But for $200 it's absolutely worth buying. This absolutely blows the kit 18-55 out of the water. It was the only lens I used for a year. If you're just starting off with photography, get this lens. I can't recommend it enough to beginners! If you are deep into photography, there's a good chance you'll be looking more towards the f/1.4 35mm instead. That one just costs 3x what this one does....",
      "rating": 5.0,
      "verified": true,
      "author": "Deth",
      "helpful_votes": 3,
      "publication_date": 20170207
    },
    {
      "title": "I'm loving it so far",
      "text": "I took it out for a photoshoot the other day and i loved the photos. The bokeh effect is kinda mild because it's 1.8 after all, but with good distance between foreground and background you can get a nice one! smooth lovely pictures, much nicer than any of my kit lens and a great value, it came packaged in lots of peanut foam and a small sturdy box AND with those inflatable cushions, so they are careful with your shipment! Great lens for portraits, maybe not so much for landscapes because as prime lenses can't 'zoom in or out' you have to be the right distance away obviously. Really pleased with it so far, thanks a bunch <3",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "A very nice, sharp lens, better than a zoom.",
      "text": "This is an excellent lens and on a Nikon D3300 or similar camera it is like a 50mm lens (normal lens) would be on a 35mm film SLR or full frame DSLR. A prime lens like this is much sharper than a zoom lens so I think anyone using a Nikon D3300 or similar camera would get a lot of good use out of this lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Maine BoyTop Contributor: Photography",
      "helpful_votes": 4,
      "publication_date": 20161109
    },
    {
      "title": "Must Have for DX Cameras",
      "text": "Whether you're a fan of Ken Rockwell or not, you can't disagree that this is one of the best DX lenses and a must have if you own a Nikon DX body. You could really get away with owning just this lens if you wanted to. I own this lens, a 55-200, and UWA 11-20. But this lens is by default what is on my camera in the gear bag. On top of that its ~$200!?!",
      "rating": 5.0,
      "verified": true,
      "author": "Collin Mooney",
      "helpful_votes": 4,
      "publication_date": 20160707
    },
    {
      "title": "Tool for my journey",
      "text": "I am new photography. This is a late hobby for me. I have recently discovered that always loved a great photo. Unfortunately, I can't be overly technical in my review on how this specific lens performs vs another. I can tell you that Nikon's APS-C line does the job well for an amateur. I am not disappointed in the least bit, except that I wish that I was shooting more. The 35 mm lens was delivered in perfect condition and works well. I am already getting some decent shots with it. I am thrilled to have it with me on my journey.",
      "rating": 5.0,
      "verified": true,
      "author": "G-Dub",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "it looks pretty good at around f 2",
      "text": "How much should you expect from a $200 lens? Honestly, I expected a bit more. This is a passable lens: it looks pretty good at around f 2.8, but anything wider than that and CA quickly goes from noticeable to unacceptable. It is also less than tack sharp at the edges, although center image is OK. One plus to note is the metal mount vs. Plastic. It is also a warm lens with attractive bokeh. Overall, I'm not embarrassed to have this lens in my bag, but I'm a little embarrassed that Nikon didn't put a little more effort into this lens, even if it had many a slightly higher price point.",
      "rating": 4.0,
      "verified": true,
      "author": "john c stevenson",
      "helpful_votes": 5,
      "publication_date": 20150110
    },
    {
      "title": "A terrific prime lens",
      "text": "This lens should be the first lens purchase after kit lenses. With the image quality potential of recent generation Nikon DX cameras the glass becomes the image quality limiting factor. This lens will make you zoom with your feet but the excellent low light performance, sharp images and nice bokeh will allow you to take shots that kit lenses can't hack. This lens is also a great entryway to manual shooting. The quality/price is unbeatable. You need one.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Great little lens",
      "text": "I already owned the 50mm lens in this line, and wanted another prime a Bit wider, and for the price, it's difficult to top. This gives me a 52mm equivalent on my APS-C cameras, for very natural closer portraits, and is great for street photography. at f/1.8, you're not getting any faster than this for under $200, either.",
      "rating": 5.0,
      "verified": true,
      "author": "J. A. Lovell",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Works Great with Nikon D7500",
      "text": "I just bought a Nikon D7500 past Christmas and everyone's been telling me that I will need a prime lens. Decided to give this a try instead of a 55mm since D7500 has 1.5x crop. Photos turned out great and I love the bokeh effect. I haven't done a lot of portrait photography with it yet but foresee this will be one of my go-to everyday lens now.",
      "rating": 5.0,
      "verified": true,
      "author": "LLD",
      "helpful_votes": 2,
      "publication_date": 20180404
    },
    {
      "title": "Good Little Lens",
      "text": "This is a great lens over all and is about what you pay for. The image isn’t as crisp as I would like, but I understand that’s what Sigma specializes in. The second time I took it out in the field the zoom sounded kind of off and like there was something in the lens. Kind of had me nervous because it was only the second time using it and I had made sure to keep it in the pouch whenever I wasn’t using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Five Stars",
      "text": "I have had 4 or 5 35 mm cameras over the years, many different brands, film and digital.Many Nikon lens ( 35mm, 50mm, 85mm, 20-80mm,18-105mm and 70-300mm This Nikon 35 mm 1.8 G lens is one of the best. this lens is on my Nikon D 7200 DX with the 1.5 crop factor = 52.5mm which is perfect for me and my every day picture taking most of the time. It has a nice fast focus , it is also has a sharp image. For the money i think this is a must lens and at this price is a very good deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Tablerockview",
      "helpful_votes": 3,
      "publication_date": 20160428
    },
    {
      "title": "Purchased over 35mm 1.8 ED & 1.4",
      "text": "This is just an excellent value buy. I was between this, the fx 35mm 1.8 ED, or really saving up for the 1.4, but I'm absolutely satisfied the quality of this lens Autofocus is quick, though audible in video. Great sharpness in focal points, and best of all - the price.",
      "rating": 5.0,
      "verified": true,
      "author": "David Heumann",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Used or Returned product--NOT new",
      "text": "Used or Returned product--NOT new. Box damaged. Pamphlets crinkled, folded awkwardly. Rear Cap either BROKEN and or so loose that it's the wrong cap. This was sold as new.",
      "rating": 1.0,
      "verified": true,
      "author": "LGL",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Great Night Time Lens",
      "text": "Bought this lens at a great price and use it on my D5600. Mainly wanted to test out astrophotography and you are able to take amazing shots of the milky way. The image is cropped, so you can't capture much like a wide angle lens, but the pics are stunning. Pics all around are very sharp with this lens. Great for potraits as well. I ended up buying a tokina 11-16 f2.8 for astrophotography after testing the waters with this lens.",
      "rating": 5.0,
      "verified": true,
      "author": "brkr12002",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Great lens",
      "text": "This is my first prime lens, and the first f1.8 lens. I snapped a couple of quick photos to test it out. Nothing special, but I really like getting some wider apertures. I only had a kit f4 lens before, and I got some excellent pictures from it, even on my Nikon D200. I'm going to take it out for some outdoor and landscape shots very soon.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Royster",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "GREAT for (at least beginner) astrophotography",
      "text": "Im new to cameras in general and got it for astro photography and this is exactly what i was looking for. I look these pictures casually in my backyard which is a light polluted area outside boston and they came out even better than I had thought. I cant wait to go to a very dark area and get pictures of the galaxy. Definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Kenny Peterkin",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Ideal for pet photos",
      "text": "My daughter is involved in animal rescue and fostering. She needed a lens that would take good pet portraits because her 18-200 zoom had many issues when taking portraits. Using this lens, the sharpness and controllable depth of field are outstanding. Her build in flash works well also, where it didn't with the zoom because the light would be blocked. She is very pleased with my gift to her.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill B",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Amazing prime lens for the price",
      "text": "I LOVE this lens! I'm a food blogger and I've been shooting with an old DSLR that I bought back in 2009; this lens really helped me step up my photography game with quality photos (even with a not-so-great camera). With a DX format camera, this 35mm lens is the equivalent of shooting with a 50mm lens with the crop factor. This is my first prime lens and probably one of the best decisions I've made. I'm looking into buying a new camera and I'll definitely be using this lens!",
      "rating": 5.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 0,
      "publication_date": 20171123
    },
    {
      "title": "Step up from stock lens",
      "text": "I am new in photography but wanted to get a better lens to get better. I have the Nikon DX3500. This fit well and huge improvement from the stock however I ended up getting a 50mm and liked it better. I may get this again some day but for someone new I am happy with the 50mm.",
      "rating": 4.0,
      "verified": true,
      "author": "SSSantos",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Great prime lens for my Nikon D3500",
      "text": "I have the Nikon D3500 with the two lens kit. These lenses were fine for getting started with photography, but I wanted something that could perform in low light. The 1.8 aperture does the trick. I have also been able to take some great portrait style shots. Very happy that this was my first lens upgrade.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith Ramey",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Best deal for lens I have ever made",
      "text": "I accidentally broke my 18-105 kit lens. And I have been looking for a short lens to go with my D90. This lens does a perfect job with low aperture and portrait. AND IT'S CHEAPER THAN OTHER ELECTRONIC STORES ON HERE!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jay Chow",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Good lens",
      "text": "The lens was as described used but in near perfect condition. No chips, scratches lens fogging, etc.. The auto focus seems to be a little slower than my other lenses, but by no means a deal breaker. All this and it was way cheaper than a brand new lens. Very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Great Lens",
      "text": "I've taken some of my best photos with this lens. The super tight focal length (F/1.8) gives you a really narrow depth of focus, which can look cool for portraits. It also lets a lot of light in, and so works well in lower-light situations. Photos seem to come out of it with accurate colors, little distortion (if any), and an overall nice look. It's completely replaced my stock kit lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew C. Ek",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Great for getting pictures of antsy kids",
      "text": "This is my first lens that I bought for my camera and it is amazing. The pictures in regards to portraits are excellent in regards to the auto focus. Very fast shot to shot time allows me to capture the kids, and I now have more freedom to not use the flash in light that is a little dimmer than I could with the kit lens. These kids are quick, and now I have the lens to catch those moments that are fleeting.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Darden",
      "helpful_votes": 0,
      "publication_date": 20170220
    },
    {
      "title": "Not recommended for Nikon D5000 series and below",
      "text": "My lens has a serious backfocusing problem when I focus using the viewfinder. It does focus fine when I use live view, but I don't like using that because it is so slow. More advanced Nikon cameras have the ability to fine tune lens, but my D5500 does not.",
      "rating": 1.0,
      "verified": true,
      "author": "ns",
      "helpful_votes": 2,
      "publication_date": 20190623
    },
    {
      "title": "It is well with the price and I love it!",
      "text": "I failed to \"read the instructions\" and thought I messed up! Duh, now I use this lens as my primary lens. It is a super standard lens, light weight, a great value, and well worth the price! It is fairly wide ange, will focus up to 6 inches , and is way more useful than my standard 50mm. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "k. lauer",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "A No-Brainer!",
      "text": "I recently purchased a D7100 and have been using it with my trusty 18-200mm DX VR Nikon. The 18-200 is very good at everything, but not really great at any. With the purchase of this relatively inexpensive 35mm 1.8f DX Nikon I finally own a \"Great\" DX lens for my D7100. No zoom, but the 35mm DX gives me the excellent low light performance I've been missing and tack sharp images like I have not seen from my D7100 until now. Hard to believe anyone who owns a Nikon DX camera would not appreciate having this lens in their bag for a couple hundred bucks. A No-Brainer!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Davis",
      "helpful_votes": 2,
      "publication_date": 20140305
    },
    {
      "title": "great lens",
      "text": "essential for anyone who owns a nikon dslr that needs the S (servo in the lens itself). I bought this to go along with my combo pack of the nikon D3100 (now 3200) that is entry level. this 35 MM is great for low light indoors, fixed length means I have to walk in to zoom, but the action is fast on auto focus. much faster than my 18 to 55 or 50 to 200 that came with the camera. really it's all about shooting kids at iso 100 or 200 indoors with f stop of 1.8 and not needing a flash at 250s shutter. how can you not like it?!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20140225
    },
    {
      "title": "you won't be disappointed! I have a D300s and it is a ...",
      "text": "This lens is worth it! If you are on the fence, just get it, you won't be disappointed! I have a D300s and it is a great match. The quality of the pictures and DOF is what I've been looking for. I see other reviewers complaining about the look of the bookeh, but to me, it looks beautiful, something I can't achieve with my 18-200 or kit lens. This lens is fast to focus and tac-sharp! I can't say enough good about it, especially for the price! So get off that fence and just buy it now!",
      "rating": 5.0,
      "verified": true,
      "author": "Firstname Lastname",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "I've Suddenly Become a Pro at Astronomy",
      "text": "For years I have tried and tried endlessly to get photos of anything significant of the cosmos with my Nikon D5300. Once I got this lens, it was like night and day. I suddenly am now able to get photos of millions of stars and galaxies like the Andromeda Galaxy in a single picture! I've recently been contacted by thousands of world-renowned astronomers who are wanting me to fix issues with their equipment. Although I've been able to fix zero of their problems, I can at least take photos like them! M31/10 would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Random Reviewer",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "It just makes everything look better.",
      "text": "I was getting fed up with my camera until I read another review which said, it's not the camera, it's the lens. Buy this lens and it will improve your photography and you'll finally get shots you like. It saved my camera from the dump.",
      "rating": 5.0,
      "verified": true,
      "author": "Kayne Walker",
      "helpful_votes": 2,
      "publication_date": 20170507
    },
    {
      "title": "A great all-around lens for the price",
      "text": "I love this lens! The quality is so good for the price. I'm not a professional photographer, so I can't get into the specifics of how it works, but in comparison to the lens that came with my Nikon 3400, this is all around so much better. It is lightweight and the depth of field produces wonderful images.",
      "rating": 5.0,
      "verified": true,
      "author": "M.A. Kleen",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "Fast, Sharp, Noisy Auto Focus",
      "text": "This is a great lens. Excellent for portrait work especially is low light. It's sharp but I feel the 50mm f1.8 is even sharper. I have a D series with an APSC sensor which gives this lens an effect 50mm field of view and it's perfect. I wouldn't recommend for video work because the motor is so noisy. There is no image stabilization on this lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin P",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Fixed Portrait Lense for Great Price",
      "text": "Great lense for portraits. We were very happy with the results. I haven't liked it as much for landscape because I like to zoom in here or crop something out there, but for the price it's been a great addition. As I said, in particular for more up close portrait work.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin T.",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "A must on any DX camera.",
      "text": "By far my favorite lense to pair with my D3400. I also have the 50mm 1.8G, but as much as I love the bokeh, I find myself having to back up as far as I can just to capture more background. This lense captures the perfect amount of background with just the right amoumt of blur.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "One of the best DX lenses",
      "text": "I love this one until I bought a full-frame DSLR. This is one of the best camera I had for taking human picture indoor. It's also good for food, but not for grand landscape. It's just because of it's focus. The quality of the pictures from this lenses is fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Walt C.",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "A great lens!",
      "text": "I have to admit that I had gotten so used to having a zoom lens on my camera, that it took a little getting used to using this lens. But it IS a really great lens! Perfect for taking closer indoor shots. When there's not a lot of room between you and your subject.",
      "rating": 5.0,
      "verified": true,
      "author": "John H.",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "PERFECT for portraits",
      "text": "Honestly one of the best purchases I’ve made. My photos now have way less noise and way more depth. I couldn’t be MORE pleased with this lens ESPECIALLY FOR THE PRICE!!!! 10/10 recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Brynne",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Perfect lens for the price!",
      "text": "Love this little lens! Love the price, and the quality is better than what you’d expect for the price. If you’re looking to get started in portraiture and are ballin on a budget, I’d definitely recommend this lens. If you have a little more cash the nikon 50mm 1.8 (preferably the 1.4 but that’s still a lil pricey) is the way I’d go. But otherwise this lens does the trick and gives you an opportunity to make your photos great. Totally something you want to keep in your camera bag & take with you!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cass",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Do not buy this lens if you have a D3400 or any other camera without \"AF Fine Tune\" feature",
      "text": "My camera is one of the many DX models that does not have the \"AF (autofocus) Fine Tune\" function. This lens does not auto focus accurately. It always focuses behind the subject, making the subject blurry. Apparently the lens can always focus accurately in Live View mode, but that mode is much slower and much less convenient than being able to quickly autofocus while using the viewfinder. I put the comparison between the Live View focus and the autofocus in the attached picture. The object in that picture was about 3 feet away from the camera.",
      "rating": 1.0,
      "verified": true,
      "author": "Joshua Najemy",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Game-changer!",
      "text": "Learned with this lens that prime lenses are a complete game-changer! Great for lower light with quicker shutter speeds. Went from using a lens that does everything “OK” to feeling like a cheater at life with this one. Note to amateurs (like myself): can’t get very close to your subject without having an impossibly narrow dept of field, which makes shooting something moving even slightly a pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Cielo Perso",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Wonderful lens to add to your inventory.",
      "text": "I've been a photographer for about 4 years now. Mainly as hobby, but am still very passionate about my work. It was time I finally give my kit lens a break and order something new and exciting. With that being said this is what I turned to and I couldn't be happier. I haven't gotten to test it out much, but once you have everything set up you see an extremely noticeable difference. I read other reviews talking about the lens feeling cheap and fragile, but it honestly felt fine to me. If you are looking to buying another lens, look no further...is a prime choice for a prime price! *Added Bonus* Seller was very fast with shipping!",
      "rating": 5.0,
      "verified": true,
      "author": "Goose",
      "helpful_votes": 3,
      "publication_date": 20150305
    },
    {
      "title": "Best lens!",
      "text": "I got this camera lens for a Nikon D3400. I heard that it was the best especially for the price. I was skeptical at first being I always go by the saying you get what you pay for. Well. You get beyond what you pay for with this lens!! The quality and everything about it is amazing!!! I am a beginner photographer and I needed something better for my shots. I definitely got that with this! I shared two photos I took as soon as I got it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Brittani keena",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Perfect for Low Light, Club Photography and Video",
      "text": "I bought this lens for several reasons, but mostly for its lowlight capabilities and the fact that I'm shooting video and photography in night clubs. In terms of general usage it is fantastic for producing crisps sharp photos and in daylight I highly recommend combining it with an ND filter. For video this is great for helping get the shallow depth of field look of film and also using reverse depth of field techniques in story telling. The build quality is solid, the lens is amazingly fast and the image quality is amazing! If you have a Nikon D3200, D3100, D5200 or D5100 I would say this is a lens you absolutely must invest in.",
      "rating": 5.0,
      "verified": true,
      "author": "Robeto Blake",
      "helpful_votes": 3,
      "publication_date": 20130331
    },
    {
      "title": "Excellent buy.",
      "text": "If you're buying a DSLR for your first time, and it happens to be an APS-C camera, buy this lens. Excellent image quality for its price point. In fact, I would recommend buying your first DSLR without the kit lens, save that money, and buy this lens instead. Yes, it's a fixed focal point lens, but if you really need that zoom take a few steps closer. Getting closer to your subject will almost always trump just zooming in with a zoom lens.",
      "rating": 5.0,
      "verified": true,
      "author": "gameshoes",
      "helpful_votes": 0,
      "publication_date": 20151128
    },
    {
      "title": "... 4x and crop it and it still looks freakin amazing. super sharp",
      "text": "i can zoom in to 4x and crop it and it still looks freakin amazing. super sharp. good price range. at 1.8 its really hard to aim at moving things, the focus, when just a tiny bit off, is completely blurry, so if the autofocus were a tiny bit better that would be amazing. most of the time I'm finding myself too close to the subject and need to back up so if they made a cheaper 28mm i think that would be ideal. 35 is a pretty good size though for general photography, but 85 or 50 is a lot better for portraits. can't focus too close to anything so not great for macro. (50 would be great).",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Taco",
      "helpful_votes": 2,
      "publication_date": 20140810
    },
    {
      "title": "Didnt last.",
      "text": "Loved this lense at first, but this week it has went to crap entirely. First i noticed the focus was a bit soft, and now it wont auto focus at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Diana",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Awesome lens, great price",
      "text": "This lens is what I was looking for, at the right price! My only criticism is that it can be challenging to get a crystal clear image, and the bokeh may not be quite as soft as other lenses. That said, this lens is great and I would highly recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "Isheeta Rahman",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Nice Lens",
      "text": "This lens takes crystal clear sharp photos. It is small and is perfect for carrying all day for whatever occasion or event you happen to be experiencing. I like this lens, but I prefer my Nikon 50mm f/1.8G AF-S NIKKOR FX lens over this one. I simply get better bokeh (background blur) with the 50mm. It is important to note that this is DX lens, so you cannot use it on a full frame FX camera like the 50mm I mentioned. Because it has to be used on a DX camera like the D3300, this lens actually gives you a 50mm view. Overall, you can't go wrong with this lens.",
      "rating": 4.0,
      "verified": true,
      "author": "Jerry Palmerino",
      "helpful_votes": 0,
      "publication_date": 20141104
    },
    {
      "title": "Perfect and decent priced!!!",
      "text": "This is my main lens for in studio. Rarely leaves my Nikon. Yes, not a sigma, but I adore it and the price is right!!! Looking to branch out from your kit lenses, get this one. You won't regret it!!",
      "rating": 5.0,
      "verified": true,
      "author": "sk4u2009",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Fantastic lens for Nikon DX camera",
      "text": "Fantastic lens for Nikon DX camera. I am currently using D5100 and it is definitely sharper than the kit lens that I was using. I relied on these zoom lens for shooting until I decided to try a prime lens once and for all. It did not let me down. The 35mm 1.8G lock in its autofocus faster but accurate, compared to the 18-55mm kit lens I was using. I bought the B+W 52mm Clear UV together with it and Tiffen 52mm Circular Polarizer to take nature shots. In all, this THE lens which all Nikon DX users should get for its low price and better optical and ergonomic performance than the older 35mm f/2 AF-D.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Tan",
      "helpful_votes": 0,
      "publication_date": 20160903
    },
    {
      "title": "Works",
      "text": "Im a new photographer but I find this works better inside and in lower light than my bridge camera. No problems with shipping.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle reader",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Outstanding lens!",
      "text": "It is my first DSLR camera and this lens you must have it. make the camera lighter and covers 80% of your needs. It is fast and great apperture for night and indoor shots. Also it is original from Nikon so you do not have to worry about performance and compatibility. Also the the filter is very important to protect the lenses, because accident does happen and it is easier to clean the filter than the lenses. In addition the cap holder is a nice one to avoid loosing it or forgetting to cover your lens after the shooting.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas Wallace",
      "helpful_votes": 3,
      "publication_date": 20130815
    },
    {
      "title": "Nice Little Portrait Lens",
      "text": "This is a very nice, very fast little lens. I bought this to use on my Nikon D7100 as a portrait lens and it has not disappointed me. Even though I have 35mm in some of my many zoom lenses, have a fixed focal length lens has been a joy work with. It's simple, the auto focus works great and it makes me move around more - which is never a bad thing. The pictures are sharp and with the f/1.8 available, you can play games with depth of field that can add a new dimension to your photographs. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "BZ Cam",
      "helpful_votes": 2,
      "publication_date": 20150804
    },
    {
      "title": "Great for beginners, easy to use, excellent for landscapes and portraits",
      "text": "I’m a very novice photographer and love this lense. I purchased it to capture landscapes and my family on our vacation. It provided excellent results, even when mostly used on the auto mode of the camera. The fixed focal length made me actually use my feet and move around to get the right shot. I loved the new challenge and the vacation photos are some of my favorites I’ve taken.",
      "rating": 5.0,
      "verified": true,
      "author": "Veronica K. ",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "works great",
      "text": "I love this lens. I bought it to take my daughters senior pictures and I was able to blur the background or foreground perfectly! I want to get the 55mm fixed lens to add to my collection.",
      "rating": 5.0,
      "verified": true,
      "author": "duchess of dirt",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "I love this lens",
      "text": "I love this lens. The pictures come out great. Plus the wide aperture allows you do get great nighttime long exposure shots of the stars. It's focal length makes you look at the subject differently, try new angles and the results can be petty amazing. I wish it had some vr though.",
      "rating": 5.0,
      "verified": true,
      "author": "Sikander",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "No image stabilization & not fast shutter to focus in low light",
      "text": "No image stabilization. Can't shoot in low light. Expected faster shutter speed to enable this.",
      "rating": 2.0,
      "verified": true,
      "author": "CE",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Fort he price this fast lens is a great option for the budget minded astro--photographer",
      "text": "Fort he price this fast lens is a great option for the budget minded astro--photographer. Small and light weight but well built.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Matherly",
      "helpful_votes": 3,
      "publication_date": 20170115
    }
  ],
  "product_meta": {
    "title": "Nikon AF-S DX NIKKOR 35mm f/1.8G Lens with Auto Focus for Nikon DSLR Cameras",
    "description": "Style:Lens OnlyThe AF-S DX Nikkor 35mm f/1.8G optical design allows a different look and feel to images taken with zoom lenses, and its dimensions are ideal for discrete snapshots and landscape shooting with a picture angle that approximates that of the human eye. With its rounded seven-blade diaphragm opening, out-of-focus elements appear more natural. When mounted on a DX-format SLR, the picture angle is the 35mm equivalent focal length of 50mm.what's in the box: Nikon AF-S Nikkor 35mm f/1.8G DX Lens, HB-46 Bayonet Lens Hood for AF-S DX NIKKOR 35mm f/1.8G, 52mm Snap-On Lens Cap, LF-1 Rear Lens Cap for F Mount Lenses, CL-0913 Soft Lens Case and 5-Year Warranty (1-Year International + 4-Year USA Extension).\n\nFROM THE MANUFACTURER\n \nWith a compact, lightweight design, the AF-S DX NIKKOR 35mm f/1.8G provides the high reproduction capability and picture quality for which Nikkor lenses are renowned at an affordable price. The ring type SWM offers quiet AF operation. Although all lens groups shift during focusing, the front element and filter mount do not rotate and the barrel length does not change, which is useful when using filter mounted SB-R200 Wireless Remote Speedlight units. \n\nThe AF-S DX Nikkor 35mm f/1.8G optical design allows a different look and feel to images taken with zoom lenses, and its dimensions are ideal for discrete snapshots and landscape shooting with a picture angle that approximates that of the human eye. With its rounded seven-blade diaphragm opening, out-of-focus elements appear more natural. When mounted on a DX-format SLR, the picture angle is the 35mm equivalent focal length of 50mm. \n\nThe AF-S Nikkor 35mm f/1.8G has two focus modes, M/A (manual override autofocus) and M (manual focus). The M/A mode enables instant manual switching during AF operation. The lens also features a rubber seal to minimize moisture ingression around the mount and can focus down to 0.3 meters (0.98 ft).\n\nAF-S DX Nikkor 35mm f/1.8G Lens Highlights \n\n * Fast, f/1.8 prime lens is perfect for low-light conditions, travel, environmental portrait and general photography \n * Engineered for Nikon DX-format D-SLRS, the AF-S DX Nikkor 35mm f/1.8G lens renders a picture angle approximating the classic normal angle of view of a 50mm lens on a Nikon FXformat digital SLR or 35mm film camera \n * Aspherical lens element minimizes coma and other types of lens aberrations, further improving image integrity \n * Nikon Super Integrated Coating (SIC) enhances light transmission efficiency and offers color consistency and reduced flare \n * Exclusive Nikon Silent Wave Motor (SWM) enables fast, accurate and quiet autofocus \n * Close focusing to 1 foot for creative perspectives and versatility \n * Rounded 7-blade diaphragm opening makes out-of-focus elements appear more natural \n * Accepts 52mm filter attachments \n\n\n\n\n\nREVIEW FROM DPREVIEW.COM\n\n\n \n\nLearn more about this camera\nat DPReview.com Nikon 35mm f/1.8G AF-S DX Lens: Highly Recommended by dpreview.com \n\nThe AF-S Nikkor 35mm F1.8G DX is a lens which certainly caused a degree of dismay on its release, with many Nikon fans disappointed by the decision to make it compatible with the DX format only. However the main benefit of that decision is plain for all to see - even at its introductory price the lens costs rather less than the venerable AF-Nikkor 35mm F2.0D, despite the addition of an AF-S motor to allow autofocusing on Nikon's entry-level D40 / D40X / D60 bodies. It's also less than half the price of the few other DX format standard primes currently on the market (such as the Pentax 35mm F2.8 Macro, Tokina 35mm F2.8 Macro and Sigma 30mm F1.4 EX DC HSM), so Nikon has managed with this lens to produce the first genuinely inexpensive (sub-$200) fast standard prime designed specifically for digital SLRs. \n\nWithin this context, the lens's performance is very impressive. It produces finely detailed images at all apertures (although with somewhat low contrast wide open), focuses quickly and accurately, and handles well in a small, light package. In particular, it's much sharper than typical DX standard zooms such as the Nikon AF-S 18-55mm F3.5-5.6 DX VR or Nikon AF-S 18-200mm F3.5-5.6 DX VR. The fast maximum aperture allows pictures to be taken hand-held in low light levels, while maintaining relatively fast shutter speeds to avoid blur from subject motion (a key advantage over image-stabilised, but slow, kit zooms when photographing people without flash indoors). The slightly less tangible aspects of image quality - such as resistance to flare, and the rendition of out-of-focus regions of the frame - are also dealt with nicely. \n\nIf the lens has one major flaw, it is a certain propensity to show chromatic aberration, of both the lateral kind (which can be corrected by the in-camera JPEG processing of the D90 and D300), and the longitudinal (which cannot). To be fair the latter is a pretty well unavoidable with a fast prime, but the 35mm F1.8G DX suffers from it to a rather high degree, and in particular can give some unpleasant purple fringing effects if you're not careful. \n\nOverall, though, it seems almost churlish to complain about these flaws in a lens so inexpensive, which gives otherwise such fine results. It's good to see Nikon finally addressing the lack of purpose-designed, inexpensive fast primes for DX format DSLRs, and we hope they - and other companies - continue with this trend. As it is the 35mm F1.8G DX is, for its winning combination of high image quality, large maximum aperture and low price, a lens which deserves to be on many a Nikon shooter's shopping list. \n\nRead more at dpreview.com \n\n\n\nSee more",
    "rating": 4.8,
    "feature_bullets": [
      "F mount lens/DX format. Picture angle with Nikon DX format 44 degree",
      "52.5 millimeter (35-millimeter equivalent). Rear focusing; Manual focus override",
      "Aperture range: F/1.8 to 22; Dimensions(approx.) 70 x 52.5 millimeter",
      "Silent wave motor AF system. Accepts filter type is screw on. Lens construction: 8 elements in 6 groups",
      "Compatible formats is dx and fx in dx crop mode. Maximum reproduction ratio: 0.16x",
      "Lens not zoomable"
    ],
    "specifications": {
      "Product Dimensions": "2.09 x 2.76 x 2.76 inches",
      "Item Weight": "7.1 ounces",
      "ASIN": "B001S2PPT0",
      "Item model number": "2183",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.8 out of 5 stars8,939 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#3 in Camera Lenses",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 2, 2001",
      "Manufacturer": "Nikon"
    },
    "categories": [
      "SLR Camera Lenses",
      "Electronics",
      "Lenses",
      "Camera & Photo",
      "Camera Lenses"
    ],
    "price": 176.95
  }
}