{
  "website_summaries": [
    {
      "verdict": "A highly versatile 200 watt handheld blender that features an aerating blade, a blending blade, a chopping blade, and a slicing blade.",
      "pros": [
        "The top speed of this impressive immersion blender is 14,000 RPM while the included 4 blades let you perform a wide variety of culinary tasks",
        "The push-button control allows you to easily use either continuous or pulse action when blending"
      ],
      "cons": [
        "The interchangeable blades seem to be either too tight, making them hard to remove, or too loose, allowing them to fall out while blending"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Powerful!!",
      "text": "We looked at a bunch of these immersion blenders after ours died - we had a cheapy one bought at a black Friday sale that dis not last. I had not heard of this brand but after some research seems people have had these for years and years. Great for soups, super powerful, you can feel the entire pot of soup being sucked down in the vortex this creates, no chasing around the pot to blend all the areas in the pot, this has real power. I prefer to buy things once and get my money's worth. This is well-made and great quality. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Orion and Lisa",
      "helpful_votes": 6,
      "publication_date": 20190816
    },
    {
      "title": "****BUYER BEWARE***** = Terrible product + terrible (non-existent) customer service",
      "text": "****BUYER BEWARE***** The Bell on this unit is of a corrosive metal, like aluminum, and will corrode when used in highly acidic foods like tomato sauce and citrus. My unit is still under warranty and I CANNOT GET BAMIX TO HELP! I have contacted 2 customer service departments regarding this blender and they closed my ticket without any attempt at resolution to the problem. This is a disgusting way to treat customers. The picture below shows the corroded head and a tissue with black corroded metal on it, from wiping the bell with the tissue.",
      "rating": 1.0,
      "verified": true,
      "author": "Excellent",
      "helpful_votes": 80,
      "publication_date": 20150325
    },
    {
      "title": "Best Immersion Blender I've owned",
      "text": "I have owned 3 different immersion blenders. All nice ones from Brand Names. This one is by far the best one I've owned. I tossed my most recent one because of the study about immersion blenders leaking Chlorinated Parrafins and mine was one of them. This one doesn't. I also bought the SliceSY food processor and it's expensive, but well worth it. I use it almost every day. It's also nice that it comes with three different blades instead of just one like most blenders.",
      "rating": 5.0,
      "verified": true,
      "author": "ClayG420",
      "helpful_votes": 5,
      "publication_date": 20190403
    },
    {
      "title": "Awesome Immersion Blender!!!!!",
      "text": "I am so impressed by this blender! I have used it for smoothies of course. Beyond that, it is great for chopping onions, peppers, and even nuts! What a great value for everything this is capable of. The only thing I would like better is if the power button that you press on was more of a harder surface and easier to hold down. Other than that, it is absolutely perfect. I also hear their customer service is outstanding (which is so important)",
      "rating": 5.0,
      "verified": true,
      "author": "rindicavitch",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Pro-1 is probably all you need",
      "text": "No one needs more than the Pro-1 for usual use. The stick is plenty long. I overspent on this one but got the meat blade with it, which costs like $30 on its own so in the end it was worth it. Bought this after my Braun stick blender motor died in under 2 yrs of infrequent use. Bamix has a 10yr motor warranty and isn't straight outta Shenzen. It was definitely a splurge, but I'm satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Was working for almost 2 years. Broke shaft screw ...",
      "text": "Was working for almost 2 years. Broke shaft screw today on piece of ice, and I can't believe that such tiny screw was powering the blades. Now trying to get some customer support for repair Changed rating ,service took care of repair in one week",
      "rating": 5.0,
      "verified": true,
      "author": "kaziu1954",
      "helpful_votes": 12,
      "publication_date": 20160219
    },
    {
      "title": "Perfection",
      "text": "I bought a Bamix about 20 some years ago. It died last year and I was lost without it. A Bamix is perfect for soups, sauces, etc. I love the fact that it is portable, simple to use, easy to clean. I could do some of the things in my blender but the convenience of putting the stick into a pot to cream, blend, etc. is much easier and quicker to use. I could not do without it.",
      "rating": 5.0,
      "verified": true,
      "author": "FJV",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Very happy with this product",
      "text": "My old Bamix quit after several years and I needed another one fast! I used it all the time. This new one is more powerful than the old one. They last a long time and are so well built. Very happy with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Quilter",
      "helpful_votes": 4,
      "publication_date": 20171213
    },
    {
      "title": "Powerful tool! Easy to use",
      "text": "I make a lot of soups that are partially or completely blended to give them a smooth texture. I needed something because I feel like it’s potentially dangerous to pour hot soup into a standard blender and back into the pot. This immersion blender is easier to clean than my regular blender too!",
      "rating": 5.0,
      "verified": true,
      "author": "Jayne S",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Good for milk shakes and mayo but not as food processor.",
      "text": "Durable and everlasting is the right description for this heavy duty mixer. Perfect for milk shake, mayo and smoothie. However it is not convenient as a food processor especially for chopping, you need to buy expensive accessories equivalent for a good other brand with fully functioning processing accessories. I managed to do most of blending like tomato paste and other vehicle or fruite paste in a deep flask but not for chopping.",
      "rating": 4.0,
      "verified": true,
      "author": "Diaa Diab",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Bomb-ix :)",
      "text": "Love how easy to clean this is! It fits great in my hand and has a well balanced weight distribution. It blends effortlessly once you get the correct angle to create a circulation of fluids.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "The blades are difficult to put on and remove.",
      "text": "I haven’t used it much yet, but seems powerful. I find the different blades hard to put on and remove. I wanted to call customer service for Help but couldn’t find a phone number 😩",
      "rating": 4.0,
      "verified": true,
      "author": "Sheila Gattis",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Quality Appliance",
      "text": "Blender is simple and powerful. I’ve used it to make a quick whipped cream, blend soups, make frappes, and even hummus. It’s worked better than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelito",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Nice but missing blades",
      "text": "I would have loved to use this blender but the box contained no blades. I'm very disappointed, I recently had gastric surgery and was planning to make a bunch of pureed food recipes with this.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike B.",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "The best",
      "text": "Very high quality. Had previous one for 15 years before it died. Well worth the cost",
      "rating": 5.0,
      "verified": true,
      "author": "S.S.",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Best kitchen appliance I own!",
      "text": "I received my Bamix blender 37 years ago, it still works, this is a gift for my son’s family. Over the years this is the best valve of any kitchen appliance I have ever had. Runs better than the energizer bunny.",
      "rating": 5.0,
      "verified": true,
      "author": "Odie",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Missing blade but good unit",
      "text": "Unit is great but only got 3 blades vs the 4 in this package. This is replacing a bamix that I've had for about 30 years. Think a bearing is going out. If this is anywheres as good as the old one my kids will inherit this one. Once I get the misding blade issue ironed out.",
      "rating": 3.0,
      "verified": true,
      "author": "SylviaTi",
      "helpful_votes": 2,
      "publication_date": 20170323
    },
    {
      "title": "Industrial Strength",
      "text": "I love this thing. Possibly a little large for a normal 1 person kitchen. It is so good though that you don't ever really need to use it for more than about 10 to 12 seconds at a time. With this kind of wear and tear I'll have to leave it in the will for the grand kids to wear out.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Sanchez",
      "helpful_votes": 4,
      "publication_date": 20140523
    },
    {
      "title": "the best ever",
      "text": "I have all kind of kitchen gadgets and have burnt at least 6or 7 of various immersion blenders but this machine is absolutely awesome very glad I got it a bit pricy but worth every penny",
      "rating": 5.0,
      "verified": true,
      "author": "renzo",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Amazon's Sloppy Seconds",
      "text": "Item was listed as nearly new. Came stuffed in a old box. And tip wouldn't stay on. And shaft seemed to be mangled up",
      "rating": 1.0,
      "verified": true,
      "author": "chad",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Loose",
      "text": "Bought this item and the blender thing falls off every time I'm blending beens....",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Made in Switzerland",
      "text": "Decided on this model primarily because it is made in Switzerland, unlike their competitor which is made in China. Bought it to primarily make soups and have been thoroughly impressed with it. Would recommend to anyone looking for an immersion blender.",
      "rating": 5.0,
      "verified": true,
      "author": "glaski",
      "helpful_votes": 4,
      "publication_date": 20140201
    },
    {
      "title": "Was sent with the incorrect power connection",
      "text": "I love the Bamix, have had one for 45 years and this was to be an update, never for once thought that it would be sent to Australia with the incorrect connection",
      "rating": 1.0,
      "verified": true,
      "author": "Lorna Bukkland",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Great product",
      "text": "Superb product, very high end, works easy in the kitchen",
      "rating": 5.0,
      "verified": true,
      "author": "marc st-pierre",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Device failed after a couple of uses",
      "text": "Device was great, but slow speed button stopped working almost immediately. Shortly afterward fast speed button also stopped working. Never bought anything before that broke down so quickly.",
      "rating": 1.0,
      "verified": true,
      "author": "cvw",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Love it!",
      "text": "Bamix is an excellent tool. Does a great job and gets used nearly every day",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Moskovich",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Quality product",
      "text": "Professional quality construction. Only immersion blender with aerator disk blade that will easily whip skim milk into a low calorie whipped cream substitute!",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Great for blending soups",
      "text": "My wife wanted an immersion blender as she makes soups that require blending. Using our vitamix and doing batches was inconvenient. I researched and purchased this one and she is very pleased with it. She's happy, I'm happy!",
      "rating": 5.0,
      "verified": true,
      "author": "kYpondman",
      "helpful_votes": 0,
      "publication_date": 20130222
    },
    {
      "title": "Very powerful",
      "text": "It works better than regular blenders that use to stop working very fast",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Love it",
      "text": "I had one for 30 years so hopefully this will do as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Expensive and excellent value",
      "text": "The Bamix is a tribute to the Swiss & German preference for not compromising on performance, quality & longevity in their products.",
      "rating": 5.0,
      "verified": true,
      "author": "anon",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Use it !!!",
      "text": "Bought as a gift. I have one like it and it is a must in a kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda H.",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "It's the greatest!",
      "text": "Greatest hand mixer I have ever owned! Do yourself a favor, ignore the high price because you will never have to buy another one again which, after a lifetime of use, makes it a really inexpensive investment. You will love it's very quiet and super efficient power as well as how comfortable it fits in your hand. Make yourself happy, life is too short to miss out on this mixer!",
      "rating": 5.0,
      "verified": true,
      "author": "Marjorie",
      "helpful_votes": 0,
      "publication_date": 20140815
    },
    {
      "title": "Five Stars",
      "text": "Works great, powerful unit compared to cheaper version. Not sure about the removable blades, but so far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Pete Lalonde",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Five Stars",
      "text": "Tout a été conforme incluant les frais de douanes (custom fees). Ce qui s'est avéré un achat économiquement concurrentiel",
      "rating": 5.0,
      "verified": true,
      "author": "Client d'Amazon",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "Bamix, the best!",
      "text": "Received SUPER fast. Functions SUPERIOR to two other \"power stick\" types we've had. No contest. Its construction is totally solid.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Phillips",
      "helpful_votes": 0,
      "publication_date": 20131031
    },
    {
      "title": "One of the Handiest Kitchen Appliances You'll Ever Own",
      "text": "I bought this Bamix to replace one I had for 10 years. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Bullock",
      "helpful_votes": 0,
      "publication_date": 20150216
    },
    {
      "title": "Totally rad!",
      "text": "This thing is awesome. It's so convenient and powerful. Feels solid in my hand. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard L. Wood",
      "helpful_votes": 0,
      "publication_date": 20141119
    },
    {
      "title": "Bamix blender/mixer",
      "text": "Loved the mixer! It is so much easier to use than a regular mixer! And cleaning it is piece of cake!",
      "rating": 5.0,
      "verified": true,
      "author": "ithinki8abug",
      "helpful_votes": 0,
      "publication_date": 20130121
    },
    {
      "title": "Excellent machine. If you have a food processor already ...",
      "text": "Excellent machine. If you have a food processor already you do not need all the extra gagets.",
      "rating": 5.0,
      "verified": true,
      "author": "SC1025",
      "helpful_votes": 0,
      "publication_date": 20150119
    },
    {
      "title": "best hand mixer I have ever used.",
      "text": "Best mixer I have ever used, tried on protein shakes, soup, and mayonnaise.",
      "rating": 5.0,
      "verified": true,
      "author": "John J. Daly",
      "helpful_votes": 0,
      "publication_date": 20141111
    },
    {
      "title": "Mechanically it runs fine but I just can't seem to make mayo or ...",
      "text": "I bought this after seeing chef Ramses video on Youtube but I am not getting the same results. I am not a beginner so I was a little surprised at how hard this is to use. They have different attachments which I thought would be helpful but that is not the case. I don't feel this model is powerful at all. It does run for a considerable time with out getting hot. Mechanically it runs fine but I just can't seem to make mayo or whip cream with it.",
      "rating": 3.0,
      "verified": true,
      "author": "mysticalrising",
      "helpful_votes": 4,
      "publication_date": 20150402
    },
    {
      "title": "Love my Bamix",
      "text": "I had another brand for a week or so, until the rod kept falling off, I didn't really want to spend this much on a hand blender but so glad I did. This has the power to get the job done and is a easy clean up. I like that it is all one peace and the rod doesn't come off. I would recommend this to anyone thinking about getting a hand blender, it is worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Smith",
      "helpful_votes": 0,
      "publication_date": 20130305
    },
    {
      "title": "Works great - storage/space  needed",
      "text": "Wish the wall mount was clearly displayed, This works fantastic but it really needs a place to mount on a wall in the kitchen which I had not planned for and do not have the wall space.",
      "rating": 4.0,
      "verified": true,
      "author": "Renee Renz",
      "helpful_votes": 0,
      "publication_date": 20131209
    },
    {
      "title": "showed delivered, but not received; Very irresponsible customer service",
      "text": "It showed me it is delivered 6 days ago to Charls B, but my name is Jihyun Park. In this house, there is no Charles living. This kind of situation has never happened to me so far. Though Bamix itself is great, this company is not good. Don't buy anything from ArtsiHome.",
      "rating": 1.0,
      "verified": true,
      "author": "Jihyun Park",
      "helpful_votes": 4,
      "publication_date": 20140805
    },
    {
      "title": "More powerful than I expected.",
      "text": "I've had several Bamix immersion blenders. I've only had one other commercial. I've wrecked two standard blenders asking lots more than they were designed for. I've had on other commercial (in another country - different electricity voltage and Hertz). I was at first disappointed to find that it has pulse switches - can't turn it on and. leave it on. After using it a couple times I realized that an on or off switch would be unsafe. This thing has so much power that it needs a \"dead man\" switch. It is my favorite electrical kitchen tool. I make my own mayonnaise, so I use it regularly. I don't need a standard blender.",
      "rating": 5.0,
      "verified": true,
      "author": "Bernoulli",
      "helpful_votes": 2,
      "publication_date": 20180908
    },
    {
      "title": "Well Made, Very Functional",
      "text": "This is one of the best made and most useful devices in our kitchen. Solid, powerful and versatile. So far we have made whipped cream and mashed potatoes, and both came out fluffy and smooth, and much easier, quicker and with less cleanup than with a couple whirling blades.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Locke",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "The warranty speaks for the quality.",
      "text": "Quick delivery. Great blender with lots of power and 4 different blade to choose from. this unit comes with a 10 yr. warranty which is outstanding. We had a Waring Hand blender that came with a 2 yr warranty and burned out in year 3.",
      "rating": 5.0,
      "verified": true,
      "author": "William Poska",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Quality costs. Worth it.",
      "text": "I was not looking for value. I was looking for quality. It seems that this is made for someone with my criteria. I was getting tired of replacing mixers that broke after a few years. Fortunately, it also works very very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Hacking",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Solid, Well-made Item",
      "text": "Solidly made, runs well, and excellent size (works in large soup pots). Only problem is that you cannot take the shaft off for cleaning, but not hard to clean with soap, water and a sponge. Commercial quality, and fairly priced.",
      "rating": 5.0,
      "verified": true,
      "author": "Neal",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Swiss made - a work of art",
      "text": "Have had several immersion blenders over the years, but nothing compares to the Bamix. Whipping cream...perfect. Mashed potatoes...in seconds. Smoothies...not a problem. Very high-quality construction and operation. Use and wash under running water - that's it. Stores away in a top drawer or utensil cabinet.",
      "rating": 5.0,
      "verified": true,
      "author": "Link4me2",
      "helpful_votes": 3,
      "publication_date": 20140206
    },
    {
      "title": "A Great Tool",
      "text": "Not sure how I managed in the kitchen without this! Perfect size, weight and power for all of my needs. For example, I had no problem pureeing a pot full of cooked pumpkin into soup; it was also great for whipping up a small amount of heavy cream. I did originally consider the Bamix model with a longer shaft (Pro3), but after using this one for a few weeks I think the longer shaft would actually make it a bit unwieldy for most of my tasks.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20150128
    },
    {
      "title": "It lives up to its purpose!",
      "text": "This is the finest immersion blender made.... I had one years ago and it lasted...When I tried to replace it nothing compares to it. It is powerful and good for all purposes. If you need a good blender bite the bullet and get this one! It is expensive but you are buying quality that lasts!",
      "rating": 5.0,
      "verified": true,
      "author": "M. MULLINS",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Great Product",
      "text": "This is the REAL DEAL! I am tired of cheap Chinese crap!!! Yes, you pay more but just once instead of re-buying over and over. Works perfect!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lucky",
      "helpful_votes": 9,
      "publication_date": 20130102
    },
    {
      "title": "It worked well for a short time but the blade ...",
      "text": "It worked well for a short time but the blade keep separating from the stem. and is really unusable now.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Five Stars",
      "text": "I use it almost daily and it seems much more hardy than my previous one that started to crack",
      "rating": 5.0,
      "verified": true,
      "author": "J. Miller",
      "helpful_votes": 0,
      "publication_date": 20150925
    },
    {
      "title": "Bamix decline",
      "text": "Beware- no customer service from Bamix whatsoever. The bottom blade cover is simple aluminum not stainless steel as stated. Company has gone downhill.",
      "rating": 1.0,
      "verified": true,
      "author": "BR",
      "helpful_votes": 9,
      "publication_date": 20151014
    },
    {
      "title": "could not ask for a better immersion blender",
      "text": "The vast, could not ask for a better immersion blender. Powerful and quick",
      "rating": 5.0,
      "verified": true,
      "author": "Reese",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Excellent blender",
      "text": "I really liked the product. With it you can make a multitude of recipes, from smothies, sauces, etc.. I'm still learning and found it excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas M. Agra",
      "helpful_votes": 0,
      "publication_date": 20130616
    },
    {
      "title": "much better than this",
      "text": "Not worth it, I returned it and got myself a Braun Hand blender Multi Quick Professional MR5555MCA, much better than this!!",
      "rating": 2.0,
      "verified": true,
      "author": "Rojo",
      "helpful_votes": 2,
      "publication_date": 20141031
    },
    {
      "title": "is better than this one but I can no longer find ...",
      "text": "The old original wand sold as a TV special many years ago and which I still have, is better than this one but I can no longer find that original one for sale. Only improved part on this one is the stem is longer but for the money, it did not come with one blade original had. It's good though.",
      "rating": 4.0,
      "verified": true,
      "author": "I. Hass",
      "helpful_votes": 2,
      "publication_date": 20150416
    },
    {
      "title": "One Star",
      "text": "sent it back because it did NOT whip 2% milk as advertised. hence the 1 star.....Top quality machine though...",
      "rating": 1.0,
      "verified": true,
      "author": "MrRick60",
      "helpful_votes": 3,
      "publication_date": 20150314
    }
  ],
  "product_meta": {
    "title": "Bamix G200 Gastro Pro-2 Professional Immersion Hand Blender – Light Grey – 4 Stainless Steel Blades – Aerating, Blending, Chopping, and Slicing Blades – Includes Wall Bracket",
    "rating": 4.4,
    "feature_bullets": [
      "HANDBUILT IN SWITZERLAND: Whether you are a professional chef or home cook, our professional blender will get any cooking job done. Swiss made, our blender includes 4 interchangeable blades, and a wall bracket for easy storage.",
      "4 INTERCHANGEABLE BLADES: With an aerating, blending, chopping, and slicing blade, you get the multifunctionality of multiple kitchen appliances all in one. Create a perfect vortex to draw food into blades for efficient mixing.",
      "POWERFUL AND PRECISE: A powerful 200-watt A/C motor keeps constant, precise speed under heavy loads. With 2 speeds (10,000 RPM and 15,000 RPM) and a button control for continuous or pulse actions, maintaining efficient pulses with less vibration and noise.",
      "MULTIPLE USES: Get fast and efficient mixing with our 15.5-inch blender made with PA6 safety rated nylon and chromated brass. The blender is heat resistant with a high torque, and it can be submerged to seam below speed controls (immersion depth is 10.6\").",
      "MADE TO LAST: Get ultimate durability and easy handling with our made to last professional blender."
    ],
    "specifications": {
      "Product Dimensions": "2.5 x 2.5 x 15.5 inches",
      "Item Weight": "2.2 pounds",
      "Manufacturer": "Bamix",
      "ASIN": "B001R4BBWE",
      "Item model number": "103.05800000000001",
      "Customer Reviews": "4.4 out of 5 stars191 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#164,918 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 21, 2012"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Hand Blenders",
      "Blenders",
      "Kitchen & Dining"
    ],
    "price": 249.0
  }
}