{
  "website_summaries": [
    {
      "verdict": "It's easy to apply thanks to the spray bottle, and it's effective at killing crabgrass and other plants you don't want.",
      "pros": [
        "A weed and crabgrass killer in a handy spray bottle that makes it easy to target specific areas",
        "Concentrated",
        "begins working in just 8 hours"
      ],
      "cons": [
        "Mixed opinions about its effectiveness",
        "some users report dead crabgrass, but others complain that pesky grass continues to thrive while wanted plants do not"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I've tried almost everything and this is the best so far that I've used for weeds - Western PA",
      "text": "I'll be honest, I didn't have high hopes for this product. I've tried every bagged fertilizer that Lowes and Home Depot carry with below average results. Spectracide Weed Stop worked immediately. Literally, the next day, I could see dandelions starting to break down. This year I've had 5 times more dandelions and Weed Stop has been a huge help. I would highly recommend this, although fertilizer and weed killer do not work the same in all areas. So, here are my details: Location - Western Pennsylvania Grass Type - Penn State Mix Area - Front yard (full sun), backyard (half sun) Time - Applied at night, partly sunny at 60 degrees",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy Technology",
      "helpful_votes": 85,
      "publication_date": 20160513
    },
    {
      "title": "Great for dandelions",
      "text": "I wish I had taken photos to show how truly overrun my lawn was with dandelions after years of neglect. I tried a dry product with a spreader and it hardly touched them despite following all instructions. About three weeks later, I sprayed this Weed Stop and saw dramatic results. Within the first week they were all super-wilted, and now it has behind dead dandelions matted into the ground. Now I'm on to clearing them away then re-seeding! I plan on using this annually.",
      "rating": 5.0,
      "verified": true,
      "author": "Shauna G",
      "helpful_votes": 22,
      "publication_date": 20180604
    },
    {
      "title": "Relatively Effective",
      "text": "Let me start by saying I really don't like using chemicals on the lawn. However we had so much crabgrass that digging by hand would have taken several weekends worth of time. This product did help and we noticed a significant reduction in crabgrass.",
      "rating": 4.0,
      "verified": true,
      "author": "Everyday Dad",
      "helpful_votes": 21,
      "publication_date": 20171230
    },
    {
      "title": "Didn't work in Central Florida",
      "text": "I have a big patch of various weeds in my yard and this butts up to Bahia grass and other assortments of grass. After 4 days, it killed the Bahia grass it came in contact with, but did nothing to the crab grass and other weeds. It does say \"not for use on Bahia or St. Augustine grass\" so I knew the Bahia could get killed. I am surprised that it didn't kill anything else even in an area that I heavily saturated. It was under 90 degrees and sunny for first 2 days after application and lightly rained less than an hour on the third day and 4th day. Didn't work for me.",
      "rating": 1.0,
      "verified": true,
      "author": "JLK",
      "helpful_votes": 7,
      "publication_date": 20180920
    },
    {
      "title": "It works great but dont expect results in 24 hrs",
      "text": "I have a rock landscape in my front yard. Weeds started popping out so i used the product to get rid of my weed problem. I used the whole bottle over the entire area. I purposely avoided hitting the tree and bushes that are part of the landscape. Its a slow process but after 8 days the weeds were dead and shriveled up. I could see the process of them dieing over the days. So it does work but not that fast as the bottle says. Also i used as directed and sunny days. Overall i cant complain it worked and its inexpensive.",
      "rating": 4.0,
      "verified": true,
      "author": "Mitzie",
      "helpful_votes": 3,
      "publication_date": 20200201
    },
    {
      "title": "This WILL kill your grass...cost me over $900 to replace the sod it kill",
      "text": "Do NOT use this garbage!!! My yard is St. Augustine grass...very thick and healthy. In Southeast Texas we get weeds in the winter...not bad, just some that pop up here and there. So I bought this and sprayed all the areas that had weeds. Three weeks later, every area I sprayed was completely dead. I had to order serveral pallets of grass and spend 14 hours cutting out all the dead sections and replacing the grass. I will NEVER use this product again...it WILL kill your grass.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200405
    },
    {
      "title": "Works great!  Works fast and leaves your grass alone.",
      "text": "We had crabgrass creep up on us this summer. It would have taken a lot of spraying with a bottle to get the job done so I purchased this crabgrass killer. It is selective and only killed the crabgrass and left our left alone. I was delighted on how quickly it worked. As the photos show (timeline is 1 day per photo) it killed the crabgrass and left the lawn and it took 4 days total. Now I just need to plant where the crabgrass was. Fantastic product!",
      "rating": 5.0,
      "verified": true,
      "author": "PABLOMAN",
      "helpful_votes": 4,
      "publication_date": 20190806
    },
    {
      "title": "Do not use on St Augustine!",
      "text": "It was deep in the instructions, and not in the Amazon description: the product is not for use on St. Augustine lawns. I used it and it killed my grass. Furthermore, it did not kill my rampant Chamberbitter Mimosa that I was trying to eradicate, which is still green among my dying grass!",
      "rating": 1.0,
      "verified": true,
      "author": "Linda Tomaselli",
      "helpful_votes": 4,
      "publication_date": 20191027
    },
    {
      "title": "WILL KILL YOUR LAWN",
      "text": "I have some yellow nut sedge and crabgrass in my yard. I have St. Augustine lawn. This product damaged my lawn - the grass is all yellow., and no, it's not the weeds that are yellowing. It's the blades of my St. Augustine that is yellowing. Will see if I can get this to come back so late in the season. Needless to say, if this product ruins my lawn completely, Spectracide will be in trouble.",
      "rating": 1.0,
      "verified": true,
      "author": "Gina Palla",
      "helpful_votes": 3,
      "publication_date": 20191021
    },
    {
      "title": "Kills the grass not the weeds... Label is reversed.",
      "text": "I bought this product with the hopes it would kill some of the weeds I have growing in the grass. Well, this product worked in reverse, grass is dead weed is still growing. What I learn is if you have St. Augustine grass, like 90% of South Florida, DON'T USE THIS PRODUCT. You would think that Spectracide would warn you not to use this product if you have St. Augustine grass, but instead they go on boasting on everything it will kill leaving out St. Augustine grass.",
      "rating": 1.0,
      "verified": true,
      "author": "cd",
      "helpful_votes": 4,
      "publication_date": 20190718
    },
    {
      "title": "Thanks for nothing Spectracide!",
      "text": "I sprayed this on my yard after freshly cutting the grass so the chemicals would seep down into the fresh cut weeds. I am sad to say that my weeds are thriving better than ever. I specifically bought a product that is said to kill crabgrass and nuts edge. Don't waste your money, the spray did nothing but strengthen the weeds.",
      "rating": 1.0,
      "verified": true,
      "author": "User 1",
      "helpful_votes": 5,
      "publication_date": 20180910
    },
    {
      "title": "Killed nothing, except the grass",
      "text": "With the extremely hot weather, our lawn was dying out, and weeds were thriving. So, I tried using this weed killer to stem the spread of the weeds. I followed the directions explicitly, and didn’t water the lawn after application for three days. However, it failed to kill a single weed, but stunted the growth and killed a bit of my lawn. I think the hose sprayer dilutes the solution too much, and the weeds don’t get treated effectively. I might try using the concentrate with a garden sprayer next time, so I can direct the chemical only at the weeds.",
      "rating": 1.0,
      "verified": true,
      "author": "DCD",
      "helpful_votes": 2,
      "publication_date": 20190730
    },
    {
      "title": "Do not buy this product!!!!",
      "text": "Each or the 3 bottles I purchased sprayed differently and at different rates. None of which were correct based on the labeling. I followed instructions to a T, including moisture, weather conditions etc. and even at a very slow pace the bottles were not distributing the mix. I walked a 5000 sq ft area twice with each of the bottles (3 different areas and still had over 3/4 bottle left. Waited 24 hrs(bottles say results starting in 8) and literally little to no results on any of the multiple typical weed types.I have not cut lawn, no rain and checked again 3 days later and same results. I will be returning for a Bayer or ortho product!!!",
      "rating": 1.0,
      "verified": true,
      "author": "BCC",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "This product has the same information as the Bayer product ...",
      "text": "This product has the same information as the Bayer product. Very small print says not to use on St. Augustine or Centipede grass. Why did it not say that on the description of the product on Amazon?",
      "rating": 1.0,
      "verified": true,
      "author": "Harold Allen",
      "helpful_votes": 6,
      "publication_date": 20180711
    },
    {
      "title": "Seems Diluted",
      "text": "I'm a fan of Spectracide. I use the weed stop last year with great results. In 24 hours the targeted weeds were browning. That product came from the local hardware store. This year, the price was right on Amazon so, I bought another 2 bottles and got ready to kill some weeds. Womp, womp, womp. It's been a week and the weeds have just the slightest showing of withering. It seems like this batch was greatly diluted. I'm almost wondering if this is a counterfeit product. Back to the hardware store, I go!",
      "rating": 2.0,
      "verified": true,
      "author": "M.",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Works well, and fast",
      "text": "I got this product specifically because it advertised for killing nutsedge and crabgrass. My bermuda grass had a little bit of spurge and a few other weeds that weren't a huge issue. But there were several large patches of nutsedge throughout the lawn as well as small concentrated patches of crabgrass. This product knocked out the crabgrass almost immediately. The nutsedge has turned yellow/brown and looks to be dying quickly. A few more weeks will tell for sure, but as of right now I'm happy with the results. It did result in some stress yellowing of the bermuda (which I expected), but it bounced back within a few days with some water.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Vance",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "This worked very well for us on new sod",
      "text": "First of all its not for cool season grass like Kentucky blue or any kind of fescue. The only warm season grasses you can safely use it on are: Bermuda , Zoysia and buffalo. Only use if temps are 80 or below. So use at night or early in the morning. It absolutely checked the crabgrass and other noxious weeds like spurge in our newly sodded Zoysia. Have purchased twice and will continue till crabgrass dies for the year. We have had a lot of rain in FL this year so it's been a godsend to have.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue in Florida",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Dont Buy and Useless Product",
      "text": "I bought this product to kill weed in my lawn two weeks ago. I used this product as they directed me when temperature is 70-80F and waited 5 days and i did not see any difference and then ,I used the product again when temperature is 60-70F and did not any progress at all . It seems like i sprayed only water . I really disappointed about this product which is selling in Amazon . It is waste of time and money and dont buy it from this seller . And , I bought the same product in Homedepot last year and were worked as expected . I am not sure, whether the seller is selling original product?",
      "rating": 1.0,
      "verified": true,
      "author": "A.K",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Meh",
      "text": "It is half killing the weeds. They look sickly and like they may be dying mostly. Some are doing just fine or seem to be but I am not a botanist so I have no clue if the ones that seem to be fine are one this stuff should be killing. I have spray my small front yard three times and most of the weeds are still alive (mostly alive) but some are brown and dead. So I guess it is an okay product. I have plenty left and plenty of weeds remaining in the back yard so we will see how it all turns out as time passes but so far it is a solid and maybe generous 3",
      "rating": 3.0,
      "verified": true,
      "author": "G. Shoemaker",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Didnt work for me",
      "text": "Did not work at all. Using it on both gravel and a grassy area. It rained so we had weeds already grown combined with new weeds just sprouting. This stuff turned their leaves yellow and then nothing, the weeds recovered and the new weeds kept growing. Our yard actually got worse. I used two entire bottles over a two week span and the weeds were still healthy and not dying. It also wasnt killing or preventing grass type weeds in our rocks and those are the easiest ones. I live in a warm climate western state so I dont know why it struggled so much to do anything.",
      "rating": 2.0,
      "verified": true,
      "author": "Dustin",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "May not work as advertised.",
      "text": "While it did wonders for my neighbor’s weed, unfortunately it did nothing for the weed in my lawn. Customer service was very apologetic and refunded the purchase price when I submitted my receipt.",
      "rating": 1.0,
      "verified": true,
      "author": "Gee Iggy",
      "helpful_votes": 2,
      "publication_date": 20200220
    },
    {
      "title": "Only use on a healthy lawn!",
      "text": "This stuff can potentially kill your lawn, especially if applied to an already stressed lawn. If your grass has been exposed to high heat and dry conditions, it may deteriorate more from this being applied to it. Think about it...it’s designed to kill vegetation - it’s not a fertilizer. Just use with caution and only on an otherwise healthy lawn in the right conditions.",
      "rating": 1.0,
      "verified": true,
      "author": "SoBe",
      "helpful_votes": 3,
      "publication_date": 20180720
    },
    {
      "title": "This will kill your grass, not just weeds",
      "text": "This product was way too strong. I bought it to hit one section of my lawn that had too many weeds and it killed the grass along with the weeds. They're supposed to say on their label if it kills both grass and weeds together, not just weeds. Now I am going to have to buy new lawn. This was a disaster.",
      "rating": 1.0,
      "verified": true,
      "author": "Ukegirl",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Awesome and worked for my needs",
      "text": "Worked well for my tiny fenced yard since I don't need a lot of this stuff. no leaks, sprayed very well, acstually like the spray cap better than my hose endpiece that I currently use. Various weeds already wilted, I sprayed a day after some heavy rain in 7a zone. I don't even think I need a 2nd application. maybe until end of summer. Very easy to use for people with tiny gardens like mine (8 x 18 ft approx). 2 for $10 was a steal!",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Drake Ramoray",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "It does the job",
      "text": "I was skeptical at first because after two days it didn't look like it was working but then the weeds started to brown. I'll have to do another pass on one section of clover but it took care of my crab grass which I thought was invincible. I live in northeastern Ohio if that helps anyone.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180803
    },
    {
      "title": "Great hose mounted sprayer. Ineffective on my San Diego crabgrass at three times dose",
      "text": "After all the complaints about the Scott products delivery system I wanted to try this one. Spray bottle attached to the hoses bulletproof and effective. Unfortunately I applied up to three times the recommended dose over the period of a week and nothing at all turned yellow even my dandelions laughed at this product. I know it's not water cuz it smells bad.",
      "rating": 1.0,
      "verified": true,
      "author": "sailorman",
      "helpful_votes": 2,
      "publication_date": 20180916
    },
    {
      "title": "Crab grass green",
      "text": "I don't know what the main chemical is to kill crab grass, but in my attempt to kill crab grass, I got opposite results: Crab grass is greener and healthier!",
      "rating": 1.0,
      "verified": true,
      "author": "Marcello",
      "helpful_votes": 3,
      "publication_date": 20190321
    },
    {
      "title": "Works - Read Instructions!",
      "text": "Works well...I mainly purchased it because it includes yellow Nutsedge control....and it definitely did work on the Nutsedge. I used it twice (Nutsedge is very hard to control...takes multiple treatments)...pay attention to the instructions...if you use this when daytime temps are 90°+, you run the risk of browning / burning up your lawn. I used it in the 80s, and had no adverse affects",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin B",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Works ok for large areas.",
      "text": "Killed most the weeds. I did have go back and spray again certain areas, with a different product. It served its purpose for quickly spraying a large area. If you need to only touch up smaller areas I would not recommend , at least for the weeds in Phoenix.",
      "rating": 3.0,
      "verified": true,
      "author": "Raoul Sada",
      "helpful_votes": 2,
      "publication_date": 20200216
    },
    {
      "title": "No more weeds",
      "text": "I applied this twice--two weeks apart--last October and by the Spring my lawn was weed-free. I applied a weed and feed for pre-emergent growth in May just to be safe. Invariably, a few weeds sneak back in, so it's just about time to apply this again. There's a joke that goes, \"If I killed all the weeds in my yard, there wouldn't be anything left!\" That's funny, but incorrect. You'll be amazed at how quickly and easily your grass comes back after using this.",
      "rating": 5.0,
      "verified": true,
      "author": "Otto Hemi",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Works on Oklahoma weeds",
      "text": "This worked great first try. I think I did more soaking than the instructions said but I wanted to make sure it worked. Took about a week and everything was dead dead. We went out and everything pulled easily out of the ground. Don't know that you have to do that but our front yard looked terrible with so many weeds and I wanted the grass to grow in.",
      "rating": 5.0,
      "verified": true,
      "author": "Kizziar",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Works as Advertised",
      "text": "I bought this because my yard had become overgrown with crabgrass. It was very easy to hook onto the end of my hose and spray on my yard. It wasn't within hours, but was within two days that I started to notice my yard was dying. The grass was left healthy and intact but the crabgrass was being weeded out. Works as I had hoped. I would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Hillary B.",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Will buy again",
      "text": "Really like the thumb operated flow valve atop the dispenser! Don't like having the product all over me or my clothes at completion of spraying this stuff (non windy day). It does kill weeds, yet the coverage from each dispenser is less than advertised.",
      "rating": 4.0,
      "verified": true,
      "author": "F",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Easy to use my 84 yr old mom uses it.",
      "text": "The ease of use is what I needed. My 84 yr old mother was out pulling weeds out of the grass. I got this, set her up and she loves it. Now she goes out and pulls the dead stuff out rather than struggling to pull green weeds.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 2,
      "publication_date": 20190414
    },
    {
      "title": "Works fine, but give it some time",
      "text": "Seems to work well on crabgrass, but be patient, it took mine about a week before it started dying, but it is working. Crabgrass is very aggressive and hard to kill. DO NOT use on St. Augustine......accidentally got some on it and it turned yellow, but seems to be coming back slowly. Another thing, do not over apply, (standing in one spot and soaking area). Simply spray until grass foliage is wet and strop. I did a lot of research and this product was a good value. If you follow directions this should do the job on crabgrass.",
      "rating": 5.0,
      "verified": true,
      "author": "JimBob728",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Did not work So far",
      "text": "Crabcrass is going crazy in my lawn and i ordered this specifically for that. Its been 3 days since i sprayed it and i have not seen even a single strand of crabgrass die. Yes, i read the instruction and followed it, thats why i even ordered 2 and hesitant to spray again as it says that do not spray more than some quantity which is also hard to gauge as well. I",
      "rating": 1.0,
      "verified": true,
      "author": "Sudeep Tomar",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Not as effective to CRABGRASS as it advertises!!",
      "text": "I bought this product to eradicate crabgrass on my lawn; I followed instructions on the product, made sure no rain, weather not hot when applying and made sure I covered all the lawn making sure to cover troublesome crabgrass spots. It only killed close to 40% of the crabgrass; the rest did not even get affected.",
      "rating": 1.0,
      "verified": true,
      "author": "Bobby",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "The product is good.  The delivery isn't",
      "text": "If the bottle you get works, the chemical works. It will kill your weeds fairly well. Problem is, half the time, I'll hook up a bottle and be spraying for 15 minutes, expecting the bottle to be close to drained and it's still full. Yes, I know the difference between the water and the spray setting!! Some of the bottles are just defective.",
      "rating": 2.0,
      "verified": true,
      "author": "Maxwell B.",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Didn't work",
      "text": "It didn't kill any of my weeds or crab grass! Nor did it spread as far as I expected. Usually one bottle of lawn care stuff sprays my entire lawn, front and back, and this barely made it over my back lawn. Will not purchase again. Better off spending more on something that will actually work.",
      "rating": 2.0,
      "verified": true,
      "author": "ajulm37",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Good stuff, quite happy overall",
      "text": "Within a few days of application my crab grass started to turn angry colors and die, the price shipped for this is comparable to any hardware store so I am pretty happy. I have just over 1/3rd of an acre so this obviously only treated a portion of that, just make sure you do some rough calculations on what you'll use. Don't skimp out when applying, really let the crab grass have it!",
      "rating": 5.0,
      "verified": true,
      "author": "Wado Potato",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Doesn’t kill weeds as advertised.",
      "text": "The good, connect to a hose, let the water flow and it’s really easy to apply. The bad, did not kill the standard weeds in Maryland that pop in the spring. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Mario S. martins",
      "helpful_votes": 2,
      "publication_date": 20190423
    },
    {
      "title": "Great weed and crabgrass killer",
      "text": "This product is very effective. I bought specifically to kill the crabgrass that I get from my neighbors. I works very well. I can see the weeds and crabgrass turning brown within a few days. My only surprise was that I thought I was buying a concentrate but it needs a hose application. I have almost an acre of land and I have to drag lots of hose to reach all areas",
      "rating": 5.0,
      "verified": true,
      "author": "raymond howard",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "it does great on everything BUT crabgrass",
      "text": "it does great on everything BUT crabgrass. be sure to give it a week+ to work on dandelions and clover. as for crabgrass, you can see it browns a little but the crabgrass eventually fights through it and remains. ill be looking at the before-germination stuff for crabgrass in the early spring from now on",
      "rating": 4.0,
      "verified": true,
      "author": "Pat",
      "helpful_votes": 3,
      "publication_date": 20170901
    },
    {
      "title": "This works",
      "text": "Very easy to apply directly to weeds. Did a very nice job of killing some stubborn crabgrass although it took 2 applications and a few weeks to finally be weed free. I recently moved into this house and the yard had been neglected for years so it was a challenge for this product but it did what it was supposed to do. Highly recommend this product for its' effectiveness and ease of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Scooter",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Well worth your money!  Believe the ratings!",
      "text": "it works!....i applied it at night to avoid the morning high temps....at least it would have worked into the roots for 8-10 hrs. .....2 days into application...crabgrass started changing colors....today is the 5th i think....70% of my crabgrass are almost dead...so easy to pull out...30% might have been missed application or not enough....will go throught it again...",
      "rating": 4.0,
      "verified": true,
      "author": "ckgo",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Works great but pay attention to water output",
      "text": "Saw in another comment where someone had their water cranked and it was pumping out too much water and not mixing well. Had the same thing happen to me as well. Backed the water down a little bit and immediately smelled the product and weeds died off quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Works As Described",
      "text": "I first bought the larger manual spray bottle of this stuff, which worked really well. But I have a good sized lawn so manually spraying a large area was too tiring. This bottle with the hose attachment is perfect. It works just as described, killing the crabgrass but leaving the good grass alone to stay healthy.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison S",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Not even the spray bottle worked",
      "text": "Didnt kill anything in the lawn. After the first application, the bottle was still full. Transferred into another sprayer and put down the whole bottle on my little lawn and 2 weeks later still no results.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan Morgan",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "product was different from what was shown on product cover",
      "text": "i have a good report on product, it was to kill 470 plus weeds i have used it and was good,buy what was shipped was one that kills over 200 weeds. i had to call spectracide to see if what i had would kill my weed, had leak or something had stuck information together it would not kill my weeds. i could send back but not worth the trouble to ship will buy local.",
      "rating": 4.0,
      "verified": true,
      "author": "elmo napier",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Killed my new St Augustine",
      "text": "Used as directed. Killed my St Augustine I just paid to have put in 2 months prior. Used maybe a 10th of the bottle as I saw a few weeds popping up. Horribly disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 2,
      "publication_date": 20180923
    },
    {
      "title": "Keep weed away",
      "text": "It is easy to use , attach it to the hose and spray, the weed is gone . I need to re-seed again to have new grass ,",
      "rating": 4.0,
      "verified": true,
      "author": "HT",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Never came out of bottle",
      "text": "I sprayed twice thinking I was doing everything right. After the first use, nothing happened, no weed killing. After the second time I noticed the bottle was still full. Nothing but water which really helped the weeds.",
      "rating": 1.0,
      "verified": true,
      "author": "Daryl Thompson",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Disappointed",
      "text": "This product did not do as well as I had hoped. I have used the spectracide weed killer but not this. The weed killer worked very well. I purchased this because I have crabgrass. It took several applications and still did not knock it all the way down. Disappointing",
      "rating": 3.0,
      "verified": true,
      "author": "TURBO",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Used almost whole bottle on 200 sq. ft. Area, didnt kill crabgrass",
      "text": "Did not work at all for me at all. Sprayed a small section roght sround sunset when temp was about 85 degrees F, and sprayed on about 200 sq ft of lawn overrun with crabgrass. It did nothing at all. Complete waste of money for me. Will not buy again. Ended up just cutting out all crabgrass.",
      "rating": 1.0,
      "verified": true,
      "author": "Bushidomonk",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Lawn Weed Killer",
      "text": "it's okay. It killed my grass. I followed the directions, but it killed my grass. Had to reseed multiple areas. It finally killed the weeds. I would not buy this item again.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Best Crabgrass Killer",
      "text": "I've had crabgrass every year...sometimes moderate, sometimes severe. This year was really bad (Hey, it's 2020!) so I decided to try a different brand. This stuff (as stated on the label) started working within 24 hours. It's been about 2 weeks and the results are amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "T Tommy",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Does not kill weeds at all!",
      "text": "I bought two bottles for my 8,000 square foot yard. Followed the instructions and put an even coat all over my yard paying particular attention to already growing weeds for an extra spray. After 3 days I can say all my weeds are growing strong and thriving on the spray. It killed no weeds of any type. A complete waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephen D. Hill",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Did not work",
      "text": "I used this during 80 degree weather with no rain for a week and not a bit of the crab grass died was green as could be, but my St Augustine turned yellow and Azalias curled and I am returning what is left. It is more than 2 weeks and nothing, waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "AussiegirlIngridTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Killed the crabgreass!",
      "text": "Followed directions. Watered on Monday. Mowed on Tuesday morning. Applied product Tuesday afternoon. Watered Wednesday evening. Crabgrass dead in 10 days! I had a bad infestation of crabgrass. Thought I might need a second application. I don't. Yeah!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Don t waste your money",
      "text": "I bought 2 of these. To make sure my yard was well coverd. Well ,it has been 3 weeks since I but it down, and my yard looks like a dandelion field. Didn't kill or do anything, for my yard. Total waste of money and now I have to go out and buy more product, kill my weeds",
      "rating": 1.0,
      "verified": true,
      "author": "Charles Bartholomew",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Rains death on crabgrass, clover",
      "text": "Works exactly as advertised. Although the label advises applying to new growth for best results, this stuff nuked my mature crabgrass in one application. Also dealt a deathblow to my clover. And all without harming my now weed-free grass. Excellent product.",
      "rating": 5.0,
      "verified": true,
      "author": "Contender",
      "helpful_votes": 7,
      "publication_date": 20150720
    },
    {
      "title": "Worked-just not immediately",
      "text": "I got the 4 pack at an unbelievable deal-it was amazing. Sprayed, and saw some moderate results....Now, the following spring...Zero dandelions where I sprayed! It's actually funny because there is a line about a foot wide and 5 feet long of dandelions where I obviously missed spraying. I can only imagine what my lawn would look like if I didn't use this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Alan J. Mckelvey",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Seems inneffective",
      "text": "Two weeks later I'm not seeing any wilting or dead weeds, I have a yellow nutsedge infestation for this product and so far it's not worked as intended.",
      "rating": 3.0,
      "verified": true,
      "author": "S. Carter",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Beware",
      "text": "I have used this product in the past, and there was not problem, however after one application this past October it ended up burning my St. Augustine grass, almost to the point of killing big part of my grass, I live in Miami, so there is not really big weather change. So disappointed, it was a brand new sod that I laid in early in the spring and it was a beautiful green grass before this October’s application.",
      "rating": 1.0,
      "verified": true,
      "author": "NINFA F.",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Wasted spray",
      "text": "1/3 of the spray will not come out of the bottle so I have to buy a sprayer to use it. I should have know that after all these years these sprayer bottles still are terrible",
      "rating": 2.0,
      "verified": true,
      "author": "Jan Dittmar",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Works poorly",
      "text": "While some weeds did die in a day or two, my main week, Spurge, was not effective at all. The Spurge actually seemed to like the Spectracide.",
      "rating": 2.0,
      "verified": true,
      "author": "Fred",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "NOT WORTH THE MONEY...",
      "text": "After multiple application this did ABSOLUTELY NOTHING for my weeds and cloves. I had cloves growing in my grass, shoot them multiple times and saw no results. None. I was very surprised to see a weed killer do nothing to my weeds. Waste of money...",
      "rating": 1.0,
      "verified": true,
      "author": "Dbest Collectibles",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "It worked.",
      "text": "This worked. We love in the northeast, and it killed everythinf but the grass. On bottle eqs perfeft for our small lot of 40 x 25 ft. 3 weeks on, only grass left.",
      "rating": 5.0,
      "verified": true,
      "author": "Rahul G. Sabnis",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Killed crabgrass!",
      "text": "I had some crabgrass problems... not anymore! This stuff went on and killed all the crabgrass in 4 days (Maryland). Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "James D",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Kills nutsedge",
      "text": "This is the only product I can find that reliably kills nutsedge in my yard in a 'spray nozzle' package. Apply when I see it crop up and viola!",
      "rating": 5.0,
      "verified": true,
      "author": "Muldoonb",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Move on guys",
      "text": "Did not kill anything. Dont waste your money. I sprayed when it was 75° out, 2 mph wind, and no rain for a week.",
      "rating": 1.0,
      "verified": true,
      "author": "Tylie",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Good concentrate bad nozzle",
      "text": "The nozzle cannot suck up the concentrate in the bottle when the liquid in the bottle left half of it. It just broked. I have to pour the concentrate into another spray bottle and add some water to use it. The concentrate work well, killed crabgrass in a week, but the nozzle is garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "qiao",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Okay for value product.",
      "text": "Seemed to work well I had to continue to shake the bottle and it cane in a plastic bag smelling like chemicals. I took like 2 weeks for everything to start dying it killed off most of the crabgrass and weeds. I will probably have to treat again or maybe use more.",
      "rating": 3.0,
      "verified": true,
      "author": "eathomas",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Works OK..",
      "text": "Works well on most weeds common to southern lawns. Doesn't do well with crabgrass, but short of a nuke, I haven't found much that does...",
      "rating": 3.0,
      "verified": true,
      "author": "Walker",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "I didn't see a change in the lawn",
      "text": "Our lawn became a hot bed for crab weed, dandelion and finger grass. I used the entire container on a 1,400 sq ft. yard, and literally didn't see any change, even after 2 weeks. We also had to request a new container since the first one was damaged (assuming during delivery) and leaked all over our floor.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt Denny",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Weed/Crabgrass Killer",
      "text": "It work great. Got rid of the weeds/crabgrass not the grass. Now using this product every three months to control it. Jyst one bottle is sufficient to spray a large grass area.",
      "rating": 5.0,
      "verified": true,
      "author": "Carmen Jimenez",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Horribly ineffective",
      "text": "I wish I could leave 0 stars. What an awful product. Made my yard *more* full of weeds than before I sprayed it. Did absolutely nothing to kill any weeds. Total waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "worked after 2 time apply",
      "text": "I was stopped using killing weed products in past 4 years, but this year my yard took over by weed more than grass, decided to use it again, 1st apply kill some of weed, and 2nd apply after 10 days, most of weed is gone.",
      "rating": 5.0,
      "verified": true,
      "author": "Lex Tang",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Good stuff Maynard!!",
      "text": "Kills the weeds easily..Spray and forget. Walk out in your yard a week later, not a weed to be seen...Just don't get on broad leaf bushes it will kill them off big time...",
      "rating": 5.0,
      "verified": true,
      "author": "Heavymetaltrax",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "unhappy customer",
      "text": "did not like at all ended up dumping the whole container on the weeds nothing worked as it was suppose to the switch which was suppose to let the water through broke in my hand,,, very unhappy with it",
      "rating": 1.0,
      "verified": true,
      "author": "PEG",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Patience is key",
      "text": "Worked like a charm! Took a few weeks for crab grass to completely die but I expect things like this to take time to affect down to the roots. Yard was weed free within a week!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew J. Stottlemyre",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Works most of the Time",
      "text": "Works pretty well. Didn’t kill all weeds but a second treatment probably will do it. Has a difficult time killing crabgrass. Hit or miss with killing crabgrass.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard B",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Knocked 'em down",
      "text": "It took some time to be really effective, but it looks like it did the job on the lawn weeds. Time will tell!",
      "rating": 4.0,
      "verified": true,
      "author": "L. Martin",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Works Well. Smells Bad.",
      "text": "Works. Smells bad. Shipped slightly leaky in ziplock bag. Totally killed my crabgrass in one application. Zero remains. Smell persisted for a long time. Gone now. Four stars.",
      "rating": 4.0,
      "verified": true,
      "author": "boeing377",
      "helpful_votes": 2,
      "publication_date": 20171016
    },
    {
      "title": "doesn't do anything for crabgrass and most of my weeds",
      "text": "doesn't do anything for crabgrass and most of my weeds in central texas this is the worst weed killer I have ever used",
      "rating": 1.0,
      "verified": true,
      "author": "sam",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Doesn’t work",
      "text": "Turned the crabgrass slightly tan after two coats but did not kill it or any other weeds. I used half the bottle on my small from yard (15/30) I’m opening my second bottle up now for the third and forth coats. Let’s sre if it will actually kill them. Would NOT recommend this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Branden",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Not worth the money",
      "text": "Not worth the money. Supposedly you should receive results in five hours. It has been 72 hours since I sprayed my lawn and I’m still not seeing any results. There are several weeds of different types in my yard and nothing is dying yet it’s not worth the money.",
      "rating": 1.0,
      "verified": true,
      "author": "JDean Cordova",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Hasn't worked well for me.",
      "text": "I don't think this works that well. Did not stop or kill my crabgrass. The other weeds weren't effected all that much either. My suspicion is the construction of the sprayer. I think there is too much water, and not enough solution (comparatively) exiting the unit.",
      "rating": 2.0,
      "verified": true,
      "author": "Falcmanb",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Crabgrass be gone!",
      "text": "Works exactly as it claims. I had so much crabgrass it was infiltrating my lawn in various sections. I sprayed this as directed, on dry hot days without rain in forecast, and witching a week all the crabgrass was brown and my lawn was still green. Very happy with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Does not kill crabgrass.",
      "text": "Two applications (2 entire containers) within 6 weeks. Crabgrass thriving.",
      "rating": 1.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Kills everthing it touches",
      "text": "Terrible , killer everything including my grass Will need to replace all back yard !!!",
      "rating": 1.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "not too bad",
      "text": "I used this on my lawn 3 days ago, today i start to see the crabgrass and other weed starting to get brown color. i will apply this again last week hopefully get them kill.",
      "rating": 4.0,
      "verified": true,
      "author": "Betty",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Descent product",
      "text": "Expected faster results. Observed signs our effectiveness. Would try a different product next time.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Does not work",
      "text": "Does not well, after two applications at 3 weeks apart clover continues to grow.",
      "rating": 2.0,
      "verified": true,
      "author": "Lawn nut",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "It works well",
      "text": "This is the same ingredient product as found in weed be gone but at a much better price. It does the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Doesn’t do anything to the weeds in my lawn",
      "text": "Just used it yesterday where it was a steady warm day in zone 8. On the label led it says visible results in how many hours? It’s been a day and the weed are still thriving...., feels like it’s more effective to just manually pull the weeds",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "too poor",
      "text": "I thought there were a lot of weeds in the lawn that could be killed. I didn’t expect that the weeds were not killed. The grass on the lawn turned yellow and died a lot. I was very anxious. So I watered every day and still couldn’t recover. I was too disappointed that I would not buy it again.",
      "rating": 1.0,
      "verified": true,
      "author": "Erica",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Questionable",
      "text": "My husband \"suited up\", long-sleeved shirt, gloves, etc. and applied the weed killer. It didn't do the job completely. After a few days, some of the weeds wilted and eventually died, but it wasn't as effective as I'd hoped.",
      "rating": 5.0,
      "verified": true,
      "author": "DancingQueen",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "I was skeptical that this would work, but it ...",
      "text": "I was skeptical that this would work, but it did! It killed just the weeds and not my grass. Not all weeds were killed, but it definitely made a difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Kilarney",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "DO NOT BUY, IT WILL KILL YOUR GRASS TOO",
      "text": "Upon applying I did not weeds disappearing like it mentions on the product. Instead I saw my bushes and grass had all turned yellow. Would not recommend",
      "rating": 1.0,
      "verified": true,
      "author": "Sean S.",
      "helpful_votes": 0,
      "publication_date": 20190723
    }
  ],
  "product_meta": {
    "title": "Spectracide HG-95703 Lawn Weed Killer, Ready-to-Use, LAWNGARD",
    "description": "The power is in your hands to keep your landscape in line – unleash it with Spectracide lawn and garden products. Our easy-to-use, fast-acting insect, lawn disease and weed control solutions help you tame lawn and landscape invaders with incredible pest-punishing power. Take command with Spectracide brand. You hold the power. Spectracide Weed Stop For Lawns Plus Crabgrass Killer Concentrate controls more than 250 types of weeds as listed – and it won’t harm your lawn when used as directed. This concentrate formula kills on contact all the way down to the root, with visible results in 5 hours. It controls major broadleaf and troublesome grass weeds, including dandelion, chickweed and clover, as well as crabgrass, foxtail and yellow nutsedge (see product label for complete list). This product is rainfast within 3 hours, so it won’t wash off. Apply Spectracide Weed Stop For Lawns Plus Crabgrass Killer Concentrate when temperatures are between 45 and 90 degrees. Some hard-to-kill weeds may require re-treatment. Wait at least 30 days between applications — some weeds can take that long to die. Read the entire label before using. This comes in a concentrate and a ready-to-spray. Limit to two spot treatments per year.",
    "rating": 4,
    "feature_bullets": [
      "KILLS WEEDS, NOT THE LAWN: Controls listed weeds – including crabgrass – not the lawn (when used as directed)",
      "CONTROLS CRABGRASS: Controls major broadleaf and troublesome grass weeds, including crabgrass, dandelion, chickweed and clover, as well as foxtail and yellow nutsedge (see product label for complete list)",
      "KILLS THE ROOT: Visible results in 5 hours",
      "RAINFAST: Rainfall or watering 3 hours after application will not wash away effectiveness"
    ],
    "specifications": {
      "Product Dimensions": "2.41 x 5.5 x 11.37 inches",
      "Item Weight": "1.13 pounds",
      "Manufacturer": "United Industries",
      "ASIN": "B001OENXRI",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item is not eligible for international shipping. Learn More",
      "Item model number": "HG-95703",
      "Customer Reviews": "4.0 out of 5 stars1,390 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#560 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Weed & Moss Control",
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Weed Killers",
      "Gardening & Lawn Care"
    ],
    "price": 9.48
  }
}