{
  "website_summaries": [
    {
      "verdict": "An incredibly versatile, soft, and all-natural sand substrate that works just as well to create aquatic environments for turtles and frogs as it does for building desert biomes for lizards and tortoises.",
      "pros": [
        "100% natural brown South African sand",
        "Great for wet or dry terrariums",
        "Fine texture is soothing on a reptile’s skin",
        "Easily passed if mistakenly ingested",
        "Promotes digging behavior"
      ],
      "cons": [
        "It would be convenient if this pricier sandy substrate was available in alternate sizes"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Exo Terra Riverbed Sand, 10-Pound",
      "text": "This sand is perfect for axolots. It's very soft and easy to keep clean. Just make sure you rinse it clear before adding it to your tank. It has a fair amount of \"dust\" that needs to be rinsed away.",
      "rating": 5.0,
      "verified": true,
      "author": "Jan Fogel",
      "helpful_votes": 16,
      "publication_date": 20160226
    },
    {
      "title": "Have faith give it a little time",
      "text": "I was devastated after I first put this in the tank it took days upon days to settle down now that I have it in there my mud turtle could not be happier. This has settled fine it's weighted down much better and doesn't fly all over the place the tank water cleared it took about a week but it did clear the turtle absolutely loves it and that's what it's all about he constantly covers himself in the mud. There is nothing cuter.",
      "rating": 5.0,
      "verified": true,
      "author": "warmdecor",
      "helpful_votes": 7,
      "publication_date": 20170310
    },
    {
      "title": "Sand used for turtle aquarium.",
      "text": "I bought this sand for my turtle aquarium. I am using it for the nesting platform. It is extremely soft. When I received my bag it was leaking sand all over so I lost a lot of sand. I got a hold of Amazon and they are shipping me out a brand new bag for free and told me to keep what I did receive. Definitely will purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn Marie Lacey",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Hermit Crab Approved!",
      "text": "I ended up buying hermit crabs before I had a chance to use this for its intended purpose (for my axolotl tank). The hermit crabs love this sand! It holds shape as they burrow through it, very similar to fine, soft beach sand. I wet it thoroughly with salt water, so it also helps maintain the high humidity they need to thrive. The hermit crabs we bought almost immediately buried themselves to molt-- so I'd say the hermit crabs approved!",
      "rating": 5.0,
      "verified": true,
      "author": "Quin's Mom!",
      "helpful_votes": 2,
      "publication_date": 20170122
    },
    {
      "title": "My hermit crabs LOVE this sand",
      "text": "I was leery when choosing sand because I read that most sand actually harms the crabs by cutting them. This is NATURAL river sand that I've been using in my terrarium for over a year now. I clean out and refresh the sand in my tank every 4 months. My crabs just love it! They tunnel and play in it. I initially spray the sand with warm water (bottled) until the top is moderately wet. That moisture coupled with the Zoo Med ReptiTherm® Under Tank Heater really provide a nice environment. My crabs have molted several times. Just make sure to watch the humidity levels (too high and too low actually cause the crabs pain and sometimes death).",
      "rating": 5.0,
      "verified": true,
      "author": "AUTUMN28",
      "helpful_votes": 5,
      "publication_date": 20140108
    },
    {
      "title": "This item is a fine sand and is safe in case your turtles decide ...",
      "text": "This item is a fine sand and is safe in case your turtles decide to swallow it. I had turtles that were eating rocks and would find them around as they would spit them out. It will be heavy and I would suggest making sure your tank is properly set up. This sand cracked the bottom of my tank after about 2 months. Also the sand will get stuck in your filter",
      "rating": 2.0,
      "verified": true,
      "author": "Bryanna",
      "helpful_votes": 3,
      "publication_date": 20170208
    },
    {
      "title": "Poor packaging",
      "text": "High quality sand, but loose sand everywhere. Packaging needs to be better!",
      "rating": 3.0,
      "verified": true,
      "author": "Natalie Newell",
      "helpful_votes": 3,
      "publication_date": 20190605
    },
    {
      "title": "Great substrate for Uro's",
      "text": "I used to HATE cleaning our cage for our uromastyx lizards because it would kick up a bunch of dust and make me sneeze, however, since we switched to this Riverbed Sand I don't mind at all because there is no dust when we sift through the sand. It also gives me a little more peace of mind because I worried about the dust from our old sand getting into the uro's lungs and getting them sick but since this sand has no dust I do not worry so much. It also has a very nice, natural color, which makes the terrarium look great. Highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Mugglemama",
      "helpful_votes": 4,
      "publication_date": 20130906
    },
    {
      "title": "Very murky.",
      "text": "It is very nice looking and easy-ish to work with. The only problems were that it got everywhere (user error) and that it made the water absolutely nasty. It blocked up the filter and has stayed cloudy for hours. Went to get some Accu-clear in hopes it helps.",
      "rating": 3.0,
      "verified": true,
      "author": "Katelyn G.",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Not good",
      "text": "The sand clogged my filter. It was not good. It never settled to the bottom of the tank. It kept getting stirred up by the turtle. After 2 days I had to clean the entire 55 gallon tank. It was a huge mess!!",
      "rating": 1.0,
      "verified": true,
      "author": "New mom",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "best i've used for axolotls",
      "text": "I use exclusively this sand for axolotls. It's very very fine, so when filling a tank pour water onto a plate instead of directly on the sand to keep it clear. Plants have been very happy in it, as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "looks nice but the spider I had in it after digging ...",
      "text": "looks nice but the spider I had in it after digging some holes and eating some crickets promptly died after adding this sooooooo, who knows. :(",
      "rating": 2.0,
      "verified": true,
      "author": "Forced March",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Muddy water",
      "text": "Turtles seem to like it, makes the water pretty dirty though.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Harrison",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "They seem to like it fine and it's nice to",
      "text": "I use this as substrate in my aquarium with Sulawesi Rabbit Snails. They seem to like it fine and it's nice to watch them dig around in it.",
      "rating": 5.0,
      "verified": true,
      "author": "AJ Dunevent",
      "helpful_votes": 0,
      "publication_date": 20170328
    },
    {
      "title": "but once you get it clean it's good. Super fine",
      "text": "It's probably the dustiest sand I've seen, but once you get it clean it's good. Super fine, great for fish that require fine sand, like cories, loaches, axolotls, any fish that like to bury themselves, etc. Plants are doing well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessie Creed",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "My turtle is happy!!",
      "text": "I love this sand for my Eastern Spiny Softshell Turtle!!! He loves to bury himself and it acts as an exfoliant for his shedding shell! I recommend this product to anyone with a Softshell turtle.",
      "rating": 5.0,
      "verified": true,
      "author": "Carissa Ball",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Nice, fine sand",
      "text": "I had ordered about 10 bags of this sand for my turtle tank. It looks great. My Coris make sure tat it stays clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Max",
      "helpful_votes": 0,
      "publication_date": 20151017
    },
    {
      "title": "Good sand, but be careful.",
      "text": "I purchased this sand after reading it doubles as desert sand for a terrarium. I've been buying desert sand for hermit crabs for years now, so I assumed this would be okay. Unfortunately, this sand did not suit my needs. It is a very, very fine sand that turns quickly into mud when wet. The sand is of great quality and had no chunks or off colored mixes in it, but if you are buying it for a terrarium that is humid, be careful as it does not take to moisture and water well.",
      "rating": 5.0,
      "verified": true,
      "author": "TwoTherapistsAndABaby",
      "helpful_votes": 8,
      "publication_date": 20120513
    },
    {
      "title": "Poor packaging",
      "text": "Product is good. Sadly the product bag was cut and it was all over the shipping box when it arrived.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "good",
      "text": "clean and very nice-looking. Perfect for either dry landscapes or humid ones, although the sand does cloud up the water quite a bit",
      "rating": 5.0,
      "verified": true,
      "author": "Rikudo_Sannin",
      "helpful_votes": 0,
      "publication_date": 20140624
    },
    {
      "title": "Turtle sand",
      "text": "Turtles love the sand! They were very happy after I placed them in their sand!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Hilley",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Gonna buy more!",
      "text": "Its hard to find sand that is fine enough for my pancake turtle to burrow in without the sharp rocks in it. This is perfect. I am ordering more to put in the bottom of my outside pond for him.",
      "rating": 5.0,
      "verified": true,
      "author": "RJ",
      "helpful_votes": 0,
      "publication_date": 20130514
    },
    {
      "title": "Two Stars",
      "text": "The sand made my water not balance out. The harness was way too high for some reason",
      "rating": 2.0,
      "verified": true,
      "author": "Samuel",
      "helpful_votes": 0,
      "publication_date": 20161104
    },
    {
      "title": "Bag came torn and sand spilled all through my living ...",
      "text": "Bag came torn and sand spilled all through my living room carpet :/ only a little bit of sand left",
      "rating": 1.0,
      "verified": true,
      "author": "Abby",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "Good Product",
      "text": "I have an Asian Soft shell turtle, and they LOVE to dig! He is loving his new dirt he can hide himself in. He seems to feel a little more\"at home\" and is making regular appearances. Thank you for the quick shipping and a reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha H.",
      "helpful_votes": 0,
      "publication_date": 20120711
    },
    {
      "title": "Much better than beach sand",
      "text": "Looks great and feels great. More like muddy sand. My turtles and Cory catfish love it. Can't wait to order more.",
      "rating": 5.0,
      "verified": true,
      "author": "Curt L.",
      "helpful_votes": 2,
      "publication_date": 20121206
    },
    {
      "title": "good",
      "text": "got this sand for my turtle tank so that the bottom was not bare. its sand so it gets wet and makes a mess, makes the water cloudy and my turtle was always digging in the sand kicking it around. I have since taken the sand out only because I personally did not like it for my turtle tank. However, if you like sand this was good sand and a good color.",
      "rating": 5.0,
      "verified": true,
      "author": "pee wee",
      "helpful_votes": 5,
      "publication_date": 20111117
    },
    {
      "title": "great sand bad packing",
      "text": "When some one shipped the sand they put it in with the rest of my order that had fish decoration that busted the bag and spilled half of it in the box all over everything.",
      "rating": 3.0,
      "verified": true,
      "author": "Lucille  B. Langley",
      "helpful_votes": 0,
      "publication_date": 20131220
    },
    {
      "title": "Nice sand but I was surprised at just how little ...",
      "text": "Nice sand but I was surprised at just how little 10 lbs. is. I was expecting a larger bag but guess sand is just heavy.",
      "rating": 3.0,
      "verified": true,
      "author": "Patricia L. Hollister",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "Great product",
      "text": "I purchased 11 bags of this stuff for several reptile set ups after losing a breaded dragon to impaction. The impaction came from the use of a different substrate. This stuff is ultra fine and likely to pass right through the animal if ingested. I'm currently using it with the following animals: agamas, breaded dragons and a mali uroumastyx.",
      "rating": 5.0,
      "verified": false,
      "author": "Kerry Cutler",
      "helpful_votes": 3,
      "publication_date": 20110731
    }
  ],
  "product_meta": {
    "title": "Exo Terra Riverbed Sand, 10-Pound, Brown",
    "description": "Exo Terra riverbed sand is ideal for many types of aquatic turtles as it is their preferred substrate in the wild. Soft-shell turtles especially prefer the find sand for digging and burrowing. Other types of water and ground-dwelling reptiles, such as frogs and salamanders, will also benefit from riverbed sand because of its soft nature. A rough surface, such as gravel, can easily injure skin tissue. Riverbed sand is very fine and can be easily secreted when ingested, unlike gravel or pebbles which can cause indigestion. Created over time in an African river, riverbed sand is extremely fine and round, making it an ideal and safe substrate for the aqua-terrarium. Natural sand, no added dyes or chemicals. Creates a natural and attractive aquatic environment. Stimulates natural behavior. Available in brown color. Available in 10-pound plastic bag.",
    "rating": 4.3,
    "feature_bullets": [
      "Quality and performance driven products for your pet",
      "Tested for safety and health",
      "Provide a better quality of living for your pet with Exo Terra"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1.5 x 9.2 x 2.5 inches; 10 Pounds",
      "Item model number": "PT3107",
      "Date First Available": "July 16, 2008",
      "Manufacturer": "Exo Terra",
      "ASIN": "B001B599D2",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Reptiles & Amphibians",
      "Sand",
      "Pet Supplies",
      "Terrarium Bedding, Sand & Substrate"
    ],
    "price": ""
  }
}