{
  "website_summaries": [
    {
      "verdict": "With a seemingly loyal fan base, many are enjoying the Keds Champion Slip On, opting to buy it again and again. The ease and comfort it brings while on long walks is something to take note of.It is also good to take note that the sneaker’s sizing is inconsistent. For those with sweaty feet, these sneakers might not be on the top of the list as there have also been complaints of the shoes having little breathability. All in all, it is a great all-around pair of shoes.",
      "pros": [
        "A lot of buyers love the classic look of the Keds Champion Slip On Leather",
        "A good number of reviewers have noticed how comfortable the shoes were when worn",
        "The minimalist look the Keds Champion Slip On Leather goes great with any style, some buyers commented,",
        "Many buyers are repeat customers who have fallen in love with the shoes, some even rebuying the same shoes after their old ones have been worn down",
        "Great for wearing and taking on trips that entail a lot of walking, some users pointed out",
        "A few purchasers of the shoes love how they are lightweight and easy to slip on and off",
        "Being made of leather, reviewers noted that it is easy to clean",
        "A couple of users were quick to point out the durable material used to assemble the shoes"
      ],
      "cons": [
        "Some users noticed that the Keds Champion Slip On Leather runs a little large",
        "One reviewer commented on the shoes’ breathability, saying that there was not enough ventilation",
        "Color options are boring and some shoppers wish there were more color variations"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.3,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "I also was disappointed by the quality",
      "text": "I returned this item because they were too large through the heel. I also was disappointed by the quality, which seemed very poor for the Keds brand, which I have purchased for many years. In fact I was replacing a pair of well worn Keds I've had for ages, but looked as if they'd still last longer than the new pair. I switched to another brand that fits me better and looks much better made.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Peach",
      "helpful_votes": 13,
      "publication_date": 20170602
    },
    {
      "title": "Best Shoe Shopping Day!",
      "text": "I always have three pairs of these at all times. One like new pair (for going places that I need to look put together), a second pair for looking good enough to grocery shop, go by pharmacy , quick errands, the third pair is for working in the yard and things of that sort. I just pass them down as they reach the new status. Best shoe ever made!",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. V",
      "helpful_votes": 11,
      "publication_date": 20170929
    },
    {
      "title": "Something's not right with the fit...",
      "text": "I accidentally ordered these leather Keds instead of the canvas ones my daughter prefers. She kept them anyway, but later realized there is more of a difference than just the material: these leather Keds have a completely different fit and cut than the canvas version. These shoes are longer and narrower than expected for the size, with less room for a high arch. Not sure if the odd fit contributed to stressing the seams of the shoe, but after a month or so the rubber sole started to show separation from the upper. Oh, well, off to the trash bin!",
      "rating": 1.0,
      "verified": true,
      "author": "LegoGirl",
      "helpful_votes": 20,
      "publication_date": 20150225
    },
    {
      "title": "Super cute and comfy",
      "text": "Bought these for a vacation where we'd be walking a LOT. I hate sneakers and don't buy them because I do not like the look of them so I'm very picky when it comes to shoes. These were very low profile and looked super cute. I was very happy with them. They do run a tad small in my opinion. I always wear and 8.5 and I have very narrow feet they were a tiny bit snug. If you have wide or chubby feet definitely size up!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen",
      "helpful_votes": 9,
      "publication_date": 20170627
    },
    {
      "title": "Comfortable",
      "text": "So happy with this pair of Keds. I have worn Keds for more years than I can remember. They hold up great and are comfortable. These are light weight and easy to slip on and off. They have not worn blisters on the backs of my heels like some slip on's can. Run true to size. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Pugchick",
      "helpful_votes": 6,
      "publication_date": 20180118
    },
    {
      "title": "I have been wearing them around the house this morning and it seems like it will be good",
      "text": "hard to answer about size with a simple answer.I have not bought this style Keds in years. My old pair is a size 7 but of course stretched out. My shoe size now is generally an 8. so I went with the 8. They were a tiny bit tight in width. I put wooden shoe stretchers in. This seemed to do the trick . I have been wearing them around the house this morning and it seems like it will be good.",
      "rating": 4.0,
      "verified": true,
      "author": "M. S.",
      "helpful_votes": 4,
      "publication_date": 20171014
    },
    {
      "title": "Everyday shoe",
      "text": "I wear these everyday and wear them out in about 8 months. I've been wearing them for years. I love that they're so easy to put on, they wipe clean, they're light and not clunky so I can wear them around the house. They're plain white so go with everything. Love these shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Narrow Feet",
      "text": "If you have narrow feet with a high arch and are tired of walking out of your shoes and frustrated with buying shoe after shoe only to find its too wide, this shoe is for you. It's a great every day shoe to run about town, take short walks and move about the house. It stays on your foot and looks great!",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie Wilson",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Really like",
      "text": "I have been hunting a pair of shoes like this but didn't want to pay a fortune. I found these on here for 35.00. Wasn't sure when I got them b/c the leather was tight but now they have stretched some I love them. I wear with anything. They are my go to throw on shoes if I don't want flip flops",
      "rating": 5.0,
      "verified": true,
      "author": "Darlene",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Go to summer sneaker!",
      "text": "I wear these all summer. The perfect white sneaker that goes with everything. Comfortable as well. Doesn't supply a ton of support, but my feet don't complain. When a pair wear out, I wear those to do yard work and get a crisp new pair. Love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie",
      "helpful_votes": 3,
      "publication_date": 20170801
    },
    {
      "title": "Classic Keds but elastic seam rubs top of foot",
      "text": "So on left shoe where the elastic meets the top tongue area it rubs on the top of my foot which kinda hurts. It's strange as the right shoe is fine and that's my bigger foot. I stuck a bandaid over the seam and that helps but it still rubs a tiny bit. Shoe size as expected.",
      "rating": 4.0,
      "verified": true,
      "author": "KK",
      "helpful_votes": 3,
      "publication_date": 20170505
    },
    {
      "title": "My wife LOVES her Keds.",
      "text": "My wife loves her Keds. She has had several pair in the past and will in the future. She doesn't like shoes/sneakers with thick or uneven soles and the Keds soles are thin but well protected and supportive. I'll be ordering her a couple more pair shortly. They fit well and are comfortable out of the box.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Johnson",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Great shoes",
      "text": "I love these shoes; this is my 3rd pair. I wear them out because I wear them all the time! Great for walking and very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Bobbi",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "If you are just looking for an everyday shoe then it's great",
      "text": "Almost my entire adult life I have had keds. They were always a quality shoe. I'm not quite sure if the idea is a lighter form of leather or if it is a cheap leather but the shoe just doesn't give the same quality feel and look. If you are just looking for an everyday shoe then it's great",
      "rating": 4.0,
      "verified": true,
      "author": "muttmom",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Good for all kinda  activity",
      "text": "There nothing better then keds origional , grate arch support, not slippery robber soil , leather . Wish it is more colors available",
      "rating": 4.0,
      "verified": true,
      "author": "Oksana",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Will order more",
      "text": "Fabulous, really comfortable. Have very wide,flat “Flintstone” feet. Wish all my shoes were this comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Carmack",
      "helpful_votes": 0,
      "publication_date": 20201026
    },
    {
      "title": "L",
      "text": "If you order these shoes you need to know that they only come in whole sizes not half sizes . I made three attempts. The first pair of eights were too big so I thought I ordered a 7 1/2 but they' came back as 7. I sent back both pairs and tried once more for a 7 1/2 but they came back as a 7. The leather shoes do stretch so I am keeping the 7. Enough already!",
      "rating": 3.0,
      "verified": true,
      "author": "Marilyn B.",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "Super comfortable and comes in narrow!",
      "text": "Love these shoes. Comfortable, go with everything. My go-to shoes for spring and summer -- and basically the only shoes I wear! It's so very difficult for those of us with narrow feet to find shoes these days -- thankfully Keds still make a narrow, and they fit very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Healeygal",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "It's a good product",
      "text": "I've been wearing these Keds for about 20 years and hate to thrown out the old ones. I use the older ones for gardening and other work around our home and use the new pair for going shopping or just being out in public. Unfortunately, I had surgery on my right foot and the seam irritates the surgical scar. I'm going to try a piece of moleskin to see if that helps. I would hate to return these great shoes. My old ones still fit after 3 years, stretched out due to continual wear.",
      "rating": 4.0,
      "verified": true,
      "author": "Cheri Dawson",
      "helpful_votes": 2,
      "publication_date": 20140628
    },
    {
      "title": "Great simple and classic styling",
      "text": "I love the simplicity of style that will make these go with so much of my wardrobe. Sometimes I have a hard time fitting shoes but these were perfectly comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie Hammond",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Cute summer shoe - have bandaids!",
      "text": "Nice shoe - kind of rough on the ankles - need to wear bandaids at least for now. Wish it had a thicker sole to be more fashionable.",
      "rating": 4.0,
      "verified": true,
      "author": "Buyer",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "The Best Shoes EVER!",
      "text": "Grasshoppers women's shoes are available in different sizes and width to ensure a perfect fit. these shoes are made out of washable leather and can be worn year round with comfort and confidence.",
      "rating": 5.0,
      "verified": true,
      "author": "Jovita",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Work them in and then they're great!",
      "text": "I do love the Keds slip ons, but they need to be worn in a little. They are stiff and narrow when they first come in. I suggest bending them back and forth while you're watching TV to loosen them up. They are a little narrow with the rim stiff so until you work them in they feel a little uncomfortable but it's not long before they conform to your foot and are very comfortable. You just have to work them in.",
      "rating": 4.0,
      "verified": true,
      "author": "Tommy + Mich",
      "helpful_votes": 2,
      "publication_date": 20150228
    },
    {
      "title": "I put a mini potato in my shoes and jammed it in the toe area and left my shoes like that overnight",
      "text": "By somewhat small, I mean mainly when I first received them, they were too tight. But thankfully, its leather. It can stretch. Don't be afraid and get your shoe size. I put a mini potato in my shoes and jammed it in the toe area and left my shoes like that overnight. The next day, the shoes still looked the same on the outside, but now my toes had room to breathe on the inside. They have stayed like that for as long as I've had them. I have no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Magdala",
      "helpful_votes": 0,
      "publication_date": 20151201
    },
    {
      "title": "Always the BEST",
      "text": "Been buying them as she wares them out for years... still fit the same, comfortably",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin A Berryhill",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "I love these slip-ons.",
      "text": "I ordered a 6 1/2, which is what my old ones are. But when I rec’d them, they were too big. So I ret’d them and got a size 6 and they fit great.",
      "rating": 5.0,
      "verified": true,
      "author": "kirt",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Please  go back to the quality of previous years",
      "text": "My leather slip ons are longer than I expected. But I can live with that with a little adapting. But the inner soles on the new Keds Slip Ons is very inferior to that of years past.They formerly came with a terrycloth type inner sole.And they had arch support .None of that former good quality inside the shoe remains, hence they do not feel good on as they always did in previous years.If Keds does not pay attention to quality they will be lose long time lovers and buyers of their slip ons.Martha",
      "rating": 3.0,
      "verified": true,
      "author": "Martha  , South Carolina",
      "helpful_votes": 2,
      "publication_date": 20140802
    },
    {
      "title": "My mom only wears these shoes due to her feet ...",
      "text": "My mom only wears these shoes due to her feet problem she is 80 years old and loves them they are very well maid and come in quick wish I could find the cream and tan and navy blue in them",
      "rating": 5.0,
      "verified": true,
      "author": "lisajenmcc",
      "helpful_votes": 2,
      "publication_date": 20170418
    },
    {
      "title": "... width across the inner part of the foot was fine. They were not quite wide enough at the ...",
      "text": "The length of the shoe was too short but the width across the inner part of the foot was fine. They were not quite wide enough at the toe area. These shoes were made in Vietnam and they do not fit the same as the ones that come from China. The ones from China are pretty much true to size but these are not. My husband has been stretching them for me and we still have more work to do on them.",
      "rating": 3.0,
      "verified": true,
      "author": "Larry G. Cox",
      "helpful_votes": 2,
      "publication_date": 20150511
    },
    {
      "title": "Product detail NOT as advertised - new cut and NO cotton terry lining.",
      "text": "This used to be a great shoe. Keds has changed the design and Amazon still sells it noting the cotton terry lining. It DOES NOT have the cotton terry lining. We tried notifying them of the misleading description, however they have not corrected it. The shoe design and insert is simply no longer as comfortable. Cuts too high on arch and line is all canvas.",
      "rating": 1.0,
      "verified": true,
      "author": "ShopSmart",
      "helpful_votes": 6,
      "publication_date": 20140306
    },
    {
      "title": "but my all time favorite summer time sneaker",
      "text": "No arch support wish there was some, but my all time favorite summer time sneaker. Easy on off, I ordered a half size smaller, last time had my current size and were a tad to big. They are leather so they will stretch. Easy to clean too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160419
    },
    {
      "title": "Cute Keds Slip-ons.",
      "text": "Great Keds slip ons, but you must wear small socks not the thicker ones that I normally wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean D Lange",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Something not right about this shoe",
      "text": "I purchased these shoes and within the first week the leather separated from the sole. Both shoes did the same thing. I have been wearing Keds for over 25 yrs, I have never had bad quality like this when I buy directly from them or a department store. I am wondering is these were from a defective run or maybe not from Keds. I paid retail price I would have paid at macys, and had to throw them in the garbage after a few weeks.",
      "rating": 1.0,
      "verified": true,
      "author": "tessa",
      "helpful_votes": 5,
      "publication_date": 20131217
    },
    {
      "title": "The shoe fits and the quality is excellent.",
      "text": "Timely delivery - a little pricey, but I prefer leather Keds to the canvas ones.",
      "rating": 5.0,
      "verified": true,
      "author": "B. J. Whitesell",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Perfect",
      "text": "I was unsure of size due to reviews but I decided to go with my size. Perfect fit! And they looked super cute!",
      "rating": 5.0,
      "verified": true,
      "author": "HLM",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Shoe pictured is not the one they ship/",
      "text": "The shoe shipped does not have the laces as shown in the picture.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda Lott",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Perfect kick around shoe",
      "text": "Comfy, easy to put on, not a lot of support, but enough for kicking around the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "While the shoes were what we expected they are way ...",
      "text": "While the shoes were what we expected they are way too narrow. We have returned them for a refund and unless we can get regular width will be looking somewhere else",
      "rating": 3.0,
      "verified": true,
      "author": "Carlos",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "I usually choose a size 6, but these are ...",
      "text": "I usually choose a size 6, but these are a little too big. I felt that I had worn them too much to return them and ask for a smaller size.",
      "rating": 3.0,
      "verified": true,
      "author": "Audrey Ross",
      "helpful_votes": 2,
      "publication_date": 20170722
    },
    {
      "title": "Just OK",
      "text": "I wanted a pure white shoe and I'm not fond of laces. I've had Keds canvas before. I don't know if th leather makes a difference,or what, but these shoes are not very comfortable. It is like they are lacking something and,in my opinion, it is a lining. The inside of the shoe is rough and I had to switch to way thicker socks. They do have a decent sole support though. So on the whole, I will wear them I'm sure, but next time would probably go with the canvas.",
      "rating": 3.0,
      "verified": true,
      "author": "Booklover",
      "helpful_votes": 2,
      "publication_date": 20130215
    },
    {
      "title": "Happiness is a great pair of shoes!",
      "text": "I have worn Keds leather slip on sneakers for years. In the past few years I have had difficulty in finding them in stores. I prefer to try on shoes before purchasing them. I was delighted to find them on Amazon! They are perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy A. Rogers",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "These are comfortable",
      "text": "I have big feet and wasn't sure about these, but they are comfortable and look cute with casual summer outfits when sandals just aren't practical. I wear them with peds, and the way the sneakers fit, the peds are completely covered. As with most Keds, there is definitely room for improvement when it comes to cushy insoles, so I may add some after market insoles to make these more comfortable to walk in for longer distances.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Hood",
      "helpful_votes": 0,
      "publication_date": 20130723
    },
    {
      "title": "great for spring",
      "text": "Keds was always a classic chic, never went out of style, it's so on trend right now. Every magazine shows the slip on. Goes with many styles, great for spring, maxi dresses, skorts, shorts, medical scrubs, wear at theme parks, it won't slip off on the rides. Even brides wear them on the dance floor, they just change into a comfortable white sneaker afterwards.",
      "rating": 5.0,
      "verified": true,
      "author": "E. R.",
      "helpful_votes": 0,
      "publication_date": 20160508
    },
    {
      "title": "20 years and still counting",
      "text": "These are actually a little large but nothing heavy socks will not correct. So very glad that I have found Amazon to carry them. I do often put in an arch support or a heel support according to what the foot issue is. If this shoe had a built in support system I would have to remove to use what I needed, so this shoe works perfectly for me.",
      "rating": 5.0,
      "verified": true,
      "author": "karen tinker",
      "helpful_votes": 0,
      "publication_date": 20160323
    },
    {
      "title": "Size runs exact",
      "text": "Best price I found after looking on several sites! Same quality Keds leather slip in’s which I adore!",
      "rating": 5.0,
      "verified": true,
      "author": "Joan B",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Keds-excellent",
      "text": "Great shoes I got them for my mother and she loves them",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Sent the",
      "text": "I ordered a size 8, when I got my sneakers I immediately noticed they were a lot bigger than an 8 looked like a size 10, in the process of sending shoes back, I went directly to the Keds online store, very happy with my purchase sooooo comfortable!! And they were cheaper.",
      "rating": 1.0,
      "verified": true,
      "author": "Rochelle",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Comfortable  and look great on.",
      "text": "I wear 71/2 in canvas in this same style. The size 7 fits perfect In the same style but in leather.",
      "rating": 5.0,
      "verified": true,
      "author": "Jillzy",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Handy slip on shoes",
      "text": "I wear these shoes around our farm. They slip on and off easily which is nice coming in and out of the house from the garden or other outside chores. It's nice that they are leather which keeps my feet dry early in the mornings when there is a heavy dew. They also are easy to clean, either scrubbing by hand or throwing into the washer.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie B",
      "helpful_votes": 2,
      "publication_date": 20151016
    },
    {
      "title": "ked shoes",
      "text": "they were a tight fit at first but after awhile they got a little loose and slide a lot off my feet",
      "rating": 5.0,
      "verified": true,
      "author": "roleen komes",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Not quality leather!",
      "text": "Top of shoes leather is bubbled.. paid full price.. wasn’t supposed to be seconds",
      "rating": 1.0,
      "verified": true,
      "author": "Donna Terwilliger",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Prefect fit",
      "text": "I've worn these type sneakers for years. They are comfortable, stylish and well made!",
      "rating": 5.0,
      "verified": true,
      "author": "sgarcin",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Five Stars",
      "text": "Still my all time favorite for a tennis shoe. Comfortable and easy to slip on and off.",
      "rating": 5.0,
      "verified": true,
      "author": "Norma",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Love these shoes!!",
      "text": "These shoes were super comfy. I am a lover of Keds for life!",
      "rating": 5.0,
      "verified": true,
      "author": "N. Jackson",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "but the shoes are great. They look very good on my feet and ...",
      "text": "The last is a bit too large, but the shoes are great. They look very good on my feet and serve a purpose for a quick change with no delay.",
      "rating": 4.0,
      "verified": true,
      "author": "Page",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "but I still get great use out of them",
      "text": "These run just a little bite large, but I still get great use out of them, and they are not so large you can't wear your regular size.",
      "rating": 4.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20171118
    },
    {
      "title": "Very comfortable and looks stylish",
      "text": "These slip on tennis shoes look great and are easy on the feet. They clean up nice too.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa Waltner",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Looking good",
      "text": "Great looking comfortable shoe. I wear then wash. Always look great.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Kimball",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "A Little Long",
      "text": "The shoe seems a little longer than a normal 8; I think a 7 1/2 would have fit better. But they are great for a wide foot like mine - no \"breaking in\" and very comfortable. I like that I can slip them on and off easily, and the padded insole makes the shoe very comfortable to wear without socks. This is my second pair and I've found that they wear very well. I can wear the shoe for at least two summer seasons.",
      "rating": 4.0,
      "verified": true,
      "author": "Susie G.",
      "helpful_votes": 0,
      "publication_date": 20140420
    },
    {
      "title": "Nice slip ons",
      "text": "They are comfortable and fit perfect. I do not have any complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Mandy Johnson",
      "helpful_votes": 0,
      "publication_date": 20201024
    },
    {
      "title": "Keds Leather Slip-on Sneakers",
      "text": "The shoes are the perfect size and color...exactly as the seller described in the item description. I was so surprised that I received my item so quickly! Two years ago, I gave up on Amazon.com because my items never arrived in a resonable period of time. I switched to [...] because their items were always shipped on time (or early). But this item arrived much earlier than expected! I will definately shop w/ this seller again and I might try Amazon.com for a few other things to see if their general shipping time has improved. Thanks again for wonderful item!",
      "rating": 5.0,
      "verified": true,
      "author": "pcarson328",
      "helpful_votes": 0,
      "publication_date": 20100908
    },
    {
      "title": "Great gift!",
      "text": "My wife had an older pair of this same shoe for years that was showing its wear. I bought her 2 pairs as a gift and she has been thrilled ever since. The fit was perfect and the comfort and durability of this shoe we have found over the years has been excellent. Since my wife is happy with this gift, I am also a happy guy and have to give this a 5 star rating.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Pavese",
      "helpful_votes": 0,
      "publication_date": 20140227
    },
    {
      "title": "Runs very Large",
      "text": "My goodness these are at least one to one and a half sizes larger than normal which is so strange because I ordered grey leather lace up Meds the same day and they fit perfect (same size, same manufacturer).",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20161022
    },
    {
      "title": "Cute but defective",
      "text": "When I first received my shoes, I thought they fit great and were just as expected. Unfortunately, after wearing the shoes for a few hours, the right shoe became noticeably wrinkled. It appears the material is defective on only the one shoe. I sadly will be returning them.",
      "rating": 2.0,
      "verified": true,
      "author": "Xero",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Bye Bye old faithful !!",
      "text": "These were ordered one size smaller than I normally wear and my usual wide width. They were both too wide and and too big. They slipped and had a ripply finish as opposed to the smooth leather ones I own. They are just OK and not worth the money. I can only wear them with thick socks. I may try Grasshoppers. Another old reliable product gone.",
      "rating": 2.0,
      "verified": true,
      "author": "LINDA",
      "helpful_votes": 2,
      "publication_date": 20170511
    },
    {
      "title": "The other pair has been fine. They were too expensive to fall apart so ...",
      "text": "Purchased 2 pair- one pair came apart at the seams between the shoe sides and the rubber sole. It is now unwearable. The other pair has been fine. They were too expensive to fall apart so quickly. :-(",
      "rating": 2.0,
      "verified": true,
      "author": "Mama Mia",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "Not the same...",
      "text": "I have ordered these for years but the two pair I received recently rubbed on my small toe and just didn't fit right....did not seem to be of the same quality as previous pairs. I love Keds and will just order a different style...maybe those will fit better. Too bad because I loved this shoe. :0( Disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "JGT",
      "helpful_votes": 0,
      "publication_date": 20140731
    },
    {
      "title": "I received the shoes in another country... ...",
      "text": "I received the shoes in another country... One of the shoes is damaged.. As is leather it looks awful in front of the shoe!!! Be careful!!!!! Is really complicated to return it! 😞",
      "rating": 1.0,
      "verified": true,
      "author": "Elena",
      "helpful_votes": 4,
      "publication_date": 20170824
    },
    {
      "title": "Just what I needed",
      "text": "Love these shoes - just what I wanted, fits well",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda D. Mitchell",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Always part of my summer wardrobe",
      "text": "Love these sneakers. Love the fact that there are no laces to bother with. They hold up well and if a little smudged just wipe off. I even clean with a little brush if necessary. I have bought a pair or two every summer for more years than I care to remember! I wear 6 1/2 to 7M. Ordered 6 1/2 and they fit perfectly. They will stretch a little so consider that when ordering.",
      "rating": 5.0,
      "verified": true,
      "author": "Florence",
      "helpful_votes": 0,
      "publication_date": 20130606
    },
    {
      "title": "Keds never disappoint",
      "text": "I love Keds. I wear these to my retail job where I'm on my feet. Usually when I get done the knuckle part of my foot is red and hurting from the rubbing, but otherwise these shoes are great!",
      "rating": 5.0,
      "verified": true,
      "author": "Molly",
      "helpful_votes": 0,
      "publication_date": 20161006
    },
    {
      "title": "Super cute. They break in really fast",
      "text": "I wear these shoes more than anything else I own. They last me at the very least three years before getting too messed up and then I order another pair of the same ones. Super cute. They break in really fast.",
      "rating": 5.0,
      "verified": true,
      "author": "G. M.",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "They looked good but they are not really as durable as I ...",
      "text": "They looked good but they are not really as durable as I expected for the Ked brand. The trim has started buckling and I only have had them for 2 months",
      "rating": 3.0,
      "verified": true,
      "author": "ThatGirl4Real",
      "helpful_votes": 0,
      "publication_date": 20170622
    },
    {
      "title": "Love",
      "text": "LOVE these shoes! They are perfect for slipping on to run errands. Comfortable and stylish.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Klecka",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "Great fit. Cute. Simple. Affordable",
      "text": "Needed white leather shoes for dental school. These were by far the cutest and most simple I could find. This price isn't bad either. Got my pair 1week after ordering. I ordered a size 8 & wear size 8 average arch/width, they fit me really well. Will try to update after wearing for an extended period of time once school starts.",
      "rating": 4.0,
      "verified": true,
      "author": "Y",
      "helpful_votes": 0,
      "publication_date": 20140911
    },
    {
      "title": "Width",
      "text": "I am a 8.5 regularly (women’s obviously) and this product came too tight. if you have a normal sized foot which i do you should probably get a wider shoe and choose the wide selection on the drop down box.. just an FYI",
      "rating": 3.0,
      "verified": true,
      "author": "Jack Harris",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Keds are the Best",
      "text": "Love my Keds. Fit is as it should be and very comfortable. I have been wearing Keds for probably 60 years and still love them.",
      "rating": 5.0,
      "verified": true,
      "author": "jeanne",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "Very comfortable and they look nice on my Mother",
      "text": "Very comfortable and they look nice on my Mother. She loves them because she can no longer tie her laces and the slip ons are just as confortable as her lace Keds.",
      "rating": 5.0,
      "verified": true,
      "author": "Suet",
      "helpful_votes": 0,
      "publication_date": 20170317
    },
    {
      "title": "Four Stars",
      "text": "Love the shoes but order 1/2 size bigger as they run small.",
      "rating": 4.0,
      "verified": true,
      "author": "Pamela",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "SIZE",
      "text": "I LIKE KEDS LEATHER SHOES; HOWEVER, I FOUND THE NORMAL SIZE I WEAR TO BE TOO BIG AND RETURNED AND REORDERED A SMALLER SIZE - WILL LET YOU KNOW HOW THOSE FIT UPDATE! REORDERED THIS PRODUCT FOR A DIFFERENT SIZE (SMALLER) THEY FIT PERFECTLY AND OF COURSE, ITS A GREAT PRODUCT - LOVE THE COMFORT AND LOOK OF THESE SHOES.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy K.",
      "helpful_votes": 0,
      "publication_date": 20130626
    },
    {
      "title": "Disappointed I had to send them back but had no ...",
      "text": "Not quite the same as the ones I had years ago. They looked narrow at the toe but the width under the angle was too wide. Disappointed I had to send them back but had no problems when I did.",
      "rating": 3.0,
      "verified": true,
      "author": "T. Jordan",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "but rather casual slip-ons which are perfect when occasion arises",
      "text": "These shoes are not walking shoes, but rather casual slip-ons which are perfect when occasion arises.",
      "rating": 4.0,
      "verified": true,
      "author": "Judith A. Whitacre",
      "helpful_votes": 2,
      "publication_date": 20160821
    },
    {
      "title": "Picture deceiving",
      "text": "This is not what I got. They sent the wrong shoe twice-so don’t order this because you will get a clunky boat shoe without faux laces",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Good quality, great fit, and a good buy.",
      "text": "My favorite everyday leather slip-on. Fit is always perfect. Easy to clean. Looks good. Economically priced.",
      "rating": 5.0,
      "verified": true,
      "author": "Colorado Avid Reader",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "New Keds nice but not as nice as the previous pair.",
      "text": "these keds were bought for an 86 year old to replace her previous pair which had a zipper instead of laces. she loved the other sneakers but unfortunately they were no longer in production. the new sneakers are a replacement, period.",
      "rating": 4.0,
      "verified": true,
      "author": "amzngrcp",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "... -ordered 7 1/2 w put in insert and fit perfect. Previous order I had to order 7w with ...",
      "text": "Normally wear 8w -ordered 7 1/2 w put in insert and fit perfect. Previous order I had to order 7w with insert were tight",
      "rating": 4.0,
      "verified": true,
      "author": "Sandy-Aston",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "Cheap",
      "text": "These used to be great shoes 10 years ago but now they pull apart at the sides. I tried a larger wider size that my feet practically swim in, but with hardly any pressure on the sides they started pealing apart in 2 weeks. Wish they would put a little more effort in construction because I love the look.",
      "rating": 2.0,
      "verified": true,
      "author": "Cyndi",
      "helpful_votes": 0,
      "publication_date": 20121124
    },
    {
      "title": "I love the shoes",
      "text": "I got these in size 5. I love the shoes, but it is somewhat big. However, I will keep them as I love them despite that it is not a perfect fit.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "great fit",
      "text": "yes, I love these, better cushion than when I was a Kid. I am enjoying them... I thought they would be tight, so the 1st time I ordered them I got a wide and they were too wide. Sent them back and ordered a regular size 7. I would love another pair at a later date.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Speight",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Five Stars",
      "text": "Love these shoes! I wear a size 10 in womens and they fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "MawlsToTheWall",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "I love the leather slip on keds and have been purchasing ...",
      "text": "I love the leather slip on keds and have been purchasing them, when available for many years but I am always a true 6 1/2 and I need to order size 6",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Bader",
      "helpful_votes": 0,
      "publication_date": 20170317
    },
    {
      "title": "Mom Approved...",
      "text": "I purchased these for my elderly mother and they help her walk better as opposed to her house slippers. They are great for her daily workout on a recumbent exercise bike, the shoes help protect her feet from the pedal straps and provide a good grip. They're E-Z on and off, appear to be holding up well and they're Mom Approved.",
      "rating": 5.0,
      "verified": true,
      "author": "MJS",
      "helpful_votes": 0,
      "publication_date": 20121121
    },
    {
      "title": "Keds",
      "text": "I actually ordered a half size up in order to wear sock with them. I have purchased Keds over the years and they are durable.",
      "rating": 5.0,
      "verified": true,
      "author": "TY",
      "helpful_votes": 0,
      "publication_date": 20201028
    },
    {
      "title": "Shoes were too big! & I ordered the right size.",
      "text": "I don't know why but this pair is big. I have ordered Keds before and a size 8 as well, but this feels like a 81/2 or 9. It is 1 size larger in fit in this style. Very disappointed, threw out the box & receipt and found out the fit was big when I wore it one day. So I figured they would not take it back. Very disappointed & stuck.",
      "rating": 2.0,
      "verified": true,
      "author": "katherine hirsch",
      "helpful_votes": 0,
      "publication_date": 20140108
    },
    {
      "title": "keds",
      "text": "Slip on keds hard to find in stores, enjoy having the on line option. First time for this style, do think I like the slip ons with the zipper in front better, but these will do just fine. I have a \"no shoes\" rule in the house, so these slip ons make life easier. Keds run true to size, for me, so easy to order.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Lund",
      "helpful_votes": 0,
      "publication_date": 20110608
    },
    {
      "title": "Durable & Cute",
      "text": "I love the canvas Keds. I wanted a pair that stayed white longer than a day.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbie Evans",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Keds Women's Slip on leather Sneaker",
      "text": "It fit perfectly, received it as promised. I would definitely recommend this product. I will order it again. Wish it came in black.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "They are comfortable and when they get a little grungy",
      "text": "I buy a new pair of these sneakers every year and turn last year's pair into my gardening shoes. They are comfortable and when they get a little grungy, I toss them in the wash and air dry them - they come out looking like new.",
      "rating": 5.0,
      "verified": true,
      "author": "JMG",
      "helpful_votes": 0,
      "publication_date": 20150307
    },
    {
      "title": "I bought these for my 80+ year old mother in ...",
      "text": "I bought these for my 80+ year old mother in law in 8 1/2 3A. It is very hard to find this size. Thank you Keds and vendor and Amazon for carrying them. She loves them!",
      "rating": 5.0,
      "verified": true,
      "author": "Garden lover",
      "helpful_votes": 0,
      "publication_date": 20160903
    },
    {
      "title": "Meh",
      "text": "I'm usually an 8M which is what I ordered. They were too wide, the inner sides were gaping. I was looking for a pair of cute everyday tennies, these aren't cute. But they are comfortable.",
      "rating": 2.0,
      "verified": true,
      "author": "Jade",
      "helpful_votes": 0,
      "publication_date": 20160127
    }
  ],
  "product_meta": {
    "title": "Keds Women's Champion Original Leather Slip-on Sneaker",
    "rating": 4.2,
    "feature_bullets": [
      "Null",
      "Outer Material: Leather",
      "Sole: Rubber",
      "Closure: Slip-On",
      "Heel Type: no-heel",
      "Material Composition: Leather",
      "Shoe Width: Medium womens_us"
    ],
    "specifications": {
      "Date First Available": "30 May 2020",
      "Manufacturer": "Keds",
      "ASIN": "B089FWNL8D",
      "Item model number": "WH48600",
      "Department": "Women's"
    },
    "categories": [
      "Shoes",
      "Loafers & Mocassins",
      "Women's Shoes",
      "Flat Shoes",
      "Shoes & Bags"
    ],
    "price": 129.44
  }
}