{
  "website_summaries": [
    {
      "verdict": "A great choice for anyone who wants to cut down on the work of spreading fertilizer over large areas – once you get through the assembly challenges, chances are you'll find it a worthy investment for your lawn-care needs.",
      "pros": [
        "Offers a spacious 175-pound capacity that's ideal for areas larger than 1 acre, as it doesn't require frequent refills",
        "Sturdy, tow-behind model that's easy to hitch to most lawn tractors",
        "Backed by a 2-year warranty"
      ],
      "cons": [
        "Difficult to assemble, and a few owners reported missing hardware, adding to the frustration of the task",
        "A bit top-heavy, though it's not likely to tip on flat ground or minor inclines",
        "Pricey"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Sturdy, well built",
      "text": "Sturdy, well built, relatively easy assembly , but the bottom is too flat giving the material a 'ledge' to sit on and thereby not feeding out the bottom slot consistently resulting in an uneven spread. Granted this occurs near the end of the run when material content is lower, but you still need to use what you put in the hopper ! You can reach back and bounce the unit by hand while driving, but resulting dispersal of material is still sketchy.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 16,
      "publication_date": 20180308
    },
    {
      "title": "Saved me a solid hour of hand fertilizing.",
      "text": "Easy assembly, best hardware pack I’ve ever seen. I would recommend that Brinly place some kind of mark on the handle so that you can easily tell the correct setting. I had to use up a bag of fertilizer figuring this out. Also, these tires don’t need 20 lb. of air, much to hard for uneven lawns, I’m taking a few pounds out of each to soften its ride.",
      "rating": 4.0,
      "verified": true,
      "author": "Of No Consequence",
      "helpful_votes": 14,
      "publication_date": 20180508
    },
    {
      "title": "Would be great if lever stayed in place",
      "text": "Difficult for me to put together. I have a new found respect for my husband. Purchased this while he was deployed and fought to put it together for a couple of days. Once I hooked it to my mower and got going it didn't work well. You have to hold the lever to get it to stay. I lost a ton of seed and lime. Wouldn't buy this product again.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 18,
      "publication_date": 20161214
    },
    {
      "title": "One of the best tow-behind spreaders on the market.  Highly Recommend",
      "text": "Easy to assemble. Very heavy duty. I took away a star because the rubber slide-on grip on the handle doesn't stay in place. Very annoying. When I reach back to open or close the chute, the rubber cover keeps coming off in my hand. OTHERWISE....this thing is very sturdy and holds a TON of material. (Seed or fertilizer.) I live on 3 acres and used to PUSH an old Scott's spreader around to fertilize and overseed. Now I can hold almost enough material to do the whole yard and I can do it from the luxury of my John Deere tractor seat. :)",
      "rating": 4.0,
      "verified": true,
      "author": "Tony H",
      "helpful_votes": 4,
      "publication_date": 20171105
    },
    {
      "title": "Can't reach the handle",
      "text": "This is a sturdy spreader. Plastic is used on all the areas that would be subjected to corrosion from fertilizer, so it should keep running a long time. It has good-sized tires, so it doesn't make ruts in the lawn and it has good traction for driving the spreading mechanism. However, the handle for opening/closing the hopper gate is located too far back. I cannot reach it from the seat of my lawn tractor. You should be able to shut off or turn on the spreader while you're moving, and it can't be done with the handle the way it is.",
      "rating": 3.0,
      "verified": true,
      "author": "Del",
      "helpful_votes": 3,
      "publication_date": 20181121
    },
    {
      "title": "When You Get to the Assembly of the Gage Plate",
      "text": "Have a few shots of whiskey before hand! OMG Everything was great until the Gage plate Assembly. I would be nice if the illustrations were more detailed and they actually SHOWED you both ends of the \"S Shaped Link Rod!\" Plan on an hour for this step alone! Will update as soon as I can get past the \"S Shaped Link Rod\" and I have an acre of lawn to fertilize.",
      "rating": 4.0,
      "verified": true,
      "author": "Phelps NY Chick",
      "helpful_votes": 2,
      "publication_date": 20190714
    },
    {
      "title": "I have to say its a great product, love it in fact, but their directions have some issues.",
      "text": "On page 8 of the English directions they tell you to assemble as piece one way and the picture doesn't match but on page 9 it says to do it a different way an the picture does match. I had almost everything done, like 90%, in less than 30 minutes but then spent probably and hour trying to figure out which direction was right, put it togther, test, disassemble when wrong. Great product just needs ACCURATE directions.",
      "rating": 4.0,
      "verified": true,
      "author": "E. Goff",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Where is the remote control for the drop opening.",
      "text": "Have to do some work on it. Making a remote cable so I can control the drop from my seat in the lawn tractor. Don't like the fact that when I set the drop opening fertilizer starts pouring out. By the time I get into the seat and moving I have a lot of fertilizer on the ground. To be fair no other pull behind spreader seems to have a remote control for this.",
      "rating": 3.0,
      "verified": true,
      "author": "Thomas Ryan",
      "helpful_votes": 2,
      "publication_date": 20180805
    },
    {
      "title": "Not real good.",
      "text": "Either it's not very well designed or I couldn't figure out how to use it. I couldn't regulate the flow properly - it would either not flow and jam the outlet, or it would dump out. I think it's to do with the wire 'paddle' that stirs the seed toward the hole. Maybe if it was an actual lever, rather than a piece of wire, it would work better. I ended up selling this junk for $90 on Craigslist. Blah.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael King",
      "helpful_votes": 6,
      "publication_date": 20160826
    },
    {
      "title": "Works great on long driveways",
      "text": "Assembly took about 2 hours working alone. There were a few times when the instructions weren't clear on what bolts to use. My driveway is about 220 feet long at a 10% grade. Last year I used a lawn broadcast spreader to salt the driveway. Now I tow this behind my ATV and it works pretty good. The only issue is the ATV sits a little to high so the spreader is going uphill causing the salt to move to the rear of the spreader. Only an issue when you have less than 7 pounds of salt in the spreader.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark P",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Good product",
      "text": "This is a very sturdy spreader. I use it on a 1 acre bumpy lot. Assembly is easy following instructions. About 30-45min. Only complaint yes it is the flat bottom. The last couple pound you may need to stop and push to center to keep spreading. A little annoying but at least to em not a huge issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Solid, well built, bad-*ss spreader.",
      "text": "Seems pretty solid. I appreciate the engineering and packaging of the spreader. Good instructions. The bracket that holds the engagement handle sits crooked on the shaft. It works perfectly, but the crookedness makes my OCD kick in LOL. I'm a little weirded out by the method of engagement for the spreading turn wheel. It has a rubber grommet that basically gives an interference fit. I'm wondering how that is going to hold up. I suspect a modification in my future. Overall... very solid, well built.",
      "rating": 4.0,
      "verified": true,
      "author": "Benjamin Campfield",
      "helpful_votes": 2,
      "publication_date": 20180729
    },
    {
      "title": "Only 90 minutes to assemble.",
      "text": "No assembly problems. Parts packaging the best, easiest to use that I have ever seen. I added a 6 foot 1\" PVC arm (made from old throwaways) to the dump control so that I can turn the spraying on an of from the drivers seat as I proceed. The flat bottomed bin leaves a quart or more of material un-spread. A longer agitator would help somewhat.",
      "rating": 4.0,
      "verified": true,
      "author": "LT1939",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "I was hoping for better results....",
      "text": "Seems to leave quite a bit of fertilizer left in the hopper bottom that doesn't get fed into the dispenser hole and spread. I think the walls of the hopper needs to have a steeper rake angle for better feeding to the dispenser hole.",
      "rating": 4.0,
      "verified": true,
      "author": "K Hoy",
      "helpful_votes": 2,
      "publication_date": 20191008
    },
    {
      "title": "Works well!",
      "text": "I have almost 2 acres of lawn and this holds the amounts of whatever I want to spread. It has a nice throw pattern and has worked well. If you are not mechanically inclined you will probably want a second set of hands. make sure you tension the arm for the opening setting or it can creap back to close, once it is tightened properly it will work great.",
      "rating": 4.0,
      "verified": true,
      "author": "splaino",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Five Stars very well deserved",
      "text": "Wow- This spreader really spreads. The instruction book that came with this left no questions. Simply had to be the clearest assembly manual I have ever seen. The parts pack was laid out so well, there was no question what part I need at what stage of the assembly. Whoever set this packaging up was a genius. The finished product is perfect, does exactly what I needed and more. Very durable and seems to be built to last for many years. Five Stars very well deserved",
      "rating": 5.0,
      "verified": true,
      "author": "T. Huber",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Needs a fix or two",
      "text": "I just used this to plant 4 acres of winter rye grass. Works just about perfectly. Holds 2, 50lb bags of seed (not because of the weight, but because of the volume). It never tipped over, it spread consistently. This reason for 4/5 stars is because several times the distribution lever slipped and I spread 4x the amount I wanted.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Labiche",
      "helpful_votes": 11,
      "publication_date": 20141220
    },
    {
      "title": "Missing instruction sheet and parts list...",
      "text": "Premature, as I haven't constructed it yet, but it looked great on unpacking UNTIL I could not find an instruction sheet. Fortunately, I'm handy, and the video looks clear, but without video access I think anyone would be in trouble. I'll update after finishing the assembly and after trying it out. Looks sturdy, parts are good quality, so I have hope!",
      "rating": 3.0,
      "verified": true,
      "author": "P. Brodersen",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Wastes half the fertilizer and leaves brown spots",
      "text": "I have had this for a few years now and I have to say that I wish I had purchased something else. The flat bottom really is a problem. It leaves too much in the hopper. I have tried working with it and I have tried altering it but it’s really no good.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Betts",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Rugged Unit",
      "text": "This is the first pull behind spreader I have ever owned, so I have nothing else to compare it to. The assembly was easy. I just put down 3000 pounds of pelletized lime with it. While is broadcast pretty well, no matter where I adjusted the pattern adjustment slide it would throw more product to the right, so I had to compensate for that. I may need more experience to get that right. The unit seems to be fairly rugged & should last me a few years. So far I would say well worth the money. I gave it four stars & would have gave it five if I could get a more even distribution.",
      "rating": 4.0,
      "verified": true,
      "author": "capplesmit",
      "helpful_votes": 3,
      "publication_date": 20170729
    },
    {
      "title": "Glad to have this spreader!",
      "text": "Super glad to have this for my 1.5 acre plot. Takes a little getting used to the spread adjustment.. but you can say the same for just about any spreader. I used a little silicone grease at bushings, and moving parts, because some materials will react chemically with certain solvents. Silicone grease is safe for just about anything.",
      "rating": 5.0,
      "verified": true,
      "author": "wsp II",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Not for use with many zero turn mowers",
      "text": "I use a Hustler zero turn mower and there is no way of reaching the on and off handle while driving the mower. Putting down grass seed was a problem as the flow of seed can not be regulated while operating the mover. There is no way to reach the control handle. If left in the on position, the seed would continue to spill out into a pile while I got off the mower to turn off the spreader.",
      "rating": 2.0,
      "verified": true,
      "author": "Lt. Jim Flip  Ret.",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Poor uniform spreading-avoid",
      "text": "This farm is greatly disappointed in the uniform spreading when pulled at a constant speed. The agitator is a ridiculus small wire that attempts to keep the supply flowiing( had to weld a nail to the rotating shaft to keep it flowing). Worst-spreader I ever had. Left lines of burn pasture grass because drop chute is poorly designed. AVOID",
      "rating": 1.0,
      "verified": true,
      "author": "Dirtfarmer",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Needs improvment",
      "text": "Easy to put together. Works great. The only drawback is that the lever migrates while in use and I had to put a bungee cord on it to hold. They need to design it with teeth to prevent the movement which always starts restricting the flow.",
      "rating": 4.0,
      "verified": true,
      "author": "Darrin",
      "helpful_votes": 5,
      "publication_date": 20161024
    },
    {
      "title": "Hold a 50 bag of seed",
      "text": "Got my spreader on mon took about an hour to assemble. Very simple the directions were clear and informative all parts were organized..used the spreader today it worked as advertised the best thing is it will hold a full 50 lb. bag of grass seed the only problem I have is that with the height of the hopper it makes the spreader too top heavy it tipped over on a slight grade when it ran over a rock, a wider wheel base might help but if u are aware of this it’s easy to avoid ... all in all I would buy again... and am very happy with the product..",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Genets",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Poor quality prevents assembly",
      "text": "Can't be assembled because of slopily drilled holes with petrusions. Poor quality",
      "rating": 1.0,
      "verified": true,
      "author": "papa",
      "helpful_votes": 10,
      "publication_date": 20170524
    },
    {
      "title": "Missing parts and difficult assembly",
      "text": "So far I'm not a happy camper. The assembly is a pain because the holes and parts are not lining up/sized correctly. So far I've had to break out a drill and hammer to make adjustments. Also, several parts are missing (the spacers and cotter pin for the wheel assemby - several others have mentioned this as well) which means I'm going to have to wait until Monday to try contacting Brinly for the parts and then I'm going to have wait on them before I can finish. I expect more from something I spent $200 on.",
      "rating": 1.0,
      "verified": true,
      "author": "Roger B.",
      "helpful_votes": 2,
      "publication_date": 20180519
    },
    {
      "title": "Nice spreader",
      "text": "Perfect for my needs. Large capacity, well made. It came with a damaged part but Brinly was great in shipping out a replacement at no charge - and I received it within a couple of days. I recommend this product and this company for their great customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "William J Potvin",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Great pull behind broadcaster/spreader.",
      "text": "I got this as a gift for my dad. He would normally have to walk several acres spreading grass seeds, fertilizers, and etc. But now he can hook this up on his rider and do what use to be a 3 hour job in less than 30 mins. He sometimes even do other people yards with it. It was pretty easy to install. I probably could have gotten the smaller version. But I wasnt sure of the size difference when I ordered it and decided to just go for the largest one. But with that said the larger broadcaster means less refilling. Which means getting the job done faster.",
      "rating": 5.0,
      "verified": true,
      "author": "Trey",
      "helpful_votes": 5,
      "publication_date": 20151017
    },
    {
      "title": "Seems to be great quality and awsome value for the price!",
      "text": "Wow. For around $200 you just cant beat this thing. I got the 175# and it is big and sturdy. Easiest thing ive ever put together. Each step was on a seperate page and the parts came packed for each individual section. No cofusion or guessing involve. I have not used this yet but will be in the next couple of weeks. If any thing changes i will update this post.",
      "rating": 5.0,
      "verified": true,
      "author": "Nate Cleer",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Worst Spreader Control System",
      "text": "Purchased this product to pull behind lawn tractor on 2 acres. The control mechanism for this spreader is horrible. I have tightened the knob as hard as possible and no matter what it will loosen and slide to the highest setting dropping 50lbs of fertilizer in seconds. I have tried everything to get this to work and yet it continues to fail. At this point, I have wasted over $200 in fertilizer due to this piece of equipment not holding the correct setting. So if accuracy is important to you and you don't want to burn your lawn or your wallet out, look elsewhere.",
      "rating": 2.0,
      "verified": true,
      "author": "Cary Schreiner",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "It worked for awhile...",
      "text": "We purchased this spreader in the fall of 2017 and we used the spreader six times to spread fertilizer, etc. on our grass. As we were using it for the first time this spring, the part of the frame that connects to the axle broke. It is currently now usable. I would not recommend purchasing this spreader! UPDATE: And their customer service is unreachable. Buyer Beware!",
      "rating": 1.0,
      "verified": true,
      "author": "JR",
      "helpful_votes": 2,
      "publication_date": 20190406
    },
    {
      "title": "BUYER BEWAREN -ASSEMBLY",
      "text": "UNIT IS ADVERTISED AS EASY ASSEMBLY. THERE ARE OVER 93 parts (bolts washers, nuts, etc.) Instruction manual on page 15 misidentifies part # 35 & #36. VERY DISAPPOINTED. I SHOULD HAVE GONE TO TRACTOR SUPPLY OR LOWES AND BOUGHT ONE ASSEMBLED AT THE SAME OR LOWER PRICE.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott F. Davis",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Poor design",
      "text": "Do not buy. This is a unit that people buy by name but it’s a poorly designed spreader. There is no way other than rigging it to keep it open while using it. The company offered only to use a bungee cord to keep it open (really?) There is no good excuse for this. After being in business they claim for over 100 years, you would think they could get it right by now.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin Vaughn ",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Light weight, but durable",
      "text": "Forget small push type broadcast spreaders if you have a large property. I can place 5 to 6 large bags of fertilizer in this bad boy and go to town! I am done in a fraction of the time it would take to use a push spreader. If your property is large, explore this unit. I think you will find it very economical.",
      "rating": 5.0,
      "verified": true,
      "author": "Reviewed A. Siz",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Brinly Tow Behind Broadcaster/Spreader is Great!",
      "text": "This made in the USA spreader is well made and exceeded my expectations. I can load 3 bags of fertilizer at a time and spread it. I recommend this spreader if you are looking for a economical, sturdy, well made piece of equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda E. Evans",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Great Spreader with the right durability for large property",
      "text": "I spread over 800lbs of weed and feed on 15 acres and the spreader performed extremely well. Some of my property was rough and uneven, but the spreader stayed steady. It took me a few hours to assemble but the instructions were easy to follow. My only complaint is that the flow adjustment lever tends to slide closed during use. I used a piece of nylon line to hold it open to the number 3 position which provided the right amount of flow. The spreader is well built.",
      "rating": 4.0,
      "verified": true,
      "author": "Chuck M.",
      "helpful_votes": 3,
      "publication_date": 20160514
    },
    {
      "title": "Nice broadcast spreader!",
      "text": "I received my spreader and it went together without any problems. The instructions were easy to follow and the parts blister-pac were a great help. I intend to use it for spreading a dust control material and hope it works as stated. There is a spring tension piece inside the hopper at the bottom to constantly stir to help avoid clogs. If I can, I will add to this review after I put it into use spreading snow melt magnesium chloride product. It is a well constructed product.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Wilwerding",
      "helpful_votes": 2,
      "publication_date": 20150301
    },
    {
      "title": "Don't waste your money!",
      "text": "The lever to adjust the seed flow doesn't stay in place or work properly. You are either dumping way too much seed or almost nothing at all. The in-between options don't work. If you tighten the know in the middle for medium flow, it will move up or down as you pull it. I even tried to use a piece of twine to tie it in place and it still didn't work. Absolutely terrible piece of equipment.",
      "rating": 1.0,
      "verified": true,
      "author": "Dana Barger",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Material of parts not all good for long wear.",
      "text": "My lawn maintenance.Excellent design and works great. Directions for assembling need correcting. Otherwise was easy to install after uninstalling twice in order to add more parts. Fair price for this machine. Don",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Not spreading evenly",
      "text": "I had problems with the way it was spreading the seeds. It was not evenly on both sides (left and right). I am buying a second unit to give it a try.",
      "rating": 1.0,
      "verified": true,
      "author": "Walter Gandra",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Dispenses fertilizer and pelatized lime in a very even Manner",
      "text": "The Spreader was easy to assemble and works as advertised. It arrived in a timely manner and was used immediately after assembly.",
      "rating": 5.0,
      "verified": true,
      "author": "Official",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Works great",
      "text": "if you follow the instructions it's easy to assemble & operate; just don't try to drive too fast and it will do a great job!",
      "rating": 5.0,
      "verified": true,
      "author": "Greg K.",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Makes life much easier",
      "text": "Easy to put together. Comforting to have holes that aligned. Pleased with operation and capacity of spreader. With a lawn with both slightly sloping and moderately sloping hills had no problem with tipping. I did however only have hopper half full or less when I did hills. Most difficult task was determining application rate as Brinly was not listed. With 4 1/2 acres of lawn, life is much easier with the tow behind spreader.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Worked Great for Me",
      "text": "I used the Brinly BS36BH tow behind broadcast spreader to put weed and feed on my 2 acre property. It worked great! The spread pattern was flawless, and I can honestly say, I have the best looking lawn in the neighborhood.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Jenkins",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Plastic Wheel rims don’t last",
      "text": "Wheel rims are cheap plastic went to use spreader for second time found rim had come out of round tire off don’t know if it melted from sun exposure or not very unhappy with purchase",
      "rating": 1.0,
      "verified": true,
      "author": "gadgit man",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Great seller",
      "text": "The spreader was new and as described. Shipment was started the next day and all arrived undamaged. I got to use it twice on a 2 acre yard and I love it. My only concern is that the wheels have no bearings, but again, there is not much friction generated at the axel. Assembly took about 1:30 hours but was very enjoyable, as the directions are clear and the small hardware is packed in plastic \"blisters\" on a cardboard in the exact sequence as required for assembly.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerry",
      "helpful_votes": 0,
      "publication_date": 20140611
    },
    {
      "title": "Great spreader",
      "text": "Great capacity for large yards and works well in fertilizer application.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Sedlacek",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Value! Great product",
      "text": "Definitely not a 30 min assembly process, but end result is worth the money! Works as described,no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "J Gibson",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Works great! Well built!",
      "text": "This is the best one on the market that I can find. Easy to assemble, tough, works great. So far I am very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Overkill",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Easy to assemble",
      "text": "Easy to assemble. Stable with a heavy load. Carry 4 bags of fertilizer (160 pounds) with ease over irregular hill side lawn. Built with superior design, and well thought out. Beats the big box hand spreaders you buy every few years.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Great product",
      "text": "We have 6 acres to fertilize and plant grass seeds annually. Great product",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Quality spreader",
      "text": "I replaced a 10 year old Sears spreader with this. I am impressed with the ease of assembly and quality of the product. It works great!!",
      "rating": 5.0,
      "verified": true,
      "author": "gary owen",
      "helpful_votes": 2,
      "publication_date": 20170327
    },
    {
      "title": "Made in America Quality Product.",
      "text": "It takes about 4-5 hours to put it together but I enjoyed doing it because it is very well made and parts are blister packed. I have not used it but will in a couple more weeks. I needed this one because the spread is directional, full, right or left.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard V. Tieken",
      "helpful_votes": 0,
      "publication_date": 20160918
    },
    {
      "title": "Great product but takes way longer to assemble than stated.",
      "text": "My husband loves this but it took forever to assemble. Now that he has it assembled & attached to his mower, he loves it & it is so much easier than the cone he had to put on his tractor every time he wanted to spread corn for the deer.",
      "rating": 5.0,
      "verified": true,
      "author": "LB",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Very hard to assemble",
      "text": "Probably one of the better ones, but these all are junky and hard to put together.",
      "rating": 3.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Gearbox Failed After 3 Uses",
      "text": "After using the spreader three times on my 1 acre yard, the gearbox has failed and spreader disc won't spin. Bought the unit in June 2019 so warranty is up. Will never buy from this company again.",
      "rating": 1.0,
      "verified": true,
      "author": "Dale Goynes and Laura Goynes",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Great spreader",
      "text": "This spreaders was great. I fertilize and put new grass seed on the high school baseball field. I bought a spreader about two years ago for $750 this Brinly spreader was much better and I mean a lot cheaper in price.",
      "rating": 4.0,
      "verified": true,
      "author": "david gallegos",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Handles drifts shut but still OK",
      "text": "Easy assembly. Bumps cause it to close so need to hold handle...",
      "rating": 5.0,
      "verified": true,
      "author": "T. Pugh",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Did the job",
      "text": "Took a little fidgeting to get it to deliver properly, but did well once I brought it to that point.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven J. McFarland",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Nice.",
      "text": "If you're tired of walking, and those cable controls that never work, and always break spend a little more. Made in the U.S.A. Sturdy, well bilt, solid parts simple to assemble. I have not had any of the problems stated in other reviews. I will review at the end of the summer.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Perfect size.  Works well for my 1 acre.",
      "text": "Works. Very well. Took an hour to put together. I used it with my riding mower.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey B. Howlett",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Plastic gears wore out in two years",
      "text": "Gears wore out by year three. Handle never stays at proper setting. Never worked well from day one.",
      "rating": 2.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Great Spreader",
      "text": "I thought this spreader was well built. It did have a number of parts, but well organized for your assembly. I like that I can adjust the drop to throw left or right or evenly. I had to rig up a way to pull the handle from my zero turn since it is not reachable from the normal seated position. Probably works well from a tractor. Used it a couple times now on two acres. Made the spreading job go lickety split.",
      "rating": 5.0,
      "verified": true,
      "author": "JRX",
      "helpful_votes": 0,
      "publication_date": 20131013
    },
    {
      "title": "You load in 4 bags in and 4 on ATV a you are good to go.",
      "text": "Well built . I was able to spread lime on 3 areas with no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert j Keith",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "recommended Spreader",
      "text": "Highly recommended. Packaging was well done to protect the contents. The nuts, bolts, washers, and clips were shrink-wrapped to a cardboard panel, grouped in the order needed, and each piece labeled. The assembly instructions were excellent, with both text and detailed illustrations. I have used the spreader twice. The shape of the bin and its agitator allowed good flow and emptying. The only problem was that the rod controlling the bottom opening tended to close during use. As other reviewers suggested, I tightened the bolt holding it and used an elastic band to hold it in position. This was my only issue with this high-quality spreader.",
      "rating": 5.0,
      "verified": true,
      "author": "Wade Douglas Carden",
      "helpful_votes": 2,
      "publication_date": 20131013
    },
    {
      "title": "Well made spreader with good assembly instructions",
      "text": "Really well-made large capacity spreader. The assembly instructions and kit were well-documented which is rare these days. It took about 45 minutes to assemble. I have 5 acres to seed and fertilize....this seems to be a good spreader at a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Satisfied with product",
      "text": "This appears to be a very solid and long-lasting product.",
      "rating": 5.0,
      "verified": true,
      "author": "DEO",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Easy use, good size.",
      "text": "Couldn't find what I was really looking for. Found this on Amazon and got it. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry ",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Not worth time or money",
      "text": "It doesn’t spread very well compared to other pull behind spreaders. Even with chart settings, doesn’t do what it should. Also tips over very easy on small hills. It bounces around like a rubber ball on the cheap tires and plastic wheels. Really just want to return it and purchase something else. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard Hudson",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Easy to assemble and use",
      "text": "Easy to assemble. Simple to operate Holds at least 4 bags of granular fertilizer. Easy to tow behind ride on mower with pin attachment only downside it doesn't have a hitch connection to tow behind other machinery",
      "rating": 4.0,
      "verified": true,
      "author": "Malimom",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Not cool at this price",
      "text": "The handle to set the spread doesn't stay in position. I have to use duck tape to keep it there. Not cool at this price.",
      "rating": 2.0,
      "verified": true,
      "author": "gmt7k",
      "helpful_votes": 4,
      "publication_date": 20150710
    },
    {
      "title": "You need to find a better way to empty the hopper.",
      "text": "The rotating spring inside the hopper is not big enough. The material doesn't fully empty.",
      "rating": 3.0,
      "verified": true,
      "author": "Ed Gaudet",
      "helpful_votes": 2,
      "publication_date": 20190913
    },
    {
      "title": "Great spreader for the money.",
      "text": "Good. Parts were all there and in an orderly fashion. Easy to put together. Great spreader. Around $100 less than a John Deere spreader. Very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Great spreader!",
      "text": "Great spreader. I might need to adjust the lever for seed control because it tends to work it's way closed while you are driving. But otherwise works great. Easy to assemble with the video on Amazon. Instructions kind of sucked.",
      "rating": 4.0,
      "verified": true,
      "author": "Tony Harden",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Works very well.",
      "text": "Well made, not hard to put together. Instructions are very clear.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Minier",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "... brace that holds the feed lever in place is poor quality and makes even application very difficult or impossible",
      "text": "The brace that holds the feed lever in place is poor quality and makes even application very difficult or impossible. I lost a lot of product due to spillage when I had to adjust this every five minutes. My brace failed after about 5 minutes of use. I will make a new heavy duty brace the next time I have to use it and see how it performs them.",
      "rating": 2.0,
      "verified": true,
      "author": "Tom Tambe",
      "helpful_votes": 5,
      "publication_date": 20150301
    },
    {
      "title": "Four Stars",
      "text": "Agree with the previous reviewer that the welded frame is solid.",
      "rating": 4.0,
      "verified": true,
      "author": "mike v",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "very good product",
      "text": "although i could not assemble it in the time printed on the box (30 min? or 40 min) more like 90, it worked great. i was able to spread over 600 lbs of fertilizer and lime in a day with no effort. i have about an acre of lawn and had previously used a small broadcast spreader. although i have not owned it long, it was just the right tool for the job.",
      "rating": 5.0,
      "verified": true,
      "author": "alphonse",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "Good but Hard to spread last bit of material.",
      "text": "Easy assembly, well made. Spreads most of the hopper load well but the last inch or so is hard to get out. The bottom of the hopper is too flat. This may not be an issue if you’re spreading several loads of the same material.",
      "rating": 4.0,
      "verified": true,
      "author": "LawOfEdge",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "5 stars",
      "text": "About 90 min to assemble. Parts layout is real easy to use. I've used this 3 times and it works great. Easy to adjust the broadcast.",
      "rating": 5.0,
      "verified": true,
      "author": "Louis Iadone",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "WEAK LEVER STOP.....RUST AFTER ONE USE",
      "text": "Lever stop bent during first use causing to much product to be spread. Also rusted tow bracket after one use.",
      "rating": 1.0,
      "verified": true,
      "author": "RayMan",
      "helpful_votes": 3,
      "publication_date": 20150629
    },
    {
      "title": "I  like it",
      "text": "worked great they just need to figure out how to keep flow handle from closing on rough terrain.",
      "rating": 4.0,
      "verified": true,
      "author": "Tim F.",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "Great Spreader",
      "text": "This was the first time I saw the way Brinly was packaging the hardware in the blister pack...EXCELLENT! It too about 45 minutes to install. Used it right away to put down some pelleted lime. It worked great, cant wait to use it for fertilizer too! I have two Brinly lawn sweepers that have served me well, equally happy with the spreader.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20140428
    },
    {
      "title": "Three Stars",
      "text": "Pretty tough to assemble. Wish there was more local assistance to assure that this was done correctly.",
      "rating": 3.0,
      "verified": true,
      "author": "carmen fiorentino",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "Innovative blister pack for fasteners makes assembly a breeze",
      "text": "Two other Brinly lawn attachments I ordered arrived with missing parts and the paint was scratched up from parts bouncing around loosely inside the box. The packaging for this large spreader is different. They came up with an innovative blister pack for the fasteners, insuring all screws are included. Each step in the assembly instructions coincides with a section of the blister pack. Great idea! The Poly hopper still arrived scratched up inside from the frame, but the other metal parts were packaged well with paint still intact.",
      "rating": 4.0,
      "verified": true,
      "author": "Jo Chen",
      "helpful_votes": 0,
      "publication_date": 20140502
    },
    {
      "title": "Great Product !",
      "text": "This is an excellent product. Tightened opening control spring by adding 2 additional washers. Works very well. Well made and well designed. . Easily assembled. Good assembly directions.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred",
      "helpful_votes": 2,
      "publication_date": 20141221
    },
    {
      "title": "May not be suitable for heavy use of rock salt.",
      "text": "Should have purchased years ago. Good quality and functions perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Alcar",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Sturdy construction with relatively low center of gravity to reduce ...",
      "text": "Sturdy construction with relatively low center of gravity to reduce tipping. Only cons: Stem for attaching to tow vehicle should be height adjustable to account for varying heights of receivers; adjustment for quantity of material to be dropped is too weak and easily knocked out of setting when closing/opening with the handle.",
      "rating": 4.0,
      "verified": true,
      "author": "SML Striper.",
      "helpful_votes": 0,
      "publication_date": 20160502
    },
    {
      "title": "Good but...",
      "text": "The handle keeps closing and I’ve had to pull this with one hand holding the lever. Too tight and you can’t adjust it, too loose and my issue. Trying to get that just right spot is not easy.",
      "rating": 4.0,
      "verified": true,
      "author": "CRM",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Works as it should- Good buy",
      "text": "I am a particular yard nut and this spreader is well built and works as it should. Would like to see spinner a little lower and aluminum gage mark a little heavier but very good spreader.",
      "rating": 5.0,
      "verified": true,
      "author": "sessi",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "This is a great spreader!",
      "text": "I don't write many reviews but I just had to with this item. Item took a little bit to put together and perhaps the directions could use some clarification but the item was well packed, all the hardware well marked and this piece is well made. The 175# hopper is huge and you need to refill very little with this spreader. It is overall well constructed and is made more heavy duty than others I have seen. I used it only once but was well impressed. It sure beat pushing a Scot's spreader by hand over 2 acres!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Calhoun",
      "helpful_votes": 31,
      "publication_date": 20100427
    },
    {
      "title": "Don't purchase to spread ag lime.",
      "text": "Sorry to report that this spreader will not spread ag lime and it should be noted in the description. I first tried the lime (very dry lime) without the agitator. This did not work. Then I added the agitator. Same result. I called Brinly for help and the tech suggested using some weed trimmer string in place of the agitator. This didn't work and in fact caused the spinner to lock and the little plastic gears in the transmission failed. I'm sure the product will work nicely with granular products. The unit seems pretty sturdy and held up just fine with the full 175 lbs. in the hopper. Unfortunately, I couldn't recommend this unit to spread any fine grained product.",
      "rating": 3.0,
      "verified": true,
      "author": "ChrisO",
      "helpful_votes": 6,
      "publication_date": 20150515
    },
    {
      "title": "Cheap plastic wheels",
      "text": "Apparently this item is sold with either plastic or metal wheels. This is the cheaper version with plastic wheels. I had to call Brinley for a replacement wheel since mine was broken right out of the box.",
      "rating": 2.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20150611
    },
    {
      "title": "problem with tow tube",
      "text": "Good quality parts - easy to assemble. I had a problem with the tow tube. The holes are not drilled at 90 degrees. It causes the hitch to be very difficult to connect and the flow control handle to be off vertical about 15 degrees. I've submitted a warranty claim. Will update with results.",
      "rating": 3.0,
      "verified": true,
      "author": "ToddG",
      "helpful_votes": 0,
      "publication_date": 20160607
    },
    {
      "title": "Works Great. Taped a piece of PVC pipe to the ...",
      "text": "Works Great. Taped a piece of PVC pipe to the flow lever so that I could pull behind my golf cart and operate it from the seat. Really nice for a large yard.",
      "rating": 5.0,
      "verified": true,
      "author": "John Umphlett",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "works great except for the fact that the lever that controls ...",
      "text": "works great except for the fact that the lever that controls the opening of the hopper does not stay where set. I added a spring to the handle and it worked great.",
      "rating": 4.0,
      "verified": true,
      "author": "Rwd2003",
      "helpful_votes": 3,
      "publication_date": 20141110
    },
    {
      "title": "it went together fairly easily. I started it",
      "text": "Although I haven't used it as yet, it is the wrong time of the year, it went together fairly easily. I started it, and then let my son take over. Between us, and with the help of my two grandchildren, we were done in about an hour. The best part of assembly was that the instructions would call for a part, and it was right there in the blister pack. Research indicates that the only anticipated problem is with the settings vibrating closed during use, but two home remedies have been suggested, as well. At this point it seems like a good investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond Harris",
      "helpful_votes": 0,
      "publication_date": 20140704
    },
    {
      "title": "works great just have to figure out how to put extension ...",
      "text": "works great just have to figure out how to put extension handle on it to shut it off and on",
      "rating": 4.0,
      "verified": true,
      "author": "rick ",
      "helpful_votes": 0,
      "publication_date": 20170525
    },
    {
      "title": "Very sturdy and a better product than any department store can ...",
      "text": "Arrived on time. Very sturdy and a better product than any department store can offer. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Iles",
      "helpful_votes": 0,
      "publication_date": 20170913
    }
  ],
  "product_meta": {
    "title": "Brinly BS36BH, Black, 175 lbs Tow-Behind Broadcast Spreader",
    "description": "Regular lawn feeding, weeding, & pest control helps keep a yd growing strong. A lawn & garden spreader is the ideal tool for the job, Designed to evenly spread materials & nutrients to ensure your grass has what it needs for fresh growth, vibrant color, & lasting health. If you're looking for a tough yd spreader that has the capacity & durability to take on bigger jobs, look no further. Brinly’s bs-36bh tow-behind broadcast spreader features a high capacity 3 5 cu. '. Hopper, ideal for large residential green spaces & light Commercial applications of 1 acre or more. Investing in a pull-behind spreader is the most efficient way to cover a large yd; use the Universal Hitch to attach the bs-36bh to your mower, ATV, or UTV - then you're ready to go. You'll easily haul up to 175 lb of granular materials, meaning you'll spend more time spreading & getting the job done & less time going back for refills. Not just a fertilizer spreader, you can use the bs-36bh towable spreader year-round to spread all types of materials: seed, rock salt, sand, & more. Spread your seed & fertilizer in the spring & fall, Lime in the summer, & ice melt agents in the winter. Built to last season after season, The enclosed gearbox & steel hardware prevent corrosion, while thick pneumatic tires easily cross bumpy terrain. The glass-filled nylon gears feature a high-speed 6: 1 ratio, providing one of the widest spread patterns available with up to 12' Of spread width. Indiana-based brinly-hardy company has been manufacturing quality lawn & garden attachments since 1839 taking the work out of DIY yd maintenance only gets more effortless with each Brinly product in our broad line of durable attachments. The best yd require the best tools - get a yd like the pros with Brinly!",
    "rating": 4,
    "feature_bullets": [
      "High-capacity hopper: extra large, rust- and dent-proof poly hopper holds 175 lb and 3. 5 cu. Ft. (6, 048 cu. In. ) of seed, fertilizer, Ice melt and more to maximize the time spent spreading vs. Refilling the hopper. Ideal size for yards 1 Acre or larger",
      "Lasting durability: All parts that come in contact with corrosive fertilizers are designed to last: heavy polyethylene hopper with stainless Steel hardware, spinner shaft, and agitator. Glass-filled nylon gears are fully enclosed with nylon gearbox for additional protection",
      "Patented auto flow with spread pattern control: Brinly spreaders are designed for professional-level results. Different materials spread very differently; directional spread pattern control allows you to center and even-out the distribution pattern for a balanced application of any material. The patented auto flow technology stops material from spreading when the tractor stops - eliminating waste and burns that commonly occur with other tow-behind spreaders",
      "Easy calibration: calibration controls feature a locking dial for secure rate-gate settings. Brinly provides hundreds of pre-calibrated settings to help you get to work and get the job done more accurately and efficiently",
      "Includes hopper cover: included clear-top hopper cover with easy elastic on/off keeps moisture out and materials and Dust in - away from the driver and others"
    ],
    "specifications": {
      "Product Dimensions": "43 x 29 x 34.25 inches",
      "Item Weight": "47 pounds",
      "Manufacturer": "Brinly Hardy",
      "ASIN": "B001U40NFC",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "BS36BH",
      "National Stock Number": "3750-01-629-1744",
      "Customer Reviews": "4.0 out of 5 stars284 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#27,796 in Patio, Lawn & Garden"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Spreaders",
      "Gardening & Lawn Care",
      "Garden & Outdoor"
    ],
    "price": 219.0
  }
}