{
  "website_summaries": [
    {
      "verdict": "The floorstanding speaker to choose when you want a heavy-duty option that will deliver better dynamics than most.",
      "pros": [
        "Super Horn mid-range tweeter",
        "Cabinet holds a combination of subwoofer, mid-range speakers, and tweeters for a comprehensive sound spectrum delivery",
        "MDF material offers more protection against typical use and abuse than wooden cabinets"
      ],
      "cons": [
        "Speakers drive a lot of output, potentially creating a more distorted sound"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "More than what you expect",
      "text": "Guess I didn’t read the description well enough but I was pleasantly surprised that they came with wheels. Huge hit at my parties and I love the sound quality could stand to have a bit more punch but over all I would definitely buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "V-Rex",
      "helpful_votes": 7,
      "publication_date": 20181211
    },
    {
      "title": "PYLE THANKS THESE ARE ROCKING !!!",
      "text": "AMAZON you've done it AGINE! WOW! One day early & THESES SPEAKERS ROCK & I'M USEING THE PYLE PT1100 AMP AND THE PADH1079'S WITH THESE AND THE SOUND IS TO SAY THE LEAST, UNIMPRESSIVE WOW CANT WAITE TO HEAR WHAT THESE SOUND LIKE WHEN I BUY THE 3000 WATT PYLE AMP & INCLUDE A 15 OR 18IN PYLE SUBWOOFER JUST TO TOP IT ALL OFF! PYLE YOU REALLY ROCK !!!",
      "rating": 5.0,
      "verified": true,
      "author": "James S.",
      "helpful_votes": 7,
      "publication_date": 20180504
    },
    {
      "title": "Very nice, Big",
      "text": "Very nice, Big, and loud. a lot of bang for your buck. WOW was i blown away literally. with the 3000w amp from pyle it works really good and highly recommend it to anyone. i bet this will work really good in my van with my 2000 w amp as a sub.",
      "rating": 5.0,
      "verified": true,
      "author": "brian",
      "helpful_votes": 5,
      "publication_date": 20180307
    },
    {
      "title": "Beautiful speakers",
      "text": "I haven't used them yet but very beautiful speakers and they have three different ways that you can hook up cables to them: Quarter-inch Jack Twist lock Bare wire And one cool thing about them is that each speaker comes with four wheels you have to attach them of course but very nice addition. I read the reviews before I bought mine and like I said I haven't listened to them yet but Pyle has a good reputation that's why I bought them",
      "rating": 5.0,
      "verified": true,
      "author": "Mark  A  Jones",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "BOOM BOOM BAM!!!!",
      "text": "Ok so I was a bit shaky after reading a few comments on how others PYLE speakers arrived damaged, but I guess UPS likes me because mine was delivered w/o a scratch. Excellent sound, of course you can adjust your eQ to whatever setting. If you are old school like me and still have speakers that fit 12Gauge wires PYLE has connectors that fit the old style as well as the new. Best buy yet on Amazon!! Will consider buying another one when my piggy bank says it's ok.",
      "rating": 5.0,
      "verified": true,
      "author": "rammer",
      "helpful_votes": 9,
      "publication_date": 20150110
    },
    {
      "title": "BOSE ARE BETTER MACKIES TOO",
      "text": "Again you get what you pay for. Save up and get what you really want. These are nice for starter set, but not for doing music for room of much size. Even the small cab Mackie’s I have are much better than these.",
      "rating": 2.0,
      "verified": true,
      "author": "EXCLUSIVE SHOPPER",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Great sound for the price",
      "text": "For the price this speaker provides great sound, I purchased 2 of these speakers for our school functions, one had issues on delivery, luckily Amazon took care of it. In any case I would recommend it for anyone one a budget.",
      "rating": 4.0,
      "verified": true,
      "author": "Victor",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "wow",
      "text": "I've DJed with a pair of these speakers for a year now. They sound great for the money they take what my Nady600 powered mixer pushes at them. They project high an low pitch veryy well. They are kind of big on size (for me anyways) I can fit them in a trunk of a Chevy Impala 2011 LTZ .the only thing I would ask the manufacturer is please use a different glue or something different for the speaker boxes they are weak. but all in all I've treated them with tender loving care an they sound great still after a year. i would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Steven toops",
      "helpful_votes": 3,
      "publication_date": 20140725
    },
    {
      "title": "Great for DJ",
      "text": "Although leaving off he name would be nicer, These sound great and look great too. Also in todays take a photo lifestyle, they should consider some lighting in them to0o by now. But you cant go wrong with these",
      "rating": 5.0,
      "verified": true,
      "author": "Argo750",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "... these speakers about two years ago still going strong like to get more speakers to add to my sound ...",
      "text": "I purchased these speakers about two years ago still going strong like to get more speakers to add to my sound for my man cave Thisw is an add on from previous review I sent> I finally started to use more volume and one of the speakers started poping and cracking I sure wish I tested them sooner For about almost two years i never used them now that I have some powerful amps I cannot push up the volume this bites!!!!!!!!!!!!!!!! I want a replacement I did not pop them they been in storage for a long time To all those who buys please test your product",
      "rating": 4.0,
      "verified": true,
      "author": "George S.",
      "helpful_votes": 3,
      "publication_date": 20160312
    },
    {
      "title": "Home Theater usage",
      "text": "Bought a pair for home theater, sound is excellent for both watching shows/movies and listening to music. Arrived undamaged, packaging was double carton for both speakers.. Cannot beat the price! I buy many different speakers for all kinds of usage. I have owned Pyle Speakers in the past for vehicles..... Like everything you buy, you can always get lemons with any brand. I am very satisfied with this purchase thus far!",
      "rating": 5.0,
      "verified": true,
      "author": "Americanscuba",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Happy with Purchase",
      "text": "Just bought these, and they arrived in great condition. Sound quality is awesome for my man cave. Paired this with Sounds Awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Berie",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Nice speaker for a home setup.",
      "text": "A very nice speaker! I only bought one but after listening to this one for a few days, I bought ANOTHER! It sounds great the bass is more than acceptable. The high and kids sound GREAT!! Make sure you check the shipping upon arrival because my first one arrived with a dent in the top edge of the speaker. I inspected the rest of the speaker and all was ok. (So far). Other than that, this is a solid and well put together speaker setup.",
      "rating": 4.0,
      "verified": true,
      "author": "Patrick L Gray",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "I'm a new fan.",
      "text": "I am a new fan of Pyle Pro. They did a good job with these at a great price. I have had them for a bout 6 months and they are working out well. The audio is not the best, and if you are looking for top clarity, then you probably need to spend top dollar, but these are good. The average listener won't notice the difference and the experienced listener will be surprised to hear how much you spent on these. They come with wheels that you can install yourself, but they seemed flimsy so I didn't bother. But otherwise, they are well put together and sound very very good and can crank out the volume.",
      "rating": 4.0,
      "verified": true,
      "author": "KarlitosWay",
      "helpful_votes": 2,
      "publication_date": 20120827
    },
    {
      "title": "Great Value",
      "text": "This speakers work like a charm - They are a bit lighter weight than I would have expected but they still seem solid... so its kind of a bonus (easier to move them). I don't think it gets better than this for PA speakers anywhere near this price. The only thing that almost got me in trouble is that the speakon connectors on the unit are kind of upside down from what I am normally used to. The cut grooves (one small and one large) are arranged in a way that when you properly insert the speakon cable, it is turned so the metal release tab is underneath, instead of on top.",
      "rating": 5.0,
      "verified": true,
      "author": "BuBoNiC NATE",
      "helpful_votes": 0,
      "publication_date": 20120321
    },
    {
      "title": "As usual - Pyle great value for the price -- but light on bass",
      "text": "I have had tremendous luck with Pyle products. This is no different... For the price, it is truly a great deal. The only reason I am writing this review is as a mild warning -- the bass response on this unit is a little light. You should expect to have to either EQ the signal to the speaker to boost the bass and/or considering adding a dedicated speaker to act as a subwoofer. the sound on this guy is really bright. p.s. extra perk -- it came with nice rubber ball casters. Since I have to repurpose its initial intended use, these casters will come in handy.",
      "rating": 4.0,
      "verified": true,
      "author": "drj",
      "helpful_votes": 0,
      "publication_date": 20130329
    },
    {
      "title": "But all in all I love the sound quality",
      "text": "First of all my speaker arrived damage. The woofers was out their sockets.. The grate was bent. I had to reassrmble everything. But all in all I love the sound quality....must oder another one soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda W.",
      "helpful_votes": 18,
      "publication_date": 20150209
    },
    {
      "title": "Love it!",
      "text": "I bought two of these. The other reviews are correct that there was a strong glue smell coming from them, but I've had them for two weeks now and it's starting to fade. I used just one of these for a part and powered it with the Pyle 5100 watt amp, and it runs like a champ. Just one was super loud and I only had the amp turned up to about a third of it's max. The bass on it was more than I had expected after reading the other reviews. I guess if I was to DJ at a club I may want a solo bass speaker, but for house parties these are more than enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Sweets",
      "helpful_votes": 3,
      "publication_date": 20130124
    },
    {
      "title": "Apparence and sound.",
      "text": "Front grill was damaged on one speaker. Speakers were routed in correctly by ups. They arrived 2 or 3 days late because of this.almost",
      "rating": 4.0,
      "verified": true,
      "author": "kay boughner",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Great Speakers for my Man Cave.",
      "text": "These things sound Awesome for the price you cant beat it. I would not use them as gig speakers cause the construction is kinda thin but i don't plan on moving them. i have 2 of these hooked to my PYLE P3001AT Amplifier along with two 3 way 15's rated at 1600 watts and it will Blow your ears out. i am happy with this purchase :)",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Tinsley",
      "helpful_votes": 0,
      "publication_date": 20170714
    },
    {
      "title": "Extremely horrible manufacturing. DO NOT BUY THIS ITEM!",
      "text": "Home studio usage. Very particular about the equipment I use. I paid $24 more for this speaker the the first speaker I purchased. This one is damaged. No xlr in nut. Just horrible. I'll never buy from them again.",
      "rating": 1.0,
      "verified": true,
      "author": "James Washington",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Happy at first, then NOT",
      "text": "I bought 2 of these speakers. At first I thought they were great speakers for the price. After about a month one of them started to develop static, and I'm only pushing 200w. It was beyond the return window, but I could still solicit support. NO RESPONSE. I guess the old saying applies... you get what you pay for. Ultimately these speakers appear to be unsupported junk.",
      "rating": 1.0,
      "verified": true,
      "author": "mike kiekover",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Good valued loud speakers",
      "text": "If you are looking for LOUD, these are a great buy, I doubt that they can get up to the wattage advertised but nun-the-less, still a good range and sound quality. However, there are two things that I was a little disappointed about: one, the glue they use is probably the smelliest thing I've ever had to deal with. Make sure you buy some febreeze or baking soda at the time or purchase. The second thing is that the wheels that the come with do not screw into the bottom. The screws do not grip at all. Both of these are probably due to the cheap Chinese manufacturing.",
      "rating": 4.0,
      "verified": true,
      "author": "Mhl",
      "helpful_votes": 0,
      "publication_date": 20140817
    },
    {
      "title": "It’s really good item and I have it running with a 3000 watt amp.",
      "text": "The sound quality is very good and for the price you can’t ask for more , that’s what I like.. Now the wood panels one of the speakers was not glued properly but they replaced the whole speaker box quickly..",
      "rating": 4.0,
      "verified": true,
      "author": "Carre lespier",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "These are my first DJ speakers and I must say ...",
      "text": "These are my first DJ speakers and I must say, paired with a 1600 watt amp it works very well! I had no problems with broken or busted speakers upon arrival let many reviews stated. The speakers put out a clean sound at this price range. The low end suited what u needed for a wedding but if you want more thump, pair with a subwoofer. Give it a try!",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin David Wyatt",
      "helpful_votes": 0,
      "publication_date": 20141223
    },
    {
      "title": "Loud!",
      "text": "I ordered a pair of these speakers along with the Pyle Pro 3100 watt amplifier. I DJ mostly small to medium sized venues all kinds of music and have had them running for about 3 weeks. Honestly the only downside is that I was expecting more bass coming from the dual 12s. Other than that these bad boys are LOUD LOUD LOUD and which is good and are really clear from low to max. I plan to get another pair along with some subwoofers. I really don't have anything as far as other brands to compare to but I am very pleased with my purchase and have had steady business with parties since.",
      "rating": 4.0,
      "verified": true,
      "author": "Crystal M. Merritt",
      "helpful_votes": 3,
      "publication_date": 20130609
    },
    {
      "title": "Speaker sounds good and us loud",
      "text": "Got it undamaged, witch I was little worried bout after reading the reviews. Speaker sounds good and us loud. Bass is pretty good. Speaker looks good. But the smell of the glue is a bit over whelming . It's slowly Goin away but still can smell it when I walk into the room and it's been almost 2 weeks.over all good speaker and at at good price. Would give it 4 starts if the smell wasn't so bad.",
      "rating": 3.0,
      "verified": true,
      "author": "josh",
      "helpful_votes": 0,
      "publication_date": 20141016
    },
    {
      "title": "No trturn policy - bad.",
      "text": "would not work with my amplifier. Seller should provide more information in the ad concerning the power requirements for the speakers. No trturn policy - bad.",
      "rating": 2.0,
      "verified": true,
      "author": "The DuckMan",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "Way loud enough for indoor use and no more than 100 equalized watts is needed to make them work well.",
      "text": "For the price, they are great! There are a few structural points inside the enclosures that need beefing up. The crossover seems to do well for being only two components. They'll plug into almost anything. They've taken a beating from my Kenwood receiver for weeks now and still sound good!",
      "rating": 4.0,
      "verified": true,
      "author": "Matt Yourkawitch",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "Awesome speakers for an awesome price",
      "text": "Awesome speakers for an awesome price.. You can't beat the price.. I bought a pair of them and spend only $300 all together. I don't think you can get a better deal than this.. $300 for a pair of 1400 watt speakers is amazing.. The sound is crisp, and the high's, mid's, and lows are equally balanced.. I'm very happy I got these speakers!",
      "rating": 5.0,
      "verified": true,
      "author": "The Associates",
      "helpful_votes": 0,
      "publication_date": 20141003
    },
    {
      "title": "Great speaker for the price you pay.",
      "text": "Great speaker for the price that you pay. I purchase one which I am using it at a my bar. I bought this speaker to replace a speaker that when out. I am connecting this speaker to a Gemini Amp and to a Behimer equileser and sounds great.. Great power and great sound output only if connected to equilizer if connected with out it does not sound to great. I am purchasing 2 more right now to have then as back ups in my bar.",
      "rating": 4.0,
      "verified": true,
      "author": "Junior",
      "helpful_votes": 2,
      "publication_date": 20140710
    },
    {
      "title": "Wow is what I think of this speaker",
      "text": "I ordered two of theese based on the reviews and price. And I am so glad I did they sound great and have a long throw of sound . If you r considering theese or have been looking for some speakers like theese. Don't put it off buy them. I got two but I'm going to buy another two. They have hi mid and punchy bass you will need a dedicated subwoofer for hitting low end, but that is the same for any full range speaker.",
      "rating": 5.0,
      "verified": true,
      "author": "drupylv",
      "helpful_votes": 0,
      "publication_date": 20120709
    },
    {
      "title": "Nice for the price",
      "text": "Nice for the price,good sound quality,not as described on the advertise,but still do the job,nice and strong assembled,but they have a not good smell,so you have to kept them out of your house,it will go better with the time,i think its the glue they use on it,very nice speakers.",
      "rating": 4.0,
      "verified": true,
      "author": "Juan M.",
      "helpful_votes": 0,
      "publication_date": 20140702
    },
    {
      "title": "I very happy about the sound",
      "text": "I received 2 speaker but one of them have a little dented at the left side ( I think from the shipping event the packet box very good) but it not affect to the speaker. I very happy about the sound, it perfect for my living room when I using for karaoke. I give it 5 star for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve  Bui",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "I was very disappointed in the Condition of one of the speakers",
      "text": "I was very disappointed in the Condition of one of the speakers. It had damage on the LEFT FRONT, like it was crushed during shipping. When I connected the speaker wire on the same speaker, there where missing screws on the panel where you hookup the wires. Other than that, they sound OK.",
      "rating": 2.0,
      "verified": true,
      "author": "DRompon",
      "helpful_votes": 0,
      "publication_date": 20140914
    },
    {
      "title": "Internal Damage, loose and broken parts, replaced and still the same!",
      "text": "I got a piece of junk speaker for the replacement, it was worse than the speaker it was replacing. Amazon would not help me on a refund!",
      "rating": 1.0,
      "verified": true,
      "author": "biggielsc",
      "helpful_votes": 2,
      "publication_date": 20190129
    },
    {
      "title": "Great except for case",
      "text": "These speakers pack a powerful punch. When first receiving the product, I tested them at high stress lvls and the speaker case began to rattle. The case is glued together so if you plan on doing large events, be prepared for rattling. I ended up putting a few screws into the case to fix it and it solved the problem. Other then that, these speakers rock! Very loud clear highs and mids. The Bass is very punchy due to the amount of portage. I recommend getting a sub woofer with these to help in crease the bass resonance.",
      "rating": 4.0,
      "verified": true,
      "author": "Lydia Wickham",
      "helpful_votes": 0,
      "publication_date": 20161130
    },
    {
      "title": "Value",
      "text": "A lot of bang for your buck. Near live sound quality. However the input terminals/bindings are plastic and a little on the cheap side. Overall the speakers are well worth the money and seem to perform excellent.",
      "rating": 4.0,
      "verified": true,
      "author": "Don Taylor",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "... one at a time & the first one was good with no complaints",
      "text": "This is my boyfriends second speaker He bought since He bought them one at a time & the first one was good with no complaints.... The second one came in earlier than I expected than the first but had a dent on the speaker screen? or outside of it (I don't know how to call it)? But I guess he can fix it by popping it back out?",
      "rating": 4.0,
      "verified": true,
      "author": "Edith Nevarez",
      "helpful_votes": 0,
      "publication_date": 20170128
    },
    {
      "title": "These speakers are the best I’ve ever heard !",
      "text": "These speakers are the bomb I have an older technics amp 100 watts per channel the speakers blow me out of the room before the amp is half cranked . Buy them high quality sound . 10 stars",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "small but BIG",
      "text": "these speakers light ,easy to move. the sound is HUGE.!!!",
      "rating": 5.0,
      "verified": true,
      "author": "The Rider",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "loud enough to make your ears ring.",
      "text": "Bottom speaker rattles out of the box, tightened screws and did not fix. Mid range seems to lack sounds quality.",
      "rating": 3.0,
      "verified": true,
      "author": "brandon david bussard",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "impressive set of speakers",
      "text": "after a few minutes of wheel assembly. I connected them for a totally great sound. I really enjoy these speakers. A great value as well, there is a lot of speaker for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick S.",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "nice power right price for real this speaker is not ...",
      "text": "nice power right price for real this speaker is not the best what you can get but for the price is really much more !!!the only issue is the wood is really poor but if you take care or if you do not move to often this one is what you looking for but remember if you want something better put more money in your bogged .",
      "rating": 4.0,
      "verified": true,
      "author": "Shateiel",
      "helpful_votes": 0,
      "publication_date": 20130303
    },
    {
      "title": "I love this speaker",
      "text": "I love this speaker, really pumps out the sound. I added it to my surround group and it works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Kat in OH",
      "helpful_votes": 0,
      "publication_date": 20160625
    },
    {
      "title": "If you understand sound",
      "text": "Great speaker for the price!! I'm a mobile Dj needed this speaker to complete my set, I'm now pushing about 4000 watts of sound which is plenty for almost any venue!! I highly recommend Pyle speakers 🔊 you won't be disappointed",
      "rating": 5.0,
      "verified": true,
      "author": "Dj Donso ",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Package came in damage",
      "text": "For money spend worth it. Good sound but arrived damage. Hope the next one i'm gonna buy again isn't damage, screen was bent over all everything was fine.",
      "rating": 3.0,
      "verified": true,
      "author": "Richard S.",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "smell",
      "text": "Still smells after three month of sitting in my garage . think its the glue they use to make the box",
      "rating": 2.0,
      "verified": true,
      "author": "ben",
      "helpful_votes": 2,
      "publication_date": 20150502
    },
    {
      "title": "Love them",
      "text": "I am no audiofile but i love the sound of these speakers and the heavy duty construction of them. I am using them to DJ at back yard parties of my friends and Halloween and other holiday parties. They have worked great so far for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey B.",
      "helpful_votes": 0,
      "publication_date": 20130715
    },
    {
      "title": "Great speakers. I love them.",
      "text": "These speakers rock. I bought a pair for myself and my daughter. Thinking about getting two more.",
      "rating": 5.0,
      "verified": true,
      "author": "Bart",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Getting what I ordered I don't think I did",
      "text": "I thought I ordered 2 speakers and Mac phone I karaoke so I received one unit and at 1 speaker separately this is supposed to be a package deal",
      "rating": 3.0,
      "verified": true,
      "author": "Robert g",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Just eh",
      "text": "I bought 2 of these. When they arrived, I took them out of the box only to find that one had wood shavings all over it, and the front grill was coming off. I hooked them up, and that some one had an awful buzzing coming from the tweeters. Amazon replaced it for me, and the replacement was fine. As far as sound quality goes, it seems like the crossovers aren't working as desired. I can hear the bass trying to come out of the tweeters and horn, making for the high end sounds to become distorted at louder volumes.",
      "rating": 3.0,
      "verified": true,
      "author": "QuanTrungLeap",
      "helpful_votes": 0,
      "publication_date": 20120603
    },
    {
      "title": "I love this speaker and It’s one of the best!",
      "text": "It’s reliable and could be used by itself and sounds like many speakers.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacques Joseph",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Great Sound",
      "text": "It was the best speaker since it's hard to find the old-fashioned monster speakers. It gives me a richer sound.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Small",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Something rattling inside the good one. Other one has whole front cage damaged",
      "text": "Something rattling inside the good one. Other one has whole front cage damaged. I have 2 speakers and they don't look a like. It's straight trash. The sound sucks for the size. Feel like I paid for the boxes and they damaged.",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony bail",
      "helpful_votes": 0,
      "publication_date": 20170222
    },
    {
      "title": "Speakers sound nice, wood casing not so good.",
      "text": "The sound of the speakers are about as you get for the money. However the casing leaves much to be desired. The speaker arrived at my home with wood shavings all over it. After taking them to one gig - I learned the wood shavings came from the screws holding the speakers tearing out the wood casing. After the gig - I was able to re-drill all the holes and screw the speakers back into the case - but that's not really something you look forward to doing after just buying a speaker. They sound perfectly fine - i just hope the wood holds up.",
      "rating": 2.0,
      "verified": true,
      "author": "scott cooke",
      "helpful_votes": 2,
      "publication_date": 20111210
    },
    {
      "title": "These bad boys thump",
      "text": "i bought 2 of these with the behringer ep4000 and they thump, had to send 1 back because the front grill was off and the screws were loose and rattling in the bottom, i almost overlooked the problems and started to keep it because they were knockin but then i said nah, i want what i paid for",
      "rating": 5.0,
      "verified": true,
      "author": "Nice",
      "helpful_votes": 0,
      "publication_date": 20100404
    },
    {
      "title": "it's nice for the price",
      "text": "looks good sounds good i really don't know what to say about this product it does what it's supposed to do and look good doing it very nice speaker",
      "rating": 5.0,
      "verified": true,
      "author": "damon",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Great outdoor sound!",
      "text": "Great speakers but I paid $30 more apiece for the 2 I just bought 10 days ago, wish I would have waited for price drop!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "I found a diamond in the cheap electronics rough.",
      "text": "Not going to lie. I expected crappy sounding speakers, but they are just for the practice space so I figured $300 after tax is in my budget and will work for practice. They actually sound as good as my Peavey PA we use for playing shows. Only issue I have is that you can't put them on a typical pa speaker stand.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Windmueller",
      "helpful_votes": 0,
      "publication_date": 20150903
    },
    {
      "title": "they smell and continue to smell",
      "text": "pure garbage, and I cannot even describe the smell off of them",
      "rating": 1.0,
      "verified": true,
      "author": "FOM",
      "helpful_votes": 2,
      "publication_date": 20150717
    },
    {
      "title": "Nice",
      "text": "Its not bad but dont expect much is good for a home part3",
      "rating": 4.0,
      "verified": true,
      "author": "bryan hernandez",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Sound good",
      "text": "I Love the sound of these Powerful but not 1600 watts but for a cheep speaker they do sound good and put out plenty of sound.",
      "rating": 4.0,
      "verified": true,
      "author": "PC Addict",
      "helpful_votes": 0,
      "publication_date": 20150728
    },
    {
      "title": "Very satisfied",
      "text": "I love the Pyle brand and I truly enjoy the sound. Thank you!!!",
      "rating": 5.0,
      "verified": true,
      "author": "MaddDash",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "screw will not tighten wire down",
      "text": "sounds good but will not hold speaker wire down. plastic nut was striped when received",
      "rating": 3.0,
      "verified": true,
      "author": "Bob Hutton",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "nice",
      "text": "good product. arrived damaged. shipping got it. still works well. back of box is smaller than front and that opens up a few new possibilities. other than delivery damage that is not much of a problem, good product.",
      "rating": 4.0,
      "verified": true,
      "author": "Lacy",
      "helpful_votes": 0,
      "publication_date": 20141111
    },
    {
      "title": "This speaker is no gud it’s not playing",
      "text": "Hey I would like to have a replacement for this speaker I buy it a while ago and it stop playing",
      "rating": 5.0,
      "verified": true,
      "author": "Vickram Bhowaniprasad",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "blown away!",
      "text": "everyone says dont buy pyle but ive had these speakers in my room for about 5 months now & they are so loud! the sound is so crisp even at max volume. the bass if fairley good also! you can totally feel it. i highly recommend for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "frankie",
      "helpful_votes": 0,
      "publication_date": 20130825
    },
    {
      "title": "Disappointed",
      "text": "Disapointed in sound quality. For being Pyle , I was excited and was let down.",
      "rating": 2.0,
      "verified": true,
      "author": "Allen Morgan",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Poor quality",
      "text": "Speaker had ok sound. Before I used it for the first time the top speaker cracked. Would not buy a Pyle product again.",
      "rating": 1.0,
      "verified": true,
      "author": "Nancy Smith",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Would buy again",
      "text": "I bought these speakers for a party setting and for the price I paid they exceeded my expectations. Along with their amp it makes it easy to play music out of your phone with an aux cord. However, one tug of the cord I was using caused the input to break off within the speaker. Bottom line, great for the cheap price, but once installed done mess with them too much.",
      "rating": 5.0,
      "verified": true,
      "author": "LPas",
      "helpful_votes": 0,
      "publication_date": 20150123
    },
    {
      "title": "generic version of Pyle \"PRO\"  PADH212",
      "text": "not very impressed the 12s aren't even made by Pyle. The real deal has 4 12 in. PyleDrivers!",
      "rating": 2.0,
      "verified": true,
      "author": "Chatty22573",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Works great, just that the highs is real high and ...",
      "text": "Works great, just that the highs is real high and the low is not that low. Think I may need a mixer to balance them.",
      "rating": 4.0,
      "verified": true,
      "author": "Omar P.",
      "helpful_votes": 0,
      "publication_date": 20141129
    },
    {
      "title": "I am happy with these speakers so far",
      "text": "I am happy with these speakers so far. They are in my detached garage, if they were in the house I wouldn't be to thrilled. I've had them for a couple of months and they still have my garage stinking. Some kind of nasty burned plastic smell. They do jam though.",
      "rating": 4.0,
      "verified": true,
      "author": "Ronnie B.",
      "helpful_votes": 0,
      "publication_date": 20140910
    },
    {
      "title": "OK speaker for the price",
      "text": "I bought this speaker for singing karaoke only. They do ok job for the price. I used to use Klipsch RF82 but I'm afraid when I play too loud, it may damage the horn, so I bought this pair. For this speaker, you need to play with high volume. If you turn down volume, it does not provide good sound. I think because the 12\" speaker is kind of hard, so it need strong power receiver to play with. And b/c there is no mid range speaker, your voice is not very clear when you sing. Anyway, If you play this speaker with big room, they'll do better job. I just use it for party.",
      "rating": 3.0,
      "verified": true,
      "author": "BN",
      "helpful_votes": 0,
      "publication_date": 20130513
    },
    {
      "title": "Clean sound, blended nicely with other PA speakers.",
      "text": "Good quality, no damage in delivery, heavy speaker, nice sound.",
      "rating": 5.0,
      "verified": true,
      "author": "james o'neil",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Five Stars",
      "text": "Nice set of speakers. Driving with a 50 watt amplifier, plenty of volume, sound quality is great.",
      "rating": 5.0,
      "verified": true,
      "author": "n2gpin",
      "helpful_votes": 0,
      "publication_date": 20160221
    },
    {
      "title": "Excellent Value",
      "text": "For the price, they definitely are a great value. Come with wheels for easy mobility, as they would require two people to transport them any real distance, and the sound is clearer when the speaker is not directly on the floor. I bought two and they are powered by a Pyle 2200W amp. Haven't had any problems out of them. Would definitely reccomment to someone on a budget.",
      "rating": 5.0,
      "verified": true,
      "author": "Nic",
      "helpful_votes": 2,
      "publication_date": 20100921
    },
    {
      "title": "Ground and Pound",
      "text": "Shakes the house and makes the neighbors nervous. I want 2 more of these. Highly recommend these speakers. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris D.",
      "helpful_votes": 0,
      "publication_date": 20130907
    },
    {
      "title": "Great Product",
      "text": "These speakers work very well and they are very loud and clear. I am now thinking of getting another set for a friend",
      "rating": 5.0,
      "verified": true,
      "author": "karles",
      "helpful_votes": 0,
      "publication_date": 20130314
    },
    {
      "title": "Does this come with speaker wires ?",
      "text": "Do this speaker comes with the speaker wires for this speaker or do you have to buy them this speaker looks great can't wait to get it 1600 watts that going to go nice with my Pyle 3000 watt receiver/amp system I'm gone go ahead and rate it a four for now i will change it after I use it but I know it's crazy meaning good great nice decent etc and so on all the above.",
      "rating": 4.0,
      "verified": true,
      "author": "mattphilly215",
      "helpful_votes": 0,
      "publication_date": 20130405
    },
    {
      "title": "Nice sound for the money",
      "text": "The speakers are nicely made good quality WORKS WELL !! the sound quality is good !! I would recommend them!",
      "rating": 4.0,
      "verified": true,
      "author": "JakeSS",
      "helpful_votes": 0,
      "publication_date": 20131120
    },
    {
      "title": "Great Speaker for the money",
      "text": "Ordered 2 of these speakers. We will be using them in our Community Theatre. Was very surprised at the clarity. Much better than anticipated. Was a little hesitant after reading reviews. Will be ordering 2 more in the future. Thanks for keeping the Amazon standards so high.....",
      "rating": 5.0,
      "verified": true,
      "author": "Magic",
      "helpful_votes": 0,
      "publication_date": 20140701
    },
    {
      "title": "best of pick",
      "text": "Full range sound and powerful too, the pair I got look good in my home.",
      "rating": 5.0,
      "verified": true,
      "author": "Cruiser",
      "helpful_votes": 0,
      "publication_date": 20141004
    },
    {
      "title": "Love it, impressive look, impressive sound, super cheap price",
      "text": "Love it, impressive look, impressive sound, super cheap price. PA is good for voice/singer karaoke/performance music, not same as Bose or Polk in highfidelity music with high and low. Human voice are mostly mids, which serve awesome for my karoake. My living room only need 100w, but these are rated at 1,600watt!!! I don't mind, since it has the look factor even when it's not even turn on.",
      "rating": 5.0,
      "verified": true,
      "author": "PUA",
      "helpful_votes": 3,
      "publication_date": 20120127
    },
    {
      "title": "Great Choice",
      "text": "I'm old school. This is my idea of surround sound. You can keep the 12 little baby speakers. I'm 6' away from these. Their surrounding me just fine and listening to cds through them is enough to take the pictures off the walls.",
      "rating": 5.0,
      "verified": true,
      "author": "The Vulcan",
      "helpful_votes": 0,
      "publication_date": 20140109
    },
    {
      "title": "LISTEN TO THE POOR REVIEWS!!",
      "text": "I didnt listen to the poor reviews concerning \" you get what you pay for\". Dont do it what I did, I figured they were bitter buyers. Fact- They are large speakers, and look super cool, and it all stops there. Sound is horrible, no high pitch, poor bass - more muffle sounding than bass...and absoultely all midrange. Very dry sounding. Worst part, you dont listen and buy anyway thinking hey..I'll return them if they suck..be prepared to shell some serious cash for return shipping, they way a ton and a half due to all the glue in the MDF.",
      "rating": 1.0,
      "verified": true,
      "author": "Brent T. Rogers",
      "helpful_votes": 6,
      "publication_date": 20130423
    },
    {
      "title": "not happy with this item",
      "text": "just bought this speakers two days ago and used them two times and they already fell apart says there made of mdf which there not found out there made out of Particle Board which is cheap made don't get me wrong they sound so clear",
      "rating": 3.0,
      "verified": true,
      "author": "joel",
      "helpful_votes": 0,
      "publication_date": 20121205
    },
    {
      "title": "AWESOME",
      "text": "This item was better than expected and UI had high expectations. I love it, love it, love it!!! If I could buy another for the same price, I would in a heart beat!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20131111
    },
    {
      "title": "Good buy for the price!",
      "text": "I purchased two of these in order to supply sound for small DJ events. Compact (for dual stacker speakers), rollers provided, and very nice/clear sound. A little more bass would be nice for 4 12's, but then again they ARE 12's. I think Pyle may have bumped up the wattage on these a bit; I don't think they handle as much as they say they do, but still nice for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Jerry B. Aldridge",
      "helpful_votes": 2,
      "publication_date": 20091126
    },
    {
      "title": "Five Stars",
      "text": "Speakers are very crisp an clear an sound great very impressed!!",
      "rating": 5.0,
      "verified": true,
      "author": "Brant Harbert",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "good product, A little bit to much high end ...",
      "text": "good product,A little bit to much high end but works fine",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "PADH212 1600W STACK",
      "text": "For the $, you would be silly not to buy these speakers. They carry all frequencies very balanced and REALLY loud. No buzz, crackle or distortion at all. I for one, am very impressed with them. I use the PYLE PTA 1400W POWER AMP to push them. So far, so good!",
      "rating": 4.0,
      "verified": true,
      "author": "11 Miles Nate",
      "helpful_votes": 0,
      "publication_date": 20120516
    },
    {
      "title": "these speakers are AMAZING!!",
      "text": "Bought these for my husband as a gift... because it's what he wanted for Christmas last year.. these speakers are AMAZING!!! Love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystyle",
      "helpful_votes": 0,
      "publication_date": 20141212
    },
    {
      "title": "Awesome speakers for the price!",
      "text": "Like the look, and love the sound. A bit heavy. These speakers are hard to beat for the price, honestly.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher F.",
      "helpful_votes": 0,
      "publication_date": 20130830
    },
    {
      "title": "GREAT speakers for the price",
      "text": "Theses are great speakers I would recommend them, very loud for the price just not the greatest on the bass. Also fast shipping",
      "rating": 4.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20130523
    },
    {
      "title": "GREAT FOR THE PRICE!!!!!!!!",
      "text": "I was kind of worried about buying this speaker.. Boy was i wrong. Very good loud speaker. sound great. i wish i had a bigger amp to push them. But even under powered (for now) they sound great!!!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Haw",
      "helpful_votes": 6,
      "publication_date": 20120210
    },
    {
      "title": "Great value",
      "text": "great speaker they are just so good for the price your paying you just need a good amp and your good to go the better the amp the better the sound obviously , i was amazed by another product i used this with is one of those Asian generic amplifier it cost me like 9.99$ usd here at amazon and it was able to power 2 of this speaker the sound was pretty good for such an amp",
      "rating": 5.0,
      "verified": true,
      "author": "AliceIsThatYou?",
      "helpful_votes": 0,
      "publication_date": 20160507
    },
    {
      "title": "Satisfied Customer",
      "text": "Must say i was a little suspicious due to the price and Pyles rep, however i was pleasantly surprised by the performance of this thing! Definitely a steal will most likely be ordering more of these!",
      "rating": 5.0,
      "verified": true,
      "author": "xMiesch",
      "helpful_votes": 0,
      "publication_date": 20120720
    },
    {
      "title": "Save up and buy quality",
      "text": "I was terribly disappointed in this speaker, in order to get any decent volume out of it I have to crank my system, and the feed back is unbearable. I am returning as soon as I can figure out how.",
      "rating": 1.0,
      "verified": true,
      "author": "The Rock Star Real Estate Team",
      "helpful_votes": 3,
      "publication_date": 20130715
    }
  ],
  "product_meta": {
    "title": "Portable Cabinet PA Speaker System - 1600 Watt Outdoor Sound System Vehicle Stereo Speakers w/ Dual 12\" Woofers, 3.4\" Piezo Tweeters, 5\"x12\" Super Horn Midrange, Crossover Network - PylePro PADH212,Black",
    "description": "The Pyle Pro PADH212 speaker cabinet is loaded with Genuine Pyle Drivers, so you know this loudspeaker system has been assembled with the highest quality components. This speaker features Heavy Duty MDF (Medium-Density Fiberboard) construction with reinforced corners, Heavy Duty handles, and a carpeted enclosure, giving it the ability to withstand years of use and abuse, whether it be at live stage gigs, private parties, traveling DJ events, etc. The PADH212 features two 12'' Pyle Premium Woofers, one 5'' x 12'' Horn, four Piezo Tweeters, and can handle up to 1600 Watts. A ported bass reflex enclosure design creates a full and vibrant sounding speaker system. The 12'' Woofers feature 80 oz. magnets and 2'' Kapton Voice Coils, for excellent signal response. The 1.5'' Titanium Compression driver has been constructed with a 20 oz. magnet. If you are looking to put together a professional PA system at an affordable price, make Pyle Pro a top choice. Pyle has been in business for over 35 years, and their manufacturing experience and expertise is easy to see - and hear.\n\nFROM THE MANUFACTURER\n\n\nThe Pyle Pro PADH212 speaker cabinet is loaded with Genuine Pyle Drivers, so you know this loudspeaker system has been assembled with the highest quality components. This speaker features Heavy Duty MDF (Medium-Density Fiberboard) construction with reinforced corners, Heavy Duty handles, and a carpeted enclosure, giving it the ability to withstand years of use and abuse, whether it be at live stage gigs, private parties, traveling DJ events, and more.\n\nHeavy Duty MDF construction with reinforced corners The PADH212 features two 12\" Pyle premium woofers, one 5\" x 12\" horn, four piezo tweeters, and can handle up to 1600 Watts. A ported bass reflex enclosure design creates a full and vibrant sounding speaker system. The 12\" woofers feature 80 oz. magnets and 2\" Kapton voice coils, for excellent signal response. The 1.5\" Titanium compression driver has been constructed with a 20 oz. magnet.\n\nIf you are looking to put together a professional PA system at an affordable price, make Pyle Pro a top choice. Pyle has been in business for over 35 years, and their manufacturing experience and expertise is easy to see--and hear.\n\nRICH, SATISFYING BASS\nExperience rich and full low-end response, thanks to two 12\" woofers with giant 80 oz. drivers and Kapton voice coils. Modern Kapton voice coils are very strong performers in the face of high operating temperatures. Oftentimes Kapton coils hold up better under thermal stress than what it is wrapped around. The 2\" Kapton voice coils in the Pyle PADH212 speakers ensure improved signal response. The ported enclosure design delivers even more bass response.\n\nHEAVY-DUTY CONSTRUCTION\nThe PADH212 features rugged, heavy-duty construction with reinforced corners, making it an ideal choice for everything from home applications to the studio and rehearsal room. The reinforced MDF cabinet material stands up to your audio placement needs time and time again.",
    "rating": 4.3,
    "feature_bullets": [
      "DUAL 12 INCH SUBWOOFER: This portable pa system party speaker is equipped w/ dual 12\" woofers w/ 80 oz. magnets & 2\" Kapton voice coils, & four 3.4\" piezo tweeters for full range surround stereo sound reproduction and ported enclosure for added bass",
      "5\" X 12\" HORN: Pyle Dj speakers high powered pa speakers PADH212 has been assembled w/ highest quality components. Features a 5\" x 12\" super horn midrange/tweeter w/ 1.5'' titanium compression driver that has been constructed with a 20 oz. magnet",
      "BUILT-IN CROSSOVER NETWORK: This portable sound system has a built-in crossover network & 50-20k Hz frequency response. Also equipped w/ dual Speakon 1/4\" jacks & binding post terminals. Ideal for live stage gig, private parties, traveling DJ events",
      "MADE TO LAST: The indoor-outdoor speakers’ wired pa system is made w/ heavy-duty MDF (Medium-Density Fiberboard) construction w/ reinforced corners and carpeted enclosure to withstand years of use and abuse. Also has heavy-duty handles for portability",
      "1.5\" titanium compression driver loaded in horn",
      "Five piezo tweeters",
      "Two 12\" subwoofers with 2\" Kapton voice coils",
      "Giant 80 oz woofer magnet weight for a huge sound",
      "Ported MDF enclosure",
      "1600 WATT POWER: The high powered subwoofer indoor outdoor speaker system has a maximum power output of 1600 watt peak power / 800 watt RMS at 8 ohms so you can play your favorite tracks as loud as you want and with style"
    ],
    "specifications": {
      "Product Dimensions": "42.5 x 17.5 x 16.7 inches",
      "Item Weight": "46.9 pounds",
      "Manufacturer": "Pyle Pro",
      "ASIN": "B0013C7ICC",
      "Item model number": "PADH212",
      "Customer Reviews": "4.3 out of 5 stars279 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#57,853 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 3, 2006"
    },
    "categories": [
      "Home Audio",
      "Electronics",
      "Speakers",
      "Bookshelf Speakers"
    ],
    "price": 181.99
  }
}