{
  "website_summaries": [
    {
      "verdict": "This steam iron is simple to use and weighs enough to take out wrinkles without applying a lot of force.",
      "pros": [
        "Aluminum, nonstick soleplate",
        "7 temperature settings to accommodate different fabrics",
        "Automatic shutoff",
        "Navigates easily around buttons and collars",
        "Pivoting cord",
        "Heavy enough to smooth out wrinkles without needing to apply a lot of pressure"
      ],
      "cons": [
        "Some have said the iron snags on clothes when the iron glides across fabric"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Toxic iron...read on.",
      "text": "Whoa I might’ve gotten a faulty iron because this thing smokes when used on heat over medium and it smells like toxic chemicals. Made me nauseous and my chest hurt. This is hazardous. I am returning it, although they should just tell me to toss it in the trash. I hope they don’t resell this thing. Upon arrival it looked as if it had been returned before with water spots and fingerprints.. so....that’s really lame!",
      "rating": 1.0,
      "verified": true,
      "author": "Ckdub",
      "helpful_votes": 38,
      "publication_date": 20180919
    },
    {
      "title": "Died after 4 months of use.",
      "text": "Works as intended, but when you fill the water even using the guide line is manages to leak a bit. Otherwise it was good for the price for sure. Update: The product has died 4 months after using it. The warranty policy dictates that you either find a way to send it to B&D or find a B&D center and there isn't one near me. So I'm pretty much out an iron since shipping it would cost more. They don't seem to have an RMA process. You get what you pay for.",
      "rating": 1.0,
      "verified": true,
      "author": "Erick O",
      "helpful_votes": 22,
      "publication_date": 20160531
    },
    {
      "title": "since it's done an excellent job ironing dry nearly every day I've used it",
      "text": "This iron is a workhorse for sure! I've had it for less than a month, but it is a marked improvement over the half-broken iron I've been using the past 6 years. I have yet to utilize the steam feature, since it's done an excellent job ironing dry nearly every day I've used it. It heats up quickly and evenly. I do feel it's going to be a matter of time before I burn myself on it, though, since so much of it is hot metal. It's got a good heft to it, and it's easy to use. I hope it lasts me many years!",
      "rating": 4.0,
      "verified": true,
      "author": "MissSpooky",
      "helpful_votes": 12,
      "publication_date": 20160720
    },
    {
      "title": "Meh, cheap version of old iron.",
      "text": "The iron works well so far. Have had it for around a month. It is NOT as nice as the original. The print on the dial is very generic looking and the Orange button you release when you want to use steam h doesn't click in like it used to and if so much as bumped it pops out into the steam position. It's a cheap version of the original. I wish I hadn't dropped my old one that last time (knocked off ironing table). It was by far superior to this one and at least 8 years old.",
      "rating": 3.0,
      "verified": true,
      "author": "L. Engel",
      "helpful_votes": 10,
      "publication_date": 20170609
    },
    {
      "title": "Heavy Duty Almost a complete copy of the 60s iron. No fancy electronics to break",
      "text": "I don’t like modern lightweight irons. They are to fragile. The heat indicator is a simple dial, nothing to break. This is a solid heavy iron that handles heavily wrinkled clothing easily. I love the fact that there’s no Teflon. The high temperature setting is fantastic for jeans and heavy wrinkles. I found no issues with the safety cut off. This is a heavy duty no frills iron. I know they tend to have steam issues due to residue in the water that builds up. I just use a spray bottle to avoid this issue. In this way I expect many many years of trouble free operation.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Not What it Used to Be!",
      "text": "I've had this Classic Steam iron from Black & Decker for many years. I just bought a new one in 2020 and have been greatly disappointed. The heat selection tab sticks and is difficult to adjust. The steam does not come up easily, the iron has to be shaken several times to make the steam start. The temperature seems lower, it is difficult to get wrinkles out of the fabric, even with many passes over. It is just not the same. I've returned and reordered the iron once. When it totally dies, or I can't stand it anymore, I will go to Costco and buy whatever iron they are selling that day.",
      "rating": 1.0,
      "verified": true,
      "author": "TCL",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "No steam",
      "text": "I was so excited to get my new iron. I couldn’t wait. I had had two different irons that had the controls under the handle (impossible to see. I gave one away and the other lasted a couple months. I couldn’t wait to use this. I was so disappointed when I tried to iron because the steam wouldn’t work. I went over the instructions and saw I did everything right. I don’t know what to do now.",
      "rating": 2.0,
      "verified": true,
      "author": "Bev t.",
      "helpful_votes": 2,
      "publication_date": 20190425
    },
    {
      "title": "Heavy Use - Lasted a year",
      "text": "Well, it's like this ... I bought the iron just about a year ago. I loved it. I used it a lot. But ... it's started to leak and it's driving me crazy! I do theatre costumes and the leak can damage some of the fabrics. So ... do I contact the manufacturer and complain or just buy another? Bottom line ... I'll buy another. I liked it far better than the last one I had, which cost three times as much and didn't work worth a damn.",
      "rating": 4.0,
      "verified": true,
      "author": "Jack Cannon",
      "helpful_votes": 5,
      "publication_date": 20170528
    },
    {
      "title": "Worked great.. And then it didn't",
      "text": "I really like this iron because it was able to work on. Team and it would keep crisp edges and folds and creases. It did take a minute to warm up but that's expected. However after owning it for 6 months It's just tough working and now the red light is flashing continuous when I Google that it said that it means an internal component is broken and now the item must be replaced. If it had great durability I would give this 5 stars but because it's only giving me 6 months and now I need to have it replaced, I have to give at a lower rating.",
      "rating": 3.0,
      "verified": true,
      "author": "iKhandy",
      "helpful_votes": 2,
      "publication_date": 20180815
    },
    {
      "title": "Classic Steam Iron, model F67E from Black and Decker",
      "text": "BLACK+DECKER Classic Steam Iron I bought this for the use to repair wear scratches on my kayak and to melt or weld the repair plastic to the surface and help ward off sinking due to holes in the hull. It gets plenty hot and melts the repair pieces effectively. I could have purchased a used iron, but why at this price and free shipping with PRIME. This iron will never iron a pair of jeans or boxer shorts as intended. I do hope it lasts for my use, yearly or a little more often, if not I will return and adjust the review to reflect the failure with minimal use. So far I like it.",
      "rating": 4.0,
      "verified": true,
      "author": "CDP's Onceagain habit of purchasingTop Contributor: Guitars",
      "helpful_votes": 2,
      "publication_date": 20180313
    },
    {
      "title": "Leaks",
      "text": "I had a similar iron years ago and loved it....nice and heavy, yet steam... Read reviews on this one and took a chance that this would be one that worked. I was very careful to follow directions exactly, but through time the iron would leak water on the clothing as I was ironing. I had to move the iron very slowly to keep it from leaking water...but finally gave up and used it as a dry iron and dampened my clothes by hand with a spray bottle... Very Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Ilene F. Greising",
      "helpful_votes": 10,
      "publication_date": 20150614
    },
    {
      "title": "They just don't make 'em like they used to",
      "text": "I owned this for 2 years with heavy, daily use. I bought this model because I remember using it in my mom's dry cleaning/tailoring shop growing up. It's a classic so I figured I'd get it for my business. I like the weight of it. It feels durable and sturdy but this past week the Steam button broke. Now it steams randomly, unpredictably with the Steam button ON. I'm so bummed because it's only 2 years old and I remember using my mom's for years! It served my well for 2 years but had hoped I would get much longer use out of it. They just don't make em like the used to...",
      "rating": 3.0,
      "verified": true,
      "author": "Purple People Eater",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "The gold standard for irons at a great price. This retro iron is nice and heavy",
      "text": "The gold standard for irons at a great price. This retro iron is nice and heavy, built to withstand slips and drops and feels good in the hand. When I saw it was available I jumped on it because it looks exactly like the one my family used 50 years ago, and those irons lasted forever. This one is solid, simple to use and seems very durable. The excellent price was icing on the cake, I would have paid much more for it, based on my past good experiences.",
      "rating": 5.0,
      "verified": true,
      "author": "kevin burke",
      "helpful_votes": 18,
      "publication_date": 20161028
    },
    {
      "title": "works well for an affordable basic iron but broke after a year.",
      "text": "Very basic iron that is heavy and thus great for pressure and crease work. I love that it wasn't computer screened reliant and it has a vintage look to it. Though, the product didn't last more than a year. The steam component of the iron, kinda works sometime but I rarely use it that it did't bother me. Though I bought 2 of these iron and both stopped work after a year. The orange light still appears when I plugged it into the outlet but it doesn't get hot anymore. I thought it was the auto-off problem, but it seems to just not work.",
      "rating": 3.0,
      "verified": true,
      "author": "cian ai",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Great iron",
      "text": "I am a fussy person about my clothes and I do my ironing after every wash. This iron is the greatest for getting those wrinkles out. It is heavy enough, but not too much. I hate those irons that are so light, as they do not seem to do the job of getting clothes wrinkle-free. This Black and Decker iron surely is a Classic as I had one when I was first married and loved it. Went to another iron for a few years and now I am back to the Black and Decker after being married for 42 years. So the iron was very durable and lasted many, many years. I am very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Gail",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Disappointing purchase",
      "text": "I bought this iron 6 months ago. To its credit, it does not spit water, but nor does it consistently steam. It often has to be firmly tapped face down on the ironing board to stimulate steaming. The highest setting is not quite hot enough for cotton, definitely not hot enough for linen. Others mentioned the small water window - yes, that is annoying, and that it isn't a good iron for sewing - also true. Takes forever to reheat after self turn-off. I'm making masks these days and this iron was inadequate in several ways, so today I bought something else. Will take this to the give-and-take shed at the county dumpsters when that reopens.",
      "rating": 1.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Old fashioned heavy duty iron!",
      "text": "This is such a value for the money. I am a quilter. It heats up quickly and get the wrinkles out of most cottons without steaming. I will not put water in any iron as that seems to be the kiss of death. I spritz a bit of water on any stubborn wrinkle and this iron takes care of it. Some irons are too light. They are nice for people with strength/arthritis issues....but, that means you really have to put more weight on the iron with your body. This iron is heavy and does a lot of the work for you. Not much plastic on this baby! Thank you Black and Decker!",
      "rating": 5.0,
      "verified": true,
      "author": "Dinah S.",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Black & Decker isn't what it used to be.",
      "text": "I purchased this iron last year and had used it no more than a dozen times, ironing no more than approximately 2 or 3 items, each time, i.e., a total of perhaps 30 to 35 items of clothing before it ceased to get hot. There is no heat at all; it's dead as a doornail. I could have paid someone else to do the ironing for less than what I paid for this iron, which I now have to replace.",
      "rating": 1.0,
      "verified": true,
      "author": "lee77",
      "helpful_votes": 3,
      "publication_date": 20171023
    },
    {
      "title": "Classic and with all the performance you would expect",
      "text": "I have never had an iron like this. i have only heard about great irons from my mom. it is heavier that our old iron, but its weight is what makes it great. The seams are perfect, and the non-drip is a big factor for us. Our old iron always would drip water onto our clothes. there is so much to say about this classic looking iron but words can describe how we feel to have this. And one last thing. When we forget the turn off the iron before leaving home, it automatically turns itself off after 8 mins. how kool is that.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Gates",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Started leaking on the very first use",
      "text": "I bought this iron because I like the classic design and don't believe a clothes iron needs to look like a space freighter. But classic design does not apparently equal classic quality. I filled it up and it started leaking (i.e. gushing) water all over my ironing board before I could even plug it in. There were a couple other visible signs of defective workmanship as well, and I can confirm what others have said about the roughness of the soleplate. I have no idea if it would catch on fabric as I didn't get that far, thanks to the aforementioned leak. Is it just me, or did Black & Decker used to make good stuff back in the day?",
      "rating": 1.0,
      "verified": true,
      "author": "Michael G",
      "helpful_votes": 10,
      "publication_date": 20160227
    },
    {
      "title": "Disappointing, leaks, doesn’t steam on demand.",
      "text": "This iron was good for the first few times of use and has gradually become less useful. The most disappointing factor with this iron is its inability to use the steam button to shoot “puffs” of steam. The red button in the middle only is used to stop the steam when it’s pushed in and allow steam when it’s released. The water reservoir it’s very sensitive and you need to be very careful when filling because the slightest amount of water too much will cause leaking. Overall I wish I had bought another iron. This one is not ideal by any means with the exception of its weight.",
      "rating": 2.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Granny wants, granny gets",
      "text": "Mother in law is 88. Comes up once a week to iron. The old one has a ton of miles on it, so I offered to get her a new one. She wanted the same one. She swears by it. Perfect weight and so on. If anyone is an expert, it’s her.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "So far so good, but I've only owned it a few weeks.  Check back in a year.",
      "text": "I do like it, love the slick bottom, a little heavy, but I was getting tired of ironing with irons that weigh nothing so decided to try this one that looks like the first iron I ever owned. Need to build up my arm strength and hopefully it will last as long as that first one did instead of stopping after a few months like so many of them do. Here's hoping, my fingers are crossed.",
      "rating": 4.0,
      "verified": true,
      "author": "Lorrie",
      "helpful_votes": 2,
      "publication_date": 20171028
    },
    {
      "title": "Solid, Functional, and Vintage inspired",
      "text": "Had a very vintage GE version of this. This is exactly same, essentially remaking the vintage model into a solid piece. So far so good! Does have a habit of leaking a bit on steam function, not sure if I am the best person to use an iron anyway <full disclosure>. However, it's a solid piece, and I can imagine owning it for a very long time. Thank you B&D!",
      "rating": 4.0,
      "verified": true,
      "author": "Michael H.",
      "helpful_votes": 2,
      "publication_date": 20180221
    },
    {
      "title": "The only iron I will ever buy",
      "text": "This is my second B&D classic iron. This iron has a nice weight to it that helps with ironing. I am able to get wrinkles out faster and easier even without spray starch. I have used lighter weight irons in the past and really had to press down (and use starch) and still did not get as smooth a finish as I do with this iron. I hate ironing but I love this iron!",
      "rating": 5.0,
      "verified": true,
      "author": "Favdoggy",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "my wife hates this",
      "text": "well the safety features make this unusable, my wife had an old one that was 35 years old it broke. So I got her this and she complains it turns off to quit to be any use of ironing. We sold it in a yard sale. My wife is not looking for a vintage one because she hates the safety features that were on it.",
      "rating": 2.0,
      "verified": true,
      "author": "Eric T. Lewis",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Its's Ok.",
      "text": "I'm not particularly jazzed about this model but i will say one thing. If you have pets in the house and you're worried about fumes, this is a pretty basic iron to get. I try not to get anything with any kind of coating on my iron. You do need to refill it with water several times if you're doing a big pile of clothes but its your standard moms iron and works well for my needs.",
      "rating": 3.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "I just love this iron",
      "text": "I just love this iron! I don't have to press down like with a lighter iron, the heat is just right, and while it's heating up, I watch the birds outside. There are only two drawbacks. First, there's only a teeny little window to see the water level so I have to shake it to hear if there's still water inside, and second, it doesn't stay on long so if I sew a bit and come back to press, I have to wait for it to heat up again but it doesn't take long. These inconveniences are minor compared to how well this iron works.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Great little iron",
      "text": "Great little iron. I bought this as I am learning to iron so it was my first purchase. I can't compare it to more expensive rowenta irons , but it does not have a steam or spray option so a cheap spray bottle next to you is necessary. It also seems to have a small water tank because I fill it up two or three times while ironing several dress shirts.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 5,
      "publication_date": 20160623
    },
    {
      "title": "A definite steal!",
      "text": "It looks cool, has just the right amount of bells & whistles for an iron, and at the price, you can't beat it. I had one for a couple of years and lost it in a move. Just bought it again, and its still great. It has a little bit of weight to it so you don't have to push as hard, as I use the steam on everything. Will buy again and again, if I keep losing them! Otherwise I'm sure they last, too!",
      "rating": 5.0,
      "verified": true,
      "author": "ralphie wiggum",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Great classic iron!",
      "text": "I got this iron because it reminded me of my Grandmother's iron that I used until I recently left it on after rushing leaving for work. That old black and decker iron from the 70s was a goner, after years of use, and my carelessness in using tap water to fill it with. I bought this one in homage to that old one I had to toss. This one is perfect with consistent steam. The first thing I noticed is the auto shut off, in case I leave in plugged in again!",
      "rating": 5.0,
      "verified": true,
      "author": "Darrin S.",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Fantastic classic iron !",
      "text": "I love this classic iron, it’s weight and performance. They used to carry it at Walmart and when our old one finally went out after many years, we couldn’t find it anymore. I’m so glad Amazon still carries it ! Thank you for a great product at such reasonable price !",
      "rating": 5.0,
      "verified": true,
      "author": "Pilar Cannizzaro",
      "helpful_votes": 0,
      "publication_date": 20201028
    },
    {
      "title": "Good iron with simple interfacing. Gets the job done!",
      "text": "This is really nice iron for the price. It is a little heavier than other irons I have used, but then again, the weight really helps get those wrinkles out. I an able to get the perfect iron press every time. This heats up fast and the steam is uniform. I have had no issues with leakage. This could use a little redesign on the placement of opening to fill water. Great if you want to iromg clothes fast, without a lot of fancy and complicated settings.",
      "rating": 5.0,
      "verified": true,
      "author": "Leena Wagle",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Basic, Durable, Functional",
      "text": "Had an earlier version of this iron for 10 -12 years - dropped it one time too many. It never failed to iron clothes well and had no flaws, so I bought another one. The newer version has lights the previous model didn't and they're helpful, once you figure them out.",
      "rating": 5.0,
      "verified": true,
      "author": "tebaho",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Controls and cord",
      "text": "Purchased and returned three of these irons. First Iron: cord swivel didn't work, temp control was very difficult to turn, steam switch wouldn't stay engaged. Second Iron: cord swivel didn't work, steam switch wouldn't stay engaged. Third Iron: cord swivel didn't work.",
      "rating": 1.0,
      "verified": true,
      "author": "guy",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Durable and tidy",
      "text": "If you are looking for lightweight fast irons this is not for you. Unlike if you want perfect ironing and good press then no other thoughts. This is the best",
      "rating": 5.0,
      "verified": true,
      "author": "Shopping-spree",
      "helpful_votes": 3,
      "publication_date": 20190315
    },
    {
      "title": "Great Old School Iron without out all the flash works better then high priced ones",
      "text": "I used a lot of high priced irons and after about a 1 year they break down or leak water making them horrible to use. I bought this iron because my mother in law has had the same one for over 7 years and its still going strong decided to give it a try to see if I get the same results even if I don't didn't pay to much for it. I have used it and hand full of time already and no problems yes it's not as smooth as the high priced ones and it does the job so much better I don't need to use starch when I use this iron I would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jedi Knight77",
      "helpful_votes": 2,
      "publication_date": 20160108
    },
    {
      "title": "Love this Iron!",
      "text": "Love the weight and style of this iron. Like one I grew up using. For me, only thing I really don't like about this or the newer irons in general is the auto shut off if not in use for a few minutes. When I sew, I like to keep the iron on for pressing seams and such as I sew. Sometimes I take too long between the sewing machine and the ironing board and it shuts off. But, overall, that aside, I really like the performance and feel of this iron.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Kiesel",
      "helpful_votes": 3,
      "publication_date": 20160302
    },
    {
      "title": "Vintage touch",
      "text": "Works well as aspected, is a heavy iron but is worthy is does kind products that still on market after so many years because works.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "mediocre at best",
      "text": "Well, you get what you pay for! It is a fine iron for someone who irons infrequently. If you iron weekly, move on. Although it proclaims \"anti drip\", it is not. It drips quite a lot and raising the temperature does not work. The water reservoir is small and if you use steam to iron everything, like I do, you will be refilling regularly. Honestly I would return, but I've used it and I don't do much ironing. Spend a few extra bucks and get a better iron.",
      "rating": 3.0,
      "verified": true,
      "author": "Michele L",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "NOT THE REAL DEAL: Black + Decker Does Not Equal Black and Decker",
      "text": "We have been using the GE Classic Iron for years. ( Our first one had a cloth - like electric cord.) At some point Black and Decker took over the Classic name, but the quality remained excellent . Today if you read the brand name carefully, you will see that it is not Black and Decker, but Black + Decker. Obviously this is a different company. This is not a very good product. The soleplate does not glide or move smoothly across fabric. I think that our previous iron has a steel soleplate and this one is aluminum. We are going to return this iron and look for a metal iron whose soleplate is steel.",
      "rating": 2.0,
      "verified": true,
      "author": "SAM in AZ",
      "helpful_votes": 0,
      "publication_date": 20151108
    },
    {
      "title": "Gets the job done",
      "text": "I am not a fan of ironing so I need an iron that gets the job done quickly. I have tried other fancy looking steamer type irons and have come back to this classic because it gets the job done without fancy bells and whistles. I no longer try other brands. I buy this iron. It lasts for several years. When it goes bad I just buy another one just like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jiya",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "This iron is wonderful!",
      "text": "This iron is wonderful! It gets hot quick & seems to have more weight to it than others. The plate is very smooth as well, with notches for going around buttons. I use it mostly for quilting & sewing. The steam function works great unless you overfill it. Then it will sputter out of the fill hole, which is not covered. My only suggestion would be to make the fill line easier to see & maybe put a cover on the fill hole. Other than that, I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristie Cook",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "A real woman's iron !",
      "text": "I am so thankful I somehow found this wonderful iron! I was looking at the pricey plastic irons and miraculously this one came up. Works like a dream, just like mama's and gran-ma's. Now .....at last ....I have one. Absolutely the ONLY drawback is the auto-shut off, but this is the age of law-suits, such a pity. I've had the flimsy plastic models, won't even sit upright half the time. THIS ...THIS .....is an iron! You can even use tap water in it. The minute you see it, you'll be in love. Ahhhh.....back to the days of quality !",
      "rating": 5.0,
      "verified": true,
      "author": "Chyrl",
      "helpful_votes": 0,
      "publication_date": 20160128
    },
    {
      "title": "Not like the old Classic Black and Decker iron",
      "text": "I have been using the classic black andDecker iron for 40 years. This is not the same. It has a light on it that stays on even if it’s turned off. It puts out very little steam. It cuts off automatically if you don’t use it . It takes forever to heat up. It doesn’t get wrinkles out. I am very disappointed in this iron. It is not the Classic. Maybe it’s just defective but I don’t think so.",
      "rating": 1.0,
      "verified": true,
      "author": "farmer jane",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Heavy pressing!",
      "text": "Classic iron, apparently based on the old GE design that everyone's mom and grandma had. Weighty enough to get the wrinkles out but still light enough to handle. Temperature guide in both English and Spanish, plus a handy window on the water level. In my experience, so far, so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Vincent Selinko",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Rare find!!!",
      "text": "As other reviewers have said... this iron is a throw-back to a time when products were built to feel heavy in the hand and have enduring quality. Have used this iron for several months and no issues at all. It feels very good in the hand. Has a window for water fill-up and a nice long cord. You can keep the $100+ irons.",
      "rating": 5.0,
      "verified": true,
      "author": "KY Boy",
      "helpful_votes": 2,
      "publication_date": 20170423
    },
    {
      "title": "I like this heavier iron better than the other one I ...",
      "text": "So far, I like this heavier iron better than the other one I own. The weight just makes ironing jobs a bit easier since you don't have to press down as hard. The only things I dislike is the location of the water hole and the fact that the hole doesn't close or have a lid. Water DID spill out a bit when it fell on its side. However, as far as ironing jobs go, it seems to be pretty good.",
      "rating": 3.0,
      "verified": true,
      "author": "Ira",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "Heavy and pretty solid",
      "text": "Easy to use and control. Only complaint is that is sounds like the iron has a rough spot when it slides along my clothing. I have not noticed anything catch yet and have used it numerous times. If I were ironing silk or something very nice or fragile I might - just not.",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Heavy construction!",
      "text": "The weight of this iron will make ironing easier as it does not require pressing down on the iron to make good contact with the clothing. Remember the good ole days. Dislike, if left plugged in to power and temp set to off the iron will flash the power light. To turn the iron on again it must be disconnected from power and connected again!",
      "rating": 5.0,
      "verified": true,
      "author": "Elmer A.",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Goodbye Amazon",
      "text": "Goodbye Amazon. I will shop at Brick and Mortar stores from here on in. This is not the first time I have received a defective product. This iron was obviously used. The seller did a poor job of cleaning the plate. The whole reason I purchased a new iron was because my plate from my old iron was dirty and could not be cleaned. This was sole as a new iron and it clearly was not!",
      "rating": 1.0,
      "verified": true,
      "author": "Jeri Miller",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Last Blast of a great product",
      "text": "I'm glad I am probably one of the last people to want this item. Nobody irons clothes anymore and this model which used to be another company, is not the same anymore. It was used by professional laundries. Maybe it was GE ???",
      "rating": 4.0,
      "verified": true,
      "author": "Marion",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "It dumps water out or spits out too much water",
      "text": "The steam function is an absolute MESS. Not overfilling it, but it spits out huge amounts of water droplets with the steam and also leaks water. It is less than a year and I believe it is starting to be rusty inside as well.",
      "rating": 1.0,
      "verified": true,
      "author": "Darth Mom",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "It's a great Iron. When I saw the picture and description ...",
      "text": "It's a great Iron. When I saw the picture and description I quit looking. My mother had one just like it and it last for years. In fact she was still using it when she died at age 85. I hope mine last that long. My son buys two of them at time as they are heavy and his wife has to crease his jeans for work and it doesn't need much pressure.",
      "rating": 4.0,
      "verified": true,
      "author": "MLS",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "Disappointed! Package appears to have been opened!",
      "text": "I bought this iron as a replacement for one that I have just like it. ( I love the old one, but it fell off the ironing board). I haven't used the new one yet, but am a bit disappointed because it looks like it was a return. The packaging appears to have been tampered with. Not sure if I am going to send it back or take my chances using it!",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "My favorite iron ever",
      "text": "Sturdy and heavy enough to get the wrinkles out without me having to press really hard. Love this iron, and this is my 3rd one. Gave the first one to Mom, dropped the second one multiple times before I broke it.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelley Sumrall",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "My wife loves these irons",
      "text": "My wife loves these irons and has used them for years. I use a modern Teflon coated iron but she will have none of it. She wants her beloved HEAVY steel Black+Decker. I am grateful that they still make it. She burns them up after 5 or 6 years of much use. She says the weight is needed for a crisp finish. Hopefully Black+Decker never discontinues these.",
      "rating": 5.0,
      "verified": true,
      "author": "markb",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Bought for the retro look, but love the functionality",
      "text": "I bought this for it's slightly retro look. I love the weight, how it fits in your hand, and the shape/size of the iron. It makes it easy to use and navigate into the nooks of the clothing. It gets hot quickly, but is slow to cool. I appreciate automatic shutoff feature, since it does get so hot. Also, the steam feature is handy. All-around great iron that is easy to use!",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsey",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Ecellent product",
      "text": "09/20/20 i've been using this Black & Decker style iron for about 30 yrs .My grandmother,my mom used this style .I highly recommend 100 % for the product it self and price.",
      "rating": 5.0,
      "verified": true,
      "author": "MINGO MEDRANO",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Best iron available!!!",
      "text": "This iron is great for all my quilting needs. The weight helps with the ironing...getting nice crisp seams. It has shut off so if you do forget to turn it off it will shut off automatically. I won't have another iron until forced and then I hope I have few stock piled.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonnie Schaaff",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Disappointed with this product.",
      "text": "I have had this iron previously and really enjoyed using it for pressing my quilt pieces. Out of the box this iron gave off popping sounds and that continued for the next two weeks. Twice, a burst of steam was strong enough to scare me into thinking I could get burned. I returned it although I had read several good reviews. Maybe mine was a lemon.",
      "rating": 1.0,
      "verified": true,
      "author": "Brenda K. Hancock",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "OLD STYLE",
      "text": "My wife loves this iron as it beats the other more expensive plastic as it is heavier so clothes come out wrinkle free and you can't beat the price,It.s also cheaper than walmart ! It is like the old type my mother use to use when I was growing up in the 70's.Well I now owned this iron for a little over 4 years (09/2018) it finally broke down but was used at least 2 X a week ,so I would say this is pretty good,so I just purchased a new one today hoping to get at least another 4 + years out of it compared to the cheaply made $80.00 + irons,For under $30.00 I got my moneys worth.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20150628
    },
    {
      "title": "An extremely annoying iron",
      "text": "I had a Black & Decker Classic for years and I LOVED it. No frills, just a good solid iron. Unfortunately, the replacement I just bought is far inferior. It leaks water out the bottom, but almost never manages to produce steam. It heats very slowly and when I am actively using it, the auto-shutoff is constantly turning off. This iron usually never gets hot enough to iron cotton, and even when it does, it shuts itself off so quickly the temperature is always uneven. I do NOT recommend this iron. It is a great pity that Black & Decker ruined a fantastic appliance.",
      "rating": 3.0,
      "verified": true,
      "author": "A. J Terry",
      "helpful_votes": 8,
      "publication_date": 20120215
    },
    {
      "title": "Used.. again!",
      "text": "Didn’t get the chance to use it. It arrived used, again... there where burn marks and scratching. Another item from amazon that is sold for new and is not. What is up with that?",
      "rating": 1.0,
      "verified": true,
      "author": "Dimitra",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "happy camper",
      "text": "wife had one just like it that lasted for years and this one she even likes better just the right size and weight for her",
      "rating": 5.0,
      "verified": true,
      "author": "happy camper",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Removes wrinkles very well and fast.",
      "text": "It's very heavy. That's what makes it so good at removing wrinkles. I love it for sewing, but I couldn't iron for hours with it. I was disappointed that the sole isn't coated with teflon. It cuts off automatically. That's very important to me.",
      "rating": 4.0,
      "verified": true,
      "author": "Dolores Johnson",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Good, reliable iron",
      "text": "According to Amazon I ordered one of these almost 9 years ago. My wife, a sewing nut, has been very happy with it until it quit a couple of days ago. I just ordered another. I expect the same service out of the new one.",
      "rating": 5.0,
      "verified": true,
      "author": "reb55",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "I love this iron for sewing!",
      "text": "It might be old fashioned, but I like how heavy this iron is, and the auto shut-off. A lot of sewers said they didn't like it because it shut off. I find it, not a problem and the heavy weight really gets into corners and fine detail. LOVE IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn Hypke",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "A good, dry iron.",
      "text": "It's an iron, it does the job, it has a warning light for forgetful people like me. It is a tiny bit heavier than my previous dry iron (that's how I use it, dry) but really no problem. Heats up quickly, cools down just as fast.",
      "rating": 4.0,
      "verified": true,
      "author": "Emailia Web",
      "helpful_votes": 2,
      "publication_date": 20170802
    },
    {
      "title": "Steam Iron",
      "text": "This old fashion iron works well with steam or without. Glides thru the cloth without sticking. At times it does trip from the bottom when steaming but not too often.",
      "rating": 4.0,
      "verified": true,
      "author": "thorwonder",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Need a wash cloth to dry water from clothing!",
      "text": "I was very disappointed with this iron. Filled it to the fill line for steam and it spews water on your clothes! I set this one to the side to use as a backup however, I will not use water in this iron again! I purchased a sunbeam iron and love it! Doesn't leave water spots on clothing!",
      "rating": 5.0,
      "verified": true,
      "author": "Charleston C. Guyton",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "... Black + Decker Classic Iron for 15 years and loved it. I finally replaced it a few months ...",
      "text": "I had a Black + Decker Classic Iron for 15 years and loved it. I finally replaced it a few months ago. The new product I received is not of the same quality. The button for steam does not release easily nor does the iron itself seem to be as sturdy as the original. I am very disappointed and would have returned it, but unfortunately missed the return by date.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20170325
    },
    {
      "title": "Old School Ironing",
      "text": "Got this for my mother who irons like crazy. She has had so many problems with irons over the years--leaking, turning off too quickly, not getting hot enough. Her review on this one so far is very good. No leaks. Plenty of heat. And even though it is kind of heavy, it has a smaller base plate that works better on collars/shoulders than most! 7 Months later--Spectacular iron! No leaking. No problems at all. MUCH BETTER than its pricey competition. That is the word from my mother who uses it several times a week for hours at a time. I have upgraded my rating to 5 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "HAMM",
      "helpful_votes": 4,
      "publication_date": 20130530
    },
    {
      "title": "steam holes rust.",
      "text": "I use distilled water and the 3rd time I use the Iron the holes were full of rust. Loved the Iron hate the rust. Its junk to me. My cloths were getting rust marks on them. No way to clean the holes. I would not recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Connie W.",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Perfect iron!",
      "text": "This iron is just what I was looking for. No frills, no extras, just perfect temperature settings and steam when I want it. I would recommend using only distilled water for steam even though it says tap water is okay. The weight is hefty and it feels nice and solid. Happy I purchased this!",
      "rating": 5.0,
      "verified": true,
      "author": "carol p",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "The Classic, Basic Iron.",
      "text": "I purchased this iron to replace my Mon's old iron which had quit heating suddenly. As my mom is elderly I was looking for something simple that she could use without having to resort to a large book of instructions, or a lot of confusing settings. In short this was exactly what I was looking for a classic electric steam iron. It works and works well. This i a three pound iron and the heat is quick and the steam is produced in large amounts. Easy to use and the weight makes pressing a once over affair. In short if you need an iron and there are always times when you will, this product will fit the bill.",
      "rating": 5.0,
      "verified": true,
      "author": "R. S. Sayes",
      "helpful_votes": 0,
      "publication_date": 20130807
    },
    {
      "title": "Mediocre...gets the job done eventually",
      "text": "I was expecting more out of this iron. Its not bad, but its not quite what I imagined it to be. For starters its a bit heavy and clunky to use. I also find that it doesn't give me a perfect wrinkle free iron unless I'm using one of the higher settings. I also put LESS water than the max capacity line, but water still manages to come out every few minutes and leak onto my clothes as I'm ironing. Although it can be annoying to use, if done right it will get the job done but I was hoping for a lot better as it looks like it is meant to do more",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160613
    },
    {
      "title": "Not made as well as the original!",
      "text": "Some parts are not as good a quality as the original, decent replica, but not as sturdy, parts coming loose that are made of plastic.",
      "rating": 3.0,
      "verified": true,
      "author": "Rebecca Gorrell",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Haven't had any issues with this in over a year.",
      "text": "This is a great and durable iron. I really like the safety feature of it turning off if it falls over. The only downside for me is that it does not have a steam on demand button, which I really like for those tough wrinkles.",
      "rating": 5.0,
      "verified": true,
      "author": "christian j jimenez",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Awful!!!",
      "text": "I only use Black & Decker irons, and this particular brand. This iron is horrible, it will not hold any water!! He leaks all over my floor in the laundry room.",
      "rating": 1.0,
      "verified": true,
      "author": "4eversunshine",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "This is what an iron should be!",
      "text": "This iron is great! It’s the old fashioned steam iron that’s heavy enough to make a good crease but not too heavy. It’s perfect. Old school!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Wouldn't purchase again",
      "text": "Do not like feature that the light keeps blinking when iron is plugged in even if iron is off turned off. Also it makes a loud noise every now and then when plugged in. Need to unplug iron if not in use. Would not purchase again.",
      "rating": 3.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 0,
      "publication_date": 20201029
    },
    {
      "title": "So far so good",
      "text": "I haven't had it that long, but it is nice and heavy, and gets pretty hot. It also shuts off if you leave it on the ironing board for too long, which is a nice feature.",
      "rating": 5.0,
      "verified": true,
      "author": "Teeka Grishnar",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Old-timely look and quality",
      "text": "I could iron all day with this puppy! I bought it for the retro look, I love the weight and the results. My husband’s shirts look like they just came from the dry cleaner. Ahh, it’s not THAT heavy, just solid. Old-fashioned quality, an iron with substance! Even though the sole plate is not perfectly smooth, it works perfectly well. I am very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Cameron",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Different Temperature Controls for different materials.",
      "text": "It turns off on its own in about ten minutes. Irons well. It reminds me of the old irons that were around many years ago. Good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Martha Czajkowski",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Disappointed",
      "text": "This is the 1st Iron that I have bought in many years. Not sure if it is defective but it doesn’t’ get hot enough . Even on the last number. Only used it for cotton. Does it need to warm up ? Never had that problem . I don’t want to go to the trouble of sending it back . Next time if I buy another iron I will go to the store where I can return it in person.",
      "rating": 1.0,
      "verified": true,
      "author": "Ruth Pearstein",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Great iron!",
      "text": "I really like this iron, it shuts itself off if I forget to turn it off which is great for safety. I works great and glides over fabric. It heats up fairly quickly to allow me to get the job done.",
      "rating": 5.0,
      "verified": true,
      "author": "Woodworking Creations & More",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "No Frills: Just hot, steamy, action!",
      "text": "It doesn't have any timers, any flashing lights, any super-duper settings for \"moleskin\" or whatever fancy stuff is out there. It is just a good, solid iron. And you don't have to use angel's tears or bottled-water from a glacier in The Alps for steam. Get this - you can just add tap water! And it works. You need an iron? This is an iron. It's outlasted the fancy ones that now reside in my cupboard of shame. (PS - I am a man, and I iron a lot. I actually enjoy it. That's for all you single ladies out there).",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20140425
    },
    {
      "title": "Heavy!",
      "text": "My other steam iron was so much lighter. This one is quite heavy and I didn't notice the weight. It does a great job on clothes though. Just wish it wasn't so heavy.",
      "rating": 3.0,
      "verified": true,
      "author": "Claudette S",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Great iron! Won't be going back to anything else after this.",
      "text": "Really impressed with this model. Does everything that all of the other similarly priced more modern looking models do, only with the added benefit of the weight of a more traditional iron. Plus, it looks great. Wouldn't be worth it just for the design alone, but it's got it all so it's a win-win.",
      "rating": 5.0,
      "verified": true,
      "author": "Vic",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Great iron",
      "text": "This is my favorite iron, it is a replacement for the same iron I wore out. It is heavy and makes my weekly ironing go so smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Poor Quality",
      "text": "This product breaks down from the inside and rusts after 2 months of use. No one will assist with replacement or refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph J. Carbonneau",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Good weight for ironing out wrinkles!",
      "text": "The weight of the iron was good, and the small size makes it easier for ironing. Not a lot of bells and whistles, so not much could go wrong with it.",
      "rating": 5.0,
      "verified": true,
      "author": "TH in DC",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Fooled by the appearance, not a great design",
      "text": "I bought this because it appeared to be made the way an iron would have been made 30 years ago. However, the performance is really kind of terrible. The steam function doesn't actually work and I have to use a spray bottle.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Lipsey",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Bad steam holes in sole plate",
      "text": "Piece of garbage. I've read the other reviews and wonder why no one mentioned that the steam hole on the sole plate are sharp as razors and actually cut some hand embroidery that I was ironing. The edges around the holes are so sharp that if you ran your fingers around the edge of the holes you'd receive a bad cut. They grab the edges of fabric and crinkle them rather than sliding across like an iron should. The iron is nice and heavy, heats well and has easy to access controls - but the sharpness of the holes makes it useless - not to mention dangerous to what you are ironing.",
      "rating": 1.0,
      "verified": true,
      "author": "Good Books are Important",
      "helpful_votes": 0,
      "publication_date": 20150122
    },
    {
      "title": "Gets super hot",
      "text": "This thing is heavy. Just add water and it steams like a train. Gets the toughest wrinkles out. Also can be used to iron delicate fabrics on low heat. The steel is non stick and glides over clothes effortlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie Q",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Perfect Iron for Me..",
      "text": "Love this iron... its heavy, made well,and is the old fashion kind,and not some odd shape like new irons...",
      "rating": 5.0,
      "verified": true,
      "author": "LULU",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "She loved it",
      "text": "It's the same iron my mother used for many years. I bought it as a gift for my granddaughter and she was very pleased. That's exactly what she wanted",
      "rating": 4.0,
      "verified": true,
      "author": "doris",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "too heavy, doesnt slide across clothes",
      "text": "Hated this iron. Returned immediately. Call me new school because this old school iron was just way too heavy. Maybe it would have been ok if it slid across clothing but the finish on it..or lack thereof makes it impossible. Its like ironing with a paper weight. It does get hot, but im sure I can find a lighter easier to use iron that does the same thing.",
      "rating": 1.0,
      "verified": true,
      "author": "Destiny",
      "helpful_votes": 2,
      "publication_date": 20150817
    },
    {
      "title": "Takes little muscle!",
      "text": "This iron is great!! Gets extremely hot and because it is not coated, it requires little pressure when using. Great steam. Not a digital iron so minimal chance for technical issues. Downside is when you get a burn, it is a good burn.",
      "rating": 5.0,
      "verified": true,
      "author": "shelly b",
      "helpful_votes": 0,
      "publication_date": 20190828
    }
  ],
  "product_meta": {
    "title": "BLACK+DECKER Classic Steam Iron, F67E",
    "description": "BLACK+DECKER brings simplicity and style back to ironing with the Classic Steam Iron. Families have relied on this iron design for generations, and while the look is retro, the features are modern to give you fast, effective garment care. The handy fabric guide printed right on the iron makes it simple to select the proper setting for each garment. The durable aluminum soleplate glides smoothly over all types of fabrics to smooth out wrinkles in no time. Plus, you can switch on the steam to help iron away tough creases and wrinkles, or turn off steam to dry iron delicate fabrics such as silk. A long history of dependable performance makes BLACK+DECKER the trusted name in clothes irons.",
    "rating": 4.4,
    "feature_bullets": [
      "Easy Glide - The aluminum soleplate is built to last, with a smooth, nonstick finish that glides over all fabric types to quickly remove wrinkles A special groove near the tip of the soleplate lets you navigate easily around buttons and collars",
      "Anti-Drip - The iron is engineered to prevent dripping by closely regulating water temperatures. 7 Temperature Settings - The intuitive temperature dial and fabric guide make it easy to get the perfect heat setting based on fabric type Plus, the dedicated “OFF” button provides convenient peace of mind",
      "Automatic Shutoff - For added peace of mind, the iron shuts off when left unattended for 30 seconds on its side or soleplate, and after 8 minutes on the heel rest Plus, a power indicator light tells you when the iron is plugged in",
      "Steam or Dry Ironing - Switch on the steam setting to help iron out tough wrinkles, or turn it off when dry ironing delicate fabrics",
      "Refer to the PDF attached below in Technical Specification for User Manual"
    ],
    "specifications": {
      "Product Dimensions": "5.2 x 10.1 x 6.22 inches",
      "Item Weight": "3.2 pounds",
      "Department": "Small Appliances",
      "Manufacturer": "Black+Decker",
      "ASIN": "B001RJTQ8U",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "F67E",
      "Customer Reviews": "4.4 out of 5 stars3,272 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#9,045 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Finish Types": "Black",
      "Is Assembly Required?": "No",
      "Number of Pieces": "1",
      "Warranty Description": "Two-year warranty.",
      "Batteries Required": "No",
      "Included Components": "Iron",
      "Import Designation": "Imported"
    },
    "categories": [
      "Home & Kitchen",
      "Irons & Steamers",
      "Irons"
    ],
    "price": 24.99
  }
}