{
  "website_summaries": [
    {
      "verdict": "Outstanding price point for a large number of baseballs you can use for practice.",
      "pros": [
        "For the price you'll pay, the quality of the baseballs will give you a good value",
        "Includes 24 standard size and weight baseballs in a convenient bucket to carry them",
        "Works best for younger players who won't put a lot of stress on the baseballs with high-powered swings"
      ],
      "cons": [
        "Not a game-quality ball",
        "Includes a cork center so not overly durable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "These baseballs have very thin flat seams. In the ...",
      "text": "These baseballs have very thin flat seams. In the attached photo ball on the right is the Rawlings ball. The one on the left has real seams.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeffrey Cohen",
      "helpful_votes": 22,
      "publication_date": 20180411
    },
    {
      "title": "Perfect for my 10 year old!",
      "text": "After reading some of the reviews, I was super nervous about buying these but my 10 year old needed to practice his batting. Well...after three months of regularly hitting these balls into a net, they're holding up perfectly fine. Yes they have some wear and no, they're not the best balls in the world, but for the price, I'm very pleased. Maybe some of the reviewers have older kids who hit much harder, but for my kid, they're perfect. I've attached a photo, this is the average wear on these balls after three months....not bad in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Roche",
      "helpful_votes": 28,
      "publication_date": 20170412
    },
    {
      "title": "It's a bucket of baseballs. You get a bucket ...",
      "text": "It's a bucket of baseballs. You get a bucket, and 24 baseballs. They are the cheapo kind (synthetic cover), but for practicing with the kids, that's all you need.",
      "rating": 5.0,
      "verified": true,
      "author": "Fauxmaha",
      "helpful_votes": 8,
      "publication_date": 20180515
    },
    {
      "title": "Too rubbery and soft",
      "text": "Just don't feel like real baseballs. Cover and stitches are too smooth, and stitches are too flat. They also feel too soft- I can put a dent in them just using my thumb. I found some that seemed too light or heavy so I weighed them- one was 5.01 oz the other 5.33 oz. Overall no good for fielding or throwing, I'll only use them off a tee or for soft toss.",
      "rating": 1.0,
      "verified": true,
      "author": "AmazonPrime Customer",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Great Practice Balls",
      "text": "Purchased the Rawlings Official League Recreational Grade OLB3/R8U Baseballs, Bucket of 24 Balls for my husband and 8 year old son to use as practice balls. These baseballs are great and affordable, especially compared to others. These are not game quality balls but work great for practice and when a ball finds it's way down the gutter, it isn't a big loss. We've actually purchased 3 buckets of these balls and each one has been consistent.",
      "rating": 5.0,
      "verified": true,
      "author": "Blue Beckett",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Great and cheap way to focus on skills and stop ...",
      "text": "Great and cheap way to focus on skills and stop chasing down baseballs. These are fine for younger players who are just starting to develop (5-9) but probably won't stand up to what older kids can dish out. Again, these are not pro quality by any stretch but they are CHEAP, and perfectly suited for practice with younger players.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 7,
      "publication_date": 20171012
    },
    {
      "title": "Good throw away baseballs",
      "text": "After a single use they are showing some wear already. However, these were bought with the full intention of being throw away baseballs. I was hoping to get a little lucky that they would last longer. At this rate I dont think the majority of these baseballs will make it to the end of our baseball season.",
      "rating": 4.0,
      "verified": true,
      "author": "BvsP",
      "helpful_votes": 4,
      "publication_date": 20170520
    },
    {
      "title": "DENTED BALLS WITH SOFT SPOTS",
      "text": "Finally got around to taking the kids for some hitting practice and we open the bucket to find about a half dozen of the balls with dents and soft spots. Not happy to say the least! Maybe I got a defective batch, I’m not sure 🤔 They definitely looks like someone practiced with the balls before they shipped them off.",
      "rating": 1.0,
      "verified": true,
      "author": "stephanie george",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Very good for youth batting practice",
      "text": "These balls are good for batting practice because they don’t have as much exit velocity as a standard ball, so they are safer if you don’t have a pitching screen. They also are not ruined by wet grass. They can lose shape a little if balls are crushed, but that is ok for BP.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff M. Lewis",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Good for frequent practice",
      "text": "Good budget balls for frequent practice. There aren't game balls by any stretch, but the work for hitting off the tee and soft toss",
      "rating": 5.0,
      "verified": true,
      "author": "Niphaphone",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Mixed feelings",
      "text": "They are really nice balls but just seem softener then would like. They are not holding up well in our pitching machine at all",
      "rating": 3.0,
      "verified": true,
      "author": "dmcbride",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Decent for price, don't expect longevity",
      "text": "I liked that they were cheap for the QTY provided, bucket is good quality too for reuse possibilities. Honestly, the balls are cheaply made and already show witness marks and some fraying of the stitching after 3 days of usage. Use for ages 7 and below, older kids (my 9 year old) will tear them up. For by 4 year old it's great as he hot hit by a pitch and didn't worry about it due to softness! Recommend for younger kids as mentioned, not for serious play on gravel.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Super value",
      "text": "I bought these to make a Baseball Christmas tree. They had a bit of odor which subsided but that is common with these materials. I am very happy with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Gale Saenz",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Not Durable",
      "text": "Balls started splitting after first use in the batting cage. My child is 9 and not a hard hitter. I saw reviews saying others had experience this too.",
      "rating": 2.0,
      "verified": true,
      "author": "Mom",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Bargain on baseballs",
      "text": "Got these for our grandsons birthday. He was so busy with practice and games he hadn’t had much of a chance to use them. Now with the Covid 19 lockdown you can’t go to the ballfueld so they are just waiting to get the chance to use them.",
      "rating": 5.0,
      "verified": true,
      "author": "Peggi",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Good value.",
      "text": "These are practice balls not game balls. They are very good for practice. Game balls are much more expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Rawlings is best value in practice baseballs.",
      "text": "Best price on the internet for Rawlings practice baseballs. Quality product!",
      "rating": 5.0,
      "verified": true,
      "author": "Phil Fontenot",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "It was a Gift",
      "text": "I Purchased this For My Local School, Help Out For The New Baseball Team.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny Paul",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Okay for kids",
      "text": "The cover on these balls is not very durable. I’m still happy I bought them because you get so many for a low price. They are great for young kids. If you have teenagers or adults using them you might want a higher quality ball.",
      "rating": 3.0,
      "verified": true,
      "author": "Jason L.",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Not for divisions older than coach pitch",
      "text": "These are not leather baseballs. These are the slick balls that are not the correct weight and feel. Do not recommend for anything outside of tall or maybe coach pitch.",
      "rating": 2.0,
      "verified": true,
      "author": "Coach Jon",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Lots of balls",
      "text": "My kids and I like to play catch from time to time... I'll never run out of baseballs for the rest of my life.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Balls serve their purpose",
      "text": "Pleased overall. The balls are of low-average quality, a couple of them are cut up now. Can't go wrong for the price though. But been using them for batting practice with team to save the better league balls we've been issued for fielding practice/games.",
      "rating": 4.0,
      "verified": true,
      "author": "grhqofb5",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "JUNK. Get real leather ones first, because you will",
      "text": "Better to keep the bucket and throw the ball away. Junk , if a child can hit , these balls get rips and become crap.!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Some rubber",
      "text": "These do have some rubber to them, not fully “real baseballs”",
      "rating": 4.0,
      "verified": true,
      "author": "babs",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "it's a bag o' balls.",
      "text": "they're fine. not leather baseballs, but nice to have a bunch of cheap balls for a nice game of catch, etc. can't go wrong for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "BrilliantBuyer",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "great practice",
      "text": "my son uses these almost daily! great product for great price",
      "rating": 5.0,
      "verified": true,
      "author": "Gig94Em",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Not durable, cover rips easy! Disappointed.",
      "text": "Used them for 30mins hitting batting practice with my 5th grade son. After a half hour, 30% of the baseballs had cuts in the covers. My son is not a power hitter... disappointed in the quality after one use.",
      "rating": 1.0,
      "verified": true,
      "author": "CA NW",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "I would recommend to any level of player",
      "text": "It is a great thing to buy and I would buy more of them because the are very durible",
      "rating": 5.0,
      "verified": true,
      "author": "TAnn",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Really Nice",
      "text": "These balls work great with the Blue Flame pitching machine we bought at the same time. My kids are 9 (boy) and 7 (girl). They clobber these balls all over the fields. The balls get dirty and wet and hold together just fine. The bucket closes TOO well, if anything. Hard to open. Otherwise, a really quality set at a good price.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20150729
    },
    {
      "title": "Great price for a quality baseball",
      "text": "Great bucket of balls, my 5 year old puts them up on his tee all day hitting them into our cage!",
      "rating": 5.0,
      "verified": true,
      "author": "Mommaof6",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Good Practice Ball for 8U for Price",
      "text": "Overall, a good practice ball for 8U for the price. I was able to buy it at $39.99 or $1.67 per ball. Great deal at that price. It's not real leather, so it does scuff easier and is softer than real leather baseballs and gets a little slick. I would use this for pitching practice. But it's a great general ball for fielding and works well in machines. Good buy for general practice balls for younger teams.",
      "rating": 4.0,
      "verified": true,
      "author": "Bil Fay",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Good baseballs for Little League",
      "text": "Shipped fast. Great product just wish the bucket was taller.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Watson",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Good quality balls and very affordable",
      "text": "WAAAY Cheaper than Dick's or even Play-It-Again Sports. Good quality balls and very affordable.",
      "rating": 5.0,
      "verified": true,
      "author": "JJewhu",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Balls.",
      "text": "What can you say? There is nothing better than a bucket of balls... that you can take outside and hit with a bat.",
      "rating": 5.0,
      "verified": true,
      "author": "William H. Parks Jr.",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Useless Garbage...Do Not Buy",
      "text": "These balls are garbage. Most are out of round and when you hit them ONCE the covers tear. I’m embarrassed to bring them to practice. I’m doubting they are actually made by Rawlings, seem more like a Chinese knockoff.",
      "rating": 1.0,
      "verified": true,
      "author": "Smoke B.",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Spend a little more and get leather",
      "text": "Not my favorite ball obviously. I ordered these on accident but thought I’d give them a shot. They just don’t have the same feel as a genuin leather ball",
      "rating": 2.0,
      "verified": true,
      "author": "Chuck Berry",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Great buy!!",
      "text": "This was a great buy, I have two sons that play baseball (and a dog that likes to eat baseballs) so we have had a challenging time keeping up with the balls. This has a lot of balls and the bucket keeps them all together and away from the dog! Also, this was the best price I have ever seen on baseballs. Great buy and I would recommend this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki N",
      "helpful_votes": 0,
      "publication_date": 20140212
    },
    {
      "title": "Damaged Balls on arrival",
      "text": "I know they are recreational balls, but within minutes my 8yo son found 3 balls with inch long slices in the cover. Had to have happened from manufacturing, the slices are from something very sharp. I haven't gotten to really look at them but I'm sure there are more if he found 3 that fast. I won't be buying these again.",
      "rating": 2.0,
      "verified": true,
      "author": "Trainer",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Worth every penny",
      "text": "Came in time . The balls are very hard and durable .",
      "rating": 5.0,
      "verified": true,
      "author": "Sheytoon",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Solid balls for young kids",
      "text": "We bought this so my young boys could learn how to play baseball and not have to keep chasing 1 ball down after every hit. The balls held up well all season and some have even survived my puppy chewing on them. They feel softer than \"normal\" baseballs, but still are solid enough that they will hurt some if you get hit with one and you're not ready for it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason McDonald",
      "helpful_votes": 0,
      "publication_date": 20140521
    },
    {
      "title": "Four Stars",
      "text": "These are ok practice balls for hitting off the tee .",
      "rating": 4.0,
      "verified": true,
      "author": "jonathon burnett",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "Great balls of fire!",
      "text": "This was a good value. I needed a bucket of balls to help my son with batting practice and this beat chasing down one at a time. They are well made for this application.",
      "rating": 5.0,
      "verified": true,
      "author": "JustinJuk",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "It's a bucket of balls. What could go wrong?",
      "text": "No seriously. If you have to read the reviews for this product it is not for you. It is a plastic bucket full of the American pastime.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "profesional baseballs",
      "text": "Very fast service. Balls arrived in good shape. I have pitching balls. Hitting balls. Throwing balls. I'm all set to have a fabulous October.",
      "rating": 4.0,
      "verified": true,
      "author": "Johnny Depp",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Feel like a kid again",
      "text": "A bucket of decent-quality baseball made my husband feel like a kid again. A kid who forgot how to throw or hit a baseball. But that's ok, because he now has two dozen brand-spankin' new baseballs to practice to his heart's content!",
      "rating": 5.0,
      "verified": true,
      "author": "Divamac",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "Just what we wanted.",
      "text": "These balls were purchased to be send in Shoe Boxes as a part of Operation Christmas Child by Samaritans Purse. I know that the boys who got one were really excited!! The price was very reasonable and with \"Prime\" very easy to order 3 buckets.",
      "rating": 5.0,
      "verified": true,
      "author": "J. C. Keim",
      "helpful_votes": 2,
      "publication_date": 20160207
    },
    {
      "title": "Will not buy again.",
      "text": "Bought these for my son who plays baseball and he notes that these baseballs are not great quality. After a practice round of hitting and fielding, a couple of the baseballs are already starting to split at the seams.",
      "rating": 3.0,
      "verified": true,
      "author": "Always_Matilda",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "23 instead of 24 balls",
      "text": "I received only 23 balls instead of 24 (2 dozen). I was stiffed one ball. Unfortunately by the time I realized it I had already written my name on all the balls so I couldn't return it. UPDATE: I complained to Amazon and got a refund of $3 so I'm changing this from 2 to 4 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Desperado",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "Five Stars",
      "text": "Quality baseballs, no running around for baseballs because of the way Lux Sports practice net is designed.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Excellent Balls for the Price.",
      "text": "Great Balls. The kids use them for practice and while not regulation balls in terms of quality they are good enough to get a summer or 2 out of them. Happy with the purchase...",
      "rating": 5.0,
      "verified": true,
      "author": "W. Lang",
      "helpful_votes": 0,
      "publication_date": 20170626
    },
    {
      "title": "Great",
      "text": "Came quickly and perfect for practicing with my h9 year old son. Thanks !",
      "rating": 5.0,
      "verified": true,
      "author": "EJ Gross",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Must for any coach",
      "text": "These are not leather baseballs, but when you coach a baseball team, there are only a few times a nice leather ball are needed. These withstand punishment from soft toss against a fence, hitting off a tee, and they don't scuff and the laces don't fray as easily as leather balls do. I have 3 buckets of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Rogerson",
      "helpful_votes": 0,
      "publication_date": 20140502
    },
    {
      "title": "These are synthetic and good for pitching and soft toss",
      "text": "These are synthetic and good for pitching and soft toss, They don't hold up to repetitive hard hitting and they will not travel as far Better for cages and pitching in my opinion But at a good price, you can never have enough as they always seem to disappear",
      "rating": 3.0,
      "verified": true,
      "author": "guido13",
      "helpful_votes": 0,
      "publication_date": 20160417
    },
    {
      "title": "Great balls of Fire.",
      "text": "Great for the Little League team at the start of the season.",
      "rating": 5.0,
      "verified": true,
      "author": "Rez Ted",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Five Stars",
      "text": "This is our second, maybe third order of these for a 7 year old that loves baseball.",
      "rating": 5.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Practice Balls",
      "text": "Purchased 2 buckets for 9 year old baseball team. Used these ball last year for fielding and batting practices. Balls held up for 1 year and then started to warp. Looking to get another year out of the new balls. Gave 5 stars because of price.",
      "rating": 5.0,
      "verified": true,
      "author": "Riptide",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "Great value",
      "text": "Great baseballs and great price. Not game quality but perfect for batting practice.",
      "rating": 5.0,
      "verified": true,
      "author": "Latter",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Great product for the price",
      "text": "My husband coaches farm little league, he was constantly losing balls and was down to 2. I bought this after reading reviews and he was happy with it. Its great for batting practice. Not the best quality but for the price and for what they were being used for, definitely served their purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "taylalynne",
      "helpful_votes": 0,
      "publication_date": 20160628
    },
    {
      "title": "... for my 8 year old son and they are awesome. Good quality balls--not mushy or soft",
      "text": "We bought these as birthday present for my 8 year old son and they are awesome. Good quality balls--not mushy or soft. They have held their shape after hours of batting practice. Good investment for nall players.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle O'Mamma",
      "helpful_votes": 0,
      "publication_date": 20160703
    },
    {
      "title": "Awesome deal for an awesome product!",
      "text": "Great deal! Dicks wanted 70 bucks for the store brand of baseballs. I dont even want to think about how much official balls would cost there. This shipped fast and the quality is perfect. these balls go for 6-8 bucks a piece, so this is great! Im using it for home run derby at the baseball field with some friends. Makes it easier that you dont have to hit a ball or two then chase after it to hit it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Acember",
      "helpful_votes": 0,
      "publication_date": 20140623
    },
    {
      "title": "Great for basic batting practice",
      "text": "I needed baseballs so I could work on my swing with my brother and it’s a lot harder to find quality baseballs for a good price. These aren’t amazing quality but they get the job done.",
      "rating": 4.0,
      "verified": true,
      "author": "Vaughn Y.",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Not the best purchase I ever made.",
      "text": "Balls are dead. Not a good ball to use on the field. It would take Alverez to put one out. They are good for the backyard though. Can’t hit them very far.",
      "rating": 2.0,
      "verified": true,
      "author": "Bdubya",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Perfect baseballs to use for practice",
      "text": "Perfect baseballs to use for practice. Just finished a season with 6-7 years kids. Had about 20 hours of practice. The balls held up great.",
      "rating": 5.0,
      "verified": true,
      "author": "ricihie miller",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "outstanding value",
      "text": "We needed a bucket of baseballs for our two boys age 7 & 9. After looking all over we decided to try Amazon and were amazed to find this gem! This is an outstanding value for all the baseballs you get! They've already taken them to the park several times,we will get a lot of fun from these baseballs!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20140422
    },
    {
      "title": "Cracks easily",
      "text": "My son and his two friends bought this bat for 11U baseball. His two friends’ bats cracked within the first few months. My son’s bat cracked on June 7, just past the one-year warranty of June 4. Rawlings would not replace it. It is not with this kind of money, as it clearly does not last!",
      "rating": 1.0,
      "verified": true,
      "author": "Baseball mom",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Good balls, great value",
      "text": "Great value. Excellent practice balls for mid level players. We are really happy with this purchase and the price was better that at the usual sporting good stores.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Gutierrez",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "Perfect Product!",
      "text": "Very Solid Baseballs! No Complaints! Good value. Just try not to loose them!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Practice only",
      "text": "The balls are okay for practice only. They don't seem to travel at all.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "EXACTLY as expected and about 2/3 of the price of Dick's or Sport Authority",
      "text": "EXACTLY as expected and about 2/3 of the price of Dick's or Sport Authority assuming that you have Prime for delivery. Not leater, but for our purpose of practicing, who cares. Standing up well to lots of wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Perry",
      "helpful_votes": 0,
      "publication_date": 20151213
    },
    {
      "title": "Fielding and pitching work only. This product will not ...",
      "text": "Fielding and pitching work only. This product will not handle too many hits or harsh play field. Keep dry to maintain leather feel- as this is not leather. Get ROLB1 for your young Bambino for more demanding workouts- hitting, infield etc.",
      "rating": 3.0,
      "verified": true,
      "author": "Stu P. DeWar",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "Five Stars",
      "text": "my boys love them use them to practice for baseball games",
      "rating": 5.0,
      "verified": true,
      "author": "Vivian VonDerLieth",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Great baseballs",
      "text": "Excellent baseballs! Great to have so many in a bucket!",
      "rating": 5.0,
      "verified": true,
      "author": "N. Johns",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Perfect...",
      "text": "If you need a quality practice ball..... this is the ticket!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Busby",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Four Stars",
      "text": "Grand kids loved playing with these balls and eventually losing them all.",
      "rating": 4.0,
      "verified": true,
      "author": "smwoolyu",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Big Bucket of Balls",
      "text": "If you need balls this is the item for you. These are some very nice baseballs.",
      "rating": 5.0,
      "verified": true,
      "author": "vwlover",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "Great product for price",
      "text": "Got this bucket of balls (my third total) for practice with my 9 year old son and 6 year old daughter. These are the right price at $1.67 per ball. That way if one gets lost in the woods it is not the end of the world. They hold up pretty well, but get eaten up in the pitching machine.....",
      "rating": 5.0,
      "verified": true,
      "author": "Carl",
      "helpful_votes": 0,
      "publication_date": 20130709
    },
    {
      "title": "perfect beginners ball",
      "text": "although i'm no beginner, these balls are great for kids wanting to learn or for those like me who just enjoy hitting the cages or off the tee",
      "rating": 5.0,
      "verified": true,
      "author": "Luis subervi",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Five Stars",
      "text": "Great price for 2 dozen baseballs. Not game quality, but great for practice.",
      "rating": 5.0,
      "verified": true,
      "author": "Mpraser",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "Has a good feel when thrown though",
      "text": "some of these ball will break quickly when hit hard. Has a good feel when thrown though. this is not going to be your game ball.These balls are for everyday use. lets say if the dog gets a hold of this one you wont be so mad. that being said great practice ball more for a kids if you ask me or use just for throwing because a big hitter will smack this baby broken.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160314
    },
    {
      "title": "not very good quality",
      "text": "Decent for hitting in cages or Tee, not very good quality",
      "rating": 3.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Dont buy",
      "text": "Not real balls not what expected. They formed with contact to wood bats",
      "rating": 3.0,
      "verified": true,
      "author": "Wesley",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Amazing!",
      "text": "I ordered a bucket of 24 baseballs. I received a bucket of 24 baseballs. 5 Stars!",
      "rating": 5.0,
      "verified": true,
      "author": "JimmyH",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Nice quality for the money.",
      "text": "Good quality and seem to be holding up for practice. My kid loved them. Will buy them again and quick shipping",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20170706
    },
    {
      "title": "... for our city Easter Egg Hunt and the kids loved them!",
      "text": "Purchased for our city Easter Egg Hunt and the kids loved them!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary M.",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Great bang for the buck.",
      "text": "For the price, you cant beat it. Balls don't hold up as well as leather, but for less than a dollar a ball, it's well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew B.",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Great price",
      "text": "This bucket saved me this summer! My kids have played outside non-stop. The price was perfect! No more complaining that they lost their baseballs.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160918
    },
    {
      "title": "Five Stars",
      "text": "Great baseballs. Best for home use and a boy in little league.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebekah G.",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Great Value",
      "text": "Great product. No complaints. Already getting put to use in the front yard.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Great part",
      "text": "We have used these balls for 6 years. Great product great deal",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Great practice balls for both hitting and pitching",
      "text": "Needed new practice balls for kids and this worked great. Going on a month and these get used 2 to 3 times a week and no issues. Kids ages 10-12 so they smack the balls hard. Would def get another bucket in future.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "good purchase for the price",
      "text": "This was a sufficient amount of baseballs for the price. I used them for a Father's Day gift where the child had placed their handprint on the baseball. I gave it 4 stars because the lining of the baseballs seemed loose on them. But for the purpose of a craft, they served their purpose. Loved the price!",
      "rating": 4.0,
      "verified": true,
      "author": "Nurse RN",
      "helpful_votes": 0,
      "publication_date": 20140616
    },
    {
      "title": "Excellent Deal",
      "text": "These balls are just fine. They are great practice balls. I use them with my 11yr old and my 7 yr old. You can't beat the price. If you expect to get $6 balls then buy $6 balls. If you want great practice balls, these will do just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20150605
    },
    {
      "title": "Good bucket of balls",
      "text": "This is to simple to say anything other than we wanted a bucket of good balls. We got them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Good value for practice balls.",
      "text": "These are great for practice but NOT gameplay. The stitches will tear and the covering will rip MUCH easier than real baseballs. But, for 2 dozen balls at this price it is not a bad deal. Used these for my son's baseball practice and they performed well. A little more beat up than real balls but good for practice.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Mavilia",
      "helpful_votes": 0,
      "publication_date": 20140916
    },
    {
      "title": "We just needed more balls as I have another son ...",
      "text": "We just needed more balls as I have another son in baseball now that we went back and got the same thing as before.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Hendrix",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "Basic Ball For BP and Soft Toss",
      "text": "Needed a bucket of balls for soft toss and batting practice. These have served us well. We've used them for the past couple of months without any issues at all. Would certainly recommend them.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave Bartiromo",
      "helpful_votes": 0,
      "publication_date": 20150713
    },
    {
      "title": "... they have no pop made in china i don't recommend this to any one",
      "text": "cheap cheap cheap they have no pop made in china i don't recommend this to any one",
      "rating": 1.0,
      "verified": true,
      "author": "yudiel camejo",
      "helpful_votes": 2,
      "publication_date": 20170330
    },
    {
      "title": "good balls",
      "text": "they seem alright. i used this coaching little league baseball. cheap and does the job.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "We always shop around before making a purchase and these are a great value too",
      "text": "Breast for baseball practice. We always shop around before making a purchase and these are a great value too.",
      "rating": 5.0,
      "verified": true,
      "author": "S. D. Nardiello",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Wish i could give zero star review. The seams ...",
      "text": "Wish i could give zero star review. The seams do not line up, leather is not stitched together well and flat spots on the balls. There is no way to use this ball if you want to institute proper pitching technique with the condition it was delivered. Truley dissapointed in rawlings... made in China.",
      "rating": 1.0,
      "verified": true,
      "author": "Chad",
      "helpful_votes": 0,
      "publication_date": 20180426
    }
  ],
  "product_meta": {
    "title": "Rawlings Official League Recreational Grade OLB3/R8U Baseballs, Bucket of 24 Balls, OLB3BUCK24",
    "description": "The Rawlings OLB3 Recreational Use Baseballs are designed with a solid cork and rubber center with a synthetic leather cover to create an easy grip in addition to major league seams. These 24 baseballs come in a convenient, durable white bucket sporting the MLB logo and the iconic Rawlings patch. They are suitable for recreational use of ages 8 and under. They are official size and weight and are the #1 choice of leagues, coaches, parents, and players in North America.",
    "rating": 4.7,
    "feature_bullets": [
      "24 OLB3/R8U Baseballs in a bucket for easy transport",
      "Ideal for players ages 8 & under",
      "May contain OLB3 or r8u baseballs, which are materially the same and only different in name",
      "Easy to grip and throw due to synthetic leather covers with solid cork and rubber centers",
      "Durable white bucket includes mlb logo and red rawlings patch",
      "The number one choice of leagues, coaches, parents, and players in north america"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "11.5 x 8.9 x 8.5 inches; 8.95 Pounds",
      "Item model number": "AMAOLB3BUCK24",
      "Department": "Unisex",
      "Date First Available": "March 4, 2008",
      "Manufacturer": "Rawlings",
      "ASIN": "B0015CFUZW",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Sports & Outdoors",
      "Sports Equipment",
      "Fan Shop",
      "Baseballs",
      "Baseball Equipment"
    ],
    "price": 39.97
  }
}