{
  "website_summaries": [
    {
      "verdict": "This well-rounded hot towel warmer is ideal for heating up multiple small towels at once, although it's not the best at maintaining consistent heat levels.",
      "pros": [
        "Garners praise for its large capacity and insulated heating element for even distribution"
      ],
      "cons": [
        "Lacks temperature adjustment, making it hard for some users to get their desired heat level"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Dont buy this!",
      "text": "How does this even happen! I have been a massage therapist for 8 years. I always use a towel candy. So when I went out on my own I bought the same exact model as I always have had. It's been legitimately less then 3 months and today I opened it and the door fell off onto the floor with this piece that completely broke off. How does this even happen? I'm in a private office no one else has access to my stuff. I'm at a lost! Money wasted down the toilet. (Smh)",
      "rating": 1.0,
      "verified": true,
      "author": "Cristina Phillips",
      "helpful_votes": 8,
      "publication_date": 20190518
    },
    {
      "title": "I like the two trays so I can separate wet compresses ...",
      "text": "It is working as expected so far. I usually set up about and hour to a half an hour early for clients, so I haven't had any problems with how quickly it warms up. I like the two trays so I can separate wet compresses from warm towels. Even though it says it's a mini, it does hold plenty of wet and dry towels for at least 1-2 body treatments at a time depending on what you need.",
      "rating": 4.0,
      "verified": true,
      "author": "Apothic Spa",
      "helpful_votes": 10,
      "publication_date": 20171107
    },
    {
      "title": "Have had this a while now. I use 17x24 ...",
      "text": "Have had this a while now. I use 17x24 hand towels. Takes about an hour from cold to hot. Keeps towels very hot all day. I keep this on for 10hrs a day since I have had it 6-7 days/week in my massage practice. Would prefer 1 large inside holder vs 2 small ones. Once it is heated up, it heats the towels quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Doug N",
      "helpful_votes": 8,
      "publication_date": 20180511
    },
    {
      "title": "... this hot towel warmer for my salon works very good. heats up quickly haven't had any problems yet ...",
      "text": "ordered this hot towel warmer for my salon works very good. heats up quickly haven't had any problems yet towels stay hot all day . I'm sure this product will last long as long as you turn it off at the end of the day and wipe warmer door down at the end of each use. and poor out water out of the tray. use thus for hot towel neck massage for my male clients",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Williams",
      "helpful_votes": 7,
      "publication_date": 20170917
    },
    {
      "title": "Hot Towel Cabby",
      "text": "I love this towel cabby! It came promptly and heats my moist towels and stones to a perfect temperature. I recently purchased another brand and what a disappointment; it smelled really bad and took hours to warm up and when it did eventually heat up it was barely luke warm, when I pt one these lukewarm towels on my face, it smelled and left an oily residue and when I attempted to return it, it was a big negotiation process. I am so pleased with this item! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "AmyRitter",
      "helpful_votes": 48,
      "publication_date": 20110218
    },
    {
      "title": "One Star",
      "text": "Does not last and no customer service. We purchased the unit November 3rd, it stopped working (heating) on February 10th. There's no customer service. The unit is sealed and we had to purchase another cabi (from another supplier)",
      "rating": 1.0,
      "verified": true,
      "author": "akrmar",
      "helpful_votes": 16,
      "publication_date": 20151021
    },
    {
      "title": "Love so much I bought a second one.",
      "text": "UPDATE 2/2017 - I've had this for 6 months now and its still working perfectly! This is the second Elite Hot Towel Cabi that I've owner. I ordered a second one for another location. Very happy with the product quality. I haven't had any trouble with function of the other Cabi that I own and have had it for 6 years now. I wish I could find this exact same deluxe cabi with a UV Sanitation feature that didn't break the bank. Can't beat Amazon's price for this.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria Brown",
      "helpful_votes": 4,
      "publication_date": 20160710
    },
    {
      "title": "Do not buy",
      "text": "Absolutely horrible. I used this daily in my Barbershop, this lasted just a few months before it literally started falling apart. Spend a little more and upgrade to a better quality cabinet. I chose to get the pibbs hot towel cabinet after this fell apart.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20160621
    },
    {
      "title": "Works great but needs auto off timer",
      "text": "I got this for home use, mainly for moist heat for sore muscles. Works wonderful, great heat, but I wish it had a timer or auto off option as I have forgot to turn it off at times which is worrisome when you leave home. We will be installing a timer switch to remedy this issue.",
      "rating": 4.0,
      "verified": true,
      "author": "mary m.",
      "helpful_votes": 2,
      "publication_date": 20160819
    },
    {
      "title": "Nice piece of equipment.",
      "text": "Nice piece of equipment. Warms the towels in about 45 minutes. My clients were very please with how warm the towels actually were.",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda Baker",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Cheap product, not very durable",
      "text": "I have ordered two of these, so far(July 2017 and July 2018) and this past one will be my last. They last a year, if that. The same issue happened with this second one, the lower piece that holds the door just cracked and broke off, no longer supporting it. The heater still works fine, but the doors break in the same spot. I am a part-full time solo Esthetician, so it’s not like this thing is getting abused.",
      "rating": 3.0,
      "verified": true,
      "author": "Kathryn craig",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Almost perfect.",
      "text": "Great little towel warmer. Saw my massage therapist using it. I bought it for using with my esthetician work. Love how warm the towels get. The machine is durable. Wish it came with a sanitation light. But my washing machine luckily has a sanitize option.",
      "rating": 5.0,
      "verified": true,
      "author": "Maeya",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Sad..not working",
      "text": "I bought two of them, one of them was not even work when I plugged in.",
      "rating": 1.0,
      "verified": true,
      "author": " hcc",
      "helpful_votes": 2,
      "publication_date": 20180509
    },
    {
      "title": "Perfect for small spaces",
      "text": "I have a small working area. I can load 16 towels in side this compact efficient steamer. Looks good too.",
      "rating": 5.0,
      "verified": true,
      "author": "Irma Lucas",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "It will fall apart someday",
      "text": "This is my second cabi purchase. I bought my original one March 1, 2014. After about a year the door cracked and the handle became loose. The bottom corners in the front in the inner plastic part also cracked. The door then slanted the past year or so and wouldn't close as smoothly. The cabi still did it job,it got and kept things hot. Just wasn't the prettiest. Then it practically collapsed. Upset that this is my second purchase, but know it gets the job done.",
      "rating": 3.0,
      "verified": true,
      "author": "Kaitlin L. ",
      "helpful_votes": 0,
      "publication_date": 20150117
    },
    {
      "title": "I love this Cabi",
      "text": "I love this Cabi. It takes about 15-20 minutes to get towels really hot and my clients love the hot towels! I just got it about a month go and it seems to be working just fine! I can fit a good amount of towels at once. And no smell after you use it couple or more times. It's great!!",
      "rating": 5.0,
      "verified": true,
      "author": "JoAnne Gonzalez",
      "helpful_votes": 4,
      "publication_date": 20150618
    },
    {
      "title": "Not good product",
      "text": "I had a smaller one before. This is the second one I bought from same brand. But feel so disappointed because the equipment doesn’t make the stones warm enough as the previous worked.",
      "rating": 1.0,
      "verified": true,
      "author": "Autumn in summer",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Buying A Second One",
      "text": "I bought my first Elite hot towel caddy for my massage business two years ago and it’s going strong. It has developed a couple cracks in the plastic but it still heats my towels very well and within 30 minutes as I put my towels in warm. I’m buying a second for my home office.",
      "rating": 5.0,
      "verified": true,
      "author": "Hippie Chick",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Lasted 2 years",
      "text": "Worked great for 2 years. Just died today :( Warms up in about 30 minutes, stays hot. I'm sad that it only lasted 2 years though.",
      "rating": 4.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Plastic is cracking and warranty is expired.",
      "text": "Bought this towel cabinet about 18 months ago, it’s worked great, but last week I noticed the plastic inside the door is cracked. This doesnt seem to be a common problem, nevertheless I won’t be spending another $160 to get the same one again. Warranty is just for a year. I’ll be looking for a replacement cabinet with a longer warranty.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "No different then any other cabi for that I could ...",
      "text": "No different then any other cabi for that I could have purchased for half the price. Over priced. Doesn't have a sanitizing light inside, and the power light is really dim. When you open the door the water leaks on the floor.",
      "rating": 2.0,
      "verified": true,
      "author": "Rene Galietti",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "Doesn't Last Long!",
      "text": "I've purchased a few of these. They're generally fine for 6 months to a year. Inevitably the door always brakes. The bottom hinge is not sturdy enough for daily use. Once it's broken there's no easy way to repair it. So even though the warming still works, there's no more door to keep the heat in!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171014
    },
    {
      "title": "Great for massage therapist",
      "text": "Great product for warming up towels so far it’s worked great",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "I didn’t keep it",
      "text": "The look and size were very good but unfortunately it just did not heat up quickly enough. Even when I put the towels in hot it took this thing over an hour to heat up. I ended up returning it",
      "rating": 2.0,
      "verified": true,
      "author": "maria",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Towel Warmer works great",
      "text": "Put the moist cotton lemon towels in and 30 minutes they are warm. Our guest felt like they were in first class",
      "rating": 5.0,
      "verified": true,
      "author": "Slyke from Ohio",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Thankful",
      "text": "I am caring for a parent at home and wanted to make sure that they remain as comfortable as possible. What a great addition. I am able to warm small towels and even some clothing. I am very happy that I purchased this item.",
      "rating": 4.0,
      "verified": true,
      "author": "Denise",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Really good warmer. I recommend you turn it on at ...",
      "text": "Really good warmer. I recommend you turn it on at least 45 min to 1 hour before service. It takes its time warming up completely. I like the warmer because it doesn't get too hot so you can safely grab your items out of the warmer and immediately use them.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "Very nice for the price",
      "text": "I bought this for my home spa and am really enjoying it. I can easily place about 20 hand towels comfortably and it heats up quickly but not so much that it burns your hands when taking them out. It's also very sturdy... I've had it for two short of time to give it 5 starts since it hasn't passed the test of time yet but so far I'm very pleased.",
      "rating": 4.0,
      "verified": true,
      "author": "Dito",
      "helpful_votes": 2,
      "publication_date": 20121211
    },
    {
      "title": "Great for salon use",
      "text": "Heats up within 30 minutes and stays warm through entire work day. Easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie broyles",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Fantastic",
      "text": "Love it, love it, love it!!! Towels go in and come out hot - the clients LOVE it! Has taken my business to the next level...",
      "rating": 5.0,
      "verified": true,
      "author": "amcf",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "check packaging",
      "text": "Works fine.However, on the top of the towel warmer it does have a dent, pretty sure it was due to packaging.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "great towel cabi",
      "text": "Great Cabi! I am an esthetican and it works great for facials. Lots of space, can fit a lot of towels in it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica ",
      "helpful_votes": 2,
      "publication_date": 20170404
    },
    {
      "title": "Does what it's supposed to",
      "text": "I needed a hot towel cabbie for booties, stones and towels. This item came promptly, well packaged, and has enough capacity to meet my needs. It heats or keeps heated all my items. No odd odors as some have reported. Ii'm happy. Have been using for about a month so anything that could go wrong would by now. All is well.",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara Petrucci",
      "helpful_votes": 7,
      "publication_date": 20130426
    },
    {
      "title": "Great buy!",
      "text": "I have had this item for years and I use it daily. To date, this warmer still works! Very durable! Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Sonji",
      "helpful_votes": 0,
      "publication_date": 20161018
    },
    {
      "title": "I really liked the warmer",
      "text": "I really liked the warmer. Warmed great... Nice and hot and fast. I know the moisture drips into a drip tray, but it seeped behind the drip tray and puddled on the counter. That did not work for me. I then exchanged it for another and that one came damaged. I returned and didnt try another one yet. Maybe it was just that one that dropped funny... Besides that problem... It worked great.",
      "rating": 2.0,
      "verified": true,
      "author": "Jason J Chin",
      "helpful_votes": 0,
      "publication_date": 20160614
    },
    {
      "title": "Brand new and doesn't work",
      "text": "Out of the box it didn't work. I've spent too much time looking for apparently non-existent customer service and can't get any assistance other than if I pay to ship it back they will try to fix it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Overall a good product",
      "text": "I'm opening a massage business and purchased 2 of these towel warmers. Upon arrival, one of them has a couple of slight dents in the exterior, but are not very noticeable. The warmers both heat quickly and evenly. The only thing I don't like about it so far is that it is only 7\" or so deep. The towels I use are about 8\" wide when folded in half and rolled, so I can't put them in the way I would prefer to.",
      "rating": 4.0,
      "verified": true,
      "author": "Tmama",
      "helpful_votes": 4,
      "publication_date": 20180519
    },
    {
      "title": "No complaints here!",
      "text": "Totally love this towel warmer. It fits perfect for the spot I have it in. It doesn’t heat up the room and is quite. No complaints here!",
      "rating": 5.0,
      "verified": true,
      "author": "Amaris",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Gets nice and hot",
      "text": "Holds alot of towels and keeps them hot! I like the removable racks.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Salvack",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Takes too long to warm up",
      "text": "This isn't really all that great of a unit. The warm up time takes way too long, but if you're in need of an all day solution this might work for you. The build is on the cheap side, the new unit had this off-gas factory smell which you can just get rid off if you air it out nicely. I returned this after using it a few times.",
      "rating": 2.0,
      "verified": true,
      "author": "Tony L",
      "helpful_votes": 6,
      "publication_date": 20150907
    },
    {
      "title": "... had several different towel warmers and this one is wonderful, heats up quickly and is a solid cabinet",
      "text": "I have had several different towel warmers and this one is wonderful, heats up quickly and is a solid cabinet.",
      "rating": 5.0,
      "verified": true,
      "author": "contour",
      "helpful_votes": 0,
      "publication_date": 20170316
    },
    {
      "title": "Nice size, but takes about 30-40 mins before you ...",
      "text": "Nice size, but takes about 30-40 mins before you get the perfect temp for towels. But the price is very reasonable.. So i guess not too bad.",
      "rating": 4.0,
      "verified": true,
      "author": "lwebb77",
      "helpful_votes": 0,
      "publication_date": 20150818
    },
    {
      "title": "Last a good while.  Would recommend",
      "text": "Have a number of these in my salon. They work very well. I usually order the two part warmer Elite HC-Plus that heats 48 towels but this was an emergency one in case one stops working.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Con",
      "helpful_votes": 0,
      "publication_date": 20131208
    },
    {
      "title": "It can heat up hot stones & massage oil or cream bottles",
      "text": "I dislike that it takes 40 mins for my towels to heat up but after 40 mins its nice. I like how it holds more hand towels than a mini towel cabinet.",
      "rating": 4.0,
      "verified": true,
      "author": "Kiyah",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Perfect for small Massage practice",
      "text": "Perfect size for a small Massage practice. Heats towels to perfect temperature in about 40 minutes. Does not have a funny smell. Nice looking but small enough to conceal in a corner if it does not meet your style or color preferences. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth L. Leggett",
      "helpful_votes": 0,
      "publication_date": 20150317
    },
    {
      "title": "We use this at our birthing center. It's big ...",
      "text": "We use this at our birthing center. It's big enough to hold a blanket for mom and several for baby!",
      "rating": 5.0,
      "verified": true,
      "author": "Patti Brown",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "it's been a pretty reliable little cabby",
      "text": "This product is so so because it takes almost 2 hours to fully heat up wet towels. Other than that, it's been a pretty reliable little cabby.",
      "rating": 3.0,
      "verified": true,
      "author": "Jonathan Wittwer",
      "helpful_votes": 0,
      "publication_date": 20150308
    },
    {
      "title": "Love this towel cadi",
      "text": "Love this towel cadi. But was worried about how it hot smashed in the shipping. I took pictures and saved the original box, just in case it stops working properly.",
      "rating": 5.0,
      "verified": true,
      "author": "Sun",
      "helpful_votes": 0,
      "publication_date": 20141123
    },
    {
      "title": "Not good",
      "text": "This is more like a towel burner, I went in a month through 20 burned towels. If it will use a lower temperature would be great.",
      "rating": 2.0,
      "verified": true,
      "author": "V. Dental",
      "helpful_votes": 0,
      "publication_date": 20140415
    },
    {
      "title": "Don't buy this product",
      "text": "I used this warmer one time and it didnt warm the towels,. I should have returned it then but thought I'd give it another try. By the time I wanted to return it I was told I couldn't...don't waste your time or money buying this product. It's horrible!",
      "rating": 1.0,
      "verified": true,
      "author": "regina walton",
      "helpful_votes": 3,
      "publication_date": 20130413
    },
    {
      "title": "Perfect",
      "text": "Bought for fiancé as she just started booth renting and she loves the hot towel cabbi! Mission accomplished! No regrets!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Funny Pants",
      "helpful_votes": 0,
      "publication_date": 20140615
    },
    {
      "title": "Perfect for what I needed it for",
      "text": "Exactly what i wanted..... Perfect for what I needed it for. ... durable and works well. .. heats up nicely with no odor!......",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20141116
    },
    {
      "title": "Five Stars",
      "text": "Had this brand for years and this is my second one ... as a massage therapist.",
      "rating": 5.0,
      "verified": true,
      "author": "cc",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "I have absolutely love this. It has perfect heat unless you have ...",
      "text": "I have absolutely love this. It has perfect heat unless you have to keep it on for a long time then it gets the towels a bit to hot. Very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160310
    },
    {
      "title": "Love it!",
      "text": "Received my cabbi within days of ordering. The best price i've found anywhere. Easy to set up and use. Holds lots of towels and gets very hot.",
      "rating": 5.0,
      "verified": true,
      "author": "DW",
      "helpful_votes": 12,
      "publication_date": 20120611
    },
    {
      "title": "Five Stars",
      "text": "So far so good, very hot, reheat fast. the seal of Cabi is Great ! recommend it !",
      "rating": 5.0,
      "verified": true,
      "author": "Kunwu J.",
      "helpful_votes": 0,
      "publication_date": 20150618
    },
    {
      "title": "Leaks, door does not close",
      "text": "Cheaply made, door doesn't shut all the way so heat comes out and no warrAnty. Buy elsewhere or look in person. Lesson learned!",
      "rating": 2.0,
      "verified": true,
      "author": "Familylewz",
      "helpful_votes": 0,
      "publication_date": 20120810
    },
    {
      "title": "towel warmer",
      "text": "love it! stays hot All day heats moist and/or dry towels. i use it for work and keep about 16 in it .i use mine every day.",
      "rating": 5.0,
      "verified": true,
      "author": "LISA ROUGEAU",
      "helpful_votes": 0,
      "publication_date": 20140616
    },
    {
      "title": "Exactly what we needed.",
      "text": "I ordered one of these hot towel cabinets in January and we were so pleased with it that I ordered another one in February. We use a lot of hot towels with our massage and facial services and these cabis work great. They are pictured showing washcloths but we use hand towels and they hold approximately 12-14.",
      "rating": 5.0,
      "verified": true,
      "author": "RenewYouDaySpa",
      "helpful_votes": 16,
      "publication_date": 20120321
    },
    {
      "title": "Not real hot!",
      "text": "This don't get the towels real hot. You can hear the warmer kick on and off. Not sure if I made a wise choice in my purchase",
      "rating": 2.0,
      "verified": true,
      "author": "Nancy Combs",
      "helpful_votes": 0,
      "publication_date": 20140121
    },
    {
      "title": "Five Stars",
      "text": "Perfect for my practice, heat my hand towels within 30 minutes. A must have for any massage practice.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20151011
    },
    {
      "title": "towel warmer",
      "text": "Towel takes a little while to warm up but after it is warm it stays warm for a long time",
      "rating": 4.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 2,
      "publication_date": 20130531
    },
    {
      "title": "Great price! Great product!",
      "text": "Best price I found! Got it quick and it works great! This is the 2nd cabi I have bought through amazon. I have had the 1st one for over a year and it continues to work perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20150228
    },
    {
      "title": "Am more than satisfied with this hot towel cabi",
      "text": "Am more than satisfied with this hot towel cabi. It works fast, does not smell and is very efficient. Plus it looks nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "Fabulous. I put both hot stones, and hot ...",
      "text": "Fabulous. I put both hot stones, and hot cloths in it for my massage clients in my room at Dr. Moore's (San Antonio Chiropractor)..",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160301
    },
    {
      "title": "Do not buy this.",
      "text": "It has a smell and it does keep the towels that hot. So disappointed with this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Betty Bennetts",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "it's door never closed completely due to defected rubber on ...",
      "text": "it's door never closed completely due to defected rubber on it ,and it says not returnable if box is open or the original packing is opened.",
      "rating": 2.0,
      "verified": true,
      "author": "ria",
      "helpful_votes": 0,
      "publication_date": 20150222
    },
    {
      "title": "Doesn't get hot enough.",
      "text": "Towels are barely luke-warm when they come out, plus it takes 20 minutes to heat up. I would recommend something else.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 2,
      "publication_date": 20140123
    },
    {
      "title": "Works great",
      "text": "This towel cabi is the right size for my spa massage room. It heats the towels to a perfect temperature. The price was very reasonable.",
      "rating": 5.0,
      "verified": true,
      "author": "laura hummel",
      "helpful_votes": 3,
      "publication_date": 20131025
    },
    {
      "title": "a must have for treatment!",
      "text": "Heats up pretty fast...30-45 minutes. Great 2 shelf storage. Really quite when opening and closing! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Lydia Haig",
      "helpful_votes": 0,
      "publication_date": 20141217
    },
    {
      "title": "Cabinet arrived quickly and in good condition. Warms up nicely",
      "text": "Cabinet arrived quickly and in good condition. Warms up nicely. Just slightly smaller in size then anticipated but works five for about 10 hand towels",
      "rating": 4.0,
      "verified": true,
      "author": "Debra Young",
      "helpful_votes": 0,
      "publication_date": 20150316
    },
    {
      "title": "Five Stars",
      "text": "This product was exactly as I need it and as it was described by the seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Liliana M.",
      "helpful_votes": 0,
      "publication_date": 20160923
    },
    {
      "title": "Four Stars",
      "text": "I actually like it wish it would heat up a little more though",
      "rating": 4.0,
      "verified": true,
      "author": "Zeinab",
      "helpful_votes": 0,
      "publication_date": 20140817
    },
    {
      "title": "It works great! The Cabi warms towels good and hot and ...",
      "text": "I bought this for home use due to stiff neck and back muscles. It works great! The Cabi warms towels good and hot and I have found using a thicker hand towel and soaking/wringing in the sink then placing it on the rack works best. I also lie against a heating pad to keep the heat in for a longer time. I recommend it and am very happy I found it.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Hollis",
      "helpful_votes": 0,
      "publication_date": 20141220
    },
    {
      "title": "Four Stars",
      "text": "This unit holds two rolled up blankets and heats very well.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160314
    },
    {
      "title": "Awesome",
      "text": "So far, this does just what I need it to. I use hand towels for my facial services and this can hold about 15-18 depending on how tight you pack them. The most towels I need in a single service is 12 so this is great! If I have a busy day full of facials I can prep towels and have them in the warmer ahead of time to reduce set up time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amelia",
      "helpful_votes": 0,
      "publication_date": 20131108
    },
    {
      "title": "Five Stars",
      "text": "This is great so far. Good sized. Seems to heat quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "JoeAnn Solomon",
      "helpful_votes": 0,
      "publication_date": 20141017
    },
    {
      "title": "One Star",
      "text": "Had to return it did not get warm or hot, reordered same model, wish me luck!",
      "rating": 1.0,
      "verified": true,
      "author": "Melisa Foster",
      "helpful_votes": 2,
      "publication_date": 20141206
    },
    {
      "title": "Great!",
      "text": "Works great for what I need. I use it for washcloths for people's feet. It warms in about 20 minutes. By the end of the day I need to shake them to cool them a bit before putting them on the skin.",
      "rating": 5.0,
      "verified": true,
      "author": "kaybee",
      "helpful_votes": 9,
      "publication_date": 20131010
    },
    {
      "title": "Hot towel caddy",
      "text": "It works great. Just wish it got as hot as fast as my other caddy. ..... And wish I didn't have to write such a long review",
      "rating": 5.0,
      "verified": true,
      "author": "Edaa McCue",
      "helpful_votes": 0,
      "publication_date": 20140614
    },
    {
      "title": "Five Stars",
      "text": "Great cabi. Gets towel hot fast 20 minutes. Highly recomond",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20141118
    },
    {
      "title": "Works as I hoped it would.",
      "text": "It is the right size and a good temperature for the hot packs and towels that I use. I have had it about 3 weeks with no touble.",
      "rating": 4.0,
      "verified": true,
      "author": "A. J. Lan",
      "helpful_votes": 0,
      "publication_date": 20131117
    },
    {
      "title": "Great",
      "text": "This is a great little towel warmer. I use larger facial towels and can get 20 towels total in there !",
      "rating": 5.0,
      "verified": true,
      "author": "Karin",
      "helpful_votes": 0,
      "publication_date": 20130305
    },
    {
      "title": "Five Stars",
      "text": "This was a gift for my son for his massage business and he has received several compliments",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20150331
    },
    {
      "title": "\" its all good \"",
      "text": "like the way the tells get real hot very easy to use I've only had it for a 2 months so far so good",
      "rating": 5.0,
      "verified": true,
      "author": "fernando bojorquez",
      "helpful_votes": 0,
      "publication_date": 20140217
    },
    {
      "title": "awesome product",
      "text": "We at TLC Massage Center like it very much.. Than you very much..",
      "rating": 5.0,
      "verified": true,
      "author": "terry",
      "helpful_votes": 0,
      "publication_date": 20140817
    },
    {
      "title": "I use this to heat up dry heatpacks.. ...",
      "text": "I use this to heat up dry heatpacks.....I have a small unit I've used for sometime but wanted a bigger one to heat a larger pack for placing on the sacrum low back......This unit heats sometimes and other times not. I have offered a heat pack to a client only to be embarrassed with a lukewarm pack and have to renege on my offer. I wouldn't purchase this unit again :(",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160714
    },
    {
      "title": "but so far I am very satisfied with it",
      "text": "I've only had my hot towel cabi for a few weeks, but so far I am very satisfied with it. It heats very well and quickly (I'd say it only takes about 15 or 20 min. for the towels to become hot....I put the towels in warm to start). It is definitely large enough for my needs. I rarely have more than four clients in a day. I've been very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Gayle W.",
      "helpful_votes": 2,
      "publication_date": 20150511
    },
    {
      "title": "Works well, easy to care for, but could stand to be a little deeper",
      "text": "I use this to warm rolled-up hand towels for my massage practice. It heats up quickly, the drip pan is EASY to clean (just pulls out from the bottom without any annoying clips to fuss with), the exterior doesn't get too warm, and the interior rack is a great place to keep a few stones for hot stone massage. My only complaint, like many others here, is that the cabinet is not deep enough to accommodate the towels without turning them slightly sideways or smashing them in. For the price, though, it's a great deal.",
      "rating": 4.0,
      "verified": true,
      "author": "Anna Sanders",
      "helpful_votes": 0,
      "publication_date": 20150924
    },
    {
      "title": "HOT TOWEL CABI",
      "text": "I BOUGHT THIS TOWEL WARMER FOR A CO-WORKER..HE STATES IT IS WORKING FINE AND WOULD RECOMMEND SAME TO OTHER PEOPLE...",
      "rating": 5.0,
      "verified": true,
      "author": "rtcop392",
      "helpful_votes": 3,
      "publication_date": 20130522
    },
    {
      "title": "I am very happy with this purchase",
      "text": "I am very happy with this purchase. It easily fits 12, 12\"x 24\" hand towels folded into small rectangles. If I moisten the towels with warm to hot water, they heat up within a half hour. My old cabinet would dribble water all over the floor when I opened the door to get a towel. This one is drip free. I have no hesitation in giving this product five stars.",
      "rating": 5.0,
      "verified": true,
      "author": "JET",
      "helpful_votes": 7,
      "publication_date": 20150225
    },
    {
      "title": "Great product!",
      "text": "I am very pleased with this towel cabi. It is the perfect size for my office, it heats up quickly and is very easy to clean. I highly recommend this product :)",
      "rating": 5.0,
      "verified": true,
      "author": "wellcenteredmassage",
      "helpful_votes": 7,
      "publication_date": 20130204
    },
    {
      "title": "Very Nice towel Cabi",
      "text": "I have used this three times now since getting it. It performs very well and I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Seraphim",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "yes i like it",
      "text": "i like this beautiful hot stone warmer , i bought it because i know about this product i am using the same thing at my work place .",
      "rating": 4.0,
      "verified": true,
      "author": "Abeba",
      "helpful_votes": 2,
      "publication_date": 20121221
    },
    {
      "title": "Love it!",
      "text": "Have had this hot towel cabi for about 2 years now. I use it about 4-5 times a week. Has worked amazingly the whole time and is still going strong. Love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Alisha Evans",
      "helpful_votes": 0,
      "publication_date": 20150521
    },
    {
      "title": "Faulty product",
      "text": "This is an awesome cabinet warmer, except ours had a faulty seal on the door so now does not work properly. Unfortunately, we're past the date of being able to return it. Bummer, it was not a cheap purchase!",
      "rating": 1.0,
      "verified": true,
      "author": "Shanan Kelley ",
      "helpful_votes": 3,
      "publication_date": 20111104
    },
    {
      "title": "Better than not hot enough",
      "text": "Works quite well. Just wish I could adjust the temp as it gets extremely hot. Better than not hot enough!",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa Torres",
      "helpful_votes": 0,
      "publication_date": 20141230
    },
    {
      "title": "Works as expected",
      "text": "It has good space to fit wet hand towels and stones for my massage therapy business. Stones hold heat better than towels and may need to come out of oven prior to use versus the hand towels, but the Cabi heats evenly and as expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Duane",
      "helpful_votes": 7,
      "publication_date": 20140317
    },
    {
      "title": "Does not heat towels very well.",
      "text": "I bought this for my old towel warmer was dying and this one works as well as my 6 year old dying towel heater if not worse. Very disappointed. I want my towels warm-hot within 30 minutes for my massage practice. I have to put hot towels in a few hours in advanced to get them warm enough.",
      "rating": 1.0,
      "verified": true,
      "author": "kg",
      "helpful_votes": 13,
      "publication_date": 20121115
    },
    {
      "title": "hot towel cabi",
      "text": "i bought this hot towel cabi and it keeps the towels nice and hot , just perfect for doing facials and it was just what i needed . Its light in weight and doesn't make noise when you open and shut the door .The price was excellent and I'm very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "christina roussakis",
      "helpful_votes": 4,
      "publication_date": 20140405
    }
  ],
  "product_meta": {
    "title": "Elite Hot Towel CABI-Warmer(HC-X)",
    "description": "This single hot-towel cabinet keeps towels warm all day long and can hold a maximum of 24 small, facial-sized towels. Maintains consistent temp of 150-160 degrees. Comes with water-drip pan and interior towel rack. For best results, use this hot-towel cabinet with small, facial-sized towels. Pre-soak the towels, wring them out, then roll them up and place towels on the wire rack inside the unit. When you turn the unit on, the towels will heat up. It is, along with our two other sizes (mini & double), among our most popular and top selling hot-towel cabinets. Excellent quality, very reliable and reasonably priced. Interior dimensions: 14 1/2\" L x 7 1/2 \" D x 9 3/4\" H / .Exterior dimensions: 17 3/4\" L x 10 1/2\" D x 14\" H.",
    "rating": 4.3,
    "feature_bullets": [
      "Holds 24 facial-sized (small, wash cloth) towels",
      "Contains an internal temperature control so the unit does not over-heat",
      "Insulated cabinet w/ padded heating element surrounds all internal walls",
      "This unit does not rely on bulbs to heat which burn out",
      "Comes with water-drip pan and interior towel rack, 180 watts / 110V / 60hz"
    ],
    "specifications": {
      "Product Dimensions": "17.5 x 10.5 x 14 inches",
      "Item Weight": "17 pounds",
      "Manufacturer": "Elite",
      "ASIN": "B001QQS8EM",
      "Item model number": "HCX",
      "Customer Reviews": "4.3 out of 5 stars324 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#82,608 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Is Assembly Required?": "No",
      "Batteries Required": "No"
    },
    "categories": [
      "Bathroom Accessories",
      "Home & Kitchen",
      "Towel Warmers",
      "Bath"
    ],
    "price": 159.0
  }
}