{
  "website_summaries": [
    {
      "verdict": "Polypropylene materials in this dip belt will save you some money over a leather belt design.",
      "pros": [
        "Inexpensive dip belt that works well for simple workout needs",
        "Uses a 30-inch steel chain so you can add weights to the belt",
        "Has a slightly wider area in the back to provide support",
        "Uses steel grommets and rings to support any added weight adequately"
      ],
      "cons": [
        "Won't last as long as leather",
        "Steel D-rings could bend under stress"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "They shortened the chain length.",
      "text": "3 stars because my gym has the same belt but older and the older belt the chain is longer. So it's obvious that they cut cost by making the chain shorter. I had to add links myself so that a 45 pound plate can fit between my legs.",
      "rating": 3.0,
      "verified": true,
      "author": "Anthony T.",
      "helpful_votes": 12,
      "publication_date": 20180228
    },
    {
      "title": "Chain is now too short",
      "text": "This belt is apparently now being made with a chain that is too short to use comfortably with 45lb plates when attached properly and safely (like in the video). I've seen all the other people with this problem try to lengthen the chain so I'll give that a go first before deciding to replace it with a better quality item.",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan Spiker",
      "helpful_votes": 12,
      "publication_date": 20180306
    },
    {
      "title": "Awesome for weighted pull ups, dips, etc.",
      "text": "I have only used this a handful of times, but WOW it is much better using this for weighted dips or pull ups! I previously used sand bags or weight in a backpack, or a padded strap harness with chain looped through plates, but that setup really compresses your trapezius, shoulders, neck and gets uncomfortable. with this belt and chain, it makes your whole body a little heavier, but doesn't constrict your upper body motion or nerves/muscles. plus the weight hangs down more evenly instead of making your whole body tilt back like a weighted backpack does. Now I need to actually work out more with it, ha ha instead of just typing about it. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Walker",
      "helpful_votes": 6,
      "publication_date": 20171225
    },
    {
      "title": "It works.",
      "text": "Fits well. I'm a 5'5\" guy with average/fit shape, around 140 lbs, and this thing is neither too tight or too loose. The chains are NOT going to hit your private area during weighted pull-up or weighted dip. So far I have only used 40 lbs on this belt and it has been working fine for me. Not at the level to do heavier weighted pull-up yet but I will try to update as I go.",
      "rating": 5.0,
      "verified": true,
      "author": "John Smith",
      "helpful_votes": 6,
      "publication_date": 20170827
    },
    {
      "title": "SUPER comfortable when doing weighted pull ups.",
      "text": "Weighted pull-ups were the primary reason for buying this product because i couldn't keep asking someone to put dumbbells on my ankles forever (especially if they're particularly heavy and i must rely on someone to properly put them there). The belt feels really solid and doesn't have any give when you put weights on them. I bought them for $20 and while that is a steal, $30 is still a really good deal because this is something that's going to last you a while. After 3+ years of using it under heavy load, there's 0 issues to this day and apparently it has upgraded its features.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris E.",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Chain is too short.",
      "text": "I gave this a one star review because it is ridiculously easy for the mfg to fix the problem. The chain is too short. You can't loop the chain through the D-ring and hook it up the other D-ring as shown in the first photo. The chain is just too short. You have to hook it up like the last photo. That means the belt is resting only on your back and not your hips. It's super awkward to get into position without letting the belt slip off.",
      "rating": 1.0,
      "verified": true,
      "author": "Mikey",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Easy To Use, Works Well",
      "text": "I use this belt to perform weighted pull-ups and dips. I have used it to hold 55 lbs so far, but it can easily handle much more. The belt sits comfortably around the hips and i have had no issues with slippage of any kind when the belt has weight pulling it down. The chain is long enough for the weight to be out of the way (most guys will understand what I mean by this). Overall a great product, and well worth the purchase price! Highly recommend it to anyone looking to add weight to their work out routine.",
      "rating": 5.0,
      "verified": true,
      "author": "Caleb Dragna",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Good use",
      "text": "My order came in on time. As I used it in the gym it is as described. I tested the comfort using a 25lb plate. No issues. Next was with a 35lb plate. No issues. I tried with a 45lb plate, here’s the issues. I looped the chain through the metal loop and then through the plate then latched it to the small metal loop. As the instructions said. To me the chain could be just a little bit longer maybe 2-3 inches. But the belt is just as described. It came in handy doing pull-ups and dips with some weights.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason1331",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Uncomfortable",
      "text": "It shouldn't be listed as a support belt in my opinion. It is to small to attach around the waist like a tradition belt rather relying on the chain to attach the belt. The chain is obviously to thin to provide support around the area of the waist that it covers and is uncomfortable to wear. It does work well to use for weighted dips and pull ups, but I was really hoping for a support belt primarily.",
      "rating": 3.0,
      "verified": true,
      "author": "Bobby R. Newsom",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Step up your work out game!",
      "text": "I primarily bought the belt to add weight to my pull ups, dips, and squats. I have had it for about a month and am very happy with my purchase. The belt is very easy to use and fits comfortably around my waist. I have attached 25 lb - 35 lb plates and the belt holds up well. This has really helped with my work outs. Highly recommend if you are on the fence about a good product to add extra weight to your exercise routine.",
      "rating": 5.0,
      "verified": true,
      "author": "Rodrigo Rivera",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "The real thing",
      "text": "Sturdy and comfortable. Chain is too short for me (36” waist and large glutes) so I added a length of chain and carabiner. The carabiner it came with is a little small given the chain gage (difficult to remove when weights suspended) so I replaced that too with with a larger one. Aside from the $10 in extra cost the product is worth it based on the superb quality of the belt itself.",
      "rating": 5.0,
      "verified": true,
      "author": "gary_in_sf",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Good Belt",
      "text": "I purchased this because of the price and high review rating. I have not used it very much or with too much weight but I think it will hold up and last a long time. From what I can tell, the two D-rings sewed into the belt that the chain hooks to are closed vs. the open ones that could be pulled out. The chain is on the small side but it could be replaced very easily for cheap. I would not but a belt for the chain.",
      "rating": 5.0,
      "verified": true,
      "author": "BCG2012",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Holds Up Well Against 90 Lb Reps",
      "text": "I have been using this belt roughly twice a week for weighted dips since I bought it and it is holding up very well. Very comfortable (considering what it's used for). Not sure how well it would hold up for an expert repping 200 lbs, but I know it handles 90 just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Brendan",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Needs a few more inches",
      "text": "THATS WHAT SHE SAID Like many other reviewers I found that hooking up a 45 lb plate resulted in some uncomfortable pressure (see picture). I have a 36\" waist, so you might be able to get by if you're a lot skinnier, but most of us are going to need to throw a few more inches of chain on. Quality is ok other than that, just seems like they're trying to save money in the wrong place.",
      "rating": 2.0,
      "verified": true,
      "author": "Matthew Fleming",
      "helpful_votes": 2,
      "publication_date": 20191219
    },
    {
      "title": "Second time I've bought this, Great belt, but wish chain was longer (more in the review).",
      "text": "second one of these. They are nice and do the job but the chain is still the same length which to me is a bit too short. I'm the guy at the gym that does tricep dips with 3 Caddies and since the chain is short, the 45lb weights are pretty much smashing your nuts and it's just uncomfortable especially when having to walk a few steps and get on the dip bar (like one wrong move and its game over man!). Although with that being said, you can just use a dumbbell instead and that solves all the problems however I'm weird and I like the feel and balance of 45lb plates more.",
      "rating": 4.0,
      "verified": true,
      "author": "AznMikeD",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Broke after one use!",
      "text": "The D-Ring on one end broke after only one use with 70lbs (45+25) causing the chain and weights to fall off. This product had great reviews, so I’m surprised it broke so easily.",
      "rating": 1.0,
      "verified": true,
      "author": "Brent P.",
      "helpful_votes": 3,
      "publication_date": 20190411
    },
    {
      "title": "Perfect For Dips and Pull-ups",
      "text": "Just as the headline reads. Very well made and able to hold as much weight as you can probably load on there. It not uncomfortable either. Great price. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Great product",
      "text": "I don't do very many reviews even though three quarter of my possessions are purchased off of Amazon. So with that said I only review products I am very happy with and this belt does not disappoint. I do weighted dips and pull ups everyday using this belt and it shows no signs or wear after 7 months of use. Very well made and durable and it can hold an impress amount of weight also. It is comfortable around my thin waist and very easy to put on and lock in. I have absolutely no negative points on this product definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave W.",
      "helpful_votes": 2,
      "publication_date": 20160131
    },
    {
      "title": "Needs Better Clasps",
      "text": "The clasps can slide all around the last link of chain, it would be nice if it had a narrower part to loop the last link and keep it in place. Also, the edges of the clasps are sharp and I have lost a little skin a few times. Otherwise, it's exactly as pictured and works great. I use it a few days a week and it's holding up really well.",
      "rating": 4.0,
      "verified": true,
      "author": "JamesMorrissey",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "good product",
      "text": "it's a belt with a chain... not sure what to say about that. works for me",
      "rating": 5.0,
      "verified": true,
      "author": "skip",
      "helpful_votes": 2,
      "publication_date": 20190623
    },
    {
      "title": "Sturdy and supportive",
      "text": "I needed a weight belt for adding weight to my calf exercises. I thought this maybe a good idea. So far so good. The belt is comfortable and fits my large waist and hips and does not cut into my skin or feel like its digging in. I have used it for a few weeks with 110 lbs. No signs or wear or tearing.",
      "rating": 5.0,
      "verified": true,
      "author": "Just_me",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "5 stars",
      "text": "really good quality so far. Take to the gym almost everytime. Sometimes there is discomfort when I put a lot of weight on the belt and it dosn't support the back that well. But overall pretty good",
      "rating": 4.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Excellent price/ Excellent craftsmanship",
      "text": "I absolutely love this belt. It is very durable; well made. I am doing dips, wide grip pull-ups, and donkey calf raises. I am on the Bigger, leaner, stronger program. It's all about progressive overload(a.k.a Gains). This belt is incredibly inexpensive for its value in helping grow your upper back, lats, triceps, and even calves(donkey calf raises). I almost feel like I stole this belt it's so affordable.",
      "rating": 5.0,
      "verified": true,
      "author": "grand-poobah",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "It works but could a lot better",
      "text": "I wish the belt wrapped around the waste in some capacity, when you get to heavier weights for pull ups (say about ~30-45 lbs) it really feels like its going to slip off/barely hanging on there. For reference i'm 5 ft 7 ~ 140 lbs. If your wider around the waist perhaps this might not be so much of a problem.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Best I’ve used.",
      "text": "Someone stole my other one which was identical to this one. So I purchased a different brand, which had extremely high ratings. It was needlessly overcomplicated, so I swapped back to this one. It can handle 4x45 pound plates fine. The only down side is that rarely, and I mean very rarely your skin can get pinched by the chain.",
      "rating": 5.0,
      "verified": true,
      "author": "Lofo",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Good piece of equipment",
      "text": "Works great! Bought it recently, have used it for dips and pullups, works like a charm. We'll see how it holds up over time, I know some people have wrote negative reviews but eh, idk it seems pretty sturdy to me. I highly recommend purchasing one if you're looking for one.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Can’t pull.",
      "text": "Used this for about 30 minutes, attached a 45lb weight for some pull ups because I love pullin in and out of the gym if you know what I mean. I handled more pull ups than the dip belt. Dip belt needs to hit the gym. I felt kinda cool when it broke like “wow that guy goes hard he just broke the dip belt” but the reality of it was that the dip belt broke on me. Could have ended badly if I wouldn’t have caught it.",
      "rating": 1.0,
      "verified": true,
      "author": "Tom Elrom",
      "helpful_votes": 2,
      "publication_date": 20190607
    },
    {
      "title": "The speed clip is easy to use and the belt fits him comfortably",
      "text": "Purchased this for my son-in-law and he is over the moon about it. The speed clip is easy to use and the belt fits him comfortably. He is 5'10 and about 170lbs. The chain is 30 inches of steel chain and the belt is made of polypropylene. He did say he is adding some stronger carbiners to hold 4-5 plates because when he tried it at first, it felt like the clip was going to bend so better to strengthen it now. Very happy with the belt and its quality is great. I went with 4 stars just because he had to add a stronger clip for heavier plates. Very solid belt, though.",
      "rating": 4.0,
      "verified": true,
      "author": "One day at a time",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "Sturdy and good dip belt. Takes a little getting used to the chain though",
      "text": "I had injured my elbow so I couldn’t do front Squats. My coach told me to a dip belt so that I could still work my my strength without affecting my elbow. Overall, I’m happy with it. The chain takes a little getting used to, especially with the proper way of looping the chain in/out of the weights. But once you get used to it, it’s really easy to use. It’s very sturdy and you can tell it’s made of quality materials.",
      "rating": 4.0,
      "verified": true,
      "author": "Albert Moy",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Good purchase",
      "text": "Amazing quality. Was surprised at how well this was made and the top notch material they used. Great product at a great price. Only thing to add that would be considered a negative is the \"D\" ring that comes with it. It is one of the smaller ones with a low weight limit, regardless, not a deal breaker. Put 45lb plate on it with zero issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle J. Fox",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "Comfortable, will fit your waist",
      "text": "I was skeptical of the \"one size,\" but it works well enough. I have a 31\" waist, and I think I'm close to the minimum waist size for this thing. I haven't put a ton of weight on it for pull-ups, but it feels like it's made well and could handle a lot. The material is thick so it distributes the weight and it just feels like I'm wearing a wide belt when I have 10-15lbs on it. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Great Product, Great Price",
      "text": "I bought this product because I have a friend who bought this exact belt a few years back, so I was able to test it out a few times before buying. The belt is made of good quality material for the price and it makes doing weighted dips and chin ups much easier than holding a dumbbell between your ankles/legs. I'd recommend for any serious lifter.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "I'm happy with this belt",
      "text": "I'm happy with this belt. It feels sturdy. I am 5' 8\" and weight 150 lbs. I had no problem with the fit. I used them to do pull ups and tried strapping on 2 10's weights and also 1 25 lb weight. I had to jump to grab the bar and everything still stayed on well.",
      "rating": 5.0,
      "verified": true,
      "author": "saics",
      "helpful_votes": 0,
      "publication_date": 20171123
    },
    {
      "title": "Good price",
      "text": "Great product very durable. Only flaw is the carabiner at the end of the chain is cheaply made. It will work for most people but when I put heavier weight it's just a matter of time until it snaps. If it does I'll just buy a drink clamp like the fixed side has. Other than that great product that will get the job done every time and very comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Foster",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Broken after two uses.",
      "text": "Used this weight belt twice. I had 1x45lb and 1x10lb plate loaded on the plate for dips, one of the bolts came undone and I nearly face planted at my gym. I have serious questions on the quality control of the manufacturing process for this belt. I am returning it ASAP and looking for another belt.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura and Aaron",
      "helpful_votes": 4,
      "publication_date": 20160925
    },
    {
      "title": "A must have",
      "text": "All good second belt, left my other one in the gym and someone snatched it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190625
    },
    {
      "title": "Doesn't hurt my back when I'm doing pull ups or dips and has held up fine. I do have a small waist (size 28/29 ...",
      "text": "Been using this for about a year now and no complaints so far. Doesn't hurt my back when I'm doing pull ups or dips and has held up fine. I do have a small waist (size 28/29 for pants) so I have to funnel the chain all the way through, but this isn't a problem, more of an observation. I can see the chain being a tad short if you have a bigger waist so the plates would probably get a little close to your crotch.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "Great quality and gym accessory!",
      "text": "Only being able to do body weight pullups and dips was getting boring and too easy so this has been a game changer for adding extra weight for extra gains! It's super easy to add and remove weights and is also very comfortable. Great product for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Bobby's World",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "This is a solid belt",
      "text": "I've only had this for a few weeks so I can't speak on the belt's longevity, but so far this has proven to be a solid product (especially considering the price). In the future I will probably upgrade the d-ring as it looks more like a budget part, so I would prefer additional support for better peace of mind. All in all, the belt has been doing its job, and I'm happy with the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Oliver Brown",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "Great quality",
      "text": "Had this same belt once before. So good that someone stole it from the commercial gym I go to! All jokes aside I throw 2 plates on this bad boy all the time and it's never failed me or lost a stitch or two. Chain is nice and thick too not like the cheaper ones. Definitely worth paying the extra $10 or so for quality that will last.",
      "rating": 5.0,
      "verified": true,
      "author": "K T",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Great sturdy belt",
      "text": "I love this belt. I have tried more than one dip belt in 8+ years of being a gym rat. I can tell you that this one does the job and does it well. I have gone through at least 3 others that have teared and frayed and given out after some moderate use. This built holds as many plates as you can pile on like a champ. The chain is not very long, which limits the number of large plates you can pile on though, so I would not recommend trying to stack a bunch of 45lbs on this thing. Instead try 10's and 25's and it should work out great for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20140913
    },
    {
      "title": "The belt is fine and withstands recreational lifting",
      "text": "The belt is fine and withstands recreational lifting. The belt portion is comfortable across your lower back. The only this I saw that was a small concern is the clip that attaches to the end of chain. I think this belt works good for a couple of 25lb plates but I wouldn't want to put a couple of 45's on it and stree the smallish clip.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "LOVE THIS THING!",
      "text": "Great prica and works very well. I use it for weighted dips and pull-ups. The only thing I would change is the chain. It sits in my gym bag and has developed some rust. Not a big deal, but could have a very slight improvement. Would definitely buy again if it ever gives out for any reason.",
      "rating": 5.0,
      "verified": true,
      "author": "John S.",
      "helpful_votes": 0,
      "publication_date": 20171007
    },
    {
      "title": "Great Dip Belt",
      "text": "Great belt and durable, max weight I used on it was 135lbs and it had no problem. Highly recommended if you’re looking for something that will last.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Guitrau",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Get it now",
      "text": "Why did I wait so long.... 45 lb kettle bell dips off the rip! I had Aladdin flowing through my head as I was hammering reps. If you can do 15+ reps stop waiting.",
      "rating": 5.0,
      "verified": true,
      "author": "Vince",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Great for dips/pull ups",
      "text": "I use this With a max of 90 lbs, 2 45 plates (My personal max lifting weight) and there have been no issues with this belt supporting that weight. it was actually recommended to me by a friend and he has been using his original belt for over a year now.",
      "rating": 5.0,
      "verified": true,
      "author": "DameJ M3",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Great belt for a decent price.",
      "text": "This is a great belt for weighted pull-ups and dips. I've owned it for a little over a month now and so far I've had no problems with it. Some people have said that the chain is a little too short but i'm 5'4\" with a 30 waist and have had no problem using it with 45lb plates and having the chain loop through the middle of the plate. I've used this same belt in the past that a friend of mine owned for about a year, it was still holding up very well, so i'm very confident that it will hold up for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Albert Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20141220
    },
    {
      "title": "Not for belt squats",
      "text": "A belt squat is when you squat on a belt squat machine or with a weighted belt hanging down between two boxes. I bought this belt hoping to use it for the latter, but it's not made for squatting and can't be used for that purpose. It doesn't fit into the hip crease at the bottom of a squat and would never work. I'm going to try a different belt.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Whitmer",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "Great for dips, pullups, and elevated push-ups",
      "text": "I use this with my Weider 200 Power Tower (bought on Amazon) and it has been a great addition to my compact home gym. The chain is long enough to use with my PowerBlock dumbbells, but as others have stated, you may have troubles with a 45lb plate if you can only go through the middle. I was searching for a leather belt (what I grew up using in my high school gym and loved the quality), but this fabric belt is strong, sturdy, and comfortable. The chain itself is thick and strong and seems durable. Overall, very happy with the product and pleased I could get it for a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "melmwood",
      "helpful_votes": 0,
      "publication_date": 20121101
    },
    {
      "title": "Not the greatest belt/ bad quality",
      "text": "The belt itself is absolutely great quality. The chain connections on either side are extremely cheap. There are two U pieces at the end of either side of the chain that connect it to the metal loops. These U pieces are kept together with a poorly designed \"screw\"/pin (no head to tighten) that is not even welded to the metal. They continuously fall out if you do not tighten them after each use. If they would have designed it so you could tighten it yourself with a screwdriver, it would be fine. I have nearly lost the little pin's multiple times at the gym. I highly recommend looking into a different brand.",
      "rating": 2.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 2,
      "publication_date": 20160218
    },
    {
      "title": "The D shaped rings bend under weight!",
      "text": "Just like the headline says. I used this belt with weighted pullups yesterday with 55lb bumper and the metal D shaped rings that connect the belt fabric to the chain bent to the point where it was detaching from the fabric. I hammered it back into place with a rubber mallet in the middle of my workout to finish out my last two sets. When it happens again, I'll upload pictures. I do not recommend this belt.",
      "rating": 1.0,
      "verified": true,
      "author": "Minh",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Great for work outs.",
      "text": "Useful for adding resistance to pull-ups and dips. I have a very slim figure and for me, I have to buckle the carabiner to both rings on the left and right side to get a snug fit. At first, it may feel like the belt won't hold up, but when my friend (who is much bigger than I am and only clipped the carabiner on to one side, as opposed to me) found that it held up pretty well once you put the weight on. You might not feel like it would hold up against your back, but it actually works once you start using it.",
      "rating": 5.0,
      "verified": true,
      "author": "yukm",
      "helpful_votes": 0,
      "publication_date": 20140304
    },
    {
      "title": "It's functional, but I opted for one with a separate belt closure.",
      "text": "Without an independent belt buckle/closure the belt will not maintain specific waist tightness. It is completely functional, but less than completely comfortable or convenient.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Harrington",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Great value.",
      "text": "Works as advertised. Have been using it to add weight to my dips. Works well and is comfortable. Have only had it loaded to 45lbs, but I know of it being loaded down heavy and holding up.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Amazing product!",
      "text": "Definitely took my workout to a new level. I was wasting time doing so many reps and results were the same. Now I’m maximizing my workout and my growth has been very noticeable.",
      "rating": 5.0,
      "verified": true,
      "author": "Luka Alucard",
      "helpful_votes": 4,
      "publication_date": 20180514
    },
    {
      "title": "Nice belt",
      "text": "I do not see any issues right now. It works fine. I am 150 pounds and put up to 50 pounds on this without an issue. The chain is really long. Too long for me, but then again I have a 29 inch waist when measuing at the thickest part....",
      "rating": 5.0,
      "verified": true,
      "author": "Mateo Paizano",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "... for over a week and so far it works great! I primarily use this for tricep dips and ...",
      "text": "I have been using this belt for over a week and so far it works great! I primarily use this for tricep dips and pull ups. Seems to be sturdy enough. So far I have only put 80lbs on the belt and feels very sturdy. The only thing I see an issue with is the left side of the belt where the chain connect seems to want to fold over on itself when there is a lot of weight. This might be due to my small waistline though (32\")",
      "rating": 5.0,
      "verified": true,
      "author": "Marco",
      "helpful_votes": 0,
      "publication_date": 20150804
    },
    {
      "title": "The belt is good quality, but the chain is to short",
      "text": "My waiste is 34”. The belt is good quality, but the chain is to short. The chain needs to be 6” to 12” longer. 45 and 50 lbs plates with the chain supplied will hit you in the groin. If you add 12” of chain you’ll be able to adjust as needed.",
      "rating": 4.0,
      "verified": true,
      "author": "ONE LOVE",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "I wish the chain was a touch longer",
      "text": "Great product. Comfortable and sturdy. I do wish the chain was longer as sometimes the weights I'm holder are thicker than the chain has length for.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn J.",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Not good at all",
      "text": "2 days ago I bought this belt and when I got with so big box, I shocked maybe I placed wrong order. when I open and I saw belt with chain WAS disappointing time for me. Belt was good but Chain was crazy big, seems like the dog collar.",
      "rating": 1.0,
      "verified": true,
      "author": "E",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Good Cheap Belt",
      "text": "Still holding up from 2010. Used occasionally. No rips or tears. Still feels semi comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Ish Wish Dish",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Excellent Dip and Chin Up Belt - Chain is definitely too short",
      "text": "Fantastic, very comfortable dip belt, just needs a longer chain. I purchased this dip belt despite seeing the other reviews indicating that the chain is too short. I figured I'd just lengthen it myself if necessary. I've used it twice now this week, for both chin ups and dips and can confirm that the chain is too short as it is. The biggest plate I can put on it is a 25lb, anything larger and it'd be uncomfortably too close to your groin. Note that I have a size 32 waist. All of this said though, I like this belt very much and once I add about 6 or so inches to the chain, it'll be perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Mangan",
      "helpful_votes": 0,
      "publication_date": 20110422
    },
    {
      "title": "Easy to use!",
      "text": "Love this belt! This belt holds all the weight I need it to hold and is extremely easy to use. Easily one of the best exercise/fitness purchases I've made.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Stong chin ups",
      "text": "Very effective. Please look up a youtube video first “how to put on a dip belt” i wasnt wrapping it around myself correctly at first so please go watch that. 10/10 tho",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Does what its supposed to. Great buy.",
      "text": "Have used hundreds of times, 90+hanging from it, works as its supposed to. Couple years old, repeatedly in an out of gym bags, 0 wear. Looks as good as new. Great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Works well for me.",
      "text": "I’ve had this 3 months now. Use it 1-2x a week. No signs of wear or tear. I like it and recommend it. Good buy. *Most I’ve attached is 45lb plate. *",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Very sturdy",
      "text": "I load this belt up with 200lbs for weighted pull-ups. It’s held up great for 2+ years",
      "rating": 5.0,
      "verified": true,
      "author": "Nic A.",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Great product, but I needed to extend the chain",
      "text": "This is a quality belt. The only problem is that chain is too short for when you use full size plates. I added about 10 inches of chain and a carabiner.",
      "rating": 4.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Great belt......",
      "text": "My husband uses this many times a week, and it is holding up. He says it's great, he really likes it and would recommend it to any serious lifter.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Giordano",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Good for the price but chain length is not long enough.",
      "text": "Dips with weight are a great addition to any workout plan. This belt is fine although in my opinion the chain length is too short. I had to add a large carabiner in order for it to have enough length to comfortably change plates. All in all I am happy with it however.",
      "rating": 4.0,
      "verified": true,
      "author": "FCollins",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Good Product.",
      "text": "This product works well. I have been using it for about 1 month for weighted pull-ups. For extended periods of time it can be uncomfortable to wear depending on how much weight is on it. However you do not wear this for long periods of time so it is more of an annoyance then anything else.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Works as intended. Weighted dips.",
      "text": "My first weight belt and it works amazingly well. No complaints. Used for dips and eventually weighted pull-ups. So easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Jusburnin_dc5",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "it is a good deal and quite functional",
      "text": "Works quite well, I use it regularly. The clips come apart when adjusting if you'er not careful, the chain is a bit thin, and the material's not the thickest or most luxurious, but for the price, it is a good deal and quite functional. I use it for chin-ups, dips, and hanging/inverted rows.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew David Burt",
      "helpful_votes": 0,
      "publication_date": 20161129
    },
    {
      "title": "Strong, Lomfortable, Lightweight",
      "text": "I used it for a while dropping ~130lbs for weighted pullups. It was sturdy as could be and remarkably comfortable. I gave four stars because of the C hook clamp that's used to connect to the otherside can be a bugger to get on/off. However, that's the only issue and I would purchase this product again if I needed.",
      "rating": 4.0,
      "verified": true,
      "author": "Satisfied Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171123
    },
    {
      "title": "Works with dumbbells too",
      "text": "I was looking for a dip belt that was reputable but I don't have plates at my gym, only dumbbells. I've only used this once but just wrap the chain around the dumbbell twice and it fits perfect when I cross my legs. I've only used up to 35 lb dumbbell but I don't see any reason it wouldn't hold the 75 lb max that my gym carries. Saves me from buying the EZ dip dumbbell belt with the dumbbell attachment. That's all it really is anyway is the dumbbell attachment. If you buy this belt and you still want the dumbbell attachment you can buy them separately and will still pay less.",
      "rating": 4.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20130327
    },
    {
      "title": "Good product",
      "text": "So far I am satisfied with this belt. It looks sturdy and design is good.",
      "rating": 5.0,
      "verified": true,
      "author": "Sergiy",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Nice Weight Belt",
      "text": "Great belt for guys that have a gym with a crappy weight belt!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Comfortable and works great",
      "text": "Comfortable and works great. One thing I might wish is for a caribeaner on both sides of the chain, but one is enough!",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Great belt for weighted dips and pull ups",
      "text": "Great belt for weighted dips and pull ups. I’m using it with two 35lb plates and it works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jlambert",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Great",
      "text": "Harbinger is known for making equipment that gets the job done without charging you an arm and a leg. This belt does its job. You could easily add an extra 180+ lbs to your bodyweight for dips or pull-ups and this would have no problem handling it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanner Coles",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Works well for dips and pullups",
      "text": "Works well for dips and pull-ups. Comfortable and easy to put on.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe (Seattle)",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Great belt",
      "text": "I use this belt about 4 out of 6 days a week and just reached three plates on my weights dips and it holds up great. No signs on breakage and I had it for over two months.",
      "rating": 5.0,
      "verified": true,
      "author": "Shell Smoove",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Max weight rating of 300-400lb",
      "text": "I have fully used this belt to the point of breaking it which i did not think was possible. Having said that its a durable versitile belt that i would buy again. The reason it broke was due to belt squats at 405lb it managed one movement then bent. Other then maxing it out belt works great for everything else. I feel if the segment that bent was welded it could have handled 500lb with ease.",
      "rating": 4.0,
      "verified": true,
      "author": "Aaron S",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Perfect for the gym",
      "text": "Great for adding extra weight for dips and pull-ups at the gym.",
      "rating": 5.0,
      "verified": true,
      "author": "Bretterson",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "GREAT dip belt",
      "text": "I purchased this belt last May, it is a great product. I was causing a re-occuring injury for years in the gym every time I attempted weighted pull-ups and dips without a belt. So I decided to buy this and I'm very glad I did. The injury has completely healed and has shown not even the slightest signs of returning. I have to thank this belt for that and for others that are doing weighted pull-ups/dips, really urge you to get a belt to prevent injuries. I've used this belt alot since May 2012 and it's still in Like-New condition. It works great, it's very well made. Strongly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh K",
      "helpful_votes": 0,
      "publication_date": 20130117
    },
    {
      "title": "It does the job",
      "text": "I would give this 5 stars but the chain is a bit short. Another 6\" on the chain and I would be at 5 stars",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "great product",
      "text": "This belt is a great price. Sturdy chain, sturdy construction everywhere. Good material, amazing price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Another great product by Harbinger",
      "text": "Bada$$ dipbelt. Looks cool and works like a charm. I frequently use it for 35-45 pounds and it holds up nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Diaz",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "nice belt",
      "text": "nice quality for a good price. I use it attached to the low pulley system on my home gym \"cage\" (Valor BD-7, excellent product) and do calf raises on a calf block and squats while standing on separated concrete blocks- takes all the weight off my back and puts it on my hips and thighs- great way to do squats if you have back issues like me. Good quality belt and the chain is the right length. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott E.",
      "helpful_votes": 0,
      "publication_date": 20140217
    },
    {
      "title": "Amazing belt",
      "text": "This is such a great product, the build quality is much better than the stuff at my local gym.",
      "rating": 5.0,
      "verified": true,
      "author": "Melvin Garcia",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Bad chain design",
      "text": "Its really annyoing that the chain is attatched to the belt. It makes for awkward situations when trying to load the plates. It wouldve been better to simply include the chain, that way the belt is more versitile. I Often find myself rolling the chain up and using a completely different chain. The belt itself is good, but the chain included just sucks.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Adequate",
      "text": "Overall, the belt serves its purpose. I have attached 55lbs to it and has held the weight very well. I have plates that have holes that serve as handles, so the length of the chain is of no issue to me. My only issue with the product is the fastener clip. It's very hard to close if you have a decent amount of weight on it unless you kneel down to the floor (requiring more effort than necessary). Had they used a heavy duty carabiner, the product would have been 5*",
      "rating": 4.0,
      "verified": true,
      "author": "KRam",
      "helpful_votes": 0,
      "publication_date": 20110810
    },
    {
      "title": "Good quality",
      "text": "Really good product, chain could be a little longer but is ok. I bought this for when I do calf raises. Holds two 45 no problem",
      "rating": 5.0,
      "verified": true,
      "author": "David R.",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Not the same product!",
      "text": "I bought this from Amazon a year or two ago and the chain was longer and sturdier. Chain, clips especially, feel like cheap and unsafe. Weak.",
      "rating": 1.0,
      "verified": true,
      "author": "Cameron L.",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Great value!",
      "text": "Great belt. The chain is a bit small but does the job. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric J Volges",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Great Belt",
      "text": "It’s a great weight belt, took me a minute to figure out how to use it. But other than that I love it",
      "rating": 5.0,
      "verified": true,
      "author": "bsaunders",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "works great!",
      "text": "Works great so far. Have been using it with 50-75 pounds for dips and less for pull-ups and it is very sturdy and good quality. I like the fact that the chain is shorter, the perfect length in my opinion do it doesn't swing or drag. Can't use 50 pound plates but stack 25s and your good to go. Very happy with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "David Williams",
      "helpful_votes": 0,
      "publication_date": 20150830
    },
    {
      "title": "Works For Me",
      "text": "I use this belt to do weighted pull-ups and chin-ups. I do not do weighted dips because they hurt my elbows. Some reviewers seem to have an issue with the chain's length, bit it is long enough for me. It could easily hold a 45-pound plate. I have not tried using this belt with anything heavier than a 45. The belt does not slip off when I lift and the slight cushioning supports my lower back. I think this is a solid buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Julius Coxswain",
      "helpful_votes": 0,
      "publication_date": 20130712
    },
    {
      "title": "Good quality but chain is a little short/cheap hardware",
      "text": "I'm 6'7\" so wasn't sure about buying a belt and using the stock chain. If you use weights that have a handle you shouldn't have problems loading 2 or 3, 45's. I don't think I could if I had to go through the center of the plates though. The D-Ring is solid and the belt is comfortable so for the price of this belt + $10 on a caribiner (one of those screw on clasps) and a longer chain it's well worth it.",
      "rating": 4.0,
      "verified": true,
      "author": "Itsme",
      "helpful_votes": 0,
      "publication_date": 20140524
    },
    {
      "title": "180lb max weight to break belt",
      "text": "The metal hoops that connect the chain to the belt is to thin in diameter to support heavy weight. They bent on me at 180lbs. After the belt vroke I upgraded the hoops to replace with heavy duty carabigner clips. Belt is super strong now can handle 270lbs no problem.",
      "rating": 4.0,
      "verified": true,
      "author": "gregdy",
      "helpful_votes": 0,
      "publication_date": 20200205
    }
  ],
  "product_meta": {
    "title": "Harbinger Polypropylene Dip Belt with Steel Chain",
    "rating": 4.7,
    "feature_bullets": [
      "Dip belt constructed of durable polypropylene with heavy duty steel grommets to secure chain to belt",
      "Contoured belt design provides back support and fits comfortably during serious training",
      "30-inch steel chain and carabiner mechanism to easily add weight for chin-ups and dips",
      "Weighted dip belt helps build power and strength in triceps and chest",
      "Adjustable, one size fits all"
    ],
    "specifications": {
      "Date First Available": "July 3, 2019",
      "Manufacturer": "Harbinger",
      "ASIN": "B07TSFBMPN",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Strength Training Equipment",
      "Exercise & Fitness",
      "Weight Belts",
      "Sports & Outdoors",
      "Sports & Fitness"
    ],
    "price": 31.49
  }
}