{
  "website_summaries": [
    {
      "verdict": "A top choice for a taller boot style that stands out with its suede-like leather.",
      "pros": [
        "Customers loved the fashionable suede-like look of these boots, and praise the timeless tall boot style",
        "We love that they are easy to clean as well as soft and versatile"
      ],
      "cons": [
        "The sole on this boot is thinner than on some other styles on the market, and these tend to run a bit big and loose in the calf area"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Fake.",
      "text": "These are fake. And a very cheap looking fake at that. I don't think they are even real leather. Contacting Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Tatum",
      "helpful_votes": 28,
      "publication_date": 20170103
    },
    {
      "title": "LoveLoveLoveLoveLove!",
      "text": "These smell, feel and look great! The color is amazing. Had to struggle the first time getting my foot through the arch/ankle area, but with the help of a long shoe horn and some tugging, my foot made it and felt wonderful. This was expected as they're more of a traditional boot with no zippers. Looking for a black pair now!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 30,
      "publication_date": 20160415
    },
    {
      "title": "So sad to return these!!",
      "text": "The boots were just beautiful!! Typical Frye, The style and comfort were wonderful. Sadly, I elected to return them. They had to have been older inventory. This beautiful cognac leather was terribly scratched. I have the Frye cleaner/conditioner. I use it on my Frye handbags. It works great. However these boots had far to many scratches on them for new boots. I could not justify keeping them.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Lotts",
      "helpful_votes": 5,
      "publication_date": 20180114
    },
    {
      "title": "Not sure if it was not true Frye boot!!!",
      "text": "Fit was great. But it did not come with the Frye box. Not sure if it was too good to be true. It may be a knock-off and not the real thing!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Nikki",
      "helpful_votes": 21,
      "publication_date": 20141215
    },
    {
      "title": "Fantastic boots!",
      "text": "At first I thought I was going to have to send these back. They were narrow and tight on my feet. I know leather stretches though so I wore them around the house for two days and they are perfect now! I wear them all the time. Great quality leather. Color goes with everything. I normally wear a 6m in boots so they are true to size. Worth the money for sure. I do wish they were a tad taller. I'm 5'2 and they come right below my knee. They don't cut into the back of my knee though due to this so I'm happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "I love this boot",
      "text": "I love this boot! After reading the reviews I ordered a 7 1/2. My usual size is 7 1/2 - 8. I can still use an arch support (the boots have none) and wear socks. They do need some breaking in but that just means they're super good leather! The slate color is the perfect blend of brown and dark gray. As for difficulty with putting them on, it was no problem but I do have a slightly slim foot. It was a little harder to get them off without a zipper but I managed and can tell that will be easier when the leather softens with wear, too. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "ebyc",
      "helpful_votes": 2,
      "publication_date": 20161202
    },
    {
      "title": "Smells like a new car!",
      "text": "You could smell the leather from these boots as soon as you open the box. It was like getting into a new car with leather seats. The boots are a bit snug so it takes a bit of pulling to get them on, but once on they are fabulous. They are very comfortable and very well made. Frye has a great reputation for their leathet goods and they are living up to it!",
      "rating": 5.0,
      "verified": true,
      "author": "Redsun131",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Cute",
      "text": "The size I picked matches my normal shoe size (size 10, 5'9, 125 lbs). I didn't have trouble getting my foot into the boot at all like some other reviewers do, it may have to do with my slimmer foot. The boots are great for casual jeans as well as for business casual at work though I think they are too dress-down for a dress. I bought the APU cognac and the color is beautiful. Has a worn, warm, medium to dark brown look (NOT orange like I saw with some other reviews, this might be because these are APU and not the regular cognac color). Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Brooks",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Beautiful, comfortable and a good fit on my 10B sized feet.",
      "text": "LOVE these boots. These are my 2nd pair of Frye's and were scored for a great price here on Amazon in my size and color combination. They are very comfortable. I have size 10, somewhat narrow feet and although I am a runner and pretty athletic, these leave plenty of room in the calf area on my legs. They also smell divine (for weeks and weeks still) if you like the smell of leather! Overall I am very pleased with the aesthetics, the craftsmanship and the comfort of these shoes and would highly recommend them!",
      "rating": 5.0,
      "verified": true,
      "author": "GirlMom1976",
      "helpful_votes": 0,
      "publication_date": 20170110
    },
    {
      "title": "got the wrong color, and really difficult to pull off",
      "text": "I ordered cognac brown, and I got grey. I liked grey, so didn't bother complaining, but the fact remains that the boots were not the color I ordered. They look great, but taking them off is a huge pain. They're snug enough through the ankle that it takes serious effort to remove them. I suffered for a week, pulled a muscle, and it looks like they're going into a box for now because I'm so sick of trying not to dislocate a hip while taking them off.",
      "rating": 2.0,
      "verified": true,
      "author": "Lulu",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Stinky! Horrible smell on the tobacco color",
      "text": "I agree with the other reviewer who mentioned the extremely strong chemical smell. I question the authenticity of these, too, given how inexpensive they are on Amazon. Sadly I threw away the packaging so I don't think I can return them. I only have higher heeled authentic Frye booties so I can't really compare them for authenticity. But the smell is really really strong. I would not advise purchasing these in the tobacco color as the smell is horrendous and they most likely are not authentic.",
      "rating": 2.0,
      "verified": true,
      "author": "ComfortSeeker",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "Quality boots but poor packaging.",
      "text": "These boots are wonderful. Frye is an excellent company and I highly recommend their boots. The amazon packaging of this boot was lacking as the Frye box looked beat up. However the boots were fine so no harm done. The only issue I have with Frye boots is that you really need to scuff up the bottom of the boots because you will slip and slide as they have no traction built in to the bottoms when they are new.",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Not even close",
      "text": "I bought these because they're advertised as \"wide calf\". I have a 16 inch calf and it's extremely difficult to find boots that fit. Just got these today and I'm extremely disappointed. The boots look beautiful, but they're not even close to being \"wide calf\". The description says the shaft opening is \"approximately 16\" but I can't get my leg into them at all. I just measured them and the opening is less than 15 inches at the widest part. I'm sure there is some varying from boot to boot... but over an inch is a bit much when you're telling people they're wide calf. I'll have to return them.",
      "rating": 2.0,
      "verified": true,
      "author": "Bonnie Taylor",
      "helpful_votes": 2,
      "publication_date": 20141001
    },
    {
      "title": "FRYEs are now made in Mexico (for this style of boot)",
      "text": "Love the boots, but they are made in Mexico. They are still very well made, but the Frye's for this style boot are outsourced (if that matters to you). The boots are a very dark brown, but the leather is beautiful. I was looking for more of a camel color and these aren't it, but it's a beautiful color anyway and I'll keep them. I have plenty of room through the calf for thick boot socks and leggings or skinny jeans. (I'm 5'8\" 130 lbs). The boots still fit well even with my arch support inserts and are very comfortable now that they are broken in.",
      "rating": 5.0,
      "verified": true,
      "author": "K+A",
      "helpful_votes": 0,
      "publication_date": 20150127
    },
    {
      "title": "Beautiful boots!",
      "text": "These boots may take a bit of patience but well worth it. It took a bit of effort to get them on initially. There is no zipper but the leather is excellent quality. I’ve been wearing them for s couple of hours now and they feel great. There was quite a bit of bloom on this pair. Once I was sure I was keeping them I applied Frye leather conditioner. The actual color is somewhere between gray and brown, which is exactly what I was looking for. Bottom line: beautiful quality boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Kerr Greenfieldt",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Style with comfort and durability.",
      "text": "Absolutely love these boots for the bargain deal I was able to purchase them. Love the natural materials and feel. Wears well for look and comfort. As well leather wears well as it ages.",
      "rating": 5.0,
      "verified": true,
      "author": "Kengyroll",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Excellent Quality",
      "text": "Well made, quality boot. Because they have no zipper I purchased 1/2 size up to make them easier to get on and off. I first saw these boots in a department store, I loved the boot but not the price. When I found them on Amazon for about 1/2 the price I had to have them. The Leather softens quickly and are very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "KY Girl",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Perfect.",
      "text": "I waited and waited for the price to go down on these. I had almost lost hope. I snagged them quickly when the seller cut the price in half. These are perfect. I have the taupe/grey ones too.",
      "rating": 5.0,
      "verified": true,
      "author": "susanb",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Great style and fit of Frye boots",
      "text": "I tried the Melissa Button extended calf and these Paige boots. I decided to keep the Paige boots. They have an additional half inch additional calf circumference and I love the deep brown color. They will pair well with jeans, skirts, and dresses.",
      "rating": 5.0,
      "verified": true,
      "author": "kristenutk",
      "helpful_votes": 2,
      "publication_date": 20160817
    },
    {
      "title": "Amazing!",
      "text": "Best gift ever! I’ve had many pairs of tall boots but none that fit and feel like these. I know they’re pricey but so worth the money. Especially if you wear all day. My feet don’t hurt and the leather molds to your feet and legs as they warm up",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Beautiful boot",
      "text": "I loved these Frye Paige riding boots. They are true to size are are a beautiful and soft, yet sturdy leather. My only problem, and the reason I returned them, was that they have a larger half circumference. I have \"smaller\" calves, but I think these boots would work wonderfully for someone with a 15-16 calf circumference. The Frye Tall Melissa Riding boot, which looks nearly identical to this boot, works better for a 13-14 inch calf.",
      "rating": 5.0,
      "verified": true,
      "author": "jane's_bookshelf",
      "helpful_votes": 3,
      "publication_date": 20140811
    },
    {
      "title": "Beautiful boot!",
      "text": "Beautiful boots, but I could not get them on! Returned and got a different Frye boot with a small zipper! I LOVE them!",
      "rating": 4.0,
      "verified": true,
      "author": "Diantha Wood",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Had to send back which was dissappointing becuase they were so nice!",
      "text": "Ordered these in a 9 1/2 based on the reviews. Should have gone 1/2 size larger. Very difficult to pull these on - my foot is not narrow but it is not wide either. When I finally got these on, they were too narrow and not as compfortable as I had hoped they would be. Had to send back which was dissappointing becuase they were so nice!",
      "rating": 2.0,
      "verified": true,
      "author": "Janet Nuttall",
      "helpful_votes": 2,
      "publication_date": 20161017
    },
    {
      "title": "Great boots!",
      "text": "These boots are awesome for my pirate costume! I love that they don't have zippers because it drives me crazy to wear zippers at a Renaissance Festival or pirate event. The soles are really slippery and I intend to get them redone with synthetic soles to make them more durable. Other than that, I absolutely LOVE these boots! I think they are a unique look, comfortable, and nice quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Kate Smith",
      "helpful_votes": 0,
      "publication_date": 20161009
    },
    {
      "title": "Good Quality Boot, Poor Color Representation",
      "text": "The quality of the boot was apparent as soon as it came out of the box, however, the color was MUCH lighter than expected. I ordered the Tan Burnished Antique Leather for my wife, and even after wiping off the white film these were a very light tan, and not as dark as in the pics. She would have much preferred the saddle, but the top of the boot cut into the back of her thigh when sitting down. She's 5'3\" and aside from that these fit great, but that was a dealbreaker for her. It's too bad, because we haven't found anything else she's liked yet.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20131105
    },
    {
      "title": "I received these boots “new” but it looks as though someone else enjoyed them before I did",
      "text": "I would give a zero star rating if possible!!!!! I received these boots “new” but it looks as though someone else enjoyed them before I did!!!! I also couldn’t even get my foot into them! I normally wear a 7.5 in everything. Super disappointed in these!! Sending back ASAP!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Carrie W.",
      "helpful_votes": 4,
      "publication_date": 20171117
    },
    {
      "title": "Not for a good fit for a high instep",
      "text": "I found these ran long in the foot length. They are beautiful boots but if you have a high instep you will have a lot of trouble getting your foot into the boot. The calf width is suitable for athletic calves and the shaft height is great for tall girls. I returned because they were so difficult to put on. A great alternative to these boots is the Frye Jackie which is similarly styled but with the addition of a small heel and a side zipper is a better fit for a high instep.",
      "rating": 3.0,
      "verified": true,
      "author": "Roz",
      "helpful_votes": 0,
      "publication_date": 20150211
    },
    {
      "title": "Great classic boot",
      "text": "A great boot. Looks just as advertised. Nice to have the 16\" circumference because a lot of the Frye boots run pretty tight around the calf, even if you're not a wide-calf boot wearer typically. Just keep in mind that there's no zip so skinny jeans or tights are the way to go in these as shoving a pant leg into them is pretty hard. Also, they'll take a day or two of wear to break in and really feel right, but GREAT quality and super happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "Love my Frye boots",
      "text": "My boots arrived really quickly and just as described. I got my first pair of Frye boots about 30 years ago and these ones seem to be of the same quality. I love the saddle color, although they did look a little \"dusty\". This was described as \"bloom\" by the manufacturer. A quick wipe with some leather conditioner took the dust right off. As suggested in other reviews, I ordered a size down from what I normally wear and the fit is perfect. They are so comfortable I was able to wear them all day the first day and no ill effects. I would highly recommend these.",
      "rating": 5.0,
      "verified": true,
      "author": "Nadene",
      "helpful_votes": 0,
      "publication_date": 20121007
    },
    {
      "title": "Look great, feel great.",
      "text": "Arrived quickly, calf is wide so tucking in jeans won’t be a problem. Deep enough instep so I was able to slide in without an issue. Look great, feel great.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn Mazeika",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "great boot if you don't mind the price",
      "text": "I've had my eye on these boots for a while and finally bit my wallet and bought them. They fit great and are comfortable to wear all day. My friend with wide calves tried them on and they fit her too. They scratch VERY easy but apparently that will look great after a while. You can smooth it out a bit with your finger and it dulls a bit but doesnt go away. I have never liked the smell of leather and these smell very strong! I'm hoping that will go away after a while. Overall great boot but I do favor my $70 riding boots better.",
      "rating": 4.0,
      "verified": true,
      "author": "Marve",
      "helpful_votes": 0,
      "publication_date": 20140125
    },
    {
      "title": "Love!",
      "text": "I would give 5 stars but I felt like a ran a marathon after finally getting these on! They are super hard to get one through the ankle but once one they fit great!! I have tired the Melissa button 2 in the regular (15\") and wide calf (15.5\") and both were snug in the calf... These are 16\" in the calf and fit perfect. True to size as well! Hopefully after getting these on and off a few times it will get easier to them on!",
      "rating": 4.0,
      "verified": true,
      "author": "lexi lou",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "Grey=Brownish",
      "text": "Beautiful grey-brown leather boots in a easy pull on style. These are covered in a white waxy dust that is easily brushed off before wearing. These boots are leather lined as well. They are true to size and can easily fit a regular sized calf (up to 15 1/2\") and tights or pants. I'd recommend the Paige boots to anyone in the market for a luxury, all leather, pull on riding boot in a casual style.",
      "rating": 5.0,
      "verified": true,
      "author": "Online Shopper",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "I love these boots",
      "text": "I love these boots. But I had to size down and order a half size smaller to get a good fit. I almost always wear a size 7 shoe, but had to go to a 6 1/2 in these boots. Amazon is great about returns and I got the size that I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "CT",
      "helpful_votes": 2,
      "publication_date": 20151103
    },
    {
      "title": "Hard to get on, hard to get off",
      "text": "Love these boots but they are incredibly difficult to get on and off. I use a plastic grocery bag over my foot to get my foot in. Once I'm in I tear the bag off. I wish I would have got a zip up boot. These feel good when they are finally on.",
      "rating": 4.0,
      "verified": true,
      "author": "Darla - TX",
      "helpful_votes": 2,
      "publication_date": 20161212
    },
    {
      "title": "Amazing boots",
      "text": "I don't have athletic calves and usually wear 7M in sandals and 7.5 in closed toe shoes, however in these boots I picked up 6.5M and they fit perfect.They are a bit loose on the top but when I wear it with jeans, they look good.There was a struggle to wear them in the beginning as they don't have a zipper but after 3-4 wear they got fine. The key in buying these boots are the right size.I'd suggest to buy 2-3 different sizes and then compare. The leather is divine and they look great with any attire.These are the must haves.I'm very happy with my new boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Ash",
      "helpful_votes": 0,
      "publication_date": 20130711
    },
    {
      "title": "Over all I love the color and style",
      "text": "Over all I love the color and style. However there is an incredibly strong chemical smell. I don't have issues with chemicals or perfumes normally. This smell is very strong and very unpleasant a week after receiving them. This is not a smell i normally associate with leather. It smells like grass fertilizer.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "Beautiful boots. They are really hard to get on ...",
      "text": "Beautiful boots. They are really hard to get on but as I wear them more I'm hoping it gets easier. I don't get it, right one slides right on but left one is a struggle. I've heard this with other reviews though. I think the good out ways the bad for sure. Comfortable once one and a nice, high quality boot.",
      "rating": 4.0,
      "verified": true,
      "author": "Keller B.",
      "helpful_votes": 3,
      "publication_date": 20170912
    },
    {
      "title": "Beautiful but.....",
      "text": "These are beautiful boots and love the grey color, and the terrific sale price, but they do not zip....so were extremely difficult to get on and off. I wear a size 9 and these slid on my heel so ordered an 8 1/2... fit perfectly but thought I would have to call for help to remove them. The foot fits like they were made for me (average width). Hated sending them back",
      "rating": 3.0,
      "verified": true,
      "author": "LazySusan",
      "helpful_votes": 0,
      "publication_date": 20151118
    },
    {
      "title": "I love these boots",
      "text": "I love these boots!!! I have a narrow foot, but these boots fit well after adding an insole. I added an insole for extra arch support and sole comfort, as these boots only have a leather sole, so it thin. The leather is super soft and does not require the boot to be broken in, so I was able to wear them all day long from the get-go! I have wanted a pair of Frye boots for years now, and am so glad I finally purchased a pair....they are well worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "VM",
      "helpful_votes": 2,
      "publication_date": 20160115
    },
    {
      "title": "... really looking forward to getting these boots but was disappointed. It's great quality",
      "text": "I was really looking forward to getting these boots but was disappointed. It's great quality, but the fit was off. I ordered my usual size (9.5) but the shaft, particularly also the ankle area, looked huge on me. It actually looked almost like rain boots. On the flip side, my girlfriend tried them on (before I returned them) and she had the opposite problem. Strange and definitely not worth the money.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161121
    },
    {
      "title": "Gorgeous, but a rubber sole could turn out to be useful",
      "text": "These boots are gorgeous, as expected. I chose half a size smaller than what I usually wear and they fit well and are comfortable. However, they are VERY slippery. Of course, if you walk in them outside for a little while they will become less slippery, but I did not want to risk it. After trying them on for the first time, I directly went to the shoe repair store and the cobbler put a rubber sole on the bottom. And now they are fashionable and safe.",
      "rating": 4.0,
      "verified": true,
      "author": "J24",
      "helpful_votes": 0,
      "publication_date": 20140928
    },
    {
      "title": "Love these boots, but take some breaking in!",
      "text": "These boots look amazing and it's obvious they are excellent quality. Once on, they fit perfect. However, they have been difficult to get on during the first few wears. My sister has these boots and told me this gets much easier after they are broken in. Also, it is important to note that they are very slick on the bottom at first. My sister has had hers for over a year and they still look great.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily RH",
      "helpful_votes": 0,
      "publication_date": 20141222
    },
    {
      "title": "Comfortable, a bit smaller in the toe area, love the color",
      "text": "When I received these, they had a white film/wax/polish that was kind of bizarre and had a strong smell. That has since worn off. I usually wear a 7.5 and have a fairly narrow foot, medium ankle and medium calves. I ended up with a size 8, and they fit quite well. I added a shearling foot bed and they are very comfortable! I have other Frye boots and these are definitely among my favorites. Only had them a month so no issues so far as others have reported.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellie K",
      "helpful_votes": 0,
      "publication_date": 20111129
    },
    {
      "title": "Oh my FRYE!",
      "text": "I absolutely love these boots. They are pretty comfortable and I can wear them all day. I have bigger calves from years of soccer and genetics ( thanks mom, grandma etc.) They are great! I got the burnished grey and they are between a grey/brown. I can wear them with ANYTHING. They came with a white powdery yet creamy film on them that you just rub into the boot. These are awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Brzb",
      "helpful_votes": 0,
      "publication_date": 20141202
    },
    {
      "title": "Would have loved them if it wasn't such a small gap on ...",
      "text": "I also purchased the Melissa Button Short Ankle Boot in size 8. I will tell you these are more challenging get my foot in because I have a wide foot and normally require a B shoe. These were lovely but the fit was a no go for me. Would have loved them if it wasn't such a small gap on the ankle.",
      "rating": 3.0,
      "verified": true,
      "author": "Wilde_Wins",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Runs true to Size!",
      "text": "I've been eyeing up Frye Paige Riding Boots for a long time. I compromised a bit on my favorite color to get a good deal. Based off the reviews I went 1/2 size smaller than I usually wear and they were way too snug! I think I could have enjoyed the Grey Burnished Antiqued Leather, but because of the sizing they had to go back.",
      "rating": 4.0,
      "verified": true,
      "author": "JettaGirl79",
      "helpful_votes": 3,
      "publication_date": 20140207
    },
    {
      "title": "These boots were beautiful but too narrow",
      "text": "These boots were beautiful but too narrow. Color was also darker than I expected, more of a black-brown. Sadly I had to return them",
      "rating": 3.0,
      "verified": true,
      "author": "virginia",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "Love these boots but they didn't fit me",
      "text": "Love these boots but they didn't fit me. The front of the boot is narrow but the heel was too large. My heels slipped in the boots while walking in them. Without any zipper, I feel that the boots would be hard to get on in a smaller size. Unfortunately I am returning them.",
      "rating": 4.0,
      "verified": true,
      "author": "AmazonUser",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "The boots are very nice looking! I wish they fit",
      "text": "The boots are very nice looking! I wish they fit! Unfortunately they are cut very small in the calf so I need to return them. I have normal size calves and always but regular boots not wide calf boots but these were so small I could barely get them on with leggings!",
      "rating": 4.0,
      "verified": true,
      "author": "Jacqueline H. Bandarenko",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Great everyday boot",
      "text": "Nice quality boot. 3rd pair of Frye’s & my favorite so far. Snug & hard to get on at first but used the trick of putting plastic bags on my feet first then slid right in. After a few days no trouble putting on & very comfortable. Leather is outstanding!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Beautiful boots, uncomfortable to wear",
      "text": "I wish I bought another pair of boots. These are beautiful, but they're so uncomfortable. Part of the insole is too high and it makes them painful to wear for more than a few hours. If these weren't so expensive, then maybe that would be okay, but I would buy another pair if you want to be comfortable.",
      "rating": 2.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 0,
      "publication_date": 20150904
    },
    {
      "title": "Frye Paige boots.",
      "text": "Great boots. They fit me just to the knee, so they have the long look, but over the knee styles look ridiculous on me, as I'm not tall. Need no break-in. To burnish the leather, just wipe with a soft cloth. I have these boots in two colors, and love them both.",
      "rating": 5.0,
      "verified": true,
      "author": "Hanna",
      "helpful_votes": 2,
      "publication_date": 20151028
    },
    {
      "title": "Loved these.",
      "text": "Loved these... but now there is a hole in the sole- after only 2 1/2 months of wearing them. I always expected Frye boots to be sturdy and well made. Not sure how to go about fixing them... disappointed in the quality.",
      "rating": 2.0,
      "verified": true,
      "author": "tinhart",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Split personalities!",
      "text": "The boots are gorgeous however one is larger than the other. I can hardly get my foot into the right boot. Very tight at the bottom so it takes all my might to force my foot into the actual shoe of the boot. They seem to be made differently left vs right. Not sure if I will keep trying to get my foot in or just send them back. Once I get my foot in they are fine but wish they were not so difficult.",
      "rating": 3.0,
      "verified": true,
      "author": "brew",
      "helpful_votes": 0,
      "publication_date": 20151031
    },
    {
      "title": "Beautiful boots.",
      "text": "Beautiful boots. ! I ordered them a half size bigger because i read the reviews which stated they were difficult to take off ... they fit well and no trouble taking them off",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Frye makes fantastic quality boots",
      "text": "Frye makes fantastic quality boots. This is my second pair of Frye's and I love them so much. I recommend them and would buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kitten's Boy's Miss",
      "helpful_votes": 0,
      "publication_date": 20170711
    },
    {
      "title": "Keep trying till you find the right pair",
      "text": "I have ordered multiple pairs of Frye boots and unfortunately I had to return most of them due to them being too slender for my feet. High quality boots though and it doesn’t stop me from ordering more to try out",
      "rating": 4.0,
      "verified": true,
      "author": "lisa",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "love them",
      "text": "Just got mine in tan. I was a bit surprized that they were coated with a \"dust\" so to speak, which i had to wipe off with a cloth. no big deal. I wear between a 9-10 depending on the shoe. I got a 9 1/2 in these and they fit perfect. I also have larger calves, which is always a worry for me with pull on boots. yet, they slipped on pretty well. I am happy I got them and cant' wait to wear them with skinny jeans !",
      "rating": 5.0,
      "verified": true,
      "author": "S. McNamee",
      "helpful_votes": 0,
      "publication_date": 20110826
    },
    {
      "title": "Bad Product!",
      "text": "The boots were scratched up almost had a hole in them from something pressing on the boot. Not the right color ordered. Look like fake Frye boots. Will be returning immediately. Very disappointed that Amazon would sell this bad of a product.",
      "rating": 1.0,
      "verified": true,
      "author": "KAREN S. HOWARD",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Gorgeous",
      "text": "Oh how I coveted these boots (it’s a problem I have!). The smell before I even opened the box was amazing. These boots are beautiful, gorgeous color and quality you’d expect from Frye.......Alas I had to return them. I have high arches which made it impossible to get my foot around the corner. I also have ‘athletic ‘ calves but these would have been good even on my calves. So sad to send them back.",
      "rating": 4.0,
      "verified": true,
      "author": "Crigsmom",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Excellent boots.",
      "text": "This is my first really good pair of boots. They fit and look great. My only complaint is that the sole has no grip/traction. It's less of a problem outdoors than indoors on hard flooring. And they're not the easiest boots to get off (since they have no zipper), but I knew that would be the case. But I wear them frequently and love them.",
      "rating": 4.0,
      "verified": true,
      "author": "Liz Bird",
      "helpful_votes": 0,
      "publication_date": 20140219
    },
    {
      "title": "Great boot",
      "text": "Bought these for my wife’s Christmas and so absolutely loved them. Fits true to size.",
      "rating": 5.0,
      "verified": true,
      "author": "Auburn Tiger",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Great boot",
      "text": "I bought these in the dark brown calf shine. I bought a size larger than I typically wear to allow for my orthotics. These are a great boot - the fit is great, the color is great, and they look great with jeans, leggings, and dresses!! My first pair of Frye boots, but I'll definitely get another pair one of these days.",
      "rating": 5.0,
      "verified": true,
      "author": "SH_LadyBug",
      "helpful_votes": 0,
      "publication_date": 20121031
    },
    {
      "title": "LOVE, LOVE",
      "text": "LOVE, LOVE, LOVE these boots! As other reviews mentioned, the soles are very slippery. They are also very hard to get off. But, I like them too much to send them back. I've tried a ton of other boots and didn't like any. These are keepers! So happy I decided to get them.",
      "rating": 5.0,
      "verified": true,
      "author": "Becky Feldmann",
      "helpful_votes": 2,
      "publication_date": 20160211
    },
    {
      "title": "Falling apart",
      "text": "I like the look of these boots and they fit well and are comfortable. I’ve had them for about four years and only wear them during the winter. In Texas that isn’t much. They are completely falling apart. Holes in the bottom and seams coming apart. Unfortunate, I really like them. I feel like they should have lasted longer since Frye is all about quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Allycat",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "boo hoo!",
      "text": "these boots looked fabulous and with the Frye name I was really hoping they'd be the best boots ever. The ankle was quite tight and with socks on it's very hard to get past the ankle but once I did the heel fit was too loose, even with the socks. And I have nice ankles, too! so I had to send them back. I usually wear a 9 m and these just didn't do it for me. the quality is great though.",
      "rating": 4.0,
      "verified": true,
      "author": "valleylynn",
      "helpful_votes": 0,
      "publication_date": 20150923
    },
    {
      "title": "Best boots!",
      "text": "This is my 2nd pair of FRYE Women's Paige Tall Riding Boot, and they are even better than the 1st pair. This is my first day wearing them and they are completely comfortable. This style does run large, so order 1/2 size smaller than your normal size. These are now my favorites!",
      "rating": 5.0,
      "verified": true,
      "author": "CT",
      "helpful_votes": 0,
      "publication_date": 20151130
    },
    {
      "title": "Beautiful boots",
      "text": "I love Frye and these are great. Super comfy and cute. Difficult to get on but with this, slippery socks it’s not so bad",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole M",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "The best boots ever.",
      "text": "I love these boots! I have them in 3 colors. That's how much I love them. They fit me perfectly and I love the way they look over some skinny jeans. I love they they're pull on and not zip up and that the entire boot is leather. They're supportive and comfortable to wear all day. I truly love them so much.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Burgart",
      "helpful_votes": 0,
      "publication_date": 20150511
    },
    {
      "title": "Absolutely best boots available!",
      "text": "After looking at different riding boots for months and debating the high price, I am extremely pleased I decided to spend the extra $$$. These boots are fantastic. They fit as described in other reviews and have little slouch in ankle which I was looking for. The antique/distressed grey is exactly as pictured and I have received numerous compliments. Totally worth the $$$$!!",
      "rating": 5.0,
      "verified": true,
      "author": "Karla",
      "helpful_votes": 0,
      "publication_date": 20121006
    },
    {
      "title": "Gorgeous... Once you get them on.",
      "text": "Gorgeous. I got the Whiskey color, and they're my new go-to shoe. They're sleek enough to wear with skirts or under jeans. I don't know how you're get them over skinny jeans. A little hard to get on, but super comfortable to walk in once you manage it. I wish I'd have bought them a half size bigger.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Roberts",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "Finally have FRYE boots at a good price",
      "text": "These were a deal of the day and I jumped on them. I ordered the 6 1/2 which is my normal size. They are a little snug with a lightweight sock, but I'm sure they'll stretch a bit due to the leather. The smell is amazing. Can't wait to wear them this fall and winter. Will treat them with a protectant so they stay nice.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Poe",
      "helpful_votes": 0,
      "publication_date": 20140727
    },
    {
      "title": "I like them, but...",
      "text": "These are gorgeous boots, but since they don't have a zipper and the shaft is quite tall, they are strictly pull-on boots and I had trouble getting my foot all the way down into the bottom of the boot. My normal size is 7.5 but I'm not sure whether switching them out to an 8 will be a sure thing for fit. Sadly, I have to return them.",
      "rating": 4.0,
      "verified": true,
      "author": "V. Wright",
      "helpful_votes": 0,
      "publication_date": 20141206
    },
    {
      "title": "LOVE THESE BOOTS!",
      "text": "Love, Love, love these boots. They are adorable, but so very very cute. I have high arches, so struggle a bit to get them on and off, but they are really comfortable while wearing. Would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "momof5",
      "helpful_votes": 0,
      "publication_date": 20161110
    },
    {
      "title": "Five Stars",
      "text": "amazing!!! The price was great and the quality was higher than I expected. Thank you!!",
      "rating": 5.0,
      "verified": true,
      "author": "T. Oberg",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "Love FRYE",
      "text": "I love Frye boots and got these in a different color. Unfortunately these black ones didn't look as great as the other color. They were too slouchy in ankle and tight in Calves which is fine if they are more rustic. Love the boot but not the color for the style.",
      "rating": 4.0,
      "verified": true,
      "author": "Brzb",
      "helpful_votes": 0,
      "publication_date": 20141202
    },
    {
      "title": "Order whole size down",
      "text": "Very cute and great quality leather however i do worry about them standing up to long term use. The sole is very very thin (total opposite of my Campus boots). The toe area already shows alot of wear and they are only a month old. The antique tan color is gorgeous. I normally wear a 9 and an 8 fit me. The leather relaxes/stretches a good bit so don't worry if you struggle getting them on at first.",
      "rating": 4.0,
      "verified": true,
      "author": "gailcarol",
      "helpful_votes": 2,
      "publication_date": 20160202
    },
    {
      "title": "Beautiful boots in a gorgeous color",
      "text": "I had some trouble getting on the boots. My friend suggested slipping a plastic shopping bag over my feet and then pulling the boots on. When I did that, the boots slid right on!!! Beautiful boots in a gorgeous color. Can't wait for fall so I can wear them!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20160821
    },
    {
      "title": "Glad I splurged",
      "text": "Gorgeous boot! The reviews mentioned that they were difficult to get on. I didn't have any trouble, but a little harder to get off. Also, plenty of calf room to wear these with jeans. Glad I splurged!! Also glad I read the reviews first. They do run small so order a size larger than normal.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Walker",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Love the color and style",
      "text": "Could not pull foot past ankle area, ordered 8.5 which is what I usually wear. Love the color and style",
      "rating": 4.0,
      "verified": true,
      "author": "A. Johnson ",
      "helpful_votes": 0,
      "publication_date": 20170602
    },
    {
      "title": "Buy Frye!",
      "text": "Great boot. Good fit. I wanted the 9.5 however the calf was snug without jeans . I don't know if it would've stretched or not. But I got the 10 and I can stick two fingers in the calf.",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy M.",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "These fit fine and they are really beautiful",
      "text": "At last, I have found the right size. I normally wear size 7-1/2 but that size was too large. Frye boots apparently run large. These fit fine and they are really beautiful. Still awfully hard to get off but that may change over time.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Hall",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "Beautiful but, tight heel/ankle area",
      "text": "Don't get me wrong, these boots are BEAUTIFUL! However, I could not fit my foot into the heel without a major effort. The calf is wide but the ankle area is almost impossible to get into.",
      "rating": 2.0,
      "verified": true,
      "author": "Anna Hoke",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Love Frye Boots",
      "text": "This is my 3rd pair of Frye boots and they don't disappoint. Great fit and style. I'm about 5'9\" and they hit my calf at a great height. They are super comfortable and versatile for any occasion. Dress them up or down! I get compliments every time I wear them. Totally worth the money for a great quality :)",
      "rating": 5.0,
      "verified": true,
      "author": "brownad",
      "helpful_votes": 0,
      "publication_date": 20140710
    },
    {
      "title": "Not for the \"athletic\"",
      "text": "Great product! Only reason I give four stars instead of five is because I had to have them stretched. They fit everywhere except my calves. Apparently I'm athletic.. who knew?",
      "rating": 4.0,
      "verified": true,
      "author": "bhuamthugad",
      "helpful_votes": 0,
      "publication_date": 20160909
    },
    {
      "title": "Cute boot but I am a lover of Frye. ...",
      "text": "Cute boot but I am a lover of Frye. I own about 10 pairs. I get lots of compliments EVERYTIME I wear these boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Bling Girl",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Full Price vs 1/2 price????",
      "text": "For the price I paid $218.00, I found the quality is that of seconds. I bought a light grey pair from Belk, paid almost double but the leather is so much softer and just looks like a better quality Boot. Next time I will go for the Quality not the cheaper price. This is just My 2 cents!!!",
      "rating": 3.0,
      "verified": true,
      "author": "patsinc",
      "helpful_votes": 0,
      "publication_date": 20150129
    },
    {
      "title": "Boots is made for walking ! 💕",
      "text": "Little slippery but work them on a rougher pavement then you’re good to go ! 😉👌 but love the boots !",
      "rating": 5.0,
      "verified": true,
      "author": "J Collins",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "For a pull on boot, I was concern, ...",
      "text": "For a pull on boot, I was concern, due to some pull on boots is hard to pull on and off. But not these, this size (7.5) fit exact and the color also.",
      "rating": 5.0,
      "verified": true,
      "author": "Yvette",
      "helpful_votes": 0,
      "publication_date": 20170629
    },
    {
      "title": "Little pricey",
      "text": "Overall they are good quality; they are genuine leather and they fit as expected. Just a little pricier than I would have like to have paid for them.",
      "rating": 4.0,
      "verified": true,
      "author": "Meagan R.",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Beautiful color and boot",
      "text": "Beautiful color and boot. I have small feet and ankles (size 6) and I couldn't put my foot past the ankle. It's not constructed properly. Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "mama",
      "helpful_votes": 2,
      "publication_date": 20150811
    },
    {
      "title": "these grey ones did not come in a FRYE shoebox like the Whiskey ones",
      "text": "I ordered two pairs of the Paige Tall Riding Boots. One is the Whiskey color in 6 and these grey boots in 6.5. For some reason, these grey ones did not come in a FRYE shoebox like the Whiskey ones. They are also not as comfortable on the inside; the soles were not as cushioned. I also fit the size 6 Whiskey ones fine, my feet slipped right in. The grey ones, although half a size bigger, were tighter at the ankles. I am wondering if these are authentic; but I returned the grey ones mostly because they just did not fit at the ankles.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "I love these boots",
      "text": "I love these boots! I'm glad I read the review and got a 1/2 size bigger(normal a 7 or 7 1/2 got the 7 1/2) boots are really comfortable and glad I finally purchased them!m",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Colf",
      "helpful_votes": 3,
      "publication_date": 20151001
    },
    {
      "title": "Addicted to Fryes and love these boots",
      "text": "Addicted to Fryes and love these boots. I've been eyeballing these for some time and was a bit worried on the height as I'm 5'0\". They fit great and hit right below my knew. They are so comfortable and have been wearing them for my weather travels. The dark brown is gorgeous and goes with most everything.",
      "rating": 5.0,
      "verified": true,
      "author": "cwolfe",
      "helpful_votes": 0,
      "publication_date": 20160321
    },
    {
      "title": "Great quality boots",
      "text": "This is my second pair of these boots. I bought my first pair in 2011 and could not have been happier with them. They are a great quality boot that holds up well.",
      "rating": 5.0,
      "verified": true,
      "author": "Joslyn D.",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "... that I've finally bought them I couldn't be any happier! They are the BEST ever",
      "text": "I've been waiting forever to get these boots and now that I've finally bought them I couldn't be any happier! They are the BEST ever! I actually got a half size smaller because they were real leather and I knew they would stretch a little. They fit perfect and look awesome! Love, love, love, them!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Beautiful Boots but too small in calf.  Sadly they are going back.",
      "text": "I normally wear an 8.5 . I tried the 8.5 and couldn't get them on. Too small in calves and foot way too tight, even with nylons. Went up a size to 9 and although roomy in the foot bed, they were still too small in the calf area to comfortably tuck in leggings . Skinny jeans would not have fit at all. (My calves measure 14.5). Sadly, these are being returned. Absolutely beautiful boots although more on the taupe/tan range than grey. . Wish they had fit.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "gorgeous, versatile boot",
      "text": "I saw these boots on a girl in the mall. Had to have 'em. Shopped all around, and found my Best Price (as well as the color I wanted available in MY size) here! I feel like a million bucks wearing these. Terrific style, fit and value. I have a high instep, so these are snug putting on and taking off, but are all-day-comfortable once on.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Penton Lee",
      "helpful_votes": 0,
      "publication_date": 20140119
    },
    {
      "title": "Great quality but nearly impossible to put on and take off!",
      "text": "Love the boots but just some dang hard to put on. Great quality but like I said above, they are hard to put on. Once on, they fit great ,taking them off, almost impossible. My husband has to help me take them off or they aren't coming off. Hoping they will loosen up or these will be the last pair I get.",
      "rating": 3.0,
      "verified": true,
      "author": "Soulful17",
      "helpful_votes": 0,
      "publication_date": 20170103
    }
  ],
  "product_meta": {
    "title": "FRYE Women's Paige Tall Riding Boot",
    "description": "Gorgeous leather follows a classic riding boot shape with an additional layer across the front to add detail.Fit Guide - When you receive your boots, always try them on in the afternoon for the best true fit, as that’s when your foot tends to be at its largest. Your entire foot should feel snug except for the heel which should slip a little, which is necessary for getting your boots on and off. The amount of heel slippage should reduce over time. The ball of your foot should always sit at the widest part of the sole. If it sits too far forward, your toes will hurt, and we certainly don’t want that. The vamp of a boot should fit snug over the top of your arch. Oh, and don’t forget to be sure you can always wiggle your toes\n\nFRYE has done it again with the Paige! This gorgeous classic style riding boot shows off their high end quality and craftsmanship with its finely tailored leather upper, and tonal welt stitching. Of course, comfort will never take second stage either, the ultra-soft leather linings and cushioned insole have all of that covered.\n\nThe Frye Company is the oldest continuously operated shoe company in the United States. Founded in 1863 by John A. Frye, a well-to-do shoemaker from England, and family-run until 1945, Frye products have a long and illustrious history. Frye boots were worn by soldiers on both sides of America's Civil War, soldiers in the Spanish-American war, and by Teddy Roosevelt and his Rough Riders. When home-steading drew adventurous New England families to the West during the mid and late 1800's many of the pioneers wore Frye Boots for the long journey. Today Frye remains true to its roots with its line of heritage boots, but continues to innovate as it introduces chic new handbags, pumps, and sandals to its collection.\n\nSee more",
    "rating": 4,
    "feature_bullets": [
      "100% Leather",
      "Imported",
      "Leather sole",
      "Shaft measures approximately 16\" from arch",
      "Heel measures approximately 0.75\"",
      "Boot opening measures approximately 16\" around",
      "Tall boot in rustic vintage leather featuring stacked shaft with deep scallop at back opening",
      "Dual pull-on loops"
    ],
    "categories": [
      "Boots",
      "Women",
      "Shoes",
      "Knee-High",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 90.99,
    "specifications": {}
  }
}