{
  "website_summaries": [
    {
      "verdict": "This model takes comfort to a new level with a soft plush toy attached to the pacifier.",
      "pros": [
        "One-piece silicone pacifier",
        "Comes with a choice of soft, cuddly plush animals",
        "Gives baby something to hold",
        "Easy for babies to find on their own after it falls out",
        "BPA-free"
      ],
      "cons": [
        "Easy to pull out of the mouth due to the angle of the plush animal"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Wubnub pacifier",
      "text": "My great granddaughter loves her wubnub pacifiers. This must be at least the 10th one I bought. She keeps biting holes in them. Getting to big for a pacifier now plus loses them. She saw the pic of it and tried picking it up from the pic then crying cause she couldn’t grab it. I would high recommenced this. I also worked at toys r us and they were a Great seller. That is where I bought her first one. Great great great. If a little one likes it is great",
      "rating": 5.0,
      "verified": true,
      "author": "linda mckenna",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Wish she liked it more",
      "text": "Loved the idea of this, I just wish the pacified came off. I know it's a safety feature for it to not come off, but I can't sanitize it or clean it really well because it's attached to the puppy. I tried this to help my daughter from throwing her pacifier and to help it stay in her mouth when she was young, but she was not a fan. She likes playing the with puppy now and sometimes used the pacifier when playing with the puppy ( she's 10 1/2 months currently). Update: At 12 months she finally got into playing with it and sucking on it, but it's not her favorite still.",
      "rating": 4.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Mama and baby both love this little thing!",
      "text": "My daughter (10 weeks) loves this little thing! She's able to put her pacifier back in her mouth because of how big the puppy part is which makes this busy mama happy! She also likes it for cuddling and will hold it even when she's not sucking on it. This was recommended to me and I was a little weary to get this because I thought it was way to expensive for a pacifier but I am not a believer in the WubbaNub! I would definitely recommend this to any parent who has a baby that LOVES to suck!",
      "rating": 5.0,
      "verified": true,
      "author": "H Waller",
      "helpful_votes": 2,
      "publication_date": 20180922
    },
    {
      "title": "Probably a knock-off WubbaNub",
      "text": "I am only giving this 2 stars because the pacifier portion of the WubbaNub had a very plastic-y smell, which prevented my baby from wanting to take it, and leading me to believe that this was a knock-off and not a real WubbaNub product. I am familiar with the pacifiers as I have purchased multiple Super Soothie pacifiers from Philips' Avent line (these are what WubbaNub uses to attach to the stuffed toy)... none of the Philips' pacifiers ever smelled that way. I also had a friend give me their baby's WubbaNub, which did not smell. I am concerned that the material used is not of a grade suitable for babies.",
      "rating": 2.0,
      "verified": true,
      "author": "Erika Miller",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Didn’t work for us",
      "text": "I was so excited to get this because of people telling me how great these worked for their children. I should’ve read the description better but I didn’t realize the paci was sewn into the stuffed animal. Between our toddler shoving it in his mouth and our dogs getting ahold of pacis we go through several a day for our baby so it’s not that great for us. Our baby also spit it out as much as she did without the dog so it hasn’t made a difference for us at all. It’s very cute, might try again in a few months if she’s still taking the same type of paci.",
      "rating": 2.0,
      "verified": true,
      "author": "Katlyn",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Never lose a pacifier again.",
      "text": "Wubbanub is our FAVORITE. My kiddo has used these forever and it’s so convenient to have a lovable stuffed animal attached right to his favorite pacifier. He is a taggie kid, so he’s always playing with the ears, tails, feet, tags, etc on these. We’ve never ever lost a pacifier. NEVER EVER. We keep a couple of these in his crib and he gets them on his own during the night. They hold up well in the wash machine and even in the dryer (oops). Do yourself a favor and buy a spare of your kids favorite so when one’s in the wash you have a backup.",
      "rating": 5.0,
      "verified": true,
      "author": "Brielle",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Before the wubbanub, I was constantly putting the paci ...",
      "text": "Before the wubbanub, I was constantly putting the paci back in my baby's mouth. The attached stuffed animal has enough weight to it that the paci won't pop out. I do wish that you can detach the paci so you can disinfect it and clean the stuffed animal. It's not completely foolproof so every now and then the paci will fall out and I wish I can throw the stuffed animal in the wash.",
      "rating": 4.0,
      "verified": true,
      "author": "HTTop Contributor: Baby",
      "helpful_votes": 4,
      "publication_date": 20170321
    },
    {
      "title": "Weird plastic smell",
      "text": "I have two daughters. I fell in love with the wubbanubs with my first, so of course wanted to buy again for my second. Only real problem I had with this little guy was the smell. He smells like gross plastic. Very strong plastic. Who wants to smell that, pressed up against their nose when trying to be comforted?",
      "rating": 1.0,
      "verified": true,
      "author": "Crista Dinuis",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Our absolute favorite for all 3 kids",
      "text": "Favorite pacifier for all 3 of my kids. We have purchased dozens of these (some for the crib, some for the car, etc) over the last 4 years and still swear by them. I also gift these at baby showers often. I tried the cheaper knock-offs and would never again- these are worth every penny. Such adorable little animals offered & great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "K Douty",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Cute and useful",
      "text": "I like this pacifier, though I wish the soothie piece could be separated from the stuffed animal piece, for cleaning (or to change out the pacifier). However, this thing is great. Though I will say that the angle of the pacifier isn’t ideal for a very young baby who is laying flat-how it’s attached to the wubanub angles the pacifier poorly for easy sucking while laying flat. Even so, we use this often, mostly when she’s in the swing or bouncer.",
      "rating": 4.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Good product great price",
      "text": "Cute product and idea. I don’t know if i would say it helps the pacifier stay in the mouth more than normal (maybe it’s just my kid lol) but he likes it and its cute. Great price for the product. Overall I dont regret my purchase but I don’t think i would buy again just because it did not work for my child. Everyone is different though, it is such a good price just buy it to see if it works for you.",
      "rating": 3.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Cute, useful, soft",
      "text": "I have triplets, and I ordered one of these to give it a try after it was recommended by a friend. I really like that the toy gives them something to hold onto, and I think it the attached toy is useful in helping them learn to put the pacifier back in their own mouth. The toy itself is cute and soft. On the flipside, sometimes when they are playing with the attached toy, they accidentally pull the pacifier out of their mouth. All in all, I think our babies are enjoying it!",
      "rating": 4.0,
      "verified": true,
      "author": "MightyMultiples - Triplet Mom",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Terrible chemical smell",
      "text": "I think this must be a fake because the pacifier part smells terrible. I tried everything to get rid of the smell and it still smells like pure chemicals. I even put it in my mouth to see what it would be like and made me feel sick. No way am I giving this to my baby. Very disappointing as I also bought a monkey one that has the same problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Alyson Wright",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "My little one loved soothie since he was 3 days old",
      "text": "My little one loved soothie since he was 3 days old. I didn't know about this until it popped in search button. Lol My baby loves his new binky. It is also easy for us to find it especially at night.",
      "rating": 5.0,
      "verified": true,
      "author": "Kai Knox",
      "helpful_votes": 3,
      "publication_date": 20180304
    },
    {
      "title": "Grandson really likes his “passie”",
      "text": "My 20mo old grandson loves this “passie” ,he’s been using since infancy. he likes having a little stuffed animal which helps make it easier to grab ahold of, easier to find in his crib as well as much less likely to fall between slats in crib. He has several different ones which has been great for him with identifying the different animals.",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Cute & functional",
      "text": "As it turned out the baby in the family was not into pacifiers. But she still used this as a cute little stuffed toy. She has named it & is still sleeping with it at age 2 1/2. It is well made & cute as the dickens. I could envision, if your baby likes pacifiers, having a collection of different WubbaNub animals.",
      "rating": 5.0,
      "verified": true,
      "author": "boomer gal",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "My babe loved this",
      "text": "So smart and convenient- a cuddle buddy and paci . My son loved this until he was about 5 months- and started refusing a paci. When he was a newborn used MAM, and refused this one until about 3 months. Only got a couple months outta this thing but worth it. Also buy a few because they get lost easy lol",
      "rating": 5.0,
      "verified": true,
      "author": "Lex",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Bad experience !!",
      "text": "Not that good of a product. The main issue is that is smells alot like plastic and chemical.I do not think this product should not be given to babies. Took out the pacifier from the package 2 weeks ago and still smells like plastic. Also cleaning and sterilizing it is very difficult.",
      "rating": 1.0,
      "verified": true,
      "author": "Yash",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Best paci",
      "text": "By far the best best paci ever and they have so many cute animals my daughter loves these!! We have 3!! She is in a zippy baby sleeper hands not free and she still gets her paci back in her mouth we love it and when she is to old for the paci i plan on cutting it off and letting her play w the animal",
      "rating": 5.0,
      "verified": true,
      "author": "Bikini_bella",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Awful don’t buy!!!!",
      "text": "I should’ve spent the extra dollar for the Phillips avent one. This is not hygienic you have to pull the sewn pacifier apart to clean the animal and then boil the pacifier. I didn’t know it wasn’t easy on/off it should specify that. I have to buy a AUTHENTIC avent pacifier and sew it back on. This one is a flimsy plastic smelling pacifier I have cleaned and boiled and it still has that plastic awful smell. I refuse to give it to my baby. I don’t know why it has so many good reviews. It’s awful I wish I wouldn’t have spent my money. Don’t buy!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "AM",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Great pacifier!",
      "text": "My baby loved these types of pacifiers and wouldn't take any other kind. They are great because even when they're too small to actually hold onto the pacifier, the stuffed animal portion helps to keep it in place. If the pacifier would fall out of her mouth, depending on how we had it placed, she could easily get it back herself since it stayed put.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelique",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Baby loves to hold the puppy",
      "text": "My baby loves it. Baby is able to put in the pacifier on his own because it’s attached to the puppy (6months old). I would not say it’s very easy to clean since I want to clean the pacifier without getting the puppy wet. But this is not a deal breaker for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Meggi36",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "We are on #4 now. My 21 mo old ...",
      "text": "We are on #4 now. My 21 mo old sleeps with 3. I know he he probably to old for it but he loves them. Daily I wash the pacifier with water and I put it in the washing machine on the weekends. No need to dry them ( I do rinse the paci after with hot water to rinse off detergent). It is the cutest pacifier.",
      "rating": 5.0,
      "verified": true,
      "author": "alexandra",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "What I REALLY love about them is every night",
      "text": "My 8 month old daughter loves the WubbaNubs! Before, I was just purchasing the regular pacifier and we lost dozens of them. The Wubbanubs are much easier to keep track of and I am proud to say I havent lost a single one! Also, they are big enough that my daughter can find them and put them in her mouth on her own. What I REALLY love about them is every night, I place two of them in her crib at night so if she wakes up and cant fall back asleep, she just finds one, puts it in her mouth, and goes back to bed! Hello full night of sleep! lol",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Weisman",
      "helpful_votes": 0,
      "publication_date": 20160106
    },
    {
      "title": "Machine washable and dryer safe!",
      "text": "Great quality and durability. We have several and wash these twice a week, easy to run through machine and low heat in dryer. They have stay in-tact for over six months with no sign of damage.",
      "rating": 5.0,
      "verified": true,
      "author": "ZND ",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Baby loves it!",
      "text": "I was confused about how the pacifier was attached to the animal and how it was going to be cleaned when I got it, but I was so impressed when I got it. It's attached very well and there's no chance that it's going to come apart. It's very easy to wash. I throw mine in the washing machine as instructed and it comes out looking new. It's also easy enough to wash just the pacifier part with soap and water. The best part about this pacifier is that it's easier for baby to keep in his mouth and easier for mom to find! I already have three different animals! I would definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "NOLAgirl",
      "helpful_votes": 0,
      "publication_date": 20160331
    },
    {
      "title": "No longer using Smoothie pacifiers.",
      "text": "Very disappointed with the latest purchase of this. The pacifier has been changed to an Advent brand pacifier that is a bit thicker and stiffer than the Smoothie brand that came previously. My son will not take it.",
      "rating": 3.0,
      "verified": true,
      "author": "JameeGee",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "These things are awesome especially for my son who loves to be sucking ...",
      "text": "These things are awesome especially for my son who loves to be sucking on something to self soothe but is still too little to fall asleep unswaddled as he still has the moro reflex (startles and flings his arms out which wakes him up). So this little pacifier thingie stays in place even if he lets go for a little while he's falling asleep. Since it doesn't fall out of his mouth, he's less likely to wake himself up. (He is a very light sleeper when he's over tired) All that to say, it's awesome. I wish I knew about these things when my DD was born almost 9 years ago!",
      "rating": 5.0,
      "verified": true,
      "author": "RChambers",
      "helpful_votes": 0,
      "publication_date": 20151017
    },
    {
      "title": "Best comfort to baby",
      "text": "There is actually nothing better than the wubbanub. My daughter literally cannot go anywhere without one of these. We have one for every room / car. Machine washable (always a plus!) AND you can throw it in the dryer :) amazing product. And helps promote hand eye coordination when grabbing the stuffed animal at 3-6 months !",
      "rating": 5.0,
      "verified": true,
      "author": "Bryce Wible",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "A lifesaver!",
      "text": "I don't know where we would be without the WubbaNub pacifiers. When our son was little he would stop suckling on his pacifier as he was falling asleep and it would fall out of his mouth. This would immediately wake him up and we ended up having to hold his binky until he drifted off. As a sleep deprived parent, you probably can understand how this was an issue for us. We ordered the WubbaNub pacifiers and voilà, problem solved. It laid on his chest while he was swaddled and after he wasn't anymore it became a comfort soother. He caresses the ears, legs and tail as he falls asleep. I can't recommend this product enough!",
      "rating": 5.0,
      "verified": true,
      "author": "David Harris",
      "helpful_votes": 0,
      "publication_date": 20140919
    },
    {
      "title": "3 month old son loves it",
      "text": "My son has really been enjoying his WubbaNub. While the toy is smaller than expected, the small stuffed animal and sturdy attachment of the soothie (sewn taught, not dangling) allows a small child to be able to maneuver the paci into his own mouth from a young age. My 3-month old is not a huge paci-lover, but also enjoys cuddling with the puppy as he soothes himself with the paci. We have washed the paci in the washing machine and it held up just fine. Only con: I do wish that the paci portion was removable so that it could be sterilized or washed without getting any of the animal wet.",
      "rating": 4.0,
      "verified": true,
      "author": "lelia west",
      "helpful_votes": 0,
      "publication_date": 20140903
    },
    {
      "title": "Cute and easy to find",
      "text": "My son(4mo) likes the paci but isn't as big on the puppy part as I hoped he would be. I personally like it because other than the dog and how it lays on him, the paci can go any direction in his mouth.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "I absolutely love these!",
      "text": "I absolutely love these!! I have purchased three different Wubbanubs and our 17 month old daughter still uses it. When she was really young she would just chew on the animal part and use it for comfort. As she got older and started teething she started using the pacifier part. It is definitely a favorite with the young kids though. All of the kiddos in her daycare room love her pacifier and try to get rid of their own traditional ones to take hers. I will definitely be buying more of these when I have a second child.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20151227
    },
    {
      "title": "I love these things they are so cute",
      "text": "The pacifier does not detach from the animal. The only way to wash is to put in the washing machine or buy a new one. My 1 month old kept mistakenly pulling it out of her mouth",
      "rating": 5.0,
      "verified": true,
      "author": "Ny",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "My Daughter Loves Her WubbaNub!",
      "text": "We have two WubbaNubs - my daughter barely uses any of her other binkys and prefers her \"wubbie.\" They are very easy for a child to find, versus a regular binky. Cleaning is very easy as well. Put it in the laundry if it gets too dirty.",
      "rating": 5.0,
      "verified": true,
      "author": "Y3LNUM",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "We LOVE Wubbanubs!",
      "text": "We have purchased the alligator (which my dog decided was his chew toy), the giraffe, and the longhorn. I like the longhorn and the puppy the best. The giraffe's neck makes it a little less stable than the animals with the normal necks. We have yet to lose one of these because they're very visible, and my son loves the soft animal to grasp. Such a great invention! I make sure to have one with us at all times. The weight of the animals make them stay in place more than traditional pacifiers. They are also to clean (machine washable) and air dry very quickly. Don't hesitate to buy this-your baby will love it!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Maclauchlan",
      "helpful_votes": 0,
      "publication_date": 20130922
    },
    {
      "title": "Baby Approved - Hard to Clean.",
      "text": "I'm sure my baby would give this five stars! I would too, if it was possible to detach the pacifier for cleaning. I feel like rinsing the pacifier always gets the attached dog wet, and obviously boiling to sanitize is out of the question. The pacifier is easy to find amongst the baby gear, and hasn't gotten lost like the other pacifiers. It is also easier for baby to keep in his mouth. Overall, it was a great purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "D.S.",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "Baby not interested",
      "text": "Cute puppy and great idea but my baby doesn’t like the pacifier that is attached. Wish it was removable so I could attach one she likes",
      "rating": 3.0,
      "verified": true,
      "author": "sugarsquare",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Baby loves it!",
      "text": "And mom does too! This helps hold the pacifier in the baby's mouth, or at least close enough to it that he can get the paci back in on his own. It has just enough wait to help hold the pacifier in place, but not so much that it disrupts the baby. It's also something that the baby clearly loves to hold onto! Just wish there were more animal choices and that these were a little bit easier to find in stores. The one downside is that they're a little hard to clean without getting the animal attached soaked, but that's such a small point that it doesn't take away from how wonderful these things are!",
      "rating": 5.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20130722
    },
    {
      "title": "Possibly older version?",
      "text": "Kind of strange we had a different puppy before, this one is slightly bigger & different material on the plush part. My son refuses to take it. He has a monkey also but this one im bummed he refused it :( probably cant exchange... but im sure works for other babies",
      "rating": 3.0,
      "verified": true,
      "author": "Jenni L.",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Love this thing!",
      "text": "I’m always losing the baby’s bink, but this helps me keep an eye on it! Also, the baby loves snuggling and playing with it which is super cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "but then our son came along and he LOVED it. We bought two tigers and used them ...",
      "text": "wubbanubs seemed silly to me when I first saw them.... and that much for a pacifier??.... but then our son came along and he LOVED it. We bought two tigers and used them alllllllll of the time. They were easy to clean, easy to find across the room, easy for our son to put in and out of his mouth by himself.... they were worth every penny. Now any friend of mine having a baby gets one from me. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Kg",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "Must have for my boys.",
      "text": "I don't know how my first son made it through without these! My second son is now 8 months old and still loves his Wubbanub. It's easier for them when they're little to find and to keep in their mouth as the stuffed animal part will just sit on their chest so if they open their mouth for minute it doesn't just roll away. And with him at daycare this also acts as his \"lovey\" from home and helps him to self sooth. The only problem at daycare is that all of the other babies want one too. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Conundrum",
      "helpful_votes": 0,
      "publication_date": 20150706
    },
    {
      "title": "Son loves it",
      "text": "My son loves his. It’s large enough for him to hold and play with. I do suggest maybe getting a clip for it. We’ve lost 2 just by them falling off the car seat though!",
      "rating": 5.0,
      "verified": true,
      "author": "Stacie Wanamaker",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "The perfect pacifier for babies!",
      "text": "My kids love the wubanub, and they also make fantastic baby gifts! I just wish the stuffed animal detached from the pacifier, to make it easier to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "S.C. Bicknell",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Genuis Invention.",
      "text": "Genius invention. Seriously. It is so annoying trying to track down pacifiers, and this makes them SO much easier to find. Plus, they are adorable. I don't know if you are supposed to wash these in the washing machine, but I've owned several and never had any problems, despite multiple washings.",
      "rating": 5.0,
      "verified": true,
      "author": "M. LeighTop Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Sooo cute",
      "text": "I was really pleased with how cute this is. Also, you can detach the sucker from the little stuffed animal to clean both. Fantastic!",
      "rating": 5.0,
      "verified": true,
      "author": "Marcie",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "five stars, definitely",
      "text": "We love these, we have the puppy and elephant. My son is still very young and spits out a pacifier. The added weight of the animal keeps it on his belly while he sleeps to easily find it. Some recommendations, maybe add more beans to the feet for weight? I don't know if this could be a safety issue, but that would keep it on his stomach better while he sleeps on his back. Also, maybe do something with aromatherapy? How cool would a lavender scent be to calm the baby?",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Faust",
      "helpful_votes": 0,
      "publication_date": 20150628
    },
    {
      "title": "Love wubbanubs!",
      "text": "Love wubbanubs!! Best pacifier for newborn babies as the animal holds the pacifier close to their mouth even when it pops out. Often my 6 week old can put it back in his own mouth when it pops out or I can grab it quickly since it stays against his chest. We have tried other pacifiers but he won't take any of them except this kind. So now we own five of them. To clean them I just throw them in the washing machine with the baby clothes and they come out in good shape every time.",
      "rating": 5.0,
      "verified": true,
      "author": "Em",
      "helpful_votes": 0,
      "publication_date": 20150824
    },
    {
      "title": "So cute!",
      "text": "My daughter loves her puppy. It’s super soft and durable. Always have to have a back-up one just in case!",
      "rating": 5.0,
      "verified": true,
      "author": "VM",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Adorable",
      "text": "Love the WubbaNub! I tried an Avant version and it's just not as good. My twins but enjoy their paci far more with the WubbaNub.",
      "rating": 5.0,
      "verified": true,
      "author": "O'Doherty FamilyTop Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "So precious, perfect for babies!",
      "text": "Our kids went through so many of these, and we continue to buy them because of how easy they are for the babies and toddlers to use and hold. Highly recommend these!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Beware of hole in top of pacifier!",
      "text": "This is the third WubaNub we've purchased. The first two were FANTASTIC (brown giraffe and pink giraffe)! Couldn't live without them! We purchased a third one (brown puppy) to keep in the car. This one has a hole in the top of the pacifier and my baby HATES it! She refuses to suck on it. I'm so sad we received a flawed item this time. I have 4 children and this is the first time I've ever seen a brand new paci with a hole in the top. Be sure to check yours when it arrives!",
      "rating": 1.0,
      "verified": true,
      "author": "searsro",
      "helpful_votes": 3,
      "publication_date": 20151207
    },
    {
      "title": "Hard to clean but adorable",
      "text": "My little one loves his puppy! These are a bit of a pain to sterilize so I don’t use them as much as a regular pacifier. Besides that they are adorable and work great for our baby!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea ",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Love them!",
      "text": "My daughter loves these can’t go a day without one! She’s attached now trick is to get her off them! But easy to hold and grab",
      "rating": 5.0,
      "verified": true,
      "author": "ingrid materi",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Smells terrible",
      "text": "Product quality has declined. In the past, we have loved the wubbanub pacifiers. But this most recent order is terrible. It smells terrible, like plastic, and my son refused to use it.",
      "rating": 1.0,
      "verified": true,
      "author": "Katherine Ard",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Almost Perfect.",
      "text": "Our LO hated all pacifiers but for whatever the reason he took to this one. I have other Soothies but he loves his WbbaNub best! He was able to to grasp him at 3 weeks and the puppy stayed put on his chest while he slept in the swing or in his bouncer. My only complaint is that he pacifier doesn't detach. Cleaning hasn't been an issue...I've run it through the dishwasher and washing machine and it's held up nicely. It would be nice to change out the pacifier for a different type/age range. Other than that, it's perfect!",
      "rating": 4.0,
      "verified": true,
      "author": "Terra",
      "helpful_votes": 0,
      "publication_date": 20140710
    },
    {
      "title": "Cutie!",
      "text": "He's so cute!!! I can't wait for my baby to get ahold of him. The binky is NOT interchangeable; that should definitely be advertised. **UPDATE** He loves the Wubbanub so far. My only complaint is that he can snatch it out of his mouth very easily. Other than that, it's so cute to see him snuggle up to it at bedtime. ☺️",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 3,
      "publication_date": 20150727
    },
    {
      "title": "While I used to love WubbaNub products",
      "text": "While I used to love WubbaNub products, this puppy pacifier has a tiny hole in the pacifier that makes for a VERY annoying sound when my baby sucks on it. I checked other WubbaNub pacifiers that we have and they also have this hole (but for some reason, this product makes the sound whereas others do not). Unfortunately, I bought it months ago when we found out I was pregnant and it is now too late to return. So I am stuck with a defective product that is beyond the return date and left very hesitant to purchase future WubbaNub products.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160311
    },
    {
      "title": "I (and my toddler) love WubbaNubs! I love how they double as a ...",
      "text": "I (and my toddler) love WubbaNubs! I love how they double as a pacifier and a snuggly toy. I gave this doggy WubbaNub 4 stars instead of 5 because of a very minor design flaw. It fits most comfortably in my son's mouth when the puppy is upside down (ie, when the puppy's tummy is facing out, instead of his back). It doesn't affect the function of the pacifier.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary Eggers",
      "helpful_votes": 0,
      "publication_date": 20161020
    },
    {
      "title": "... where he got used to a pacifier which was fine but it turns out young babies aren't great at ...",
      "text": "Our baby was in the NICU where he got used to a pacifier which was fine but it turns out young babies aren't great at keeping the pacifier in their mouth. He kept spitting it out and then getting mad he didn't have it anymore, what a baby ;) I was hoping this would solve that problem, it helps but isn't the amazing solution I wanted. I still recommend this though, it's so cute! And very helpful to keep track of a pacifier.",
      "rating": 4.0,
      "verified": true,
      "author": "Hosmer",
      "helpful_votes": 0,
      "publication_date": 20150811
    },
    {
      "title": "Never lose a pacifier again",
      "text": "Needed another one so when i wash one the other one is availableand clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Shari Adams",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "I like the idea of how the plush animals suppose to ...",
      "text": "I like the idea of how the plush animals suppose to weight the pacifier down so that it will stay inside my baby's mouth longer. However,I wish the pacifier is detachable from the plush animals so I can sterilize it every now and then to ensure hygiene for my son.",
      "rating": 4.0,
      "verified": true,
      "author": "Jadis",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Love this binkie!",
      "text": "My son loves his “Rover” he started using it at birth and is now 4 months old. He can grab the dog and put it in his mouth. It really does help the pacifier stay in better!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Tallen",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "This is super cute, but the pacifier was too awkward",
      "text": "This is super cute, but the pacifier was too awkward, and the stuffed animal too heavy for our young daughter to use. It probably would be best suitable for a child that can hold the toy (4-5 months or older). Now our daughter prefers her thumb over a pacifier, so we don't use it at all anymore, and she's now at the age (5 months) where she could probably use it. So it just didn't work for us.",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah D.",
      "helpful_votes": 0,
      "publication_date": 20160320
    },
    {
      "title": "So cute!",
      "text": "We love these wubbanubs!!! If your baby uses this type of pacifier, then these are for you. They are easy for baby to hold and fun to cuddle with.",
      "rating": 5.0,
      "verified": true,
      "author": "David R.",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Game Changer",
      "text": "My baby girl loves soothing with a pacifier, but also manages to pop them out when enthusiastically sucking. She wasn't grasping objects when I purchased it, but within days was holding onto the stuffed animal and is now able to grab the stuffed animal and place the pacifier in her mouth herself. One of the top 5 baby items I'd recommend to new moms!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 3,
      "publication_date": 20170104
    },
    {
      "title": "Cute",
      "text": "Bought as a gift but I have a couple for my daughter. Lovely little pacifiers but need washing often",
      "rating": 5.0,
      "verified": true,
      "author": "Jess Richards",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "I'm in love...and so is my baby!",
      "text": "This cute lil puppy paci has prompted so many adorable pictures. I bought this after having to put paci's back in baby's mouth when they fell out way too many times in a row. I thought this would be a better alternative because the puppy could sit on her chest while the paci is in her mouth. It does exactly that. Granted, it's not heavy so it can be knocked off, but I wouldn't want it to be heavy. ;) Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "T L",
      "helpful_votes": 0,
      "publication_date": 20150827
    },
    {
      "title": "Big Head",
      "text": "WubbaNubs are great because when you drop the pacifier it won't roll away or get lost under the couch. You can throw this right in the washer with your laundry and let it air dry and because the puppy is brown he cleans up great. My only comment about this guy versus some of the other WubbaNub animals is that his head has a lot of stuffing in it and he isn't as flexible as some of the other animals.",
      "rating": 5.0,
      "verified": true,
      "author": "Whitney Cook",
      "helpful_votes": 0,
      "publication_date": 20151014
    },
    {
      "title": "That everything is just like it was described",
      "text": "My baby is so pickie about her pacifier that this wS just like the one she got from the hospital",
      "rating": 5.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "WubbaNubs are the best. They make the binkies harder to lose",
      "text": "WubbaNubs are the best. They make the binkies harder to lose, easier for the baby to grasp and put back in their own mouth, and less likely to fall out of the crib onto the floor (although it still happens, I suspect on purpose). And it would make it easier to keep track of whose is whose, if I hadn't long ago given up on trying to keep the twins' germs separate. And of course they are so cute (the WubbaNubs I mean...but also my babies of course)!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Morin",
      "helpful_votes": 0,
      "publication_date": 20141016
    },
    {
      "title": "WORTH IT",
      "text": "This was well worth the money. I thought why am I paying this much for a pacifier, but now I have no regrets and I will probably buy another, my daughter loves her WabbaNub its a toy, a lovie and a paci all in one and when it falls on the floor it doesn't roll away and also does not land on the part that goes into her mouth- BONUS",
      "rating": 5.0,
      "verified": true,
      "author": "Mo",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "I have been very satisfied with it and just bought one more of a ...",
      "text": "Bought this after seeing how cute it looked on my friends kid. I have been very satisfied with it and just bought one more of a different animal for fun. The quality is great and after 6 months of use it looks as good as it did the day I bought it. If it gets dirty I just throw it in the washer and air dry it, or for everyday cleaning, just wash the pacifier itself. My son loves it and it was great for teaching him how to put his pacifier in his mouth once he was old enough to. If there are two different pacifiers within reach, he always goes for this one. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlene Roberts",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "Shipping destroyed the bag.",
      "text": "The pacifier is packaged in its own bag, which is fine. However, the packagers at Amazon used tape to wrap my package to another cardboard square. It destroyed the original packaging. I was gifting this pacifier so I had to come up with a clever way to repackage it. The pacifier was not damaged and it was a hit at the baby shower. It's very cute. This may not be a big deal for you, just a precaution if you are gifting this to someone...the package may not arrive presentable.",
      "rating": 2.0,
      "verified": true,
      "author": "T. Morris",
      "helpful_votes": 0,
      "publication_date": 20130902
    },
    {
      "title": "this one is by far his favorite. It balances on his chest so you don't ...",
      "text": "My baby loves this paci. I've purchased several different brands, this one is by far his favorite. It balances on his chest so you don't have to worry about it falling if they spit it out. I have two of these, they are truly a lifesaver! I take it with me wherever baby goes. It's his favorite \"toy\" too.",
      "rating": 5.0,
      "verified": true,
      "author": "Nisha C.",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "Cute but very light",
      "text": "Very cute and pacifier is great. I would if preferred for the puppy to be a little more weighted. He is super light and falls off my baby easily. Was looking for a lovey that would stay on my newborn and support the pacifier a bit better.",
      "rating": 4.0,
      "verified": true,
      "author": "Myrabi",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Great for babies!",
      "text": "My 3 month old has just started to take a paci and he loves this one! When my 3 year old was younger he had 3 Wubbanubs because he loved them. Easy to clean; I wash it in the washing machine. Great product for babies. Easy for them to hold on to and easy to keep up with.",
      "rating": 5.0,
      "verified": true,
      "author": "C Bohannon",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Super cit",
      "text": "Super cute I think my son likes the dog more the then the pacifier though so I recommend checking that your child likes this type Paci and if they do this is a great options it makes it harder to lose and give the child something to play with when they get to moving those little fingers and messing with everything",
      "rating": 4.0,
      "verified": true,
      "author": "Shelly",
      "helpful_votes": 0,
      "publication_date": 20160316
    },
    {
      "title": "Great for baby!",
      "text": "This and an elephant version are used a good 5 hours a day or better by our under 1 year old. It it gives a great toy and pacifier in one item. Both have held up great so far and we literally don't leave home without one of them.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Edmondson",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "It was a hit!",
      "text": "I bought this as a shower gift for a friend after seeing it pop up on several lists of 'Must-have Baby Items' online. Her baby is now almost 3 months old and he loves it! She has bought 2 or 3 more so there is always one around because it soothes him more than any other pacifier. He loves to hold, feel, and squeeze the puppy and as he grows and gets more interested in things around him he seems to like it even more.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20150108
    },
    {
      "title": "They can be hand washed in the sink and they dry really nicely. My son is 1 now and he still ...",
      "text": "These hold up amazingly well. They can be hand washed in the sink and they dry really nicely. My son is 1 now and he still has the same one from when he was about 3 months old. We've added a few more doggiesas back ups and he loves them. It's nice because the pacifier is substantial enough for him hold on to when he was really young and now that he's a bit older it works as a lovie too",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny",
      "helpful_votes": 0,
      "publication_date": 20160116
    },
    {
      "title": "Fantastic pacifier toy",
      "text": "Our son loved his WubbaNub! He just recently gave up the pacifier, but up til now, he looked forward to going to bed each night so he could spend time with his WubbaNub. It helped him find his pacifier at night so we didn't have to go into his room and find it for him, and it works like a stuffed animal too, giving him comfort from the personality of the animal. If our second son, born recently, desires a pacifier as well, we'll be getting him a WubbaNub as well.",
      "rating": 5.0,
      "verified": true,
      "author": "AustinGirlie",
      "helpful_votes": 0,
      "publication_date": 20130530
    },
    {
      "title": "great product",
      "text": "Wubbanubs have been wonderful for my little one. He loves them and his Soothies, so I had no problem with the Soothie being attached. And even though he's still a little young to fully grasp them, they're big enough for him to hug easily and hold on to them that way. It's been great not to have to worry as much about pacis falling on the floor. This one is really cute and one of our favorites. I guess if I had a complaint, I'd ask to have more \"beans\" or filling in them to make them a tab bit heavier.",
      "rating": 5.0,
      "verified": true,
      "author": "jlr",
      "helpful_votes": 0,
      "publication_date": 20101005
    },
    {
      "title": "Great idea & product",
      "text": "This product makes it easier to find our son's pacifier when he throws it and drops it. He likes to chew on the stuffed part and snuggle with it, too. Also, for some reason, our dog doesn't think this pacifier is a toy to chew up, although he chews up the standalone ones, so that's great.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate Harder",
      "helpful_votes": 0,
      "publication_date": 20170618
    },
    {
      "title": "Perfect!",
      "text": "Very cute! I've heard great things about the WubbaNub and am looking forward to using it when my baby is born in June. Shipping was very fast and product arrived on time. Update: My little one loves this. I have regular pacifiers and he much prefers these. The puppy that is attached helps keep the soothie in his mouth. It is also great that the animal makes it easy to find!",
      "rating": 5.0,
      "verified": true,
      "author": "Jsimpson9813",
      "helpful_votes": 0,
      "publication_date": 20160223
    },
    {
      "title": "You'll never lose a pacifier again!",
      "text": "I've used these for a couple of years now and got this one after my third baby was born. It's so nice in the middle of the night to not lose the pacifier! They look funny hanging off of the baby's mouth, but they are awesome and I've found with my newborn that he doesn't lose the pacifier as much when he lets go of it because the dog just props up on his chest.",
      "rating": 5.0,
      "verified": true,
      "author": "Teachermom ",
      "helpful_votes": 0,
      "publication_date": 20151214
    },
    {
      "title": "Great idea.",
      "text": "I purchased this to go on top of a baby gift but my two year old granddaughter saw it and that was that. It drove her parents crazy because that was the only \"be bob\" she wanted. It is light, easy to find in the dark and I have to admit she looked adorable with that thing coming out of her mouth. too funny. She loved it. Great idea!",
      "rating": 5.0,
      "verified": true,
      "author": "cookie",
      "helpful_votes": 0,
      "publication_date": 20160401
    },
    {
      "title": "Cutest and softest pacifier around",
      "text": "We love the wubbanub pacifiers my daughter has owned four of them and they are just the cutest thing ever. They are soft but very durable for an active baby. They come in almost any animal you can think of and are the best quality around. My daughter is very rough on things and these little guys have stayed strong through it all. Definite favorite",
      "rating": 5.0,
      "verified": true,
      "author": "Lone star loonies",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Our favorite pacifiers",
      "text": "We had the giraffe WubbaNub until my older child misplaced it so we ordered the Brown Puppy as a back up (we ironically found the giraffe the day this one came!). My baby love this binky just as much as the giraffe - they are the only two binkies he'll take. They are also harder to lose and easy for the baby to grab and manipulate themselves. We recommend WubbaNubs to all of our new parent friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Carissa Bonham",
      "helpful_votes": 0,
      "publication_date": 20150106
    },
    {
      "title": "very useful!",
      "text": "This is very useful in the car seat when the baby is too small to hold in the paci. It will help keep the paci in the mouth. She can hold it easy too! Now that she is 8 motnhs old, we put it in her crib with her and if she wakes up she can find it herself and put it in her mouth. Again, I can not say how great this was for the car seat! It washes easy in the washing machine. I buy these for every baby shower I go to. They are cute, cuddly, and work great!!!! We love this product!!",
      "rating": 5.0,
      "verified": true,
      "author": "meg.miller",
      "helpful_votes": 0,
      "publication_date": 20110816
    },
    {
      "title": "Love these!",
      "text": "Wubbanubs are the best! I don’t know what we would do if we lost one.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Great gift",
      "text": "Bought it as a gift for a new mom. She raved over it and how cute it was and how easy it was for the baby to hold.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "He loved the brown puppy because he could hold his paws ...",
      "text": "Everyone should have several of these! We waited a month before introducing because we were warned about nipple confusion etc. We had no problems whatsoever. He loved the brown puppy because he could hold his paws with both hands, adorable mind you! And the soothie is number 1 recommended for exclusively breastfed babies! Will be our go to gift for showers and a must have for future babes.",
      "rating": 5.0,
      "verified": true,
      "author": "whancock",
      "helpful_votes": 0,
      "publication_date": 20150223
    },
    {
      "title": "So cute",
      "text": "My baby loves it and the puppy is so soft and cuddly",
      "rating": 5.0,
      "verified": true,
      "author": "hannah",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Great",
      "text": "Kid loves it, he seems to chew more on the actually doggy than the pacifier lol. We got this because we seen it was easier for them to hold and stay in place. It works pretty good, our boy is 4 months we don't use it as much for the pacifier but he likes to mess with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "LOVE the WubbaNub!",
      "text": "We have NEVER lost a WabbaNub! We love the soothie pacifiers, but they are always getting lost! Adding the super cute stuffed animal to the end was a brilliant idea! It's worth every penny! I have been purchasing this product for approximately 3 years now (I have five children) and love it so much I also purchase them as baby shower gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "Meghan Brown",
      "helpful_votes": 0,
      "publication_date": 20160614
    },
    {
      "title": "2-in-1: Great multipurpose item!",
      "text": "I love that my daughter hold onto this when it isn’t in her mouth. It’s a 2-in-1 pacifier and perfect sized stuffed animal!",
      "rating": 5.0,
      "verified": true,
      "author": "JONATHAN BELL",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "My baby's favorite pacifiers are the wubbanubs",
      "text": "My baby's favorite pacifiers are the wubbanubs! And I love them too! Easy to find and tends to stay near him (instead of being flung god knows where!). He so far doesn't have a preference for any particular animal, but we'll see what happens as he gets older!",
      "rating": 5.0,
      "verified": true,
      "author": "chocobeanie",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "\"Dog\"",
      "text": "My child has had WubbaNubs since he was in the NICU. He's 4 now, almost 5, I purchased this product a couple of years ago as a replacement. Once he turned 3 was easy to break him of using a binky since he got to keep \"Dog\". Dog just doesn't have a pacifier on his face now. Even now Dog is his favorite stuffed animal. That's why I recommend these, they have a use after outliving their original purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "Doug Jones",
      "helpful_votes": 0,
      "publication_date": 20140521
    }
  ],
  "product_meta": {
    "title": "WubbaNub Brown Puppy Pacifier",
    "rating": 4.8,
    "feature_bullets": [
      "WubbaNub Brand- The Original Pacifier/Plush Animal combination",
      "Durable one piece construction is both functional and stylish. Patented design makes it easy for baby to grasp",
      "Distributed in hospitals, NICU and well-baby units nationwide",
      "Made with medical-grade silicone pacifier. Latex free, BPA, PVC and Phthalate free",
      "Recommended for newborns through six months. (Not suggested for babies with teeth or in teething stage)"
    ],
    "specifications": {
      "Product Dimensions": "4 x 4 x 2 inches",
      "Item model number": "WN016",
      "Is Discontinued By Manufacturer": "No",
      "Safety warning": "Do not tie pacifier around child's neck as it presents strangulation danger.",
      "Target gender": "Unisex",
      "Minimum weight recommendation": "1 Pounds",
      "Maximum weight recommendation": "96 Pounds",
      "Material Type": "BPA Free, Latex Free",
      "Material free": "Latex Free",
      "Number Of Items": "1",
      "Batteries required": "No",
      "Dishwasher safe": "No",
      "Is portable": "No",
      "Item Weight": "6.1 ounces",
      "ASIN": "B001FGL9X0",
      "Customer Reviews": "4.8 out of 5 stars1,850 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#2,693 in Baby"
    },
    "categories": [
      "Pacifiers",
      "Baby Products",
      "Baby Care",
      "Pacifiers, Teethers & Teething Relief",
      "Baby"
    ],
    "price": 15.95
  }
}