{
  "website_summaries": [
    {
      "verdict": "A low-cost alternative source of heat and light that's not only portable, but doesn't have the offensive odor of some other brands.",
      "pros": [
        "Includes matches, and will burn for up to 36 hours on a single wick",
        "Some users report the candles keep them warm in extremely cold conditions during vehicle breakdowns",
        "Inexpensive enough to buy several to keep at home and in the car"
      ],
      "cons": [
        "May melt if stored at higher temperatures",
        "If using only one wick, make sure to rotate the wicks every three hours for even burning"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Really great and useful product!",
      "text": "I have purchased these candles many times over many years - they are great to have on hand not just for power outages, but to keep in your vehicle - in case you get stuck on the highway somewhere in the bitter cold. You can also (with the aid of a rack or makeshift type rack) set a can of food over the candle while it is providing light for you, and warm up your meal at the same time. I keep them in the vehicles, and back packs as well as on hand for power outages.",
      "rating": 5.0,
      "verified": true,
      "author": "Katya",
      "helpful_votes": 6,
      "publication_date": 20170203
    },
    {
      "title": "Less than half advertised burn time",
      "text": "Advertised as 36 hour candle If you only light one wick at a time. Got five hours on one wick which equals 15 hours total if you use all three. That means you have to use only one wick at a time and move it around often to get the 36 hours advertised. if you are using it for heating food it would be ok. The wicks are movable wicks. for all night heat I compared to a sterno 55 hour candle Which I used for seven nights at nine hours per night and the candle is only half burnt. I'll stick with the sterno!!",
      "rating": 3.0,
      "verified": true,
      "author": "David W. Crispin",
      "helpful_votes": 10,
      "publication_date": 20150816
    },
    {
      "title": "Light and heat in a handy can !",
      "text": "I'm glad that Coughlan's makes these...though I hope I never have to use them ! One of these live in each of our cars in the winter--in case there's car trouble and we're stuck somewhere. In Iowa that's a possibility. I like the fact that this is a large candle in a sturdy container--it would likely sit fine on the dash. My understanding is that with all three wicks going, it would last for 12 hours. 24, with two, and 36 with just one. These would also be good in case of a storm power outage, which is what they're kept handy for during the summer months.",
      "rating": 4.0,
      "verified": true,
      "author": "Kayt Rivermoon",
      "helpful_votes": 4,
      "publication_date": 20160417
    },
    {
      "title": "compact yet efficient",
      "text": "Provides good light and decent heat. I have been sitting in my truck with all 3 wicks lit and it had done a decent job of keeping it bearable inside. It is currently 9 degrees outside. I use this candle to warm my hands when I first get in the truck and its below zero out. The lid is useful in storing it and the metal tin will be reusable down the road. The candle has a small odor while burning but nothing overpowering. I will be buying more for my outdoor pack and other vehicles.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse Bock",
      "helpful_votes": 22,
      "publication_date": 20150203
    },
    {
      "title": "36-hour Candle",
      "text": "Works as advertised. I like the fact that a book of matches was sent with this candle. I live in Georgia & there are a lot of storms and hurricanes here. Semi-tropical weather. I will get good use out of this candle & will order more.",
      "rating": 5.0,
      "verified": true,
      "author": "Georgiagurl",
      "helpful_votes": 2,
      "publication_date": 20171101
    },
    {
      "title": "Great emergency candle",
      "text": "I decided to put together an emergency kit, and got three of these: one for the house, one for my Go Bag and one for the car. Each candle is supplied in a metal can with a tight fitting lid, and there are three wicks. One wick = 12 hrs (hence the 36 hour candle). Also, each candle has a pack of matches tucked inside. Good grab and go. I",
      "rating": 5.0,
      "verified": true,
      "author": "Rosebud",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "I keep one around just in case",
      "text": "I keep one of these in the house at all times just in case. It's low center of gravity makes tipping unlikely. The three wicks allow max brightness if needed, but also one can just light one or two to extend life (wicks far enough apart that they burn independently). Comes w matches but recommend a lighter for greater durability.",
      "rating": 4.0,
      "verified": true,
      "author": "hh",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Nice, but not exactly what i was looking for.",
      "text": "This is a nice item. It is a bit larger than I thought it would be. I probably should have looked at these sorts of items in a store before purchasing online. I wish the photos of these items had other items to compare the size. I wanted something smaller for my Bug Out/Emergency bag. This will work, but seems a little large. If I do not replace it, I will tape the tin lid down. It seems a little loose and could fall off. I gave it four stars because it is still a good product and a deal.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew G. Martinez",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "I decided to start upgrading our hurricane bag or as I like to call it our \"bug out\" bag",
      "text": "Since the ebola outbreak, I decided to start upgrading our hurricane bag or as I like to call it our \"bug out\" bag. We live in Texas so we are suppose to always be prepared for hurricane season. What I liked about this candle is the compact size, container and lid. My bag is for extreme emergencies, not just when electricity is out and I put candles around the house. It doesn't take up a lot of space so it made a perfect addition to my bag.",
      "rating": 5.0,
      "verified": true,
      "author": "KarenSue32",
      "helpful_votes": 2,
      "publication_date": 20141217
    },
    {
      "title": "Great product! This candle is true to its description",
      "text": "Great product! This candle is true to its description. Have used it several times and there is hardly a dent in the wax. It's going to last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 3,
      "publication_date": 20161110
    },
    {
      "title": "Recommend addition to anyone's car who drive in a climate ...",
      "text": "Smaller than I expected, but still a quality product. Smaller size actually lets me \"tuck\" this into the glove box. Recommend addition to anyone's car who drive in a climate that receives snow cover.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Good Candle with Bonus Matches!",
      "text": "This is a good emergency candle. I wanted it for a back pack but it is a little large but I am using it anyway. I probably would go with something smaller if I were to purchase it again. But it is as described and I am satisfied with the purchase. Just be sure to burn one wick at a time for maximum hours of burn time.",
      "rating": 5.0,
      "verified": true,
      "author": "Lila",
      "helpful_votes": 0,
      "publication_date": 20150702
    },
    {
      "title": "For emergency lighting",
      "text": "Watched an apocalyptic movie where they lost power, I immediately bought these, just in case. Lol. And they come with matches, into the emergency bug out box they go....",
      "rating": 5.0,
      "verified": true,
      "author": "Ruffian",
      "helpful_votes": 2,
      "publication_date": 20160823
    },
    {
      "title": "Would have never believed this tiny candle with three wicks would last so long",
      "text": "I know its a survival candle but I got it to put used it in side my house to light pictures of my baby who had passed and this lasted almost two full days.",
      "rating": 4.0,
      "verified": true,
      "author": "Zavala",
      "helpful_votes": 5,
      "publication_date": 20141218
    },
    {
      "title": "Four Stars",
      "text": "Great, but find a good base to put them on as they get hot after some time",
      "rating": 4.0,
      "verified": true,
      "author": "Paul Madib",
      "helpful_votes": 2,
      "publication_date": 20170224
    },
    {
      "title": "It works",
      "text": "It works. Went packing with a chum and he one of these with him. I laughed that for three days he had one candle. I wasn't laughing after the third day. He light it for 10 hours from late afternoon to past midnight. Now their are in my pack.",
      "rating": 5.0,
      "verified": true,
      "author": "James Mann",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "Peace of mind",
      "text": "Gift for my son on his trip to college and home. Just in case",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Four Stars",
      "text": "THis is a gift - for someone putting together a disaster kit. 1 of several items to fill it",
      "rating": 4.0,
      "verified": true,
      "author": "Terrie Lynn Bagnuolo",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "Excellent",
      "text": "A must in an emergency kit. We have used many of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 2,
      "publication_date": 20170311
    },
    {
      "title": "I am very satisfied.",
      "text": "Came as advertised. Even has a book of matches under the lid. I am very satisfied. For those whining about the 36 hour burn time if using only one wick at a time, it is clearly written in the description: \"Burning time is 36 hours using one wick at a time or 12 hours using three at once.\"",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Lemons",
      "helpful_votes": 0,
      "publication_date": 20151002
    },
    {
      "title": "Pricey",
      "text": "Pricey for what you get. Found them later in a b&m store for considerably less. Do like that tin has a lid, but the metal is thin so use care if you intend to use multiple times and/or re-use. The one to three wick option is nice.",
      "rating": 4.0,
      "verified": true,
      "author": "LS",
      "helpful_votes": 0,
      "publication_date": 20150703
    },
    {
      "title": "Good candle, but the lid always comes off in storage.",
      "text": "I bought this to keep in my emergency box. I wish the lid stayed closed tighter. It always comes open in the box and I ended up having to rubber band it shut.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20160411
    },
    {
      "title": "Four Stars",
      "text": "I think it will be fine, wanted this for a power outage",
      "rating": 4.0,
      "verified": true,
      "author": "Blue Sky",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "Emergency candle",
      "text": "This candle is of substantial size. I have not used it because I bought it for power outages because I live in the country (we're almost one of the last to get power back). When it arrived it was not melted which was a relief.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Triplett",
      "helpful_votes": 0,
      "publication_date": 20150901
    },
    {
      "title": "Hard to open container.",
      "text": "Very hard to open. Comes with matches. Case seems waterproof.",
      "rating": 3.0,
      "verified": true,
      "author": "Spiritous",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Seems like a good product ...",
      "text": "Seems like a good product and well made but I haven't used it yet so my feedback isn't going to be of much help. I purchased this as part of my emergency kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Shep.",
      "helpful_votes": 0,
      "publication_date": 20150610
    },
    {
      "title": "Survival Candle is a great product",
      "text": "Should have purchased a couple more of these candles. I originally purchased for my backpack and now I find I could use them for the house and car for emergencies.",
      "rating": 5.0,
      "verified": true,
      "author": "Bailey",
      "helpful_votes": 0,
      "publication_date": 20150424
    },
    {
      "title": "Good addition to my emergency supplies",
      "text": "While I haven't had to use it, yet; I find this a great addition to any bug out bag, camping, or emergency supply kit. This a very affordable candle that is compact and light weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Chops",
      "helpful_votes": 0,
      "publication_date": 20140623
    },
    {
      "title": "Bought to put in my family's Grab-N-Go bag for emergency ...",
      "text": "Bought to put in my family's Grab-N-Go bag for emergency situations. Haven't had to need to use it yet but the hard canister case will help protect the candle from everything else that's stuffed in the bag.",
      "rating": 5.0,
      "verified": true,
      "author": "DIYdude",
      "helpful_votes": 0,
      "publication_date": 20151221
    },
    {
      "title": "great for driving in unpopulated areas",
      "text": "Part of my car emergency kit, great for driving in unpopulated areas. Even in the summer, it can get cold enough to want to use these, depending on where you're going.",
      "rating": 5.0,
      "verified": true,
      "author": "G R",
      "helpful_votes": 0,
      "publication_date": 20140721
    },
    {
      "title": "Great emergency candle",
      "text": "I bought a few of these during last hurricane season. Just came online now to restock for this year. These work GREAT! They burn quietly and barely has an order. Three wicks makes for a very bright candle and they last a couple of hours. Also, because of the 3 wicks, this guy gives off alot of heat. I also boiled a cup of water for some soup within 10-12 minutes (rolling boil). These aren't tiny by they are compact. I like to stack about 15 of those in the closet just in case. Knock out two tasks with one purchase. Great for lighting and great for cooking small meals.",
      "rating": 5.0,
      "verified": true,
      "author": "ADAM WILLSON",
      "helpful_votes": 19,
      "publication_date": 20130508
    },
    {
      "title": "A very straightforward product at a fair price. There ...",
      "text": "A very straightforward product at a fair price. There was an issue with the first order, so they ship the replacement without any question.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "Multiple uses from warmth and light to cooking.",
      "text": "It's use is pretty self explanatory. Doesn't take up much space. Good product to have handy in an emergency.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Mastroianna",
      "helpful_votes": 0,
      "publication_date": 20150921
    },
    {
      "title": "good",
      "text": "Used for a camping gift basket. Great size, reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Janna H",
      "helpful_votes": 0,
      "publication_date": 20160525
    },
    {
      "title": "These survival candles are in my survival bag. I'm ...",
      "text": "These survival candles are in my survival bag. I'm sure they will be suitable for the need when the time comes.",
      "rating": 4.0,
      "verified": true,
      "author": "Happy",
      "helpful_votes": 0,
      "publication_date": 20150417
    },
    {
      "title": "Four Stars",
      "text": "Much smaller then visualized but useful in my bug out bag",
      "rating": 4.0,
      "verified": true,
      "author": "John Langevin",
      "helpful_votes": 0,
      "publication_date": 20150730
    },
    {
      "title": "Great Addition To Emergency Kit",
      "text": "Haven't used yet, but added to emergency kit. And it came with matches inside of the container. Bonus!!!",
      "rating": 5.0,
      "verified": true,
      "author": "TorieTx",
      "helpful_votes": 0,
      "publication_date": 20151202
    },
    {
      "title": "Bug out bag or camping worthy",
      "text": "Bug out bag worthy. I love the 3 wick option. Howard Gelfman, MD",
      "rating": 5.0,
      "verified": true,
      "author": "Howard Gelf",
      "helpful_votes": 0,
      "publication_date": 20160108
    },
    {
      "title": "Got these for our survival kits. They are exactly ...",
      "text": "Got these for our survival kits. They are exactly what I expected, now I just need to buy some matches...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151127
    },
    {
      "title": "Let's hope I never need to use a survival candle!",
      "text": "I bought this for my emergency earthquake kit. Let's hope I never have to use it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sdarebrady",
      "helpful_votes": 0,
      "publication_date": 20150911
    },
    {
      "title": "Serves my purpose.",
      "text": "Serves purpose I bought it for. 36 hours is if you light one candle. If you light all 3 at once you have a 12 hour candle.",
      "rating": 4.0,
      "verified": true,
      "author": "Darry Welker",
      "helpful_votes": 0,
      "publication_date": 20150102
    },
    {
      "title": "Maybe your bestir back-UP...",
      "text": "I have several LED flashlights and lanterns for my emergency kits, but this may be the best back-up for some light and a little heat..I think it is over priced, but it is the best (and most complete) product I have found available. Batteries do not survive long in the summer heat in Texas. I bought several for my various emergency kits. (I live in tornado alley).",
      "rating": 3.0,
      "verified": true,
      "author": "John Lochaby",
      "helpful_votes": 4,
      "publication_date": 20110622
    },
    {
      "title": "Worth Getting!!!!",
      "text": "A must have in case of an emergency!!!!! I recommend everyone to get one!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sal R",
      "helpful_votes": 0,
      "publication_date": 20150423
    },
    {
      "title": "A little small. Will probably do the trick",
      "text": "Haven't used this yet as it is for my emergency kit. Looks a little small though. I was expecting something larger",
      "rating": 4.0,
      "verified": true,
      "author": "Emily Williams",
      "helpful_votes": 0,
      "publication_date": 20160610
    },
    {
      "title": "Should the road freeze, I am now a little more prepared.",
      "text": "I gave it all five stars. The truth is, however, I haven't used it yet, and hope I never do. I've been caught unexpectedly by an unexpected winter storm (sleet, freezing rain, snow) when touring on my motorcycle while being woefully and utterly unprepared for hunkering down if the road freezes. It's small, lightweight, and easily packs into a saddlebag. I just hope the interstate I'm biking on never freezes. If the worst case scenario does occur, now I can huddle under the motorcycle cover with a candle to warm me.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan F.",
      "helpful_votes": 0,
      "publication_date": 20140401
    },
    {
      "title": "Candles bought for Bug out Bag",
      "text": "Candles bought for Bug out Bag. They are exactly as advertised.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20150212
    },
    {
      "title": "Well it lasted 36 hours",
      "text": "Happy with it I used it while camping good product good price was totally worth it thank you",
      "rating": 3.0,
      "verified": true,
      "author": "Michael bailey",
      "helpful_votes": 0,
      "publication_date": 20150311
    },
    {
      "title": "Seems a decent product, but melted and spilled through case in hot car",
      "text": "Seems a decent product, however, I wanted to leave it in my car as an emergency item. Recently went to clean out the car and the candle was on it's side in the storage area. Candle melted in the summer heat and the wax spilled out of the case, ruining the candle. Not really the candle's fault, but if you are going to keep one of these in a car or anywhere else that gets hot, store it flat. It will melt and you don't want it to leak out.",
      "rating": 3.0,
      "verified": true,
      "author": "pdm",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Coghlans 36 HOURS SURVIVAL CANDLE,6 OZ",
      "text": "Solid candle, well-made and ready to go in case of emergencies!",
      "rating": 5.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20140703
    },
    {
      "title": "Five Stars",
      "text": "It's a candle in a can. What more can I say?",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20150212
    },
    {
      "title": "Glad to have it",
      "text": "Had tk use it already on the mountain. Glad to have it!",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia H. Holyoak",
      "helpful_votes": 0,
      "publication_date": 20140819
    },
    {
      "title": "Four Stars",
      "text": "I have not burned these candles yet but it was larger than I expected when it arrived.",
      "rating": 4.0,
      "verified": true,
      "author": "mom of twins",
      "helpful_votes": 0,
      "publication_date": 20140910
    },
    {
      "title": "I have been wanting one of these for camping",
      "text": "Mine came on exact date as promised, the box it came in was dented in and the tin had a few dents in it but that's no big deal to me,the matches were in it, all in all i like it and would gladly buy more of these.",
      "rating": 4.0,
      "verified": true,
      "author": "sheree burke",
      "helpful_votes": 0,
      "publication_date": 20140710
    },
    {
      "title": "Preppy Item",
      "text": "I'll let you know how this really works in September. That should be the real test. I'm not a Doom and Gloom sort of person, if anything a Pollyanna. But I plan to be ready unless I get to get uplifted in the Rapture. Since I want to be sure either way (not if I get to go in the Rapture or not!) but if the Rapture doesn't come before I need it.....then it's good to have on hand. I can barely see as it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Paris",
      "helpful_votes": 0,
      "publication_date": 20150711
    },
    {
      "title": "Item as advertized! Will buy more in the future for famiy and friends",
      "text": "three wicks, able to choose how many are lit Like the can itself, compact metal. Can be refilled just need more wick",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140318
    },
    {
      "title": "Looks good. Simply waiting for an emergency (which I hope ...",
      "text": "Looks good. Simply waiting for an emergency (which I hope never happens) to test it out.",
      "rating": 5.0,
      "verified": true,
      "author": "wmills",
      "helpful_votes": 0,
      "publication_date": 20141130
    },
    {
      "title": "In my canyon survival kit",
      "text": "It's a candle, it burns. What else do you need to know?",
      "rating": 5.0,
      "verified": true,
      "author": "Gustavo S.",
      "helpful_votes": 0,
      "publication_date": 20160911
    },
    {
      "title": "A good emergency candle",
      "text": "They're small, cheap, and burn for hours so good to have a few around for emergencies. Just remember that if you burn all 3 wicks at once it only lasts 1/3 (or less) than the suggest time.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt @ LookIntoHawaiiDotCom",
      "helpful_votes": 4,
      "publication_date": 20130412
    },
    {
      "title": "fast shipping good value",
      "text": "this was fast shipping and a good value for these candles. i ordered two and can't wait to take them on my first camping trip in years. i like that they are 36 hour candles so i can use them for multiple nights.",
      "rating": 5.0,
      "verified": true,
      "author": "J Oliver",
      "helpful_votes": 0,
      "publication_date": 20140305
    },
    {
      "title": "Good to have on hand!",
      "text": "I got 2 of these 36 hour candles just to have on hand. I plan to keep one in my truck and the other in a bug out bag. That way, I at least have one available for whatever may come my way.",
      "rating": 5.0,
      "verified": true,
      "author": "Feisty Viking",
      "helpful_votes": 0,
      "publication_date": 20140222
    },
    {
      "title": "For emergency supplies",
      "text": "Candle is smaller than I expected. If it indeed lasts 36 hours I will be impressed. This is for our emergency stash that I hope we never have to use.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Waters",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "Compact. With 3 wicks you get some flexibility, ...",
      "text": "Compact. With 3 wicks you get some flexibility, as situation dictates. Added these as a secondary light / heat source in the 3-day emergency bags of each vehicle. ( Don't forget the matches !! )",
      "rating": 4.0,
      "verified": true,
      "author": "StevieW",
      "helpful_votes": 0,
      "publication_date": 20150221
    },
    {
      "title": "Good price, good value, great for the car emergency kit!",
      "text": "Good price, good value, great for the car emergency kit! By the time this candle runs out, you're either rescued or in deep kimchee! Comes with a book of matches inside the tin, which I thought was a nice touch.",
      "rating": 5.0,
      "verified": true,
      "author": "BacchusTop Contributor: Camping",
      "helpful_votes": 0,
      "publication_date": 20160928
    },
    {
      "title": "I have not lit this candle as it is for ...",
      "text": "I have not lit this candle as it is for my winter survival kit in the car, but it is exactly as I expected it to be.",
      "rating": 5.0,
      "verified": true,
      "author": "S. N.",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "36 hour candle",
      "text": "bought this for a possible earthquake..... which I hope doesn't happen. I imagine it will be great. One time I lost power and had all scented candles. Wow!",
      "rating": 5.0,
      "verified": true,
      "author": "Pat T.",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Must have for emergeny situations",
      "text": "Great to have in case of emeregency for bug out bags, power outage and/or for camping. Great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Johanna johnston",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "Cohlans 36 Hours Surv. Candle",
      "text": "Thank you for selling a product needed for emergency situations. I believe, it'll be helpful, once the time comes.",
      "rating": 5.0,
      "verified": true,
      "author": "Lolita",
      "helpful_votes": 0,
      "publication_date": 20161030
    },
    {
      "title": "Coghlan's Survival Candle",
      "text": "I bought (6) of these to put in \"Emergency Home Survival Kits\" my wife wanted me to put together for our (3) grown children. Fortunately, they have not had any need for those kits yet...so I can't vouch for how well these candles perform. But I can vouch for how neat of an idea my wife thought it was to put these into those kits. Maybe yours will too LOL!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Cole",
      "helpful_votes": 0,
      "publication_date": 20130605
    },
    {
      "title": "good price, shipped fast",
      "text": "I will be using this on my porch during the dark winter nights, good price, shipped fast, A+.",
      "rating": 5.0,
      "verified": true,
      "author": "incognito",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "I have it in my car survival kit for the ...",
      "text": "I have it in my car survival kit for the winter. I hope not to ever need to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcus",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "It's a candle, what can I say?",
      "text": "Can was dented. But who cares. All I can say is: It better work if I ever need it.",
      "rating": 4.0,
      "verified": true,
      "author": "COUNTY CORONER",
      "helpful_votes": 0,
      "publication_date": 20161020
    },
    {
      "title": "It works....",
      "text": "Don't know what to say. It's an emergency candle. It's bigger than I thought. It most likely ignites like every other candle ever made.",
      "rating": 5.0,
      "verified": true,
      "author": "Coolstorybro18",
      "helpful_votes": 0,
      "publication_date": 20140520
    },
    {
      "title": "Glad to have them",
      "text": "Have them in the house for emergencies, also in my car. Have not tested the heat factor yet, but hope it will warm up a car if I am ever stranded. Nice, compact, comes with instructions so I know how much candle power to use. Would like to get some even bigger than these.",
      "rating": 5.0,
      "verified": true,
      "author": "Kd Light",
      "helpful_votes": 0,
      "publication_date": 20140216
    },
    {
      "title": "Survival Kit",
      "text": "Gives me confidence to know this candle is available if and when I need it. It is part of a vehicle survival kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Juanita Larraine Davis",
      "helpful_votes": 0,
      "publication_date": 20130301
    },
    {
      "title": "great",
      "text": "Great product I would recommend it to anyone! I really enjoyed what I received. Merry Christmas to all and a Happy New Year",
      "rating": 5.0,
      "verified": true,
      "author": "Vazolicious",
      "helpful_votes": 0,
      "publication_date": 20130108
    },
    {
      "title": "Seems to be as described.",
      "text": "I have not used this product yet, it is for my bugout bag, but I am sure it will work well.",
      "rating": 5.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20130614
    },
    {
      "title": "Five Stars",
      "text": "Excellent addition to the SpeerOpTech, Self Care and Survival Kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Crossley",
      "helpful_votes": 0,
      "publication_date": 20150209
    },
    {
      "title": "A bit on the heavy side",
      "text": "Works just as described but if you are trying to minimize weight, this is not the product you are seeking.",
      "rating": 2.0,
      "verified": true,
      "author": "Prime Me",
      "helpful_votes": 9,
      "publication_date": 20121217
    }
  ],
  "product_meta": {
    "title": "Coghlan's 36-Hour Survival Candle, 6-Ounce",
    "description": "Great for camping or emergency preparedness, the Coghlan's 36-Hour Survival Candle features three wicks that each burn up to 12 hours -- giving you a total of 36 hours of candle light if used one at a time. The three wick allow for variable light and heat, enabling you to burn one or all three. Matches and a cover are included for added convenience. It weighs 6 ounces. Coghlan's makes the outdoors more comfortable and enjoyable with over 450 accessories for camping, hiking, fishing, and RVing -- from cooking gear to first aid kits, insect netting, firestarters, tent repair, and more.",
    "rating": 4.6,
    "feature_bullets": [
      "Compact, lightweight candle with three wicks can burn up to 36 hours (up to 12 hours per wick)",
      "Metal canister with cover protects candle; includes matches; weighs 6 ounces",
      "Affordable, essential gear for camping, backpacking, backcountry treks, emergency preparedness, and more"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1.5 x 5.5 x 4.25 inches; 8 Ounces",
      "Item model number": "9248",
      "Department": "Unisex-adult",
      "Date First Available": "June 3, 2008",
      "Manufacturer": "Coghlan's",
      "ASIN": "B001ANZJW0",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Camping & Hiking",
      "Sports & Outdoors",
      "Safety & Survival",
      "Outdoor Recreation"
    ],
    "price": 9.98
  }
}