{
  "website_summaries": [
    {
      "verdict": "This highly absorbable calcium supplement supports cardiovascular health, colon health, and much more.",
      "pros": [
        "Formulated with pure ingredients that deliver predictable results",
        "Free from wheat, gluten, egg, peanuts, magnesium stearate, hydrogenated fat, and artificial sweeteners and colors",
        "All ingredients are GMO-free",
        "Contains calcium citrate"
      ],
      "cons": [
        "Does not contain vitamin D. More expensive than similar calcium supplements"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Bottle a little smaller than expected",
      "text": "The packaging and the bottle size were a little smaller than I was expecting based on the pictures. The pills are large capsules around 1.25 inches long. I made a video showing the packaging and the pill size.",
      "rating": 4.0,
      "verified": true,
      "author": "Adam W.",
      "helpful_votes": 128,
      "publication_date": 20180306
    },
    {
      "title": "Best that I have tried - no abdominal distress",
      "text": "I’ve tried several brands that seem to lead to abdominal pain. No problem with this brand. I take two pills at night to ward off menopause hot flash symptoms. It works for me. I ran out of this and the hot flashes immediately came back. Got the refill and for four days the hot flashes got less and less. Now they are gone again.",
      "rating": 5.0,
      "verified": true,
      "author": "JA KlingTop Contributor: Pets",
      "helpful_votes": 45,
      "publication_date": 20190218
    },
    {
      "title": "Probably the best there is",
      "text": "My doctor is a “longevity” MD and PharmD. He does micronutrient blood test every 6 mo. and needed calcium due to femor-neck deterioration on Dexa scans. Tried various brands and noticed that Pure Encapsulations was recommended by the Hartwigs in their book It Starts With Food, so use this product with Jarrow MK-7 for 12 months and not only slowed but REVERSED bone loss. 3 capsules 2x day. 68-year old athlete.",
      "rating": 5.0,
      "verified": true,
      "author": "N1ven",
      "helpful_votes": 25,
      "publication_date": 20190718
    },
    {
      "title": "Animal (Dairy) eater to Vegan",
      "text": "I did research when I went vegan and found two types of calcium supplements, Carbonite (elemental) and these \"citrate\". I am taking both. I can say these do not have any side effects. I am not a calcium genius, but I can say I process these supplements a lot better than I did dairy (source of calcium).",
      "rating": 5.0,
      "verified": true,
      "author": "Jason MP",
      "helpful_votes": 32,
      "publication_date": 20180123
    },
    {
      "title": "Calcium is an important thing to add to an everyday diet.",
      "text": "I take Calcium for my skeletal health, but do not like to combine it with other minerals; those other minerals are important, but I take them separately and not included in the same pill as my Calcium; therefore, this particular product is perfect for my own use and health.",
      "rating": 5.0,
      "verified": true,
      "author": "Theta Cerveri",
      "helpful_votes": 19,
      "publication_date": 20180810
    },
    {
      "title": "Great size and love that it's a capsule, not a tablet!",
      "text": "I highly respect the quality of Pure. Love that I have finally found a calcium that I can easily swallow a couple times a day and not risk choking!",
      "rating": 5.0,
      "verified": true,
      "author": "Joni",
      "helpful_votes": 25,
      "publication_date": 20170823
    },
    {
      "title": "I ask people not to buy this product.",
      "text": "I ordered this product for osteoporosis. I was taking 1000 mg. Serving size was 4 capsules. This one is 300 mg. and serving size is 2. I have to take 7 capsules to make equals to what I was taking. I’m very upset about having this product. I have to take 1200 mg. It means I have to take 8 capsules to make my right dose. I’ll never even look at this product.",
      "rating": 1.0,
      "verified": true,
      "author": "cecilia",
      "helpful_votes": 6,
      "publication_date": 20200408
    },
    {
      "title": "Made my stomach upset",
      "text": "These calcium supplements made me feel nauseous, and that was with taking them with food. Taking 2 only gives you 23% of your daily needs, so you would need to take these throughout the day. I am drinking fortified almond milk instead. I would not buy this again.",
      "rating": 2.0,
      "verified": true,
      "author": "Happy Mac User",
      "helpful_votes": 10,
      "publication_date": 20181022
    },
    {
      "title": "calcium in capsules not giant tabs!",
      "text": "I have used Pure calcium citrate for years. Unlike most calcium citrate pills which are huge hard lumps of compressed stuff- these pills from Pure Encapsulations are smaller, easy to swallow capsules! Pure is a very fine company.",
      "rating": 5.0,
      "verified": true,
      "author": "No Stone Left Unturned",
      "helpful_votes": 14,
      "publication_date": 20170505
    },
    {
      "title": "BE CAREFUL WITH THIS PRODUCT IF YOU CANNOT TOLERATE ASCORBYL PALMITATE",
      "text": "Was looking for a substitute calcium product now that TwinLab Calcium Citrate has added D3 (which I can't tolerate) to their formula. Caused severe upset stomach and pain that lasted for a couple of days. Took only one pill to get this reaction. If you have problems with added vitamin C, this might not be the product for you. Also you might want to research ascorbic palmitate before purchasing.",
      "rating": 1.0,
      "verified": true,
      "author": "Surela",
      "helpful_votes": 7,
      "publication_date": 20190522
    },
    {
      "title": "Anytime I can order vitamins without additives I am happy. Love the fact that this is a magnesium ...",
      "text": "Anytime I can order vitamins without additives I am happy. Love the fact that this is a magnesium stearate free product.",
      "rating": 5.0,
      "verified": true,
      "author": "Libelle",
      "helpful_votes": 13,
      "publication_date": 20180106
    },
    {
      "title": "To reach recommended dose, take 8/day",
      "text": "Pure encapsulations products are typically excellent, so I felt comfortable purchasing the calcium citrate. I also wanted an easier to swallow option for Calcium. These are fairly easy to swallow because of being capsules. At my age, 1200mg per day of Calcium is recommended. That means 8 capsules! I never took more than 4 per day and it gave me an upset stomach. I stopped taking it and purchased another product. I'm going to see if I can return this, since I can't tolerate it.",
      "rating": 2.0,
      "verified": true,
      "author": "Howdy",
      "helpful_votes": 2,
      "publication_date": 20200217
    },
    {
      "title": "Four Stars",
      "text": "Doc told me to take it. He said other types of calcium are not absorbed by your body.",
      "rating": 4.0,
      "verified": true,
      "author": "Donna Chocianowski",
      "helpful_votes": 9,
      "publication_date": 20180627
    },
    {
      "title": "Are the side effects normal?",
      "text": "I first purchased a calcium supplement in Costco and felt that it helped with my teeth. Encouraged by this feeling, I did a little research and found out that supplement contains calcium carbonate that can lead to low absorbency. So I purchased this product. However, this product makes me nauseous and causes constipation. I think it still helps with bone strength. But the side effects worry me. Anyone has the same experience? Are they results of higher absorbency?",
      "rating": 3.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 5,
      "publication_date": 20190726
    },
    {
      "title": "Doesn't Upset Stomach",
      "text": "These are perfect. When my doctor told me my calcium levels were low I needed a supplement. I'd used PURE in the past with great results. They always agree with my system. Some vitamin supplements don't and I can get headaches with some. These have no side effects on me and I'm building my calcium levels.",
      "rating": 5.0,
      "verified": true,
      "author": "DazzlingDame",
      "helpful_votes": 5,
      "publication_date": 20181105
    },
    {
      "title": "Strong nails",
      "text": "My nails were getting soft and I don't eat much, so added this to the regime. My nails are super hard now. No complaints, will continue buying :)",
      "rating": 5.0,
      "verified": true,
      "author": "shelley B",
      "helpful_votes": 7,
      "publication_date": 20180816
    },
    {
      "title": "Excellent product with no additive to make one ill.",
      "text": "After years of trying to find a calcium pill that would not make me sick, this product is excellent. However, the one drawback is the capsule could be a 1/4 size smaller for easier swallowing.",
      "rating": 4.0,
      "verified": true,
      "author": "Cathy McElroy",
      "helpful_votes": 2,
      "publication_date": 20191026
    },
    {
      "title": "It’s calcium",
      "text": "It’s calcium ... Big pills to swallow but it doesn’t upset my stomach which is awesome",
      "rating": 4.0,
      "verified": true,
      "author": "Diana2dogs Painter",
      "helpful_votes": 3,
      "publication_date": 20190905
    },
    {
      "title": "Calcium good, but can't digest the capsule",
      "text": "For anyone else who had stomach issues with these, it might be the capsule type. Once I started opening the pills and mixing them into yogurt, I was fine. This type of calcium is useful for pregnant people with MTHFR who shouldn't overdue calcium carbonate.",
      "rating": 3.0,
      "verified": true,
      "author": "IAN T LANZILLOTTI",
      "helpful_votes": 2,
      "publication_date": 20200626
    },
    {
      "title": "PURE Calcium ..good brand!",
      "text": "I know, for sure, that these capsules are doing well for me. After i ran out of these for a week, ,my muscles began some serious cramping...legs and hands... which is not a normal for me..! I cant eat dairy, so these are a must for me. RECOMMEND I dont like fortified calcium because its easy to overdose on additives.",
      "rating": 5.0,
      "verified": true,
      "author": "R M Murphy",
      "helpful_votes": 2,
      "publication_date": 20191003
    },
    {
      "title": "Be Careful",
      "text": "I have no idea what I consumed when I took these, immediate return.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 2,
      "publication_date": 20200207
    },
    {
      "title": "product management?",
      "text": "When I received at first, the lit and sticker were already open. After I exchanged, the second one is okay but I do not think I will buy next time.",
      "rating": 2.0,
      "verified": true,
      "author": "hero",
      "helpful_votes": 2,
      "publication_date": 20200605
    },
    {
      "title": "Five Stars",
      "text": "Love this brand. Blood tests show an improvement in my calcium levels.",
      "rating": 5.0,
      "verified": true,
      "author": "norainshine",
      "helpful_votes": 5,
      "publication_date": 20180224
    },
    {
      "title": "Too Big",
      "text": "I tried these but I found that they were difficult to swallow and harsh. My husband didn't have any issues but I didn't feel great taking these.",
      "rating": 2.0,
      "verified": true,
      "author": "CatSttl",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Pure encapsulation calcium",
      "text": "I buy this brand because I t doesn’t give me indigestion like regular vitamins",
      "rating": 4.0,
      "verified": true,
      "author": "michele G",
      "helpful_votes": 4,
      "publication_date": 20190113
    },
    {
      "title": "Good brand",
      "text": "I bought for my mom because after having her cancer treatment her doctor recommended her to start taking calcium. I researched and found out that calcium citrate absorbs faster into the syste. She also has the Magnesium citrate and she’s had good results with these two",
      "rating": 5.0,
      "verified": true,
      "author": "flkar",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Good Product",
      "text": "Pure Encapsulations makes decent products so I can recommend them as being very good and high quality",
      "rating": 4.0,
      "verified": true,
      "author": "kabbalah",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Good quality!",
      "text": "seems after eating it my hair loss got less, superise!",
      "rating": 5.0,
      "verified": true,
      "author": "Leo K.",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Bottle less than half full",
      "text": "The bottle was half full and the capsules were large. I was looking for calcium citrate that did not have magnesium so I thought I'd give this a try. I will not buy this again.",
      "rating": 3.0,
      "verified": true,
      "author": "Catherine K. Howard",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "More energetic",
      "text": "Bought it for my mom. She likes how she feels a couple of weeks after taking this supplement!",
      "rating": 5.0,
      "verified": true,
      "author": "Anne",
      "helpful_votes": 2,
      "publication_date": 20190308
    },
    {
      "title": "Faulty Tamper proof seal",
      "text": "didn’t try the product because the tamper proof seal had a hole that looked purposely cut in the middle. tried to get a return /exchange slip and kept getting an “error” message. pretty disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Shoegal",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Easy to swallow",
      "text": "Most calcium supplements are big and chunky and hard to swallow, but these are very light and easy to swallow. I don't know if they are doing their job but I will continue to take them.",
      "rating": 4.0,
      "verified": true,
      "author": "Jules C",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Good supplements",
      "text": "Good product, but I gave only four stars because they are too big for one to swallow.",
      "rating": 4.0,
      "verified": true,
      "author": "mychrist",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Adding",
      "text": "Since using this form of calcium for the past month I can feel a big difference. My back pain has slowly subsided over the past weeks. So far so good. I will certainly continue to use this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley C.",
      "helpful_votes": 2,
      "publication_date": 20190113
    },
    {
      "title": "Work Well",
      "text": "Really trust this brand and their products. Theh come recommended by my doc.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "I take this every day.",
      "text": "A great supplement and I have found no fault with the advertising by the company. I will continue to buy this product as long as it is being manufactured.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Too large for my pill box",
      "text": "It is almost impossible to fit these tablets in my pill box with other supplements",
      "rating": 3.0,
      "verified": true,
      "author": "Gooch",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Good product",
      "text": "Usually my system doesn't react well to calcium supplements, but this product I am able to absorb with little or no side effects.",
      "rating": 5.0,
      "verified": true,
      "author": "John J",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Easy",
      "text": "Calcium supplement without Vit D and larger amount of Calciium per capsule",
      "rating": 5.0,
      "verified": true,
      "author": "Joan Karp",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Most easily absorbed form of calcium!",
      "text": "Huge bottle! Easy to absorb & great value for the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsey S",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Disappointing",
      "text": "Too many pills (8) required daily for normal dose. They are small & easy to swallow but who wants to take 8 pills? I like the Yarrow brand better.",
      "rating": 2.0,
      "verified": true,
      "author": "Julia Anne Bourne",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "size of pill",
      "text": "These pills are the same size and color of the 'pure' magnesium. My husband takes many pills and this has never happened before. I did not realize It, and some of the pills got mixed together. I could not tell which was which. I will not be buying either of these again.",
      "rating": 1.0,
      "verified": true,
      "author": "Prudence",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Quality product",
      "text": "I have a rare genetic disease that affects my bodies calcium levels. This product is as it states Pure, not all the fillers that you get in most other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "April Spears",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "I like the product.",
      "text": "Have taken it for a week. Seems very good so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Chen",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Upset",
      "text": "Still upsets my stomach. But if I take one at a time it helps",
      "rating": 3.0,
      "verified": true,
      "author": "M C ",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Five Stars",
      "text": "Great product but because I have difficulty swallowing, had to change to a liquid form.",
      "rating": 5.0,
      "verified": true,
      "author": "Living Like Larry",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "This is a reorder since I've found I like the product so much",
      "text": "High quality calcium. This is a reorder since I've found I like the product so much.",
      "rating": 5.0,
      "verified": true,
      "author": "tuffy1",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Five Stars",
      "text": "Great Product, I've been very happy with all the PURE products I've purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "Norman D Amstutz",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "large capsule",
      "text": "Be ready for a very large capsule. I've never had a problem swallowing pills, but these are challenging.",
      "rating": 4.0,
      "verified": true,
      "author": "Sally A. Gee",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Great Product",
      "text": "I use this product regularly. Hard to get exactly what I need at local stores and this product is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Exactly what I asked for.",
      "text": "I am taking this daily and will continue to order more.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "No fillers in these PURE vitamins/minerals",
      "text": "Won't shop another brand anymore. Great price for quality ingredients.",
      "rating": 5.0,
      "verified": true,
      "author": "Shari_C",
      "helpful_votes": 0,
      "publication_date": 20151213
    },
    {
      "title": "Easy to digest",
      "text": "Using as a supplement, 2 capsules per day. No side effects.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Great value!",
      "text": "Purchased this product for my mom. She loves it, great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Silvia Rios",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Good Stuff",
      "text": "Pretty easy to swallow even after VSG, though be warned the capsules are fairly large. No weird after taste or tummy aches, even when taken on an empty stomach.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Fisher",
      "helpful_votes": 3,
      "publication_date": 20130826
    },
    {
      "title": "Taking per my dr",
      "text": "Dr wanted me to take calcium to help the healing of a broken bone. The bone is healing as expected, so I cant say if it is due to the extra calcium or not.",
      "rating": 5.0,
      "verified": true,
      "author": "T. L. Wi",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "100% vitamin",
      "text": "These come from a very solid and reputable company. They will contain 100% of the vitamin content described. They also do not pain the stomach when ingested.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Nichols",
      "helpful_votes": 0,
      "publication_date": 20161126
    },
    {
      "title": "Five Stars",
      "text": "A very big jar of capsules. Just one stops muscle twitch for me. This will last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Luta",
      "helpful_votes": 2,
      "publication_date": 20170123
    },
    {
      "title": "This is a great product. I've bought 4 bottles so far and ...",
      "text": "This is a great product. I've bought 4 bottles so far and no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "SDow",
      "helpful_votes": 0,
      "publication_date": 20170113
    },
    {
      "title": "Five Stars",
      "text": "Love that this is in capsule form. Much easier to swallow!",
      "rating": 5.0,
      "verified": true,
      "author": "Paula V",
      "helpful_votes": 2,
      "publication_date": 20170518
    },
    {
      "title": "Four Stars",
      "text": "Allergy free and I use it daily with the magnesium.",
      "rating": 4.0,
      "verified": true,
      "author": "Bette Schneider",
      "helpful_votes": 3,
      "publication_date": 20150513
    },
    {
      "title": "Trusted brand",
      "text": "I trust this brand to be pure and free of unnecessary and/or harmful additives.",
      "rating": 5.0,
      "verified": true,
      "author": "buschfam",
      "helpful_votes": 0,
      "publication_date": 20160220
    },
    {
      "title": "Excellent quality, reasonable price",
      "text": "Excellent quality, reasonable price, slightly less expensive than through other outlets. But my nutritionist says PE is one of the best manufacturers of supplements, so I keep buying this stuff. It seems to keep me healthy, but how would I know, really?",
      "rating": 4.0,
      "verified": true,
      "author": "Fly By Night",
      "helpful_votes": 5,
      "publication_date": 20150220
    },
    {
      "title": "Five Stars",
      "text": "Great product and was delivered on time and in good shape. Great deal!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "Great supplement. Love this company.",
      "text": "Great product. Capsules are on the large side but all calcium supplements are... I love that this company does not have fillers and is really \"pure\".",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah S.",
      "helpful_votes": 0,
      "publication_date": 20150204
    },
    {
      "title": "Five Stars",
      "text": "They go down my throat easy and I don't get heartburn after taking them.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Kenney",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Fantastic product if you can afford",
      "text": "This calcium works great for me and I love that it doesn't have a host of other vitamins attached as it works better for me to take my calcium separate from Magnesium and other supplements. Pure encapsulation brand is pricey but has never let me down.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20160224
    },
    {
      "title": "Five Stars",
      "text": "Excellent product highly recommended worked great for my calcium deficiency",
      "rating": 5.0,
      "verified": true,
      "author": "J.B.",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "Not pure - 16 mg vit C per 150 mg calcium/ cap",
      "text": "It is pure calcium citrate (no vitamin D added) but it is 150 mg a cap, which make the product too expensive to my opinion. Won't order again if I find a calcium citrate in powder. -- BTW, if you are taking calcium to prevent kidney stones; vit C is not what you want with your calcium. Ok, there is no vitamin D. I should have checked the label more carefully.",
      "rating": 2.0,
      "verified": true,
      "author": "ED2012",
      "helpful_votes": 6,
      "publication_date": 20150718
    },
    {
      "title": "Gluten Free, Non GMO & Hypoallergenic Must be the Ticket",
      "text": "I have always developed calcium deposits on my joints when taking calcium supplements. When I broke my foot in 6 places, my doctor told me I had to start taking a calcium supplement. A friend suggested I take pure calcium without added supplements so I went by the product reviews when I orders Pure. I'm on my second bottle of Pure and I have no bumps on my knuckles and no pain. I think the pureness of the product must be the difference. I'm in my 60's so being able to finally take calcium is a big deal to me. These are well worth the money if you have issues with other calcium supplements.",
      "rating": 5.0,
      "verified": true,
      "author": "Colleen",
      "helpful_votes": 22,
      "publication_date": 20191205
    },
    {
      "title": "THIS IS MY THIRD ORDER",
      "text": "So easy to swallow, so pure, once you use these you will never use any other brand again .No side effects ,no gas, easily absorbed. I threw out a half a bottle of Citracal because I knew I'd never use them again in comparison to these capsules you could choke on those other tablets. I'm only supposed to take 600 mg a day so nothing could be more perfect. Thank you Amazon there is no way I would have ever found this brand without you.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 15,
      "publication_date": 20170826
    },
    {
      "title": "Diarrhea??",
      "text": "I never expected calcium to give me diarrhea. Makes me wonder if the manufacturer used magnesium instead. Not once in my life has calcium ever given me diarrhea and I've taken calcium for over 20 years.",
      "rating": 1.0,
      "verified": true,
      "author": "YellowJeep",
      "helpful_votes": 13,
      "publication_date": 20180807
    },
    {
      "title": "OMG, it took me years to figure out my ...",
      "text": "OMG, it took me years to figure out my calcium supplement was causing constipation. I switched to Calcium Citrate and all is well.",
      "rating": 5.0,
      "verified": true,
      "author": "lost child",
      "helpful_votes": 14,
      "publication_date": 20171019
    },
    {
      "title": "Excellent Line of Products",
      "text": "Was thrilled to find this Pure Brand on Amazon. Am looking for the Magnesium Citrate Malate too. I must take electrolyte and some supplemental. Pure is sold at a Holistic Pharmacy near from for nearly twice the price. Imagine my delight at finding this product on Amazon and with Prime, no other costs. Very pleased. Great line of products. As a Cancer and Tumor survivor who has bone and muscle issues too, I have tried many products. This line is quick to disperse, always consistent...",
      "rating": 5.0,
      "verified": true,
      "author": "redwillow",
      "helpful_votes": 10,
      "publication_date": 20170414
    },
    {
      "title": "Good but not a lot of bang for the money",
      "text": "I like the clean ingredients. After some research, I like the formula of this calcium and absorbency. What I don't like is the fact it's weak. You have to take two capsules to get the suggested dosage. Even after the two pills you're only getting 23% DV! Most brands, even the least expensive deliver 60% DV with one pill. This is something clearly stated in the product description and I failed to notice after reading through all the good points the product has. Oh well. Let's see how it works.....I may take an extra pill a day for a 69% DV",
      "rating": 3.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 4,
      "publication_date": 20190404
    },
    {
      "title": "Rough on the stomach",
      "text": "Tore up my stomach and gave me diarrhea. Not good if you have IBS and/or a sensitive stomach.",
      "rating": 1.0,
      "verified": true,
      "author": "taxpayinghorse h.",
      "helpful_votes": 6,
      "publication_date": 20191118
    },
    {
      "title": "Too many pills to get a larger dose",
      "text": "I typically go for pure encapsulations when purchasing supplements because they are good quality and have no fillers. The only negative thing I can say about these is the fact that two large pills only equals 300 mg. I can’t do dairy so I have to take these multiple times a day to even get close to the recommended 1,000 mg for women who are pregnant.",
      "rating": 4.0,
      "verified": true,
      "author": "JoeNGina",
      "helpful_votes": 3,
      "publication_date": 20190727
    },
    {
      "title": "No digestive issues.",
      "text": "My husband has bone cancer and I am in risk category for hip and spine breakage from bone thinning. Our doctor just told us to take calcium and I was leary of taking it because of an experience I had before when I tried to take calcium. I had severe digestive upset and quit taking it. We have been taking Pure Encapsulations for several weeks now and neither of us has had any digestive problems , so at this point I would definitely give it 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 11,
      "publication_date": 20180326
    },
    {
      "title": "Pure calcium citrate",
      "text": "I had to have my broken tooth extracted, and want to get enough calcium for the next several months for the jaw bone to heal. I don't know if it's true, but I think that capsules disintegrate a lot better than tablets.",
      "rating": 5.0,
      "verified": true,
      "author": "Magical Dragon",
      "helpful_votes": 3,
      "publication_date": 20190807
    },
    {
      "title": "Nothing but calcium",
      "text": "I particularly like this calcium supplement because it is calcium citrate and not calcium carbonate. The capsules are easy to swallow and not horse pills like many calcium supplements. I also like that they do not contain other minerals and compounds like vitamin D, zinc and all that stuff which I prefer to take separately.",
      "rating": 5.0,
      "verified": true,
      "author": "JumpnJill",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Does not dissolve in liquid",
      "text": "I got these for my tube fed daughter to get her adequate calcium without added vitamin D, magnesium or other ingredients... but these are constantly clogging up her feeding bag/tube. I am not sure why the powder does not dissolve... I have even tried emptying the powder into liquid and letting it sit for hours before giving and it still does not dissolve. Disappointed...",
      "rating": 3.0,
      "verified": true,
      "author": "Lexi",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "I wanted Calcium Citrate without Vitamin D, or any ...",
      "text": "I wanted Calcium Citrate without Vitamin D, or any other Vitamins Added with the Calcium. The capsules are Gluten -Free Non GMO, and Hyperallergenic. The Capsules are not difficult to swallow with water.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda J.",
      "helpful_votes": 3,
      "publication_date": 20180801
    },
    {
      "title": "Great product",
      "text": "I got these after a recommendation from my orthopedic doctor following identical hairline stress fractures in both my knees. After 10 weeks I finally got the okay to start jogging again so 🤞. They are big pills but no weird aftertaste.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 2,
      "publication_date": 20190119
    },
    {
      "title": "Glad to find this in capsule form",
      "text": "Doctor recommended calcium citrate. Mostly this comes in large hard to swallow tablets. These are capsules and super easy to swallow. I will be ordering on a regular basis!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Good calcium but not enough!",
      "text": "These are easy to swallow and digest. My only problem is that taking two is not sufficient calcium for many people who need a calcium supplement. I take three twice a day which makes the bottle not last very long. But I do like them more than other calcium supplements I have tried.",
      "rating": 4.0,
      "verified": true,
      "author": "luluK",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Very good product!",
      "text": "I felt good knowing this product was being absorbed by my body so well and I always have a sensitivity reaction to calcium that has vitamin D with it, this is the only one I could find, so I'm very grateful. I've been avoiding calcium for years and don't drink milk due to allergies, so my body must have been rejoicing!",
      "rating": 5.0,
      "verified": true,
      "author": "Midwestern Girl",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "love these, but problem with seal",
      "text": "I had the same problems as many others. Purchased this and there was a hole in the seal. Ordered a replacement-same problem. Returned both-ordered somewhere else-no problems. I think it was stored in a hot warehouse and the seal stuck to the lid. Other than that, I love these vitamins and when I'm not on them I can tell. I hope they get the seal problem figured out.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "They do what they are suppose to",
      "text": "Labs came back great on calcium levels. The pills are hard to swallow even with sips of water before trying to swallow. The gel caps get stuck after I swallow and I have no trouble swallowing other pills. I just took a bite of food after taking them and they went down just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "MRP",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Ditch the tablets that give you cramps!",
      "text": "A much better alternative to calcium tablets that will give you cramps, and this is a form of calcium that is more readily assimilated. I like the Pure Brand...doesn't have all the fillers that have side-effects.",
      "rating": 5.0,
      "verified": true,
      "author": "Journalista",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Easy to Swallow",
      "text": "Just started taking these. Had taken another product for many years. Had difficult time getting them down my throat. I take a high dosage - 8 a day. Big difference in being able to swallow these capsules easily. Reordering now.",
      "rating": 5.0,
      "verified": true,
      "author": "Missouri  Amazon Fan",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "They taste good.",
      "text": "The calcium citrate has a nice flavor. I don't find it hard to swallow capsules or pills. They are large, but I have never had any issues swallowing large pills.",
      "rating": 5.0,
      "verified": true,
      "author": "RH",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "No added stuff",
      "text": "I already take other supplements so I was looking for calcium without other vitamin or mineral components. This is it.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth M",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Five Stars",
      "text": "I love that it's easy to swallow.. the price could be better though..",
      "rating": 5.0,
      "verified": true,
      "author": "dorwil",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "Quality product",
      "text": "I love this brand. They have a reputation for quality supplements and are one of my preferred go-tos. This calcium is no different. I have been using it for about a year now and no plan on changing.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly Keene",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Easy to Take",
      "text": "Can’t really tell how well they’re absorbed, as I take them for osteoporosis. Found another brand that seems to be a better value.",
      "rating": 3.0,
      "verified": true,
      "author": "N. Hull",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "works real well",
      "text": "I have acid reflux, I take meds to help with it. But one of the side effects is I do not absorb calcium properly. This is much easier for my body to absorb and utilize.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Fleming",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "No additives to the calcium!",
      "text": "I like this product, as there are no additives in it. I just want calcium in my body. I wish the capsules were a little smaller but I’m getting what I want which is hard to find.",
      "rating": 5.0,
      "verified": true,
      "author": "JCutes@AOL.Com",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "Quality",
      "text": "I have always trusted the quality of Pure Encapsulations products",
      "rating": 5.0,
      "verified": true,
      "author": "HONEST REVIEWER",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Easy to swallow.",
      "text": "Easy to swallow gel capsules. Doesn’t bother my stomach. I like them better than other brands I’ve tried.",
      "rating": 5.0,
      "verified": true,
      "author": "Lilly",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Works as part of the Hashimotos Protocol by Izabella Wentz",
      "text": "Works as part of the Hashimotos Protocol by Izabella Wentz",
      "rating": 5.0,
      "verified": true,
      "author": "dm",
      "helpful_votes": 2,
      "publication_date": 20180402
    }
  ],
  "product_meta": {
    "title": "Pure Encapsulations - Calcium (Citrate) - Hypoallergenic, Highly-Absorbable Calcium Supplement - 180 Capsules",
    "description": "Product Packaging:Standard PackagingMultiple randomized, double-blind, placebo controlled studies have reported statistically significant positive results using calcium supplementation to help reduce the risk of osteoporosis for both women and men. Calcium has also demonstrated the ability to provide a supportive effect on cardiovascular health by promoting healthy receptor function and healthy lipid metabolism. Additionally, calcium has been associated with supporting distal colon health.*",
    "rating": 4.6,
    "feature_bullets": [
      "Cardiovascular Health: Highly absorbable calcium, which supports cardiovascular health.*",
      "Colon Health: Additionally, calcium has been associated with supporting colon health*",
      "Bone Support: Calcium in the citrate forms are highly bioavailable calcium supplements, providing support for bone, cardiovascular and colon health.*",
      "Pure Ingredients: Pure Encapsulations manufactures a line of hypoallergenic, research-based dietary supplements. Products are meticulously formulated using pure ingredients designed to deliver predictable results for the benefit of all patients, even the most sensitive.*",
      "Free From: Pure Encapsulations products are free from wheat, gluten, egg, peanuts, magnesium stearate, hydrogenated fat, artificial sweeteners and colors, and other unnecessary excipients. Any product containing ingredients derived from allergens, such as soy, dairy or shellfish is clearly labeled. *These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4.2 x 3.8 x 3.8 inches; 8 Ounces",
      "Item model number": "766298000459",
      "Date First Available": "April 2, 2008",
      "Manufacturer": "Pure Encapsulations",
      "ASIN": "B00172XUWU",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Calcium",
      "Vitamins & Dietary Supplements",
      "Minerals",
      "Health & Household",
      "Health, Household & Baby Care"
    ],
    "price": 24.5
  }
}