{
  "website_summaries": [
    {
      "verdict": "The Sonos Connect:Amp is an excellent streaming-audio solution for sound-quality sticklers who prefer to supply their own speakers.",
      "pros": [
        "The Sonos Connect:Amp is an excellent all-in-one digital music system that offers superb sound quality",
        "It gives you access to nearly any cloud music service (Pandora, Spotify, Amazon, Rhapsody, and so forth) using any iOS device or Android smartphone as a remote",
        "The Connect:Amp has a line-in, which is particularly useful for connecting a TV or DVD player"
      ],
      "cons": [
        "You'll need to have separate speakers and a tablet or smartphone",
        "The Sonos Connect:Amp doesn't support iTunes Match",
        "While it can wirelessly interact with other Sonos products, you'll need a hard-wired connection or the $49 wireless Sonos Bridge accessory if it's your only Sonos component"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 9.0,
        "Performance": 8.0
      },
      "publication_date": 20120921,
      "rating": 8.4,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "DONT BUY THIS PRODUCT",
      "text": "be careful DO NOT BUY this product or any other of this brand, sonos has just sent a notice to the users of its older product, that they say there will be no more updates and these speakers will not work after some time, that is, you will be buying a very expensive system and will be abandoned at your own luck, at a nearby future, unfortunately I wasn't aware of this when I bought more than thirty Sonos equipment, you must choose another brand, this one will not be worried about your future and you will be discarded BE ADVISED",
      "rating": 1.0,
      "verified": true,
      "author": "marco silva",
      "helpful_votes": 6,
      "publication_date": 20200122
    },
    {
      "title": "Great hardware; caution where you install it as it can get very hot",
      "text": "Assuming you know how Sonos in general works, I will limit my comments to the amplifier itself (hardware). It works very well with my Polk speakers and I have two pairs hooked in parallel to the amplifier. Sound quality is great and power is enough for two pairs. I recommend wherever you install this device to well ventilate the area because it will get hot. Also note it comes with two Ethernet ports so that you can daisy chain the port with another amplifier or device, thus saving a port on the switch.",
      "rating": 5.0,
      "verified": true,
      "author": "Solar_Ize",
      "helpful_votes": 36,
      "publication_date": 20150824
    },
    {
      "title": "Great for Outdoor Speakers",
      "text": "Sonos is a splurge but well worth the expense. Our home is fully Sonos'd but we wanted music outside too. We added the Amp and have connected some weatherproof speakers to it and now our pool & deck have the same Sonos sound as the rest of our house. The only thing we'd like is if the Amp was more powerful, especially since they are driving outdoor speakers. We find the volume is often above 1/2 way to just get decent background volume. Our setup has the Amp in the basement with speaker wires running out and up to the deck - I'm sure most people can find a similar solution.",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie & Rob",
      "helpful_votes": 11,
      "publication_date": 20150628
    },
    {
      "title": "DEAD END PRODUCT",
      "text": "Sonos doesn't support their products long term. My April 2019 purchase is getting EOL'd and no more software (read security) updates.",
      "rating": 1.0,
      "verified": true,
      "author": "K. Baker",
      "helpful_votes": 5,
      "publication_date": 20200121
    },
    {
      "title": "Great for a year, then garbage",
      "text": "Don't buy. Purchased after buying a house that's got internal speakers throughout. This worked great, then after about a year it would just stop playing music after a song or two. There are dozens of various online accounts saying the same thing happens to them, but Sonos tech support says they've never heard of the issue and were no help in resolving. We've done everything - all the reboots, attaching ethernet directly, testing on single speakers, etc. It appears to be a wifi issue, but the issue seems to be within the Sonos equipment and inability to receive a signal with no solution. I received a shrug from the company so I guess I'm just out of luck.",
      "rating": 1.0,
      "verified": true,
      "author": "paddyg53",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Too few connectors; expensive for what it is",
      "text": "Wanted to add one of my legacy Marshall speakers with amp to my Sonos infrastructure for my office. Unfortunately, this Connect: Amp only provides for two speaker wire connections. Ended up returning it as it's pretty expensive for what it offers. The only gripe with Sonos is that it pretty much requires 100% Sonos made components, despite selling products like this one that purports to allow you to add high-quality pre-existing stereo components already owned, but doesn't really go far enough and is way too expensive for what it offers.",
      "rating": 3.0,
      "verified": true,
      "author": "Mario Kroll",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Perfect Solution for Outdoor Sonos Speakers",
      "text": "I used this to connect a pair of outdoor speakers to my Sonos system, and it works without any issues. All of the hardware that Sonos makes is a bit on the pricey side, but they add so much value in how easy everything is to set up and use. This was no exception. I was able to use this in conjunction with a pair of Polk Audio Atrium 6 speakers, and everything worked without any problems. We are now able to play music from our Sonos system on our outdoor patio without any hassle. Since Sonos doesn't make their own outdoor speakers I think this is the best route you can go!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Wagner",
      "helpful_votes": 2,
      "publication_date": 20170726
    },
    {
      "title": "Sounds great, looks good",
      "text": "I use this with a pair of KEF Q300s, and it's great! Sounds amazing and I'm not having any issues with it getting hot (barely gets warm) – but then, mine sits on a bookshelf, not crammed into a closet. I've also tested it with my Rega floor standers, and that worked great too. Well made and worth the price, IMHO. The only surprise was that I had expected it to be the same size as the Sonos Connect, but it's quite a bit larger. So that's the only caveat in case you're putting it somewhere with limited space. Looks good though, so it can easily sit somewhere where it's visible and not be annoying.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert K.",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "Great for two years and two months, 2 yr warranty.  Died and Useless now.",
      "text": "I have a bunch of Sonos equipment and decided to add this so I could run speakers out to the deck. It was the most expensive component of my system. Lasted just a couple months past the warranty. Sadly no support is provided and I guess I just need to throw it away. Very disappointed that they do not offer any type of a refurbished product or a repair option Overall a big fan of their products but this one has been a big disappointment. If you search for repairing this product you will realize there really are no options",
      "rating": 2.0,
      "verified": true,
      "author": "Bill B.",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Amazing value",
      "text": "Was able to re-use rear surround speakers in a home integrated old 5.1 installation with a Sonos Beam setup. The Connect:AMP was a Warehouse buy as well - it came like new! Worked well - but have to have it wired to the router and had to update the software before it worked - once the update was done it connected to the Beam and configured itself as surround perfectly. Well worth it - and saved $100 by purchasing the Amazon Warehouse deal - very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "TexaClone",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Connected system with existing wired speakers. Would work for ...",
      "text": "Connected system with existing wired speakers. Would work for a few songs, then the system would automatically lower the volume of the wired speakers so effectively, they were off . Do not buy if you plan to integrate this with wired speakers.",
      "rating": 1.0,
      "verified": true,
      "author": "Bob Smith",
      "helpful_votes": 5,
      "publication_date": 20170903
    },
    {
      "title": "Recommended product",
      "text": "This is my first Sonos part. It was very simple to setup and use. I have it wired to a Polk stereo speaker in my garage and it sounds Awesome! I can only imagine what it would sound like with a sub. I’m hopefully trying to add another for my Polk patio speakers and a Beam with 2 Play 1s or a Play 3 for surrounds as money allow. I would highly recommend this system even tho it’s a bit pricey like others have mentioned.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave J Swiatkowski",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Too expensive for used item",
      "text": "Used item sent as new, found out the hard way because it asked password for the previous owner’s email.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20180501
    },
    {
      "title": "Great addition to any Sonos system",
      "text": "Great addition to any Sonos system, if you want to use your own speakers, or connect an alternate source of music. I connected my turntable, and the sound is absolutely fantastic. One thing to note is that you must go into the settings on the sonos app, and select the output of the auxiliary item that you connect to the amp. Default setting was a 2, I selected the highest power of 10. I haven't hooked up my outdoor speakers yet (hope to complete today), but I'm confident the sound and control will be on par with the rest of the sonos products.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter F.",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "Sonos. Simply the best!",
      "text": "During the past year, I swapped out my whole house audio system with Sonos product and I couldn’t be happier. Yes, it’s expensive, but well worth the investment. It’s simply bulletproof and it sounds great. I hooked up this Connect:Amp to some patio speakers. Easy setup. Sounds great. If you are looking to repurpose your existing speakers into your Sonos environment, then this is the product for you! Well done, Sonos!",
      "rating": 5.0,
      "verified": true,
      "author": "ConsumerMan",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Really good product but mission a feature",
      "text": "I ran my unit at least four hours per day during the 30 day return period as a \"stress test\" to see if it would fail so that I could return it. It worked great (and still does). No problems with sound quality. It works as advertised. The only negatives that I've found are: 1. There are only front and rear speaker posts. At the price point for the unit there should be front L/R and rear L/R. 2. I find that the Sonos Windows app that controls the unit to be harder to use than it should be and takes to many mouse clicks to get to what I want.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew Erler",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Sonos is THE bomb",
      "text": "Wow! Sonos is the shiz knit. What an awesome product and superb sound. I am now hearing music they way it was meant to be heard. Packaging, ease of installation, product, user friendly, and application...can’t say enough good things. Now have boost, amp, play 3s, and play 5s. Can’t wait to add another! Like Apple this stuff juss works!",
      "rating": 5.0,
      "verified": true,
      "author": "lmo",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Great product, Easy install and setup, Control from tablet!",
      "text": "The Sonos products are awesome. A product line designed to offer multi-source, multi-zone music throughout the home playing one source at a time, or multiple sources in multiple areas. These products are super easy to install, setup, and control. If you love music, you need to start buying Sonos products to spread that music to anywhere and everywhere around the home you may be. Get ya some and... get groovin'!",
      "rating": 5.0,
      "verified": true,
      "author": "Curtis",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Four Stars",
      "text": "Not the best power or quality but very practical and easy to get it to work. Update: 2/2018: Amplifier stopped working in less than 3 years. I properly used it total of 10 times for playin music. Digital part is working but no sound comes out of my speaker. I did not pay premium price to see if fail so soon with minimal use. I never had an amp fail on me in such a short time. I contacted support. They were nice but the best they could do was to sell me an exchange for$350. Thanks but no thanks. I am not trusting Sonos brand anymore!",
      "rating": 1.0,
      "verified": true,
      "author": "BASAFA",
      "helpful_votes": 4,
      "publication_date": 20141129
    },
    {
      "title": "Good for connecting hard-wired speakers to Sonos system",
      "text": "The first CONNECT:AMP I received had a defect that made it keep dropping off my home Sonos system. At first, I was able to reboot it into the system, but after about a month I was unable to connect it to my system or play anything through it using the Sonos iOS app. Sonos tech support first gave me a set of steps to try to get it back online. When that failed, they quickly sent a replacement. The replacement CONNECT:AMP has been working now for over a year without any problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Beachhead506",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Retrofit traditional surround sound",
      "text": "We just bought a house with small speakers installed on the cathedral ceiling. This amp lets us plug the non-powered speakers and the powered sub-woofer to integrate with the sonos in the rest of the house. Side note... I tried to get a Sonos subwoofer to work with this amp but couldn’t figure it out, So I ended up ordering a traditional subwoofer instead.",
      "rating": 5.0,
      "verified": true,
      "author": "Cara",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Fantastic for built in speakers, even indoor/outdoor setups",
      "text": "Love this. I'm powering indoor and outdoor speakers with this. Bought a cheap A, B, A+B switcher here on Amazon so I can choose where I want the music instead of having two Connect:AMPs which can get expensive. The ONLY downfall to the solution is when A+B is enabled the volume is lower, but the Sono app makes that easy to work around. I couldn't be happier with the Connect:AMP. Next up is to buy the Beam TV speaker and I'm hoping I can also pair this as the right/left surround sound to that. Time will tell.",
      "rating": 5.0,
      "verified": true,
      "author": "Jed",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Fantastic, of course",
      "text": "Fantastic, of course. The price is prohibitive, but with Sonos speakers in two other rooms of my house, I couldn't live any longer without being able to feed my Sonos sound into the ceiling speakers in my master bedroom and bathroom, where I was also able to add a $100 subwoofer to plug into the sub-out of the Connect:Amp; the result is truly fantastic sound! I can't imagine what this would sound like through more expensive speakers and sub. Plus, with the aux input, I can play any source into the overall Sonos system throughout the whole house (including youtube as well as my old cassette collection (through a walkman)). Enjoy!",
      "rating": 5.0,
      "verified": true,
      "author": "Gem",
      "helpful_votes": 0,
      "publication_date": 20160628
    },
    {
      "title": "Love this product as it adds flexibility to my home ...",
      "text": "Love this product as it adds flexibility to my home audio system. Already had speakers and wires ran when I moved into my home, all I had to do was plug in and power up. App has very simple instructions to setup with iOS devices. Sound is very crisp, delivering exactly what I needed. My only complaint is that the software does not play well with AirPlay. I wired it to work in tandem with other AirPlay fed speakers and there was a slight delay rendering that setup useless.",
      "rating": 5.0,
      "verified": true,
      "author": "Brent",
      "helpful_votes": 0,
      "publication_date": 20151209
    },
    {
      "title": "Amp gets toasty but samba is supported",
      "text": "Allowed me to utilize existing ceiling speakers with my Sonos setup. Amp stays very hot regardless of installation location and the price is just too high for what the hardware is. App is still very buggy on both Apple and Droid platforms but the ability to mount a shared samba instance pushed my review from 2 to 3 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "scottish",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "overall good product but could be better with updated hardware",
      "text": "this is the same hardware since around 2005 or so... it needs an update. They should build a multiroom / 10 channel version of this to be placed on racks with updated d/a converters. overall good product but could be better with updated hardware.",
      "rating": 4.0,
      "verified": true,
      "author": "Kishore",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "Pricey for only ability to hook in a set of speakers.",
      "text": "Amazing. Bought a Sonos system and did not want to lose my in Bose speakers in my garage and outside. Works great with little noticeable difference in sound. Wish they made one for more than 1 set of speaker connections.",
      "rating": 5.0,
      "verified": true,
      "author": "Tobias",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Supports the wireless addition of legacy wired speakers",
      "text": "I have some weather resistance outdoor speakers (Sonos doesn't sell outdoor speakers, yet) that I pre-wired back to an entertainment center when I built my home. I decided to upgrade to the Sonos system, but required support for the \"legacy speakers\". The connect amp is the solution and after implementing my 1st connect amp, I have since installed a second connect amp to support a second pair of \"legacy speakers\". The Sonos system along with the connect amp works great! My only suggestion would be for the iPad/Android application to allow an option for the streaming of the \"Sonos stream\" to a locally attached Bluetooth device.",
      "rating": 5.0,
      "verified": true,
      "author": "frandsen",
      "helpful_votes": 0,
      "publication_date": 20131217
    },
    {
      "title": "Arrived on time and works as described",
      "text": "Arrived on time and works as described. I connected it to wired speakers throughout our first floor living space for surround sound. Although Sonos doesn't connect/work with all streaming services aka MBL App.",
      "rating": 4.0,
      "verified": true,
      "author": "R. McDonnell",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Works great!",
      "text": "I purchased a house this summer w 4-ceiling speakers. I had no idea how to use them. I saw this system and read reviews. When it arrived, I installed in 5 minutes and I have been enjoying wireless music since! Super simple and the app is awesome! My mom visited and she downloaded the app and was able to control it as well.",
      "rating": 5.0,
      "verified": true,
      "author": "jerseyjazz",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Easy to Install; Sounds great",
      "text": "I have Apple Airport Express and Bose SoundTouch; hands down, this Sonos was the easiest to hook up and get working. An awesome app that guides you through the setup, and it was so darn easy. Hooked up to my wifi in a matter of minutes. Good music variety in their built in streaming TuneIn app. And it was as easy as possible to install my Apple Music. Sounds great connected to my old but well loved speakers. I have fallen in love with Sonos",
      "rating": 5.0,
      "verified": true,
      "author": "Westwood",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "Great product",
      "text": "I am not particularly handy or knowledgeable about electronics, but this amp Was very easy to install and get working. And the sound quality is awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherri",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Unbeatable sound quality!",
      "text": "This is our third Sonos amplifier! The quality of the music we enjoy throughout our home, and now the outside on our patios, is absolutely unmatched. Sonos will blow you away!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Burger",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Simply the Best!",
      "text": "I am an avid audiophile and electronics nut. I can safely say that SONOS may be the BEST electronic purchase I have made, period, ever! The sound is awesome - the performance is flawless. Like the saying goes, \"You get what you pay for\" - SONOS isnt cheap - BUT its worth every penny in my opinion. After years of dealing with AirPlay dropouts and frustration I went full SONOS - Play1, Play3, CONNECT to main exiting amp and CONNECT:AMP in the garage. The whole family can play and enjoy music throughout the house! We use it constantly and its never missed a beat...",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff S.",
      "helpful_votes": 0,
      "publication_date": 20140124
    },
    {
      "title": "Great Tech Support",
      "text": "Have 3 Sonos:Amps and 1 Sonos Connect. The products are great. If you need their tech support they have the best tech support on the planet of any tech company that I have dealt with.",
      "rating": 5.0,
      "verified": true,
      "author": "Paison",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Clean sound",
      "text": "Clean sound, I use them with Polk atrium 8 outdoor speakers and the sound on patio is like theater. Low volume and high volume sound great. I highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth Wohltman",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "I love my Sonos Connect Amp",
      "text": "Somewhat complicated to set-up but the results are fantastic. I have it wired to my 4 speakers around my pool. If you are connecting more than 1 speaker per channel, I would recommend that you check the impedance on your connected speakers to make certain that 2-speakers on each side are between 4-8 ohms. Mine were 4.3 ohms. Less than 4 ohms will blow the amp. Also make certain that you have a good WiFi network since your iPhone or iPad will connect with it to control your system. I also connect my Sonos service with Google Play and now I have an amazing music library that I can play at the pool. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael D Lehman",
      "helpful_votes": 0,
      "publication_date": 20140701
    },
    {
      "title": "Pricey but happy",
      "text": "Great product if you want to run Sonos to outdoor speakers. I have a play 3 and a play 1 and now this too going to a pair of Boston Acoustics indoor/outdoor speakers. Sounds great. Only reason for 4 stars Vs 5 is cost. I feel like $500 bucks is too much for this, but I paid up to have Sonos outside. I suppose it's worth it but if it was doable for $500 including the speakers I'd be thrilled. After speakers the project cost me over $700 bucks.",
      "rating": 4.0,
      "verified": true,
      "author": "Jettest East",
      "helpful_votes": 0,
      "publication_date": 20160617
    },
    {
      "title": "Great product",
      "text": "Sonos products although expensive, work seamlessly with each other. I bought this to pair with Sonos Playbase to drive third party rear channel speakers took minutes to install and set up.",
      "rating": 5.0,
      "verified": true,
      "author": "Justok55",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Pricey but quality and ease of set up make it worth it",
      "text": "Expensive but necessary to expand my outdoor sound system. Easy set up and simple to add to my existing Sonos system",
      "rating": 5.0,
      "verified": true,
      "author": "MM",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "SONOS is AWESOME!",
      "text": "Can't believe I wasted so much time monkeying around with Airplay + my Yamaha network receiver. Drop-outs and sometimes Airplay just stops working for no apparent reason. DONE with that! This sounds every bit as good and the Yamaha and it just friggin WORKS!!! Plenty of power for my Bose system. SONOS is absolutely fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Scott",
      "helpful_votes": 0,
      "publication_date": 20160211
    },
    {
      "title": "Sonos Rocks! Echo compatibility would be nice!",
      "text": "This is the second unit I purchased. The first one is still working after 5 years. I have one unit powering my patio speakers and the second is in my office connected to my computer; because who doesn't want a 12' sub-woofer connected to their work computer?",
      "rating": 5.0,
      "verified": true,
      "author": "Nick S",
      "helpful_votes": 0,
      "publication_date": 20161010
    },
    {
      "title": "Great Product, exactly what I was looking for could ...",
      "text": "Great Product, exactly what I was looking for could not find it on the net any cheaper. Great quality and construction. I have six of these powering speakers all over my house. I LOVE SONOS!!! cant say enough great things about them. I have worked with other whole house audio systems even really expensive ones like Creston and the ease of use with sonos blows any and all competitors out of the water. LOVE IT LOVE IT LOVE IT",
      "rating": 5.0,
      "verified": true,
      "author": "Rob From Bellport NY",
      "helpful_votes": 0,
      "publication_date": 20140904
    },
    {
      "title": "Love it",
      "text": "Exactly what I was looking for. I connected my outdoor built in speakers to Sonos. Works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Burnstein",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "I'm a sonos believer",
      "text": "This amp replaced a standard receiver which quit on us. I was a little concerned about power output since I have it hooked up to Klipsch floor standing speakers. It works very well. I love the Sonos interface we are new to it. I'm pretty tech savvy, my wife is not. It's easy for her, it's easy for anyone. We are using with iOS devices. Only wish - for this price it would be nice to have a digital display on which song or input is playing, maybe a \"next song button\". That's not their thing, so I'm ok with it.",
      "rating": 5.0,
      "verified": true,
      "author": "AMZ DAD",
      "helpful_votes": 0,
      "publication_date": 20140130
    },
    {
      "title": "Great. Just works",
      "text": "Really nothing bad to say about it. Just works. Great to get rid of all the cables and the boxes and crappy app's from other companies. Recommend buying.,",
      "rating": 5.0,
      "verified": true,
      "author": "Lou",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "These Seem to be Only S1 compatible",
      "text": "These Seem to be Only S1 compatible Other than that highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "happyshopper",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Sonos rocks !",
      "text": "Sonos is truly a quality company. I own the bar, subwoofer 2 ea Olay 1 and now I have purchased the Sonos Connect amp. i am usin Polk speakers and subwoofer. Connection, as always was easy. The only regret I have is, that my residence is not big enough to justify buying more Sonos products.",
      "rating": 5.0,
      "verified": true,
      "author": "Tchuban",
      "helpful_votes": 0,
      "publication_date": 20160317
    },
    {
      "title": "Sonos can’t be beat",
      "text": "Sonos is and has been a phenomenal product, the connect amp is a work horse, easy install, great app control, huge music streaming options.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Gavette",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Used for Pool speakers, dance studio speakers and deck speakers",
      "text": "I have installed 5 of these now and they are the system to beat. Sonos only gets better with the new 2014 update to their controller app and the additions of new popular music providers such as Google Music. I've hooked up two pairs of speakers to one amp in one location and these sound awesome, (Bose Virtually Invisible 791 in-ceiling speakers). Don't forget to explore the app and use the loudness if needed, also the equalizer to fit tastes.",
      "rating": 5.0,
      "verified": true,
      "author": "The Beat",
      "helpful_votes": 0,
      "publication_date": 20140720
    },
    {
      "title": "Worth every penny",
      "text": "I am not proud to say that I don't leave reviews often, however I had to do it for this product. It is absolutely fantastic. I had reservations due to the price tag, but it works great. I moved into a pre-wired home with ceiling speakers already in place and the connect:amp allows me to control them and play my music wireless-ly. When I'm working in my home office I use the OSX App, when I'm lounging, I use the iphone or iPad apps and when using my work computer I use the Windows App. All of them work great and allow me to hear Pandora or my library or the news through iHeartRadio.",
      "rating": 5.0,
      "verified": true,
      "author": "Javier Cordero",
      "helpful_votes": 0,
      "publication_date": 20140606
    },
    {
      "title": "Works great. I have all Sonos inside but really wanted ...",
      "text": "Works great. I have all Sonos inside but really wanted to keep the same user interface and sync ability for some outdoor speakers. The connect amp is the best solution for anyone that's invested in a Sonos home.",
      "rating": 5.0,
      "verified": true,
      "author": "Kip Stovall",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Love Sonos. We have almost everything in their catalog",
      "text": "Love Sonos. We have almost everything in their catalog. Very easy to use, even though a little expensive. Had to buy this as a replacement after only 3 years. This may be an aberration, since the rest of our Sonos amps continue to work perfectly. However, Sonos would do well to lengthen their warranty for the price we pay. It is not unusual for component manufacturers to have 5 year and even lifetime warranties (e.g. Speaker craft)",
      "rating": 4.0,
      "verified": true,
      "author": "Casie",
      "helpful_votes": 0,
      "publication_date": 20141214
    },
    {
      "title": "Sonos  is awesome!",
      "text": "This connect amp was very easy to install and set up. You download the app and it walks you through the setup in about 5 mins. I have the connect amp and just a plain connect. The app immediately discovered both of them and displays them both making it very easy to control these two different systems from anywhere near my house. Sonos is not cheap but it is awesome and easy to use. I would definitely recommend these systems.",
      "rating": 5.0,
      "verified": true,
      "author": "jeremy spilm",
      "helpful_votes": 0,
      "publication_date": 20150822
    },
    {
      "title": "I love my Sonos products",
      "text": "I love my Sonos products. I have three Play 3’s but the refurbishied Connect: AMP does not work due to issues with the device.",
      "rating": 1.0,
      "verified": true,
      "author": "John Oros",
      "helpful_votes": 4,
      "publication_date": 20171126
    },
    {
      "title": "As usual, Sonos quality. Easy to put in system",
      "text": "Works exactly like the first one. This was for a second set of outside speakers.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Walters",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Great way to extend my Sonos to our back patio",
      "text": "Great way to extend my Sonos to our back patio. Used Sonos Connect with the Bose outdoor environmental speakers and now we have all the features and flexibility of Sonos with the quality sound of Bose - outdoors!",
      "rating": 5.0,
      "verified": true,
      "author": "AnneM",
      "helpful_votes": 0,
      "publication_date": 20160317
    },
    {
      "title": "Simply the best...",
      "text": "I bought this product to power four paradigm speakers at my house's living room and was amazed at the sound quality and ease of setup offered by this product. The product has a very sturdy built and its fan-less design makes it unnoticeable. It plays songs out of my windows 7 server and is easily controlled by our iPad, iPhones and androids. The only feature that would be a nice addition is a search function for songs... I am now in the process of buying two more of these amps; recommend to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Paulo",
      "helpful_votes": 0,
      "publication_date": 20111123
    },
    {
      "title": "Sonos for wired speakers",
      "text": "Moved into a house that already had wired speakers, the Connect Amp is a great way to leverage the existing speakers. I split 9 zones across two Amps.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Becker",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "unprecedented ease and functionality",
      "text": "great seller, fabulous product. Had sniffed around Sonos for years, finally went whole hog. Performance/sound quality is good for most purposes, a serious audiophile can go to town with third party speakers and other exotic components. However, the Sonos core system's combination of price, aesthetics, flexibly, ease of setting up and controlling the system are unprecedented.",
      "rating": 5.0,
      "verified": true,
      "author": "Elsaesser",
      "helpful_votes": 0,
      "publication_date": 20140830
    },
    {
      "title": "May not work with Controller S2",
      "text": "Be careful with refurbished units. I run Sonos Controller S2 which only comparable with the 2nd generation Connect Amp. Site does not specify if they will send you a Gen 1 or Gen 2. I got a Gen 1 and had to return it when I couldn’t get it to join the rest of my system.",
      "rating": 1.0,
      "verified": true,
      "author": "GMG",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Great product",
      "text": "What can I say Works great Quality is awesome, easy to use, speakers sound great If your looking they are worth the money!!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "I can't say enough good things about the sonos",
      "text": "I can't say enough good things about the sonos. I have had my system in two different homes and put them together in different configurations and they always figure out the best way to synchronize with each other. They really define the term plug and play. You just plug them in and play music, anywhere! I bought this unit to drive speakers I was driving with ZONE2 of a receiver that crapped out on me. My only regret is not doing this sooner. Now I have the music in my dinner room and I can control it with my phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Weber",
      "helpful_votes": 0,
      "publication_date": 20140704
    },
    {
      "title": "Just an excellent addition to my growing range of Sonos equipment",
      "text": "Just an excellent addition to my growing range of Sonos equipment. I put this up on my attic and ran speaker wire out to the eve of my house where I mounted a pair of Yamaha outdoor speakers. I love using this when grilling or having a fire out back. Great product works flawlessly just like the rest of my Sonos equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "digitalducki",
      "helpful_votes": 0,
      "publication_date": 20141103
    },
    {
      "title": "Robust sound and extra punch for Home Theater System.",
      "text": "Purchased this unit to help complete a home theater system in the media room of my basement. Very happy with my purchase. Sound quality is excellent and this amp provides an extra punch for the tower speakers next to my TV stand and wall mounted TV. Great piece and value for the money. Best wireless product on the maker for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "shivanlord",
      "helpful_votes": 0,
      "publication_date": 20140810
    },
    {
      "title": "Expensive as always with Sonos but work as advertised. ...",
      "text": "Expensive as always with Sonos but work as advertised. Can use this to drive TWO SETS of speakers if needed, just double down on your connections and the amp doesnt have any issue.",
      "rating": 4.0,
      "verified": true,
      "author": "CP",
      "helpful_votes": 0,
      "publication_date": 20151116
    },
    {
      "title": "Four Stars",
      "text": "Quite bizarre - with the volume a third the way up, the system is silent. Does not get loud until around 80%. I just feel with an amp this price I should never need the volume on maxl. That said the sound quality is excellent, and it would get 5 stars if it went just a little louder.",
      "rating": 4.0,
      "verified": true,
      "author": "olly",
      "helpful_votes": 0,
      "publication_date": 20160620
    },
    {
      "title": "the amp is great and works perfect with my older Loudspeaker in case ...",
      "text": "I actualy never heard anybody complaing about the product of songs. the amp is great and works perfect with my older Loudspeaker in case you need new loudspeaker go for the play 5 new ones great",
      "rating": 5.0,
      "verified": true,
      "author": "Charro loco",
      "helpful_votes": 0,
      "publication_date": 20160307
    },
    {
      "title": "This is AWESOME. I have 5 hard wired speakers through-out the ...",
      "text": "This is AWESOME. I have 5 hard wired speakers through-out the house. Installation took about 10 minutes and works perfectly. We love it! It replaced a receiver that we had to plug our phone into. This powers all five speakers no problem, sound is great, and user friendliness is great. Could not be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Ali Bee",
      "helpful_votes": 0,
      "publication_date": 20150304
    },
    {
      "title": "Sonos changed the rules. Account is required to use a speaker.",
      "text": "So I have had several Sonos components for a few years and have been pleased with the sound and ease of use, however, they have recently changed their company policy to require an online account to use any of their components. I understand the necessity of an account, if you are using online services, like Alexa, etc. But, for those of us who just want to play our music, it is another corporate privacy overreach. I personally, intend to find an alternative, and someone will get a good deal on used sonos equipment. If you don't mind having yet another account that you have to remember the username/password for, then sonos is a solid distributed audio option. thanks",
      "rating": 2.0,
      "verified": true,
      "author": "S.E.B",
      "helpful_votes": 3,
      "publication_date": 20180715
    },
    {
      "title": "Outstanding!",
      "text": "I currently have 4 of these driving separate in-ceiling speakers in my home. Office, living, bath..... I need to buy more, and each time I order I am always surprised by how much they are. But, the product and service is phenomenal. I can't complain at all. And each time I add one to my system it takes about 4 minutes including the time it takes to unpack!",
      "rating": 5.0,
      "verified": true,
      "author": "Wheelsup",
      "helpful_votes": 0,
      "publication_date": 20141109
    },
    {
      "title": "Sonus is THE way to stream music",
      "text": "I just moved into a new three-story home which is pre-wired for sound, security and television yet I chose SONUS to deliver music throughout my home. With a simple, plug and play connection system, nothing could be easier and you can control your entire music system with a smart phone or I-pad. Great for non-technical types with a bonus of terrific sound too. Great system!",
      "rating": 5.0,
      "verified": true,
      "author": "Watchman",
      "helpful_votes": 0,
      "publication_date": 20130121
    },
    {
      "title": "Amazing unit...",
      "text": "This enabled me to use other speakers in my home. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "August Martinez",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Have not dropped a beat yet!",
      "text": "We replaced a SqueezeBox that was dropping and skipping to a point where it was useless. Our Sonos products have not dropped a beat yet. We play Internet radio, Pandora and our own library of some 3,000 tracks on a network server. Sonos products are not cheap but you get what you pay for.",
      "rating": 5.0,
      "verified": true,
      "author": "Lars A. Selen",
      "helpful_votes": 0,
      "publication_date": 20140316
    },
    {
      "title": "Drives my bookshelf speakers nicely. I have a separate sub so I don't ...",
      "text": "Drives my bookshelf speakers nicely. I have a separate sub so I don't need high power. I'm very satisfied with the sound that this amp can produce.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161024
    },
    {
      "title": "Great quality Streaming music with your own speakers",
      "text": "I wanted to eliminate all my CD's, so I researched various wireless streaming players. Sonos won out. However wanted to use the JBL speakers I had used for my stereo. The Sonos connect amp allowed me to do so. I now have streaming music, that sounds great and no more CD clutter.",
      "rating": 5.0,
      "verified": true,
      "author": "Multimedia Professor",
      "helpful_votes": 0,
      "publication_date": 20131109
    },
    {
      "title": "Need more speaker hookups",
      "text": "Works great, easy to setup and get working. Wish it had the ability to have more than one set of speakers hooked into it though.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "Love it!",
      "text": "Love these. Bought 2 and they work as advertised. Sonos app is seemless and offers so much control and so many options. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "mattack",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Missing optical input.",
      "text": "Sonos kind of hoses you on this. No optical input (like the Connect has) but you can use it to amp a set of nicer speakers.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris Bollinger",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "EASY setup, maintenance free wireless connectivity",
      "text": "easiest wifi electronic setup ever - no lapse of service - when power interruptions occur unit comes right back online without human sequential reboot of modem, router, and sonos player (unlike my telephony, router, and repeater units), very easy to access music from many sources",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonFanatic",
      "helpful_votes": 0,
      "publication_date": 20140927
    },
    {
      "title": "Pricey but good",
      "text": "I have had one of these for over 5 years and love it. I like it so much I bought another one. And will probably buy yet another one. Its a little pricey but works great.",
      "rating": 5.0,
      "verified": true,
      "author": "jazar",
      "helpful_votes": 0,
      "publication_date": 20161029
    },
    {
      "title": "So easy a caveman could do it",
      "text": "So easy a caveman could do it. Setup was just too easy and in no time I was playing music from my Amazon account via my Android based tablet. This is probably an Amazon issue but I have Prime and I couldn't see the option to stream my free Prime music, only the songs I have bought through Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Rumbatech",
      "helpful_votes": 0,
      "publication_date": 20141018
    },
    {
      "title": "Outstanding sound quality and very good design. Highly recommended",
      "text": "Thrilled with this purchase. Outstanding sound quality and very good design. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Stagger_Lee",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "With the Sonos app I controll everything and it's amazingly easy and an excellent quality system",
      "text": "These are part of the sound system I've installed throughout my house. With the Sonos app I controll everything and it's amazingly easy and an excellent quality system.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauri S",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "Perfect for our needs",
      "text": "This worked very well for our needs. We have steered clear of Sonos for awhile due to their limitations with music services, but made the leap and we are glad. It has changed the way we listen to music.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170304
    },
    {
      "title": "It is Sonos!",
      "text": "It streams whatever music effortlessly and power your speakers fairly well. I have a pair of Sony speakers and Martin Logan speakers, Connect does not have any problem powering these at all. I highly recommend this if you want to listen to endless streaming music.",
      "rating": 5.0,
      "verified": true,
      "author": "Mat K.",
      "helpful_votes": 0,
      "publication_date": 20140110
    },
    {
      "title": "Excellent",
      "text": "Glad I chose the Sonos setup for my home. It may be a bit more expensive, but the convenience, sound, and ease of use that Sonos has makes it worth the price for me. I'm not a audiophile snob, but I'm pleased with everything I've purchased from Sonos thus far.",
      "rating": 5.0,
      "verified": true,
      "author": "Another Opinion",
      "helpful_votes": 0,
      "publication_date": 20140218
    },
    {
      "title": "Works great, sounds great",
      "text": "I bought this to drive some stereo speakers (old Advent's) and to serve as the bridge for a wider sonos network. The amp works great, has an abundance of power for lows and performs flawlessly as the bridge between my home wi-fi network and the Sonos systems in the rest of the house.",
      "rating": 5.0,
      "verified": true,
      "author": "John Winner",
      "helpful_votes": 0,
      "publication_date": 20140316
    },
    {
      "title": "LOVE Sonos, I have different components for 3 room ...",
      "text": "LOVE Sonos, I have different components for 3 room systems and then two portables one for garage and one for outside. I use one set with my computer, another with a home theater and this one I purchased to use with speakers only for bathrooms and one for bedroom.",
      "rating": 4.0,
      "verified": true,
      "author": "Chuck",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "Amazon won’t support",
      "text": "Bought this item for a new construction project and by time we attempted to install, we discovered item was defective and now Amazon will not allow a return after 60 days... bad for Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "John B Adams",
      "helpful_votes": 6,
      "publication_date": 20171224
    },
    {
      "title": "Five Stars",
      "text": "Sonos is hands down the bast audio for in home use you can buy.",
      "rating": 5.0,
      "verified": true,
      "author": "trevor",
      "helpful_votes": 0,
      "publication_date": 20180202
    },
    {
      "title": "I just love it",
      "text": "Did I mention I Love it? Easy set up and works like a charm. I cannot wait until it is integrated with Alexa.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven C.",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "It Just Works",
      "text": "Once I worked through my Internet issues that turn up to be a inferior router provided by my Internet router, this product is fantastic. Sonos technical suuport that I worked with over 2 hours on the phone was increditabe. So much so, is that I will only use Sonos products in my house, 2nd home, office and 2nd Office. It is not the cheapest product around, but if you figure you time and expertise needed to get other alternatives working this is the clear winner. Ease of use means your family can use it without being computer engineers. Now that this has solved my music distibution task moving on to video.",
      "rating": 5.0,
      "verified": true,
      "author": "David Alan Rehak",
      "helpful_votes": 0,
      "publication_date": 20130826
    },
    {
      "title": "Very solid solution.",
      "text": "Using this in my outdoor patio to power 4 speakers. I LOVE it. So much easier than a receiver and it seamlessly integrates with all my other sonos indoor products. It's pricey, but well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Critically acclaimed",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Sonos!",
      "text": "Added this unit to my other Sonos speakers so I now have music outside. The unit works perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Listen up",
      "text": "I’ll never go back to my stereo system! Excellent sound and system management!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Great way to power a set of speakers",
      "text": "I have this unit power my patio speakers and it works flawlessly. The fact that the software works on both Android and iOS and allows seamless integration with all online content sources no matter what tablet or smartphone you use is super convenient and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Hallauer",
      "helpful_votes": 0,
      "publication_date": 20141228
    },
    {
      "title": "Love my Sonos",
      "text": "I have a complete Sonos system and love it. Although it is a little on the expensive side, it is worth it if you want a house filled with music of your choice -- wirelessly. I have the Controller, the bridge, three units with amp and speakers (2 big, 1 little -- I recommend sticking to the larger unit), two amps, and one that just feeds my old hifi system (and accepts a line in). I have used their customer service a couple of times, and the service has been excellent. Obviously, I recommend Sonos!",
      "rating": 5.0,
      "verified": true,
      "author": "Geoff",
      "helpful_votes": 0,
      "publication_date": 20121006
    },
    {
      "title": "Good product too pricey",
      "text": "Bought this sonos to power two polk 8\" ceiling speakers for a patio. The unit performed as expected however the software required and the proprietary parts of it make it not very useful to use with any phone. It should support dlna from Android and airplay option from apple devices but it does not, it requires you to have the app and open the music in the app and play it from there. Sure most major online music retailers work with sonos but some actually charge extra for sonos functionalities. I will look for a better alternative that offers more transparent versatility.",
      "rating": 3.0,
      "verified": true,
      "author": "Keyur A.",
      "helpful_votes": 4,
      "publication_date": 20160615
    },
    {
      "title": "Great for existing system",
      "text": "Easy easy set-up - great to be able to stream from my phone using existing wiring and speaker in the house vs getting an all new wireless package.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie L. Mangold",
      "helpful_votes": 0,
      "publication_date": 20161223
    }
  ],
  "product_meta": {
    "title": "Sonos Connect: Amp - Wireless Home Audio Amplifier for Streaming Music, Amazon Certified and Works With Alexa",
    "description": "Style:CONNECT:AMP| Color:Light GrayThe Sonos Connect:AMP brings streaming music to your favorite wired bookshelf, floor-standing, outdoor, or in-ceiling speakers. Setup is easy, and you can play music on the connected speakers alone or throughout your house with Sonos speakers in every room. Wirelessly stream your entire music library and favorite online music services, and control it all with a free app on your phone, tablet, or computer.\n\nREVIEW FROM HOME THEATER MAGAZINE\n\n\nREVIEW FROM HOMETHEATERMAG.COM: SONOS\nIt's hard to overstate the simplicity of the Sonos system concept. There are three basic Sonos bricks: two audio players (the ZonePlayer 90 and ZonePlayer 120) and one handheld wireless Sonos Controller 100. The Bundle 150 includes one of each. Read the full review at HomeTheaterMag.com.\n\n>  > Visit HomeTheaterMag.com for more product news and reviews",
    "rating": 4.3,
    "feature_bullets": [
      "Upgrade your favorite stand alone speakers with amplified streaming music both indoors or outside",
      "More sonic punch. Built in amplifier powers large or small speakers. 55 W per channel at 8 Ohms. RCA line in for connecting a range of playback sources. Subwoofer line out",
      "Control wired speakers from anywhere in your home with a mobile device such as your smart phone. Connect to patio or poolside speakers for outdoor listening entertainment",
      "Wirelessly stream all your favorite music services like Amazon Music, Pandora, Apple Music, and Spotify",
      "Connect to any Amazon Echo or Alexa enabled device, then just ask for the music you love"
    ],
    "specifications": {
      "Product Dimensions": "8.15 x 7.28 x 3.5 inches",
      "Item Weight": "5.07 pounds",
      "Manufacturer": "Sonos",
      "ASIN": "B001CROHU4",
      "Item model number": "ZonePlayer 120",
      "Customer Reviews": "4.3 out of 5 stars514 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#17,546 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 18, 2005"
    },
    "categories": [
      "Home Audio",
      "Electronics",
      "Wireless & Streaming Audio"
    ],
    "price": 538.33
  }
}