{
  "website_summaries": [
    {
      "verdict": "The best body pillow on the market right now. Maintains its shape and durability over time, making it a solid investment.",
      "pros": [
        "Off the charts in terms of the comfort and support that it can provide",
        "Stands out for its very large size, which caters to all body types"
      ],
      "cons": [
        "A bit pricey, but the comfort it provides is well worth the price"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "One Star",
      "text": "I have purchased 2 of these pillows. The one my husband uses with his breathing equipment was used every night and you can tell that is is no longer firm, sagging in the bottom place of U - I would think that after paying 100.00 it would last at least a year, no?",
      "rating": 1.0,
      "verified": true,
      "author": "natalia",
      "helpful_votes": 60,
      "publication_date": 20170308
    },
    {
      "title": "Mine started to flatten after a week...",
      "text": "I was very excited when I finally scraped together the money to buy one of these, in hopes that I would sleep more comfortably while pregnant. Unfortunately, while the product description says \"assured never to flatten, clump, or lump\"... that's exactly what this pillow did for me. Within ONE WEEK of use, the top part was starting to go flat and within two weeks had almost completely flattened!! That is NOT what I expect when paying $109 for a pillow. Pretty disappointed to say the least...",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 30,
      "publication_date": 20180316
    },
    {
      "title": "I'm sleeping better than I have in a long while",
      "text": "A very well-made item and much bigger than the box it came in. If I'm using it, I tend to sleep better and for a longer period of time. When my lady uses it, it tries to shove me over to the edge of the bed and steal the covers. I don't think the pillow itself is totally to blame. She swears it's not her fault but I get the impression the two of them are in cahoots. There's something up, I just know it.",
      "rating": 5.0,
      "verified": true,
      "author": "Erik Johnson",
      "helpful_votes": 27,
      "publication_date": 20170104
    },
    {
      "title": "Purpose served",
      "text": "So, I wish I didn't need this big worm. Yes, I call it the worm, but it has helped me a lot since having a horrendous car accident and breaking my back. I was awake at least 5-8 times a night before getting it, and it seemed to reduce my discomfort, because after I got it, I only awoke about 3-5 times/night. Also, if you get it, and you should if you need it, in spite of the price, go the complete distance3 and get the pillowcase made just for it. Do not get a cheap one. Get the u-shaped pillowcase that zips open on the complete outside for easy put-on and take-off.",
      "rating": 5.0,
      "verified": true,
      "author": "minmi",
      "helpful_votes": 13,
      "publication_date": 20171004
    },
    {
      "title": "Poor quality, very dissappointed",
      "text": "I have only been using this pillow for two weeks and the fabric has torn. For the cost I am very disappointed in the quality. Will be trying to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 26,
      "publication_date": 20170202
    },
    {
      "title": "Keep looking",
      "text": "Initially, this body pillow is great. It cradles your body and allows you to turn from side to side effortlessly. But after a month, it totally loses shape. The filling moves from the U part to the ends. Every few days i popped in the dryer as recommended and it would plump it a tad, but a month later, I’m putting it in the dryer daily to give the littlest volume to the U part supporting my head. Also, I washed the pillow case in cold and tumbled dry low and now it doesn’t fit.",
      "rating": 1.0,
      "verified": true,
      "author": "Make-Time-To-Travel",
      "helpful_votes": 7,
      "publication_date": 20180625
    },
    {
      "title": "I wanted to love this product",
      "text": "I wanted to love this product, but I didn't even get to try it. I opened the package and it stated it was compressed for shipping and to shake it to help decompress. I shook it and it ripped almost all the way around the middle of the U shape. Pretty disappointed in the quality for the price of the pillow.",
      "rating": 1.0,
      "verified": true,
      "author": "Jwel09",
      "helpful_votes": 10,
      "publication_date": 20170615
    },
    {
      "title": "Comfortable but heavy",
      "text": "I’m still getting use to this pillow. I like that it pretty much stays put and doesn’t move unless I move it. It’s also comfortable and it can shift to different sides without readjusting anything. On the other hand, it’s heavy and takes effort to move it around each morning and night if you’re a bed maker like me. It also keeps in body heat so I feel almost too warm when sleeping. Overall I don’t regret the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Cynthia Anne",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "So much more comfortable!",
      "text": "I went with the more expensive pillow and can't say I tried any of the cheaper ones, but this has been a lifesaver already. I'm 19 weeks pregnant and sleeping so much better since I started using this pillow. I sleep with it upside down (u at the bottom of the bed instead of the top) so I am still using my normal pillow but this is nice having to prop my feet and legs on and cushion me all around. Recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Ellen S",
      "helpful_votes": 2,
      "publication_date": 20170808
    },
    {
      "title": "Decent pillow, AWFUL pillow case",
      "text": "So I like this pillow, it's comfortable, good firmness, and fits my body well, BUT the pillow case is SO scratchy and uncomfortable. I have to have some other cover on it (currently using a sheet) and the fact that I'm having to look into a different pillow case to spend even more money on irks me to no end. The pillow it's if good enough, but this darn pillow case....",
      "rating": 3.0,
      "verified": true,
      "author": "Channing",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Very comfortable but needs more filling",
      "text": "It was amazing, for two nights. Then it flattened quite a bit. I fluff and adjust it, which helps, but wish it had a little more stuffing. Still, it has helped a lot.",
      "rating": 4.0,
      "verified": true,
      "author": "Lorinda S. Mckinnon",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Bought this in April it is now August and it ...",
      "text": "Bought this in April it is now August and it is completely flat! I am so upset!!! When I first received it the pillow was big and fluffy and about two weeks later it began to break down. It's not worth the money at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20170817
    },
    {
      "title": "Best pillow",
      "text": "I LOVE this!!! I have lupus and fibromyalgia and when I’m in a flare my whole body hurts and I can never get comfortable. I used to sleep with pillows under my hips, knees and one in between my legs. They never stayed in place which was super annoying. This moonlight slumber stays in place all night and is SUPER comfortable. It’s fluffy and I didn’t have any problems with the pillow case after I put it in the dryer and I have super sensitive skin. Would recommend this to everyone!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Autumn Rose",
      "helpful_votes": 2,
      "publication_date": 20180604
    },
    {
      "title": "The best for back pain",
      "text": "This is so comfy and worth every penny my worm !!! Helps me with my pain !!! Helps me not move that much at night wish you had more colors available!!!",
      "rating": 5.0,
      "verified": true,
      "author": "BELLA",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Why would you sell this without a cover",
      "text": "I thought it was wierd that they were selling this white pillow without a cover, I thought there would be something to hide all the stains from drool etc, but this did not. there are so many better pillows with a darker tint or with pillow cases that seem to be much better.",
      "rating": 3.0,
      "verified": true,
      "author": "Nery Ralon",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "It's also not particularly comfortable and the zipper arround the perimeter sucks and you ...",
      "text": "Returned it. It's way narrower than I expected and the girl in the picture must be really short because it didn't even reach my knees (I'm 6' 1\"). It's also not particularly comfortable and the zipper arround the perimeter sucks and you feel it when you throw your leg or arm around the thing. Back to the drawing board, looking for a new body pillow. My big gripe with my current body pillow is it's too heavy and is difficult to toss from one side of me to the other which is why I tried the one I'm reviewing here. I'd like something large and firm but not heavy. Suggestions anyone?",
      "rating": 2.0,
      "verified": true,
      "author": "dliguori25",
      "helpful_votes": 0,
      "publication_date": 20141224
    },
    {
      "title": "Fantastic pillow..",
      "text": "I love my Comfort U pillow. I have fibromyalgia, TMD and disc problems in my lower back. I had a steroid injection in my lower back the morning it arrived and I slept like a baby. It arrived before I expected it and I was thrilled. If you're on the ledge about buying one like I was, get it today! It's amazing !! I think I'm going to be fighting my springer for a space in the \"cocoon\" it makes..",
      "rating": 5.0,
      "verified": true,
      "author": "Jo",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "Hammock Pillow",
      "text": "I have a hammock that I use as my couch and my bed. This pillow is really nice to throw into the hammock and sit in the middle of when you are reading or on your laptop. It provides a back cushion to make you upright and the rest of the pillow on either side of you acts as armrests. I prefer to take the pillow out to sleep as I like to sleep nice and cool but it is comfortable and I have fell asleep plenty of times with the pillow in the hammock. If you like to spend time in a hammock try this pillow out. I like it.",
      "rating": 5.0,
      "verified": true,
      "author": "SwimSometimes",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Disappointing",
      "text": "My first few nights, I loved this. Multiple back surgeries this pillow gives a lot of support. But these are the problems. Way too big for a Queen bed. If you get hot during the night, this design keeps heat around your body; too hot for me. My biggest complaint, the cover design where it zips digs into where your neck/head goes. The support was good but too many faults.",
      "rating": 2.0,
      "verified": true,
      "author": "denise p.",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Good pillow for back support",
      "text": "This is not a very dense fluffy pillow. But i believe it serves its purpose for support. Im 6'2 225lbs and its plenty of pillow for me. The only thing that takes getting used to is turning over at night. You are a pretzel in the pillow and you have to move alot more out of your way to rotate or get out of bed with it under the covers. Its a little overpriced considering the quality but in the end it does its job and seems to be holding up.",
      "rating": 4.0,
      "verified": true,
      "author": "pbl57lsu",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "Ordered for a friend that has back problems",
      "text": "It has been quite some time since I ordered this product, yet my best friend tells me every time she talks to me that she loves this pillow. She tells me it is more than just a pillow. She uses it for great comfort for her back. I highly recommend this pillow for others.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Best ever",
      "text": "I'm not prego, never have been but I like a pillow between my knees and one up against my back. This does both!! I'm single and it serves as a good \"big spoon.\" Takes a lot of the bed up so not sure I'd recommend for anyone that sleeps with another human...and likes to snuggle. Of course, if you have a significant other, this item becomes less needed, right!?! My dogs LOVE it and shtoink it if I get up for even a second!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kpg",
      "helpful_votes": 0,
      "publication_date": 20170506
    },
    {
      "title": ") I am 6' 2\" and 220lbs and this pillow is UNBELEIVABLY COMFORTABLE for me",
      "text": "Bought this for my wife and am going to have to buy my own. I attempt to steal it from her every night! ;) I am 6' 2\" and 220lbs and this pillow is UNBELEIVABLY COMFORTABLE for me! I HIGHLY HIGHLY HIGHLY RECCOMEND! YOU WILL NOT BE DISSAPOINTED!",
      "rating": 5.0,
      "verified": true,
      "author": "BigToe",
      "helpful_votes": 2,
      "publication_date": 20170425
    },
    {
      "title": "lifesaver",
      "text": "I've had terrible nausea and vomiting since 5 weeks into my pregnancy. Nights were terrible because every position caused strain on my stomach muscles in one way or another. This pillow has helped me significantly to fall asleep quickly and stay asleep through most of the night. Expensive, but worth every penny. I am also a natural stomach sleeper and this has helped the transition to side sleeping breezy. My husband hates that it blocks the cuddles, but he uses the side closest to him every night between his knees to sleep better. Also helps keep me cool through the night. A must-have in my book.",
      "rating": 5.0,
      "verified": true,
      "author": "MCme",
      "helpful_votes": 2,
      "publication_date": 20140422
    },
    {
      "title": "This is the best body pillow ever",
      "text": "This is the best body pillow ever! I'm not pregnant and dont plan to be, but I am the worst sleeper ever. I toss and turn a lot which causes me to wake up 50 times a night which then makes me feel terrible the next day. With this pillow on the other hand, I am so perfectly snug! I sleep soundly through the whole night with out tossing or turning or waking up. Its a life saver for me! If somehow I ruin it or wear it out I will buy another for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 2,
      "publication_date": 20150412
    },
    {
      "title": "Does the job",
      "text": "Pregnant wife likes it - does the job. The cover that comes with it is very nice - feels like a high quality sheet/pillow case. It is long enough that she can place it between her legs all the way to her ankles - plus she can flop to the other side and still be comfortable. Although watching her climb out of bed in the morning is a somewhat hilarious event as she is surrounded by this moat of pillow. Our bed is queen size - and there isn't much room for me. I figure this is a temporary issue.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Jones",
      "helpful_votes": 0,
      "publication_date": 20150408
    },
    {
      "title": "very nice. I have recently moved to sleeping on back ...",
      "text": "It's seems an expensive investment for a pillow, but it really has improved my sleep posture and helped my back so far! I started using it sleeping on my side with the bottom of the U (upside down U) under my head and the side between my knees and arms, very nice. I have recently moved to sleeping on back and turned the pillow so it is in standard U position, with the bottom of the U under my knees. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170121
    },
    {
      "title": "Love my u pillow!",
      "text": "Bought this new u pillow to replace my old one and it's everything and more! I sleep much better using it.",
      "rating": 5.0,
      "verified": true,
      "author": "lkd",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Helps with my RA and FIbromyalgia pain",
      "text": "Best support I’ve found for my RA and Fibromyalgia. I use it with bottom of U at my feet. Only one I’ve found the supports back and gives support between knees and ankles with my legs straight. Helps alleviate hip pain. I’m 5’2”.",
      "rating": 5.0,
      "verified": true,
      "author": "Dogmom55",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Pain free",
      "text": "I am a side sleeper. Was having hip pain, shoulder pain and neck pain. All have gone away. No more tossing back and forth for relief. Love my pillow.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Awesome",
      "text": "This pillow has helped me so much. I have all-over back problems and this pillow gives me the support I need at night. I like the removable, washable case. The only cons are that it takes up a lot of room (my poor husband), and the head/neck area gets a little lumpy. I would LOVE this pillow if they made it with latex foam!",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren Bocken",
      "helpful_votes": 3,
      "publication_date": 20150728
    },
    {
      "title": "This pillow is so amazingly amazing!",
      "text": "I L.O.V.E. this pillow. I am a sleeper who does not stay in one position throughout the night. I start out on my side and usually end up on my back or on the other side. Since purchasing this pillow, I have not rolled around or experienced the restlessness that normally accompanies sleep for me. I have, in the past week, gotten 6+ hours of continuous sleep. It comes with a white pillowcase so there is no need to purchase an additional one unless you are going for a specific color scheme or want something of higher quality. Overall, I love this pillow and couldn't imagine sleeping without it!",
      "rating": 5.0,
      "verified": true,
      "author": "Onaje Oladuwa",
      "helpful_votes": 3,
      "publication_date": 20150120
    },
    {
      "title": "Dissappointed",
      "text": "I was excited to receive my new pillow but when I opened it I was disappointed to realize that the advertising is deceiving. This is not a solid pillow as the description implies but it is actually a maternity pillow that is three different pieces stuffed into one pillow case. This creates empty space where the 3 pillows meet and I am concerned that these dips will become much more pronounced over time. I definately think that somewhere in the description it should note that this is not in fact one giant U shaped pillow but rather 3 smaller pillows stuffed into one pillow case.",
      "rating": 3.0,
      "verified": true,
      "author": "jlynne",
      "helpful_votes": 157,
      "publication_date": 20130201
    },
    {
      "title": "I'm in love!",
      "text": "My husband bought me this pillow because he works overseas most of the year. I cannot thank him enough lol. I haven't had this good of sleep in forever! I have found the pillow of all pillows! So comfortable and you can bend it into so many different shapes. My adult son loved it so much we got him his own. The only thing I was bummed about was when he got his pillow it had a pillowcase in it. Mine did not come with a pillowcase. Is mine just missing or did he get one by mistake?",
      "rating": 5.0,
      "verified": true,
      "author": "Porfirio Rivera",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "I'm five months pregnant and typically a back sleeper. ...",
      "text": "I'm five months pregnant and typically a back sleeper. This pillow is firm enough to keep me from rolling onto my back in the middle of the night, but soft enough that I don't wake up sore and I can move it to fit under my belly and between my knees. I don't know how I would get any sleep during this pregnancy if I didn't have this pillow.",
      "rating": 5.0,
      "verified": true,
      "author": "Kara P.",
      "helpful_votes": 2,
      "publication_date": 20150928
    },
    {
      "title": "I've had this pillow for 5 months and I love it. it totally cradles you",
      "text": "I've had this pillow for 5 months and I love it. it totally cradles you. I purchased it due to getting a full knee replacement and needed to sleep on my back in the beginning and was able to keep my leg elevated with this pillow while being cradled. now I use it every night.",
      "rating": 5.0,
      "verified": true,
      "author": "Mack",
      "helpful_votes": 2,
      "publication_date": 20180623
    },
    {
      "title": "LOVE this pillow",
      "text": "I have had this pillow for a couple months now and love it. I have suffered with low back pain for years and recently hip pain. This pillow has helped tremendously and my husband loves that while I use one side he can throw his leg on the other side. We do have a king bed so plenty of room",
      "rating": 5.0,
      "verified": true,
      "author": "Lonnie Paul Burgess",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "A body pillow that lives up to the name .",
      "text": "Bought this for my wife,she loves it. I looked and checked all over for the right one.I FOUND IT. My wife is not pregnant. This is a great body pillow for anyone .It cost a little more then other ones, but worth ever penny. It's real soft and compatible.I all sow bought the blue pillow case .",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew ( CHIPS )",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "Don’t do it",
      "text": "This pillow is so flimsy. No support. Nothing like pictures. So dissatisfied",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200509
    },
    {
      "title": "Comfortable and cuddly",
      "text": "I bought this to help keep me square at night because my hips and shoulders will start bothering me. I guess it's a side effect of birthdays! None the less, this pillow has been wonderful not only for full body comfort but also for getting spooned without having to deal with someone else's body heat. I would definitely purchase this again and purchase it as a gift for someone.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous Buyer",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Perfect for my back as I sleep",
      "text": "This is such a comfortable pillow. It supports my back as I sleep on my side and allows me to put one leg on top of the pillow with the other leg under the pillow for more lower back supper. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mommy Bear Carrie",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Horrible and hot",
      "text": "Hated this pillow used for one day. It was hot, uncomfortable...definitely not worth $100 and definitely not a “down-alternative” feel. Tried to return but the return policy expired within 30 days. Who has the time to return something so quickly?!",
      "rating": 1.0,
      "verified": true,
      "author": "Renee",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "The Best Ever!!!",
      "text": "I have suffered from insomnia for months. I received my pillow 4 days ago. I have slept all night since. I was unsure when I bought it but this is the BEST purchase I’ve made in years. It use it to sit up and read versus stacking pillows I would have to readjust. This pillow does exactly what I need it to do. Love, love, love this pillow.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Cheap",
      "text": "This pillow is comfy but it completely fell apart the first week. You def need a cover so the stuffing won’t fall out . The cover that you purchase with the Pillow is extremely cheap and gets the small balls of faded fabric. Overall it’s just a very expensive body pillow",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Best pillow ever!",
      "text": "Best pillow ever. Came in a small box and was ready to use almost immediately. No bad smell. Cover is easy to wash. Great for my back pain.",
      "rating": 5.0,
      "verified": true,
      "author": "vanished24",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "A good product",
      "text": "Given as a gift to an expectant mother. She raves about it!",
      "rating": 5.0,
      "verified": true,
      "author": "Nana",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "I love this for the most part",
      "text": "I love this for the most part, but it is too hard for my neck. I wish that part were made of a different filler. I use a regular pillow and turn it upside down like an actual \"u\" and I'm fine...my cat also likes it! :)",
      "rating": 4.0,
      "verified": true,
      "author": "Diana Bush",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "When I couldn't get comfortable, this did the trick.",
      "text": "I loved this pillow during my pregnancy. I got it at around six months and never stopped using it. The pillow case is easy to remove and wash, doesn't shrink and is easy to put back on. My on,y complaint is that the pillow lost its fluffiness relatively quickly, at the part where I laid my head. I compensated for it by using my own pillows on top. The part of the pillow where I wrapped my legs stayed ok. I think it's worth getting.",
      "rating": 5.0,
      "verified": true,
      "author": "Metuka",
      "helpful_votes": 0,
      "publication_date": 20130220
    },
    {
      "title": "I call it the Pillow Fort- Girl pillow heaven!!!",
      "text": "This was the BEST investment I made while preggo. I have no clue how I ever lived without one for so long! It is HUGE!!!- So, your bed partner will NOT be getting anywhere near you -and if you have less than a King sized bed they may not even be able to be in bed with you at all- but you are pregnant so you get whatever you want, right!? I have it packed away now waiting for round 2.",
      "rating": 5.0,
      "verified": true,
      "author": "AJ Riggins",
      "helpful_votes": 0,
      "publication_date": 20150222
    },
    {
      "title": "This is a GREAT pillow!",
      "text": "I absolutely LOVE this pillow! I've had problems sleeping for some time, and with a recent shoulder replacement I could not get comfortable no matter what I did. I saw this pillow one night and thought I would give it a try. It's WONDERFUL! It wraps around you and supports you wherever you need it to. It's like being cradled, honestly. It comes with a pillow case, but I ordered an extra one so I can change it when I change my bed.",
      "rating": 5.0,
      "verified": true,
      "author": "dixiegal97603",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Very Comfy and Soothing",
      "text": "I really like this pillow. It feels like sleeping in a cocoon. This is the only setup that has helped me sleep on my back.",
      "rating": 5.0,
      "verified": true,
      "author": "WendyH",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Worth the money for preggos!",
      "text": "This is the only pregnancy pillow you will ever need. I gave birth twice in a span of 2 years and this was always my lifesaver. You cuddle it in the front and it cuddles you from behind and gives you the support you need for neck, tummy, arms, legs, and back. It was high in price but it's been the best and totally worth the money. Only problem now is the amount of space it takes up while I don't need it when I'm not pregnant",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 0,
      "publication_date": 20160923
    },
    {
      "title": "Save your money...",
      "text": "I expected this to be big. My husband was already prepared to sleep on the couch. But it just wasn't a comfortable pillow. I much preferred to use two/three separate pillows of my own then this large pillow. For my head, it was too high. Gave no support to my tummy/back. The part that lay next to the edge of the bed always fell off, no matter how I adjusted it. Returned it after two weeks of trying to make it work and got my money back.",
      "rating": 2.0,
      "verified": true,
      "author": "jllapka",
      "helpful_votes": 0,
      "publication_date": 20150318
    },
    {
      "title": "Great support",
      "text": "This is the best support pillow! Although not pregnant, I have a bad back (4 surgeries). I have been searching for something for years that can help me sleep more comfortably. So glad I finally found it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "KAZ",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Best pillow ever!!",
      "text": "I am six months pregnant and when I was about 4 and a half months it became really hard to sleep. I was tossing and turning and not able to get comfortable so I went online and started looking at different body pillows. I am so glad I chose this pillow! I have already washed the cover and it came out fine. I love going to sleep at night and it keeps me asleep (until I need to get up to pee!) I wake up with a huge smile on my face!! I can't stress enough how much I love this product and how much more comfortable I am!! Worth every penny!!!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Green",
      "helpful_votes": 0,
      "publication_date": 20091124
    },
    {
      "title": "I tried it for my Fybromialgia",
      "text": "I can't sleep and thought I would try this U comfort Pillow to see if I could sleep without PAIN, I found it to Hard, maybe it's just me But I feel I need a much softer Pillow. I use blankets right now to sleep. I am sick of having so many blankets to tuck under me every night I thought maybe this U pillow might work better. But did not, sorry I could not say this pillow was great,",
      "rating": 3.0,
      "verified": true,
      "author": "sunny61",
      "helpful_votes": 0,
      "publication_date": 20130709
    },
    {
      "title": "Expected better durability for the price.",
      "text": "Very comfy and cozy but ripped very easily. Sowed it up and it's okay but keep pets away because one scratch and it's done.",
      "rating": 4.0,
      "verified": true,
      "author": "Melissa Bloomfield",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "EXCELLENT sellers AND product",
      "text": "More than happy with all of it. Fast shipping too and WE LOVE IT - size is accurate in picture. love love love",
      "rating": 5.0,
      "verified": true,
      "author": "peggy gardner",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Returned Item",
      "text": "This item was too hard for me..I was looking for something VERY CUSHY...I retired the item....was WELL MADE...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Not Much Head Support",
      "text": "My stepmother loves Comfort-U pillows. And she needed a new one. When we got it today, she said she hated it. Not a lot of support. Her head went straight down to the mattress.",
      "rating": 1.0,
      "verified": true,
      "author": "Ally Gonzales",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Life saver!!",
      "text": "Purchased when I first found out I was pregnant and didn't really use it until my sixth month, but at this point, it's well, well worth the money. I have been suffering from hip pain when I sleep on my side, and this allows me to sleep, sort of, my back, at an angle, to relieve the pressure. Sleeping while pregnant is hard enough, especially in the third trimester, and this give me the chance to get some sleep.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Brooklynite",
      "helpful_votes": 0,
      "publication_date": 20120208
    },
    {
      "title": "Comfort U?  Not for me ...",
      "text": "I have fibro and thought this would be amazing. Not so much. It's super heavy and super cumbersome. The worst part? You can't use a regular pillow with it. And it's not thick or firm enough to replace a regular pillow. In fact, the whole thing is not thick or firm enough. And it's scratchy. And I'm not a princess. Great concept but way too overpriced for what it is.",
      "rating": 2.0,
      "verified": true,
      "author": "Kskater11",
      "helpful_votes": 2,
      "publication_date": 20121126
    },
    {
      "title": "Auto-Immune Arthritis",
      "text": "I bought this for my wife after reading the reviews. She suffers from a form of autoimmune arthritis and has difficulty sleeping and staying comfortable most nights. She has raved about this pillow since the first night she slept with it. She has only been using it for about 10 days, so I cannot comment on durability, but so far it is a hit!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian R. Jones",
      "helpful_votes": 0,
      "publication_date": 20140106
    },
    {
      "title": "Picture is misleading",
      "text": "This product is poorly made and isn’t big enough for adults. The picture for the product appears to be big enough for an adult, but it’s better suited for a young child.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Lifesaver",
      "text": "My daughter was on bed rest during her pregnancy and this was a lifesaver. I don't think she could've stood it if she didn't have this pillow. She has a bad back from a previous sports injury, so her back hurts anyway. Then to be pregnant and on bed rest... She fondly refers to this pillow as her nest. I would definitely buy this again for any friends with bad backs or young mothers on bed rest ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Pug1",
      "helpful_votes": 0,
      "publication_date": 20121104
    },
    {
      "title": "Excellent",
      "text": "This pillow is fantastic. I can now turn and my knee rests on a pillow on either side without having to drag pillows and fight covers. I can curl one side around and make a comfortable pocket to snuggle in with my kindle and drift off to sleep. It helps the pain in my hips with just the right lift. Even has enough room for my little dog Luci to snuggle in with me. I would not do with out it now. Love, love, love this pillow.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Beyer",
      "helpful_votes": 0,
      "publication_date": 20101023
    },
    {
      "title": "Big, fluffy & very comfortable",
      "text": "i lay down to read a book or on my computer, i feel in heaven. It is big & fluffy & very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Maritza Burgos",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "I sleep like a baby",
      "text": "Don't use it all of the time but when I do, I sleep like a baby. Kind of big to store when not in use but it comes in handy very often. It is good to change your sleeping patterns every once in a while by using one of these.",
      "rating": 4.0,
      "verified": true,
      "author": "Ozzie",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "Very good Quality and Comfort especially for sciatic pain",
      "text": "This one is Very Full and Fluffy - Love It! The last one I ordered was tiny like for a child and I was quite disappointed so I was very happy with this one!!",
      "rating": 5.0,
      "verified": true,
      "author": "AK Girl",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Amazing",
      "text": "Some of the reviews on here made me pretty weary of this purchase. After receiving my pillow and reading the reviews, it's clear that some people are reviewing the wrong product! This pillow is wonderful. It is so versatile and comfortable. Once you get in and cozy, good luck wanting to get out.",
      "rating": 5.0,
      "verified": true,
      "author": "ktwould",
      "helpful_votes": 0,
      "publication_date": 20150408
    },
    {
      "title": "Horrible quality,fabric  broke after two night of sleep!",
      "text": "This product is not worth 109 dollars! Too big in diameter, bad quality filling, and fabric.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180824
    },
    {
      "title": "Super Comfy",
      "text": "Love it. Super comfy. Comes with a pillow cover. I use it on a couch both for lying down and sitting up.",
      "rating": 5.0,
      "verified": true,
      "author": "NY lawyer",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Not a soft and fluffy pillow",
      "text": "I was having trouble sleeping during my first trimester, so I decided to give this pillow a try. While I really like the sides of the pillow to help me get comfortable, the pillow itself wasn't soft and fluffy. The head of the pillow isn't any softer than the rest, and I woke up with a sore neck from using this pillow. The case must be less than 200 thread count, which made it very rough on my face. I ended up buying 2 cheap body pillows from target and using my own pillow and that has worked well for me for the past several months.",
      "rating": 2.0,
      "verified": true,
      "author": "Ashley Delzer",
      "helpful_votes": 0,
      "publication_date": 20140716
    },
    {
      "title": "Girlfriend enjoys it.",
      "text": "I was a little concerned with the price but the girlfriend sleeps, watches tv, reads, and uses her computer in it. Little concerned it's going to replace me.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Not sure it’s made by original ComfortU",
      "text": "I like it fairly well so far. I previously had a ComfortU pillow and I don’t believe this one is made by the same company even though it goes by the same name. I wish I would have investigated more and found the original ComfortU pillow.",
      "rating": 3.0,
      "verified": true,
      "author": "onegreataunt",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Love it",
      "text": "I love it. I had another brand and it was hard and uncomfortable. I took a lot of time looking for something that would be soft. I can actually use the top of the pillow as my pillow which is great. Although it’s big I don’t have 10 pillows on my bed anymore lol",
      "rating": 5.0,
      "verified": true,
      "author": "desiree richmond",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Nice surrounding pillow",
      "text": "This is first full body pillow I ever used. Bought it to help myself with snoring problem (I snore much less when sleep on side). What can I say - I love this stuff ! Very comfortable !",
      "rating": 5.0,
      "verified": true,
      "author": "Oleksiy",
      "helpful_votes": 0,
      "publication_date": 20161013
    },
    {
      "title": "Exactly what I wanted!",
      "text": "Exactly what i was looking for! I use this product mainly to help with my pregnancy, but I also have fibromyalgia. Its all around support, and has not yet lost its fluff in the 2-3 months I've had it. Only down side is that its quite large and so definitely need at least a queen size bed to sleep comfortably with another person and the pillow!",
      "rating": 4.0,
      "verified": true,
      "author": "Claranna A.",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Buy this pillow for expecting mothers or those who have to cuddle to sleep",
      "text": "I must admit this Pillow was hated by me (the husband) at first due to its size, however once my then present wife cuddled into it i knew i would lose the war. He have had this pillow for over two years now and it has stood the test of time. Buy a second cover when you first buy the pillow. must have for expecting mothers",
      "rating": 5.0,
      "verified": true,
      "author": "Joninthearmy",
      "helpful_votes": 0,
      "publication_date": 20141216
    },
    {
      "title": "Flattens down to soon",
      "text": "Initially this worked great for me. It helped eliviate the neck pain from a hit and run accident years ago. BUT the u part flattened out while the sides didn't.",
      "rating": 3.0,
      "verified": true,
      "author": "Barbara L. Sybil",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "AWESOME",
      "text": "MY DAUGHTER LOVES THIS!!! HER FAVORITE GIFT BEST MONEY SPENT....GREAT SUPPORT ALL AROUND COMFORT.",
      "rating": 5.0,
      "verified": true,
      "author": "DMB",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "QUIT YOUR SEARCH NOW!!!",
      "text": "I bought this LAST YEAR for my girlfriend's birthday and she loves it! It does NOT lose its 'fluff' as some have claimed and it is HUGE just as it is shown in the photo. I do not believe that it needs a cover over it because the material that is used is very soft. Like I stated early I bought it as a gift and they even gift wrapped it for me! It came in a huge santa-claus looking like bag. She loves it and now she cant seem to sleep without it! (hopefully that wont be an issue when we live together hah)",
      "rating": 5.0,
      "verified": true,
      "author": "Majed",
      "helpful_votes": 0,
      "publication_date": 20131128
    },
    {
      "title": "Most comfortable pillow ever.....",
      "text": "This pillow was AMAZING. I purchased it to use after my surgery and it was perfect. The most comfortable pillow ever and I'm still using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Best pillow EVER.",
      "text": "Amazing pillow. So comfy. Would recommend to anyone with hip issues.",
      "rating": 5.0,
      "verified": true,
      "author": "TERRI MCCOY",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Best purchase Ever!",
      "text": "This PIllow is AMAZING! I'm 21 weeks pregnant and could NOT sleep at all. I poured over tons of reviews online before I found this pillow. It is sooo comfortable. IT cradles you perfectly and its not too hot. Alot of reviews mentioned it going \"flat\" really quickly, I slightly agree that it does need some occasional fluffing to keep its shape but it is still super comfortable. The only gripe I had was that the \"u\" part where you lay your head can be a tad flat, so I sleep with another pillow under mine. Overall this pillow is a lifesaver and I simply can't sleep with out it. Its definately worth the price!",
      "rating": 4.0,
      "verified": true,
      "author": "KSherrard",
      "helpful_votes": 0,
      "publication_date": 20140711
    },
    {
      "title": "My partner bails from our bed and curls up in ...",
      "text": "My partner bails from our bed and curls up in this thing in her office which equals a win/win for us both!!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "Great product! Delivered as promised.",
      "text": "Just as described with on time delivery. It’s amazing how using this body pillow helps get a better sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Wonderfully comfy!!",
      "text": "Love this!! It was perfect for when I was pregnant excuse it gave me so many options of ways to sleep. It does take up quite a bit of room, but it was worth it to both my husband and I because I could finally sleep. I still have it and use it during the occasional nap... It's that comfy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20141126
    },
    {
      "title": "Great for someone with back and hip issues",
      "text": "I have back and hip problems and this pillow has allowed me to sleep without reduced pain! Lifesaver for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Sleep the night through.",
      "text": "At last I sleep through the night. It makes me of feel like I am being hugged. I like it very much. I would pay more for better quality. This one isn't going to last a year, I sleep rough.",
      "rating": 4.0,
      "verified": true,
      "author": "pamela X jennings",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "So far it seems to be good I would buy it again if I need to",
      "text": "I haven't used it long enough to really give a review. So far it seems to be good I would buy it again if I need to.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Too cumbersome never used it",
      "text": "Takes too much room without added value. Never used it as it's not really helpful for me while pregnant.",
      "rating": 1.0,
      "verified": true,
      "author": "bhadras",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Better on the second try!",
      "text": "I liked it much more after I used it a while. At first I thought...\"no way,\" but I tried it for a week and now I don't want to live without it or something much like it.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Love, love, love!!!!",
      "text": "My daughter sleeps much better now - great for teens!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Not for thin or petite people",
      "text": "Even at 5 months pregnant I am thin overall (size 2 pre-pregnancy). The two arms of the pillow do not come in close enough to support my back when I'm on my side. I bought this pillow to prevent me from rolling onto my back at night but there is so much space in the middle that I always end up on my back anyway and wake up with lower back pain. I have no idea how in the picture the arms are cradling her body so tightly. I have no concerns with the softness or fabric, head support, or the fluffiness of the fill, but I think this pillow is meant for someone larger.",
      "rating": 2.0,
      "verified": true,
      "author": "A. Longo",
      "helpful_votes": 0,
      "publication_date": 20140803
    },
    {
      "title": "Super Comfortable",
      "text": "My mom sleeps on a fold-out couch and it was causing her to wake up in pain. This pillow fixed that!",
      "rating": 5.0,
      "verified": true,
      "author": "dontfeedmygiraffe",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": ".Love this pillow .",
      "text": "I sleep so much better . Using for pain and sleep quality . Helps my knees and hips . Just overall comfort . Very glad I bought this .",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Hansenko",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Slept soundly while pregnant",
      "text": "This was worth every penny; I slept like a champ during my pregnancy because of it. I used this from 20 weeks until a few weeks after I delivered. It's super comfortable, it can support a belly, and it is suitable for a range of heights (I'm 5'2\" and there was definitely enough length for a taller individual). I even took it with me on a weekend trip. Love!",
      "rating": 5.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 0,
      "publication_date": 20150210
    },
    {
      "title": "This Christmas gift made her a very happy wife.",
      "text": "My wife absolutely loves her pillow. She used to have to position 3 or 4 pillows around her body to eliminate pain while she slept. This one pillow does the job all by itself. This Christmas gift made her a very happy wife.",
      "rating": 5.0,
      "verified": true,
      "author": "Thefamilyroom",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "LOVE it!",
      "text": "This is exactly what I needed at the time, however, had to use upside down as the pillow for head messed up my neck, Otherwise, LOVE it!",
      "rating": 5.0,
      "verified": true,
      "author": "lfk",
      "helpful_votes": 0,
      "publication_date": 20171228
    }
  ],
  "product_meta": {
    "title": "Moonlight Comfort-U Total Body Pregnancy Support Pillow and White Cover. Full Size. Comfort U Total Body Support.",
    "rating": 4.4,
    "feature_bullets": [
      "SLEEP THROUGH THE NIGHT. Finally get the rest you need with the Moonlight Slumber Comfort-U Total Body Support Pillow. The Comfort-U helps align your hips, neck, shoulders and back all while helping to regulate body temperature and enhancing circulation for a deep, restful sleep",
      "PREMIUM SYNTHETIC DOWN. Cradle yourself in complete comfort with the Comfort-U. Made of premium synthetic down, it is hypoallergenic, odorless, and offers relief from dust mites with its machine washable construction, giving you one less thing to worry about",
      "FUSION FIBER-FILL. The synthetic down stuffing is a revolutionary material known to scientists as an extended polymer, which allows air to freely flow through the material while upholding its shape",
      "CLEANS EASILY. Simply throw this pillow into a standard washing machine and dryer for an easy to clean, hassle-free body pillow. It will never clump, even after repeated washing, so you can look forward to long lasting clean comfort",
      "MADE IN THE USA. Moonlight Slumber procures the safest quality materials, so you can rest assured that the superiority you expect is delivered. The Moonlight Slumber Comfort-U Total Body Support Pillow will give you the support you need"
    ],
    "specifications": {
      "Product Dimensions": "60 x 7 x 35 inches",
      "Item Weight": "10 pounds",
      "Manufacturer": "Moonlight Slumber",
      "ASIN": "B0010BBN7M",
      "Item model number": "FBA_MSLCUHD",
      "Customer Reviews": "4.4 out of 5 stars1,306 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#106,985 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Fill material Type": "Down-alternative",
      "Material Composition": "Fusion Fiberfill in a cotton poly case, hypoallergenic",
      "Material Care Instructions": "Machine Washable",
      "Is Assembly Required?": "No",
      "Number of Pieces": "1",
      "Warranty Description": "1 year manufacturer warranty against defects.",
      "Batteries Required": "No",
      "Import Designation": "Made in USA"
    },
    "categories": [
      "Body Pillows",
      "Home & Kitchen",
      "Bed Pillows & Positioners",
      "Bedding"
    ],
    "price": 99.95
  }
}