{
  "website_summaries": [
    {
      "verdict": "An economical choice for stretch marks during pregnancy and just after birth.",
      "pros": [
        "Hydrates and softens the skin",
        "Thick cream doesn’t leave sticky residue",
        "Most found the baby powder scent subtle",
        "Works well at preventing stretch marks during and following pregnancy less noticeable"
      ],
      "cons": [
        "Doesn’t seem to help with old stretch marks"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good Stuff",
      "text": "Came all intact. I used this with my pregnancies 10 & 12 years ago and had only a few stretch marks on my butt..I gained 100 with that pregnancy and 25 with the 2nd. I’m on #3 now and using it again. My husbands grandmother told me about it and swore by it. She used it with all 9 of her pregnancies and has no stretch marks.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 2,
      "publication_date": 20200403
    },
    {
      "title": "No returns although package arrived looking used",
      "text": "I am so disappointed in this product and the way that t was shipped. The package had nothing that kept the lotion contained so on arrival the box was covered in lotion. As well the other looked used. I will not order again. This was a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Chunshine",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Stretch-marks almost gone!",
      "text": "I have been using this product along with an oral vitamin c tablet for about 2 weeks to prevent pregnancy stretch marks. I can honestly say that my old stretch marks from 7 years ago and being over weight are already starting to fade. Super excited to see what happens!",
      "rating": 5.0,
      "verified": true,
      "author": "Linsey B",
      "helpful_votes": 2,
      "publication_date": 20200310
    },
    {
      "title": "Really works!",
      "text": "This is literally the best cream to prevent stretch marks. I used it for both my pregnancies and never got any stretch marks, now my daughter is pregnant with her first child so I had one shipped to her immediately!",
      "rating": 5.0,
      "verified": true,
      "author": "Danny Head",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Perfect!!!!",
      "text": "I used this my whole pregnancy and NO stretch marks. I had my baby last week and I will continue to use it. I use it on my chest, arms and face. My skin changed JUST A LITTLE on my chest from hormones. It just started clearing back up today. This stuff works! I use it everyday",
      "rating": 5.0,
      "verified": true,
      "author": "Jamila Jones",
      "helpful_votes": 2,
      "publication_date": 20180709
    },
    {
      "title": "Stretch Marks Away!",
      "text": "Excellent product; true to its claims. I used this product when I was pregnant with my children and it prevented stretch marks. I was happy to learn that it was still being sold and sent it to my daughter. Same results.",
      "rating": 5.0,
      "verified": true,
      "author": "NWG",
      "helpful_votes": 2,
      "publication_date": 20181226
    },
    {
      "title": "Must have !!",
      "text": "I love this product, it’s a must have. I have used this product through both pregnancies, and I can honestly say if used correctly, I barley had any stretch marks showing.",
      "rating": 5.0,
      "verified": true,
      "author": "Chyna Mari ",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Only Lotion that Stopped my Belly Itching.",
      "text": "I was recommended to use this product by a waitress at a Ruby Tuesday, and it is a LIFE SAVER! This is the only lotion that stopped my belly from itching (5 months pregnant now) and the waitress explained that when she used this product it helped her not have any stretch marks, and she has 4 children. It comes in a tiny little bottle, but the bottle lasts me three weeks. I would definitely recommend to another fellow FTM.",
      "rating": 5.0,
      "verified": true,
      "author": "MAR",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Gets rid of Stretch marks !!!",
      "text": "Start using a few weeks after I had my baby and my marks got lighter now there disappearing. Has been in the family for years!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tee.Y",
      "helpful_votes": 4,
      "publication_date": 20180109
    },
    {
      "title": "Won’t be buying again!",
      "text": "Item not only came LATE but DAMAGED with all the contents spilled out.",
      "rating": 1.0,
      "verified": true,
      "author": "Travelenthusiast ",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "no stretch marks",
      "text": "This cream was recommended by two of my friends. Neither of them had stretch marks from their pregnancies and they swear by this. It smells very perfumy..like a little old lady, but I love it. The cream is COMPLETELY non-greasy, absorbs beautifully and makes my skin so soft. I am on my second tub of it. I am a nurse and I rub in into my hands every night to help with the dryness from washing my hands so much. Come to think of it, I need to buy another tub of this stuff. At 24 weeks I don't have any stretch marks yet, even though I know that can change",
      "rating": 5.0,
      "verified": true,
      "author": "Laney",
      "helpful_votes": 4,
      "publication_date": 20130514
    },
    {
      "title": "Smells good !",
      "text": "I used this lotion with my first child 5 years ago. Although I still got stretch marks, I believe they were minimal. The smell made it bearable to apply this lotion every night. I’m pregnant with my second child and I’ve ordered this lotion again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "good product",
      "text": "I started using this once I found out I was pregnant.. I use it on my stomach & breast I was doing well with the cream unti I reached 6 months I started seeing the pregnancy stretch marks underneath my breast only & on the top side of my thighs . I was told these go away after pregnancy which I’m sure they do my sister had them and hers went away. But other than that I haven’t had any stretch marks on my stomach or top breast .",
      "rating": 5.0,
      "verified": true,
      "author": "C M H",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Works well, overpriced.",
      "text": "Great product used for generations. Overpriced, but still bought it for my daughter she loved it during pregnancy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Works great for pregnant skin",
      "text": "I ordered this after finding it on Pinterest. I am 6 months into pregnancy and have yet to see a stretch mark. Great stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Moni",
      "helpful_votes": 2,
      "publication_date": 20171028
    },
    {
      "title": "Amazing to combat stretch marks - mother of twins",
      "text": "The moisturizer was the best I tried during my entire pregnancy and I was carrying twins trying to avoid stretching. My twins were very big one 7lbs 14 oz and the other 6lbs 9oz. So you can imagine the stretch with the fluid and sacs and placentas for each. This moisturizer is great... not enough in the jar.",
      "rating": 5.0,
      "verified": true,
      "author": "Aris",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "AMAZING!",
      "text": "My grandmother told me to order this as we just found out I’m pregnant, and it is absolutely amazing!! I wouldn’t use any other cream!",
      "rating": 5.0,
      "verified": true,
      "author": "Brianna L.",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Great for stretch marks",
      "text": "I have been using this product for many years now. I love it, it fades my stretch marks, better than any other products. I am glad to find it on amazon . Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Two Stars",
      "text": "My mom recommended this. It was pretty pitiful. Coconut oil was better.",
      "rating": 2.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Remember this from 1962",
      "text": "I used this while carrying my first child, it kept me from having stretch marks. When wanting it while carrying my second child one year later I could not find it in stores (no internet then). Now my granddaughter is carrying my great-grandchild, I ordered what I hope to be enough to last for the next 5 months. I hope it does for her what it did foe me. It really worked for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Clara",
      "helpful_votes": 3,
      "publication_date": 20140326
    },
    {
      "title": "Works great!!",
      "text": "Love this product!!! No stretch marks after two babies Works awesome",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Love",
      "text": "Love this for my baby bump and body and smells really good. It is a cream and doesn’t feel greasy or sticky. Loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Swanson44",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Works amazing!",
      "text": "Used it on my tummy along with bio oil my whole pregnancy and worked like a charm! have a few stretch marks but part is my own doing in getting to lazy towards the end!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170420
    },
    {
      "title": "Recommended by Mom and I have to say I really like it!",
      "text": "I can't say that this product stopped the stretch marks because I started using this a bit late in the game but what I can testify to is that the itchiness of the skin was definitely put off by this cream. I will purchase this product again with my next opregnancy for sure. The odor is pleasant and gentle.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristen Bell",
      "helpful_votes": 0,
      "publication_date": 20150727
    },
    {
      "title": "Great product, horrible packaging",
      "text": "I love this product, however, 3/4 of my orders came as pictured. The product was coming out all over the box and made a mess. I tried contacting the seller with no reply. 10/10 would recommend this product but I would not recommend this seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Helps with itchy stretching belly",
      "text": "Very smooth and soothing on my stretching itchy skin. I'm 25 weeks and no stretch marks yet. We'll see how it does in my 3rd trimester.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Miller",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Four Stars",
      "text": "It’s smells like a grandma...but I didn’t get a single stretch mark!",
      "rating": 4.0,
      "verified": true,
      "author": "Kaitlyn L",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Love",
      "text": "Loved this product. I had extremely sensitive skin while pregnant and this was the only thing that helped with the itchy and did not cause my skin to break out. No stretch marks on the areas I used it on from the beginning",
      "rating": 5.0,
      "verified": true,
      "author": "km",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Feels and smells nice",
      "text": "It feels and smells great! I havent had it long enough to know if it really helps with pregnancy related stretch marks but I like it so far!",
      "rating": 5.0,
      "verified": true,
      "author": "Serra M",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Hopefully it works",
      "text": "I waited an extra two days from the expected delivery date for it to show up like this.... disappointed to say the least.... on the bright side it smells good",
      "rating": 1.0,
      "verified": true,
      "author": "Shawna C.",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "Five Stars",
      "text": "Absolutely amazing! My skin hasn't felt this moisturized in years!",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria Suess",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "I believe!",
      "text": "I used this when I had my children- my daughter used, now my granddaughter!",
      "rating": 5.0,
      "verified": true,
      "author": "Lori Wiedrick",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Received w/ contents spilled out in box",
      "text": "Love the product but when I get it in the mail and open it up to see the cream all the over the box, that's disappointing. Received the first one fine but this one was just all messed up.",
      "rating": 1.0,
      "verified": true,
      "author": "Kelsey K",
      "helpful_votes": 6,
      "publication_date": 20160708
    },
    {
      "title": "Messy and unable to return",
      "text": "Are you kidding me? It’s only 4 oz and big surprise, isn’t eligible for return.",
      "rating": 1.0,
      "verified": true,
      "author": "Kelley",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Amazing skin cream",
      "text": "Amazing skin cream. Does not leave you feeling dry or oily like most lotions and I have alligator skin. Good for all over body use during and after pregnancy..",
      "rating": 5.0,
      "verified": true,
      "author": "A T",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "Skin like butter",
      "text": "This product makes my skin feel like butter and it smells sooo good. Smells kinda like baby powder. Don't know if it work yet but it definitely feels it will.",
      "rating": 4.0,
      "verified": true,
      "author": "Nekeisha",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Used?",
      "text": "Not sealed and leaking all over when you took the lid off... Is it a used product or what happened?",
      "rating": 1.0,
      "verified": true,
      "author": "Jocey",
      "helpful_votes": 2,
      "publication_date": 20160603
    },
    {
      "title": "Love this cream",
      "text": "Love this cream. I have used it with 3 pregnancies and won't use anything else for itchy skin/stretch mark prevention",
      "rating": 5.0,
      "verified": true,
      "author": "JJSMD",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "This paired with Palmers oil kept me stretch mark free ...",
      "text": "This paired with Palmers oil kept me stretch mark free during my pregnancy!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180418
    },
    {
      "title": "Life saver",
      "text": "One of the only things I want allergic to used multiple tubs while pregnant works great",
      "rating": 5.0,
      "verified": true,
      "author": "Clayton McDowell",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Mother's feiend",
      "text": "The best for stretch marks, specially to avoid qhen pregnant",
      "rating": 5.0,
      "verified": true,
      "author": "Lourdes maldonado",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "My favorite",
      "text": "Loved, loved, loved this while I was pregnant. Nothing made my skin feel as great as this cream. Didn't love the smell. Had a slight old lady smell, but for the feeling it left my skin, it was totally something I was able to get over.",
      "rating": 5.0,
      "verified": true,
      "author": "K Jinks",
      "helpful_votes": 0,
      "publication_date": 20130927
    },
    {
      "title": "2 stars",
      "text": "It did arrive on time, but as you can see it leaked everywhere!",
      "rating": 2.0,
      "verified": true,
      "author": "Brittany Walls",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "leaves skin soft",
      "text": "I purchased this because my mom kept raving about it. I have never been pregnant and I don't plan on having children. But I have stretch marks. On a whim I decided to purchase this. It leaves my skin super soft, almost baby skin like. I'm starting to use it as everyday lotion. My stretch marks aren't horribly bad, but enough to keep me self conscious about them. I've only had the product for about a month, but I see improvement in the softness in my skin. My mom is right, old skool products are so much better than new products.",
      "rating": 5.0,
      "verified": true,
      "author": "T's",
      "helpful_votes": 2,
      "publication_date": 20130323
    },
    {
      "title": "WORKS AMAZINGG",
      "text": "My mom used this when pregnant with both my sister and I. I’m currently 26 weeks pregnant and it has so far prevented stretch marks amazingly!",
      "rating": 5.0,
      "verified": true,
      "author": "Taleah ",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Amazing",
      "text": "Just received this and my stomach feels 1,000% better!! Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany R.",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Arrived Messy",
      "text": "Product was all over the inside of box when opened messy, would prefer not to order and have arrive like that again but product smells good.",
      "rating": 3.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "This cream seems to be number one at preventing stretch ...",
      "text": "This cream seems to be number one at preventing stretch marks. I've been using it everyday since I've found out I was pregnant, and so far no stretch marks.! I will definitely continue using Mothers Friend!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170819
    },
    {
      "title": "Horrible packaging",
      "text": "I got this product today and the thing was all over the box totally blew up in there and it says i cant return it...",
      "rating": 1.0,
      "verified": true,
      "author": "jewook choi",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Love this product",
      "text": "Been using this product for 5 years now and it works great",
      "rating": 5.0,
      "verified": true,
      "author": "Sascha",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Worth the investment.",
      "text": "Feels great on the skin but I honestly don't know if it prevented stretch marks or not. (For the record, I didn't have any after birth).",
      "rating": 5.0,
      "verified": true,
      "author": "Myshoeslookbetterthanyours",
      "helpful_votes": 0,
      "publication_date": 20150228
    },
    {
      "title": "Good product!",
      "text": "I like this better than their 'original formula'. The original formula is more like baby oil and this is an actual lotion. I still had stretch marks so I'm not sure that it worked as great as some said it did. It did make my skin feel really soft and if I had used it more it may have helped with the stretch marks.",
      "rating": 3.0,
      "verified": true,
      "author": "HReynolds",
      "helpful_votes": 0,
      "publication_date": 20110516
    },
    {
      "title": "Baby 4 and no stretch marks again!",
      "text": "I used this all four pregnancies, passed down as a family tradition...works great!!! No stretch marks again!!! Best cream out there.. Used for generations in my family",
      "rating": 5.0,
      "verified": true,
      "author": "Brandy31",
      "helpful_votes": 2,
      "publication_date": 20130826
    },
    {
      "title": "which was nice! Don't know why some people are complaining about ...",
      "text": "Came earlier than, which was nice! Don't know why some people are complaining about smell/after smell. I think it smells like baby lotion and there isn't much of after smell. Just tried it for the first time, goes on very smoothly and leaves your skin very soft! I'm only 16 weeks right now, so here's to hoping little too no stretch marks!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160518
    },
    {
      "title": "First Time User",
      "text": "After buying a cream in the maternity store as well as another retail store and not fully using the products, I was told about this particularly product by my mom. So I figured what do I have to lose in my quest to eliminate any stretch marks that might come as my pregnancy became further along. Now after giving birth 4 months ago and using this product consistently I'm proud to say that I give it the thumbs up. I have no stretch marks and I will use this product again if I ever become pregnant.",
      "rating": 5.0,
      "verified": true,
      "author": "New Mom",
      "helpful_votes": 0,
      "publication_date": 20120803
    },
    {
      "title": "Damaged and unreturnable",
      "text": "My item came opened and spilled everywhere in the package and I'm not able to return it. Such a waste of my money and I'm extremely extremely disappointed. Throwing away.",
      "rating": 1.0,
      "verified": true,
      "author": "Joel Charboneau",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Works wonders!",
      "text": "Love this cream! This cream was recommended to prevent scratch marks and so far so good. Not a stretch mark in site.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosalind",
      "helpful_votes": 2,
      "publication_date": 20140130
    },
    {
      "title": "used?",
      "text": "Definitely seems used. I just opened it there was no seal and the contents were all over the rim of the outside.",
      "rating": 2.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Great!",
      "text": "Great product! Fast shipping as well! Highly satisfied and recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "she liked it and liked the smell",
      "text": "this was a gift, she liked it and liked the smell, however it did not prevent stretch marks at all.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Eres",
      "helpful_votes": 0,
      "publication_date": 20150221
    },
    {
      "title": "Very Moisturizing!",
      "text": "I'm currently using this to prevent stretch marks on my pregnant belly... so far, it's working!",
      "rating": 4.0,
      "verified": true,
      "author": "L. Milby",
      "helpful_votes": 0,
      "publication_date": 20151113
    },
    {
      "title": "Mothers Friend Body Cream",
      "text": "This cream did not prevent stretch marks at all. I think if you're going to get them, you're going to get them no matter what. I even tried the $40 tube of Mederma. However, this is my favorite belly cream, as I hate the smell of cocoa butter and this smells nice. It is also very thick and makes your skin feel very hydrated. So I have bought 2 tubs of it and use it everyday. Love it as a belly cream to keep itch away :)",
      "rating": 3.0,
      "verified": true,
      "author": "Cellis",
      "helpful_votes": 0,
      "publication_date": 20130411
    },
    {
      "title": "It softens your skin very well of used daily, ...",
      "text": "It softens your skin very well of used daily, and reduces the scaring of new stretch marks, didn't really work on my old ones though.",
      "rating": 4.0,
      "verified": true,
      "author": "fatima",
      "helpful_votes": 0,
      "publication_date": 20150701
    },
    {
      "title": "Four Stars",
      "text": "It worked pretty well; however, the smell of the product is not very delightful.",
      "rating": 4.0,
      "verified": true,
      "author": "Morgan wall",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Mother's Friend Cream",
      "text": "This helps remove stretch marks and is very creamy and soothing to the skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Gomer",
      "helpful_votes": 0,
      "publication_date": 20150811
    },
    {
      "title": "Highly recommended to me...",
      "text": "Well this cream was highly suggested to me from alot of older women, who have had children already. Couldn't find it in any pharmacies, so i googled it & it bought me to Amazon. Im 21 weeks pregnant with my first child, I don't have a stretch mark yet. Don't know if it's from the cream or not, I think it's too early to tell, But I'm hoping it's as good as the reviews I have read, & recieved. I ordered 2 jars to start out with, & just placed an order for 3 more. I use it morning, and evening. It smells good, & goes on smooth. I hope it does the job!",
      "rating": 5.0,
      "verified": true,
      "author": "J.T.",
      "helpful_votes": 2,
      "publication_date": 20101114
    },
    {
      "title": "Love this stuff!",
      "text": "I love this stuff! I first heard of Mother's friend from a friend's friend (whew). I've been using this cream since I first found out I was pregnant. I'm now 7 months and I don't have any stretch marks. I don't know if it's because of the cream or maybe I have good genes, but I love this stuff and buy multiple boxes at a time. Good stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Jfab2008",
      "helpful_votes": 0,
      "publication_date": 20121226
    },
    {
      "title": "-) I love it and it smells",
      "text": "I've used this now for two pregnancies, and I have no stretch marks. it may not be the cream, but maybe it is :-) I love it and it smells good",
      "rating": 5.0,
      "verified": true,
      "author": "Historynerd2000",
      "helpful_votes": 0,
      "publication_date": 20150418
    },
    {
      "title": "I loved this while I was pregnant",
      "text": "awesome porduct. my mom and great aunt raved about this product (they used it in the 80's).",
      "rating": 5.0,
      "verified": true,
      "author": "Allamary Moore",
      "helpful_votes": 0,
      "publication_date": 20140824
    },
    {
      "title": "I love this product",
      "text": "I love this product! Worked well for my first pregnancy. I am now 26 weeks pregnant with my second child and hopeful to not get stretch marks with this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Love this product!",
      "text": "This is my first pregnancy and this cream makes my skin very soft and moisturized throughout the day. I will continue to use it everyday. It also smells really good...like a light scent of baby powder! My sister used it during her pregnancy and she didn't get any stretch marks; ive had the same luck so far at 6 months.",
      "rating": 5.0,
      "verified": true,
      "author": "Kori Moorer",
      "helpful_votes": 4,
      "publication_date": 20130918
    },
    {
      "title": "mothers friend cream",
      "text": "Ordered this a couple days ago and it already came in. The sender was very smart to put shrink rap around it so it didn't leak. I just started using it and hopefully it will work. I'm a very forgetful person so hopefully i remember to use it. I will def. update my review once i have my baby i'm only 11 weeks now. But the smell doesn't bother me at all. I WILL BUY FROM THIS SENDER AGAIN IF I NEED MORE:) THANK YOU!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Crochet",
      "helpful_votes": 0,
      "publication_date": 20130730
    },
    {
      "title": "Smells pleasant and absorbs quickly",
      "text": "Smells pleasant, absorbs quickly, seems natural, and kept me from stretch marks up until the end. I had a few at the last minute but my LO was 11 days late and turned out to be a big baby, so that might have had something to do with it. I believe this stuff helped my stretch marks from being worse. I also used it postpartum to help tighten everything back up again.",
      "rating": 4.0,
      "verified": true,
      "author": "ChapSticky",
      "helpful_votes": 2,
      "publication_date": 20140706
    },
    {
      "title": "Loved it then, love it now.",
      "text": "I first used this product in 1979 (baby#1), then again in 1982 (baby#2). Love it then, I found it again when a young girl in my office got preggos (for the first time) and was asking for advise on what to use. I found it online, and purchased some for her and me. I am now in my 50's and find it's a wonderful oldtimers' all over cream. So wonderful when you re-discover an old friend. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Syndi Hesch",
      "helpful_votes": 0,
      "publication_date": 20110214
    },
    {
      "title": "Great product!",
      "text": "Great product! My mom recommended I try it and although, I am not at the end of my pregnancy nor has my tummy gotten really big, I do see some results.",
      "rating": 5.0,
      "verified": true,
      "author": "Lexii",
      "helpful_votes": 0,
      "publication_date": 20151022
    },
    {
      "title": "No stretch marks! Love this stuff!",
      "text": "The only bad thing was the time it took to get to me. The product itself was wonderful. My mom used it when she was pregnant so she recommended it to me. Neither one of us have a single stretch mark! I also told my friend about it and she didn't get any as well. I started using this at about 6-8 weeks pregnant. Everyday at least twice or when my belly felt dry or itchy.",
      "rating": 4.0,
      "verified": true,
      "author": "Julie S.",
      "helpful_votes": 0,
      "publication_date": 20140703
    },
    {
      "title": "... at the moment but it is pink and smells great..",
      "text": "Iv only used the product for two days so im not sure of its full effects at the moment but it is pink and smells great....however....I was cheated out of an oz. I ordered a 4 oz jar and a lot of the product was already gone before I even used it. I will not buy from this vendor again.",
      "rating": 1.0,
      "verified": true,
      "author": "Marjorae Parker",
      "helpful_votes": 0,
      "publication_date": 20150216
    },
    {
      "title": "Must have when pregnant",
      "text": "I used this over 30 years ago, 3 children later, I have no stretch marks. My daughter is having her 2nd child so I've ordered it twice for her hoping for the same results. Love the stuff and smells good too! I can't find it anywhere except online but very reasonably priced.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140620
    },
    {
      "title": "... it was in the little blue box but a good portion of the product was all over the container ...",
      "text": "My review has nothing to do with the product but when I received my product it was in the little blue box but a good portion of the product was all over the container and the box - by the time you open the jar most of it had spilled all over -it's too expensive to lose that much",
      "rating": 3.0,
      "verified": true,
      "author": "Angela K HOlton",
      "helpful_votes": 0,
      "publication_date": 20150305
    },
    {
      "title": "Best stuff for preventing stretch marks during pregnancy!",
      "text": "This stuff is divine! The consistency is that of cold cream with a pleasant smell and it doesn't make your skin doesn't feel greasy or slimy. Cocoa butter drove me crazy bc it was so greasy so I was so happy to find this!",
      "rating": 5.0,
      "verified": true,
      "author": "LC",
      "helpful_votes": 0,
      "publication_date": 20141213
    },
    {
      "title": "Great moisturizer!",
      "text": "Useful product that keeps area moist but hasn't helped too much with stretch marks! I don't see the difference bet this product and a regular moisturizer.. Was worth a shot.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Eustache",
      "helpful_votes": 0,
      "publication_date": 20130104
    },
    {
      "title": "... this product twice a day and my skin feels fantastic. I am only three months pregnant now and ...",
      "text": "I use this product twice a day and my skin feels fantastic. I am only three months pregnant now and will use this the entire time. This was highly recommended by my doctor.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160508
    },
    {
      "title": "Five Stars",
      "text": "absolutely love it can't wait to order some more and made my skin very soft",
      "rating": 5.0,
      "verified": true,
      "author": "titianna bell",
      "helpful_votes": 0,
      "publication_date": 20150303
    },
    {
      "title": "Mother's Friend is an everyday essential during pregnancy. Both the bump and the breast.",
      "text": "My 80+ Grandmother suggested this. She had no stretch marks. I've used this during two pregnancies and my marks are very minimum. You must not scratch the skin-that's how I know when a stretch mark is coming in. Mother's Friend is an everyday essential during pregnancy. Both the bump and the breast.",
      "rating": 5.0,
      "verified": true,
      "author": "D'Aquarian Goddess",
      "helpful_votes": 3,
      "publication_date": 20151114
    },
    {
      "title": "Bad ingredient profile",
      "text": "I should have looked at the ingredient profile first, but was really bummed when this arrived and saw the artificial colors as an ingredient. Who needs color dye in a body cream!? Was looking forward to trying, but I'll stick to putting healthy, natural things on my skin, especially during pregnancy!",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole D.",
      "helpful_votes": 2,
      "publication_date": 20151228
    },
    {
      "title": "So far so good!",
      "text": "No stretch marks yet at 29 weeks. I weighed 115 at the beginning of my pregnancy and now weigh 140+. So far so good!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170501
    },
    {
      "title": "Mother's friend",
      "text": "I am so very thankful for a product such as this one. It has helped me a lot with my stretch marks and my beautiful skin is coming back. I hope that it is never discontinued.",
      "rating": 5.0,
      "verified": true,
      "author": "Lora M",
      "helpful_votes": 0,
      "publication_date": 20110203
    },
    {
      "title": "I highly recommend this product",
      "text": "I know you won't believe it, but I don't have a single stretch mark. I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 0,
      "publication_date": 20150314
    },
    {
      "title": "Mothers Friend works!",
      "text": "I have a family that is prone to stretchmarks. I was told by my boyfriends parents about this cream when were telling them I was pregnant. They said it works wonders. I went home and immediately ordered Mothers Friend. I was probably about 4-6weeks pregnant. I used it from week 8 religiously until the end of my pregnancy. My sisters and my mother insisted that it didn't matter what I do I was going to get stretch marks. My lil angel arrived and I have not one single solitary new stretchmark. This stuff works!",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Hart",
      "helpful_votes": 5,
      "publication_date": 20141029
    },
    {
      "title": "Itch relief",
      "text": "Definitely keeps me from itching but I am still getting stretch marks...",
      "rating": 4.0,
      "verified": true,
      "author": "Mashara",
      "helpful_votes": 0,
      "publication_date": 20160317
    },
    {
      "title": "Great Product-3rd Generation",
      "text": "I am a 3rd generation user of this product. When my grandmother recommended it to me, I thought there was no way it would still be in production. To my surprise it is and I am an advocate! Love the feel and smell of the lotion. I realize stretch marks are hereditary but I'm keeping my fingers crossed that it works as well as it has been. LOVE IT! I'll recommend it to my daughter some day too.",
      "rating": 5.0,
      "verified": true,
      "author": "Alley",
      "helpful_votes": 0,
      "publication_date": 20110825
    },
    {
      "title": "It's so so",
      "text": "I have been using this product for 3 months now and I really can't tell if its working or not. I don't like the smell but it is soothing to the skin.",
      "rating": 4.0,
      "verified": true,
      "author": "Dorian Nevilles",
      "helpful_votes": 0,
      "publication_date": 20130425
    },
    {
      "title": "Glad there is you",
      "text": "I used it 27 years ago and now my daughter is. Could not find it in stores. Glad there is you. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "I'm very satisfied with this product",
      "text": "I'm very satisfied with this product.. The texture, even after applying the cream, is soft of the skin. It doesn't have a off odor to it, I actually like the smell of it!",
      "rating": 5.0,
      "verified": true,
      "author": "Dakota Nielsen",
      "helpful_votes": 0,
      "publication_date": 20141021
    },
    {
      "title": "Three Stars",
      "text": "Liked it but not sure if it helped with stretch marks.",
      "rating": 3.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20150827
    },
    {
      "title": "38 weeks and nary a stretch marks to be seen ...",
      "text": "38 weeks and nary a stretch marks to be seen! My mom used this too 35 years ago, also no stretch marks. Some of that might be genetics, but I wasn't taking any chances.",
      "rating": 5.0,
      "verified": true,
      "author": "Corrin McBride",
      "helpful_votes": 0,
      "publication_date": 20150415
    },
    {
      "title": "A friend recommended this and said she didn't get any stretch marks ...",
      "text": "A friend recommended this and said she didn't get any stretch marks at all during both of her pregnancy. Loving the cream so far. It's not too greasy and the smell isn't bad at all. I hate that I didn't find about this until a couple weeks ago and I'm due to pop any day now. I already had light stretch marks that didn't appear until a couple weeks ago so I'm hoping they won't stick around.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Elliott",
      "helpful_votes": 0,
      "publication_date": 20161026
    },
    {
      "title": "it works,and leaves your skin so soft",
      "text": "Im giving 4stars only because i finish it in just 5 days but i love it my skin feels so moisturize and my strechmarks started to fade,definitely going to buy more",
      "rating": 4.0,
      "verified": true,
      "author": "ale",
      "helpful_votes": 0,
      "publication_date": 20140526
    },
    {
      "title": "Four Stars",
      "text": "I really like the way my skin feels after using this lotion. I wish they sold larger tubs.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160317
    },
    {
      "title": "Five Stars",
      "text": "My wife buys this religiously due to the way it makes her skin feel.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Chaidez",
      "helpful_votes": 0,
      "publication_date": 20151010
    }
  ],
  "product_meta": {
    "title": "Mothers friend body skin cream - 4 oz",
    "description": "INDICATIONS: Mothers Friend Body Skin Cream helps soothe and condition stretched, dry skin during pregnancy.",
    "rating": 4.5,
    "feature_bullets": [
      "Mothers friend helps to keep skin beautifully soft and supple."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "6 x 4 x 4 inches; 5.61 Ounces",
      "Item model number": "S.S.S.CO093963",
      "UPC": "885149815575 885847029977 012258114040 883938153280 796433705321",
      "Manufacturer": "Mother's Friend",
      "ASIN": "B0012BQFMI",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Creams",
      "Moisturizers",
      "Skin Care",
      "Body",
      "Beauty & Personal Care"
    ],
    "price": 9.16
  }
}