{
  "website_summaries": [
    {
      "verdict": "Check with your veterinarian first, then choose this supplement if you and vet agree on a drug-free option to ease your dog's skin and coat problems. It's a plus that most dogs love the flavor.",
      "pros": [
        "A supplement that is effective at calming itchy skin for most canines",
        "Makes fur soft and shiny",
        "Made with fish oil that's packed with omega-3 fatty acids that are beneficial to the skin",
        "Liquid form is easy to give with food",
        "No prescription required"
      ],
      "cons": [
        "Not ideal for serious skin problems, and won't treat infections",
        "Some reports of leaky bottles"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Fishy Breath, but Good for My Dog!",
      "text": "I purchased Welactin Omega-3 for my 6 year old Soft-Coated Wheaten Terrier following my Vets recommendation. Our dog had been experiencing skin allergies as is common with many breeds of dogs. After only using for a short time, I'm already noticing a difference! This is a quality product, and purchasing from Amazon was half the price of purchasing through the Vet. My dog requires 1.5 scoops which is approx 3/4 tbsp. This large bottle will last for quite some time. The only negative so far is his fishy smelling breath! Thank you for reading and rating my review.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon SteveTop Contributor: Golf",
      "helpful_votes": 67,
      "publication_date": 20170408
    },
    {
      "title": "Purchased twice, this time doesn't say Salmon OIL?",
      "text": "We reordered this, noticed right away This product no longer says SALMON OIL now just says \"FISH OIL\" on bottle???? Our English Mastiff had Emergency surgery for bladder stones. Cornell University found the worst type hereditary bladder stones. He would die without being put on a No Pureen diet. We paid Cornell University Veterinary nutrition department to make him a computerized diet. This product has to be added to keep him safe it has to be SALMON OIL. Called Cornell they said stop our subscription. They now have to call all their patients as unidentified \"FISH oil\" could startbladder stones to form. They have to research to find us a all salmon oil product.",
      "rating": 1.0,
      "verified": true,
      "author": "SweetNY",
      "helpful_votes": 66,
      "publication_date": 20171203
    },
    {
      "title": "Is this the same formula or imitation? Bc its not working the same.",
      "text": "I’ve notice this product it’s a lot thinner then the one I got from the Vet, it seems more watery and the one from the doctor was thicker oil and worked better on my dog. We started this nutramax because one of my dog has super dry skin that flakes everywhere, it worked well with the first bottle we got from our veterinarian. But we finished that one and purchased this one here at Amazon.. after several weeks we of use, we notice the flakes of the skin started to come back and made me wonder if this is the same thing at all.",
      "rating": 2.0,
      "verified": true,
      "author": "GoldieElle",
      "helpful_votes": 3,
      "publication_date": 20191114
    },
    {
      "title": "Messy and smelly",
      "text": "We gave this to our dog on the recommendation of our vet. Our dog has a neck issue, and we hoped to prevent pain with this product. We have not noticed pain - no way to know if the supplement helps because she was not it pain before, but the poor bottle design results in drips and squirts and this stuff reeks. It literally turns my stomach. We went to capsules because this product is messy and smelly. The manufacturer could probably fix it by switching from a squirt bottle to a dropper, but until then, ONE STAR!",
      "rating": 1.0,
      "verified": true,
      "author": "Coffee addict",
      "helpful_votes": 2,
      "publication_date": 20200822
    },
    {
      "title": "Using for help with my frenchies luxating patellas",
      "text": "At the recommendation of my veterinarian, I started using this along with Cosequin for one of my two frenchies who has luxacting patellas....But I put the oil on about a 1/2cup dry food for breakfast in the mornings for each of them. They seem to enjoy it, I have noticed a difference in their coats, and assume its also helping with inflammation in her knees. I will continue to use this as it will only help as she gets older. The cap on the bottle I received was cracked, thankfully I can just switch the cap from an old bottle.",
      "rating": 4.0,
      "verified": true,
      "author": "Jamedeiros",
      "helpful_votes": 4,
      "publication_date": 20171209
    },
    {
      "title": "Recommended by vet for AmStaff",
      "text": "My dog's vet recommended this to keep her healthy as she has numerous allergies and a restricted diet. I agree with everyone else that the cap causes drippage all down the bottle, but I remembered this plug and syringe I used on my kids' medicines and it's made things much easier. Just replace the cap with the plug and leave it in. Exact dosage measured in the syringe and easy dispensing onto the kibble. My 65 pound dog takes 9 ml (1.5 of the provided scoop).",
      "rating": 4.0,
      "verified": true,
      "author": "SCB",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "works for my dogs joint/muscle injury",
      "text": "Buy this to put over my small dog's food once per day (as vet orders) since he has a hurt muscle/joint. when he doesn't get this after 3 days, he limps and can't walk up the stairs. good price and lasts about 2 months for my small dog, and I give him the serving spoon size that is included. He is only 5 years old, a Lhasa Apso, but plays with his brother and injured his his a few years back. this is the way it is managed for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Amelia417",
      "helpful_votes": 9,
      "publication_date": 20160722
    },
    {
      "title": "I loved that my older dog liked it and it seemed ...",
      "text": "Mixed emotions here. I loved that my older dog liked it and it seemed to give him a bit of a boost in energy. The reason I am giving it 2 stars is that for some odd reason it caused my male dog to \"leak\" pee rather profusely, which he'd never done before and hasn't done since I took him off of it. I found about about the cause & affect, because I had recommended it to a friend and their male dog started \"leaking\" first. They traced it back to Welactin and they also saw the problem resolved when they took their dog off of Welactin. So not sure why - but its a problem.",
      "rating": 2.0,
      "verified": true,
      "author": "RZn30",
      "helpful_votes": 4,
      "publication_date": 20170901
    },
    {
      "title": "Great product!",
      "text": "This product is one that is so close to my heart! Works very well for heart health, skin, joints and everything else for the pups. My doggo had a grade 1 heart murmur post op and I immediately put her on this product - 3 months later the murmur was gone. 1.5 years later had another dental and alas the murmur came back - went straight for the welactin and I’m pretty sure her heart is sounding good! (I’m a vet tech. Please keep in mind this is not a cure all product for murmurs but happened to help my pup’s murmur TWICE!) Also, my most good picky pup will still eat her food with this on it too!",
      "rating": 5.0,
      "verified": true,
      "author": "arizonian",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Quality product!",
      "text": "Recommended by our vet to help combat our dog's dry/allergy skin and loss of hair. With the first bottle, we began to see slight changes in her skin condition. Have recently started on 2nd order of Welactin Nutritional Supplement and I notice a more marked improvement in her skin plus reduced itching. Plan to continue with this supplement for the continued health of our fur baby. As other reviews have noted the bottle drips regardless of how carefully you pour into the measuring cup. Company should really work on a better design.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20180309
    },
    {
      "title": "My dog loves this stuff, itching less",
      "text": "I bought this since my dog is shedding a lot and was licking his paws from dryness. While I haven't noticed a big difference in his shedding, he is definitely licking his paws less so hopefully its working to make his skin less dry. If you are wondering if your dog will eat his food with this oil on it, trust me - he will. My german shepard is VERY picky about eating but when I put this stuff on, he eats his food immediately instead of waiting until later. I've never in his 8 years seen him eat his food so consistently. Will def be buying this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Warner",
      "helpful_votes": 2,
      "publication_date": 20180927
    },
    {
      "title": "This helped my dog",
      "text": "My 14 1⁄2 year old sheltie was really slowing down and had a very hard time getting up and going up stairs. My vet recommended fish oil and it has made a significant difference. He also has been taking glucosamine supplements for his arthritis for a couple of years. That helped over the last few years, but this product has given him some relief in addition as his difficulties progress. I recommend it, but be careful that you give only half the recommended dose for the first week, or otherwise build up to the full dose over some time to prevent loose stools.",
      "rating": 5.0,
      "verified": true,
      "author": "ellen",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Healthy Dog, Happy Human",
      "text": "First impression: great price for the size of bottle! And half a scoop a day for my chihuahuas will go a long way! There was no problem getting them to lick it right from the scoop! They love the taste, and I love the benefits they'll reap from this supplement! Update (Feb 20 2019): I purchased this along with the Dasuquin vitamins for my chihuahuas after a recommendation from the vet. One of my dogs had a “wiggly patella” that caused an alarming and consistent skip/limp. Since My first purchase of these in November, the skip/limp has not made a reappearance! Yay!! Very satisfied with this brand and this product! I’ll continue to buy these for my dogs!",
      "rating": 5.0,
      "verified": true,
      "author": "Eunice",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "packaging could be better",
      "text": "This is only my second bottle and this time it didn't arrive in a cardboard box but in one of those flimsy thin padded envelopes. Needless to say the cap was broken off and in pieces. This is an oily product, awkward to squirt into the little scoop, and not good without a cap. I will have to decant it into another bottle if I don't send it back. I don't know if it's helping my 5 year old GS dog or not (post-knee surgery a year ago), but I faithfully give her 2 scoops a day! It definitely smells fishy and she likes it.",
      "rating": 5.0,
      "verified": true,
      "author": "RB",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "SOFT coat and much less dander!",
      "text": "I tried several other fish oils, including ones I bought at Costco for people. They didn't really make a difference, so I thought that since I love Cosequin that I would buy from Nutramax. My one sensitive Doberman with horrible dandruff and rough hair now has a beautiful coat. It is very soft, and her dandruff has decreased dramatically. I tried it on my springer, but he felt so good he was being a little aggressive (not the meds fault, been a problem his entire life and worse the better he feels). I now buy this from Amazon on occasion and have it on my monthly Chewy autoship. GREAT PRODUCT!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "180 change in my dogs dry ski!",
      "text": "Dude .... dude. This changes my dog and mys life. Now, I’m sure this is true of any quality fish oil but this is the only one I’ve used. My dog had verrrry dry skin. It was caused hives on my arm every time I touched him, he was constantly scratching. After about 5 weeks on this once in the am on his food - seriously a complete 180. His fur is soft, he doesn’t constantly scratch, and bonus - he sheds WAY less. Double bonus, fish oil is good for the heart - human and dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "Leela Howland",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Why does the price keep going up?",
      "text": "My vet recommended me this product for my dog with a leg injury, I give it to my other dog to help prevent hip dyspepsia also. Its been great and the dogs love it, I just mix it into their food in the AM. My 4 star is because the price has gone up $8 since purchasing just a few months ago. What gives? Looking for a new product that isn't price gorging during this sensitive time",
      "rating": 3.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Amazing!!",
      "text": "I have been giving this product to my lab/sharpei dog for about 3 months now. My veterinarian recommended it to help with his itchy dry skin. Let me tell you it has made a world of difference. I wish I would have taken before and after pictures to show what a difference this has made in his skin and coat condition. He used to have thin hair & dry flaky skin on his back close to his tail and be very itchy. Now after using this for a few months his coat is thicker, softer, and shiny plus no itchy skin. 10/10 highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Strange",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Our dogs love it!",
      "text": "We bought this to help our new rescue's itchy skin and decided to use it with all our dogs. The dogs love this stuff!! We were especially thankful to discover that our 16-yo Poodle loves it. She's losing her appetite, primarily because she doesn't smell well any more (at least that's my theory, because when I heat up her food to make it really stinky, she eats). I cut up her food into really small pieces (not many teeth left) and then roll them in the oil. She eats her oil-covered food with relish. So, we have double benefits. Leroy's itching is reducing and Daisy eats her food with relish.",
      "rating": 5.0,
      "verified": true,
      "author": "SAinVATop Contributor: Pets",
      "helpful_votes": 4,
      "publication_date": 20160406
    },
    {
      "title": "Our pups love it",
      "text": "Our two 50 and 55 lbs dogs love this. We got it to help with their joints and skin. Since staring I’ve noticed a difference in their dry skin and color on their noses. However, my parents poodle lab mix who’s stomach isn’t always the best when it comes to anything new did not take well to this at all. So if your dog has stomach issues and needs special foods ask your vet if this would be a good idea before trying",
      "rating": 5.0,
      "verified": true,
      "author": "lauren kane",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "My dog hates it",
      "text": "My little dog won’t touch her food with this in it. So I have to give it to her orally with her trying to spit it out all the while. There has to be a better way to give this supplement to your dog. Her breath smells like a fish market, no surprise but not pleasant but not important just be prepared. Despite the smell, the supplement is a trusted one and nutramax was highly recommended. Don’t be surprised if your dog hates it, if he or she likes it you are lucky.",
      "rating": 3.0,
      "verified": true,
      "author": "SFmaria2",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Improvement Noted Quickly",
      "text": "After just ten days, I have noted improvement in my pet's agility. He has a very bad knee and this medication appears to be helping his ability to walk on that leg. Both my dogs like the taste/smell and have no objection to eating it dribbled over their wet and/or dry food. I have already re-ordered my initial supply. I am that convinced that as my dogs age, this supplement will help them in lots of ways. I'm sold on it.",
      "rating": 5.0,
      "verified": true,
      "author": "MontanaPat",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "This oil works for my dogs!",
      "text": "My three dogs coats are shiny and supple after using this product. I just squirt a little on their food once a day and within a week I could tell a difference. My dogs are young so I am glad I have started them on this product to help with health and well being for the years ahead. They love the taste. It is a little fishy but not bad and their breath does not smell.",
      "rating": 5.0,
      "verified": true,
      "author": "DF",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "4 stars",
      "text": "My dog has kidney disease and along with the homemade food diet we have her on, we also give her this and a multivitamin. I can't say I noticed a huge difference in her health solely because of this product, but her kidney levels haven't increased. My only complaint on this product is the packaging. There needs to be a pump or something. The oil gets all over the place when you try putting it in her food.",
      "rating": 4.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Messy. Use A Different Brand",
      "text": "Was recommended by a vet years ago. I try to use a different brand when available though. I don’t support NutraMax. My dogs don’t seem to mind it on their food although it smells fishy as it is fish. Maybe they like it. It lasts a long time. I absolutely hate that it doesn’t come with a pump since it’s extremely messy to pour into that little cup it comes with. The other brand I normally use comes with a pump and has no mess. Wish that one had been available.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara A. Turner",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Not my dogs favorite",
      "text": "My dogs font life the flavor or scent and are reluctant to eat their food with this on it. I have to disguise it with some kind of gravy. And even then my dogs don't always eat their food",
      "rating": 4.0,
      "verified": true,
      "author": "jb",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "It is a great product",
      "text": "I don't know about flavor, it is supposed to be flavorless, i don't know about scent but it is supposed to be odorless, i cannot judge the price because i just do not know enough about its cost but my 15 months old girl Queenie has had it with her breakfast since she was three months old and her coat is as luscious like mink!",
      "rating": 5.0,
      "verified": true,
      "author": "Mauro Chiappe",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "My dogs think it’s a real treat",
      "text": "We’ve only been using it 4 days. The vet suggested this for our puppy’s flakey skin. We just pour it on top of our dogs food bowl at dinner. The dogs seriously think they’re getting some kind of treat when I put it on there so it either tastes good to them or doesn’t affect the flavor of their food. It doesn’t seem to have any weird smells and I haven’t noticed any stomach upset or gas. It’s too early to tell if it has helped with the skin issue but I will update when I have a better idea. I would recommend and plan on buying it again.",
      "rating": 4.0,
      "verified": true,
      "author": "Alyssa",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Order it one bottle at a time!",
      "text": "This was recommended by our veterinarian along with a few other Nutramax products. Seems to be working well but at only two weeks, I'm hoping for the optimal effects at 8+ weeks like it says on the label, One curious thing tho - they advertise 3 bottles for the economy price of 60-ish dollars. I ordered 3 separate bottle for $14 each for a total cost of $44. What's up with that??",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Donahue",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Buying this product in the larger size is a rip off!!",
      "text": "I have been using this product and my dogs seems to be a lot better with their allergies and joint pain..... one thing I feel stupid about though, 16oz is $ 22.60 and I thought I'd be thrifty and order the larger size.... it was 78.00... it comes in 3- 16oz bottles.... which I can get individually for less then $68.00....kind of a rip off!",
      "rating": 4.0,
      "verified": true,
      "author": "Patrick Foy",
      "helpful_votes": 6,
      "publication_date": 20160124
    },
    {
      "title": "Helps with my dogs skin issues",
      "text": "I have a puggle and he has skin and food allergies. His stomach always gets so bad from him licking that he has to be put on steroids and antibiotics. This helps him with symptoms so much! It also helps to prevent issues in the first place. It was recommended by our vet, but it's a lot less expensive to buy online. He likes the taste of it, I have trouble getting him to swallow pills, so I was happy this comes in a liquid. Very happy with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Cassie",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Good product, so-so value",
      "text": "Recommended by my vet at about 2x the printed dose for her weight. Nice product with tangible, observable benefits for my GSD showing very early signs of elbow arthritis. The oil is messy and the bottle would benefit from having a pump like competing products (Grizzly's, Bonnie and Clyed's, Icelandic Pure, etc...). Also, at ~$23 for 16oz, it doesn't provide quite the value the others do at 32oz for close to the same price and concentration. This next go around I'm trying out the Icelandic Pure Sardine and Anchovy blend for the value per ounce, pump, as well as feeder fish blend vs Salmon. Still, this is a good and effective product.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex K.",
      "helpful_votes": 0,
      "publication_date": 20160626
    },
    {
      "title": "My dog loves this stuff!!",
      "text": "My Boston/Pug is a very picky eater. Some days he just sniffs his food and walks away. But, we started using this and he cleans his bowl and actually is looking for more. It totally has encouraged him to eat normal. Have not noticed anything yet as far as his coat which is initially why I purchased this product. Vet recommended for his dry skin. He still has it not sure how long it will take before I notice anything.",
      "rating": 5.0,
      "verified": true,
      "author": "karenrn94",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Blessing to my senior chihuahua baby",
      "text": "Bought this for my 8 year old chihuahua that was just diagnosed with IVDD. We began supplementing his food with dosing instructions from our vet and we have seen great improvement in his ability to get up without pain in the morning and now he is able to go on longer walks before tiring. The main thing is consistency! The flavor must be great because he is so excited to eat once he knows it has been put on the food!",
      "rating": 5.0,
      "verified": true,
      "author": "nicole nicolitz",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Poor shipping packaging",
      "text": "This arrived in a lightly padded envelope and the manufacturer's box was smashed up. Since the plastic bottle in the box looked OK, I tried it anyway. But the flip cap immediately broke off. And after pouring the liquid a coupe of times, the fixed part of the cap leaked on the side. I ended up returning this bottle and getting another (better quality) brand from a local pet store that focuses on pet nutrition. My new bottle says refrigerate after opening. Do no recall this instruction on the large Nutramax bottle and wonder if it would have gone rancid after not too long. I recommend purchasing fish oil at a local store if you can swing it.",
      "rating": 3.0,
      "verified": true,
      "author": "Elizabeth S.",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Tastes Great, Less Filling",
      "text": "This came as a vet recommendation because it seems like some sort of cure-all. It will help with is joints and skin and your dog will do better on the SATs! It was especially salient because my buddy is getting older and has some skin issues. I can't say for sure if it helped. What I do know is that it makes him more likely to eat his food when we put it down, so I'll chalk that up as a win.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Edgar Mihelic, MA, MBA",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "This has really helped out dog",
      "text": "Our dog has problems with her left back leg, getting older now. She absolutely loves this stuff and we have noticed an improvement in her ability to walk and climb stairs. She's been on it for years and we will keep using it. We give her her dose with her evening meal, and give her some other supplements with her morning meal.",
      "rating": 5.0,
      "verified": true,
      "author": "NYer",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Great stuff.  Helps my senior dog with hip pain.",
      "text": "I noticed that my senior dog's tail was down most of the time and the vet recommended trying this before we start her on medications. I cannot believe how well it works. Her tail is up all the time and she doesn't appear to be in pain at all. I highly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "dogmom",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "My dog's fur is softer and has grown back!",
      "text": "My 8 year old chihuahua was losing his hair on his ears, legs and tail and had brittle fur from extremely dry skin. The vet recommended this product. I did buy the first bottle of this from the vet's office. It worked after a couple of months. His tail no longer looks like a rat's tail! He has fur again! His fur is softer and has mostly returned. I was happy to see that this was available through Amazon at half the price my vet charged!",
      "rating": 5.0,
      "verified": true,
      "author": "Fbierly",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Best product for canine joint care",
      "text": "This is a great product to pour over dog food for care of arthritis in dogs. The newest studies are showing that this is much more effective than glucosamine/chondroitin to help stave off joint inflammation and arthritis. My dogs inhale their food with this on it. The only downside is the strong fishy smell the owner has to endure, haha.",
      "rating": 5.0,
      "verified": true,
      "author": "HJ",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Age defying magic juice",
      "text": "Everything you've read is true. This stuff is the fountain of youth. In our case, it's the fountain of middle age v My senior dog - 13-15yo - has never looked so good. His coat is shiny. His eyes are brighter. He moves without audible pain. My wife and I joke that it works too well. Also, fish oil isn't doing his already awful breath any favors.",
      "rating": 5.0,
      "verified": true,
      "author": "Arash Arabasadi",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Seems to work for my dog",
      "text": "After my young dog dislocated a shoulder while chasing a ball (of all things), the vet’s physical therapist recommended this as a supplement. All I know is that it’s been months since he started Welactin. He’s back to running and playing with no problems. I don’t know if it’s this supplement or just him maturing physically, but I’m not taking any chances! I’ll be buying it again.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Watman",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Easy to use, helps with joint issues for dogs",
      "text": "One of my dogs has a lot of joint issues and I use this at night when feeding and in the morning and mix it in her food. It seems like she can't even tell how it tastes. She always eats her food and we have been giving it to her for about 2 years now. My Vet told me to use this for my dogs joint issues since she's getting much older. After the last 2 years I can definitely see a difference in her mobility to get up and down more from the stairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristie ",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Recommend it for dogs",
      "text": "The relief is the reduction of dander and no more dog hair loss! Been through a lot with my baby, this addition to his “Balance It plus” supplement that we add to his meat and potatoes, he is coming through this terrible time and doing so much better! Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindi",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "works great",
      "text": "I have been using this for 3 years and it made a definite difference in my dogs . M y yorkie has kidney issues and after taking this her kidney function has improved . M y dobie had skin and coat issues and it has improved her problems .I swear by it !!!",
      "rating": 5.0,
      "verified": true,
      "author": "lucky lady",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "So Far, So Good",
      "text": "My vet recommended this supplement, particularly for one of my dogs who recently had surgery to repair a torn ligament (equivalent to ACL surgery in humans). I say \"so far, so good\" because the dogs love it; it's easy to add to their dinners; but I won't really know how good it is until I see how the dogs' joints do over the long term.",
      "rating": 5.0,
      "verified": true,
      "author": "RaceFan",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "No Fishy Smell",
      "text": "I use this oil on both pets--my 16 year old Staf Terrior and my 5 1/2 year old Rottweiler. They both like the flavor and I like that there is NO fishy smell. I think the pain relief is helping with my older dog. I will keep using and recommend this product for your vet. Also my vet recommended this.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeri",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Excellent oil. My sheltie had some skin problems and ...",
      "text": "Excellent oil. My sheltie had some skin problems and nothing was working. so my vet suggested this and I bought it from vet at a much higher price, until I found it on Amazon. This is my 2nd bottle and I will order it again, My sheltie skin has almost completely cleared up. I give her 1 little capful a day mixed with sme dry kibble and she locks it all gone. She is also having medicated baths every 2 weeks.",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine Schecter",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "Great product but MESSY",
      "text": "I have bought a couple bottles of these so far, and I love it! The only problem is that it is VERY messy.... the oil gets all over the place and has stained my pantry wall and the top of my dog's food container. I don't even know how this stuff gets EVERYWHERE! I endure the mess because this is a great product but MAN can they please fix the packaging?!",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica Klemmer",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Great product!",
      "text": "Welactin was highly recommended by out Vet for our 12 yr old dog who suffers from arthritis. This product has helped a lot, not only is she moving around a bit more, we have heard less \"clicking/popping\" noises coming from her joints. Highly recommend using Welactin and Cosequin together!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Easy to add to food and my dog likes it.",
      "text": "My vet recommended fish oil for my dogs joints and as he is almost ten years old. It will take some time to see if it makes a difference. My vet likes this brand. I will try to update later on after he has taken it a while.",
      "rating": 5.0,
      "verified": true,
      "author": "carolinagirl",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Great stuff",
      "text": "My vet recommended this brand for the quality. My dog has many allergies and his skin was starting to have black pigmentation due to constant flare ups. I added this to his food daily and his skin pigmentation has returned to normal. He is on a fish only diet so I am used to the fishy smell. His coat looks great and he's happy to eat it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sonja",
      "helpful_votes": 2,
      "publication_date": 20170307
    },
    {
      "title": "great stuff!",
      "text": "My Black Lab is 11 years old and I've been giving him a tablespoon of the Nutramax Welactin on his dinner since he was about 2 years old. His coat is still thick and shiny and his joints are in good shape, I think that the Welactin has helped. He also likes the taste, he thinks it's gravy.",
      "rating": 5.0,
      "verified": true,
      "author": "beezer",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Great for pup's dry skin & coat",
      "text": "This was recommended by my vet when my Lhasa Apso mix had dry, flaky skin and a dull coat. It has helped tremendously with his skin and coat. He also has a slight heart murmur so this product is a plus in keeping him over all healthy. He's 12 years old and still doing well.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 2,
      "publication_date": 20171230
    },
    {
      "title": "Miracle worker!!!",
      "text": "This is GREAT! My husband’s co-worked recommended this to us after her dog’s shedding improved dramatically. We used to literally wash and replace our sheets daily because our pup sheds a puppy and a half lol. It’s been about 2 months since we started feeding him this and his hair is so soft and he barely sheds now. AWESOME!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna SG",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Why I give my dog Welactin Omega 3",
      "text": "I have an 11 yr. old German Shepherd that has some problems with arthritis. Besides giving her medication for her hip and joints, I also give her Omega 3 which my vet suggested to do. I think this helps her to be able to remain mobile and still get around. She weighs about 78 lbs so I give her two caps of the liquid Omega 3 mixed in with her feeding. I buy it through Amazon because it's more affordable than buying from the vets office..",
      "rating": 4.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Great Product and value",
      "text": "I've been giving this to my 3 year old lab for about a year. I just pour it over his food, and he loves the tasted. Unlike other reviews posted, I have no problem with the pouring and the bottle stays dry and clean. I can't prove this has helped, but over the year I have been giving it to my dog, his coat has looked great with no problems with his coat or skin. Also, he's remained very active. Great product and great price via Amazon. Even better if you're a Prime customer and get free shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "RJ Vacc",
      "helpful_votes": 3,
      "publication_date": 20150407
    },
    {
      "title": "Supreme cost supplement",
      "text": "I originally purchased this product from my vet's office after he recommended it to remedy my mini schnauzer's dry skin and dull coat. He gives this oil to all of his dogs. Within one month of daily usage, my dog's skin and cost were transformed from bland to glowing! I'm not exaggerating. The only downside is the fishy odor. To compensate for that smell, I put dried parsley in the meal with the product to keep the fish scent off her breath. This oil has thickened her coat, softened her skin, and made her coat shine. I cannot extol it highly enough.",
      "rating": 5.0,
      "verified": true,
      "author": "C K L",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Bentley on Walk at Lake Harbor Park",
      "text": "Bentley gets Welactin on his food every morning and loves it. He is healthy and happy and will continue to give it to him. He is 8 years old and a very active dog who loves to play stick and retrieve tennis balls.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret L. Chester",
      "helpful_votes": 2,
      "publication_date": 20190105
    },
    {
      "title": "Poor taste /smell....apparently",
      "text": "Our puppy recently had orthopedic surgery. We were looking forward to adding this to her diet for joint health and healing. Unfortunately, she will not eat it. We tried twice and she will not eat. She is one that eats a full bowl of food in less than 5 minutes. With this added she just walks away. We have NEVER seen her turn down food. So I suppose this works great if your fur baby eats it. Back to the drawing board.",
      "rating": 3.0,
      "verified": true,
      "author": "SHANNON YORKMAN ",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "I really was hopeful but",
      "text": "it does not work. I even lowered the dosage to 1/4 of the recommended amount and 5 days between but my fur babies still had diarrhea. Have not received for a week no diarrhea. Very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "JENNIFER T.",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "NO SEAL!",
      "text": "I use this product, it's a good product, and my dog's orthopedic surgeon recommended it to me. HOWEVER, the last one I received had NO PROTECTIVE SEAL. Returned for a refund. Please note that the product should have a protective seal",
      "rating": 1.0,
      "verified": true,
      "author": "kerryj",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Vet Recommended",
      "text": "My vet recommended this specific brand and wow can you tell the difference! My dogs coat is much shinier than when using other brands. My dog itches much less. There is no smell and he doesn’t mind it in his food. Also the price is reasonable.",
      "rating": 5.0,
      "verified": true,
      "author": "Van",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Highly recommended by my vet",
      "text": "The best fit my rescue pup of 4 years. She has knee issues; highly recommended by my vet and have been using for past 2 years. Vet said keep it up. She did Not need surgery.",
      "rating": 5.0,
      "verified": true,
      "author": "Dolo Rose",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Purchased this for my basset hound who had tons of ...",
      "text": "Purchased this for my basset hound who had tons of allergies and skin issues. He was a little unsure about it when I put it in his food at first, but now he gobbles up his entire dish!! I have been using it about a month and I have seen some improvement in the quality of his coat and his skin. It DOESN'T CURE his issues, but even the vet noticed his coat is a lot healthier now. Well worth the money for this purchase!!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Spivak",
      "helpful_votes": 0,
      "publication_date": 20171221
    },
    {
      "title": "Really works!",
      "text": "This was recommended by my vet for my black lab who suffered with very dry skin & itching. I double-dosed him the first 5 days, then went to the regular dosage going forward. Within 3 weeks, his flakey skin was gone! Now everywhere we go (he's my service dog), people comment how beautiful he is. His coat is shiny & the fur even feels better to the touch - soft. The results were so remarkable I ordered the feline formula for my cats. They love it & their coats are starting to look better, too. I HIGHLY recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Carter",
      "helpful_votes": 0,
      "publication_date": 20150418
    },
    {
      "title": "OUR DOG'S COAT LOOKS GREAT!",
      "text": "I have mixed feelings about this product...I was told by our vet to use this to help strengthen our dogs \"soft\" feet. Her coat looks beautiful, and she seems exceptionally healthy, but her feet are still too soft for her border collie activities! I have no idea if it actually helps this problem or not, but she looks so good I am going to keep her on it! She has been taking this product since she was about six months old, and she is now just over two years old. She likes the taste and we have never noticed any strong smell. Hope this helps.",
      "rating": 3.0,
      "verified": true,
      "author": "Tigger",
      "helpful_votes": 0,
      "publication_date": 20150524
    },
    {
      "title": "She has been seen running around outside like a puppy at times",
      "text": "Since starting my aging dog on Welactin and a prescription anti-inflammatory, I have seen a remarkable improvement in her mobility. She was having difficulty getting up the two steps on our porch but now sometimes she jumps up them! She has been seen running around outside like a puppy at times, even though before taking Welactin and the other medicine, she would walk around in obvious pain. This product is quite expensive at the veterinarian's office, but Amazon has a way better price. I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "johack",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "Good Product, Dog Likes it",
      "text": "I like that the odor is not offending. The dog took to it within about 2 days. I've used it for about 1 year, and after about 6 weeks I noticed my Great Dane was improving in his getting around. Previously he had been slow to get up and down, but this product seems to have improved his joint function.",
      "rating": 5.0,
      "verified": true,
      "author": "Rock Doc",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "My dog loves it",
      "text": "It is a great supplement. Being in liquid form it is easy to administer. I just pour a scoop and a half over her morning meal.",
      "rating": 5.0,
      "verified": true,
      "author": "Beverly B",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "No smell!",
      "text": "The bottle itself is a little messy, the shelf it sits on in my fridge does have some residue from it. But the product itself is fantastic! I have definitely noticed an improvement in shine on my dogs, and I love that there is no gross smell. This is definitely a product I will continue to use for my dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "C Janssen",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Great!!!",
      "text": "My dogs vet recommended this. It also evidently has a good taste because Lady eats her food up. Its very good for her coat too.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra B Searls",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Great stuff for skin, coat, and overall wellness",
      "text": "Does wonders for my dogs skin and coat and I love having it to help aid in lubricating his developing joints since he's a giant breed. As a vet nurse everywhere I've worked recommends welactin for our patients for most life stages!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Great for skin and joint support (poor shipping handling)",
      "text": "This is an amazing product and I'm a faithful user on several dogs. Does wonders for skin, coat, and overall wellness. Unfortunately Amazon chooses to ship it in a packing envelope vs. a box that protects it from being crushed during handling.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin J Lester",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Will pay much more at an animal hospital!",
      "text": "Recommended by my vet for my older giant Shiloh Shepherds. Their stiffness has been relieved so I assume it helps. Slight fishy odor but that seems to be attractive to them.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Quality product",
      "text": "Easy to dispense. I haven't tasted! Smells like fish oil. This was recommended by our pet nutritionist.",
      "rating": 5.0,
      "verified": true,
      "author": "fred12065",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Not sure if they are effective. How can you tell...really? My dog absolutely loves getting these.",
      "text": "My dog loves these. Made in USA else I would not give them to him. Not all the way sure if they are effective. How can you tell...really? My dog absolutely loves getting these after his breakfast.",
      "rating": 5.0,
      "verified": true,
      "author": "BrK",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Great for Skin, Coat of Dog.",
      "text": "I was advised to use this when I had a long-haired rescue dog who had little white flakes in his fur from time to time; it seemed to help. This first dog having gone on over \"rainbow bridge,\" the rescued dog I have now arrived with patches of missing hair on his body. I decided to try continuing use of this product. The bold patches are filling in quite slowly. But he is very often complimented on the softness and shine of his fur. I think this is a great product for skin and fur ... and probably also for the overall health of a dog (as advertised on the box).",
      "rating": 5.0,
      "verified": true,
      "author": "E E George",
      "helpful_votes": 0,
      "publication_date": 20140512
    },
    {
      "title": "Big bottle",
      "text": "We used this for a dog suffering from cancer and losing weight during chemo. The dogs coat did improve, but is hard to judge since he was so ill, but the price on Amazon was better than the vets and the bottle was twice as big. I think it's a good supplement and won't hesitate to buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Shopper",
      "helpful_votes": 2,
      "publication_date": 20161224
    },
    {
      "title": "dog supplement",
      "text": "Who knows if it works but the very same oil is nearly 2x more expensive locally. Using the supplement for our 11 year old border collie who still runs 100 miles an hour -well almost- but does have some soreness in her rear leg.",
      "rating": 5.0,
      "verified": true,
      "author": "timothy",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Received quickly!!",
      "text": "I'm thankful to have received this product quickly, the only thing was the packaging it came in was soft and the box that holds the bottle was smashed, not a big deal but I like to store the bottle in its original box. I would of preferred to have received in a box, but other than that.. PERFECT. THANK YOU!",
      "rating": 5.0,
      "verified": true,
      "author": "phoff1412",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Vet recommended and effective",
      "text": "Our vet suggested using Welactin for our 12 year old lab with joint issues a couple of years ago. She's pushing 13 now, but still loves to walk, swim, and play with other dogs. With this supplement, along with pain management, we love that she is living a happy and comfortable life.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet S. Moughler",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Smells horrible. My dog won't even try it!",
      "text": "It has a very strong fish odor and my dog won't even try to eat food that has any fraction of Welactin. I tried mixing it with beef, chicken, and cheese but none were enticing enough to get him to try it (and he will eat almost anything he can get). The smell is so strong that I have an extremely difficult time trying to get it off my hands. I can't return it because I bought it months ago and was only recently able to begin switching him to homemade vet-approved meals.",
      "rating": 1.0,
      "verified": true,
      "author": "Rowina Bell",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "My Great Dane Loves this stuff!",
      "text": "We got this mainly because our dog HAD some nasty looking fur, but after two weeks he looks night and day different. I'm so happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Becky ",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Would recommend",
      "text": "We use this for our puppies overall health and coat issues. Smells like fish, obviously but the puppies like it and it helped alot. Recommended by our vet.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelley Finley-Urbania",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Easy peasy!",
      "text": "The life saver for my dogs skin allergies! So easy to mix with food and my dog will still eat his food no problem!",
      "rating": 5.0,
      "verified": true,
      "author": "Ariana",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Easy to figure out dosing",
      "text": "I really like that it is easy to figure out exactly how much Omega 3's my dog is getting in each teaspoonful, and also that the recommended dosages are at the level where research says they are useful for arthritis, kidney disease, etc. Many of the pump bottles are much lower.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Schiro",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Tasty but not a cure all",
      "text": "My dog is a big fan of this stuff. He looks forward to it at meal time and when he's not in the mood to eat, a serving of this on top of his food will change his mind. He currently has bad allergies which causes his skin to be itchy, red and allows for yeast growth. Based on several vet recommendations I've been giving him omega 3s which are reported to help skin conditions but I haven't really noticed much of a difference. I will keep buying/using this since he likes it so much and it's easier to administer (it's a liquid which is poured on food) versus the pills he used to get.",
      "rating": 4.0,
      "verified": true,
      "author": "More than your Average User",
      "helpful_votes": 0,
      "publication_date": 20121020
    },
    {
      "title": "Vet Recommended",
      "text": "My vet recommended this for our Iggy. We put it on his food as directed and has made a huge difference in his coat! Very pleased!!!",
      "rating": 5.0,
      "verified": true,
      "author": "lindsalot",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Great results for me.",
      "text": "This was recommended by my Vet for my 10 year old German Shepherd. She was having some cognitive issues. 2 Months of using this and she is alert and doing great. It was about 10.00 cheaper from Amazon than at my vets, although I did buy the 1st bottle from the vet to get her started right away.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn N.",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Vet recommended",
      "text": "Not too sure on its effects, but the vet I work at highly recommends it. I give it to my old dog for every one of the things its supposed to help, and I give it to my young dog for her skin. They like the taste and eat it just fine, I just wish there was a way to use it without it being so darn messy. I leave the spoon in a little bowl because its so gross and covered in oil. I have repurchased this a few times now, it'll probably be a permanent staple due to its benefits.",
      "rating": 5.0,
      "verified": true,
      "author": "wild horses",
      "helpful_votes": 0,
      "publication_date": 20150914
    },
    {
      "title": "... buying this for quite some time and am very pleased with how it helps my dogs skin & coat",
      "text": "I have been buying this for quite some time and am very pleased with how it helps my dogs skin & coat. My comment is regarding the packaging/bottle cap and how it has changed. Originally, it was very well made. Now they have changed to a plug, flip top type cap and the last two I received were already broken inside the Welactin box when delivered. Just thought I would mention this.",
      "rating": 5.0,
      "verified": true,
      "author": "Janice",
      "helpful_votes": 0,
      "publication_date": 20170406
    },
    {
      "title": "Vet Recommended, Dog Approved",
      "text": "Recommended by my vet to give to my older black lab as a supplement. Not the best smelling (think fish oil), but my dog loves it. I squeeze some on her dry food in the am, along w/ a joint supplement.",
      "rating": 5.0,
      "verified": true,
      "author": "Bae",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Great product.",
      "text": "It makes my dog so shiny and sleek he actually runs faster. Okay maybe it doesn't make him run faster but his coat definitely looks really great since we started giving it to him. On here it costs almost half of what my vet charges for it!! One gripe I have is that it's a squeeze bottle and it tends to dribble out of the nozzle a bit and gets on the side of the bottle, and once you get it on your hands there's no getting the stink off for a few hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael R",
      "helpful_votes": 0,
      "publication_date": 20150308
    },
    {
      "title": "So far he likes it!",
      "text": "I noticed that my pooch is now eating the whole day's worth of food with this oil drizzled on top. I think he likes it. I will update if I notice a difference in his coat skin or joints.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisamcdinaz",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Highly recommend",
      "text": "Always delivers fast. Used for years for our Rottweiler and his very dry skin. Recommended by his surgeon. Gives him a beautiful coat and zero dry skin and he loves it makes his food taste great! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Marie C.",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "You and your pet will love this product!",
      "text": "If you want a shiny coat and supple fur on your dog this is it. You will notice a difference within a week. And there are no side effects for my GSD or Sheltie (no diarrhea, vomiting, etc.). They will be on this for life! The skin is pink and perfect, no scratching or biting and the fur feels like it's been conditioned (not greasy just shiny and beautiful). You and your pet will love this product!",
      "rating": 5.0,
      "verified": true,
      "author": "C Camp",
      "helpful_votes": 0,
      "publication_date": 20160609
    },
    {
      "title": "Do not recommend",
      "text": "This supplement made my dog sick everytime he took it. I tried doing it at different times of the day, or slowling adding the recommended portion. I don’t know if the bottle I got was rancid or if it’s a poor quality but I do not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "billy rodgers",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "dog doesn't seem to mind it",
      "text": "I give this to my dog once/day in her dinner and she doesn't seem to mind it. Was recommended by vet for her joints, but I feel like she isn't shedding as much on it and is softer.",
      "rating": 5.0,
      "verified": true,
      "author": "Karli Smith",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Smell of Welactin",
      "text": "This is much cheaper on Amazon vs. at the Vet's office. I originally gave it 5 stars but after using it awhile the dog smelled of Welactin and I just could not stand the smell. I happen to be sensitive. The product is good though, however, for me I had to stop using it and now use Fish Oil capsules for my pet. The change from Welactin to Fish Oil after several months does not seem to show any difference for the dog and my Vet is okay with it.",
      "rating": 3.0,
      "verified": true,
      "author": "luvtoshop",
      "helpful_votes": 0,
      "publication_date": 20140910
    }
  ],
  "product_meta": {
    "title": "Welactin Omega-3 Skin and Coat Support Liquid, 16 oz",
    "description": "Welactin Canine provides a rich source of omega-3 fatty acids from wild-caught, cold-water fish to support healthy skin and a shiny coat, joint health, heart health, kidney health, brain health, immune health, and vision.",
    "rating": 4.7,
    "feature_bullets": [
      "RICH SOURCE OF EPA and DHA: Welactin provides a rich source of beneficial long-chain omega-3 fatty acids EPA and DHA from wild-caught, cold-water fish",
      "BENEFITS OF OMEGA-3’S: Long-chain omega-3 fatty acids support healthy skin and a shiny coat, joint health, heart health, kidney health, brain health, immune health, and vision",
      "DERIVED FROM SMALL COLD-WATER FISH: The fish oil found in Welactin is derived from small cold-water fish, which typically have less accumulation of toxins than larger cold-water fish",
      "QUALITY TESTED: Welactin is quality tested for contaminants and heavy metals"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3 x 3 x 8.5 inches; 15.2 Ounces",
      "Item model number": "WEL16",
      "Department": "Dog-vitamins-supplements",
      "Date First Available": "April 6, 2007",
      "Manufacturer": "Nutramax Laboratories Veterinary Sciences, Inc.",
      "ASIN": "B001FB6ECQ",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Supplements & Vitamins",
      "Dogs",
      "Fish Oil Supplements",
      "Health Supplies",
      "Pet Supplies"
    ],
    "price": 16.01
  }
}