{
  "website_summaries": [
    {
      "verdict": "A custom towing mirror that is proven to perform and is more affordable than similar options.",
      "pros": [
        "Installation does not require any hardware, and no holes need to be drilled into vehicle",
        "Offers a superb fit and can instantly be installed over a factory mirror",
        "Comes with a versatile screw that allows you to tighten or loosen the adjustment tension of the mirror for added convenience"
      ],
      "cons": [
        "Excess vibration may require you to adjust the mirror regularly",
        "Less durable than many comparable options"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Better Than The Ones With The Knob",
      "text": "These fit my 2002 GMC 2500HD perfectly. With no knob to tighten they look like factory OEM. Perhaps the single best feature of the mirror extensions is a screw that allows the user to tighten or loosen the adjustment tension for the mirror. I was hesitant to try these because my previous mirrors had knobs to tighten them. These come with removable strips inside the mirror. If they are too tight of a fit, remove 1 strip at a time until they are somewhat difficult to snap into place - you want them on tightly! In my case I needed to only remove the center strip for a tight fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Spence",
      "helpful_votes": 12,
      "publication_date": 20151120
    },
    {
      "title": "but the passenger-side mirror is pretty useless. It's magnified and jiggles a lot",
      "text": "I bought a slide-in camper for my pickup and I got a set of these mirrors so I could see if there's a vehicle behind me. Even though I took off all the spacers for both mirrors, I was unable to get either one to click into place, so they're neither one fully \"installed\". Nevertheless, they stay in place and I use them. The left one I use primarily to see what's behind me (I can see a little bit of a trailing car), but the passenger-side mirror is pretty useless. It's magnified and jiggles a lot, despite me using the screw to tighten it down. Basically, the left mirror gives me what I want.",
      "rating": 3.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 4,
      "publication_date": 20170923
    },
    {
      "title": "Good inexpensive towing system",
      "text": "Installed on a 2006 Chevy Silverado 2 wheel drive half ton truck for when I tow a 29 foot travel trailer. It installs easily and it gives me just enough extra view to see along the trailer and the blind spots. It can be removed but I just leave in place, even when not towing. You must be careful using fast food drive thru windows and drive thru ATM's because this system adds an extra 5\" to each side of your truck. They also add extra wind noise when driving at highway speeds.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 4,
      "publication_date": 20160425
    },
    {
      "title": "Could be worse",
      "text": "Easy to snap on, not so easy to take off. The clips on the side closest to the truck should be like the ones on the bottom. As they are, it's difficult to remove the mirror. Pretty small field of view. Will be good for backing into tight places, not much use for anything else. But, I bought it for backing, so its worth keeping. Cheaper than aftermarket mirrors.",
      "rating": 4.0,
      "verified": true,
      "author": "Elwood",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Not perfect, but the best option I can find.",
      "text": "This item does extend the field of vision for hauling camper and fits mirrors well. This item does not do a great job of it though. The right mirror should be slightly convex, to show a larger field of vision and both mirrors are blurry from vibrating at speed. They are only really good for backing. Sadly, I haven't found a better version or complete mirror replacement that will maintain factory folding mirror. Also, they are impossible to put on when weather is cold. Warm them up in your house before trying if it's cold outside.",
      "rating": 4.0,
      "verified": true,
      "author": "LAW74",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Doesn’t fit properly.",
      "text": "These would work great if they fit properly. We purchased for a 2006 Suburban and the bottom will not snap on. No matter what we do, it’s just a little shy of fitting properly. They would work great otherwise for the price. I ordered for our vehicle when we haul our camper. We didn’t get to try them right away and our return window had closed, otherwise, I would have returned them.",
      "rating": 3.0,
      "verified": true,
      "author": "A. Hilliard",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Pretty good after 800",
      "text": "I've put about 800 miles of towing a 5th wheel with the mirrors in place. They are pretty good and don't vibrate while traveling near as much as mirror extensions I've used in past years. I think this may be due to the fact that the front facing part of extension is designed to be as one unit with existing mirror, hence reducing vibration due to wind. Other mirror extensions were only good for backing. These are good while traveling as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark M.",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Not what I expected",
      "text": "The mirrors fit perfect over the factory ones on our 2002 Silverado. I was hoping they would show more side views while pulling our 30' travel trailer. They do somewhat but not as much as I was expecting. I catch myself viewing the larger mirror more than the outer one. Plus the outer mirror needs to be constantly tightened to keep it from moving.",
      "rating": 2.0,
      "verified": true,
      "author": "Chevy Fan",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Drastically increases my view especially when changing lanes to the right.",
      "text": "I've had the mirrors on my 2003 Chevrolet Avalanche for about 5 months now. It is amazing how much further back I can now see, especially when changing lanes to the right. I can now see way past my 25 foot RV when previously the RV would obstruct my view and prevent me from changing lanes safely to the right without passenger assistance. I am surprised how much extra view I get for a relatively small extension. They were relatively easy to install. They fit very snugly and there is no noticeable vibrations. I simply leave them on and have had no problems at all.",
      "rating": 5.0,
      "verified": true,
      "author": "D. I.",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Easy to take on and off and they stay put ...",
      "text": "Easy to take on and off and they stay put when you put them on. I had a similar set that that used a wedge and a screw to keep it on the truck and the right one in particular kept working loose. It finally fell of somewhere on the road and I bought this system as a replacement. I can't see these mirrors ever coming loose with the \"tabs\" or \"brackets\" that hold them on the truck mirror. You do get some vibration in them, but you can still see if someone is in the field of vision of the mirror. They may not be factory grade mirrors for towing, but they're excellent for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron W",
      "helpful_votes": 2,
      "publication_date": 20160423
    },
    {
      "title": "Excellent set of mirrors. Worth the money, simple.",
      "text": "A little hatd to get on/off, but I like that so they won't accidently cone off. Have traveled over 1000 miles with so far. They vibrate just a little, but not bad at all. Really like the storage bag. Hardest part was setting the placement of the rubber spacer material to get a snug, but not too tight fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Gordon",
      "helpful_votes": 2,
      "publication_date": 20170116
    },
    {
      "title": "Fits My 06 Suburban 1500 with painted mirror covers",
      "text": "Amazon says these don't fit an 06 Suburban, but every other web site says they do. I had to remove all of the foam strips but the mirrors snapped on pretty tightly after the foam was removed. (The instructions even state if you have Chrome or painted mirror covers to start removing foam strips until they snap on.) I have the same brand of snap on mirrors for my 2016 Town &Country and they've always worked fine. I hope these will be at least as good as those are!",
      "rating": 4.0,
      "verified": true,
      "author": "Ben R.",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Don't go by the Amazon information on what this mirror ...",
      "text": "Don't go by the Amazon information on what this mirror will fit. I have a 2006 GMC Sierra SEL with the mirrors shown in the picture and this mirror will absolutely NOT FIT! The instructions say to remove the tape strips on the inside one at a time until the mirror will snap on. After removing all three strips it will still not fasten on my mirrors. The only reason I will keep them is because I think I can come up with a way to fasten them to my mirrors.",
      "rating": 1.0,
      "verified": true,
      "author": "RV'N SNOWBIRD",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "So so, not great, still useful.",
      "text": "Easy insrall, they are hard for one person to adjust the passenger side properly. They vibrate a lot when moving. I checked the tightness as prescribed , they were tight but still vibrate a lot.",
      "rating": 3.0,
      "verified": true,
      "author": "Surly Tom",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Tricky but good",
      "text": "It's a bit tricky to put on but I had minimal issues installing these on my 2007 Chevy Silverado Classic (clip top/slide in a bit/tuck the bottom clip). There's even enough leeway to allow the mirrors to retract so I didn't have to pull them off. There is a bit of shake in them at speed, but given the advantage they are worth the effort.",
      "rating": 4.0,
      "verified": true,
      "author": "Sparky",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "Tight fit",
      "text": "These mirrors work pretty good for the money. They are a very tight fit and will take some strength to install and remove. They look very nice once they are on the vehicle. The mirrors vibrate some while on the road and takes a little while to get use to, but they help me see the cars behind me while pulling my 20ft boat.",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20161127
    },
    {
      "title": "Must remove inside padding  strips for extended mirror to fit properly.",
      "text": "Bottom tabs would not snap in or lock into place no matter how many times tried pushing. Finally got 'em , had to remove all 3 of the thin padding strips on the inside. 2004 Chevy Silverado",
      "rating": 4.0,
      "verified": true,
      "author": "RICHIE MONITEAU",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Just the trick and a perfect fit on 2000 Suburban",
      "text": "Contrary to many reviews, these fit perfectly on 2000 Chevy Suburban 1500 LT. They were rather difficult to snap into place due to the snug fit and padding. Be patient. Worked best sliding them on a far as possible and attaching the top first, then working the bottom clip in place. I will agree that there is modest mirror shake and one mirror likes to drift down. But not too bad and mine have stayed in place now for over a month of regular driving.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Hudson",
      "helpful_votes": 0,
      "publication_date": 20150309
    },
    {
      "title": "I was able to use them for the first time this weekend and they worked great. A little vibration but not so bad that ...",
      "text": "Tight fit but that's what you want so they don't fall off while you're driving. I was able to use them for the first time this weekend and they worked great. A little vibration but not so bad that you can't see. I would recommend these to anyone looking for a good fitting tow mirror.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Davis 1684",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "The only thing I do not like is that the passenger side does not have a ...",
      "text": "On the driver's side the tow mirror is exactly what is needed, an extension of the field of view, I have almost no blind spot now. The only thing I do not like is that the passenger side does not have a convex mirror. I still need to hook up to my trailer and get someone to help me aim that side, maybe I can find a position where it would be useful. They also shake going down the road, nothing bad, just worth mentioning.",
      "rating": 4.0,
      "verified": true,
      "author": "Kev",
      "helpful_votes": 0,
      "publication_date": 20150323
    },
    {
      "title": "Easy to use",
      "text": "These were easy to install and give us a greater field of vision for pulling our travel trailer. While the mirrors do vibrate some and move, they're easy to adjust and it isn't a big deal. These are a much more cost-effective solution to towing need than buying brand new custom mirrors.",
      "rating": 4.0,
      "verified": true,
      "author": "Rhonda Taylor",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Fit like a glove on my 02 Suburban 2500",
      "text": "Fit like a glove on my 02 Suburban 2500. You have to be quite forceful to get the bottom clip on (which should be last). I could probably make my life easier y removing one of the strips that are inside the housing but I want these to have a very snug fit. So far I see no shaking when driving even at highway speeds.",
      "rating": 5.0,
      "verified": true,
      "author": "AJL",
      "helpful_votes": 0,
      "publication_date": 20160329
    },
    {
      "title": "Poor fit on 2000 Silverado",
      "text": "These don’t fit as well as the “custom” fit should. I hope they stay on. The bottom is supposed to clip on the bottom of the truck mirror and they don’t even come close. I tried everything I could think of and it wouldn’t reach the bottom.",
      "rating": 3.0,
      "verified": true,
      "author": "Allen",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "A great fit !",
      "text": "Didn't know what to expect when ordering towing mirrors but when I read other reviews that these were the best I took the chance and boy was I glad ! Excellent fit and they look like they belong instead of some of this mirrors that have straps etc. Just the length I need for good view behind me and a good \"factory\" look - couldn't be happier and of course the free shipping doesn't hurt a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Brockhoff",
      "helpful_votes": 13,
      "publication_date": 20110627
    },
    {
      "title": "Just got back from a 700 mile trip and they worked great! Actually",
      "text": "A little tough to attach the first couple of times, but I removed some of the tape inside the mirror at the bottom, and they went right on. Just got back from a 700 mile trip and they worked great! Actually, my wife got tired of me telling her how great these mirrors were! Buy them, you won't be disappointed! Extended my view around my 5th wheel perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "DrumDoctor",
      "helpful_votes": 0,
      "publication_date": 20150710
    },
    {
      "title": "Extension Mirrors (Silverado)",
      "text": "Product arrived in three days. Used immediatly and fit perfectly. Gave clear view around my 8' wide 5th wheel. The price for two (2) was the same cost as one (1) mirror at Camping World. I did have to remove one strip of cushion tape (as the directions siad to) to fit on my chrome mirrors. Guess the chrome adds to the original mirror thickness. Mirrors vibrated on bumpy road, but still allowed to see down the side of the trailer. They also attatch around the edges so you still have full use of the original mirror, including the power controls. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20120617
    },
    {
      "title": "Better Than My SUV Mirror Alone",
      "text": "Okay, but I would have expected the outer mirror to be more wide angle rather than like looking through a magnifying glass.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "There is a good story behind this product",
      "text": "Same as the other review. Didn't work very well, took them off and threw them away after one mirror fell off.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark Kautz",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Get them",
      "text": "These worked great. Husband is very satisfied with look, function and cost. They were a good deal and work excellent",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley ",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "I love these mirrors",
      "text": "I love these mirrors. I have a long trailer and these mirrors really help out. Crazy easy to install. I just leave them on my truck even when I'm not pulling a trailer. I would recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Canes73",
      "helpful_votes": 0,
      "publication_date": 20160817
    },
    {
      "title": "Perfect",
      "text": "These work perfect. They also looked just like the stock mirrors",
      "rating": 5.0,
      "verified": true,
      "author": "michael j.",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Good inexpensive solution",
      "text": "I have the chrome caps on my GMC mirrors which made these a little more difficult to install, but they finally went. They do jiggle a bit when driving, and they're not as big as some towing mirrors, but they're a good, inexpensive way to add extended mirrors. Much better than spending hundreds of dollars and having to to remove and replace the original mirrors. If they had a slight convex shape, they'd be fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "greg crawford",
      "helpful_votes": 0,
      "publication_date": 20131204
    },
    {
      "title": "Don't receive return as on by the date promised.",
      "text": "I tried several times before the due date to return the item but \"the system\" didn't work the process to print the label.",
      "rating": 2.0,
      "verified": true,
      "author": "Virginia Cicchiello",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Better than buying new mirrors.",
      "text": "Fit was tight, you have to use some force to get it on. Like a lot of people said, the passenger side mirror does not help. Still it worked for me. But cheaper than buying new mirrors.",
      "rating": 5.0,
      "verified": true,
      "author": "chieftopdog",
      "helpful_votes": 0,
      "publication_date": 20170330
    },
    {
      "title": "MUST HAVE",
      "text": "DO yourself a huge favor and ORDER these mirrors this is the best option for clean looking towing mirrors. IF YOU HAVE AN RV WIDER THAN YOUR TRUCK YOU NEED TO HAVE THESE!!!! Don't think for a second you don't need them. I have a 32 ft travel trailer and we just recently took it for a weeks vacation from Ohio to Ocean Lakes In myrtle Beach. 1000 miles round trip and The Mirrors stayed in place and worked as designed and exceeded my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Joey KostenbaderKB",
      "helpful_votes": 0,
      "publication_date": 20140619
    },
    {
      "title": "Work great for pickups with feedbox!",
      "text": "I bought these for my husband who has a Chevy 2500 with a feedbox and hay unroller on the back. The mirrors that came on the pickup did not show enough of the bed to allow him to hook on to a bale of hay. These snap on easily over the existing mirror and add a lot more viewing area. You have to be careful when driving through narrow openenings such as gates or alleyways of corrals but otherwise they are a fantastic product! Way cheaper than new mirrors too!",
      "rating": 5.0,
      "verified": true,
      "author": "lsal mom",
      "helpful_votes": 0,
      "publication_date": 20121215
    },
    {
      "title": "They do give me a lot better vision around my RV",
      "text": "They do give me a lot better vision around my RV, but seeing detail is difficult because vibration causes them to shake - just enough to blur details. They are difficult to snap on, but once they were installed haven't moved. And they allow me to use the electric mirror adjustments to look down at my tires or up to see overhangs, without moving the extended mirrors",
      "rating": 4.0,
      "verified": true,
      "author": "Gordy J",
      "helpful_votes": 0,
      "publication_date": 20150110
    },
    {
      "title": "Simple and easy installation",
      "text": "These fit my GMC Sierra 2500...as if they were made for my truck, like a glove. It took little effort to install, a wiggle here and there, piece of cake. Bonus was the cloth, divided, drawstring bag to store them in. I highly recommend this product, I'm very pleased with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Cassandra S.",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Nice mirrors",
      "text": "Good product. They fit my factory mirrors nice and tight. Mirrors do tend to be a bit shaky at highway speeds, but not so bad to obstruct view. Also, like some other reviews stated the passenger mirror being flat rather then convex does cut down visibility, but for me iys not a big deal.",
      "rating": 4.0,
      "verified": true,
      "author": "rlb9844",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "They Fit!",
      "text": "I finally got a mirror that fits and gives me a good view to the rear. The only problem I had was putting them on, they just wouldn't go on until I took out all three of the adhesive strips, this was mentioned by another customer's review. Now they are really snug and my first impression is that they'll last awhile.",
      "rating": 4.0,
      "verified": true,
      "author": "Raymond Riha",
      "helpful_votes": 0,
      "publication_date": 20141026
    },
    {
      "title": "Gets the job done.",
      "text": "The reflections in these mirrors are a little gittery. But you can see behind you enough to know when a vehicle is there. They fit to the original mirrors snuggly and if you did not know you would think it is standard equipment. Overall good purchase for what I need them for. If you are planning on pulling a trailer frequently you might want to move up to the replacement mirrors. I only use them once a month or so.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Petraszak",
      "helpful_votes": 0,
      "publication_date": 20120830
    },
    {
      "title": "Good mirrors once you get them installed",
      "text": "Mirrors work great once you get them on the truck. I have a 2001 Silverado 2500 HD with chrome insert factory mirrors. They finally went on but had to get help from my wife to do it. This is the first time they were installed. Hopefully, installation will be easier next time.",
      "rating": 4.0,
      "verified": true,
      "author": "Ted from Ohio",
      "helpful_votes": 5,
      "publication_date": 20131124
    },
    {
      "title": "but not to bad. Fit/attachment is excellent",
      "text": "I get a little vibration, but not to bad. Fit/attachment is excellent. The reason for 3 stars is the mirror should have a slight convex shape, allowing greater blind spot coverage w/o leaning forward and possibly even eliminating the need to look over your should to see if someone in your blind spot. If the mirror covered more area by supplying a convex shape I would have given at least a 4 star rating!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "Works well, slight fit issue",
      "text": "Mirrors seem to be well made. Only slight issue is getting the clips to 'snap' on. This may be due to factory 'chrome' on mirror surface. The chrome may interfere just enough to make the clips fit very tight and not want to snap. Even without all of the clips fully seated I've road tested these at over 70 mph and they stay on very securely, no worries about them coming off.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremy Jones",
      "helpful_votes": 0,
      "publication_date": 20140521
    },
    {
      "title": "Good fit",
      "text": "Was a little difficult to install at first. Once I got them on I really liked the fit. They mold right to the original mirrors on the truck. They are easy to adjust and add good vision.",
      "rating": 5.0,
      "verified": true,
      "author": "mark eldridge",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Good mirrors with one major flaw",
      "text": "Work good other than passenger mirror magnification is same as drivers side and you can't see very much in it.",
      "rating": 4.0,
      "verified": true,
      "author": "wvrinny",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Fits well on 2004 Chevy Avalanche",
      "text": "We own a 2004 2-wheel drive Chevy Avalanche. These fit well on the mirrors and stay put (i.e. don't shake lose). They add extra visibility for when towing our trailer. I've shopped around and Amazon's price (while it goes up and down) is much cheaper than buying these same mirrors at various RV chains in our area. they fit they stay put they provide the extra visibility and tend to cost less at Amazon",
      "rating": 5.0,
      "verified": true,
      "author": "M. Wolf",
      "helpful_votes": 0,
      "publication_date": 20120714
    },
    {
      "title": "Fits perfect & looks great!",
      "text": "Fits perfectly on our 2005 Silverado & looks great. They were a little difficult to get on so I probably wouldn’t recommend if you want something to take on & off prequently but we love them.",
      "rating": 5.0,
      "verified": true,
      "author": "AEV",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Nice snug fit",
      "text": "Bought for extensions on 2000 Silverado mirrors to see around my camper. My ONLY complaint is that in high winds, they rattle just a little bit & so does the glass. If that's an issue for you, look elsewhere. HOWEVER, it's really not that noticeable to look anywhere else. Works just fine. Steve",
      "rating": 4.0,
      "verified": true,
      "author": "NRA Guy",
      "helpful_votes": 0,
      "publication_date": 20141221
    },
    {
      "title": "2007 Silverado 1500 classic - fits perfectly",
      "text": "Chevy decided to make changes in the 2007 Silverado production year. 80800 fits the 2007 classic. 80900 fits the updated model.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Very happy with these - added visiblity I needed",
      "text": "They look great! Added the additional visibility around my travel trailer I needed. Very happy with these and love that I can easily remove without extra tools when I want them off. Only issue was that they took a bit of muscle to get them to snap on.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Hansen",
      "helpful_votes": 0,
      "publication_date": 20150811
    },
    {
      "title": "fits",
      "text": "easy to install ,looks good on truck , works great",
      "rating": 4.0,
      "verified": true,
      "author": "ken adams",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Perfect Fit",
      "text": "Perfect fit for my truck, will definitely be an improvement over just stock mirrors",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Polly",
      "helpful_votes": 0,
      "publication_date": 20160910
    },
    {
      "title": "sold the truck",
      "text": "We didn't use these as we sold the truck we had before we had a chance to use them. We included them in the sale of the truck so someone will be using them.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon Cheslock",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "great product",
      "text": "Shipping was timely. Installation is a breeze. Cost is a lot cheaper than buying from auto parts, dealership or RV dealership. We were looking for something that could go on and off with ease, as we only need them when we see when we are pulling the camper.These mirrors are exactly what we needed..nb",
      "rating": 5.0,
      "verified": true,
      "author": "jeffandchell",
      "helpful_votes": 0,
      "publication_date": 20141104
    },
    {
      "title": "Much better than the others",
      "text": "These things were a pain to install. But the flip side is they won't come off. I had a pair previously that attach with the bungees. JUNK! They broke 50 miles into my 1000 mile trip and shook so bad I couldn't see out of them. I got these and WOW what a difference. 60 mph with a cross wind and barely a flutter on these mirrors. Don't be fooled by he low price. And yes, this is for a pair not just one. I paid more for the cheap ones that fell off on the freeway.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim F.",
      "helpful_votes": 0,
      "publication_date": 20150121
    },
    {
      "title": "not so good for the passages side",
      "text": "Works well for the drivers side ,not so good for the passages side, but for the cost , I can't complain. They fit well and don't vidrate ,",
      "rating": 5.0,
      "verified": true,
      "author": "Bob. H.",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "Good mirror extensions.",
      "text": "Good mirrors. Had to spend some time snapping them into place. Not the easiest install. Once installed, they are rock solid.",
      "rating": 4.0,
      "verified": true,
      "author": "TexasWilly",
      "helpful_votes": 0,
      "publication_date": 20161108
    },
    {
      "title": "Perfect fit for 2007 Silverado 1500HD",
      "text": "Went on a little hard but this is OK since I was installing in cold weather. Look like factory mirrors and really help when towing.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "but are better than not having extensions at all",
      "text": "Little tough getting on, but when installed correctly I can not see these coming off while driving. They do shake, but are better than not having extensions at all. They work well enough that I'm keeping them.",
      "rating": 3.0,
      "verified": true,
      "author": "Moe",
      "helpful_votes": 0,
      "publication_date": 20151013
    },
    {
      "title": "Easy to store towing mirrors",
      "text": "I'm really glad I purchased these mirrors for towing. My previous mirrors were strapped down to the door of the car and were very bulky to store. These are easy to slip on and off (after a couple of tries) and the extra mirror works independently of the car mirror. A must to have for towing.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeanie",
      "helpful_votes": 0,
      "publication_date": 20151019
    },
    {
      "title": "Great Fit!  Great Look!",
      "text": "I have used the strap on type mirror for the past few years and even though they worked very well, but they were a pain to put on and take off. So I tried this set of mirrors and Im glad I did. They look great and fit like a glove. Great fit for my 2005 Tahoe, easy to put on and take off. I would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Craig Fraser",
      "helpful_votes": 0,
      "publication_date": 20141219
    },
    {
      "title": "outer mirror shakes a bit",
      "text": "They work as intended but shake a bit on the highway ,for $40 its worth it",
      "rating": 4.0,
      "verified": true,
      "author": "Coleen Faircloth",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Tight fit",
      "text": "You had better be strong to get these jokers latched on. I was nervous I was going to break the factory mirrors when snapping them on. They do vibrate a little going down the road, but I'm going to tighten them up a bit and see if it makes a difference",
      "rating": 4.0,
      "verified": true,
      "author": "Pablo",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "2002 Suburban",
      "text": "Sung fit on my 2002 Suburban 1500, but does fit. They're not likely going anywhere, at least while driving. Will avoid taking them on and off as much as possible because of the snug fit. Does not interfere with the electric mirror adjustment.",
      "rating": 4.0,
      "verified": true,
      "author": "Phil'nHalf",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "the best ones I have owned",
      "text": "I've owned other sets of clip on mirrors and I was never happy in the quality of the mirror image. It always seemed to but vibrating and hard to get a clear image. I was looking for a different kind of of mirror and found these. While they might not be as good as the flip up Mirrors like my dodge 3500 had but these will do nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20130606
    },
    {
      "title": "Towing Mirrows for my 2005 Silverado 1500",
      "text": "These mirrors are easy to install, but are tight enough so they don't move or shake going 65mph. My RV is 21' long and 7' wide.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark K. West",
      "helpful_votes": 0,
      "publication_date": 20150821
    },
    {
      "title": "Tow mirrors",
      "text": "Decent set of tow mirrors for the price just not for me work fine. Just not use to them so they are awkward to me",
      "rating": 3.0,
      "verified": true,
      "author": "Missdawn",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Fit my Tahoe well and the snap on pretty tight, but come off easy so you didn't ...",
      "text": "Fit my Tahoe well and the snap on pretty tight, but come off easy so you didn't have to be \"that guy\" with tow mirrors and no trailer. Also comes with a nice bag to store them in.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "Wow!!! Don’t be afraid to buy this great product",
      "text": "Wow!!! Easy on Easy off. Excellent Quality. Perfect Engineering and a very good price",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Fits the truck very well.",
      "text": "Fits the truck very well, 2006 Silverado 1500HD. From the front it is almost impossible to tell they are aftermarket. Mirrors still fully function including power close function. Outer mirror does have a little vibration as is to be expected. I leave them on the truck full time.",
      "rating": 4.0,
      "verified": true,
      "author": "hmdsnr",
      "helpful_votes": 0,
      "publication_date": 20150328
    },
    {
      "title": "It works!",
      "text": "I should have my husband write this review. We installed with little fuss the mirror extensions and drove 17 hours straight through to our destination with our new trailer. There was no distortion from shaking we have read about with other mirror extensions. Both my husband and I would recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "mimi2212",
      "helpful_votes": 0,
      "publication_date": 20130722
    },
    {
      "title": "would not recommend",
      "text": "It fits good on the mirror but there is so much vibration and movement I can't hardly see anything with them",
      "rating": 3.0,
      "verified": true,
      "author": "NateCo",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "Great for the price",
      "text": "Great for the price! I needed to retain the power-folding feature of my stock `05 Avalanche mirrors and this was the only option I found. I like the look and fit. They were exactly what I needed and are just wide enough for me to see around my 8’2\" wide travel trailer. I have already used them on a 600 mile trip and no complaints thus-far.",
      "rating": 5.0,
      "verified": true,
      "author": "Denny",
      "helpful_votes": 0,
      "publication_date": 20150930
    },
    {
      "title": "Fit great, look great",
      "text": "Ordered these for my 2002 Yukon SLT. They fit snugly, did not wobble or shake, even at 70 mph. The only downfall is the manual adjustment of the right side mirror, you will need a helper to adjust it for you.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "2005 Chevy Suburban",
      "text": "Bought this for a better view of my 17ft. Trailer, had to take off my Chrome Mirror accessory in order for them to fit snug. Looks good.",
      "rating": 4.0,
      "verified": true,
      "author": "Adrian Cruz",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "I only wish they kept their angle better. I will have to try tightening the adjustment ...",
      "text": "The mirrors fit very well on my 2006 Suburban. It makes seeing the sides of the RV much easier. I can still even use the power folding mirror feature on my truck. I only wish they kept their angle better. I will have to try tightening the adjustment screw more.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20140801
    },
    {
      "title": "Good product! Great price!",
      "text": "kind of a pain to put on and take off but super product for the price. let's face it how many times a year do you take them out and put them off if you're just a casual camper like me and if you are a constant tower you're not going to take them on and off. 2005 Tahoe....no vibration at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Chad",
      "helpful_votes": 3,
      "publication_date": 20131205
    },
    {
      "title": "Fit like a glove.",
      "text": "Works great for towing our travel trailer. Couldn’t travel without it!",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Adams",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Fit perfect on my 03 surburban",
      "text": "Works perfect, seems to be good quality, would buy again or recommend to anyone looking for extended mirrors, for wide trailer pulling, like the storage bag when not needed, good price for peace of mind,",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Denison",
      "helpful_votes": 0,
      "publication_date": 20151024
    },
    {
      "title": "Once installed worked great!",
      "text": "Installing was not easy the first time. Had to do a little modifying. But once installed pulling the boat was a bit more relaxing knowing if a vehicle was behind it.",
      "rating": 5.0,
      "verified": true,
      "author": "Smitty",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Easy to use",
      "text": "Easy to use, was very needed and easy to order",
      "rating": 5.0,
      "verified": true,
      "author": "customer",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Good fit and easy to install.",
      "text": "I have a 2003 Chevy 2500 HD and they fit perfectly on the mirrors. They work great to see around my trailer. The only problem is that the mirror tends to vibrate some at high speeds and bumpy roads. They still work though and I would recommend if looking for an inexpensive way to extend the mirrors.",
      "rating": 4.0,
      "verified": true,
      "author": "Steven J Golby",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "They looked like they would do just what I needed but they ...",
      "text": "They looked like they would do just what I needed but they do NOT fit my 2003 Silverado that has electric moving mirrors (too small). Really hoped they would.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris Cherry",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "They are snug and provide better trailer view and don't jiggle while going down the ...",
      "text": "They are snug and provide better trailer view and don't jiggle while going down the interstate. However, the mirrors themselves vibrate constantly on every road for me even after tightening the screws down for them.",
      "rating": 3.0,
      "verified": true,
      "author": "Justin Jones",
      "helpful_votes": 0,
      "publication_date": 20160711
    },
    {
      "title": "Five Stars",
      "text": "FIT GREAT JUST HAVNT TOW MY PONTOON BOAT YET WITH THEM",
      "rating": 5.0,
      "verified": true,
      "author": "robert davis",
      "helpful_votes": 0,
      "publication_date": 20170513
    },
    {
      "title": "Better than anticipated!",
      "text": "VERY easy, simple and quick installation....did not need to remove the tape. Little if any vibration and they do look like OEM mirrors.",
      "rating": 4.0,
      "verified": true,
      "author": "nodroG",
      "helpful_votes": 0,
      "publication_date": 20150605
    },
    {
      "title": "Perfect for Chevy Tahoe",
      "text": "Great fit on a 2002 Tahoe. The bottom part took a little effort to get it to snap on the first time, but once on, it's not going anywhere. Great mirror.",
      "rating": 5.0,
      "verified": true,
      "author": "SD",
      "helpful_votes": 0,
      "publication_date": 20151107
    },
    {
      "title": "These fit perfect and worked awesome",
      "text": "These fit perfect and worked awesome, They look like they belong on the truck. Im buying more for some other vehicles I have.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamrs",
      "helpful_votes": 0,
      "publication_date": 20150928
    },
    {
      "title": "Good product, great price",
      "text": "Good product, great price. A little hard to get clipped on the original mirrors, but stayed put good when did get them to clip completely.",
      "rating": 4.0,
      "verified": true,
      "author": "Vivian Hall",
      "helpful_votes": 0,
      "publication_date": 20151202
    },
    {
      "title": "Great looks and good fit.",
      "text": "Great product and good fit, almost too tight. They can be a little hard to snap into place but very reassuring to know that they wont be flying off in the wind. And speaking of the wind, the side mirrors do shake a bit at highway speeds but still allow decent vision. I have had other slip on mirrors and so far like these the best and would recommend them to anybody that wants to keep their stock mirrors. Good fit and great look, so good it fools many.",
      "rating": 4.0,
      "verified": true,
      "author": "adamaglio",
      "helpful_votes": 0,
      "publication_date": 20130624
    },
    {
      "title": "took some pushing to get it completely snapped on but once i did they look great.",
      "text": "Very firm fit for my truck, took some pushing to get it completely snapped on but once i did they look great.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael N.",
      "helpful_votes": 0,
      "publication_date": 20151215
    },
    {
      "title": "Works good but vibrates",
      "text": "Works good for seeing down the side of my trailer. only thing i don't like is the vibration. I tightened the set screw and it improved a little bit but it still shakes quite a bit.",
      "rating": 4.0,
      "verified": true,
      "author": "J. voronovich",
      "helpful_votes": 0,
      "publication_date": 20141208
    },
    {
      "title": "Wonderful product!",
      "text": "Easy to install and remove. Provides excellent range of viewing. Does not impair factory mirrors and viewing. Fits well, looks nice, very happy with the product. I use them on a 2005 Chevy 2500HD 4X4 and would recommend them to you.",
      "rating": 5.0,
      "verified": true,
      "author": "Spence McConnell",
      "helpful_votes": 0,
      "publication_date": 20141105
    },
    {
      "title": "Works as advertised",
      "text": "Well so far they work as advertised. Clips right on. We will see how durable they are now. Disappointed with paying extra for the guarantied receive by date, spent the extra few dollars but they didn't make it in time for the trip I needed them for.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20130903
    },
    {
      "title": "Three Stars",
      "text": "Hard to get on and off vibrates a lot even after tightening screws",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "Price",
      "text": "Use on my Chevy truck. Have a slide in camper, see behind me now",
      "rating": 5.0,
      "verified": true,
      "author": "sissie",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Works",
      "text": "Too heavy to leave on but easy to install works as designed",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "These definitely helped me see along the side of my ...",
      "text": "These definitely helped me see along the side of my new TT. The first trip we made I didn't have these and they made a huge difference. They're a little tight to put on but I'd rather have that then them being to loose.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Strasser",
      "helpful_votes": 0,
      "publication_date": 20141025
    },
    {
      "title": "Camper mirror extension",
      "text": "These fit perfectly. They do not let me see directly behind the camper any more then the regular mirrors, but do expand the field of vision a lot more. I guess only a rear view camera will show what is directly behind. But these are far better then the one with the rubber straps.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Schlueter",
      "helpful_votes": 0,
      "publication_date": 20120710
    }
  ],
  "product_meta": {
    "title": "Snap & Zap 80800 Chevrolet Silverado Towing Mirror - Pair",
    "description": "Fit System’s Towing Mirror Extensions are the most economical towing mirror option you can find. They are an excellent, safe solution for all your towing needs to increase visibility when on the road while towing. Fit System Towing Mirror Extensions increase the effectiveness of existing OEM side mirrors. Our mirror extensions are custom designed to fit a variety of popular truck and SUV models. Installation is a snap, and the mirrors do not detract from the appearance of your vehicle. The final look is truly professional and looks like it was designed for your truck or SUV.\n\nEasy and effective extension of side mirrors EXTEND REAR VISIBILITY WHEN TOWING\nReduce your driving stress while towing. You will greatly improve your ability to change lanes, pass other vehicles and park your vehicle safely and effortlessly with the addition of our Fit System Custom Towing Mirrors. Towing incidents are quite common when pulling loads wider than your vehicle. These challenging hauling circumstances are why Fit Systems created and perfected our Towing Mirror line. For over 60 years we have provided solutions for the mirror industry and the past decade we have helped the Towing industry with our experience and knowledge. It is important to augment your existing side mirror line of sight. Our Custom Fit, aerodynamic design results in an unobstructed view for safer towing.\n\nDURABLE CONSTRUCTION AND EASY INSTALLATION\nFit System’s Towing Mirror Extensions are designed to last for years. The housing is rugged and the glass is scratch-resistant. The installation of our towing mirror extensions is so simple. There are no holes to drill or additional parts needed when installing them. No hardware needed! Simply snap the mirror in place over your existing mirror. Once the towing mirrors are in place, the built-in clips will keep the towing mirror securely in place on your existing mirror until you decide to take them off. The custom design flawlessly matches the contour of your existing mirror. The result is a look and feel that is professional. From the front of the vehicle hardly anyone will be able to tell there are towing mirror extensions attached. From the inside of the vehicle, you will easily see the increased field of vision while towing. No chunky looks, no parts sticking out creating an eye sore. Form ever follows function with these custom fit towing mirrors. They are sleek, elegant and look like they came directly from the manufacturer. These custom towing mirrors are conveniently sold as a pair with installation instructions for installation demonstration.\n\nABOUT FIT SYSTEMS\nSince 1950, as the leading manufacturer of vehicle mirrors, Fit Systems has been servicing the OE mirror industry and the replacement mirror aftermarket for over 60 years. Our car mirrors and truck mirrors can be found in numerous applications, and the Fit System name is one of the most recognizable brands on the market. Our diverse product line, which includes the automobile mirror, truck mirror, replacement glass and towing mirror segments, is manufactured under strict quality guidelines. We operate five factories worldwide that are ISO certified and follow QS 9000 standards. The Fit System, our OE replacement mirror program, covers over 2,700 vehicle applications and continues to grow. It is the largest program of its kind in the U. S. and Canada, and fulfills 87% of the aftermarket demand. We also manufacture universal mirrors for car, truck, SUV and van applications, as well as numerous interior and exterior accessories.\n\n\nFit System’s Towing Mirror Extensions are designed to fit seamlessly over standard factory side mirrors. Our Towing Mirrors fit Dodge, Ford, Chevy and Toyota models. The Fit System’s Towing Mirror Extensions are aerodynamic, elegant, and sleek and clip right over the factory mirror seamlessly. When clipped on these customs fit towing mirrors look as if they were manufactured as part of the original installed mirror. These mirrors feature an adjustable mirror that extends your towing vision without obstructing your existing mirror. The easy installation requires no tools and can be installed within 60 seconds. There are no holes to drill and they are a custom fit to your vehicle. Truly a factory look, feel and construction design. The mirror face is manufactured with scratch-resistant glass for many years of use. The materials used are designed for reliability. They can withstand years of use in all weather conditions. What are you waiting for? Try these top rated Towing Mirror Extensions from The Mirror People today!",
    "rating": 4.4,
    "feature_bullets": [
      "Pair (Left, Right)",
      "Part Number: 80800",
      "Towing Mirror Chevy / Gmc",
      "Mirrors can be folded without removing the extensions"
    ],
    "specifications": {
      "Manufacturer": "K Source",
      "Brand": "Snap & Zap",
      "Model": "80800",
      "Item Weight": "2 pounds",
      "Product Dimensions": "17.8 x 8.9 x 10.5 inches",
      "Item model number": "80800",
      "Manufacturer Part Number": "80800",
      "Cover Included": "K-Source 80800 Towing Mirror Chevy / Gmc",
      "Lift Type": "Manual",
      "Vehicle Service Type": "Cars",
      "ASIN": "B001AJMOLS",
      "Customer Reviews": "4.4 out of 5 stars416 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#40,176 in Automotive",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "May 30, 2008"
    },
    "categories": [
      "Towing Mirrors",
      "Hitch Accessories",
      "Automotive Parts & Accessories",
      "Towing Products & Winches",
      "Automotive",
      "Exterior Accessories"
    ],
    "price": 49.94
  }
}