{
  "website_summaries": [
    {
      "verdict": "Perhaps not an ideal choice for a \"first knife\", but experienced bakers and cooks will immediately notice a difference from standard semi-disposable models in the same price range.",
      "pros": [
        "Extremely thin slices possible",
        "Works well as a meat or vegetable slicer",
        "Thin stainless steel blade with a real wooden handle",
        "Nearly 10 inch blade length",
        "Good \"bite\" on thick crusts or vegetable skins"
      ],
      "cons": [
        "Blade is extremely sharp, but  no protective sheath included,  Limited space below handle for fingers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Nice bread knife",
      "text": "This Tojiro Bread Slicer cuts well without smashing the bread. It doesnt require a lot of force and it digs into my cutting board if I'm not paying enough attention. Its sharp. For that reason, I store it in the plastic box it came in. This knife deflects a little when slicing through hard crusts. If you intend to cut bread with really tough thick crust, a different model might be better for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Anaeee",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Meh.",
      "text": "Underwhelming. I unpackage it from the box and decided to send it right back. From the product photo, I was expecting a beautiful wooden handle, yet I got a cheaply made handle that looks exactly how another reviewer described: a wood decal on a hollow piece of plastic. The blade felt sharp, but I am looking for sophistication that is sadly not present here. As an aside, I noticed (as others have) that my knife did not have the words Tojiro in English on the blade. Maybe that is a sign of sub par quality? Others have raved about their beautiful knife, so maybe I received a dud?",
      "rating": 1.0,
      "verified": true,
      "author": "Eshrly",
      "helpful_votes": 3,
      "publication_date": 20180717
    },
    {
      "title": "As others, I have also cut myself!!!",
      "text": "Very sharp, but there is indeed something off with the ease of use of this knife as I also have cut myself. Lots of blood. I laughed when I saw the reviews from people having these accidents prior to buying it- dismissed them as not being careful, only to find myself in similar situation. The bread knife is light and the blad as sharp as razor. The balance is off when cutting crusty rustic bread. Just be careful!",
      "rating": 3.0,
      "verified": true,
      "author": "Frankie Parchunk",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "This knife really does a great job",
      "text": "We bake all of our bread at home and slicing can become a chore. This knife was reviewed somewhere (my son-in-law found the review and told me about it). It came in #1 which was enough to convince me to order it. It arrived in two days as promised and immediately was put to use with some bread that came out of the oven that day (I allowed it to cool first). It literally sliced like warm butter. This is a 100% WINNER!",
      "rating": 5.0,
      "verified": true,
      "author": "MacWiz",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Great for Sourdough!",
      "text": "Fabulous choice for any bread, works perfectly with slicing fresh sourdough! I had really been struggling getting a nice, clean slice with my Revere Ware bread knife, so I tried this one, and can highly recommend it. Makes slicing for sandwiches an easy task. Makes my bread slices ready for that perfect BLT!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberley A. Mitchell",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Cut bread like butter... and is wallet-friendly!",
      "text": "I desperately needed a bread knife for all the fresh loaves of bread I was buying at the local bakery. I was sharing the bread with neighbors and couldn’t share mangled bread slices/portions. This knife worked perfectly for the job I needed it to perform— sliced without squishing the bread! It made slicing bread so much easier and there were no rough or partial cuts. The only thing I’d like to see is a blade sleeve for this knife— not necessary, but would be nice since I put the knife in a drawer.",
      "rating": 4.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "WOW",
      "text": "Thus knife is unbelievably sharp! So much so you really must use caution when using it. I was cutting large cherry tomatoes, holding one between my fingers and cutting towards my hand, the nice is so sharp there is zero resistance from the tomato skin...fortunately I stopped myself before a potentially nasty cut and corrected my foolish ways. Used correctly, with caution and utmost respect, this knife is by far the best tomato knife I have ever used, oh yeah, goes through homemade bread like buttah. We will see how long it lasts but I will definitely buy another to replace it when it dulls.",
      "rating": 5.0,
      "verified": true,
      "author": "erinron",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Great bread slicer.",
      "text": "I enjoy Italian round bread, uncut, and I used my regular chef's knife several times until finally giving in and buying a bread knife. In Europe, we had bread slicing machines at the corner grocery and bakery to avoid these problems. I settled on this because it is priced right, looks amazing, and is Japanese. It cuts the bread beautifully, with minimal crumbs. I can get pretty thin, straight slices with ease. I don't know why I didn't buy this earlier as a regular chef's knife is BAD at cutting bread. Make your life easier and buy this knife now.",
      "rating": 5.0,
      "verified": true,
      "author": "PreciousTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Cuts salmon skin",
      "text": "Finally! This is the first knife we've owned in our lifetimes that can cut through the skin of raw salmon! We use it on a wood cutting board. Can't wait to try it out on a whole chicken. And now cutting completely through the tomato skin is no longer a battle. But I did immediately cut myself on it while attempting to clean it straight out of the box (and as noted by others, it seems to handle differently than other knives). There was a slight blemish in the blade but at this price I'm not returning it. The stainless steel seems to be somewhat rougher than our other knives so we'll see how it lasts.",
      "rating": 5.0,
      "verified": true,
      "author": "Powaymom",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "Perfect for Cakes and Sandwich Loaves",
      "text": "I was looking for a bread knife that could cut thin slices of sandwich bread, and cake. This knife meets my needs, it is quite flexible so if you mean to buy this for thick-crusted Artisian loaves I would look elsewhere. Cuts thin layers for cake like a dream, and very very SHARP. I have nicked myself multiple times on this with very little pressure. I hand wash and dry it right away so I have no issues with staining. It does not come with a sleeve, I keep it in my knife block.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Serious Eats was right",
      "text": "I read the article on Serious Eats rating affordable bread knives. This one was rated the best, and it =is=! It easily slices bread fresh from the oven, as smoothly as yesterday's loaves, and even very hard stale bread. The wooden handle doesn't have a full tang, but the wood itself is silky, and the attachment firm. Just one warning. It is =very= sharp. I managed to cut my finger having just pressed it against the blade, not even having moved either.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Worthington",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Just buy it!",
      "text": "Was sick and tired of smashing my bread when slicing it, even when using \"bread knives\" Looked around and wanted specifically a japanese style knife to match my other knives and this one had great reviews. For the money it has been a great value to our kitchen. My wife whose usually weary about more and more kitchen stuff was in love when she used it. It cuts through bread like butter and i have no complaints at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Duke Tran",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Seriously, Buy It.",
      "text": "This is RAZOR sharp. No joke, the sharpest knife I own. It cuts bread with almost zero effort, and the wood handle is charming and beautiful. It's my favorite knife I own. I bake bread with a very chewy but hard crust, and I have struggled with other lesser bread-knives in attempting to cut it. This knife is a dream, so much so that I'm sure someday I'm going to probably cut off the tip of one of my fingers because it's so sharp.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Draz",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Best bread knife I have ever owned!",
      "text": "Knives are one kitchen item that I spend extra money on to make cooking easier. I have a few great sets that I planned to use forever. Several knives disappear each time one of my kids moves out. I complained about my bread knife being gone so someone ordered this knife for me. I absolutely love it! This puts my old favorite to shame! Best bread knife I have ever owned. I will get this brand to replace the other knives that found homes elsewhere. May even get a complete set for myself and give the others to the kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Bunco Queen of the Universe",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Best Bread Slicer",
      "text": "Bought this because of a comparative review of 10 bread slicking alternatives. This is really good. Baked bread for many years and this is the best slicing device I have had (including electric) in that time. Fine for soft bread and for harder items like bagels. If this one goes south I am buying another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Karl C. Kaukis",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Good product and well pleased with it.",
      "text": "Much better quality than i expected for the price. The blade is exactly what it should be and will slice very thin and not hardly leave a crumb. I actually made one eighth inch thick slices through a six inch high loaf of banana bread just to see if i could and they were perfect. As for the handle it is polished to perfection and very good hand feel, if anyone is serious about a good bread knife the one will work.",
      "rating": 5.0,
      "verified": true,
      "author": "Wilburn C. Herron",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Super sharp awesome knife!",
      "text": "Great knife! I seen some reviews about this knife that weren't favorably. I totally disagree.This is a super sharp knife with a pretty decent handle.I guess I cant say how it works on bread but I use it for everything else.in my opinion it is a well built knife and I have never seen a serrated knife as sharp.use every day.this is the 3rd one I've purchased.i have a bad habit of losing them.highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike b",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "cuts bread as if it is butter",
      "text": "tried out my bread knife for the first time yesterday and it worked great. It sliced my sourdough wheat bread with a hard crust into a nice thin piece. It sliced through it smoothly and easily. The blade was solid and did not flex enough to notice. I thought for the price it is a bargain and would recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Dale",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Tojiro Bread Slicer 235mm F-737",
      "text": "My wife wanted this knife, so I ordered it. It was suppose to be for cutting bread. It does the job without a doubt. It is very sharp, and cuts through warm bread with ease. My wife just loves this knife. if we needed another I wouldn't hesitate to purchase another one. Quick delivery also.",
      "rating": 5.0,
      "verified": true,
      "author": "Bumpsie Bob",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Bread-Slicing Perfection!",
      "text": "I own 3 serrated knives, this one was specifically purchased to cut homemade bread into sandwich-sized slices. This blade is superb for this task! It is very light weight, but solid enough in the hand that you can guide the slicing with your index finger on top of the blade. The blade cuts very easily into delicate bread- so well that there are hardly any crumbs created as waste. Can’t attest to durability as I’ve only had it a few weeks.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua R.",
      "helpful_votes": 2,
      "publication_date": 20190226
    },
    {
      "title": "Highly Recommended!",
      "text": "This is my new favorite knife! It is phenomenal. I have used it to easily and evenly cut a cake layer for a Boston cream pie, ripe heirloom tomatoes, and even pre-sliced artisan bread where I wanted thinner slices. It's lightweight, well-balanced, and sturdy. It works accurately and perfectly is every case. Wish I'd had this years ago. I think it's a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "carpsmarsh",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Super cheap",
      "text": "This knife is very thin and cheaply made. The handle is cheap as well. I was surprised from the other reviews and the price which is high for such a cheaply made product. I would have returned it except it came in so much plastic that I had to cut it out of the packaging.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Best bread knife currently available",
      "text": "I bake breads. Most have a hard crust and moderate to firm crumb. My old bread knife (a Wusthoff) was no longer cutting it (pun intended) so I searched for an alternative. This knife is both outstanding and inexpensive. It cuts the crust easily and cuts the crumb without taring or crushing. Since I've had it only a month I've no idea for how long it will last, but believe it will be functional for years. Hand wash and store it in a knife block.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich Shepard",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "great knife for homemade sourdough",
      "text": "The knife is a great value. I use it everyday on home made sourdough and it allows for thin slices. I have only had it for a week but so far am loving this knife. I bought a higher priced one last year and it mangled my bread. I will update in a couple of months. Update: I use it still everyday. Super sharp, Cuts so well. Allows for very thin slices.",
      "rating": 5.0,
      "verified": true,
      "author": "Marysland",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "... the recommendation of Serious Eats in their review of best bread slicers - this was identified as the best ...",
      "text": "Got this based on the recommendation of Serious Eats in their review of best bread slicers - this was identified as the best affordable option. Before then I was using an old Hampton Forge bread slicer for my bread machine sandwich bread, which tore the slices up a lot if I wasn't careful. From the very first slice, I felt justified in upgrading - What a difference! This is an awesome bread knife and very worth purchasing if you slice bread every day like I do.",
      "rating": 5.0,
      "verified": true,
      "author": "Trevor",
      "helpful_votes": 2,
      "publication_date": 20170515
    },
    {
      "title": "Awesome bread knife",
      "text": "I saw some concerns about how thin the blade is- it isn't a problem! It helps that it is as thin as possible, less drag. I cut coissants, hearty sourdough and this slicer is a dream. It competes very well with the $80 French bread slicer my wife gifted me.. for just $20! Amazing value, highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce Taylor",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "sharp",
      "text": "I bought the Tojiro Bread Sliver for myself almost 3 years ago. I love it. I have a friend that makes bread EVERY DAY. When I'm slicing hers with her breadknife, I struggle. I ordered this one for her. She can't rave enough about it. Don't hesitate to buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ginny E",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Great little serrated blade",
      "text": "Let's be honest, this is not a high end knife, but it is perfect for bread, salmon, or almost any serrated blade need; and for the price, when it starts to loose the edge, you can buy another (and keep doing this for quite a while before equalling the price of German steel. By the way, I've had this one for almost 18 months and it's still going strong. (Don't throw it in the dishwasher like by neighbor did--handwash ONLY).",
      "rating": 5.0,
      "verified": true,
      "author": "John Pittman",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Great knife for purpose. Even better price point.",
      "text": "I bought this because it was rated highest on F&W or Epicurious or such, and because it is cheap. Better than described. Super sharp and the flexible blade is very forgiving. Not sure how long it will retain it’s incredible edge (summer and gorgeous tomatoes vie with the French bread) but, a good solid buy. Note: the blade is SHARP!",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph A O'Reilly",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "great price for a great knife",
      "text": "great price for a great knife. Nice flexibility, but still rigid enough to cut a thin slice of bread. Would buy again,",
      "rating": 5.0,
      "verified": true,
      "author": "greg",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Wow this is a really nice knife",
      "text": "Wow this is a really nice knife. It is thin and light and it cuts through the bread like butter. The length is prefect and there is absolutely no bending problem even while cutting hard breads like French or sourdough.",
      "rating": 5.0,
      "verified": true,
      "author": "innagaddavida",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "still WOW sharp, 3 years after buying",
      "text": "I bought this February 2017. After cutting myself with it I learned to respect its razor sharpness. I have only used this on baked goods. I'm still super careful using it because it's still super Sharp.",
      "rating": 5.0,
      "verified": true,
      "author": "StanHH in NorCal",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "CUTS ALL THE BREADS",
      "text": "I was using an old bread knife to cut my sourdough breads and it was a disaster. Could not get straight cuts, hard to cut through the crust. Found this knife through seriouseats review. And wow..what a difference when using this knife. This knife is super sharp and will cut through the crustiest breads you can throw at it. Only thing I wish was better is the thickness of the knife. B/c the thickness, its easy for the blade to wobble. Other than that, id buy another one anytime.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Young",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Sharp as hell! Careful!",
      "text": "After years of dealing with the dullest kitchen knives ever made, I ordered this. Sadly, out of habit, I was not using the proper amount of caution and sliced the palm of my hand pretty badly. This thing is razor sharp! Obviously, that is a good quality in a knife, so all things considered, I highly recommend it. Just keep out of reach of kids and idiots like me.",
      "rating": 5.0,
      "verified": true,
      "author": "Self-Made Model",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "A very good bread knife",
      "text": "I am primarily using it to cut homemade bread. At this time I've only used it on 2 loaves and it cuts the bread perfectly. I would have no problem as in gifting it to a friend or family member. A previous review indicated that it did not come with a sheath which for me is not a a big problem. A great knife for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "RB",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Best Bread Knife EVER!!!",
      "text": "This is the BEST bread slicer I've ever used!!! I needed one with a sharp long blade, and this is perfect! There is no \"sawing\" and squashing the bread. It slices easily and cleanly - even through a \"crusty\" loaf. Do not hesitate to purchase the Tojiro Bread Slicer! You will not be disappointed. The vendor has contacted me to make certain I was happy with my purchase, and you can bet I'll be buying from Tojiro again!",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline",
      "helpful_votes": 0,
      "publication_date": 20171208
    },
    {
      "title": "GREAT bread knife!",
      "text": "Aside from it being extremely sharp, this is a great bread knife. Just be careful and keep your thumbs out of the way. Great for bread, cake, muffins, and bagels. Beware of your fingers!",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn ArmstrongTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Not worth it",
      "text": "Really disappointed by the lack of sharpness. I purchased this as a replacement to my well-loved victorinox, hoping that this knife would demonstrate how dull that knife had become. That's not what happened. I'm sorry I threw out my old knife. I'm unsure if this knife arrived unsharp or became unsharp after only a few days of use, but in any case, a week in, it's dull. If you look at the attached picture, you can see the light refracting off the jagged edge of the blade. Blerg.",
      "rating": 2.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "incredible",
      "text": "I've never had a bread knife cut like this. Insanely sharp (I have cut myself multiple times very easily, be careful!). It does flex like others mention with harder substances, but it actually doesn't effect the cuts which are quite sharp. I didn't think a bread knife could vary very much but in general I stick to Japanese knives for quality and craftsmanship and these are excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "tnhg",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Really impressed",
      "text": "Wow. I didn’t really expect this to make a difference because I have owned my share of bread knives, but this knife is incredible. It cuts through really hard crusty bread like butter. I really didn’t believe it until I experienced it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kagome",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Review",
      "text": "Omg this bread Knife is wonderful and very useful. When I first order it I thought that the quality was going to be horrible and it turned out to be great, easy to cut through without any mess! I love the Japanese writing on the knife to.",
      "rating": 5.0,
      "verified": true,
      "author": "Lovely ❤️",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Great bread knife at a great price",
      "text": "Great buy. Good for just any kind of bread - crusty, soft, whatever. The precision of the cuts is great, much better than some cheap bread knife. Beware that the knife is quite sharp, sharper than you'd expect from a bread knife.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew G.",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Great bargain",
      "text": "Pretty well-made bread knife. Seems to be well designed and thought out. The blade is slim and supersharp and the number of serrations is perfect. Keep it out of the dishwasher and it should last for a bit. The blade is where the money is, the handle is pretty standard wood. For what I paid, I am very happy and can recommend this knife. Cute Japanese writing on the box too.",
      "rating": 5.0,
      "verified": true,
      "author": "Camilo",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Very sharp. Easy to slice as thin as you want.",
      "text": "Love it! I read many reviews and decided to buy this bread knife to my friend as a gift. He love it, said it's very sharp and easy to slice. So I bought another one for myself as well to replace my old bread knife. OMG! This one is amazing. If I didn't buy this one, I will never know my old one is that terrible to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Elsie9595",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Excellent bread knife",
      "text": "This is the very best bread knife I have found. Excellent product! Excellent! The blade is long so cutting a large round loaf of bread is easy. The blade is very sharp. The wooden handle is smooth yet easy to maintain a nice grip. This is a wonderful bread knife.",
      "rating": 5.0,
      "verified": true,
      "author": "TomL",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "This knife was great, I was able to cut consistent slices w/o ...",
      "text": "As others have warned, extremely sharp. I was careless putting it away and you can add me to the list of people who've cut themselves on this knife. We buy bread from our local bakery. Hard crusted soft middle rosemary loaves. Past bread knives have sort of crushed the loaves when slicing. This knife was great, I was able to cut consistent slices w/o the bread becoming misshapen.",
      "rating": 5.0,
      "verified": true,
      "author": "jason",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Great value for the money.",
      "text": "Thinner knives make better bread knives. It's physics. If you have a thick bread knife the kerf is much wider and will tear out more bread. this knife is super thin and flexible which makes a great cut in the bread hardly making any crumbs at all when cutting.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Staples",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "This is a fantastic knife. I needed a bread knife for my ...",
      "text": "This is a fantastic knife. I needed a bread knife for my collection and did my research before settling on this one. I couldn't be happier with the quality of this knife. It cuts effortlessly through bread, tomatoes, or anything with a tough exterior and soft interior. For the price, you cannot go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "Connor",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "much better than my nice german bread knives, wish they would make a longer one for huge rye loaves",
      "text": "best bread knife ive ever used it is like beyond scalpel level sharp. cutting butter is hard compared to this slicing bread and for 17 bucks i couldnt believe what i had gotten. i heard tojiro was good but wow this is the real deal. blade has mirror polish and handle feels comfy and looks good. these would make very very good gifts.",
      "rating": 5.0,
      "verified": true,
      "author": "LiliVale",
      "helpful_votes": 0,
      "publication_date": 20170615
    },
    {
      "title": "Blade's too thin",
      "text": "First impression is that the knife is wicked sharp with good teeth. But the blade is quite thin, causing it to bend easily. This makes it tends to \"wander\" through a large loaf of bread, making the slice go off square.",
      "rating": 3.0,
      "verified": true,
      "author": "kagy",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Amazing knife",
      "text": "It’s a thinner blade than I had with my old bread knife, but cuts 100x better. I love good knives (I have several Shuns, a Global, etc), so I was skeptical about a “cheap” knife performing well...but this one is great!",
      "rating": 5.0,
      "verified": true,
      "author": "N. Kamenetsky",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Superb knife. Mega sharp, looks awesome",
      "text": "Best knife I've ever owned. Makes cutting my home cooked bread a breeze. It looks great - I even feel like I should give a little bow before I use it. It sliced through some bagels so fast it caught me buy surprise and nearly took the top of my finger off...so use carefully!",
      "rating": 5.0,
      "verified": true,
      "author": "the penguin & owl",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "Best bread knife I have owned",
      "text": "Sharp, and only have had to sharpen once. Cuts easily and cleanly through whole grain bread. Not to mention a great value for the. cost!",
      "rating": 5.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Well worth it - best knife ever!",
      "text": "This is the best bread knife I’ve ever had. It’s not fancy looking but will probably last as long as a knife 5x’s as much. It cut bread like it does in a store’s slicing machines. So glad I got it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sewbeams",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Best bread knife I've ever used",
      "text": "A terrific value for 20 bucks. Stiff backbone and minimal blade-flex to slice through those crusty breads but not so heavy to make it cumbersome. Very sharp blade, easy cutting -- typical Japanese workmanship.",
      "rating": 5.0,
      "verified": true,
      "author": "RichfromRoch",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "bread sword",
      "text": "this is a great slicer. however, it is unwieldy. it has some flex, so its not like a regular knife which is normally stiff. this is very sharp and will cut through the hardest bread, especially if you learn how to use it. i definitely recommend this for any fan of bread slicing, especially for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "osapientia",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Very good bread knife!",
      "text": "This is a great knife for cutting bread. It is 10 inches in length making it perfect for any bread slicer. (I really like the Presto bread slicer) Be careful though, the knife is very sharp.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick A.",
      "helpful_votes": 4,
      "publication_date": 20170516
    },
    {
      "title": "DO NOT BUY!!",
      "text": "so insanely sharp I have sliced myself very badly each time \"I've used it. I HATE it!",
      "rating": 1.0,
      "verified": true,
      "author": "Kreviewer",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Sharp!",
      "text": "Was looking for a sharper bread knife. Yikes, this one is so sharp that I cut my hand multiple times while I was trying to apply decorative embellishments to the handle. But that was my fault. I’m happy that it is sharp and hope it will stay sharp for a while.",
      "rating": 5.0,
      "verified": true,
      "author": "mom3",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "The best bread knife period",
      "text": "Incredible sharpness and craftsmanship. This knife is made with materials that knives well over $100 are made with, and it will out perform them all. I'm not sure why Tojiro keeps these at this price point, but I'm glad they do.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Butler",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Great knife, highly recommend",
      "text": "After several previous unsuccessful attempts to find a good, reasonably priced bread knife I've finally found it in this knife! Cuts bread and bagels very easily without having to 'saw' through. Light weight but still substantial enough that it doesn't feel flimsy. Easy to grip and easy to clean. Have only had it a little while but hopefully it will stay as sharp. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Becker",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "This is a great knife!",
      "text": "Amazingly sharp out of the box. Easily cuts the thinnest slices of bread. Best bread knife for the price, a serious bargain.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Woodcock",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Exceeds expectations",
      "text": "Fantastically sharp bread knife that peels off thin slices effortlessly. Came very sharp, left gentle scores on my cutting board which surprised and impressed me. Never thought I'd be so excited to slice bread.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Rollock",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "I never thought bred knives could be good. I thought they were all the same",
      "text": "I never thought bred knives could be good. I thought they were all the same. Get this knife and your bread will feel like butter. I have compared this bread knife to another from some standard target brand. It is night and day difference in sharpness. Very worth it. Also I personally love the wooden handle.",
      "rating": 5.0,
      "verified": true,
      "author": "Masaki",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "Best bread knife ever!",
      "text": "Sharp, substantial, lightweight--this knife is definitely worth more than the price charged!",
      "rating": 5.0,
      "verified": true,
      "author": "mollycm",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "AWESOME KNIFE 4 AWESOME PRICE",
      "text": "PARCIVAL doesn’t know what they are talking about. This is a incredible knife that I use weekly. It’s amazingly sharp and slices through bread and anything else like butter. They are thin and light weight for a reason. I buy these as gifts for friends that cook. They are that awesome especially for the price. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Synko",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Do not buy",
      "text": "This a very low quality, flimsy knife (it is sharp, however). I wish I had trusted the other negative reviews already posted.",
      "rating": 1.0,
      "verified": true,
      "author": "NF",
      "helpful_votes": 2,
      "publication_date": 20191106
    },
    {
      "title": "Cut halfway through my index finger",
      "text": "I was cutting through (almost) stale bread and didn't realize I needed to apply far less pressure to cut through with this knife than with my old, dull bread knife. I subsequently cut halfway through my left index finger due to finger misplacement (user error). 5/5 for the knife as I've had it for 6 months now - still cuts through bread as if it were butter. Great for porchetta and roasts as well. I have not cut myself again but will update this review should it happen once more.",
      "rating": 5.0,
      "verified": true,
      "author": "Leonardo ",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "I didn't know I needed this until I tried it!",
      "text": "This is definitely the best bread knife I've ever used, even compared to my Wusthof bread knife. The length of this allows me to get through a large loaf of crusty bread with ease. It works beautifully, especially for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "CMB",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Excellent, and I'm a knife guy",
      "text": "I like this knife so much I just bought another Tojiro. It's a little long for what I use it for, but the steel quality is excellent. It goes though the crustiest, toughest bread like a chainsaw. It's a pleasure to use. I like products that exude quality and this one does that.",
      "rating": 5.0,
      "verified": true,
      "author": "dave",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Excellent Bread Knife",
      "text": "It's lightweight, very sharp, and slices freshly-baked bread beautifully. I am very happy with it and plan on searching for other Tojiro brand knives.",
      "rating": 5.0,
      "verified": true,
      "author": "T'Pau",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Perfect",
      "text": "I've been using this for a year now, and it is simply the best bread knife I've ever used. Perfect size, has stayed razor sharp (bread doesn't really dull knives too much), and cuts through even hard sourdough crusts easily. For the price (or more), I don't think you can beat it.",
      "rating": 5.0,
      "verified": true,
      "author": "Garrett",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Decent knife",
      "text": "Bought for slicing home made bread. Works well, blade is nice and sharp, will see how it holds up over time. Handle is comfortable and knife is nicely weighted.",
      "rating": 5.0,
      "verified": true,
      "author": "A. L.",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Excellent knife",
      "text": "Had this knife for a year. Very sharp-excellent at slicing not only bread but also tomatoes and melons. So far continues to be sharp. I wish it was a little bit shorter for better maneuvering. Excellent product.",
      "rating": 5.0,
      "verified": true,
      "author": "NarNar",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Blade Too Flexible",
      "text": "OK for soft breads. Blade is too thin and flexible for breads with a thick crust.",
      "rating": 3.0,
      "verified": true,
      "author": "PrimeBuyer",
      "helpful_votes": 2,
      "publication_date": 20180421
    },
    {
      "title": "Life changing bread knife!",
      "text": "I never leave reviews, but this bread knife was so impressive I felt obligated to do so! It’s absolutely amazing! It leaves no mess and just slice through any bread, soft or hard crust like butter! I can’t wait to cut more bread!! Get it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Super-sharp!",
      "text": "I’m so far very happy with my purchase. I make my own bread and it has a fine crust. This knife makes it easy, so far, to cut accurate, thin slices when required. Of course, it remains to be seen how long the edge will last, but at this price it’s already a deal.",
      "rating": 5.0,
      "verified": true,
      "author": "DC",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Very Good Knife, But all details in Japanese.",
      "text": "This is an excellent bread knife. I have only one complaint: all the directions for care, etc. are in Japanese!",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20170529
    },
    {
      "title": "This knife is everything I was hoping for and more!",
      "text": "This knife has changed my life. I want to eat more bread just so I can use it. I bake Tartine style rustic sourdough and this knife slices though so softly and with no effort at all. Cutting through the loaf is a joy and I can cut thin slices even less that 1/2\"! As other reviewers noted, why did I wait so long to get a good bread knife? If you've been smashing your bread down, and turning it on it's side to tear through it with what you think is a bread knife, do yourself a favor and get this knife. The wooden handle is also quite pretty. It is classic and simple - great quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea Mosher",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Awesome Bread Knife!",
      "text": "I needed a long bread knife to cut through homemade round loaves of my dutch oven sourdough bread. This knife is COMPLETELY AWESOME. Super sharp and slices through a hard crust perfectly without smashing the bread. Totally affordable too. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "KP",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Probably the BEST bread knife for its price",
      "text": "Have used for more than one year, worked perfectly. The cutting is sooo smooth. Every friend of mine who used the knife wants to buy one lol. And a perfect gift for who like to bake.",
      "rating": 5.0,
      "verified": true,
      "author": "TONG",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Great knife",
      "text": "Great knife. Exceeded expectations. Use it mainly to cut large loaves of sourdough bread. Also plan to use it to slice roast beef. Am not sure how long it will retain it’s sharp edge but for the price, if it lasts more than a year before it needs sharpening, I’ll be happy. Since it is made in Japan, the angle of the blade edge will in all probability be different than American and European knives.",
      "rating": 5.0,
      "verified": true,
      "author": "warren harris",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Very sharp",
      "text": "Knife is incredibly sharp and well made. You can definitely pay more, but why? This knife will work perfectly for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Deedub",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "High quality, perfect utility and inexpensive price!",
      "text": "As a knife aficionado, when a friend showed me his and told me its cost, I was amazed. This is Japanese, perfectly made, and unbelievably inexpensive. Japanese knife and cutting tool technology is probably the best in the world, and if you want to slice bread effortlessly and precisely, you'll love this tool!",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Leaf",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Rusted almost immediately",
      "text": "Really liked the knife. Worked well, after using we'd wash and wipe dry, then set on a drying rack. After 2 uses small rust spots started showing up on the knife.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Quality blade made from Japanese steel",
      "text": "There are literally hundreds of bread knives to choose from on Amazon. And to be honest most of them will do the job. But, I was surprised at how sharp this one is and how easily it cuts even the thinnest slices. Some might say the handle is a bit small for a man's hand. But, I think it's fine.",
      "rating": 5.0,
      "verified": true,
      "author": "BEN",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "Excellent knife at a super price.",
      "text": "Cuts very nicely. Be aware, though, since the blade edge is single sided the knife will tend to move to the left as a cut is made. This is typical of single beveled edges and is easily compensated.",
      "rating": 5.0,
      "verified": true,
      "author": "KitchenCutter",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "So good for cutting bread",
      "text": "I went way too long without a good bread knife. Do not make the same mistake as me, get a good bread knife. A good redneck that is good for getting bread.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Wayland",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Sharp and serves its intended purpose",
      "text": "Wife cut herself on the first use because she was too used to the dull loaf smasher we were using before. So watch out. Durability has been good in a few months of use. Price is such that i would consider buying another one vs trying to sharpen it.",
      "rating": 5.0,
      "verified": true,
      "author": "chunkybeefstyle",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Highly Suggested, Amazing for Cutting Bread",
      "text": "Can’t beat it for the price. Cuts easily through even the crustiest of bread with hardly any crumbs and no squishing, even on hot bread.",
      "rating": 5.0,
      "verified": true,
      "author": "Steph",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "High quality steel",
      "text": "Very sharp knife, excellent steel. Handle is nothing special but is comfortable and finished well. No downside, great value.",
      "rating": 5.0,
      "verified": true,
      "author": "FryeFan",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Sharp Bread Knife.",
      "text": "Sharp. Swift. Sure. A fine serrated knife. Makes short work of my weekly breakfast bread.",
      "rating": 4.0,
      "verified": true,
      "author": "B. C Ladd",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Great affordable bread knife.",
      "text": "I like good quality knives (made in Japan) for my kitchen. But I didn't think a super expensive bread knife was as important to me. Then, I found this knife. It is awesome. I would easily buy it again, if anything ever happened to the one I own.",
      "rating": 5.0,
      "verified": true,
      "author": "HS1234",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Beautiful and Practical Serrated Knife",
      "text": "This is a great addition to any kitchen. Effortlessly cut bread, tomatoes, large pieces of meat, and anything else where a serrated knife is preferred. Very good length so you can saw through large loaves or roasts. And the thin blade allows you to cut paper-thin slices without crushing what you're cutting. Just watch your fingers!",
      "rating": 5.0,
      "verified": true,
      "author": "G. Factory",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "Very capable bread knife",
      "text": "Though thinner than our other bread knives, it is much sharper and of a high quality steel. Very good knife for the price and I have been happy with my other Tojiro knives.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharry",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Wow. Great knife great price.",
      "text": "Wow. I had no idea how sharp this knife is! Used it on a bagel. It sliced through it with almost no pressure from me. Can't wait to use it on the artisan bread I purchase which is very dense with thick crusts. Such a great knife and great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of Twins",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "great craftsmanship",
      "text": "Very sharp bread knife, serrated edges perfect for even the thickest artisanal crust breads, and yet flexible enough for soft breads. Only caveat is that since it has more flexibility, this can’t be used for slicing melons and hard-rinded fruit (which it isn’t advertised for obviously, but just keep that in mind if you had previously used a bread knife that doubled as a watermelon knife). Highly recommend as a beautiful well-crafted bread knife.",
      "rating": 5.0,
      "verified": true,
      "author": "Janine L.",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Excellent knife, excellent price!",
      "text": "I love this bread knife! I had a cheap bread knife that wouldn’t cut through my rustic homemade bread so I ordered the Tojiro bread slicer after reading the comments. This knife is amazing! It cuts through the bread effortlessly like butter, even through the crispy hard crust. I would highly recommend this knife. Excellent for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Bethany",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Better than expected!",
      "text": "Easily slices through bread like it is butter! I have some more expensive ones that just don't cut it!!",
      "rating": 5.0,
      "verified": true,
      "author": "John Sappington",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "I bake bread and this is the best bread knife ever",
      "text": "I bake bread and this is the best bread knife ever. It has a longer than usual blade which makes it easy to slice round loaves. The knife is much sharper than any other bread knife I have owned so store it safely. No more sawing. Slices smooth. Wouldn't buy any other bread knife.",
      "rating": 5.0,
      "verified": true,
      "author": "Smartshopper",
      "helpful_votes": 0,
      "publication_date": 20161209
    }
  ],
  "product_meta": {
    "title": "Tojiro Bread Slicer 235mm F-737",
    "description": "TOJIRO High-Carbon Stainless Steel Bread Slicer 235mm Anti-rust stainless steel blade and natural wood handle, it is simple but offers you a clean cut without deforming bread. Anti-rust does not mean it would not rust. Do not put it in dishwasher. Hand washes with mild detergent, rinse, and drying recommended for the longest life of your blade. Improper care might result in rust on the blade.",
    "rating": 4.8,
    "feature_bullets": [
      "High-Carbon Stainless Steel Blade",
      "Natural Wood Handle",
      "Serrated Edge",
      "110 gr",
      "9.25\" blade - 14.75\" overall length"
    ],
    "specifications": {
      "Product Dimensions": "14.75 x 1 x 0.7 inches",
      "Item Weight": "3.84 ounces",
      "Manufacturer": "Tojiro",
      "ASIN": "B001TPA816",
      "Item model number": "F-737",
      "Customer Reviews": "4.8 out of 5 stars949 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#4,731 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "July 19, 2013"
    },
    "categories": [
      "Home & Kitchen",
      "Bread Knives",
      "Cutlery & Knife Accessories",
      "Kitchen & Dining"
    ],
    "price": 23.8
  }
}