{
  "website_summaries": [
    {
      "verdict": "Customers looking for an orthopedic memory foam dog bed will find their match in this popular model.",
      "pros": [
        "Built with a waterproof liner and comes with two external covers",
        "Made with highest-quality materials for dog's supreme comfort",
        "Machine-washable covers"
      ],
      "cons": [
        "Material does not last with dogs who like to chew",
        "Sinks a little too low for some dogs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Better than a human-grade mattress with conforming therapeutic comfort.",
      "pros": [
        "Comes with three removable covers",
        "1 waterproof liner, 1 denim cover, 1 suede cover with non-skid dots on bottom",
        "Has cool sleeping surface, less allergens and motion escalation for restful sleep"
      ],
      "cons": [
        "Zipper tab not durable, tears easily",
        "Odd smell lingers even after several washings",
        "Foam mattress may not be thick  enough for heavier dogs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Dog ripped the \"durable denim\" within 3 mins other dog did it in 5 mins.",
      "text": "I bought two of these beds for around $90 a piece and my dog ripped the \"durable denim\" within 3 mins while the other dog did it in 5 mins. This was with minimal effort as well. They were not chewing on it first or anything they just looked at it bit down and pulled up and it ripped. The fabric is one of the thinnest fabrics I have seen while still being called \"denim\". The only thing really nice about this bed is the foam, but I would just recommend buying the foam and making your own since that Is what I have to do now. Using proper 1050 ballistic nylon.",
      "rating": 1.0,
      "verified": true,
      "author": "Phara0h",
      "helpful_votes": 34,
      "publication_date": 20180916
    },
    {
      "title": "Fourteen Year Old Sick Dog Destroyed this Bed In 12 Days",
      "text": "I bought this dog bed for my sick fourteen year old dog on my sister's recommendation. It seemed nice. I liked the multiple covers and it fit the crate perfectly. It was delivered on December 5. Clark, my dog, seemed to like it. He has been extremely ill and the vet was not hopeful. Apparently he is feeling better because today he ripped the denim cover and the waterproof cover. It is not chewed, just ripped straight with the grain of the fabric.",
      "rating": 1.0,
      "verified": true,
      "author": "mzloolue",
      "helpful_votes": 3,
      "publication_date": 20191217
    },
    {
      "title": "Not Waterproof",
      "text": "The description of this bed is misleading. The internal liner is NOT waterproof as they state in the description. If you have an older dog that needs a great orthopedic memory foam bed and that has problem with bladder this is NOT the right bed for you. I bought 3 beds so far for my 2 dogs and I've had the same issue this bed. The bed also holds the smell of the dog (sweat) and its hard to remove it since the liner doesn't protect the foam.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20190317
    },
    {
      "title": "5 years and still looks brand new.  This bed is perfection-and lasts!",
      "text": "I bought this bed in 2013 for our 2 senior shepherds (Australian and German). It was easy on their aches and pains from hip issues, and they used it daily. It's now 2018 and STILL hasn't developed a \"dent\" after all these years. Looks just like a new bed-still giving that soft but firm \"tempurpedic-type\" comfort our babies love. Our shepherds have since passed and now its our lab mix's fav spot. The covers that come w/bed have protected it and kept it clean and odor free. I've ordered new denim covers, but the foam bed remains perfection. Will never buy another brand. If you want proper support for your pets-this is it.",
      "rating": 5.0,
      "verified": true,
      "author": "cathyb",
      "helpful_votes": 2,
      "publication_date": 20180221
    },
    {
      "title": "Poor quality and worse costumer service",
      "text": "I purchased this as a Christmas gift. Started using it at the beginning of the new year and the low quality zipper broke and the dog got to the foam. I contacted the seller and basically they said I was outside their “30day” warranty period. Pretty disappointing experience all around and waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "2new2nikon",
      "helpful_votes": 5,
      "publication_date": 20190217
    },
    {
      "title": "Comfort and Style endorse by Max",
      "text": "Hi, this is Max an Norwegian Elkhound, my folks just bought me this awesome bed. Talk about comfort. It's amazing that I can sleep all day and it doesn't lose its shape. My other friends, that were home from college tell me that this is more comfortable than their memory foam topper they have in their dorm. I had to pull them off of my new memory foam bed, because it was so comfortable. Support small business and it's Made in USA! You can't go wrong with that. Max approves this review. Woof, woof.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunshine🌞",
      "helpful_votes": 4,
      "publication_date": 20180204
    },
    {
      "title": "Happy repeat customer. Love this! Perfect for huge dogs!!",
      "text": "Love this! Bought one from y'all 7-10 years ago. It is still in perfect condition regardless of the hundreds of pounds worth of use throughout the years) This new one is perfect also! This one seems to shape up faster than the older one. And the longer zipper made it easier. As always, FIVE STARS all the way with this product and seller! Little Miss Meg the Olde English bulldog has claimed this bed from the get go. Mr Rocky, the Presa Canario, will just have to use the old bed ) First pic with 2 dogs, old bed. Second pic new bed. We highly recommend this bed!",
      "rating": 5.0,
      "verified": true,
      "author": "rangergirl10",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Easily destroyed",
      "text": "I thought this looked like a very good bed with a lot of support when I unpacked it . My dog, however, found it a bit thick and unpleasant to stand on. He is large and heavy but not obese. He gets stiff overnight and seemed to have difficulties getting up off it in the morning. He chewed through the cover and shredded the foam overnight within a week or so. The largest size contains a lot of foam to strew around a room....... oh well, live and learn.",
      "rating": 2.0,
      "verified": true,
      "author": "AmisTop Contributor: Knitting",
      "helpful_votes": 2,
      "publication_date": 20191024
    },
    {
      "title": "Wonderful Strong Sturdy Comfortable",
      "text": "Fantastic!!!! I buy only these beds after being tired of throwing money away on lesser beds. These last a long long time. The inside cover makes it even better. I just unzip the outside cover, remove it and wash it. A good vacuuming keeps it tidy otherwise. I have purchased them for all my dogs over the years. English Mastiff, Great Dane, Boxer, English Bulldog, Labrador. Even my cats try to take over and claim the beds but that doesn't go over well.",
      "rating": 5.0,
      "verified": true,
      "author": "Adder Trampler",
      "helpful_votes": 8,
      "publication_date": 20160919
    },
    {
      "title": "Poor quality didnt last 1 week.",
      "text": "I got two of these beds for my dogs and both had holes inside a week and tears in less than 10 days. I got longer use out of 20 dollar beds from tjmaxx.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason M.",
      "helpful_votes": 6,
      "publication_date": 20181119
    },
    {
      "title": "Not Durable",
      "text": "Dog ripped this to shreds in less than 24 hours. He loved sleeping on it and slept wonderfully the first night. By the time we got home from work the following day it was shredded all of the way through. I Do Not Recommend For Safety Reasons.",
      "rating": 1.0,
      "verified": true,
      "author": "Unhappy",
      "helpful_votes": 8,
      "publication_date": 20180806
    },
    {
      "title": "Tried to save our dog",
      "text": "Our dog was diagnosed with cancer on the spinal column. She had very limited mobility when we got her back from TX A&M, after surgery. She already had pressure sores. I had this bed overnighted and she spent the majority of her time on it. We still would rotate her around about every 4 hours and the sores were healing. Unfortunately the cancer raged back and we had to put her down. Our other dogs now share the bed. The covers are easily washable.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Margoscin",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Not durable at all",
      "text": "I recently bought the Tempurpedic dog bed with denim cover and within 15 minutes my non-aggressive chewing dog got right through the denim cover. This was a result of her using her paw to move her blanket around, which resulted in the cover tearing and the internal foam tearing from there. I am extremely disappointed, as we were really looking forward to using this product but it didn't even last one day. It's now torn to pieces and useless. The denim cover cannot withstand andy abuse whatsoever. Even if her paw didn't get through it I can't imagine it would have held up long. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "nelly",
      "helpful_votes": 3,
      "publication_date": 20190718
    },
    {
      "title": "best dog bed we've ever had!",
      "text": "Oh I'm hoping there is some kind of discount for multiple beds because straight out of the box, I've got three fighting over the one that just arrived. The foam feels at least as nice as what I've got on my own bed, and the denim cover seems to be very high quality. My only hope is that it will survive the Phoenix heat because these are intended to be the outdoor dog beds, and I wanted the waterproof liner to help with wet dogs who have just gone swimming. Of course, if there's a bulk-discount, I might be convinced to get these for indoors as well as they are just so nice looking!",
      "rating": 5.0,
      "verified": true,
      "author": "math-terpieces",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "BEST BED BY FAR & worth the little extra vs cheapo ones",
      "text": "I love that it is a large piece of memory foam. It’s like a tempurpedic (spelling?) for my old Dane. He doesn’t chew so I rated it a 3 star, an aggressive dog could shred it but it is stronger than most beds no matter. The denim cover is great. I actually used the waterproof one then the soft one and finally the denim as beds fall apart under his weight and scratching his spot. I wish I had found this 4-5 beds ago. Hope they sell replacement denim covers just in case.",
      "rating": 5.0,
      "verified": true,
      "author": "The Wilson",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Excellent Value",
      "text": "I ordered this because my hubby's yellow lab has some hip issues and I wanted to find a bed for her that would allow relief for her joints. I ordered a large bed because she likes to sprawl and it's actually large enough for two medium dogs. It comes with three covers - a waterproof cover that I don't remove, a denim cover that is easily vacuumed and washed, and another cover that I will use in the winter. Each cover is quality made. I was impressed with the product - I looked at many beds - some far more expensive and I'm certain they aren't any better made than this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Elisa Maria",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Dog tested, dog approved",
      "text": "This bed fits my dog's kennel really well. The bed comes with two covers for the pad. My dog chewed right through one corner of the padding; I can't hold that against the company or the product because my dog has anxiety. She does the nervous chewing. And being a German Shepherd, she can get through about anything. But I decided to put both covers on the bed, my dog really likes the bed. She sleeps on it most nights instead of cuddling with me. In the day, if she's napping, that's where she will go first. Would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Remington Greer",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "2 Years of Use and Still in GREAT Condition",
      "text": "We bought these beds 2 years ago and they are still in great condition. We keep the denim covers on them, which we machine wash every few months when we can't stand the amount of fur and/or slobber that has accumulated. Our dogs seem to really enjoy these beds, sometimes even snuggling up, two 60+ lb dogs to a bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 8,
      "publication_date": 20170108
    },
    {
      "title": "NOT waterproof as advertised. Great until the moment any urine gets on it.",
      "text": "Sadly I must say that the product is misleading- the interior lining is NOT waterproof in any way. I had this bed for ~1.5 yrs. Very high quality foam and the covers were easy to wash. I loved it up until the moment this week when for the first time, my dog had an accident on it. He's a 90 lb dog and very quickly the urine seeped straight through the outer cover and onto the inner liner. I expected it to be water resistant at least, but the interior foam was soaked! I had to throw it out. Very disappointing. They shouldn't make false claims about waterproofing when it clearly isn't.",
      "rating": 1.0,
      "verified": true,
      "author": "LM",
      "helpful_votes": 16,
      "publication_date": 20161203
    },
    {
      "title": "Almost so great, but not chew proof :/",
      "text": "Well. This was almost the holy grail. It lasted longer than any others. But she did chew through it. She loved how cushy it was, and I bought the large so she and her best friend could use it at the same time. It was also easy to clean (got to test that after she peed on it; fun fact: the waterproof layer worked!) But she ripped through it and she thought the mattress itself was SOO fun to tear apart, too. Until I find a new option, I just flipped it over and now she gets to use what's left of it while supervised.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Great waterproof dog bed - & great bed in general.",
      "text": "Bought this bed for my 13 yo choc lab girl who’s been having bladder issues, peeing our bed (thank goodness we have a waterproof mattress pad!), her dog bed, a rug and the floor so far. Per the vet, her bladder looks good & no UTI so assuming it’s an age thing Have had this bed for 2 days & today she had an accident on it - was so easy to take the cover off, wipe the waterproof cover clean & put on the 2nd cover while washing the other one. Definitely a great purchase for our situation. The mattress is also a really good thick memory foam which is good for her aging body. Also...just ordered dog diapers.",
      "rating": 5.0,
      "verified": true,
      "author": "VickieD",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Buy this if your dog is restless at night.",
      "text": "Well packed, well made, received very quickly. Would recommend. I cannot believe how comfortable this bed is. I wish they made the exact same thing for people. I would use it as my own mattress. My dog has full hip dysplasia in both hips and arthritis and she is nowhere near as uncomfortable at night as she was before I got her this bed. One of the star ratings is \"Chew Proof\". Not sure why that would be there. No dog bed is going to be chew proof. My girl is sleeping so much better now on this bed. Money well spent.",
      "rating": 5.0,
      "verified": true,
      "author": "Long way home",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "NOT WATERPROOF",
      "text": "Update... i emailed the seller and they replied same day. They provided detailed information about this product and care instruction along with instruction on how to clean the mattress. They are going to send me another cover. Excellent customer service so i am changing my rating. This is NOT a waterproof cover. My cats have a tendency to pee on things which is why I looked specifically with something that had a waterproof cover. No where near waterproof. I am now out $80 and another dog bed.",
      "rating": 3.0,
      "verified": true,
      "author": "Dragonfly444",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Comfy and easy to maneuver!",
      "text": "One of the most functional and cozy beds I have ever ownEd! As a dog owner I spoil my dog and spent quite a bit of money on fancy brand beds. However, from all of them this one I like the best. The mattress is thick and comfy but the feature I really LOVE is its waterproof liner. It keeps the mattress clean when my pup has accidents and it is slippery so the cover is easy to slide on and off. All in all a comfy bed for the dog and easy to clean/change for the dog owner. Did I mention cheaper than a lot of fancy brands?",
      "rating": 5.0,
      "verified": true,
      "author": "Simi",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Perfect dog bed",
      "text": "We have a 9 yr old 67 lb Catahoula/Lab mix and he LOVES his bed. After years of trying different beds that were never quite right (made crinkling noises/caved in the center of bed, or completely flattened out/absorbed & retained doggie odor, etc), he willingly seeks out his bed. He has been sleeping on this bed almost a year now and with the plastic liner (easy to wipe off with Clorox wipe) and 2 washable duvet covers, he always has a clean bed. I flip the bed over each week when changing the cover and there is no visible sinking in the middle. Materials and zippers are heavy duty. Definitely recommend this bed.",
      "rating": 5.0,
      "verified": true,
      "author": "TJYoung",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "The Dog Says, Paws Up!",
      "text": "I ordered this dog bed only after reading the reviews and description. I have an Australian Labradoodle, 45 lbs. He loves the bed. I have draped a dog blanket over the bed to protect the bed covering. The inside material is so sturdy. We keep the bed in the LR and it is used daily. I purchased it late in 2019, and used it on the back seat for our dog to be comfortable on 11 hr and 13 hr car rides. It was great. There is no hesitation in recommending this brand. M. Gasper",
      "rating": 5.0,
      "verified": true,
      "author": "M. C. Gasper",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Better then I expected.",
      "text": "I bought this mostly because of the water proof liner. I was concerned that when my 90 pound boxer comes in from outside, he sometimes does laps in the room and or on his bed. So far, the liner is not torn up and the foam is still intact. The denim cover is durable and the spare replacement cover works when the main cover is being washed. My dog does not chew his beds, so I cant comment on that. I recommend this bed for your dogs comfort. No more Costco pet beds for us.",
      "rating": 5.0,
      "verified": true,
      "author": "F. Masters",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Extremely soft",
      "text": "This bed is too soft. I bought it for a 15 y/o GSD x with bad knees and arthritis. Because it's just memory foam with no base it's hard for him to get up. I love the waterproof cover and the fact there are 2 other covers that come with it. It's probably better for a dog without the issues mine has. The bed he had before this one was better (for him).",
      "rating": 4.0,
      "verified": true,
      "author": "Dawn McCune",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Super lush",
      "text": "These are so nice. I bought two and my husky really loves it from time to time. My doodle could care less and wants to sleep on the coldest hardest floor she can find. I don't know why, I think she finds them too soft. So I lay on them a lot and read or watch tik toks. The dogs still both still prefer my bed...just because it's my bed. People come over and compliment them a lot. So it's a 10/10 win for the people, an 8/10 for the husky, and a solid WTF for the golden doodle.",
      "rating": 5.0,
      "verified": true,
      "author": "ToriphileEWF",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Great Value!",
      "text": "I've bought many dog beds over the years and have never found one that was of this quality. The pillow material itself is a high density foam that is both comfy and supportive. The water resistant zip on liner adds a layer of protection against accidents and /or odors. These beds come with 2 outer cases that also zip-on snugly; a dark blue denim and a russet brown brushed micro-suede style. My dogs love these beds and I would recommend them to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Kerrie A.",
      "helpful_votes": 0,
      "publication_date": 20201024
    },
    {
      "title": "Wonderful bed.",
      "text": "My dogs do not chew on stuff so I can’t say it’s chew proof. My dog loves it and it does help arthritic hips but she’s more of a couch lover than her own bed as she does love to be high up. Lol this bed is wonderful for dogs that aren’t so spoiled like mine. I will somehow have to make it elevated for her to want to be on more. Another thing she doesn’t like about the bed is not having arm rests for her to lay her head on. Other than that this bed is honestly perfect for a less picky dog. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Ruben C.",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "120 pound GSD and 60 pound hound both love it",
      "text": "I gave 5 stars for chew proof just because. Neither of my dogs are chewers. I have two now, one inside the 24”x48” kennel (their den, they take turns using it) and one on the floor in the living room (as Goodbye Just bought the second one after 2 satisfied years of the first one. Reasonably priced, quality designed, and long lasting. The denim cover has held up well, easy to wash/dry and tough. Nice zipper on the cover. When one of them gets up, the other takes his place!",
      "rating": 5.0,
      "verified": true,
      "author": "Gustav",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Leakproof cover isn’t leakproof and only one cover is machine washable.",
      "text": "The core reason we bought this was for the protection cover for the wetness barrier. The urine leaked right through and now the memory foam smells like pee. There’s no way to clean it. The bed is very soft. The external blue jean cover is machine washable. The spare cover is not as nice, not machine washable but good to have until the other one is washed. Overall, I’m not satisfied because we need a waterproof cover. We thought that’s what this was.",
      "rating": 3.0,
      "verified": true,
      "author": "CoachTJ",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Dog should really be writing this",
      "text": "After unpackaging, you will want to wait a day before letting you dog have it. I laid the demin cover in a chair where I sit to allow it to collect my scent for a few hours. I gave him the bed the next morning and he started to tear open the end before I could stop him. I was fortunate that he didn't do more damage than ripping the cover and a chunk or two was out of the mattress. I took the other cover and sat on it for several days. He seemed to understand after that and has had no other issues. He sleeps on it every night and it fits perfectly in has crate.",
      "rating": 5.0,
      "verified": true,
      "author": "Sparky",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Buy this bed!",
      "text": "Amazing dog bed!!! Purchased for my aging great dane and it's so dense and soft,even with his weight, pressure points dont sink to the floor. He has a twin size tempurpedic in his room,we got this for the living room and I have gotten up in the night to find him using this bed instead! Will be easy to use as a travel bed for him as well. Love the washable cotton denim cover too, and the waterproof layer is awesome because I know this bed will never get stinky,lol. Buy this bed!",
      "rating": 5.0,
      "verified": true,
      "author": "Cortney Rollins",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Great for our senior dog!",
      "text": "We adopted a 13 year old border collie, who has increasing mobility challenges and doesn't always know when she needs to go the bathroom. Having a bed with a waterproof cover and two interchangeable outer covers has been a LIFESAVER with her. We had already been forced to throw out two other beds that she'd accidentally wrecked. We liked this bed so much we have already ordered a second one. It's worth the price, for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Literally won't get out of her crate",
      "text": "Our boxer loves this bed so much that she won't even get out of her crate in the morning to go potty. Now we just leave the door open for her for whenever she's ready, but sometimes that's hours later (and she's only 3!). She never used to be like that with any other beds we've had in there. My husband and I have both laid on it to test it out and think it's very comfortable. It's not like the memory foam that sinks you straight to the floor- there's still a level of support there. We are all very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Highly Recommend This Bed",
      "text": "I am about to purchase another one after getting a new German shepherd. He is now 6 months old and 80 lbs. The other bed we purchased for our 65 lb German shepherd. He just claimed hers the other day as his. The cover included have been washed weekly, rotating the covers. So that at least 50 washes per cover, and they are still in good condition. The bed itself has lost no support whatsoever. It is a real quality mattress. I guarantee you won't get any better unless you spend 250 dollars, and on up. I honestly don't see how you could a better bed no matter how much you want to spend.",
      "rating": 5.0,
      "verified": true,
      "author": "theorangeturtle",
      "helpful_votes": 0,
      "publication_date": 20160927
    },
    {
      "title": "We put a towel on top of that and we have been very satisfied. We kept getting the fluffy pillows at pet ...",
      "text": "Our dog loves his bed! I appreciate that there are two liners, an inner and an outer, to really keep it clean. We put a towel on top of that and we have been very satisfied. We kept getting the fluffy pillows at pet stores and Walmart, but after a while they developed an indentation where our dog sleeps. This has maintained its height perfectly so far. It took a while for our dog to adjust to a memory foam mattress instead of a filled pillow, but now he's comfortable and seems to like it. It fits his kennel perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "E. Sato",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Still like new after 7 years",
      "text": "I am getting ready to order another one of these beds, not because mine wore out but because I want another one for our new dog. I bought this bed and 2 covers 7 years ago and it is still perfect, the denim is only slightly worn but the rest is like new. This has been the best bed we have ever had. It gets daily use by our two small dogs. The way the zipper is sewn in none of my dogs has been able to chew at it. Great investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Debby H",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "I wish they made these in people size!!!",
      "text": "I have purchased two of these pillows. The XL bed and the Medium/Large bed! I can't express how well made they are. We have two large dogs a 70 lb pitbull mix and a 60 lb God Only Knows mixed breed. They us both of the pillows but they do share the XL bed comfortably. We also have a 15 yr old Jack Russell and a 14 yr old Chihuahua. I bought them the med/ large bed. I LOVE that you can purchase extra covers (which I have). Even after multiply washing they fit perfect. We have noticed that our bully no longer wakes up all stiff. She really loved these pillows. BEST BUY EVER!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Excellent quality, very thick bed with 3 covers to protect and wash. Highly recommend.",
      "text": "Extremely well made dog bed that would have cost twice in a pet store. It comes with three! covers. Just be sure you fold the memory foam in half and put them on immediately before the foam expands put. It was really easy that way but if I had waited until the memory foam had expanded, it would have been a real job, I’m guessing. The memory foam is very thick. The XL fits a 90 lb. German Shepherd with room to stretch out.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane T.Top Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "This thing is incredible",
      "text": "I needed a new bed because my puppy was ripping the stuffing out of his Walmart special mat. I wanted something that was durable, fit the cage well, and mostly seamless. This thing is absolutely incredible and a fantastic price. He loves the comfort, the liners make it fully waterproof, and it fits the Amazon kennel PERFECTLY so he can't see any seams or chew the edges. Look no further for a fantastic bed for your best friend.",
      "rating": 5.0,
      "verified": true,
      "author": "mkultra",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Made a difference in the comfort of our Dog",
      "text": "I like the softness and how easy it is to change the cover. It is not easy to vacuum off and it gets dirty in no time. We have only had it for a few months and it already has a couple wear spots in it. That is the not so good part. The great part of this bed is that we have seen a noticeable difference in the stiffness of our 11 year old English Mastiff. Which is the most important part and reason for buying the new bed.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "High quality dog bed",
      "text": "I ordered this because I have a cat who occasionally decides to pee on my dog's bed, and I needed a waterproof liner. Although I could've bought the liner by itself, it was time to get a new dog bed anyway, so I splurged for the whole package. I can't speak for its longevity, since I just got it, but I am very impressed with the quality of both the mattress and the covers. My dog instantly preferred it to her old bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Lee",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "It's really waterproof!",
      "text": "This bed is very comfortable and is really waterproof. I have a naughty dog who pees on his bed when he gets mad, I am so tired of washing beds and throwing out beds. This is one of the first beds to be really waterproof....and it comes with two covers, so one is always available. My only struggle is getting the bed in and out of the cover, it can be a bit tight. I would buy this bed again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Great bed & deal!",
      "text": "We have 2 of these beds. The first we bought almost 6 years ago for our Akbash Lucy a large breed of dog. It has held up really well, is easy to vacuum and we really like having the 2 covers. We bought the second one recently to offer her some comfy space in the kitchen while we hang out there. It is definitely a bit stiffer right now. But with use it will soften some like the other. We pet sit for friends and all the dogs seem to like it. The picture shows Lucy on her bed in between her besties. The bed is 2 1/2 years old at that point.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Failed Doberman Test",
      "text": "We had very high hopes for this bed. Wasted a lot of time doing research on tough durable beds and this one was ranked one of the very best. Bite resistant? Our 6 month old female Doberman had this thing in pieces inside of one hour with denim and foam all over kennel. Surprised she didn't choke to death. We had two different $20.00 beds before this one that lasted at least a month. If your dog is done with tearing things apart this is a pretty nice bed. Would be good for older dogs. Bite resistant, NOT! Tear proof, NOT. Next....a chain mail bed.",
      "rating": 2.0,
      "verified": true,
      "author": "CyberShopper",
      "helpful_votes": 2,
      "publication_date": 20180530
    },
    {
      "title": "Great dog bed!",
      "text": "I got this as a crate mattress for my very large crate since I am fostering a 75 lb. senior Pit who has just had ACL surgery. It is so comfortable for her that she goes right back to her crate after her potty breaks. I don't know how it would stand up to dogs who chew their beds, but it is great for her. I would think that denim covering would be pretty tough for minor chewers. I don't know if anything can stand up to major chewers.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Happy pup!",
      "text": "My dog loves this bed. She has arthritis in her hips and this bed is so comfortable and gives her the support she needs. Super easy to clean. The cover does get full of hair VERY fast. My dog is an Aussie/Border collie mix and sheds ALOT. I have to clean the cover daily as her hair just sticks all over it. Thankfully the cover comes off easily and is also easy to put back on. Happy with the quality. Definitely rivals beds that are twice the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet D",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Still in one piece!",
      "text": "It's been a month and it's still in one piece. Both rottweilers are intrigued by it but have not chewed it up as they have with many others. It's say that's a success!!! The foam is heavy, so they can't toss it around. I have the zipped side against the wall, so they can't find the zipper (hidden) to pull on it. Now they've accepted defeat and have begun to lay on it peacefully. Ahhhhh..",
      "rating": 5.0,
      "verified": true,
      "author": "C.H. in Goodyear",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Surprisingly luxurious - fits 42\" crate perfectly",
      "text": "I chose this model because it would fit the crate perfectly and seemed to get solid reviews, especially on the potential 'accident' front. We'd never used a crate before but our latest rescue came crate trained so we're embracing it and thought a matt would be a nice touch. This isn't a matt, it's a full blown mattress - and really surprisingly luxurious! Reminds us of our memory foam bed! It's so nice its kinda feels illicit but hey, pup likes it a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "LFP",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Soft memory foam for large dogs",
      "text": "Great size - perfect for large dogs. I have 2 (boxer and shepherd) both weigh 95 lbs. My shepherd is old and has issues with her back legs. It’s actually too soft for her to get on and get comfortable. Which is a bummer because I purchased it primarily for her to relieve some of her pain. My boxer uses it fine — but doesn’t love it. I have deduced this because it is the bed he spends the least amount of time in. For the price it’s great — came with two covers. Just know it is a very soft memory foam.",
      "rating": 4.0,
      "verified": true,
      "author": "clukhard",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "best bed for the price hands down.",
      "text": "Best final purchase i could have made for my big pup before she passed away. extra large was plenty big enough for my 100 pounder (and plenty comfortable for me when i needed to be close to her). the internal covers and both the light and heavyweight external covers were a fantastic idea. i was able to use the alternate set of covers while i washed the other set. best bed for the price hands down.",
      "rating": 5.0,
      "verified": true,
      "author": "V. A. Schellhase",
      "helpful_votes": 0,
      "publication_date": 20171123
    },
    {
      "title": "Great bed, if your dog does not like to destroy stuff.",
      "text": "Our Beabull is not one to destroy his beds. We have two of these beds and love them (as does he). We have a big one, and one that fits his crate. If he decided to go to town on the bed, well... it is foam. Foam is easy to destroy. Take into account your pet before you say it is easy to destroy/chew up. Yeah, it is. It is foam! If your dog is a bed destroyer, just buy the cheap beds. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Satisfied customer!",
      "text": "Love everything so far! I purchased this bed for my 6yr old/80+lbs doodle after finding out he has arthritis in his shoulder. The bed came with 3 washable covers, 1 enternal cover, and 2 external covers (brown suede cover is a bonus!!) The instructions do say to hand wash the suede cover!!! My dog does not chew or dig, so as far as that part is concerned im not 100% sure about. I highly recommend this bed, and also you will be supporting a small buisness in California, USA!!! Thank you!!",
      "rating": 5.0,
      "verified": true,
      "author": "kelly",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Amazing bed!",
      "text": "I wanted to give our lab something more to sleep on than just a kennel pad. This had great reviews so I thought I’d try. It fit perfectly into the kennel. He seemed a little hesitant a first, then plopped down and fell SOUNDLY asleep. It’s our first night so we’ll see how it goes but he already seems much more comfortable. My only fear is cleaning after accidents. Time will tell!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristi D.",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Great bed for a big dog",
      "text": "Excellent quality. Sturdy fabric on the outter denim layer. I have an English Mastiff and her nails usually shred most dog beds within a couple of days. I was looking for something just like this with a durable washable cover. This bed was exactly what i was looking for at a fair price. I'm also excited to be able to purchase replacement covers for when this one wears out.",
      "rating": 5.0,
      "verified": true,
      "author": "mama",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Loved it so much, I bought 2",
      "text": "I purchased originally in 2017 for my french bulldog and he is pretty picky about his beds. He never leaves this at night and I've added a heating pad in the winter. Fast forward to today, I adopted an 80 lbs \"puppy\" and bought another bed the moment I knew he'd be coming home. This bed has held up so well, is easy to wash, and stays very clean. I'd highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "JWALK82",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Great quality dog  bed for a wonderful price!",
      "text": "I have bought beds before for my 90 pound American bulldog and she has torn them up in a matter of hours ! This bed is very well-made, true gel memory foam, not like egg carton foam so many of the other beds are made of. Nice tough sturdy denim cover, with a waterproof cover underneath ! I ordered a large for my dog and she’s one that kind of likes to curl up and sleep, so it is perfect for her!! Definitely the best bed that I’ve ever bought for the dog!!",
      "rating": 5.0,
      "verified": true,
      "author": "R. M. Henson",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Though comfortable, durability is suspect.",
      "text": "Inasmuch as this bed is comfortable enough for my dog, the construction of the external denim cover is not as durable as it may seem in the item description. If your dog is a chewer or a digger, don't buy this item. Also the construction of the zipper and zipper tab is not durable, my dog was somehow able to dislocate the zipper tab from the zipper. My dog was able to tear a hole in the denim cover and dislocate the zipper tab in less than 24 hours. The customer representative was responsive and sent us a new denim cover, which I appreciated.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20170201
    },
    {
      "title": "She loves it",
      "text": "I have a chocolate lab who weighs in around 109 pounds and she fell over the winter and hurt her hip. I bought her this bed to replace the old flat one and she likes it. She doesn't limp as much when she gets up in the morning and is doing better since this became her new bed. I love the washable covers and the waterproof cover that came with her",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "So Glad We Chose This",
      "text": "Our German Shepherd LOVES this bed. Best dog bed we have ever had after owning several shepherds. He is an outdoor farm dog and loves the comfort. Easy to wash the navy denim cover. Has held up great over the course of many months even though this dog is not overly gentle. I love that it has two zip-off covers and offers the opportunity to order additional ones if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Library Resourceress",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Great purchase, worth the money.",
      "text": "My dogs love this bed! I'm having to get another for the other crate, because one of my pups doesn't like the different brand I got for hers. She comes to the crate with this one in it instead. Nice waterproof cover and the denim cover is hardy. That inferior brand's cover was ripped by a claw in the first few days. Sticking with this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Cee",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Best beds ever!",
      "text": "Repeat customer for both beds and extra covers. My dogs can’t be happier with this purchase, and neither can I. Having two dogs, with one that has joint issues and the other one a queen, I have to buy two beds or the queen wants the good bed, lol. So I bought two xl sized ones about 5 years ago, and now I bought two of the large crate sized ones for another area in the house. The old ones are like brand new only the covers are slightly faded. The new ones are the same great quality and my dogs love them! The price for quality can’t be beat.",
      "rating": 5.0,
      "verified": true,
      "author": "DESIREE JAMES",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Dane Approved",
      "text": "Purchased for new bedding for my male dane (155lbs). I almost want to sleep on this thing. It's soft and easy on his joints. It comes with three covers (1 waterproof, 1 jean, 1 suede) It's easy to sleeve and easy to wipe clean. Make sure you fold it to get it into the covers, and let it sit out for an hour or two to expand properly. This is well worth the money and I'll be purchasing a second one as soon as my female chews her current bed.",
      "rating": 5.0,
      "verified": true,
      "author": "J. W",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Exceeds expectations!",
      "text": "My big girl (shepherd mix- 110 lbsj is getting older, and I was looking for a more comfortable mattress for her crate. After comparing many different memory foam offerings, I chose Dogbed4less XL. It came as expected with more optional covers than I expected. Three covers include a waterproof cover, a lightweight nonskid cover, and a heavy duty denim cover. All have sturdy zippers, making it easy to switch off. The memory foam mattress appears to be of good, solid materials. Looking forward to seeing how well it lasts. I definitely recommend this mattress.",
      "rating": 5.0,
      "verified": true,
      "author": "Abqmiss",
      "helpful_votes": 0,
      "publication_date": 20171221
    },
    {
      "title": "Highly recommend.",
      "text": "The best dog bed I have ever purchased. I have a large dog & we have gone through numerous beds, from wear & tear. This bed has been lasting & keeps its thickness & shape. It has a protective cover, which keeps the foam from absorbing the dog smell & the outer cover is thick denim & great quality - easy to take on & off for washing.",
      "rating": 5.0,
      "verified": true,
      "author": "Julia Taylor",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "I will never buy a different brand dog bed!",
      "text": "I got this bed for my good old girl (who passed away this year), hoping to find an orthopedic bed that actually lasted. This is an incredible bed and worth every penny! It cushioned her old bones, the covers stood up to weekly washings (and are still going strong), and it was so comfortable even the cat wanted to share it with her. :) I think back to all the $30-40 dog beds I've gone through before finding this bed and just shake my head -- this bed is built to last! Highly recommend. UPDATED TWO YEARS LATER TO ADD: bed still holding up strong. The interior waterproof liner, however, has degenerated so I will be replacing the liner.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer R Fuller Renfro",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "My dog hated it",
      "text": "Sorry to write this review as the product seems to be great and very well made. My dog would only get on it if I told him to and them he would just stand unless told to lie down. I kept it long enough for him to get used to it, he never did. He avoided it at all costs. I think because it isn't \"squishy\" as he likes his beds malleable. If I were dog sized I'd keep it for sure. Gave it 5 stars because I think it's a good bed for the right dog. Hated sending it back.",
      "rating": 5.0,
      "verified": true,
      "author": "Artlyn",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Excellent Chew Resistant Dog Bed",
      "text": "My one-year-old female husky had destroyed three beds before this one. After three months this bed has survived without a sign of being chewed upon. She empties her full bladder on the bed about three times a month. The outer covers are easily cleaned and the inner waterproof liner protects the memory foam gel pad from the urine. The gel memory foam pad is more comfortable than our guest bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Troy",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Stayed dry despite sudden release of 'lake superior'",
      "text": "This bed worked as promised, when it received a large volume of urine, the foam remained untouched. The 2 covers completely protected the foam. The covers went through the wash, remained the correct size and recovered the foam nicely without a huge wrestle. The zippers are also good quality and allowed that re-covering process to go smoothly. I have a 125 # Newfie and I think I should have followed their measurement guide and purchased one size larger bed. However, she uses the XL and it seems to help her old bones get going in the morning.",
      "rating": 5.0,
      "verified": true,
      "author": "Marnie",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Ready to buy another for my other Lab",
      "text": "$75 is a lot to spend on a dog bed, but this is worth it! I use it in my Lab's kennel. It fit snugly, but that's perfect as it doesn't shift. He gives it extra tailwags! Now that I know it was a good purchase, I have to buy another as my other Lab sneaks into his kennel to use it! Life with Labs! LOL",
      "rating": 5.0,
      "verified": true,
      "author": "Gillgang",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Super comfy! Exactly what I was looking for.",
      "text": "This doggie mattress/bed is exactly what I was looking for. Fits in our cage perfectly. Thick & soft, yet firm enough. Our dog is about to have ACL (CCL) surgery & will need to be on bedrest for 12+ weeks. We needed a bed that would be comfortable, fit in our cage, & allow for him to stretch out. I love how easy it was to put the covers on the mattress. Esp love that it came with 2 covers. Washs well too. He and our cats love it! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Diana V",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Really glad that we bought this bed!",
      "text": "We got this bed because our dog had a fractured pelvis and needed something comfortable. We bought her 5 beds in just a few months and she chewed them all up. The tightness of the fit and the denim material broke this habit. This broke her chewing habit and she loves her bed. For some reason, she “digs” on her bed every night and it just got a tear from all of the abuse. Fortunately, it’s denim, so I can just go to the store and buy a denim patch. Really glad that we bought this bed!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsey",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "My Dogs and Cat LOVE these beds!",
      "text": "This was bought for my golden retriever/lab mix because he is the tallest. However, he likes the smaller bed and my lab mix likes this one better. These beds are amazing!!! I bought one for each of my three dogs. Even my cat likes them. I bought an extra blue jean cover for each of them. My relatives have had 2 of these beds for 5 years and they are still holding up great. This was a great investment for my fur babies!!! Tiger and Benjamin give it 2 Paws up!",
      "rating": 5.0,
      "verified": true,
      "author": "P P",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Not waterproof at all",
      "text": "Love the bed. Its comfortable enough that I fall asleep sometimes when I'm laying down on it petting my Golden Retriever. Would even consider buying 2 for camping in the back of the pickup. I'm deducting 1 star because the 'waterproof case' is a lie. Dog pee or just plain water soaks through the waterproof case and goes straight to the memory foam. Really annoyed with this because memory foam doesn't just dry easily. Overall I would buy again but the company is promoting false claims about their product being covered with a waterproof case.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas A",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "🐾 Thick Comfortable Dog Bed 👍",
      "text": "I purchased two of these beds for my dogs, the size Medium is shown on the top of my picture and the size Small bed on the bottom. I LOVE the Blue Denim covers and these brown covers are nice to have while the Blue Denim covers are being washed. Both of my dogs enjoy these beds and the last a LONG TIME; I know because I am a repeat customer! I hope this review is helpful on your dog bed search! 🐾",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa H. ",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Dog loves it",
      "text": "My 5 month old German Shepherd(57 lbs) loves the bed. She’s not a destructive dog so chewing hasn’t been an issue. She been on the bed after playing in water and the water proof cover does work. The outer covers are easy to clean and it’s nice to have two covers to swap between washes. Nothing in the pet shops compare to this bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Senor Blanco",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "The BEST dog bed!",
      "text": "My wife repeatedly compliments me for this choice. And well deserved, too. The best by far. I've got three older dogs and greyhounds (the latter very bony). My latest grey sighed with relief when she got on the bed. Very durable, too. I've got eight of them (I think), been around for quite some time. And great to take the cover off and just wash it. The person who had a hard time w/ the cover -- the instructions say, after letting the bed fluff out for a day, to bend it into a \"v\" shape to put the cover on. Then it is easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Caldwell",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Dog Bed & Cover-Heavy Duty",
      "text": "The Denim Dog Bed Covers are wonderful! They will last a long time and they are washable. I also bought the Dog Bed-Memory Foam - that goes with the covers and my Rotweiller and Weim love these beds! These beds are so much more comfortable than the other they have had. I bought extra covers to swap out while others are being washed - I am going to purchase 2 more for another part of the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Becky Meadows",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Worth it!",
      "text": "My dog is a rottie and weighs 120+ pounds. We purchased the 40X35X4 Inch and it fits him perfectly. The mat is exactly the same memory foam as the mattress on my bed. The cover is a lot nicer than the plush covers we've had in the past. So much easier to keep clean. Most of all, he loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "gakette",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "You cannot go wrong with this purchase.",
      "text": "This is the third bed I have purchased from this company because my dogs absolutely love these! I have tried all different brands over the years but nothing has ever held up like these beds! The foam truly stays in shape, the waterproof cover is awesome, and the denim outer cover stands up to a billion washes with no issues. I have a bull mastiff and a very elderly lab who recline on these beds all day.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Ashcraft",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Update to previous post",
      "text": "I bought this bed for a newly adopted 11-year-old underweight standard poodle. I felt so bad for this girl, she was so skinny, there was no padding on her bones. Initially she didn't sleep on it. She would lay there if I called her, but then she would sleep on the carpet. It took about a month, but now she sleeps on it every night! I feel better knowing that she has a bit of padding on her bones!",
      "rating": 5.0,
      "verified": true,
      "author": "db55",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Superior value at a very reasonable Price",
      "text": "a superior product its features listed or image doesn't do justice for this product. I recommend to any animal lover it's just a great product. Best dog bed I've bought in 40 years of buying animal beds.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Counts ",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "Great product for my dogs",
      "text": "Great bed, looks cool and comfortable, but my dog won't use it!!!! I've tried to show her the comfort, she has no desire to sleep on this..... I continue to \"give it time\", but not sure what to do until then..... She loved her other bed, but was so hot. This is still taking up space on my bedroom floor....lol",
      "rating": 4.0,
      "verified": true,
      "author": "Monksoup",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Dog loves it!",
      "text": "Dog is a 115lb chocolate lab/bloodhound mix, so she is a big dog. Due to an injury, she has arthritis in one of her knees. Prior to using the dog bed, she was very restless and seemed to be uncomfortable. Once she tried the bed, she loved it! The bed appears to be very well made and should be easy to clean. The extra large size is perfect for her. We like it so well that we bought a second one for use in another room in the house!",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan C.",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Great support for our older dog",
      "text": "We have also had a new puppy that stayed with us and so I can attest that the waterproof cover works very well... no leakage. The outer cover comes off easily to wash and goes back on almost as easily (we have a large bed). It does not show any signs of breaking down and is still very firm.",
      "rating": 5.0,
      "verified": true,
      "author": "Georgia Gibbs",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "My Dane/mastiff seems to like it",
      "text": "Initial impression is I like it. I may update after the bed gets some use. My dog immediately took to it, ditching her old costco bed for this one. She has post spay incontinence (on meds, but still has occasional accicidents) so I’ll be really curious to see how this holds up. Added a photo for perspective. She’s a 10 year old 115 lb Dane mastiff mix and the bed is an xxl. Definitely big enough for her to stretch out on and I’m hoping the memory foam is good for her old bones.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Best dog bed ever",
      "text": "Best dog bed we've ever purchased. Gel mattress is conformable yet firm. The duel removable covers are handy; always a clean one ready. Switching them out is easy. Covers wash up nice (hang dry). Water proof interior cover insures the mattress won't get wet or smelly. So important for an indoor dog. This won't need to be replaced for a very long time, unlike other beds that don't have a water proof longer. Definitely recommend. Nothing about this bed we don't like.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne L. Rotter",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "Perfect!",
      "text": "Finally, after a great deal of wasted money and energy, on a variety of dog begs, we found one that is exactly what we want. This bed is well made. No sloppily made inner seams. The zippers are substantial as are the zipper pulls. The three covers are easily washed, dried, easy to put back on. An added benefit is the of choice of brown or blue denim covering. It is a good size. It doesn’t overwhelm the room. It is comfortable. Just the right support. (Yes, I followed the company’s Suggestion and tried it out myself.) These people know what dogs and their owners need and want.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith ",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Good Product for Price Point",
      "text": "My dog loves this bed!! He is a lab who weighs 110 pounds and likes to stretch out on his side full body width when he sleeps. The foam is dense and provides good support by melding to his body structure. I love the fact that they provided the additional two cover choices besides the non-permeable cover and all zip and are well constructed. I feel that I received a good product for my money in comparison to many others I considered.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Lyons",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Absolutely amazing! Soft but firm support",
      "text": "This bed is absolutely life changing for my 14 year old Husky mix. She loves this bed. It is very soft but firm enough to support her old bones so she hardly has problems with stiffness now. It is easy to clean and the waterproof cover makes it even more likeable if she has an accident the actual bed remains completely dry.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Excellent Product, highly recommend.",
      "text": "Excellent product. 47x55 fits my 3 miniature schnauzers and 1 70 lb. giant schnauzer with room to spare and they love it. This came with a waterproof liner and two other fabric liners. All with zippers and very well made. What a great company. Oh and I wasn't paid for this review nor did I receive the product at a discount :)",
      "rating": 5.0,
      "verified": true,
      "author": "JF1953",
      "helpful_votes": 2,
      "publication_date": 20171231
    },
    {
      "title": "this dog bed Is fantastic",
      "text": "I like that the bed has such good support for a big dog without flattening out. Quality of materials is very good, sturdy and will last a long time. The cover is a very tight fit, and a little tough to put on the first time, but I managed at 66 years old by myself. My dog had a break in period where he didn't want to give up his old bed, but there was a helpful suggestion by the company to transfer my scent to the new material to make it familiar, which was helpful. I would recommend buying this bed to anyone, as for the price and quality of what you get in the stores is superior !",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "My dog loves this",
      "text": "She will go in the kennel and stretch out on this. i put this in a mattress protector and the cover so I hope it never gets wet. It is too big for the kennel right now it just goes up the back some. Might try to cut it down. No mattress was the right size for the kennel. I love his mattress",
      "rating": 5.0,
      "verified": true,
      "author": "S Harff",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "“Denim” material not durable",
      "text": "After one day of use, my dog has managed to tear a hole in the “denim” layer. I have already ordered a replacement, hoping to diy a way to make it more durable, as I am not much of a seamstress. I do like the memory foam and two inner layers, but I expected the “denim” material to be or durable, like work jeans. I put denim in quotes because it doesn’t even feel like denim material. It’s too soft and thin. I would recommend ordering the mattress and the inner layers for waterproof, but find another durable material for the outside",
      "rating": 2.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Our old Golden Retriever loves this bed!",
      "text": "So far, we're very pleased with this dog bed. Our Golden Retriever is old, and seems to be arthritic. When we had it ready and put it down for him, he sniffed it, tested it with his paws, and flopped down, with a dog-noise that resembled a sigh of relief. He seems quite comfortable on it, and sleeps soundly. It's nice and thick gel-memory foam, as advertised, and the primary cover that came with it seems to be good quality. the waterproof cover is a separate under-layer, and also looks durable. We haven't tried the alternate cover yet, but will probably use it when we're washing the other one.",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie R.",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Best dog bed we have ever owned.",
      "text": "We have a 13 - year old yellow lab. Still spry for her age, but not a pup anymore either. She LOVES this bed. Spends way more time in her kennel relaxing than on the living room floor now. The waterproof inner cover is as good as advertised. Having two covers is nice; swap one out while you machine wash the other one. We have gone through probably 7 - 8 dog beds over the years. Wish we would have found this bed years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "John Schaffert",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "The BEST dog bed out there.",
      "text": "This bed has three (3!) removable covers. It looks great in denim, is durable, the dogs love it, and it's super easy to remove the covers and wash. One year on this bed is going great where others have failed. UPDATE: One year later I bought another one so the dogs don't have to share. Excellent bed!",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Webb",
      "helpful_votes": 0,
      "publication_date": 20190915
    }
  ],
  "product_meta": {
    "title": "Dogbed4less Premium Memory Foam Dog Bed, Pressure-Relief Orthopedic | Waterproof Case, Washable Durable Denim Cover and Bonus 2nd External Cover, 7 Sizes, Blue",
    "description": "Size:40X35X4 Inch Extra Large| Color:Denim in Blue40\" Length X 35\" Width X 4\" Thick is excellent for medium to large breed dogs. The order comes with 1 durable denim cover in navy blue color, 1 waterproof internal zippered cover and 1 solid 4 inches memory foam insert pad plus Get 1 extra Bonus brown color External Micro Suede with non slip bottom side cover on this bed purchase. Tired of changing your expensive pet bed regularly? Those pet bed need to replace frequently because of the low cost fabric and stuffing being used. Dogbed4less offer the best material for Comfortable, Supportive, Durability, Easy to clean and also looks great in your home. Our pet bed products are made with high quality durable fabric and top rated memory foam to ensure the ultimate comfort and orthopedic support, which are rarely sold elsewhere due to the higher cost and weight. Unlike other lower cost multi-layer glued partial memory foam, we do not cut corners and only offer 3.2 lbs high density solid memory foam similar to high end human therapeutic mattress stores to promote better sleep and healthy joint. Our high density memory foam is 5 times denser and 4 times heavier than regular foams, which will not flatten overtime and provide many years of comfort and support. Hypo-Allergenic memory foam are also highly resistant to bacteria, molds and mildews, and dust mites. 2 excellent layers of fabric covers: Internal layer Taffeta waterproof fabric zipper cover to help secure the pad and a durable 13 ounce/yard jean denim fabric zipper external cover (40\"X35\"X4\" size) for easy cleaning. Our external denim cover is 100 percent cotton made which is interchangeable for top or bottom side which benefit the pets that are allergic to synthetic fabrics. The external cover is machine washable and dry-able. Additional replacement cover, more sizes and colors in blue, brown, olive green, gray or black are available here by clicking the Dogbed4less link on the top next to the title.",
    "rating": 4.7,
    "feature_bullets": [
      "WATERPROOF Liner + 2 EXTERNAL COVERS - The bed comes with 1 Water proof internal zipper cover to protect the memory foam, 1 Heavy Duty washable Navy Blue Denim external zipper cover and 1 Extra Bonus MicroSuede brown external case.",
      "DURABLE WASHABLE COVER - 100 percent cotton Denim removable cover with strong zipper in gusset style and extra stitching to prolong the life of the bed, wash after wash.",
      "GEL MEMORY FOAM ORTHOPEDIC SUPPORT - Top rated quality XL 40\"X35\"X4\" hypoallergenic high density 100 percent solid memory foam pad provide the support and relieves the pain of arthritis, will not flat overtime to promote better sleep and healthy joint for your dogs.",
      "THERAPEUTIC COOLING LUXURIOUS COMFORT - Better than average human grade mattress with conforming therapeutic comfort. The combined benefits of pressure point relief, alignment support, cooler sleeping surface, less allergens and motion isolation come together to create the ideal environment for deeper and more restful sleep.",
      "HIGHEST QUALITY - Premium materials, quality construction and smart features providing many years of comfort and support with excellent value for your money. Try it yourself and you will love it too."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "40 x 35 x 4 inches; 2.55 Pounds",
      "Item model number": "hscd",
      "Date First Available": "August 25, 2008",
      "Manufacturer": "dogbed4less",
      "ASIN": "B001E3EC9M",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Dogs",
      "Pet Supplies",
      "Beds",
      "Beds & Furniture"
    ],
    "price": 78.9
  }
}