{
  "website_summaries": [
    {
      "verdict": "The nicely designed Fujifilm FinePix S2000HD has more going on than just its long lens, but photo quality isn't quite there.",
      "pros": [
        "Very compact, comfortable design",
        "lots of shooting options",
        "720p MPEG-4 video",
        "relatively inexpensive"
      ],
      "cons": [
        "Slow performance",
        "visible image noise even at low ISO sensitivities",
        "mediocre EVF"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 7.0,
        "Performance": 6.0,
        "Image quality": 6.0
      },
      "publication_date": 20081123,
      "rating": 6.6,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "I recommend the same camera but it extends from 18 ft",
      "text": "My husband likes this camera for closer photos. However, if you want to take landscape photos, I recommend the same camera but it extends from 18 ft. to 300 ft. and is a much nicer camera for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Nina H.",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Great camera",
      "text": "This has been a great camera. We are very pleased with the quality and functions. Great camera at a great price - what more can you say. Sure you may get more if you pay more, but for the average or above average user this is a great camera. I bought it for my son and like it so much I will probably hand down my current camera and get another one of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20090214
    },
    {
      "title": "Best camera, best seller",
      "text": "Best camera, most intuitive, I have ever used. So easy to use, not a lot of menus to reach simple functions. Brilliant photos. I was lucky, the seller sent me 4 rechargeable batteries and an 8gb sdhc card as a bonus! And packaged it in dog proof dust proof packing.",
      "rating": 5.0,
      "verified": true,
      "author": "GoodBuyForLife",
      "helpful_votes": 0,
      "publication_date": 20130630
    },
    {
      "title": "Just what we hoped for",
      "text": "We were looking for a camera that would have the benefits of digital but feel of an old-fashion \"real\" camera and we got exactly that. Great pictures, easy to use, many great features. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Daniels",
      "helpful_votes": 0,
      "publication_date": 20090128
    },
    {
      "title": "Not that bad of a camera",
      "text": "I had purchased this camera for a concert that I went to last month. The zoom was working perfectly than my last malfunctioning camera I had 2 years ago. I had taken alot of photos with & it was amazing. I was also pleased on how fast it came in the mail. I like this camera so much that I can't get my hands off of it.",
      "rating": 4.0,
      "verified": true,
      "author": "Joey DeVaughn",
      "helpful_votes": 0,
      "publication_date": 20110810
    },
    {
      "title": "... as described and was packaged carefully - arrived in good order. The macro and super-macro features in this ...",
      "text": "Product provided as described and was packaged carefully - arrived in good order. The macro and super-macro features in this camera are incredible.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "OK",
      "text": "Have used this for many years. It is a decent camera but not great in low light conditions. It was a good value at the time.",
      "rating": 5.0,
      "verified": true,
      "author": "jb",
      "helpful_votes": 0,
      "publication_date": 20140108
    },
    {
      "title": "I love mine!",
      "text": "I really love my new camera. My last camera was a Samsung, that also had mixed reviews. I liked that camera as well but it met an unfortunate end. So I began camera shopping and despite some mixed reviews decided to purchase this camera. I am not disappointed at all with my purchase. I love the clear crisp pictures it takes, and the zoom is amazing! I got a beautiful picture of a crescent moon (complete with craters) that is just stunning. This camera does require a bit of studying and practicing but the results are worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Micheau",
      "helpful_votes": 0,
      "publication_date": 20091228
    },
    {
      "title": "Fuji Finepix S2000HD  10 MP Camera",
      "text": "Could not hold camera steady enough to take shot even with stabilizer enabled. Returned this and purchased a Canon SX10 IS which didn't have any problem with stabilization on same shots. Canon does not have HD but I already have a Flip Minio so I didn't need the HD function. Overall the Fuji pictures were good quality as long as you didn't use the zoom feature or shoot close ups that needed stabilization.",
      "rating": 2.0,
      "verified": true,
      "author": "Engineer",
      "helpful_votes": 2,
      "publication_date": 20090111
    },
    {
      "title": "One Issue So Far",
      "text": "I chose this camera over the newer S1500 because it provided an HD movie mode. I've only used the camera a few days, in general its OK. The one thing I wish I had noticed before purchasing is that you can't attach an external flash. This would be OK if the built in flash was adequate, but its not. Using the built in flash adds a very harsh light to faces. A deal breaker in an other wise very nice camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Edward Villarreal",
      "helpful_votes": 0,
      "publication_date": 20091223
    },
    {
      "title": "works like a charm",
      "text": "Perfect camera! lots of settings :) Only problem is if the batter dies, the camera lens wont close until you put more batteries in it.",
      "rating": 5.0,
      "verified": true,
      "author": "user",
      "helpful_votes": 0,
      "publication_date": 20130802
    },
    {
      "title": "Excellent camera - Easy to use",
      "text": "Only had this camera for a week or two, but so far it has been great. Auto option makes it very easy to use. Even the more advanced settings are not all that complicated. I highly recommend this camera.",
      "rating": 4.0,
      "verified": true,
      "author": "RogerB",
      "helpful_votes": 0,
      "publication_date": 20090310
    },
    {
      "title": "it was a perfect choice.. BUT",
      "text": "I bought this camera 2 years ago, it was a perfect choice, and I received it before my graduation from college and it helped me to save memories. I don't think that it is a good choice to buy this camera right now, because you will find a lot of cameras which have almost the specifications if not much better with a slim design (Fuji EXR300 or EXR 500).",
      "rating": 5.0,
      "verified": true,
      "author": "SenanMD",
      "helpful_votes": 0,
      "publication_date": 20110418
    },
    {
      "title": "Excellent camera, Fujifilm FinePix S2000HD",
      "text": "The Fujifilm FinePix S2000HD 10MP Digital Camera work real nice. The wife my oldest daughter(24) and I we each have one My daughter used hers for school and we use ours almost every day I took some nice photos of the Blue Angels Flying this year over at the air show the camera focus picked them up beautifully.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald Van Gundy",
      "helpful_votes": 0,
      "publication_date": 20091204
    },
    {
      "title": "Great camera for the money",
      "text": "If you're looking for a quality 10MP camera for a good price look no further. No it doesn't support RAW format. It's a point - n - shoot on steriods. The only problem I had with the camera was that you have to remember to put the flash up...it doesn't auto pop-up.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Richardson",
      "helpful_votes": 0,
      "publication_date": 20100210
    },
    {
      "title": "good but not great",
      "text": "The new Fuji s2000 is an adequate camera for long range shooting. Controls are close for one with big hands, optical zoon works great and overall, a good camera at a moderate price. Wide angle is good, quality of pictures are good, long zoom pictures not good. Low light pictures are good.",
      "rating": 4.0,
      "verified": true,
      "author": "Martin A. Pesek",
      "helpful_votes": 2,
      "publication_date": 20081016
    },
    {
      "title": "Nice Camera",
      "text": "I'm glad that I picked this camera. It takes real nice pictures once you get in on the right setting. I gave it a 4, because I wish they would have more instruction on the how to set the shutter speed. I would recommend this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 0,
      "publication_date": 20081226
    },
    {
      "title": "Great Camera",
      "text": "I am still having this camera which I have fallen in love. It a great tools for beginners. will promote it.",
      "rating": 4.0,
      "verified": true,
      "author": "Charles Aurelien DIE",
      "helpful_votes": 0,
      "publication_date": 20130222
    },
    {
      "title": "Where is my previous review?",
      "text": "0 of 13 people found the following review helpful: 2.0 out of 5 stars I did not like it !!, September 26, 2008 By OC, CA Colors are not natural. Resolution should be better. I hoped for better video quality. Maybe the price tells more about the quality of this camera.",
      "rating": 2.0,
      "verified": true,
      "author": "OC, CA",
      "helpful_votes": 0,
      "publication_date": 20081107
    },
    {
      "title": "Great camera",
      "text": "This camera is great. I've barely scratched the surface of what it can do though. At the moment I'm hooked on the super macro mode. All I want to do is walk around my neighborhood taking close-ups of things. I've got some pretty cool pics too. Can't wait until spring when the plants start flowering.",
      "rating": 5.0,
      "verified": false,
      "author": "Shaggles",
      "helpful_votes": 0,
      "publication_date": 20090123
    },
    {
      "title": "no way to attach filters",
      "text": "This is a good camera but if you use filters you should know that there is no screw mount or adaptable filter set for this camera. So if you do a lot of landscape photography and rely on a polarizing filter, or are a clutz and like to have a UV lens protector filter on, this is not the camera for you.",
      "rating": 4.0,
      "verified": false,
      "author": "TJ LA",
      "helpful_votes": 0,
      "publication_date": 20091215
    },
    {
      "title": "A Great Camera",
      "text": "I received this camera as an early Christmas present. The Digital Zoom is great, and the pictures turn out clear and sharp. There are so many programed and manual settings that this camera is great for seasoned and beginning photographers. The Ten Megapixels make cropping easy. This camera has exceeded all of my expectations.",
      "rating": 5.0,
      "verified": false,
      "author": "Eric Koenig",
      "helpful_votes": 3,
      "publication_date": 20081118
    },
    {
      "title": "I loooove this camera",
      "text": "I have other cameras, but this is my favorite. I am able to make great videos with it. You can check some of them at Youtube \"monigardenal\". You will not regret buying this equipament. I recommend! :) Monica.",
      "rating": 5.0,
      "verified": false,
      "author": "Monica Baldo",
      "helpful_votes": 0,
      "publication_date": 20120724
    },
    {
      "title": "Great Camera",
      "text": "I love this camera. My uncle bought it for me and sent it to me through Amazon. I am no camera expert, but then again it was only 200$. The camera feels small and compact, but powerful and agile. It has plenty of features that I have no idea what to do with! There's so many. The video quality is great, much better than I would expect from a camera that's meant for point and shoot. The batteries seem to last me plenty, but then again I don't take hundreds of photos every 10minutes. I recommend this great camera at such a great price. =)",
      "rating": 5.0,
      "verified": false,
      "author": "Bram",
      "helpful_votes": 0,
      "publication_date": 20081225
    },
    {
      "title": "Fujifilm FinePix S2000HD Camera",
      "text": "This is a fine camera. I replaced an older model camera because the electronics in that camera failed and it cost more to fix it than to replace it. This camera has slightly better capabilities but is lighter and does not appear to be as rugged. I would like more capabilities but those cameras cost more. This camera has been working well for about a month now. It eats batteries, this is the only problem issue that I have had with this camera.",
      "rating": 3.0,
      "verified": false,
      "author": "Paul T. Hanff",
      "helpful_votes": 0,
      "publication_date": 20090409
    },
    {
      "title": "From Kodak to Fujifilm",
      "text": "I am a former owner of the Kodak Z740. Like many others I was looking to upgrade. Just wanted to add that this camera seems to upload pictures and the high quality video to iPhoto version 6 just fine even without loading the included software. Movies still play from there using Quicktime also. Color in general is not as good as a Kodak camera, but the features, battery power, flash, and of course HD make this an obvious camera choice for its class.",
      "rating": 4.0,
      "verified": false,
      "author": "Marie Boothe",
      "helpful_votes": 0,
      "publication_date": 20090128
    },
    {
      "title": "Love it!",
      "text": "I love this camera, the price has gone down since I bought it and I am amazed at all the features. Go for it, for the money you can't go wrong. Still looking for the HDMI cable to watch photo's thru HD TV. Haven't spent much time looking tho. Pics look great with the cables supplied till I do find them.",
      "rating": 5.0,
      "verified": false,
      "author": "Greg",
      "helpful_votes": 2,
      "publication_date": 20081115
    },
    {
      "title": "Fujifilm FinePix S2000HD 10MP Digital Camera",
      "text": "What Can I say? I've used this camera for about 4 mounths now and love it. The only downside I can see is that it did not come with the HD cable and remote. You have to buy that to watch HD on your TV off the camera.",
      "rating": 4.0,
      "verified": false,
      "author": "W. J. O'Connor",
      "helpful_votes": 0,
      "publication_date": 20090408
    },
    {
      "title": "Do not lose your CD, otherwise...",
      "text": "This is a good camera, my family has enjoy it a lot, be very careful with the customer support, it is unacceptable that you as a customer cannot download the software required to run this camera. the intructions in the website are to contact \"your closest repair center\" .",
      "rating": 3.0,
      "verified": false,
      "author": "Donaciano L. Rojas",
      "helpful_votes": 2,
      "publication_date": 20100612
    },
    {
      "title": "the best",
      "text": "I've used this camera a couple of weeks and can't imagine anything superior, unless it had a 2 foot-long lense. At a photo shop I took out the storage card and printed a couple of 5/7 prints and got compliments on the quality. The range of shooting modes makes it foolproof under any conditions.",
      "rating": 5.0,
      "verified": false,
      "author": "William N. Mcclure",
      "helpful_votes": 0,
      "publication_date": 20090904
    },
    {
      "title": "Great Camera",
      "text": "I received the Camera in a few days of purchase and I am pleased with the quality of the pictures. Easy to learn to use and I am now able to take great pictures in low lighting. I also appreciate the wide angle pictures.",
      "rating": 5.0,
      "verified": false,
      "author": "Kathleen Joseph",
      "helpful_votes": 0,
      "publication_date": 20090329
    },
    {
      "title": "Got a lemon, sent it back, might re-order",
      "text": "Right out of the box, my S2000HD had a problem with the LCD display-- it would streak purple vertical lines whenever I aimed the camera toward a bright light source (e.g. Toward a window from inside the house on a sunny day). Fuji customer support advised to return the camera, since this is NOT normal. I really like the camera's features and quality otherwise. Amazon return was very easy. I opted to get my full refund, since I'm not sure yet if I want another S2000HD. I'm considering thebecause it's more compact and has 10x optical zoom, but know I would miss the Fuji's 15x optical zoom and AA batteries.",
      "rating": 4.0,
      "verified": false,
      "author": "shep",
      "helpful_votes": 0,
      "publication_date": 20081022
    },
    {
      "title": "camera",
      "text": "This was a gift for my daughter. She researched it, and this is the only thing she wanted. It was packaged well, and we were very happy with it.",
      "rating": 5.0,
      "verified": false,
      "author": "Elizabeth T. Jones",
      "helpful_votes": 0,
      "publication_date": 20081226
    },
    {
      "title": "Easy to use",
      "text": "I Love this camera. It is easy to use and take Great pictures fast and slow moving subjects. Recommended for all ages.",
      "rating": 5.0,
      "verified": false,
      "author": "Hot mess!",
      "helpful_votes": 0,
      "publication_date": 20090111
    },
    {
      "title": "Easy to Use",
      "text": "I liked the idea of SLR but don't have the patience to deal with reading the manual. I was able to take a few test shots and bring to my brothers wedding for excellent pictures! I still have some learning but 30 minutes was all I needed to point and click high resolution pictures and HD video.",
      "rating": 5.0,
      "verified": false,
      "author": "T. Quick",
      "helpful_votes": 2,
      "publication_date": 20081109
    },
    {
      "title": "Not happy.",
      "text": "I would love to like this camera and have kept it by my side for two weeks trying to find a \"happy place\" with it. Many valid points in the previous reviews. I am no professional. I just have way too many blurry shots that would have been clear with my previous camera. Returning item and will continue to research.",
      "rating": 2.0,
      "verified": false,
      "author": "JM",
      "helpful_votes": 3,
      "publication_date": 20081124
    },
    {
      "title": "Great product at a great price!",
      "text": "Quick service. Received product on time. Camera is very high quality and works great!",
      "rating": 5.0,
      "verified": false,
      "author": "Vanessa",
      "helpful_votes": 0,
      "publication_date": 20090208
    },
    {
      "title": "Happy Customer",
      "text": "Very pleased with the camera. Has great features and easy to operate instructions. Very pleased with the battery life so far",
      "rating": 5.0,
      "verified": false,
      "author": "Hixon",
      "helpful_votes": 0,
      "publication_date": 20090201
    },
    {
      "title": "POS",
      "text": "I bought this from Best Buy not knowing that you pay a restock fee for Camera's if you don't like it. I dont like the quality of the pictures and the thing broke after a month of use. I has been at Fuji Repair longer than I got to use it. Should have learned from the old Fuji I had and the one my in-laws have. The break and they S*ck! Call me a fool. My wife did.",
      "rating": 1.0,
      "verified": false,
      "author": "Michael Cusumano",
      "helpful_votes": 0,
      "publication_date": 20090624
    }
  ],
  "product_meta": {
    "title": "Fujifilm FinePix S2000HD 10MP Digital Camera with 15x Optical Dual Image Stabilized Zoom",
    "description": "Ps3) Fuji Finepix S2000Hd Digital\n\nFROM THE MANUFACTURER\nManufacturer's Description \n\n The FinePix S2000HD is a compact and lightweight 10-megapixel camera with an incredible 15x optical zoom lens and HD movie recording/output. The FinePix S2000HD is the first Fujifilm model to offer full compatibility with HDTV systems for both stills and movies. In addition to true HD movies (at 1280 x 720 pixels) and widescreen stills (at 1920 x 1080), the FinePix S2000HD's HD output allows the camera to display ultra-clear high-definition photographs and movies on an HDTV. An optional remote control makes viewing easier than ever. The S2000HD also features Fujifilm's unique Face Detection technology that automatically recognizes up to 10 faces in a frame and adjusts focus and exposure, while also removing red-eye in camera. Other key S2000HD features include continuous shooting up to 13.5 frames per second at 3MP, Dual Image Stabilization for blur-free images, and extensive photographic control including 13 scene position settings. \n\nFujiFilm FinePix S2000HD Highlights \n\nWide-angle to zoom, hassle-free\nThe high-quality Fujinon lens is engineered to perform at focal lengths from expansive wide-angle 27.6mm to dynamic 414mm zoom. That means the palm-sized FinePix S2000HD is always ready to shoot any scenario, with no need to stop and exchange bulky lenses. \n\n10-megapixel resolution\nThe 10-megapixel CCD sensor produces crisp, clear, vivid pictures, perfect for big-screen display or enlarged printing. \n\n\n\nDual Image Stabilization in action Dual IS(Image Stabilization)Mode\nDual IS (Image Stabilization) Mode combines CCD shift image stabilization and high sensitivity to minimize the effects of camera shake and subject blur, for crisp stop-action photos with great background detail, even when shooting at the maximum range of the zoom. \n\nHigh Sensitivity\nOffering maximum sensitivity of ISO 6400*, the FinePix S2000HD gives you the option of shooting without flash, even in limited lighting.\n*At ISO 3200/6400 resolution is limited to 5 megapixels. Full resolution (10.0 megapixels) is available up to and including ISO 1600. \n\nIntelligent Flash\nIntelligent Flash automatically calculates subject position, distance, and brightness of the scene, instantly adjusting ISO sensitivity and flash output to ensure optimum exposure of the subject and clear background detail. \n\nNatural Light & with Flash\nopt for Natural Light & with Flash mode, which takes the same photo in rapid succession with flash and without, at a single press of the shutter. Afterward, the two shots can be displayed side-by-side for selection. \n\n15x optical zoom\nThe high-quality Fujinon lens incorporates 15x optical zoom capabilities, producing extremely crisp and sharp zoom photos that capture all the subtle expressions and details of those important scenes. \n\nSuper Macro\nSuper Macro mode lets you focus as close as 1cm (0.4 inches), for startlingly crisp and clear full-frame close-ups of flowers, insects and other small subjects. \n\nInstant Zoom\nThis function was conceived to help capture moving subjects at high zoom settings. A selectable frame within the LCD screen makes it easy to track your subject within a standard viewfinder scene, while capturing and saving only the enlarged framed area of the image. \n\nFace Detection helps deliver dynamic portraits Face Detection & Automatic Red-Eye Removal\nFace Detection instantly identifies faces and optimizes focus and exposure, ensuring attractive people pictures every time. Selectable red-eye removal automatically detects and corrects red-eye reflections, ensuring beautiful flash portraits and party pictures. \n\nZoom Bracketing\nA single press of the shutter takes three shots at sequential rates of high zoom magnification. The original image, a 1.4x zoom image, and a 2x zoom image are all recorded to the memory card for later viewing and selection. \n\nContinuous shooting at high-speed 13.5fps, up to 33 Frames\nA high-speed continuous shooting mode is great for tracking moving subjects, and capturing split-second thrills of sports and other active scenes. \n\nContinuous shots preview\nThis handy playback function saves you having to play back each frame individually by showing a high-speed preview of images captured in continuous shooting mode. The frame-in-frame playback functions like a flip-book animation view to mimic a video sequence. \n\nHigh-Speed Playback\nThe High-Speed Preview function expedites image retrieval by allowing you to scroll through the entire contents of your memory card at a speed of approx. 10 frames per second. \n\nBig, bright 2.7-inch LCD display\nThe big, high-resolution LCD is coated with Wide View film, offering an expanded viewing angle for effortless selecting and viewing of results. \n\nMicro Thumbnail View\nUp to 100 photos are displayed simultaneously on the high-resolution LCD in 10 x 10 array, for instant selection of photos to view or print. \n\nVersatile shooting modes\nIn addition to a selection of re-programmed shooting modes, the FinePix S2000HD offers a range of versatile scene position settings to ensure optimum results in any photo situation. \n\nHD-compatible Functions \n\nHDTV-compatible photos & video\nDiscover the impact of full-screen high-definition TV display of photos and movies. The FinePix S2000HD lets you view high-definition images on your wide-screen HDTV. Able to capture both photos and movies in high-definition 16:9 format, it gives you images suitable for full, wide-screen display. You'll be surprised at how great those high-quality FinePix photos and movies look on TV. \n\nHD Framing Guide\nA convenient HD Framing Guide is displayed on the LCD screen/EVF, to help you ensure that all the image elements are also contained in the HD-compatible 16:9 image. This Guide lets you shoot standard-size images for photo printing, while keeping all the important elements within the HDTV image ratio too. \n\nConvenient playback\nNew selectable playback features let you sort still photos, continuous sequences, and movies, according to how they were shot, making it easier than ever to search for a specific sequence or image. Ten frames-per-second full-screen high-speed playback and 100 frames-at-a-glance micro thumbnail display also help you find your favorite image quickly and effortlessly. \n\nOptional HDTV connection kit\nOptional HD-S2 HDTV connection kit contains a cable and a remote control, making it easy to select and view high-quality FinePix images on your TV screen.",
    "rating": 3.3,
    "feature_bullets": [
      "10-megapixel sensor captures enough detail for photo-quality 18 x 24-inch prints",
      "15x optical zoom; wide-angle lens",
      "2.7-inch LCD screen; Dual Image Stabilization",
      "HD compatible",
      "Capture images to SD/SDHC memory cards (not included)"
    ],
    "specifications": {
      "Product Dimensions": "4.37 x 2.98 x 3.11 inches",
      "Item Weight": "15 ounces",
      "ASIN": "B001D0G56E",
      "Item model number": "S2000HD",
      "Customer Reviews": "3.3 out of 5 stars71 ratings3.3 out of 5 stars",
      "Best Sellers Rank": "#399,030 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 12, 2008",
      "Manufacturer": "FUJIFILM",
      "Language:": "English"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": 59.99
  }
}