{
  "website_summaries": [
    {
      "verdict": "This reasonably priced dollhouse won’t break the bank, but it still offers plenty of wow-factor with its generous size, elegant details, and novel features. A value-packed option that offers years of imaginative fun.",
      "pros": [
        "Just over 4 feet tall, this dollhouse provides plenty of room for growing kids to play",
        "Has 4 levels with 6 rooms and 2 balconies",
        "Charmingly decorated interior",
        "Intricately crafted, hand-painted furniture includes enchanting “working” accessories like an oven and refrigerator with doors that open and a swaying porch swing",
        "Dimensions and furniture accommodate 12” fashion dolls"
      ],
      "cons": [
        "Assembly directions could be easier to follow",
        "Putting it together can take a bit of time and patience"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "My girls love this house!",
      "text": "Bought this for my 8 and 3 year old girls. They love it. It arrived within two days of purchase and was fairly easy to assemble. It's not wooden but still sturdy enough for daily use. All of the furniture, with the exception of the tub and toilet, is wooden. I would have given it five stars but the one of the arms of the couch was completely detached when we opened up the package. We used craft glue to fix it.",
      "rating": 4.0,
      "verified": true,
      "author": "florida85",
      "helpful_votes": 14,
      "publication_date": 20161214
    },
    {
      "title": "Missing part",
      "text": "Christmas present for our daughter. Missing piece #16 which is the top floor. We can’t finish building her dollhouse- the ONE thing she asked Santa for. Livid and disappointed would be an understatement right now. The only positive to this is that it is a nice dollhouse but we can’t finish building it. Luckily our daughter is incredibly easy to please and she won’t mind, but that just breaks our hearts even more. Really really disappointed we couldn’t do this one thing for her.",
      "rating": 2.0,
      "verified": true,
      "author": "Mommarae09",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Great doll house",
      "text": "Awesome doll house, this was our daughter's birthday surprise gift and she was delighted to have it. Setup took around 2 hours but its super easy, just need patience.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20150915
    },
    {
      "title": "Despite my worries the dollhouse came in perfect condition. The instructions were easy to follow and ...",
      "text": "I was at first skeptical given that it such a large product to be shipped and thought that it would be slightly damaged when received. Despite my worries the dollhouse came in perfect condition. The instructions were easy to follow and assembling the dollhouse was effortless. The furniture that came with the dollhouse were of excellent quality including the upholstered couch which I thought provided an above and beyond accent to the decor. Barbie dolls or similar sized dolls compliment this dollhouse very well. I bought this gift for my niece as a Christmas present; and it did not disappoint. Her reaction was priceless and I would recommend this as a gift for any little girl.",
      "rating": 5.0,
      "verified": true,
      "author": "Joselyn Allen",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "You better read before assembly",
      "text": "The dollhouse came with all it's parts, and instructions (very important). You better read before assembly. Each part was numbered so it was good. Need two people to asemble. After it was built, it looked great! I went in and used a clear sealant to fill in any little gaps...it didn't need it, but I felt better and I was prompted to do this because the end of one of the roof panels was unpealed and to keep it down I sealed it. For the price, it was a good purchase. My grandkids love it and play with it all the time. Ages 5 (twins) I recommend this item completely. The house is pretty big.",
      "rating": 5.0,
      "verified": true,
      "author": "Gladys Fuentes",
      "helpful_votes": 2,
      "publication_date": 20150805
    },
    {
      "title": "GOOD VALUE FOR MONEY",
      "text": "GOOD VALUE FOR MONEY. LOTS OF PARTS, DO NOT OVER TIGHTEN SCREWS. SOME OF SCREWS DID NOT TIGHTEN SO I USED SOME ELMERS WOOD GLUE SINCE I WAS NOT GOING TO TAKE IT APART. LAY ALL PARTS OUT IN ORDER OF ASSEMBLY AND TAKE SCREWS OUT ONE AT A TIME AS THEY ARE LETTERED AS TO POSITION. READ DIRECTIONS CAREFULLY AND GOES TOGETHER WELL AND PRETTY STURDY ONCE ASSEMBLED. LITTLE GIRL LOVES IT, BARBIE DOLLS FIT IN NICELY. MUCH CHEAPER THAN EQUIV SIZE BARBIE DOLL HOUSE AND BARBIE LOVING LITTLE GIRL SEEMS PERFECTLY HAPPY AND NO COMPLAINTS EVEN THO WAS FIXED ON BARBIE HOUSE. PAID 85.00 AGAINST 195.00 GOOD BUY",
      "rating": 5.0,
      "verified": true,
      "author": "joel h mayne II",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "The Lamp Doesn't Light Up!",
      "text": "The description on this item is incorrect. My daughter specifically asked for a dollhouse with a light that works for Christmas, so I got her this thinking she would love it. She is 4--she will probably still like it. But I wouldn't have purchased it had I known that the lamp does not light up, which is what it says in the description. I assembled the dollhouse before I realized the description was incorrect, which took a couple of hours. Too late to send it back now. The item is being sold by the manufacturer, so it seems like it should be easy to get the description right.",
      "rating": 2.0,
      "verified": true,
      "author": "lindsay",
      "helpful_votes": 2,
      "publication_date": 20171122
    },
    {
      "title": "My daughter loved it!",
      "text": "We ordered this dollhouse for my daughter when she was 4 or 5 and she loved it and used it for around 6 or 7 years. It held up well and is still in fine shape. We're about to pass it on to our niece, who will hopefully love it as much as much as my daughter did.",
      "rating": 5.0,
      "verified": true,
      "author": "Emma's Mom",
      "helpful_votes": 3,
      "publication_date": 20160905
    },
    {
      "title": "This is a fabulous dollhouse. After reading some of ...",
      "text": "This is a fabulous dollhouse. After reading some of the reviews, I wondered whether to order? I didn't want to spend $400 or $500, so . . . to the people who complained about the quality or lack of wood throughout? You're paying a VERY fair price for a dollhouse that more than equals the price. If you want all the bells and whistles, hire a carpenter and quit your whining. Seriously.",
      "rating": 5.0,
      "verified": true,
      "author": "dabney",
      "helpful_votes": 2,
      "publication_date": 20161219
    },
    {
      "title": "Nice big dollhouse",
      "text": "Nice big dollhouse. Material is not too sturdy but anyway one isn't expected to sit on it. Replacement parts available with seller for 90 days. Would've been great if provided with an actual push-on light. However, no sample picture is provided that makes it difficult while assembling. Assembling takes approx. 3 hours, even for those whore good at this kind of work. But my kid likes it quite a bit.",
      "rating": 3.0,
      "verified": true,
      "author": "Monalisa",
      "helpful_votes": 0,
      "publication_date": 20161107
    },
    {
      "title": "Cute not perfect",
      "text": "It's a super cute looking house once put together however we are disappointed with quality. It isnt very sturdy and some of the boards had small bubbles due to them not being properly sanded or prepped. The important thing is my kids love it but I am a little upset about quality for price paid.",
      "rating": 2.0,
      "verified": true,
      "author": "Irina",
      "helpful_votes": 3,
      "publication_date": 20171118
    },
    {
      "title": "Super sweet doll house!",
      "text": "This doll house is absolutely amazing! It is so tall. My four year old daughter is four feet tall and it's taller then her. It is so pretty and very easy to put together. We have had great luck with all of our KidKraft products and this is no exception. When I decided to buy my daughter a doll house for Christmas it absolutely had to be a KidKraft brand because of the quality and price. The furniture that came with it is so sweet and will fit a variety of doll sizes. This is a piece of furniture in my daughters room and will last for years to come. I couldn't be happier with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jilly6",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "Good value, looks like it will last as long as nobody is rough w it",
      "text": "3 year old daughter loves it; decent quality for the price and cool accessories. Not the highest quality and not for rough use, but for the money it was better than expected. We weren’t expecting a $500 dollhouse for $100, and this exceeded our expectations. Takes awhile to put together but not difficult, would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "James E.",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Love it",
      "text": "Our daughter received this for her 3rd birthday and she hasnt stopped playing with it! We love it. It took my husband some time to build. So prepare For that, but we my husband built it when she was put to bed and we gave it to her built the next day for her birthday. Durable and sturdy. Worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "y&z",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "It was way better than the plastic Barbie dreamhouses you might get",
      "text": "Wow! I was really surprised at the features and presentation of this dollhouse. It was way better than the plastic Barbie dreamhouses you might get. The house is big enough for Barbie and her stuff. This dollhouse comes with some really neat furniture like a rocking cradle and an outdoor patio swing. It's well made and my girls really love it! For the cost this was an amazing purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina M",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Beautiful dollhouse!",
      "text": "This was a third birthday gift for my twin daughters. They were so excited when they saw it and have played with it every day since. The house is beautiful and seems well-made. Right now they use the KidCraft doll family dolls with it, which are on the small side for this huge house, but that doesn't bother them, and they will be able to transition to using Barbie-sized dolls as they get older. It took over an hour to assemble, but the instructions were easy to follow. Very pleased with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey",
      "helpful_votes": 0,
      "publication_date": 20151128
    },
    {
      "title": "**** FREAKING AWESONE for 9 YO!!!!",
      "text": "HUGE---- 9 YO birthday- she LOVES this. (Compare this doll house when complete, to old doll house.... (You'll feel bad you didn't get this AWESOME thing earlier)!!!! You screw this beauty together. Setup was 1-1.5 hours with my kids ages 9 & 11. (They helped by screwing things & stuff). (W/O kids setup is 30+ mins I bet). **",
      "rating": 5.0,
      "verified": true,
      "author": "danburke323",
      "helpful_votes": 2,
      "publication_date": 20170812
    },
    {
      "title": "Ikea could take a lesson from Kidcraft. All of ...",
      "text": "Ikea could take a lesson from Kidcraft. All of the pieces are numbered by sequence of assembly. Just stack them by number and the next piece is always at hand. An electric screwdriver or drill speeds up assembly. Our 6 year old triplet granddaughters took to the doll house immediately.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Sokol",
      "helpful_votes": 3,
      "publication_date": 20161127
    },
    {
      "title": "But I love this so much I had to",
      "text": "I don't normally write reviews. But I love this so much I had to. we bought this for my 5yo daughter for Xmas. I knew it was tall but when my husband sat down to build it (took maybe 1/2hr) and then at one point he had to stand to finish it!!! Fits barbies perfectly. And isn't the hotline flimsy plastic Barbie house that costs more than this. The quality was amazing. And it's very sturdy. I suspect this will be a lifetime toy that my some day far away grandkids will play with.",
      "rating": 5.0,
      "verified": true,
      "author": "Thielen5",
      "helpful_votes": 3,
      "publication_date": 20160301
    },
    {
      "title": "Love this dollhouse",
      "text": "This dollhouse is AWESOME. Great quality and love that it came with furniture. My husband put it together in less than a couple hours. Barbies can play easily in this house. My 2 year old daughter loves playing with this house and I see this lasting for many years. Very happy with this purchase and highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "TurtleMelon",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Good dollhouse, just received broken piece :(",
      "text": "This was bought for my grand daughters 5th birthday. It took us a while to assemble as the instructions are not very clear and they certainly don't mention color coded screws and where they go. She loved it, good quality. When we opened up the furniture the couchs side arm was broken. I could not find a number to contact anyone for replacement.",
      "rating": 4.0,
      "verified": true,
      "author": "stratusbo",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Nicely made, lots of accessories",
      "text": "I have had this product in my home for just over 4 years. It has stood the test of time, and my kids still enjoy playing with it. It's very large, (still taller than both of my girls) and it is always a big hit with visitors when they come over for playdates. I would recommend this to anyone with children ages 3-11 (depending on whether they still play with barbies). It's pretty to look at, so even when they are not playing with it...it looks cute in our den. It also comes with a lot of accessories/furniture, which is nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Joy",
      "helpful_votes": 0,
      "publication_date": 20141217
    },
    {
      "title": "Cute",
      "text": "Cute little doll house. One of our floors was warped so the floorboard wouldn’t stay in. Had to do some DIY to make it work but it’s now been standing for several years. Kids love it.",
      "rating": 4.0,
      "verified": true,
      "author": "MM",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Really nice dollhouse",
      "text": "This is a great, sturdy, quality dollhouse. The furniture is adorable. It took almost two hours to put together, but it wasn't difficult and all the pieces were clearly marked. It's also a lot bigger than it looks in the pictures -- take note of the size. There is a loop to attach it to the wall so kids can't pull it over on themselves. My nieces love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "Worth it!",
      "text": "This house is beautiful and pretty straight forward to put together following the directions. It took my husband about an hour to do so. The only tip is to make sure you are screwing in the correct screws into the appropriate holes as they are color coded to match the dollhouse backgrounds. The furniture is adorable and fits my daughter's Barbies perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "BA",
      "helpful_votes": 2,
      "publication_date": 20170816
    },
    {
      "title": "Great dollhouse",
      "text": "Very impressed, and my 4 year old loves it! It took about an hour to put together (took my time), and all that's needed is a phillips head screwdriver. Seems to be very nice quality. The stairs, posts, and railing are all sturdy plastic, but I didn't have any issues with them breaking while putting in the screws. The furniture is all all nice, solid wood. The pictures\\colors are all very vivid and nice. Great dollhouse.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen D.",
      "helpful_votes": 0,
      "publication_date": 20160723
    },
    {
      "title": "Absolutely Love!!",
      "text": "This doll house is amazing. It's beautifully painted and there is so much room and space for all types of dolls. Even barbies. The set up took about an hour and a half but the instructions were easy to follow and everything is labeled. My only problem with it is that it was missing the string for the swing. But I have my own yarn so I just used that. I really like that the screws are colored so they match the house inside and out which makes them less noticeable.",
      "rating": 5.0,
      "verified": true,
      "author": "teresa schneider",
      "helpful_votes": 0,
      "publication_date": 20151029
    },
    {
      "title": "Beautiful dollhouse!",
      "text": "You will not regret this purchase!! It is more beautiful in person and the best quality in the category. I returned the first two similar dollhouses I ordered (hint: bigger is NOT better) because they both broke during assembly. This one is a classic design and made of higher quality materials. Our two-year-old daughter is fascinated and I’m sure she will play with it for years to come. This is the dollhouse I would have definitely envied as a child!!",
      "rating": 5.0,
      "verified": true,
      "author": "eevans",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Nice, but need two people to put together",
      "text": "Pros: Fits Barbi dolls. Solid construction. Classy look versus other options. Good price. Cons: Needed help putting together. The master bed drapes never look like the picture and always just end up on the floor. Dolls don't sit in the swing well. The room layout is odd, but whatever, the kids won't know. Bottom Line: My daughter plays with this every day and is her go-to toy. She now has an Ikea step stool to get to the top floor aka \"the baby room.\" Only minor things to complain about really. I did need help putting it together as it is a little tricky getting the panels lined up while you tighten the screws down.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130819
    },
    {
      "title": "Great Purchase",
      "text": "I am very impressed by the size and quality of this item. It is the perfect size for Barbie dolls, but substantially less expensive than Barbie brand houses. It comes with a large amount of furniture. There is something for every room. The only negative is that the instructions were a little confusing. It took longer than expected to build it. All in all, I am very happy with this purchase. My daughter absolutely loves it.",
      "rating": 4.0,
      "verified": true,
      "author": "tchad23",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Did not receive dollhouse just furniture.",
      "text": "Only received the furniture and 2 roof pieces. No doll house. So very disappointed. Not sure what is going on lately.",
      "rating": 1.0,
      "verified": true,
      "author": "Rebecca L Bovitt",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Quality and structure absolutely amazing..!!!!!!!!!!!!!!",
      "text": "I'm sooooo in love with this dollhouse. I got it for my daughter's 6th birthday and she didn't want to go to sleep cuz she wanted to keep playing with it. Even my sons loved it and they spent all afternoon playing with it. I would definately recommend this dollhouse to everybody. The building part was a lil tricky but not imposible. Very well built. I will definately buy my daughter another one of these dollhouses once this one gets ruined.",
      "rating": 5.0,
      "verified": true,
      "author": "cynthia",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Great doll house and great price. Great Gift. My daughter loves it.",
      "text": "This dollhouse is reminicient of the Historical homes on the bay in Charleston, SC. It is taller than my 6 yr.old and she loves it. Great Gift! I gave it 4 stars because the canopy bed which could have been beautiful was plain and cheap looking. I will try to redo it. The other furniture was nice. I liked the spindle side porches, especiallly. My daughter has an idea to build a flower garden on the porch:) My daughter noticed right away that the lovely stairs from the first floor to the second do not go to the third. I said use your imagination. For $109.00 this is a great wooden doll with class and style.",
      "rating": 4.0,
      "verified": true,
      "author": "Esme",
      "helpful_votes": 0,
      "publication_date": 20121226
    },
    {
      "title": "Love this.  It will make my 3 year old's Christmas since she has been wanting a large house for barbies.",
      "text": "It is the same price or less money than many of those what I think are cheap looking-plastic hot pink barbie houses and this has a more classic feel, with mostly wood components and some pressboard. The furniture is very cute too. My husband assembled this on Christmas Eve. He is pretty handy and it took him about 1.5 hours, so if you are not handy, you might want to give yourself 2 hours or so for assembly. My daughter awoke on Christmas morning to find this. Has not stopped playing with it since.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruthie",
      "helpful_votes": 0,
      "publication_date": 20131216
    },
    {
      "title": "Love the dollhouse",
      "text": "Super cute doll house. Fits Barbie just fine. Bought this instead of those flimsy plastic ones since I have three girls I wanted it to last. I would have loved something like this when I was little. Super cute details, easy instructions and it comes with tons of cute furniture. My sis-in-law bought one like this for double the price so this was an awesome deal!",
      "rating": 5.0,
      "verified": true,
      "author": "Alyson W.",
      "helpful_votes": 0,
      "publication_date": 20160320
    },
    {
      "title": "My kid loved it. Great buy.",
      "text": "Very sturdy. took about 1 hour for me to build with a handheld screwdriver. would go much faster with an electric one. Directions were easy to read and they sent extra screws in case you lose any. Very tall. My daughter is 4 and its taller than her. The furniture is sturdy and much better than I expected. Barbie can easily fit inside. Furniture fits Barbie. I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "tiffany hickman",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "Doll House for Fun",
      "text": "This doll house offers a lot of opportunities for kids from the age of 3 up to use their imagination. For the most part the construction is good quality and it is easy to assemble. The only problem we had was the composite floor for the second story was not quite wide enough and when a small hand pressed down on it, it gave way and sagged at one end. We used glue to keep the flooring (after taking the house almost completely apart) in the groove but that may not be a permanent fix. This is the only complaint, otherwise, this is a great toy for playing house or displaying your dolls--Barbies are the perfect size.",
      "rating": 4.0,
      "verified": true,
      "author": "R. W. Owens",
      "helpful_votes": 0,
      "publication_date": 20120101
    },
    {
      "title": "Cool Dollhouse",
      "text": "My kids love this doll house. It's a pretty good height. I have two 5 year olds and a 9 year old and they haven't destroyed it yet. It's pretty durable! It's got cute designs on the walls. It comes with some great furniture pieces, that are also quite durable. We have had the house for a year and a half and in that time we have moved. It's managed to stand the test of time and children so far! It's great for their imaginations! They can sit for hours decorating the house and playing with their dolls. I am definitely pleased with this purchase & would recommend it to anyone!!",
      "rating": 5.0,
      "verified": true,
      "author": "LindsD",
      "helpful_votes": 0,
      "publication_date": 20121207
    },
    {
      "title": "Great buy",
      "text": "The walls and floors weren't as sturdy as I'd imagined and some of the edges were slightly damaged but it happened to not be in a spot that was visible. My daughter is 3 years old and has years to fully grow into this doll house but loves it so much! I would buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Trina Swearengin ",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Floor Support",
      "text": "My five year old loves this. The 3rd floor had some difficulty with staying locked into its slots and the dolls would experience some catastrophic events of falling to the next floor. This occurred within the same week we put it together. We were able to use all-purpose caulk to strengthen the 3rd floor into its slots so that it would stay together. So far, it has held together through a relocation and is still holding the dolls and the doll furniture without problem. I would absolutely recommend this doll house for any little girl. My daughter is almost 6 and still plays with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Lacey",
      "helpful_votes": 0,
      "publication_date": 20130802
    },
    {
      "title": "Pretty Dollhouse",
      "text": "This really is a beautiful dollhouse. I am very pleased with the purchase. But it is quite tall. It is hard to see into the nursery even for my 5 year old daughter. Actually, when she stands up to the dollhouse, the top of her head barely reaches the floor of the nursery. I think we are going to start using it for storage of her barbies or car or other accessories that she isn't using at the time. It is super cute. She loves the stairs. It would be fun if it came with some food or other little accessories.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20140609
    },
    {
      "title": "Wonderful DURABLE product!",
      "text": "Such a fantastic purchase!!! It’s made of good strong wood and my daughter and ALL of her cousins and friends love it!!! She’s almost tall enough to use the third story floor :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "I absolutely love it!",
      "text": "So after reading some of the reviews, i have to say that some people sure are picky! This doll house is huge! I think it's pretty darn sturdy, not for kids to climb on but it's very sturdy! As far as putting it together, it was a cinch! Took 2.5 hrs for me to do it ALONE. I put glue in some of the joints but if you tighten it up you really dont need it! The furniture is well made and is big enough for barbie! This is a wonderful doll house, i'm happy i made this purchase for my daughter and would reccommend this to anybody!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sky Gazer",
      "helpful_votes": 180,
      "publication_date": 20101225
    },
    {
      "title": "beautiful doll house",
      "text": "This is such a classy, beautiful doll house. I looked around a lot and love KidKraft products (we also have the white kitchen, which is gorgeous!)",
      "rating": 5.0,
      "verified": true,
      "author": "Emily N Vanden Heuvel",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Perfect for family of 4 girls!",
      "text": "We have four daughters and needed something that all four girls could play with together. This is perfect. It took my husband about 1 hour to assemble it. Screw holes were good and things were labled correctly. The wood is sturdy and seems like it will last for a while. The house fit barbies perfectly. My youngest can not reach the attic but has plenty of space to play at her level. The pieces are great and very cute. I bought some accessories at Target and they work great with this doll house. Overall this dollhouse is GREAT!!! I highly recommend it to anyone with daughters.",
      "rating": 5.0,
      "verified": true,
      "author": "K Riley",
      "helpful_votes": 0,
      "publication_date": 20091226
    },
    {
      "title": "Savannah Dollhouse",
      "text": "Directions were easy to follow and house was so easy to put together, with a hand drill it took me about an hour. The \"wall decor\" is part of the walls, so there is no having to put stickers on yourself so that you kid can just remove and loose them later. The furniture that comes with the house seems solid and sturdy. I read a lot of other reviews on many different dollhouses and this one seemed to be the best value and I am so happy with my choice! And so is my daughter. She is only three years old, so she will get years of use out of it.",
      "rating": 5.0,
      "verified": true,
      "author": "torilorilu",
      "helpful_votes": 0,
      "publication_date": 20120912
    },
    {
      "title": "Loved it",
      "text": "We bought this doll house for our 5 yr. old daughter. We did an extensive re-search before settling for this one. This was the first time I put together a doll house and the assembly instructions aren't very detailed. It took me a little over 2 hours to put it together. No other complains here. Overall very satisfied, the furniture in the house is more like miniature furniture as opposed to \"toy\" furniture. The price is almost half of other doll houses that carry the same attention to detail and size. Definitely the best bang you'll get for your buck.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Lam",
      "helpful_votes": 0,
      "publication_date": 20101208
    },
    {
      "title": "Great Doll House",
      "text": "Really nice quality doll house. Got this for my daughter, and she LOVES it! It's got some nicely done furniture that comes with it. It's very nicely made. I was incredibly pleased with it in every way except for one. It came with NO INSTRUCTIONS for how to build it. That was pretty okay for me, but if you're someone who wants step by step instructions, you may be slightly disappointed. I would give this a 5 star since my daughter loves it, and it's great looking, but the lack of instructions for assembly knock it down a star.",
      "rating": 4.0,
      "verified": true,
      "author": "Allison & Bill Dunn",
      "helpful_votes": 0,
      "publication_date": 20101226
    },
    {
      "title": "Solid dollhouse, mediocre finishes",
      "text": "This dollhouse is solid and my 5 year old loves it. Assembly was easy and the overall look is good, but the finish on the walls, especially where the doors were cut out, was chipped in many places. You cannot tell from afar, but up close it is very noticeable. I am worried that it will continue to chip over time. However, my daughter hasn’t noticed and loves to play with it.",
      "rating": 3.0,
      "verified": true,
      "author": "MelindaS",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "I was hoping for wood.",
      "text": "My kid loves it. the directions are easy to understand and put it together. I am not a handy person and but it together in only 2 1/2 hours. I wish it wasn't made out of particle board. For the price I was hoping for wood. I don't think I will ever NEED to buy another, but would buy it again if I had to go back and do it again.",
      "rating": 4.0,
      "verified": true,
      "author": "David Harris",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "Awesome Barbie House!",
      "text": "Santa brought this to our daughter this year. The assembly was easy and the furniture is GREAT QUALITY. I'm so happy we got this one instead of the plastic Barbie brand stuff. I think it will last for generations if we take care of it properly.",
      "rating": 5.0,
      "verified": true,
      "author": "jeniunderscore82",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Surprisingly beautiful",
      "text": "I got this for my 6 year old for Christmas and have to say we both LOVE it. ;) It was easy to put together and I was pleasantly surprised by the furniture. There are little round number stickers on each part that are a bit too sticky that will tear the product if you try to remove them. I just left them on. You barely notice them anyway. I'm hoping that she will take care of it so that she will have it for years to come and possibly hand down to her daughter. I would've loved to have something like this when I was little. ;) Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of 4",
      "helpful_votes": 0,
      "publication_date": 20110104
    },
    {
      "title": "My 3-year-old granddaughters love the house",
      "text": "My 3-year-old granddaughters love the house, but they aren't tall enough to reach the top floor, baby room. It does take quite a bit of time to assemble, so you need to plan ahead.",
      "rating": 4.0,
      "verified": true,
      "author": "Mtn. Lady",
      "helpful_votes": 2,
      "publication_date": 20170524
    },
    {
      "title": "the packaging arrived in terrible condition and i was concerned with the product being ...",
      "text": "my granddaughter totally loves it and so did i. the packaging arrived in terrible condition and i was concerned with the product being damaged, it was wet on one end and had been taped up all over the box. there was a bit of wet damage on a corner but i let it slide . other than that the doll house was a huge success!, very pretty colors etc",
      "rating": 5.0,
      "verified": true,
      "author": "teresacherry",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Great dollhouse",
      "text": "After seeing some reviews that this dollhouse was cheaply made, I was hesitant; however I'm happy to report that we were very pleased with the quality of the dollhouse. It's not 5 star quality but I think it's definately good quality for the price you pay. It's a good value. My little girl is 4 and she loves it. My almost 2 year old does as well but she is more destructive so we keep her away from it. We bought some Fisher Price Loving Family sets and dolls for it which our girl loved and she also plays polly pocket dolls in the house.",
      "rating": 4.0,
      "verified": true,
      "author": "Renae",
      "helpful_votes": 0,
      "publication_date": 20130102
    },
    {
      "title": "Prefect size for barbies.",
      "text": "My daughter still plays with this doll house and loves it. The only gripe it have is the floors will not hold up to weight. To fix this I went to a craft store and bought some wooden beams and glued them to the bottom of the floor and problem fixed. Also know that my daughter sometimes will use the doll house as a shelf for her toys so that has been the main reason for the floors bowing. Would recommend this doll house to any one with a little girl that likes barbies.",
      "rating": 4.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 0,
      "publication_date": 20140213
    },
    {
      "title": "But it was easy to fix",
      "text": "My 4 yo loves it! When putting it together it the two side panels were switched. The directions were wrong. But it was easy to fix. It took about an hour and a half to two hours to put together.",
      "rating": 4.0,
      "verified": true,
      "author": "Nicole F.",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "loved it",
      "text": "Bought it as a xmas gift for my 4 year old. I got in November, just in case, and kept it hidden till xmas day. It took me around 3 hours to put it together but it was worth it. When I was choosing the house, one big concern was that it would not fall apart if someone bumped on it or played more cheerfully with it; it was a very good choice. The house is very sturdy, the finishing is pretty good and the pieces of furniture that come with it are very neat. It is taller than my daughter and she really loved the present. Not cheap, but a very good choice.",
      "rating": 5.0,
      "verified": true,
      "author": "sissoca",
      "helpful_votes": 2,
      "publication_date": 20120106
    },
    {
      "title": "Dollhouse",
      "text": "It was pretty nice. I have an older one that has all wood and it seemed much sturdier. This one has a lot of plastic mixed in with the wood and it's still a really cute house I just like the solid would personally",
      "rating": 3.0,
      "verified": true,
      "author": "Shannon Stagner",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "Happy Mom",
      "text": "Best dollhouse ever! My daughter loves it and plays with it all the time. It is well made and would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "lakita",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "... having the right holes but making our own worked fine. Took about 45 minutes for my husband to ...",
      "text": "We had a small problem with the roof not having the right holes but making our own worked fine. Took about 45 minutes for my husband to put it together .",
      "rating": 4.0,
      "verified": true,
      "author": "Alyssa",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Very cute, but also solid and durable.",
      "text": "We bought this for my daughter 2 years ago when she was 3. It is solid and still in perfect shape and is played with on a weekly basis as her little sister is now 3 as well. It took a little bit of time to put together but well worth it compared to a lot of other more cheaply made doll houses. This one is big enough for all her barbies and monster high dolls and did come with a lot of starter room accessories. I would recommend any dollhouse or kitchen from Kidkraft!",
      "rating": 5.0,
      "verified": true,
      "author": "Kari Van Lanen",
      "helpful_votes": 0,
      "publication_date": 20131209
    },
    {
      "title": "My 7 year old loves it",
      "text": "It's tall! It's nearly taller than my 7 year old. I'm glad I went with this over the Barbie dream house, which seems cheep and plastic in comparison. This house seems higher quality.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Trudeau",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Savannah Dollhouse - Very Nice!",
      "text": "Prosuct arrived very promptly and in excellent condition (as normally is the case with Amazon). Asssembly was very easy - took about 3 hours with hand tools. There were a couple of spots where an extra set of hands would have been nice to hold subassemblies while I screwed them together, but I managed reasonably easliy by myself. Fit and finish of the dollhouse is excellent. I can hadly wait to see the smile on my granddaughter's face on Christmas Eve!",
      "rating": 5.0,
      "verified": true,
      "author": "Deep in the Heart of Texas",
      "helpful_votes": 0,
      "publication_date": 20121209
    },
    {
      "title": "Dollhouse",
      "text": "Well done for girls . They really enjoys it . Thanks",
      "rating": 4.0,
      "verified": true,
      "author": "John M",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "GREAT DOLLHOUSE at a GREAT PRICE",
      "text": "The walls are not solid wood, but the frame and all of the furniture is, at this price I found the house to be a steal and so very worth the price. The only item which I (as an adult which is not who the house is meant for) found to be ill fitting was the porch swing, which does not stay level. My five year old, three year old and all the neighbor hood kids seem to have no issue with this at all. FYI. Couldn't be more pleased, and it took me about 1 to 1.5 hours to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "CB",
      "helpful_votes": 0,
      "publication_date": 20100208
    },
    {
      "title": "This doll house is perfect for my girls",
      "text": "This doll house is perfect for my girls! The furniture that is included is adorable and very good quality. So glad we bought this!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Whitehouse",
      "helpful_votes": 2,
      "publication_date": 20170317
    },
    {
      "title": "Five Stars",
      "text": "Really nice. Was worried about ordering online but got 2 for my granddaughters. They are nice heavyweight quilty",
      "rating": 5.0,
      "verified": true,
      "author": "Angela 2584",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "Not Great Quality",
      "text": "The second floor keeps popping out and frustrating my daughter. To put it back in, you have to disassemble half the house (takes about an hour). This kept happening and I called the company. They promptly sent me some replacement pieces at no cost to me. Sadly, the second floor continues to pop out. I have given up trying to fix it. Also, the bed broke too easily. I was disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "Mamma2",
      "helpful_votes": 0,
      "publication_date": 20141215
    },
    {
      "title": "Fun Dollhouse",
      "text": "My granddaughter loves this! It's big, and she can arrange the furniture any way she likes. (She likes the tub in the living room for some reason.)",
      "rating": 5.0,
      "verified": true,
      "author": "CCReader",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "More than I could have hoped for!!",
      "text": "Seller was beyond amazing to work with. Product took some time to put together (a little over an hour), but the instructions were easy to follow. Sturdy. Huge. Fits full size Barbie dolls. Beautiful! I had one VERY happy little lady.",
      "rating": 5.0,
      "verified": true,
      "author": "Jes Morgan",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Good - but can improve materials",
      "text": "My Daughter loves it...I must say I would recommend Kid Kraft makes it out of a different material... we have had ours for a year and the floor boards curve down with a lot of use. Its made out of a thick cardboard type material and wears easy! It's HUGE! And my daughter gets a lot of good use out of it!",
      "rating": 3.0,
      "verified": true,
      "author": "TaraFAMOF6",
      "helpful_votes": 0,
      "publication_date": 20150115
    },
    {
      "title": "Would probably not buy again",
      "text": "This was bought for two children to play wooden dolls and Barbie size dolls with. The dollhouse wasn't easy to put together. Some of the edges go a little smashed up in the process of putting it together. It just isn't well made. I don't think it will stand up to heavy use since it isn't wood. It is more like very heavy cardboard.",
      "rating": 3.0,
      "verified": true,
      "author": "Chili Pepper",
      "helpful_votes": 0,
      "publication_date": 20141024
    },
    {
      "title": "Poor customer service after talking to a representative who could ...",
      "text": "My daughter loves the dollhouse, with one problem. After opening it up a few days before Christmas, we noticed several pieces of furniture were​ broken. Amazon will not replace the broken furniture only replace it. This thing takes 2 hours to build so is not worth the disassembly and reassembly of the replacement house. Poor customer service after talking to a representative who could barely speak English. If you are going to buy this make sure to open everything ahead of time before assembling it.",
      "rating": 3.0,
      "verified": true,
      "author": "Judson Farrer",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "Very nice doll house",
      "text": "This is a great doll house with lots of detail and solidly built. I wish the furniture and accessories were a tad bit smaller, as we are not really into Barbie at our house, which is about the size the house is built for. But overall it is a great set. I feel like we need to add more to it though to add more opportunities for setting up play scenes.",
      "rating": 4.0,
      "verified": true,
      "author": "OutdoorsyMom",
      "helpful_votes": 0,
      "publication_date": 20150816
    },
    {
      "title": "dissapointed",
      "text": "I loved the doll house itself but I was not pleased with the way it was packaged or delivered. The house was broken in two places that we couldn't put floors in. Being that it was a Christmas present we didn't want to return it in fear that we would not receive it on time. We had to nail the house together. Nails everywhere. We really need another one I'm in fear that my granddaughter will get scratched with the nails.",
      "rating": 2.0,
      "verified": true,
      "author": "Maria L. Shields",
      "helpful_votes": 0,
      "publication_date": 20140110
    },
    {
      "title": "Good price, you get what you pay for.",
      "text": "First off, for the money it seems like a good deal. It took about an 1.5 hours to complete and not every peice lines up well. I am not sure if a better quality doll house is any different price wise, but I'm thinking you get what you pay for. Overall, like all Amazon products, price was good and shipmant was quick.",
      "rating": 4.0,
      "verified": true,
      "author": "CHRIS",
      "helpful_votes": 0,
      "publication_date": 20161225
    },
    {
      "title": "Best Design-Easy Install Dollhouse",
      "text": "Beautiful design, easy to install. My 12-years old is able to put together for the 7 years old within 1 hour. No wall-paper to glue to. All walls had been painted, decorated. Instruction is very easy to follow. I definitely recommended for those want to buy and afraid of having hard time to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry",
      "helpful_votes": 0,
      "publication_date": 20150412
    },
    {
      "title": "sturdy",
      "text": "Beautiful doll house. we were able to assemble it using the directions and a little commen sense. We did use some glue to stick the staircase in place.",
      "rating": 5.0,
      "verified": true,
      "author": "A. MacArthur",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Excellent Quality Lots of Fun",
      "text": "Beautifully detailed dollhouse. This dollhouse is huge- make sure you check he measurements carefully. My daughter has now had this for two years. She plays with it very often. The best part is that she uses her 12\" princess dolls and Barbie dolls in the house so there is no need to buy special dolls to fit inside. Lots of enjoyment!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mamabel",
      "helpful_votes": 0,
      "publication_date": 20140815
    },
    {
      "title": "Five Stars",
      "text": "Needs better instructions to put together BUT other than that it’s amazing!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy potter",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "Great dollhouse",
      "text": "My daughter likes this dollhouse a lot. It is very neat and I love to see kids imaginations at work. We did buy extra furniture so it was even better. It came with a good amount though - quality like too. Me and my husband put this together in about a hour. My ONLY complaint is that the 3rd floor doesn't stay in good. It keeps coming down on the one side. I may use super glue or something else to hold it - that is my only annoyance :)",
      "rating": 4.0,
      "verified": true,
      "author": "Kara Ross",
      "helpful_votes": 0,
      "publication_date": 20130119
    },
    {
      "title": "Super cute. Much bigger than expected and holds a ...",
      "text": "Super cute. Much bigger than expected and holds a ton of barbies with lots of room to spare. Quality is much better than the plastic Barbie houses, but not quite as good as I had hoped (The scenic covering over the veneer started peeling up almost instantly and the stair case is a flimsy plastic). Would still buy again. Allow 2 hours for assembly.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "The most beautiful doll house a girl could wish for...",
      "text": "Absolutely love it! It took us about 2 hours to put it together but it was worth every minute of it. The instructions were sufficient and all you need is a screwdriver, and patience. It is very tall, for a 3 year old, but it only means that she will play with it longer. There are very many cute details about it. It is good enough for Barbies, but some of the furniture looks out of place in it. Still my daughter LOVES it and so do I!!!",
      "rating": 5.0,
      "verified": true,
      "author": "JessysseJ",
      "helpful_votes": 0,
      "publication_date": 20111227
    },
    {
      "title": "Beautiful dollhouse",
      "text": "House is everything we expected. We bought this as a Christmas present for my 3 year old. Once she saw the house she never stopped playing with it. She stayed in her pajamas all Christmas day play with her dolls and the dollhouse. The only disappointment was that the stairs were not in the box, But we are calling KidKraft to get a replacement. I am 5'4 and when I saw the dollhouse I had to do a height check. The description does not give the size of the house justice. Took my husband 2 1/2 hours to put it together and yes you do need a drill. I recommend this product. Happy New Year!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Shellie G",
      "helpful_votes": 0,
      "publication_date": 20121226
    },
    {
      "title": "Exelant",
      "text": "Best toy ever my kids plays with it every day for last year.",
      "rating": 5.0,
      "verified": true,
      "author": "krzysztof",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Best dollhouse for the money, period!",
      "text": "I purchased this dollhouse for my 11 year ould sister over Christmas and put it up. I thought the box was big, but this thing is huge! She had a lot of fun and is still enjoying it, plus you can store things on the roof- she put a boombox up there to listen to CD's. It is easy to assemble, took me about 45 minutes. I would recommend this to anyone, it truly is sturdy and fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Lindsey",
      "helpful_votes": 0,
      "publication_date": 20120405
    },
    {
      "title": "Four Stars",
      "text": "Good starter doll house. Its great the rooms are big and high, can use different size dolls.",
      "rating": 4.0,
      "verified": true,
      "author": "P.L.",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Excellent! Wonderful! Fun for all!",
      "text": "Greatest gift for our 3-yo granddaughter! It took about 2 hours to assemble, but was easy. Good quality and very fun for the grands!",
      "rating": 5.0,
      "verified": true,
      "author": "Jingle57",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Excellent Choice for Our 3 Year Old Daughter!",
      "text": "Great dollhouse for my 3 1/2 year old daughter! We bought it for her for Christmas 2014, and she absolutely loves it! She plays with it every spare moment. It's definitely big- she needs a step stool to reach the top level of the house, but it is very good quality and has adorable scenes in each room. It wasn't hard to put together at all, the directions were very easy and my husband and I put it together in less than an hour. My only wish is that it came with a few more pieces of furniture, but maybe we can find some to add to it online!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20150103
    },
    {
      "title": "Oh this was a big hit with 3 little girls ...",
      "text": "Oh this was a big hit with 3 little girls. It is much larger than I expected but very well built. It takes some time to put together but well worth the effort. Took 2 people about 3 hrs to assemble .",
      "rating": 5.0,
      "verified": true,
      "author": "Teacher",
      "helpful_votes": 0,
      "publication_date": 20160101
    },
    {
      "title": "Packaging was damaged",
      "text": "I ordered this for a christmas present for my grandaughter. They did not wrap it in a separate box or packing paper but just shipped it in the original manufactures box it came in. The doll house box arrived severely damaged from shipping. Fortunately the manufacture packs the pieces well so we were able to assemble it but it did not make a very pretty present in a severely ripped box. My grandaughter did love the doll house. It is large enough for her to play with it with another frienh",
      "rating": 3.0,
      "verified": true,
      "author": "Nancy O'Connell",
      "helpful_votes": 0,
      "publication_date": 20140110
    },
    {
      "title": "Great Product",
      "text": "After reading many reviews I decided to purchase this product for my year old granddaughter. A friend and I decided to put it together one afternoon before Christmas. After reading and print one review we followed their recomemdations and it took only about 2 hours to complete. Both of have experience putting things together and with the both of us it wan's to bad. She loved it on Christmas morning!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki Douglas",
      "helpful_votes": 0,
      "publication_date": 20121226
    },
    {
      "title": "Melted siding.",
      "text": "We received this wonderful doll house and assembled it on Christmas eve. Only to find a defective piece. Somehow it was melted and then packaged. So dissapointed that we spent this kind of money only to have it come already broken.",
      "rating": 2.0,
      "verified": true,
      "author": "Chelsea",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Wow.",
      "text": "It's tall: about five feet or so. Easy to put together: instructions good, and we were helped by a child. Use the picture on the box and the pictures on the sides of the pieces (living room, bathroom, etc.). Time to put together: about 30 to 45 minutes, relaxed pace. Wonderful that it also comes with furniture.",
      "rating": 5.0,
      "verified": true,
      "author": "Just My Opinion....",
      "helpful_votes": 0,
      "publication_date": 20130818
    },
    {
      "title": "Great doll house",
      "text": "I have a 6 year old and a 3 year old and they both love this house. They play with it everyday, not only with Barbies but also with Super heroes and any other toy. I also liked the furniture that came with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Fiore Denis",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Very Nice",
      "text": "We purchased this dollhouse for my 4 yr. old grandaughter for Christmas this year. The assembly was a bit daunting...it took two of us to get it together. It probably took about an hour and a half for us to complete assembly. She loves it, it is very sturdy and I am sure will provide many many hours of fun playtime. The furnature included is real wood and very nice. I would recommend this.",
      "rating": 4.0,
      "verified": true,
      "author": "S. KIN",
      "helpful_votes": 0,
      "publication_date": 20110102
    },
    {
      "title": "Easy setup with only a screw driver or cordless drill",
      "text": "Everything as expected. Easy setup with only a screw driver or cordless drill.",
      "rating": 5.0,
      "verified": true,
      "author": "Barnfam",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Love it",
      "text": "It was a bit of a pain to build. It took a couple of hours and lots of frustration because the directions aren't the best. It's sturdy once built. My six year old can reach the top floor but can't quite see into it yet. It fits barbie size doll easily. The swing doesn't allow for a doll to sit on it hands-free, it kind of tips the doll out of it.",
      "rating": 5.0,
      "verified": true,
      "author": "CT",
      "helpful_votes": 0,
      "publication_date": 20140207
    },
    {
      "title": "Solid dollhouse",
      "text": "This thing is solid. My daughter cartwheeled into it and it didnt even move. I build it by myself with a manual screwdriver on christmas eve and it took me 2 hours. I even put one of the panels upside down but hey, its holding up lol",
      "rating": 5.0,
      "verified": true,
      "author": "karen",
      "helpful_votes": 0,
      "publication_date": 20200228
    }
  ],
  "product_meta": {
    "title": "KidKraft Savannah Dollhouse with Furniture",
    "description": "Savannah Dollhouse\n\nAMAZON.COM\nThe Savannah Dollhouse is an elegant, large six-room mansion designed for children ages three and up. The dollhouse is decorated like a true southern mansion and is fully furnished, with beautiful, handcrafted wood furniture. Your daughter will enjoy playing house with her dolls in this fully furnished four-story dollhouse.\n\n \n\nSavannah Dollhouse  * Ages:\n * \n * \n * \n * Requires:\n * Adult assembly\n * Phillips screwdriver or powered screwdriver\n\nWhat We Think\nFun factor: \nDurability: \nEase of assembly: \nEducational factor: \nEducational factor: \n\nThe Good: Standing at 51 inches tall, the dollhouse won't be outgrown as your child gets taller.\n\nThe Challenging: Though an Allen wrench is included, you may want to use a powered screwdriver since there are over 30 screws and bolts.\n\nIn a Nutshell: A beautiful dollhouse with four levels and six rooms of open space. \n\nThis spacious, southern mansion is features beautiful, handcrafted wood furniture. \nElegant Dollhouse with Well-Crafted Furniture \nThe Savannah Dollhouse is 32.5 x 13.5 x 51-inches (HxDxW) in size, and weighs approximately 40 pounds. Standing at over four feet tall, this durable dollhouse will be played with for years, even as your child grows taller. With four levels and six rooms of open space, the Savannah Dollhouse is decorated in a southern style, and includes wide-open windows for easy visibility into the rooms from outside the house The Savannah Dollhouse fits any 12-inch fashion doll. There are 14 pieces of handcrafted, hand-assembled, and hand-painted wood furniture included with the house to furnish the six rooms. The beds have actual linens, while the couch and love seat come complete with cushions.\n\n Please note that an adult will need to assemble the house. We recommend using a powered screwdriver since there are over 30 screws and bolts included as part of the assembly.\n\n Hours of Imaginative Fun\nYour child will have numerous opportunities for imaginative, role-playing in the Savannah Dollhouse. Children will enjoy having their dolls over for a party, or sleep over. The house large enough for multiple children to play at once -- making it ideal for siblings to play together.\n\n What's in the Box\nHouse walls, necessary hardware, furniture, and assembly instructions.\n\n \n\n\n\n\nThe dining room is elegantly furnished with this table and chairs. View larger. \n\nAnd dollies can have a relaxing time in the den with this couch, armchair and coffee table. View larger. \n\n\nFROM THE MANUFACTURER\nThe Savannah Dollhouse is one of our most elegant dollhouses to date. Decorated like a true southern mansion, this gorgeous house is sure to provide girls with hours of fun, imaginative play. Features include:\n\nSee more",
    "rating": 4.5,
    "feature_bullets": [
      "4 levels, 6 rooms and 2 balconies",
      "Working porch swing",
      "Detailed scrollwork",
      "Packaged with detailed, step-by-step assembly instructions",
      "3D interactive assembly instructions for this product are available through the free BILT app.",
      "Four levels and six rooms of open space and 13 pieces of colorful furniture",
      "Wide windows allow dolls to be viewed from multiple points of view and full outdoor patio area",
      "Large enough that multiple children can play at once",
      "Accommodates all fashion dolls up to 11.5\" tall",
      "Made of wood and sturdy construction;Accomodates Barbie sized dolls"
    ],
    "specifications": {
      "Product Dimensions": "33.86 x 13.78 x 51.18 inches",
      "Item Weight": "2.2 pounds",
      "ASIN": "B001G8J78Q",
      "Item model number": "65023",
      "Manufacturer recommended age": "36 months - 12 years",
      "Best Sellers Rank": "#140,831 in Toys & Games",
      "Customer Reviews": "4.5 out of 5 stars1,492 ratings4.5 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "October 7, 2018",
      "Mfg Recommended age": "36 months - 12 years",
      "Department": "Toys & Games",
      "Manufacturer": "KidKraft"
    },
    "categories": [
      "Dolls & Accessories",
      "Toys & Games",
      "Dollhouses"
    ],
    "price": ""
  }
}