{
  "website_summaries": [
    {
      "verdict": "Guild Wars 2 is a paradise for explorers and thrill-seekers alike, and the best online role-playing game in years.",
      "pros": [
        "Fluid movement and combat are consistently entertainingRethinks genre tropes in ways that keep you exploringExciting player-versus-player battlefieldsFlexible skill system lets you adjust your play styleBeautiful visuals with a painterly flair"
      ],
      "cons": [
        "Does a mediocre job of explaining important conceptsSome lingering technical issues and other annoyances"
      ],
      "aspects": {},
      "publication_date": 20120921,
      "rating": 9.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Same old Same old.....Gargage",
      "text": "If your looking for different, this MMORPG is not it. It's a rip-off of other MMORPGs that came before it. The game has an in-game cash shop and you best believe the game is going to target your pockets. The developers will also remove any comments you make in the forums about the game if those comments don't praise the game. Do yourself a favor and save your money on this one. Guildwars 1 was horrible and that alone proved the company behind this series is not creative so what do they do, copy from other MMORPGs and create Guildwars 2. Phft!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "HorJohn78",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Good Game, Lousy Security Protocol",
      "text": "The kids love this game. However, the security (anti-piracy) features are intensely annoying. Every once in a while, the program fails to recognize the IP address of our computer, and the game locks. The only way to unlock the game is by responding to an email. When there was a program update, it took a full month of back and forth with Guildwars support to get the game unlocked so the kids could return to playing their scenes. Overall, a great game, but the paranoia of the publishers makes it a bit of a chore to keep it running.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20131114
    },
    {
      "title": "Don't buy the scam here.",
      "text": "Just wanna say its a great game, but don't buy it on amazon. I bought 4 supposedly to be new copies of the game, but it turns out to be previously opened cases with the CD keys taken out. Which the item useless. This is a scam.",
      "rating": 1.0,
      "verified": true,
      "author": "Panda",
      "helpful_votes": 2,
      "publication_date": 20170915
    },
    {
      "title": "Fun, subscription free",
      "text": "Fun community based game. You will never be able to solo big events, but thankfully the community is always there to help. Having a guild makes it even funner, and if you decide to be a solo player you will find that for the big events there are still groups that meet. So you can tag along with bigger groups, and guilds will let you join in on their run 99% of the time. A big plus is that there is no monthly fee. I would buy it once again.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawner",
      "helpful_votes": 0,
      "publication_date": 20160426
    },
    {
      "title": "Great Game",
      "text": "This is a fun game to play. Combat is fast paced and easy to get use too. The buy to play is great so no need for subscription. The content you get for the price is far beyond most single player games that you beat in a weekend. Only reason I can't give it five stars is that the games slows to a crawl once you hit level 80. The end game leaves much to be desired, however they are working on adding more end game content so its still and excellent game for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Glen Whiltey",
      "helpful_votes": 0,
      "publication_date": 20140425
    },
    {
      "title": "Can't play the game with used disc",
      "text": "The 25-character code only unlocks a game once. There should be no market for used game discs like this.",
      "rating": 1.0,
      "verified": true,
      "author": "Trevor Bruhn",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Argueably too good",
      "text": "A game so excessively good, even though unlike every other mmorpg out there it makes a point to make things not feel like a grind, and where you can take a break without feeling like you are missing out. be warned, while the game isn't necessarily grindy, there is so much going on all day long, even for those not usually prone to becoming addicted to games will find the game difficult to convince themselves to put down(even though the game gives you plenty of opportunities to do so).",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Hile",
      "helpful_votes": 3,
      "publication_date": 20150610
    },
    {
      "title": "Seems like it could have been a fairly cool game",
      "text": "I had way too many issues with this game right out of the gate. I was actually trapped somewhere while trying to travel and couldn't get a GM to get me out. I tried repeatedly to free myself, but never did. Gave up on the game. Seems like it could have been a fairly cool game, otherwise.",
      "rating": 2.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20170208
    },
    {
      "title": "Missed some intricate aspects of MMOs",
      "text": "Amazing but not what I expected. 1 year or so of fun, but missed so many points where hardcore games excel. This doesn't take away from this games amazing ground breaking gameplay. graphics and detail. Couldn't hold me long enough, even though I tried. The PVP could have been way better and would have been nice to bring you main character to PVP deathmatch",
      "rating": 3.0,
      "verified": true,
      "author": "ShenmueFan",
      "helpful_votes": 0,
      "publication_date": 20150303
    },
    {
      "title": "Four Stars",
      "text": "good mmorpg ......edit....... I've been playing it a lot, it's addictive and there is a lot to it and a lot to learn. The world is huge and the cities and locations are not flat, you will be surprised at the vertical scale...... It's not just an open world covering a large area.",
      "rating": 4.0,
      "verified": true,
      "author": "C B",
      "helpful_votes": 0,
      "publication_date": 20141226
    },
    {
      "title": "Tons of fun, beautiful game",
      "text": "This game is so much fun to play, with all sorts of different kinds of gameplay for people who like playing games different ways. Not only that, but it runs on even my piddly little laptop! Good quality gameplay, no lag - it's fantastic. The game itself is beautiful. I love just looking at it sometimes. I find myself taking tons of screenshots - it's such a lovely world! The character customization is great, finding jump puzzles and secret areas adds a wonderful element of anticipation and exploration, and the fact that it's a living world? That events in-game actually change the map? That just about makes it perfect right there.",
      "rating": 5.0,
      "verified": true,
      "author": "Pearl Whitney",
      "helpful_votes": 0,
      "publication_date": 20150704
    },
    {
      "title": "Nice beautiful graphics",
      "text": "Nice beautiful graphics, overall top quality MMO, best that I have see so far, but stop playing it because too many changes to quick and at the end it is now a game for those of you willing to playing at least 3 years to be able to do anything cool in it. 6 month to do this, 6 months to do that it, is focus on the \"player with no life\", if you work , are married or have any type of hobby this game is not for you.",
      "rating": 3.0,
      "verified": true,
      "author": "pijion",
      "helpful_votes": 0,
      "publication_date": 20150914
    },
    {
      "title": "Great Game!",
      "text": "This is my first MMORPG and I really like it! Although I'm more into RPGS and ARPGS Guild Wars 2 really is a great game with a lot of content. I've got less than 10 hours in play time so I can't get too in-depth in my review. If you're looking for something new to try I'd definitely give it a shot!",
      "rating": 4.0,
      "verified": true,
      "author": "Nathan Kerns",
      "helpful_votes": 0,
      "publication_date": 20150620
    },
    {
      "title": "Great Game",
      "text": "Though some of the classes are somewhat complex [elementalist] this is a great game with excellent graphics. Kind of like VIP LOTRO without the Monthly fee. Scenery is very impressive and the scalable events [like quests] are pretty cool. Great buy for the price, you'll love it.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Woodhouse",
      "helpful_votes": 3,
      "publication_date": 20130102
    },
    {
      "title": "Exceeds expectations",
      "text": "Game is amazing, and the community is wonderful. Install and updates are quick, load times are small when zoning, and there are always players around to help with anything that's not easy to solo.",
      "rating": 5.0,
      "verified": true,
      "author": "J-son Cronus",
      "helpful_votes": 3,
      "publication_date": 20140916
    },
    {
      "title": "Beautiful world to explore with friends.",
      "text": "Got the game to play with friends but then it just wasn't the greatest for a casual player at the time.",
      "rating": 3.0,
      "verified": true,
      "author": "John Hummel",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "One of the better MMO's",
      "text": "This game is fantastically fun to play with others or by yourself. A very expansive universe and great character creation, the battle system is very similar to WoW, I might even say that it is an even mixture of the original Guild Wars and WoW.",
      "rating": 4.0,
      "verified": true,
      "author": "SanguineDream",
      "helpful_votes": 2,
      "publication_date": 20131226
    },
    {
      "title": "Good game. Quenches your \"I suddenly want to play ...",
      "text": "Good game. Quenches your \"I suddenly want to play MMORPG but don't want to commit into monthly fees\" feeling if you are a casual gamer.",
      "rating": 4.0,
      "verified": true,
      "author": "jiru-rei-hachi",
      "helpful_votes": 2,
      "publication_date": 20150331
    },
    {
      "title": "Pretty awesome",
      "text": "I still play this 5 years later. Pretty awesome game",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla Little",
      "helpful_votes": 0,
      "publication_date": 20180202
    },
    {
      "title": "This is a great game! Lots of fun",
      "text": "This is a great game! Lots of fun, a little dated in 2015. If your coming from wow like I did you are going to be I for a treat. The game itself is a lot of fun and more importantly the environments seem fresh, exploration is fun and the combat is active. Give this game a shot!",
      "rating": 5.0,
      "verified": true,
      "author": "Cody",
      "helpful_votes": 0,
      "publication_date": 20150422
    },
    {
      "title": "I love this game",
      "text": "I love this game. It might not be as big as WOW but I love the no subscription and overall high quality of graphics and gameplay. You really get your money's worth. Plus the fact that you can still visit low level areas and do events for experience is wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Elliott",
      "helpful_votes": 0,
      "publication_date": 20140710
    },
    {
      "title": "Unusable serial code from used game.",
      "text": "Good game used copies will have used serial code. When used game will be unplayable. Amazon needs needs to have a verification process on CD keys,serial Codes .",
      "rating": 5.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 2,
      "publication_date": 20150616
    },
    {
      "title": "Fun",
      "text": "It is a fun game. I like how you are part of a group just by proximity and you don't \"have\" to group specifically with people. It is much more fun to play with others than by yourself. I'm not real impressed with the story line nor that every part of the story looks the same. The videos are just 2 characters talking, always 2 on a screen, one on each side facing each other. If more characters are in the conversation, then they fade in and out as they have lines. They could have done a lot more with these videos in the story line. But, in general, it is fun to play.",
      "rating": 4.0,
      "verified": true,
      "author": "Boilermaker",
      "helpful_votes": 0,
      "publication_date": 20130107
    },
    {
      "title": "Great game =) I played this with friends was so ...",
      "text": "Great game =) I played this with friends was so much fun. I would recommend this to everyone GW2 has gotten so much better since I purchased this!",
      "rating": 5.0,
      "verified": true,
      "author": "Destinys Chyld",
      "helpful_votes": 0,
      "publication_date": 20140816
    },
    {
      "title": "On the Fence about this one",
      "text": "When I first started this game it was a lot of fun, but after reaching max level it kind of lost the fun factor (just me I guess). Don't get me wrong its definitely a great game, well done areas and great scenery. I just got to the point I would log in and get bored with the \"what should I do now?\"",
      "rating": 3.0,
      "verified": true,
      "author": "Roy",
      "helpful_votes": 0,
      "publication_date": 20140202
    },
    {
      "title": "Hours of fun",
      "text": "This game has endless hours of fun and the company is constantly adding content to improve and add to the fun. However, the full price is a bit much. The graphics are also beautiful!",
      "rating": 4.0,
      "verified": true,
      "author": "Maeve",
      "helpful_votes": 0,
      "publication_date": 20130415
    },
    {
      "title": "breaks free from pay to win model",
      "text": "Good game that doesnt charge a monthly subscription and isn't pay to win.",
      "rating": 5.0,
      "verified": true,
      "author": "H.A.",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "Great MMO that i've played for years.",
      "text": "Purchased this in 2013, still play it today I really love this game.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "I forgot to write a review for this, whoops.",
      "text": "I got the game back in August and forgot to review, but it's pretty fun to play with friends. The story part was pretty interesting too, and I like how they did the different areas on the map. Very pretty game too! I recommend you download it for free to try it out before you buy the disc! :]",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160112
    },
    {
      "title": "Five Stars",
      "text": "One of the best mmo experience I had. Was fun to level, doesnt have the usual \"grind\" feel.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Chua",
      "helpful_votes": 0,
      "publication_date": 20150703
    },
    {
      "title": "Camera and Movement 'control' issues",
      "text": "Being physically disabled, keystroking isn't an option. You mean to tell me, this games sole movement option is W/S/A/D or Arrows. Even SWTOR allows mapping keys to mouse buttons which allow turning. GW2 was promoted as the future of MMO's. These movement controls are archaic. ------------------------------------------------- Received an e-mail telling me my review helped someone. Was hoping a reader had a solution I missed. I see 4 readers shared my concern. One actually voted negatively. For the past half century I've dealt with apathy, ignorance and prejudice. I see the gaming community is no different. Four votes for someone who can't play the game. Ten to twenty votes for those who don't want to grind for gear.",
      "rating": 2.0,
      "verified": true,
      "author": "pbro",
      "helpful_votes": 13,
      "publication_date": 20121120
    },
    {
      "title": "Great Game",
      "text": "I love this game, so worth the buy! The graphics and the storylines are insane! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel J",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "It's decent.",
      "text": "You'll end up leveling all your characters to 80 in a few weeks without even grinding. ZERO end game content, besides farming materials and gold for Ascended crafting. Combat is far too simple. Stats are too simple. Equipment choice is too simple. Guild system gets too messy. High level enemies are killed by zerging them. No subscription fee is great. It's worth a play, but don't expect to get hooked on it as you would another fantasy game. I like to think of it as a single player game within a multiplayer world.",
      "rating": 3.0,
      "verified": true,
      "author": "Adrian Vazquez",
      "helpful_votes": 0,
      "publication_date": 20150606
    },
    {
      "title": "Fun to play, though watch out for the nickel and diming in-game",
      "text": "I'm not normally a MMO player but I've enjoyed this one so far. The story lines are good with several varieties, you get experience for doing anything in the game so leveling up hasn't been a problem for a beginning such as myself. There is a lot to learn about the armor, weapons and such but I guess that's common to MMOs and not terribly critical to a beginning player anyway. My biggest complaint about the game is that the in-game economy is definitely rigged to keep people poorer and needing extra storage to get you to pay extra money online for Gems. Gotta pay the server bills somehow I suppose...",
      "rating": 4.0,
      "verified": true,
      "author": "A. Michalak",
      "helpful_votes": 0,
      "publication_date": 20130226
    },
    {
      "title": "Love this game but had friends playing on another server",
      "text": "Love this game but had friends playing on another server. Bought this in order to play on GoM server, now I have two accounts.",
      "rating": 5.0,
      "verified": true,
      "author": "K C",
      "helpful_votes": 0,
      "publication_date": 20150817
    },
    {
      "title": "If you are a gamer buy it !",
      "text": "I play it strictly for pvp and i must say it is amazing. It definitely was over-hyped which i think killed the game abit but it is still beautifully crafted and worth buying. I personally thought i was a tad grindy and the world bosses were repetitive but it is definatly worth taking a look at. Even if you don't play it hardcore once you buy the box you can play casual without worrying about getting you monthly subscriptions' worth out of it.",
      "rating": 3.0,
      "verified": true,
      "author": "Charles Haze",
      "helpful_votes": 0,
      "publication_date": 20121214
    },
    {
      "title": "Great purchase",
      "text": "A very great game, I'm totally pleased with it and the service was fast and without problems. I recommend this game and the seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerardo",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Don’t buy. Seller does not include key code",
      "text": "Unfortunately I didn’t read the reviews till after I committed to buying it. Some of the reviews say keycode is missing and it’s true. The case wasn’t even shrink wrapped. Nothing. Just a case and a disc. I didn’t know this but GUILD WARS 2 IS FREE TO PLAY so please people don’t waste your time with this. The core GW2 is free. You can buy expansion packs but the base game is FREEEEEEEEEEEE. No need to waste $ on this and these losers who sold it. Thieves",
      "rating": 1.0,
      "verified": true,
      "author": "AMAZONaHOLIC",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "When i order this it came is SUPER fast! I was very happy with the speedy ...",
      "text": "When i order this it came is SUPER fast! I was very happy with the speedy shipping and it also ended up being the one with the extra content such as a few in game items for just the regular price. Will definitely recommend buying this to my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Amberle Baucom",
      "helpful_votes": 0,
      "publication_date": 20150620
    },
    {
      "title": "Game is terrific",
      "text": "I purchased this on the recommendation of my kids. What a fun game! You can either play alone or with other players. Its a beautiful game to watch with wonderful graphics. There is so much you can do and you don't get bored. The price was better than at the stores and the packaging and deivery were both fast and great. I recommend this to anyone to try. Its easy to learn and so much fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosie",
      "helpful_votes": 2,
      "publication_date": 20131221
    },
    {
      "title": "Five Stars",
      "text": "Fantastic game! I play for the group side which is unmatched at this time. The world wars are incredible!",
      "rating": 5.0,
      "verified": true,
      "author": "cwscaptivate",
      "helpful_votes": 0,
      "publication_date": 20140711
    },
    {
      "title": "Great game, but still very much an MMO.",
      "text": "Lots of fun, great worldbuilding, an over arching story (for those who find that a draw), not a lot of learning curve and fairly straightforward. The races are a cut above standardized Tolkien (which is a blessing) and something other than bog of the mill fantasy (in the WotC sense).",
      "rating": 4.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20140427
    },
    {
      "title": "The game is a pleasure to play and easy to learn all the different applications",
      "text": "The game is a pleasure to play and easy to learn all the different applications! I also like that it does not have a monthly subscription!",
      "rating": 4.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 0,
      "publication_date": 20150403
    },
    {
      "title": "Not Bad",
      "text": "Just wished there was more spells to cast on some of the characters also the quest are all pretty much the same",
      "rating": 4.0,
      "verified": true,
      "author": "Forrest Harjo",
      "helpful_votes": 0,
      "publication_date": 20140304
    },
    {
      "title": "Even his mom loves it!",
      "text": "I bought Guild Wars 2 for my nephews birthday present and he absolutely loves it. His mother even sent me a text telling me how much he loves playing his new game and that she thought it was an awesome game as well.",
      "rating": 5.0,
      "verified": true,
      "author": "D Klancke",
      "helpful_votes": 0,
      "publication_date": 20150909
    },
    {
      "title": "Great Game Beats WoW",
      "text": "Guild Wars 2 is a great game, and the entitled subscription for monthly payments is not require for this game, Arena Net that brought you Guild Wars 2 saves you a lot of money of subscription of you paying each month, unlike other Massive Multi player Online games, this game have a great community people help each other on quest, which I like and we can share the loot when we fight a boss unlike other games, great game play overall, you can buy DLC but not require, buy this game immediately its amazing! the guilds are awesome and pvp thanks Arena Net for making this incredible game!",
      "rating": 5.0,
      "verified": true,
      "author": "Kao",
      "helpful_votes": 0,
      "publication_date": 20140517
    },
    {
      "title": "I was very satisfied with how fast the shipment was",
      "text": "I was very satisfied with how fast the shipment was. I ordered the heroic and the game is perfect. I plan to buy three more for my family :)",
      "rating": 5.0,
      "verified": true,
      "author": "colie holman",
      "helpful_votes": 0,
      "publication_date": 20150301
    },
    {
      "title": "This is an amazing game with one of the best communities I have ...",
      "text": "This is an amazing game with one of the best communities I have ever played with. Simply a great game!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Reeder",
      "helpful_votes": 2,
      "publication_date": 20150609
    },
    {
      "title": "Alternative",
      "text": "It is a good alternative from paying a monthly subscription. WoW is great but this new GW2 is amazing. Plus no monthly subscription. The community is not toxic either. Seems like if people have to pay monthly for a community they feel like it gives them the privilege to be buttheads.",
      "rating": 5.0,
      "verified": true,
      "author": "Mommyof3",
      "helpful_votes": 0,
      "publication_date": 20140218
    },
    {
      "title": "Time that might be hard to come by if you're super busy.",
      "text": "Solid game! Just as is the case with most MMO's you gotta put the time in to get things rolling initially. Time that might be hard to come by if you're super busy.",
      "rating": 4.0,
      "verified": true,
      "author": "Arunesh Ghosh",
      "helpful_votes": 0,
      "publication_date": 20140821
    },
    {
      "title": "Don't buy a game if the code has been used.",
      "text": "The serial code has been used on this game which is stupid why sell a game if a code has been used already that makes no sense.",
      "rating": 3.0,
      "verified": true,
      "author": "Henry L. Jaspers",
      "helpful_votes": 0,
      "publication_date": 20150311
    },
    {
      "title": "MMORPG for the Casual Gamer",
      "text": "It's nice to have a good MMORPG without the monthly fee, and built with the casual gamer in mind. It looks great and the gameplay is not overly complicated. I can even take breaks from the game and not feel left behind or completely lost when I go back to playing.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacq T",
      "helpful_votes": 2,
      "publication_date": 20140315
    },
    {
      "title": "Guild Wars 2",
      "text": "This game . . . oh, this game. It's amazing. Graphics are wonderful, there is ALWAYS something to do, and the fact that every decision I make has a different consequence is just all kinds of wonderful. The voice-acting isn't half-bad either, though not the greatest I've ever heard. The music on the other hand, is stupendous. Jeremy Soule is a musical genius, and 'Fear Not This Night' is one of my favorite songs ever. All in all, I think this game deserves its five stars and it's current asking price, because it is well worth the money. The fact that there is no monthly subscription didn't hurt it either. ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn Vega",
      "helpful_votes": 0,
      "publication_date": 20140212
    },
    {
      "title": "WoW Killer",
      "text": "I played WoW for over 2 years back in Vanilla>BC>LK days. Guild Wars is 1,000x better than WoW. Everything you wish WoW had, GW2 has it. This is THE BEST MMORPG I have ever played. Trying to explain why would simply take far too long, please look up YouTube reviews of GW2 and you will understand why I feel this way.",
      "rating": 5.0,
      "verified": true,
      "author": "Anon",
      "helpful_votes": 2,
      "publication_date": 20140828
    },
    {
      "title": "Five Stars",
      "text": "Love the game. Saving pennies for expansion which is on my wish list.",
      "rating": 5.0,
      "verified": true,
      "author": "J. E. Lee",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "Keeps rich storyline",
      "text": "MMORPG without monthly fees?! Need a say, AWESOME! Even though it is a MMORPG it manages to keep the player feeling like he paid for a story rich single player campaign (something World of Warcraft didn't do quite as well by far in my opinion).",
      "rating": 5.0,
      "verified": true,
      "author": "Burke",
      "helpful_votes": 0,
      "publication_date": 20131211
    },
    {
      "title": "Fun Game",
      "text": "If you can't afford the monthly subscription of World of Warcraft this game is for you. It isn't as well done or has riding mounts but what do expect for a free MMORPG. I would also suggest giving Path of Exile a try as well.",
      "rating": 5.0,
      "verified": true,
      "author": "chirper9",
      "helpful_votes": 0,
      "publication_date": 20140214
    },
    {
      "title": "Teenage son love it",
      "text": "Wow - I am surprised that a computer based game could actually take my son away from the Xbox but this game does - the only problem is how do I check my email on the laptop now when he is sucking up all my computer time :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Shore_Diver",
      "helpful_votes": 0,
      "publication_date": 20140110
    },
    {
      "title": "Great Game and Customer Service",
      "text": "Upon ordering the game, I requested the code so I can play instantly without having to wait for the disk to arrive. The seller gave it to me and required a prompt reply, which I responded to as soon as I received the code and entered it in. Smooth transaction. Um, the only problem was that I never received the actual package. I'm not sure if it got lost on its way here, and it didn't include tracking. However It doesn't bother me at all much since I don't need the disk and cover. I suppose asking for the code before it shipped was a lucky move.",
      "rating": 5.0,
      "verified": true,
      "author": "CoffeeCat",
      "helpful_votes": 0,
      "publication_date": 20130920
    },
    {
      "title": "Good MMO",
      "text": "Good game if you like WoW or those kind of games. PVP is different but much better. Lots of quests and things to do and the bonus is, you can buy gems to turn into gold unlike most games you have grind. Good game!",
      "rating": 5.0,
      "verified": true,
      "author": "bb625",
      "helpful_votes": 0,
      "publication_date": 20140319
    },
    {
      "title": "Guild Wars 2",
      "text": "I'm not going to dock the rating on this game based my opinion of the game play itself. I think this game is well constructed and over-all is a pretty good game, I just don't have the time to really get in to it. Being said, this game does start off pretty slow and takes quite a while to really get in to \"exciting\" stuff. If possible, I would highly recommend trying the game out first before buying. If you do so, and you like the game, Amazon is a great place to buy it from. I buy a lot of things off Amazon and have never had any problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 2,
      "publication_date": 20121223
    },
    {
      "title": "Pleasantly surprised.",
      "text": "Ordered the base game and was delighted to receive a boxed Heroic Edition.",
      "rating": 5.0,
      "verified": true,
      "author": "theGug",
      "helpful_votes": 0,
      "publication_date": 20140731
    },
    {
      "title": "Great game",
      "text": "I played through until I'd maxed the characters I was interested in. The new living story isn't great and I've moved on to sandbox/indie games for the most part.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Savage",
      "helpful_votes": 0,
      "publication_date": 20131216
    },
    {
      "title": "a great game for the money.",
      "text": "I play several hours a week, more when possible. I played Guild Wars 1 for many years and was not sure if I wanted to change over to GW2 but I am glad I did.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20140629
    },
    {
      "title": "Great game! I bought it recently for a friend ...",
      "text": "Great game! I bought it recently for a friend and we have been having a blast! In recent times it has become even more new player friendly, allowing for instant play together.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20150122
    },
    {
      "title": "Great Video Game",
      "text": "This is a great online game with plenty of hours to indulge yourself if you like the rpg style of games. The graphics are great as well as the inventory and spelling system. The only reason why I took one star out was due to the poor documentation and help system to guide players on how to play the Guild Wars 2 as it's supposed to. I guess this is a weakness of all MMO games.",
      "rating": 4.0,
      "verified": true,
      "author": "Novice Programmer",
      "helpful_votes": 2,
      "publication_date": 20121207
    },
    {
      "title": "Lot's of fun",
      "text": "Fantastic game my children play every day for months now. I like the graphics of thi game and the characters that you can make.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunshine",
      "helpful_votes": 0,
      "publication_date": 20140112
    },
    {
      "title": "Worth every penny.",
      "text": "This is a great game, and very worth the price you pay. I have been using it for over a month and its better than most MMO games (I have played about 10 or so different MMOs) without the subscriptions. Updates are regular, and quests are plentiful. There is a great population from what I can see, and always people around questing to help if you need it. What more can I say? Try it! It is soloable if you are inclined to that sort of thing, like I am at times. Its a great drop in, drop out MMO for casual and hardcore alike.",
      "rating": 5.0,
      "verified": true,
      "author": "oldguygamer",
      "helpful_votes": 0,
      "publication_date": 20130919
    },
    {
      "title": "Guild Wars 2",
      "text": "As I'm sure all the other reviews state, this was a well thought-out game clearly made by other gamers frustrated by the same things we all were. This game comes with a large sense of community, the competitive aspect in resource gathering, event doing, and mob slaying is gone! In fact, working together to accomplish many things is a huge part of Guild Wars 2. Sticking with Guild Wars, the sequel also has breathtaking graphics and beautiful landscapes and has a moving storyline that follows your character throughout your exploration of Tyria. Well worth the 60$, especially considering you don't have to pay a monthly fee ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Turner",
      "helpful_votes": 2,
      "publication_date": 20130225
    },
    {
      "title": "Cool game",
      "text": "My son wanted this game he loves playing it. It was a little on the high price but it was worth it",
      "rating": 5.0,
      "verified": true,
      "author": "Cheyenne S.",
      "helpful_votes": 0,
      "publication_date": 20131217
    },
    {
      "title": "great game, great shipping",
      "text": "Started playing during a trial period and got hooked. Watched for a low price; bought for $20 less than retail, in store packaging, arrived before the estimated delivery date range. GW2 is a great game, with unique combat system, the most practical party system I've seen in an mmo, and (for me) a ton of rp. Highly recommend both the seller and the game.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20121224
    },
    {
      "title": "Great game",
      "text": "It's a definite change of pace, and very refreshing to anyone bored of their current MMO. I played the first round of Guild Wars and the expansions, and the total revamp of the system is great. I appreciate the lengths they went to and the time it took to get this game out!",
      "rating": 5.0,
      "verified": true,
      "author": "AmberM",
      "helpful_votes": 0,
      "publication_date": 20130123
    },
    {
      "title": "Best MMO I have played",
      "text": "This mmo is so much more fun than other mmos I have played. The world is huge and varies so much from area to area! The characters are fun and interesting to talk to. And best of all no subscription! I don't feel pressured to buy in game items either.",
      "rating": 5.0,
      "verified": true,
      "author": "ErinRJ",
      "helpful_votes": 0,
      "publication_date": 20131206
    },
    {
      "title": "Guild Wars 2 is where the gamers are",
      "text": "Great game, everyone is very social online. The event system keeps you entertained. Every mission has a level range and will bring you down to around that level. Your level is never too high for the task and you stiil receive great xp out of it",
      "rating": 5.0,
      "verified": true,
      "author": "Julius T Harris",
      "helpful_votes": 2,
      "publication_date": 20130405
    },
    {
      "title": "fun game",
      "text": "took me about 180 hours to do every quest. and clear 100% of the map since then they have added new content but i have not played any of the new stuff yet in any case 180 hours of fun for 50 bucks is a great deal. and i only played one character of one class",
      "rating": 5.0,
      "verified": true,
      "author": "Grant B",
      "helpful_votes": 3,
      "publication_date": 20130517
    },
    {
      "title": "Incredible MMO",
      "text": "I honestly have nothing poor to say about Guild Wars 2. This my first rendezvous with the franchise, and I can only share that this game surpasses expectations at every turn.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua P",
      "helpful_votes": 0,
      "publication_date": 20140210
    },
    {
      "title": "great free to play mmo",
      "text": "This is an awesome free to play MMO. You can do everything without ever needing to purchase anything from the game store. However if you wanted you can put in more money to enhance your experience. It is a great easy too kill time with friends or go it alone. The best thing is that you don't need to know 50 people to do large group quests as it is open pub for all world quests so you can just hop in on the fly. World is large and the story is great. Definitely worth the buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Sojiro",
      "helpful_votes": 2,
      "publication_date": 20121022
    },
    {
      "title": "Guild Wars 2",
      "text": "i love this game. I played the first one and this one is so much better. I love that when you are out in the world going form place to place and you run into bad guys someone you don't know can come along and help. If you died in the original yo had to go to the nearest way point now if you die someone will just dome along and heal you and back right where you were nothing lost. This version of the game is sooooooo much better then the first.",
      "rating": 5.0,
      "verified": true,
      "author": "Jinxy",
      "helpful_votes": 0,
      "publication_date": 20130413
    },
    {
      "title": "Awesome Game",
      "text": "This game is fantastic! There is so much to do and each class is very different. Quests are fun and don't feel at all like mindless tasks. The developers are also very active and fix all of the problems that I have encountered in the game.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Contreras",
      "helpful_votes": 0,
      "publication_date": 20140511
    },
    {
      "title": "One of the better MMO's in a long time",
      "text": "This is one of the better MMO's today! NCsoft seems to have listened and improved much from GW (I liked GW when it was released). Most importantly, I love the model of paying for the software but it's free to play (no monthly fees) and allow users to adopt the \"pay per view\" method for getting new content! Good Job NCsoft!",
      "rating": 4.0,
      "verified": true,
      "author": "M. Wang",
      "helpful_votes": 0,
      "publication_date": 20130107
    },
    {
      "title": "If this helps go ahead and press that helpful button",
      "text": "Love this game so much! Arrived quickly and in perfect shape",
      "rating": 5.0,
      "verified": true,
      "author": "Jaimmie Auld",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "Great Game!",
      "text": "Easy to Install, I strongly suggest buying the hard copy over just the downloadable edition and you can upload it on 3 computers however only on character/person can be playing at a time. You can not create several characters on one disk and play with friends unless they buy it for themselves.",
      "rating": 5.0,
      "verified": true,
      "author": "Isaac",
      "helpful_votes": 0,
      "publication_date": 20131127
    },
    {
      "title": "great",
      "text": "arrived very promptly and was still sealed very good game a great f2p game after you pay for it . love it",
      "rating": 5.0,
      "verified": true,
      "author": "mumren",
      "helpful_votes": 0,
      "publication_date": 20140210
    },
    {
      "title": "beautiful game",
      "text": "I am all about exploration, first off the cities are amazing! the scenery will leave you breathless. the gameplay simply awesome. this game really has it all! and no monthly subscription! that alone is worth picking it up....Love it",
      "rating": 5.0,
      "verified": true,
      "author": "Savvy Shopper",
      "helpful_votes": 0,
      "publication_date": 20130412
    },
    {
      "title": "Greatest MMORPG to challenge WoW!",
      "text": "Upgraded visuals & gameplay. GW2 picks up where EotN left off combining the great races of Tyria and introducing a new race.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian Raudes",
      "helpful_votes": 2,
      "publication_date": 20140311
    },
    {
      "title": "GG",
      "text": "Great game. Other's have made far better reviews than I about why its great. I just want to throw in my support and appreciation for a great MMORPG that gets rid of the archaic monthly fee scheme and is really fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Robby",
      "helpful_votes": 0,
      "publication_date": 20130122
    },
    {
      "title": "amazing",
      "text": "came with everything I needed to get started, I never bought a pc game before and this gives me everything I need, I recommend you buy it if your looking for a guild wars game",
      "rating": 5.0,
      "verified": true,
      "author": "salvador rodriguez",
      "helpful_votes": 0,
      "publication_date": 20140305
    },
    {
      "title": "great MMO",
      "text": "One of the best MMO's, imo, and I am a longtime wow subscriber so that should say something. It's packed with everything a good MMO needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Daddy Demon",
      "helpful_votes": 0,
      "publication_date": 20131105
    },
    {
      "title": "Great 9/10 game",
      "text": "Installation was easy and the case held up perfectly throughout shipping. 9/10 game in my opinion. I appreciated the artwork that was on the fold out front of the case cover.",
      "rating": 5.0,
      "verified": true,
      "author": "Conner Helgeland",
      "helpful_votes": 0,
      "publication_date": 20131129
    },
    {
      "title": "Better than EVE, Better than WOW, Better than AION, it's just BETTER",
      "text": "Now that I upgraded my graphics card to a AMD Radeon HD 7750, Windows 7, and a nice booting SS drive (Transcend 128GB SATA III 6Gb/s 2.5 inch SSD), I can finally play this game and wow, is it GREAT!",
      "rating": 5.0,
      "verified": true,
      "author": "Cajunbleubelle",
      "helpful_votes": 2,
      "publication_date": 20121230
    },
    {
      "title": "This was well received",
      "text": "This was a Christmas gift for my son, who had asked for it, and it was well received -- so much that my daughter also bought it so they could play it together.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike in Bethesda",
      "helpful_votes": 2,
      "publication_date": 20121229
    },
    {
      "title": "Great game",
      "text": "This is a very fun game, I highly recommend it to anyone that likes role playing games where the environment changes around you depending on what you and the other players do.",
      "rating": 5.0,
      "verified": true,
      "author": "Joni",
      "helpful_votes": 0,
      "publication_date": 20140111
    },
    {
      "title": "great game for the casual gamer.",
      "text": "Overall teh game playes well and it is nice to see the zone scaling work so efficiently, I never feel over powered in any zone.",
      "rating": 4.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 2,
      "publication_date": 20121002
    },
    {
      "title": "Great experience",
      "text": "Although I'm just starting out, I already love it and how at some points it's more movie than video game. The personal story makes it seem like your character is really a person in this world. The creativity in the quests is great; they're not all (or even mostly) \"go kill X number of Ys\" quests so everything is a fresh experience. I would totally recommend this game especially as it's just a $60 one-time cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Erik Gutierrez",
      "helpful_votes": 0,
      "publication_date": 20130111
    },
    {
      "title": "Amazing Game",
      "text": "Big fan of the old guild wars and they have revamped and made an amazing sequel to an amazing game. If you enjoy the old guild wars this will not let you down.",
      "rating": 5.0,
      "verified": true,
      "author": "Calvin",
      "helpful_votes": 0,
      "publication_date": 20130218
    },
    {
      "title": "ANet really needs to get their act together-cannot log in",
      "text": "I just burned my Guild Wars 2 new account twice and can't log in at all. If anyone out there who is a true nerd/geek or gamer can help let me know in comment sessions thanks. I tried using my old account password and didn't work as well. They recognized my old character names, but I can't enter. I can still use them to play GW 1, however. Their customer support on both their phone and their facebook site is lousy-they don't reply at all to your questions. I'm done with this company, good riddance. Good thing I bought it under $25, so, I can swallow this loss better if I had say bought it at its highest price.",
      "rating": 1.0,
      "verified": true,
      "author": "Pei Kang",
      "helpful_votes": 0,
      "publication_date": 20131223
    },
    {
      "title": "Good game but not very intuitive",
      "text": "Great game, great design and it saves a lot of time with features like being able to access the market and your storage from anywhere in the game. The production quality is very good, but the game isn't very intuitive. In other MMOs the learning curve comes naturally, you can virtually learn the gameplay by intuition, but not so much in GW2, it can be a little bit complicated to learn the gameplay at times. But hey, Great game!",
      "rating": 4.0,
      "verified": true,
      "author": "Gino Cabiati",
      "helpful_votes": 3,
      "publication_date": 20121203
    },
    {
      "title": "Fun game",
      "text": "This game is pretty fun, the end game is boring as hell. But getting there is fun. The graphics are great, the game play is great. The end game blows.",
      "rating": 4.0,
      "verified": true,
      "author": "hammackj",
      "helpful_votes": 2,
      "publication_date": 20130522
    },
    {
      "title": "Great game",
      "text": "This is a fun game. NCSoft must have upgraded me to Heroic Edition due to an upcoming sale as well. That's just good business.",
      "rating": 5.0,
      "verified": true,
      "author": "Shaun Jenkins",
      "helpful_votes": 0,
      "publication_date": 20140513
    },
    {
      "title": "Very fast",
      "text": "This came very fast as promised, was in brand new condition still sealed in plastic. Very fun game. :) It had the graphic design case that was a happy surprise.",
      "rating": 5.0,
      "verified": true,
      "author": "Alaura",
      "helpful_votes": 0,
      "publication_date": 20131115
    }
  ],
  "product_meta": {
    "title": "Guild Wars 2",
    "description": "Guild Wars 2 Heroic Edition consists: -Guild Wars 2 -Suit of Legacy Armor -Mithril Box -10 Experience Boosters",
    "rating": 4.2,
    "feature_bullets": [
      "Guild Wars 2 provides a massive, online persistent world.",
      "Free online play. No monthly fee.",
      "Players have the freedom to play together even if their friends are at a much higher (or lower) level.",
      "Players will be able to engage in organized, balanced PvP (similar to GvG in the original Guild Wars) without needing to first level up characters, find equipment, or unlock skills.",
      "You will be able to advance your character to the maximum level without ever joining a group if you so desire."
    ],
    "specifications": {
      "ASIN": "B001TOQ8X4",
      "Release date": "August 22, 2012",
      "Customer Reviews": "4.2 out of 5 stars692 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#35,929 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Product Dimensions": "5.4 x 0.7 x 7.5 inches; 1 Pounds",
      "Binding": "Video Game",
      "Rated": "Teen",
      "Item model number": "FG-GW2ST-FR",
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "1 pounds",
      "Manufacturer": "NCSOFT",
      "Date First Available": "February 24, 2009"
    },
    "categories": [
      "PC",
      "Games",
      "Video Games"
    ],
    "price": 1.5
  }
}