{
  "website_summaries": [
    {
      "verdict": "While we like that this wood filler is easy to use, stain, and remix if it dries out, the strong odor makes it impractical for use in some areas, or by sensitive consumers.",
      "pros": [
        "Easy to work with",
        "Colors are easy to match to wood surfaces",
        "Holds paint and stain very well",
        "If this water-based filler dries out in the container, mixing in a bit of water brings it back to a workable consistency"
      ],
      "cons": [
        "Has a strong, chemical odor",
        "Using it in a well-ventilated area is recommended"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Smells pretty bad",
      "text": "This stuff is OK. DAP makes a very similar product called all purpose wood filler (also water based). The biggest problem I have with this is the smell. The DAP product is much less offensive- note I am talking about the DAP water cleanup material not the original DAP plastic wood. I don’t think the smell is harmful but I am using it inside a living space and it gives me a headache even in fairly small exposures. I would consider essentially all wood fillers, including this, to be suitable for painting only.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181119
    },
    {
      "title": "Great product, easy to use",
      "text": "Saw this on a youtube video for patching wood. Wish I had known about this a long long time ago. This stuff is so convenient. Goes on easily, dries quickly, sands easily, reconstituted with water, takes a stain - what more can you ask for? As for the people who don’t like the smell - I did not find it especially difficult to tolerate. It’s far less obnoxious than walking past the tire section at Costco, and the smell goes away once it’s dried.",
      "rating": 5.0,
      "verified": true,
      "author": "DJW",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Excellent wood filler",
      "text": "I'm not a flooring guy or a carpenter, but this product saved me after a disastrous installation of hardwood flooring. It's easy to use, provides excellent color, and appears to be durable. I filled gaps in a bad flooring installation six months ago and it appears perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl G. Kleinhenz",
      "helpful_votes": 3,
      "publication_date": 20181212
    },
    {
      "title": "Best wood filler I have used",
      "text": "I recently purchased this based on a recommendation I saw online and I'm so happy I tried it. It seems to fill small flaws more easily than the other products I've used. I can't speak for its ability to take stain as the several projects I have used it on have all been painted but it sands very smooth and is even easy to use to smooth the edges of plywood grain if you thin it slightly. I especially like the idea that if it starts to dry out I can recover it by simply adding a little water. I have thrown out a lot of other wood filler through the years.",
      "rating": 5.0,
      "verified": true,
      "author": "Murdock",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Works great with pine.",
      "text": "If you are working with pine, then get this. I've tried other wood fillers form Elmers to Wood Filla and all of them stain nothing like the wood its filling. Those would all stain several times darker, but this matches it very well. I was actually upset because I got this stuff AFTER I had already filled all the brad nail holes in my project with wood filla brand filler. If you are painting wood I'm sure they all work fine, but when it comes to staining pine in a light cherry color atleast, this worked the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Fuzzles",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Works Great",
      "text": "I have used a lot of high end wood fillers but this product is by far the best. I work with a lot of figured maples and grain tear out can be a problem. This product does a fantastic job. Easy to sand. I would thin it a bit with a few drops of water to give you some more work time. Sands and stains well. The only problem is it really stinks. use it outside and wear rubber gloves. You do not wan to get this on your skin as the smell is really hard to get rid of. Other wise the best product out there.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven W. Metz",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Great wood filler",
      "text": "Buy it!! Best wood filler I’ve ever used. A couple drops of water and this stuff softens right up. I used some on a maple desk I was building and it sanded and stained nicely to match. Will be buying it again when I need it.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin the Destroyer ",
      "helpful_votes": 3,
      "publication_date": 20190515
    },
    {
      "title": "Very versatile.  Check out YouTube tutorials.",
      "text": "This stuff lives up to its reputation by wood workers. I bought the pine/poplar color so I could tint to my desired color I ended up using finely ground instant coffee grounds as my dye. Worked perfect. Filing deep holes of 1/16 + inches deep took 24 hours to dry to a sandable hardness. Once dry it’s rock hard so don’t overfill too much! Unless u enjoy sanding. It does shrink some. So some of my fills required two coats.",
      "rating": 5.0,
      "verified": true,
      "author": "Fbird67",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Smooth",
      "text": "Very spreadable....like peanut butter. Buying the minwax or bordens fillers from the box stores is a waste of money. their fillers dry out before you can go back to use them on another project. No matter what I have tried to keep these products fresh....nothing has worked. People who recommended Timbermate said if it does start to stiffen...just add a couple of drops of water to restore. Color match to wood was very good.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Perfect Filler for your stained projects",
      "text": "I own several jars of these for the different woods that I work with. This stuff dries quickly, holds up, and stains well. I've been looking for something like this for years",
      "rating": 5.0,
      "verified": true,
      "author": "BElway",
      "helpful_votes": 2,
      "publication_date": 20181024
    },
    {
      "title": "would buy again",
      "text": "When i received the jar i thought \"oh crap, I'm gonna need more than this little jar\" as i was filling 2 pieces that were 1' x 5'. But the contents are somewhat concentrated and when thinned with water was more than enough for the job. the filler did a nice job on pine and blended in well. i did not use stain so cannot comment on how well it takes stain. it does sand and finish very well. would definitely buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Chowchewey",
      "helpful_votes": 3,
      "publication_date": 20171028
    },
    {
      "title": "nice!",
      "text": "very happy with this product. No excessive water in the container, comes out nice and clean, easily applied to substrate. Cures super hard. Used multiple times with no issues, would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "michael hebert",
      "helpful_votes": 2,
      "publication_date": 20190125
    },
    {
      "title": "Easy to apply, sand and stain.  Easy water cleanup.",
      "text": "This is the best wood dough i have ever used. I especially like that i can just add water to soften it up when it starts getting stiff. It can even be removed with water as long as you haven't stained and sealed over it. Great Product.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Z.",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Terrible smell",
      "text": "Used to cover screw holes on some shelves and it smelled terribly of chemicals for a long time. Impossible to be in the same room. I cannot recommend this product when there are so many other equally effective wood fillers without the nasty smell.",
      "rating": 2.0,
      "verified": true,
      "author": "PAS",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Best. Wood. Filler. Ever.",
      "text": "I am a woodworking hobbyist and have probably used every wood filler on the market. None — and I mean none — compare to Timbermate. Forget the rest and just buy it. BTW, note that it comes in filler color for each variety of wood.",
      "rating": 5.0,
      "verified": true,
      "author": "Private Customer",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Best filler I've used",
      "text": "After seeing various woodworkers praise this on YouTube, I got it to try. It's excellent, but I warn you, it stinks big time. It dries quickly, hard as a rock and is easy to sand and it takes stain and paint well. I originally applied it with a putty knife. I saw John Heisz from I Build It use a box cutter for smaller areas and that works better for me than a putty knife. Any leftovers you can add back to the container and use it later. There are a variety of colors for the various woods. I tossed out my other wood filler/wood putty.",
      "rating": 5.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Great wood putty.",
      "text": "I build custom cabinets and switched over to this water based wood putty several years ago. Fascistic stuff, easy to sand, stain and come is a wide variety of colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Jones",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Great product, easy to use",
      "text": "I'm trying to take the natural groves off my wood cabinets. Product went on smooth and sanded great. Did exactly what it was ment for.",
      "rating": 5.0,
      "verified": true,
      "author": "Angel W Fernandez",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "difficult to mix properly and shrinks when it dries",
      "text": "Manufacturer recommends you mix with water. Very difficult to get a smooth consistency and it shrinks when it dries, sometimes requiring numerous applications. You are better off buying a name brand US made wood filler",
      "rating": 2.0,
      "verified": true,
      "author": "agtdesign",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Prefect for use with dye stains.",
      "text": "Used for the corners of my sleeper build where the 45 angles weren't perfect. The fill took the dye really nicely to give it a darker edge.",
      "rating": 5.0,
      "verified": true,
      "author": "MikeTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Works but smelly",
      "text": "Was looking to buy a better wood filler than what's available at the local home improvements stores. This requires you mix it with a little water but it's hard to get something usable. The smell overall was strong as my wife commented from inside the house while I was in our detached garage. Overall it worked but would not buy again.",
      "rating": 3.0,
      "verified": true,
      "author": "Bryan Nambo",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Easy to use",
      "text": "It dries more firm than some other brands, which is nice. Makes it more durable",
      "rating": 5.0,
      "verified": true,
      "author": "Christian Harten",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "excellent",
      "text": "perfect color for maple cabinets. easy to use once you know how. fast shipping. thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "TC_Pug",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Great product",
      "text": "My husband swears by this stuff. It’s quick, easy and works extremely well! He loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Christine M.",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Color is right for natural maple flooring",
      "text": "So so, matches flooring, but starting to come out...not sure if it is due to the fireplace heat, it does have an odor to it, not to bad.",
      "rating": 3.0,
      "verified": true,
      "author": "Bee Green",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Good but pricey",
      "text": "A little expensive for what it is, but very good filler",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "The best",
      "text": "This is the best wood filler I've found. Very fast shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen P. Collins",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Easy to use",
      "text": "This brand is the only filler we use in the shop. Stains nice, sands easy and you can add water to get consistency back.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Great stuff",
      "text": "Works great stains great . Just stinks like a bear in the woods. LOL. Also effects my nose allergies.",
      "rating": 5.0,
      "verified": true,
      "author": "Teri B Trebour",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "... for the SPF boards I had - but I love it just the same",
      "text": "It was a touch light for the SPF boards I had - but I love it just the same.",
      "rating": 5.0,
      "verified": true,
      "author": "DGAB",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "A wood filler that stains well",
      "text": "After trying many fillers, this definitely is the best for indoor, non-weather use. With alder it took a dark English chestnut stain to the same color as the natural wood.",
      "rating": 5.0,
      "verified": true,
      "author": "RDTx",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Four Stars",
      "text": "I like it. Interesting smell. Not sure it's as amazing as others say it is.",
      "rating": 4.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Great Filler",
      "text": "I really like this filler, fills great, does not Crack, sands beautifully.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred Kingery",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Great product for woodworking",
      "text": "Best woodfiller I've ever used and I've used them all. Can't say much more than that.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Casper",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Always handy",
      "text": "Never gets old. Just add a little water and its ready to go again after several months.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Smells",
      "text": "Only complaint is it smells really bad but i works so i guess its a fair trade",
      "rating": 4.0,
      "verified": true,
      "author": "nathan ",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Great product, worth the extra cost",
      "text": "Great product, worth the extra cost. Does not shrink, has multiple color options, can withstand freezing. I use it all the time",
      "rating": 5.0,
      "verified": true,
      "author": "Russ",
      "helpful_votes": 0,
      "publication_date": 20170315
    },
    {
      "title": "Pretty decent filler",
      "text": "Pretty decent filler... I was pleased at how close the match was to both my pine and maple... and it seems to be working very nicely. Certainly worth the price. I figure this is about a two lifetime supply!!",
      "rating": 5.0,
      "verified": true,
      "author": "David R. Bosshard",
      "helpful_votes": 0,
      "publication_date": 20150909
    },
    {
      "title": "Easy to use",
      "text": "Seems great so far very easy to use and spread",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Decent filler",
      "text": "This filler works as advertised, but it is hard to apply smoothly. That's not such a problem since it's very easy to sand, but that does create a need to make more dust. It's water based but has an unpleasant odor comparable to a non-water based product, although not quite as strong. Do not think this will be an odorless or low odor product because of the water solubility. This color matched my natural bamboo floors very well. The color dry is different from the pre-cured color, so I would recommend color testing prior to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Frieda",
      "helpful_votes": 6,
      "publication_date": 20120317
    },
    {
      "title": "Great stuff",
      "text": "Having worked with wood for decades it was a joy to stumble across this great product. Advice: buy multiple colors around what you need, they mix well, and wood tones vary.",
      "rating": 5.0,
      "verified": true,
      "author": "jadian fredricks",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "finish nearly invisibly and blend with the various wood species nicely.",
      "text": "I'm a big fan of Timbermate fillers. They work well, finish nearly invisibly and blend with the various wood species nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "Fantastic wood filler!",
      "text": "Timbermate is a fantastic wood filler! I’ve used it many times. It has an overpowering smell that you’ll never forget.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle G Rogers",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Awesome product",
      "text": "Very easy to use, looks great on our cabinet doors under primer and paint! Filled in heavy oak grain.",
      "rating": 5.0,
      "verified": true,
      "author": "SDickinson",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Great product",
      "text": "It is the best wood filler I have ever used. Plastic or stainless steel spatula should be used. Regular steel tools leave black smudges on the wood.",
      "rating": 4.0,
      "verified": true,
      "author": "AlexG",
      "helpful_votes": 0,
      "publication_date": 20140906
    },
    {
      "title": "Are you kidding me ???",
      "text": "Damn - I just received the product - would you fools mind giving me time to open the package - LOL",
      "rating": 1.0,
      "verified": true,
      "author": "Lionel L PerryJr",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Five Stars",
      "text": "Great product. Makes your shop smell like an animal barn.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary B.",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "Took stain well",
      "text": "Easy to work with, took stain with no problem. Used on pine.",
      "rating": 5.0,
      "verified": true,
      "author": "Aubey",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Four Stars",
      "text": "It works well and excess is reusable. Does what it says it will",
      "rating": 4.0,
      "verified": true,
      "author": "Barry",
      "helpful_votes": 0,
      "publication_date": 20141203
    },
    {
      "title": "Very usable",
      "text": "Would have preferred a 4.5 star if available. Sticks well, sands well, and has a nice color. The solvent is strong-smelling. The container is easy to open, but perhaps not as tight a seal as would be best. I like the full-sized opening.",
      "rating": 5.0,
      "verified": true,
      "author": "MidWest Reader",
      "helpful_votes": 2,
      "publication_date": 20140303
    },
    {
      "title": "GOOD BUT NOT GREAT",
      "text": "LIKE MOST WOOD FILLERS, THIS PROIDUCT DRIES TOO FAST TO EVEN WORK WITH IT DUE TO THE CHEMICAL BASE OF THE FILLER OK PRODUCT BUT THERE MIGHT BE A BETTER OPTION SOMEWHERE OUT THERE",
      "rating": 4.0,
      "verified": true,
      "author": "H. A. ILB",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "Used for maple flooring",
      "text": "Used for my maple floor to fill in the cracks. Stuff works awesome when you add a little water. Don't even know its there once I put on poly. Stinks a little, only reason for 4 stars. Otherwise, amazing stuff.",
      "rating": 4.0,
      "verified": true,
      "author": "Nathan Barnett",
      "helpful_votes": 5,
      "publication_date": 20121224
    },
    {
      "title": "3.5 Stars - Use in well ventilated area",
      "text": "As it filler it works pretty good. My only complaint is the intense and unpleasant chemical smell that comes off of the product when it's drying. Best used in a place that has robust ventilation.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Rodrigues",
      "helpful_votes": 0,
      "publication_date": 20150517
    },
    {
      "title": "Awesome product",
      "text": "I used to use wood putty and I was never satisfied as it would shrink. I ordered this and am generally very pleased with the results. The wood I am using has some cracks and it seems to fill VERY nicely. It matches well. I will see over the life of the flooring I am installing.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J Brennan",
      "helpful_votes": 2,
      "publication_date": 20140228
    },
    {
      "title": "Everyone likes it for a reason...it works well.",
      "text": "originally got it to do some \"fake\" inlay work (plan was to fill with timbermate and then add crazy glue). di not get to that project yet, but did use it to repair some molding attacks my dog did. Does a great job on filling large and small gouges and sands well. Smells a bit like the paste you used in kindergarden (dog wanted to eat it...)",
      "rating": 5.0,
      "verified": true,
      "author": "Chris C.",
      "helpful_votes": 0,
      "publication_date": 20190619
    }
  ],
  "product_meta": {
    "title": "Timbermate Maple/Beech/Pine Hardwood Wood Filler 8oz Jar",
    "description": "Color:Original versionA totally unique, quick drying, water based grain filler and wood putty accepts stain beautifully or can be tinted. Never goes bad Easy to apply and clean up No shrinking, cracking or falling out. Does not become permanent until you apply a finish. If youre ever unhappy with the way it looks, the color, etc. – just water it down and remove it. If it freezes, simply put it in the microwave to warm it up or if it dries out, just stir in water. This allows for zero waste! This might just be the perfect wood filler. Manufacturer recommends using only stainless steel or plastic tools to apply because Timbermate may react with low grade steels and turn black. If this happens, simply add water and remove it, or wait for it to dry and sand it off.",
    "rating": 4.6,
    "feature_bullets": [
      "Easy preparation",
      "Timbermate is versatile and may be used for all interior repairs, including repairing edges.",
      "Fast drying",
      "When you’re done with your repair, scoop it up and put it back in the bucket.",
      "Timbermate protects wood and doesn’t harm it."
    ],
    "specifications": {
      "Manufacturer": "TIMBERMATE USA INC",
      "Part Number": "AMB25",
      "Item Weight": "8 ounces",
      "Product Dimensions": "2.15 x 2.15 x 3.15 inches",
      "Item model number": "CECOMINOD047842",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Original version",
      "Material": "Other",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B001NV7GRA",
      "Customer Reviews": "4.6 out of 5 stars181 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#13,085 in Tools & Home Improvement",
      "Date First Available": "December 14, 2008"
    },
    "categories": [
      "Adhesives & Sealers",
      "Tools & Home Improvement",
      "Hardware",
      "Wood Filler"
    ],
    "price": 13.08
  }
}