{
  "website_summaries": [
    {
      "verdict": "Worth considering for customers on the go who prefer an inexpensive, highly portable model that's easy to carry. However, it's not as durable as others on our list.",
      "pros": [
        "Stands out for its collapsible, lightweight design that makes it very easy to transport",
        "17.34-by-11.82 inch cooking surface",
        "Budget-friendly price"
      ],
      "cons": [
        "Metal construction has a bit of a flimsy feel, especially compared to models made of cast iron"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Compact grill that fits nicely in my Jeep JKU",
      "text": "Compact grill that fits nicely in my Jeep JKU. The grill is inexpensive but does have a flaw that is easy to fix. When the grill is expended it opens up too far. To remedy the problem, which was mentioned by other reviews I just drilled a hole in the metal and attached wingnuts for easy removal and storage. Several pictures have been attached to show how you can make the easy fix too. I plan on using this grill on the river, it will be sitting on rocks, sand, and gravel. My cousins have used the same grill and it gets the job done.",
      "rating": 4.0,
      "verified": true,
      "author": "Specializedchuck",
      "helpful_votes": 87,
      "publication_date": 20170813
    },
    {
      "title": "Good to go grill",
      "text": "Great to have portable grill - has a real slim silhouette folded, not all that heavy for what it is, assembles fast, easy clean and store - I fired this up 4 days in a row, letting it get charcoal lit and letting it burn out - minimal bowing of metal, I still got it back in the original box - for $20 it's a bargain and a steal",
      "rating": 5.0,
      "verified": true,
      "author": "ruski3:16",
      "helpful_votes": 27,
      "publication_date": 20170615
    },
    {
      "title": "Simple to assemble and use",
      "text": "Very compact. Easy to unfold and assemble. I lined the interior walls with aluminum foil, placed rolled and wadded newspaper in, charcoal grate on top of that. I mounded up hardwood chunk charcoal then I lit the paper and waited for fifteen minutes. No lighter fluid was used. I also sprayed the grilling grates with cooking spray before placing over the coals. Cooked four large burgers easily. Grate could probably hold six to eight burgers. Good airflow. Grates are easy to clean. The unit is well made and I could not see any warping. The only thing I would add is clips to the folding side wings to hold them in place. Overall I'm very pleased with the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "S.P.",
      "helpful_votes": 8,
      "publication_date": 20200330
    },
    {
      "title": "Pretty darn good grill for $25",
      "text": "We have used this grill about twenty times now... its super easy to use, set up and fold back up again. My only wish list is that I wish it came with a carry case (because its dirty once you use it... we put it in a trash bag) AND I wish they sold some type of top to go with it for better cooking. Other than that its pretty great!",
      "rating": 4.0,
      "verified": true,
      "author": "Keston",
      "helpful_votes": 7,
      "publication_date": 20200414
    },
    {
      "title": "Toxic smell and poorly designed",
      "text": "When used it gave off a horrible toxic smell, must have been the paint burning or something. Then it was nearly impossible to put the grill on after the coals are in, burned my self bad trying to do that. then the hot ashes fall down just below it. After I went camping, i just threw it away.",
      "rating": 1.0,
      "verified": true,
      "author": "Beauregard",
      "helpful_votes": 22,
      "publication_date": 20160811
    },
    {
      "title": "Great for small houses! Nice quality.",
      "text": "This is just perfect for a home or garage with less space. It does not have to be assembled (except opening it up) and it closes to a very narrow depth. Very easy to carry wherever you want it (it has a built-in handle. I can use a large or small cooking area, my choice. This is exactly what I wanted. Very sturdy, highly recommend. My rating of 4 stars for cleaning is because I haven't had to clean it yet. Looks very simple.",
      "rating": 5.0,
      "verified": true,
      "author": "Upstate Girl",
      "helpful_votes": 3,
      "publication_date": 20200404
    },
    {
      "title": "So tiny but does the job!",
      "text": "I bought this for my fiance because he has been saying he wanted to grill at home. After seeing this for such a great price I went for it. He was pretty hesitant because it was so tiny! We received it a few days later and used to to grill at our families house. My fiance made hotdogs, grilled chicken, grill bacon mushrooms, & grilled jalapeno peppers. Everything turned out yummy! The only thing he said that was challenging was that there is no cover, so he couldn't cover some of the food when grilling like you can with larger grills. Other than that, for the price, it was worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nalani",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Perfect, no fuss grill",
      "text": "We love this portable, inexpensive little grill. You can fold it up when not in use. Because of the size, you don't waste charcoal. Your food is the ideal distance from the heat for perfect grilling. The grill lasted about one BBQ season in Texas( which is about 80% of the year). Throw it away with no guilt and get another next season because it's so inexpensive. Best part is no ugly, rusty, monstrosity of a grill to look at in your backyard. It's literally perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200209
    },
    {
      "title": "It's worth it 🙂",
      "text": "As far as a space saver you can't beat it. When it's folded it's less than 2 inches thick! Fit's neatly in the box it came in. I keep it in the back of my vehicle as I use it after going on a group bike ride. Easy to put up and easy to break down. Can't beat it for the price! I don't think it's designed for heavy duty grilling but works wonderfully if you're just grilling hotdogs and burgers. Great basic little grill!",
      "rating": 5.0,
      "verified": true,
      "author": "T. Ware",
      "helpful_votes": 2,
      "publication_date": 20200922
    },
    {
      "title": "Great Idea, poor execution",
      "text": "This grill is perfect for saving space, but not so great at staying put together. Like other reviewers I am having to modify my grill to keep the grate sitting on top of it. This would be an easy fix for the manufacturer if they included 2 posts and 2 swing arms to hold the sides from expanding further than the grate size. other than having to modify I really like the grill.",
      "rating": 3.0,
      "verified": true,
      "author": "Jesster",
      "helpful_votes": 2,
      "publication_date": 20190902
    },
    {
      "title": "Great little grill!",
      "text": "This little grill is fantastic. Its actually the second one I purchased because I used the other so much. It is super easy to use and its design makes it very easy to get the fire going. Clean up is very easy too. I recommend it to anyone who wants that charcoal cooke taste without the hassle of lugging a larger grill around.",
      "rating": 5.0,
      "verified": true,
      "author": "Skybadiver",
      "helpful_votes": 2,
      "publication_date": 20200408
    },
    {
      "title": "REALLY NICE COMPACT UNIT",
      "text": "Nice heavy quality design that folds really compactly. We were looking for something compact and versatile. A friend already has one of these and says it can be used for either charcoal or wood. We haven's cooked with ours yet but our friend says it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200101
    },
    {
      "title": "Dangerous and poor quality.",
      "text": "Clever design but very poor manufacturing lets it down In my case, one of the supporting wings was tight the other one barely hit the side. You really have to try to mess up something so simple. The result is an unstable charcoal grill that could collapse during use. Highly dangerous and only a matter of time before spmeone gets hurt. 1 star.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20180107
    },
    {
      "title": "Works, but Manufacturer May Not Have Assembled Their Product.",
      "text": "Ours actually showed up broken...or more to the point, it arrived with incomplete assembly. The rings for the grate pieces were not fastened. I was forced to clamp them all down at the camp site. Other than that, the grill stowed well, and hold up during our first trip using in. TIP: Most of us do, but just in case, make sure you have a multi tool. You may need it with this product.",
      "rating": 3.0,
      "verified": true,
      "author": "Russ Adams",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Ideal for camping with a plancha",
      "text": "I bought this as a goof while I was testing out small portable grills for pop ups and camping. Though I decided on a medium size Konro in the grill role, I ended up getting a lot of mileage out of this with a cast iron plancha across the top. The relatively thin construction means that it doesn’t soak very much heat, which inadvertently makes it great for keeping a skillet somewhere in the 300 f ballpark without scorching your pan. All in I have $29 plus cost of charcoal invested in this thing, and I’ve cooked some pretty nice meals on it. Really good bang for the buck!",
      "rating": 5.0,
      "verified": true,
      "author": "Dylan Huddle",
      "helpful_votes": 2,
      "publication_date": 20190512
    },
    {
      "title": "Almost Perfect",
      "text": "This is a neat little unit. I enjoyed using it. Couple of notes: Does not heat well in outside temps below 65. Make sure you set up where ashes can be, it leaks ashes when you take it to empty. A tin foil cover is highly recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert James",
      "helpful_votes": 2,
      "publication_date": 20191218
    },
    {
      "title": "Perfect little grill!!",
      "text": "This is a perfect little grill. I put some aluminum foil down before I put the charcoal in. It cooks perfectly. The stainless steel grill cleans up nicely with a brillo pad. I discarded the cold ashes with the foil and it looks like it was never used. It didn't warp at all. Anyone who says this is a bad grill doesn't know how to grill.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Mizak",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Missing one of the two parts",
      "text": "VERY flimsy metal, will probably only last a few weeks of use. Only has two parts, the grill and the grate. Came missing the grate. Company would not send replacement until I got on social media to complain. Keep looking elsewhere. Worst product ever and not worth the $$.",
      "rating": 1.0,
      "verified": true,
      "author": "Becky Blanton",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Awkward staying open without grate",
      "text": "Awkward to setup, but not terrible. Super compact, and makes grilling possible with my limited storage in camper. Make sure you have a small brush to clean it out properly, and recommend wrapping it or bagging it, as it bouncing around WILL knock loose anything you missed.",
      "rating": 4.0,
      "verified": true,
      "author": "Armando Rosario",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Warped",
      "text": "I would not recommend this grill. The idea of a foldable grill was appealing to me because I live in a small space. However, the grate that holds the coals warped after it’s first initial use. The grate that lays flat on top had to be crimped together because it is 3 pieces held on sparingly. Overall, save your money and invest in something that will last.",
      "rating": 1.0,
      "verified": true,
      "author": "Anita Sands",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Very compact and easy to use",
      "text": "Easy to put together and use. The top grill (that the food is put onto) is three separate pieces linked together. The grill that the charcoal sits on is one solid piece. Easy to clean and shake out once cool. Easy enough to clean the grill pieces. Folds up and fits into box it came in easily. It’s very compact, without measuring exactly its about an inch thick. And a little more than a foot square when packed up. The charcoal grill fits in the main part of the body, and the cooking grill folds up into the legs of the bbq.",
      "rating": 5.0,
      "verified": true,
      "author": "kim",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "WOW..............I didn't expect this!",
      "text": "When I ordered this I thought it would be way cheaply made, you know, use for Summer then toss in the trash...well, this lil thing first of all is MUCH bigger than I thought it would be, made very WELL and is set up in a snap! Well thought out design for PORTABILITY!....You will not be disappointed with this great lil/big BBQ! Happy Grilling! Tim.......SE Alaska",
      "rating": 5.0,
      "verified": true,
      "author": "Soundsailor",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Works Great!",
      "text": "Y’all! I love this little grill. I have had severe people stop by our campsite and ask me where I got it. It folds up easy and it’s very easy to assemble. I put a little pan underneath as a drip pan but other than that it’s perfect! I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Alice",
      "helpful_votes": 2,
      "publication_date": 20200522
    },
    {
      "title": "Rust on the side! ☹️",
      "text": "Well I did not use it yet but I assembled it and found RUST on the side. I was a little perturbed by the rust, i put oil on the rust! I think I will go for another grill by another brand and keep the FIRE SENSE as a back up",
      "rating": 3.0,
      "verified": true,
      "author": "Dori Martinez",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Sweet little grill",
      "text": "Although you really can't put the grates back in to fold it up,this grill is surprising large and handy.wish there was a carrying case for it,but it's easy to clean and works great. A tip...line the bottom with foil and the bottom grate for easy clean up,and ,when cool,after hosing it out,turn upside down for a few to dry it. Then use paper towels.",
      "rating": 5.0,
      "verified": true,
      "author": "Qrious,NY",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Quick review",
      "text": "Just received it and will try it out this weekend. Pretty cool and simple, good price. Real test and update will be this weekend",
      "rating": 4.0,
      "verified": true,
      "author": "pk",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Takes up very little space",
      "text": "Loved how well this worked. I needed a grill for our travel trailer. It takes up no space and it did a great job with the burgers . Price was also very god.",
      "rating": 5.0,
      "verified": true,
      "author": "BlueCLaw",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Easiest and cutest grill ever",
      "text": "This grill requires basically no assembly, all you have to do is open it like a laptop and bam - you have a grill. It was a little confusing where to put the charcoal, but it is so cute and handy for a small group of people. It's bigger than it looks online, but still portable and doesn't take up much room at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Desiree Harrison",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Grate (intentional pun) Grill!",
      "text": "Was ready to use right out of the box...unfold, lay the two grates on there respective \"ledges\" and your ready to go. Larger surface area than I expected. Was able to get three 14oz. steaks and three ears of corn on it at the same time. Dark, black matte finish means it doesn't look \"burned\" after use. Easy cleanup.",
      "rating": 5.0,
      "verified": true,
      "author": "Madrid",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "really handy",
      "text": "this is a really well designed portable grill-used it immediately- steaks came out PERFECT--show it to the guy next door and he said \"wow\" could sure use one when we go boating. unless you buy one of these grill's-you don't have the \"perfect grill.\"",
      "rating": 5.0,
      "verified": true,
      "author": "penpall",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Super compact, making it easy to pack for a ...",
      "text": "Super compact, making it easy to pack for a camping trip. HOWEVER, make sure that you have it set where you want to cook before you put the hot coal in. Not very intuitive, but the lack of handles makes it too hot to move once the coals are lit, even the stands become too hot to hold. Also, I like to clean while the grill is hot (which makes cleaning easier), but the lack of handles makes it difficult to hold the grill down while cleaning.",
      "rating": 4.0,
      "verified": true,
      "author": "Whisperer",
      "helpful_votes": 0,
      "publication_date": 20170117
    },
    {
      "title": "use",
      "text": "i purchased the item because of the portability, it is easy to assemble and clean as well as use. The only drawback would be if you are going to use this to cook for more than 4 people, it would take some time, also charcoal must be place evenly on bottom instead of pyramid style so that the coal doesn't burn out quickly. so in my opinion if its just the 2 of you it would work well.",
      "rating": 3.0,
      "verified": true,
      "author": "cece",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Love it!",
      "text": "Really handy and convenient grill. No way to save the coals by closing vents but that's the price for a space efficient grill like this. Stores and travels very well. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 3,
      "publication_date": 20170415
    },
    {
      "title": "Great travel grill!",
      "text": "Set up right out of the box! Just had to place the grill racks. The grill racks fit perfectly and had no problems with them sliding when turning hotdogs, corn & steaks. A cover would be nice to temper the heat. The only problem was ash falling out of the bottom where the legs meet. I'll put tinfoil under it next time for easier clean up.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie Bleyenberg",
      "helpful_votes": 17,
      "publication_date": 20160607
    },
    {
      "title": "Still gets the job done",
      "text": "I've had this grill for 5 years now and I think it's a great concept and good grill. And larger than most of the more expensive replicas. It's so convenient to just dump your charcoal, fold and go. I still deal with the problem from the latch.but the grill is usually propped alongside a rock so it doesn't bother much. The kids still love it as a fire pit to roast marshmallows.",
      "rating": 4.0,
      "verified": true,
      "author": "Jolie14",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "The best little grill!!!",
      "text": "This grill is amazing!!! Assembly was cake, clean up is a breeze..just dump out the charcoal and ash & wipe off. Portable and really a great but!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 2,
      "publication_date": 20200526
    },
    {
      "title": "The folding panels don't lock in with the rest of ...",
      "text": "The folding panels don't lock in with the rest of the frame. I'm sure the manufacturer/seller had knowledge about this deficiency. Clearly they decided to sell it as is without addressing the malfunction. This grill does not lock into place once opened. Be careful while operating as it could burn you as it is unstable.",
      "rating": 1.0,
      "verified": true,
      "author": "MrBluh",
      "helpful_votes": 4,
      "publication_date": 20170824
    },
    {
      "title": "Disappointed",
      "text": "Falling apart after two uses. And they have to nerve to increase the price. At the time of this review, we paid $20.25 and now the price is $29. You get what you pay for. I should have known better but my daughter thought it was cute. ::eye roll::",
      "rating": 2.0,
      "verified": true,
      "author": "Lindazkewl",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Excellent grill that takes almost no storage space when not in use",
      "text": "Unbelievable sturdy, nice grid that will last a long time. Couldn't believe how thin the box was, but it opens to a nice size grill. The openings at the end provide lots of oxygen, so got a much hotter fire a lot quicker than the enclosed old one I had. And once it was used, emptied and cleaned up, fit right back into its box.",
      "rating": 5.0,
      "verified": true,
      "author": "Doris E. Marshall",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "Best Mini Grill for the price :)",
      "text": "This portable mini grill is so easy to put together. You have one solid black Foldable holder. And a bottom rack for the coal, and the top three rack for the top grill. Sturdy hold.",
      "rating": 5.0,
      "verified": true,
      "author": "Pichilla Wiley",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "I bought this for the Super Bowl and I totally regret it",
      "text": "I bought this for the Super Bowl and I totally regret it! The worst purchase I have made lately on amazon I wish I didn’t use it or throw the box away so I can get my money back. The grill already stained after one use and it won’t stay open it’s completely uneven. I should have listened to the other people who gave poor reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "Angie J.",
      "helpful_votes": 2,
      "publication_date": 20180211
    },
    {
      "title": "Love this Grill!",
      "text": "Love this product, this the third one I’ve brought (one for each of my brothers) and they all love it!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Lynch",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "horribly unstable. Had to screw into both sides to ...",
      "text": "Cute idea, horribly unstable. Had to screw into both sides to held solidify the structure. Definitely need to put foil down below prior to setting up charcoal - both for easier clean up and to avoid charcoal crumbs (whatever you call it) flying around everywhere while in use. Could be made better. Definitely. But then again...look at what you're paying for it.",
      "rating": 2.0,
      "verified": true,
      "author": "aep005",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "Excellent portable grill",
      "text": "I was skeptical. However, this grill is excellent, will hold about 8 regular size burgers. It was easy to clean. I love the fact that it folds up and goes right back in the box for storage",
      "rating": 5.0,
      "verified": true,
      "author": "Roberta D",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "QUALITY!",
      "text": "Ok either the quality of this garbage thing has changed or the 5 star people on here have no idea what good quality is. This thing is garbage and rack does not stay in place while grilling. It’s dangerous as hell. They get ZERO for quality. Cheaply made. Waste of money. The Only reason I bought it was because of the size. Waste of my money",
      "rating": 1.0,
      "verified": true,
      "author": "Roz",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "GREAT GRILL",
      "text": "got this grill to take to the beach. it works perfect i looked at the reviews and it does need a little help to be stable but if you drill a small hole and add nuts and wing nuts to it makes a huge difference. also it says not to put any soft wood or anything for that fact other than coals i put wood in there and still works fine great buy really recommend this if you want something fast and easy only down side is no carrying case but it does have handles to carry if you don't mind that",
      "rating": 5.0,
      "verified": true,
      "author": "THE ESTRADAS",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Stylish and Portable",
      "text": "This charcoal grill is exactly what I was looking for! The design is stylish so I don't mind having it out. I also like the cone-shaped bottom for the charcoal. I personally use this at home in my patio, but I love that I have the option of taking it with me whenever I need to.",
      "rating": 5.0,
      "verified": true,
      "author": "K. C.",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "It is fantastic. The design of this grill (Notebook Style) makes ...",
      "text": "I bought this grill to prepare for Hurricane Irma. It is fantastic. The design of this grill (Notebook Style) makes it easy to carry around and set up. Thank you, for getting this product to me in time to brave Hurricane Irma.",
      "rating": 5.0,
      "verified": true,
      "author": "RFiggz",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Perfect for Tailgate.",
      "text": "Great for tailgating! Perfect size and very portable, doesn’t take much space. The charcoal starts right up since there’s a vent underneath.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Don't think twice buy it. Great portable grill.",
      "text": "I like that it was easy to move and setup. My purpose for buying it. Plus my girl loves it. I didn't have to drill a hole in the two sides. If you set it up right by placing the middle grill inside it holds together great. 😎😎😎",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Good stuff",
      "text": "I love the way it looks. Perfect for my place. Nice, love the way it folds up. Easy to clean, cooks wonderful. Love the 3 pice grills. I can add charcoal at anytime. And move food to a cooler place. Love it. (Note) if you add a top to it, so you can smoke your meat. I believe you have a winner. If you do send me one please! Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn Isley",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Dont waste your $$$",
      "text": "Too unstable and grill wires keep coming apart. There are large openings at both sides that could potentially allow firey charcoal to roll off and fall out of the grill. I am returning it.",
      "rating": 2.0,
      "verified": true,
      "author": "Flyingfool5",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Nice and compact",
      "text": "Received it have not opened it since we are on quarantine, but this should be perfect for the beach and park when you don’t want to use public grills",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa❤️",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Good but could be better",
      "text": "It is good because adds portability, however it is not easy to clean and not well build (thin steel layers and and poor weld). Will work ok if you use it occasionally (~1x a month).",
      "rating": 4.0,
      "verified": true,
      "author": "Kieu",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Portable grilling seriously does not get any better than this",
      "text": "This thing is so easy it’s not even funny. Strictly speaking we’re not supposed to have charcoal grills in our apartment complex, so I set this up in the fireplace. Totally works",
      "rating": 5.0,
      "verified": true,
      "author": "Kim B",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "I'm sure it will grill just fine which is the point anyway",
      "text": "Haven't used it yet. I absolutely cannot get it back together and folded up flat! What a nightmare. There are 2 screws holding it together and both were very loose, it was bent all over the place. If you're not careful setting it up then it opens too wide and the wings wont stay closed because they can't reach the other side. I was really excited about it but it's kind of a let down. I'm sure it will grill just fine which is the point anyway.",
      "rating": 3.0,
      "verified": true,
      "author": "Dennis Cheney",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Good to grill once or twice...makes a stellar fireplace",
      "text": "Grill will rust if left in the rain or outside for a prolonged period of time. Hard to clean overall. I use it as a fire pit now because my grill guards are rusty and dirty.",
      "rating": 4.0,
      "verified": true,
      "author": "AmazonNINJA",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "So easy to transport",
      "text": "I love how compact it is and how easy it is to clean. My only problem is since there isn’t a cover it takes longer to start fires and put fires out.",
      "rating": 4.0,
      "verified": true,
      "author": "Tiana Thompson @yourfavoritehealthcoach",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Easy to use and store",
      "text": "This grill is perfect for camping trips. Folds easily, easy to carry, Assemblies is a few seconds and works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike T.",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Perfect portable grill.  Easy clean up and take up little storage room.",
      "text": "Just used this for a family 4th of July party and it was perfect! We cooked steaks on it and were suprized how many fit. Easy to clean and store.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Tracy",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Simple and Portable",
      "text": "Easy to assemble. Easy to clean. Simple and portable. However, the item arrived warped and wouldn’t hold the grill in place.",
      "rating": 3.0,
      "verified": true,
      "author": "Mixko",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Fire burned through sides",
      "text": "Was easy to set up and use first time BUT unfortunately after first use I realized the sides had burn holes in them. Not very please as I expected more than a few uses out of it. Hoping it will last through rest of summer",
      "rating": 2.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Great For Small Spaces",
      "text": "I lived in Brooklyn near a park when I bought this. The design is very smart and easy to use with very little set up out of the box. You can get a good 1.5 hours of burn out of the charcoal, and fit 6-8 burgers on at a time. When its folded flat I found I could fit it in large tote bag and bike with it hanging from the handles of my bike. Clean up and storage is easy. Someone had it all figured out when they made this grill. When I moved out of the area it was immediately claimed by another grilling enthusiast living in a small space.",
      "rating": 5.0,
      "verified": true,
      "author": "Naomi Donabedian",
      "helpful_votes": 0,
      "publication_date": 20130105
    },
    {
      "title": "Great space saver.",
      "text": "Works great, we take it on the boat. Saves room when folded up. We go to a island cook hot dogs and hamburgers. We use the river to cool it off after cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "Dane K.",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "great little bbq",
      "text": "great for something to cook on fast and great for traveling. cooks fast and taste great cant go wrong",
      "rating": 5.0,
      "verified": true,
      "author": "catarina",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Portability",
      "text": "Love this little thing! It is the hottest grill! LOL No really this grill is great for two to three people. Its light weight and easy to carry around. I just think it's the coolest thing:)",
      "rating": 5.0,
      "verified": true,
      "author": "cindy",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Good Product",
      "text": "Easy to set up, easy to use We bought this grill to use on a camping trip with a family and friends. The grill was extremely easy to set up - just pop it open and put the grill over the top. We made chicken kebabs which turned out quite well and we all had a great time. A few complaints are the build quality. We bought two, and one had a misaligned hinge, so it wouldn't stand properly until the grill was placed over the top, locking it into place. Other than that, it's a solid grill.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelvin Lin",
      "helpful_votes": 0,
      "publication_date": 20140722
    },
    {
      "title": "Good for saving space, but design is a tad flawed.",
      "text": "I bought the grill to bring in a road trip to a music festival. We needed something that wouldn't take up too much space in the car and this was perfect. The surface was large enough for our pans and for a lot of hot dogs, so it worked great. However, it does not line up correctly. There's already a comment about this. When I first put it together it looked like it lined up perfectly, but once it has been sitting or when you add weight to the top, there are gaps between the grill top and the sides. It's nothing too extreme and the grill still works fine, it's just kind of annoying.",
      "rating": 4.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 3,
      "publication_date": 20150627
    },
    {
      "title": "Best!",
      "text": "Looooooooooove it. The material is such that i may need to replace every new trailride season but i have NO issue w that. Its simplicity and compact nature makes it worth it. You dont need many bricks. 10 max for simple meat(brats, wings, etc...8 for breakfast for 4. Seriously",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Excellent",
      "text": "Excellent. Exactly what I was hoping for. Saw a few reviews where they received some worn or rusted parts so I was a little nervous but mine was brand new seemingly fresh off the assemly line. My wife put it together in like 5 mins.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Brown",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "The grill bended with the first use",
      "text": "I’m not sure why the grill doesn’t fit inside, in the picture it fit right in but I have to carry the grill and the base separate because it will not close with the grill inside. It also bender with the 1st use",
      "rating": 5.0,
      "verified": true,
      "author": "WEN2211",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "My grandmother did not believe a grill was in the box it arrived in !",
      "text": "She thought I was joking. After showing her she said in all her life she never thought a grill would been in that box. She has used it a few times and marvels over how well it works for her needs. She has a little 2 foot cinderblock wall next to garden she sets it on, but you may want to consider that cause its not tall and sits low.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Martin",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Do not Buy this... Poorly made, ...",
      "text": "Do not Buy this... Poorly made, I used only once and it broke, had hard time opening it and closing it. Bulky not small or simple portable as they claim. Save your money don't buy this BBQ grill,",
      "rating": 1.0,
      "verified": true,
      "author": "Sitoto",
      "helpful_votes": 2,
      "publication_date": 20170430
    },
    {
      "title": "Damaged on arrival",
      "text": "I bought this item for use at a renaissance festival campgrounds, as they don’t allow ground fires. I foresee it shall work out as expected, although the item was damaged,scratched, bent, and rusted upon arrival. Hopefully it will stand up to lifhting a fire in it",
      "rating": 1.0,
      "verified": true,
      "author": "Carl",
      "helpful_votes": 3,
      "publication_date": 20171005
    },
    {
      "title": "I purchased three and one broke apart",
      "text": "I purchased three units and one broke apart. I want a replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "alex",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "We love it !! ❤️❤️",
      "text": "Amazing! good quality and it looks nice! and off course you can’t beat the price!👍🏼👍🏼",
      "rating": 5.0,
      "verified": true,
      "author": "Marwa",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Too close to the fire.",
      "text": "Poor grates. Flimsy connectors. Grill itself folds well. Cannot adjust height of grates.",
      "rating": 4.0,
      "verified": true,
      "author": "Susan Currie",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Portable grill champion. Great value grill.",
      "text": "It's not at all fancy or special, but what it does, it does very well. Value for price is great.",
      "rating": 5.0,
      "verified": true,
      "author": "relaxin",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "CONDO LIVING",
      "text": "I FREAKING LOVE THIS GRILL! DONT LISTEN TO THE BAD REVIEWS. I LIVE IN A HIGH RISE & THIS IS SO PRETTY AND SLEEK. I HAVE GRILLED CHICKEN BREAST & HAMBURGERS ON THIS. CAME OUT GREAT. BEST PURCHASE",
      "rating": 5.0,
      "verified": true,
      "author": "GIANNINA NICOLETTI",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Compact, lightweight, easy to carry.",
      "text": "Very compact. Easy to transport. Enough surface grilling area . Very good product!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "falalalala",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Well worth it",
      "text": "After purchasing this we have used it several times. It's perfect for a quick grilled meal. We read previous reviews and one reviewer said that after one use the paint peeled. Not sure how much charcoal he used or how hot his fire was but we've not encountered this problem. We found it to be perfect for our usage. It's held up nicely and is very portable for us to use in our RV on trips and at home. Easy to clean and store",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Kavanagh",
      "helpful_votes": 5,
      "publication_date": 20150612
    },
    {
      "title": "They're easy to clean",
      "text": "I have both versions of this Notebook Grill - blackened carbon steel version and the stainless steel version. When folded they are literally the size of a notebook computer. They're easy to clean, cook extremely well - keep in mind, use only a small amount of charcoal as the height of the grill top is not adjustable. It's good quality, easy to store, and reasonably priced for a small charcoal grill.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J. Perrotto",
      "helpful_votes": 0,
      "publication_date": 20140730
    },
    {
      "title": "Works Welland the \"Best Price\"",
      "text": "This charcoal grill is light in weight and may be used anywhere SAFE!! I use mine on a wood deck because the legs don't absorb the heat from the charcoal bin. It is very economical because the bin is small, not much charcoal needs to be used. Need to have a quick healthy charcoal food taste or snack? The grill will be your savior. Ready to grill in 10-20 minutes and food will be cooked however you choose to cook your favorite meat or vegetables!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Finnigan",
      "helpful_votes": 0,
      "publication_date": 20140505
    },
    {
      "title": "Good grill for the price",
      "text": "This grill is a good deal for the price. Easy to use, easy to assemble, easy to carry. I over filled it the first time and it got too hot.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200523
    },
    {
      "title": "Great idea... Needs better material",
      "text": "This is a brilliant little grill, perfect size for our camper! It folds down and fits like a glove in our outdoor kitchen. However, we've had it less than a month, used it less than 10 times and it's already starting to rust quite a bit.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeremy Gray",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "BEST GRILL for small places!",
      "text": "This folds completely flat and does not take up any space. Built sturdy as well!",
      "rating": 5.0,
      "verified": true,
      "author": "hai nguyen",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Perfect small size",
      "text": "Easy to set up and use, we live in an apt and are able to use this on our balcony!",
      "rating": 5.0,
      "verified": true,
      "author": "Nora",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Great product",
      "text": "I used this grill immediately after purchase. I am very satisfied. It is definitely worht the money. I have recommended to two of my friends already and I also highly recommend this grill to all of those people who are looking to get one of this size.",
      "rating": 5.0,
      "verified": true,
      "author": "B. M.",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "Grill is Awesome! folds flat",
      "text": "Grill is Awesome! folds flat, looks like a brief case with the handle on top or underneath, They designed the grates as three integrated pieces that fold to one and is stored easily in the top. I've used this for a couple of Tailgates at College games, it's great, just remember your lighter fluid or to get a chimney starter.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy W.",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "Must buy",
      "text": "I love this grill, super cute and easy to put together, and break down! No problems so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Talia",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "I am so disappointed.",
      "text": "The grill was broken as soon as I opened the box. The screws were rusty, and the top rack was broken and would not lay flat. I am so disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Loving It",
      "text": "Works great, keeps charcoal steadily lightened, easy to set up, very easy to clean and store. Glad I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dale",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Its an awkward size/dimension/idea. I wanted something to bbq ...",
      "text": "Its an awkward size/dimension/idea. I wanted something to bbq just for myself when RVing. This will do that. It holds charcoal. Its very lightweight I guess its aluminum?!?. Folds up. Will store laying down. They just don't make the old small hibachis anymore - that's what I wanted.",
      "rating": 3.0,
      "verified": true,
      "author": "Rochelle Lavoix",
      "helpful_votes": 0,
      "publication_date": 20160831
    },
    {
      "title": "Don’t bother with this. Find a better product.",
      "text": "This product stinks. It’s design looks clever; but, in practice, it’s a mess. I’ve tried using it 2 times. There won’t be a 3rd. I might just leave out for a metal scraper to retrieve.",
      "rating": 1.0,
      "verified": true,
      "author": "Stuart Klipper",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Slim",
      "text": "Love how slim it is but after first use it rusted",
      "rating": 3.0,
      "verified": true,
      "author": "colette clayton",
      "helpful_votes": 2,
      "publication_date": 20170423
    },
    {
      "title": "Perfect for outdoor",
      "text": "Its perfect for outdoor easy to use carry and clean",
      "rating": 5.0,
      "verified": true,
      "author": "zeshanbil",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Great little portable grill",
      "text": "Bought this little fold up grill to slide easily under our Motorhome. Tested it out at home and we’re quite impressed! Assembled perfectly and quickly. I think it will be perfect for our needs.",
      "rating": 5.0,
      "verified": true,
      "author": "play",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "A Great Travel Grill",
      "text": "These don't last long if left out in the weather but will work great if you keep them clean and dry. I use mine for car-camping and canoeing. I have bought three of them over the years and have one still in the box, ready to go when the other one is shot. Light weight and folds flat. Fits back in the box so that it does not make a mess when it's packed back into the car.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20161031
    },
    {
      "title": "perfect size and portability",
      "text": "This is a cute small grill. very easy to set up. nice size also. i cooked 5 steaks at the same time on it and was easy to clean also. i recommend if you want a portable easy to use grill",
      "rating": 5.0,
      "verified": true,
      "author": "Dane",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "I'm really glad we bought it",
      "text": "We bought this to have a little get together with some friends in the park and cook up some sausages. It worked perfectly!!! I'm really glad we bought it. There are some sharp edges, and it feels a little chintzy, but it worked great and clean up and everything was super easy.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Gerarden Dorshorst",
      "helpful_votes": 0,
      "publication_date": 20161114
    }
  ],
  "product_meta": {
    "title": "Fire Sense Black Notebook Charcoal Grill | Heavy Duty 14 Inch Steel Construction | For Outdoor Barbecues, Camping, Tailgating, Traveling | Charcoal Rack and Folding Grill Included | Foldable",
    "description": "Enjoy all your outdoor camping trips with this lightweight and compact Black Notebook Charcoal Grill by Fire Sense.\n\nBringing you the best in contemporary grills, this outdoor grill is the best option for any trips that require a portable charcoal grill. Though it is constructed from high heat resistant painted steel, this charcoal barbecue grill is very lightweight and measures only 14 inches when opened. The outdoor charcoal cooking grill provides you with 228 square inches of grilling area which is perfect for cooking an entire meal and even two large steaks at once. It folds flat to create its own carrying case that measures only 1 inch and is easy to store. Simply open the charcoal BBQ grill to make it stand and start grilling.\n\nThis BBQ grill uses charcoal as its source of fuel, and we do not recommend using wood chunks for the same as it may burn unevenly. However, please feel free to use a charcoal chimney starter to ready the coals.\n\nWe also provide a charcoal rack and a folding grill rack with your purchase. This grill rack is chrome plated. After grilling, please wait for the camping grill to cool down before folding it up. The racks fit nicely inside the small grill and provide you a quick and easy cleanup. This feature also allows you to quickly pack up and get the show back on the road.\n\nThis space saving camp grill can easily be stored in your car and carried with you wherever you may go. It is ideal for any camping or hiking trips, as well as picnics, tailgating, and your regular backyard grilling needs.",
    "rating": 4.2,
    "feature_bullets": [
      "This outdoor cooking grill uses charcoal as its source of fuel.",
      "This mini grill comes with a charcoal rack and grill rack included.",
      "This charcoal BBQ grill can be folded up in an instant for easy portability.",
      "This portable grill is made from high heat resistant painted steel.",
      "This barbecue grill is perfect for camping, tailgating, and picnics."
    ],
    "specifications": {
      "Product Dimensions": "17.53 x 11.82 x 14.18 inches",
      "Item Weight": "7.98 pounds",
      "Department": "Outdoor Living & Patio",
      "Manufacturer": "Fire Sense",
      "ASIN": "B001OC5PYY",
      "Item model number": "60508",
      "Customer Reviews": "4.2 out of 5 stars818 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#29,055 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Charcoal Grills",
      "Grills & Outdoor Cooking",
      "Grills & Smokers"
    ],
    "price": ""
  }
}