{
  "website_summaries": [
    {
      "verdict": "While it's affordable, easy to use, and works on both fleas and ticks, it may not be effective for everyone or for serious flea infestations.",
      "pros": [
        "An affordable flea and tick preventative that earns praise for its long tip that makes application easy",
        "Consistency isn't greasy, and it doesn't have a harsh odor that can bother cats and their owners"
      ],
      "cons": [
        "Mixed reviews on the results – some brag about how quickly it works, while others noted living fleas for a while after application",
        "Can't be used on kittens younger than 12 weeks"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Dangerous",
      "text": "Burned my cat and left a spot where his fur is now missing. This product is terrible. Please do not use.",
      "rating": 1.0,
      "verified": true,
      "author": "Malory Luciane",
      "helpful_votes": 151,
      "publication_date": 20190726
    },
    {
      "title": "Garbage DO NOT BUY TO SAVE MONEY",
      "text": "I wanted to save a few dollars so I purchased this product because I have a dog and I also watch dogs. I discovered a flea on my dog so I wanted to purchase this cheap remedy ASAP. After a week no improvement. I had to get my dog new medicine. DO NOT BUY. I am requesting a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 76,
      "publication_date": 20181018
    },
    {
      "title": "No Good",
      "text": "This stuff is a complete waste of money!I used this on my dog for 2 months and she still has fleas!!She is a long haired dog,so maybe on a short hair dog you can get different results!If you have a long haired dog,i wouldnt waste one cent on this stuff!!",
      "rating": 1.0,
      "verified": true,
      "author": "Jeremiah Peterson",
      "helpful_votes": 49,
      "publication_date": 20171024
    },
    {
      "title": "This seems to work better.",
      "text": "Worked on my (3) dogs , I buy (2) different types I have (1) large dog and (2) smaller dogs. I bath my dogs with a shampoo that is for killing and preventing Fleas and ticks and then I administer the drops . This seems to work better.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck310",
      "helpful_votes": 38,
      "publication_date": 20180128
    },
    {
      "title": "Killed my cat!!!!",
      "text": "This product killed my cat. The picture I attached is her after not breathing from a neurological reaction to this medication. DO NOT USE!!! We went to 3 different vets to get help and they all said it was hartz flea medications. We were giving her IV fluids and anti seizure meds and she finally just passed. Try it if you want your animal to die. Best cat ever. So sweet and so docile. This product has to be taken off the market.",
      "rating": 1.0,
      "verified": true,
      "author": "Tara Turner",
      "helpful_votes": 22,
      "publication_date": 20191111
    },
    {
      "title": "Nightmare for my cat!",
      "text": "I did one treatment for my two year old cat and not even ten minutes later she had a horrible reaction. She was painting, running around anxiously, got diarreha and bloody stool. I tried to wipe it off and the medicine made her skin burn and she was in horrible pain! This was a nightmare and I will NEVER use again.",
      "rating": 1.0,
      "verified": true,
      "author": "bg67991",
      "helpful_votes": 19,
      "publication_date": 20190513
    },
    {
      "title": "Cat had bad reaction.",
      "text": "We have two cats. Our Male who is slightly larger than female was fine after application. Our female however began having a violent reaction whith in minutes of application. She began scream meowing, running, rolling, and drooling. She is six and gets flea treatment every summer so this was not a new experience for her. She has never had this reaction to any flea treatment before. We ended up bathing her to remove the product. Will never use again. Hope they pull it till they figure out why it is doing this to some cats and fix it.",
      "rating": 2.0,
      "verified": true,
      "author": "FabFawcetts",
      "helpful_votes": 13,
      "publication_date": 20190602
    },
    {
      "title": "VERY DANGEROUS DO NOT USE ON YOUR PETS",
      "text": "First of all this product is SO liquidity it just drips down the cats backs for them to lick. I put it on both of my adult cats and one of them licked some off and had a terribly scary reaction. I will never use again.",
      "rating": 1.0,
      "verified": true,
      "author": "mrshoff",
      "helpful_votes": 14,
      "publication_date": 20190722
    },
    {
      "title": "Absolute GARBAGE!",
      "text": "This stuff has a hideously strong absolutely vomitous chemical smell. The first dose the cat was absolutely frantic for a full day till it evaporated off. Still found a tick on her. The second time she is so miserable she is not only running around the entire house trying to get away from the smell, she is attacking anyone who tries to touch her. I tried my best to try and wash it off her but I don't know how successful I was. Even if this stuff did work nothing is worth putting a cat through this misery, NOTHING.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20190722
    },
    {
      "title": "Works fine",
      "text": "I have an outdoor cat and there’s a colony nearby he socializes with. I noticed fleas and ticks on him and he let me put this on him. Definitely made a big difference and improvement. Good, cheap product to get rid of fleas and ticks.",
      "rating": 5.0,
      "verified": true,
      "author": "SPAMEGGSNRICE",
      "helpful_votes": 9,
      "publication_date": 20181209
    },
    {
      "title": "Buyer BEWARE!",
      "text": "BUYER BEWARE! I bought this for my dog and my cat. And not only did it not work. But it made my cat sick! The only good thing about this was that Amazon is amazing and is giving me a refund for my dog Hartz. But im gonna have to eat the money for the cat. For anyone wondering, my cat is fine now. But it took her 3 days to get back to normal. Definitely read reviews and believe is when we say it doesn't work! Buyer BEWARE!",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah Gulbrantson",
      "helpful_votes": 9,
      "publication_date": 20190703
    },
    {
      "title": "Still found ticks on my 2 dogs!!!",
      "text": "Doesn't seem to work! I have 2 small dogs and one had a tick 2 days before next dose on the skin! And less than 2 weeks in my other dog had a fat tick on her too!! Doesn't seem to be doing what it says it suppose to do! I don't want my dogs getting Lime disease etc! Makes me wonder if it repels Mosquitoes like it says I don't want my dogs to get Heart warms either!! Not happy! I want my animals to live a long Happy life but not with this they won't! I followed everything it said to do and not to do!😡",
      "rating": 1.0,
      "verified": true,
      "author": "SweetTexas",
      "helpful_votes": 6,
      "publication_date": 20190529
    },
    {
      "title": "Worthless on my 5 lb yorkie. Useless.Nothing.",
      "text": "Dont even bother. Price should have told me but my dog needed something till i could get Brevcto. He weighs only 5 lbs. Nothing.",
      "rating": 1.0,
      "verified": true,
      "author": "Ventura Beach,  CA",
      "helpful_votes": 8,
      "publication_date": 20190815
    },
    {
      "title": "Poisoned my cat! Do not use.",
      "text": "I gave my cat this as instructed and 3 hours later he was puking, having a hard time breathing, and didn’t want to stand up. Then read all the reviews online (not amazon) and found that animals are literally being poisoned by this product. Do not give this to your pets unless you want an unplanned emergency vet visit and could even kill them. Wish I could give it 0 stars",
      "rating": 1.0,
      "verified": true,
      "author": "Boomernoises",
      "helpful_votes": 9,
      "publication_date": 20190630
    },
    {
      "title": "suprised",
      "text": "We just moved to WV this winter and with spring here comes the fleas, we tried all of the expensive topicals that worked for us in FL with no affect, poor kitties dug themselves raw. Honestly I bought this as a half hearted effort because I needed $3 more for free shipping and I never thought it would work. It did!!! I have 4 cats from 4 yrs old up to 20 yrs old and this worked for every single one of them. In FL it didn't even slow the fleas down, my WV fleas died!!! YAY ordering more right now!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine H",
      "helpful_votes": 5,
      "publication_date": 20190520
    },
    {
      "title": "Terrible and shouldn't be allowed on the market",
      "text": "This product made my cat's fur fall out in the area I applied it to on the back of his neck. I have also still seen fleas so it hasn't worked and has burned my cats skin",
      "rating": 1.0,
      "verified": true,
      "author": "Bre",
      "helpful_votes": 8,
      "publication_date": 20190416
    },
    {
      "title": "Good value",
      "text": "Great for the price. Paying for a high priced monthly flea/tick deterant can get pricey. These were very well priced and work just as good as higher priced deterants. Will continue to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Orders A Lot",
      "helpful_votes": 9,
      "publication_date": 20180916
    },
    {
      "title": "It doesn't work",
      "text": "Don't buy this it doesn't work!!! I bought this for mine and my Brother's cat (we live together) and this product is terrible! They both had some fleas and they are both indoor/outdoor cats were they only go to the screened in patio. They are bathed and have flea collars too. We gave them the first treatment and it didn't do anything. They got worse! They were so infested with fleas they were biting themselves and pulling their own fur out! My Brother's cat was bleeding when he gave him a bath. They have both gotten baths weekly or more.",
      "rating": 1.0,
      "verified": true,
      "author": "dolph964",
      "helpful_votes": 4,
      "publication_date": 20190414
    },
    {
      "title": "A good value",
      "text": "I found this as effective on my farm cat as the Frontline had been, at a fraction of the cost. I did follow other's advice to apply the Hartz fluid in small doses over a period of 3 days. My cat did not show any adverse reaction (although she always dislikes having the smelly stuff -- Hartz OR Frontline -- dripped into her fur at the back of her neck where she can't like it off). I'll keep using Hartz.",
      "rating": 5.0,
      "verified": true,
      "author": "Garry Roseman",
      "helpful_votes": 5,
      "publication_date": 20190728
    },
    {
      "title": "STAY AWAY - This product is dangerous!",
      "text": "STAY AWAY! This item should NOT be sold or bought! I purchased this for my indoor cat who likes to window-sit and I couldn’t regret it more! I should have done my homework. Within minutes of application (as directed) my cat was panting, spazzing out, had completely dilated pupils and was crying for help! Immediate vet intervention required with this product. *DO NOT PURCHASE if you value your kitty’s wellbeing*. Learn from my mistake and spend a little more to buy a reputable product that hasn’t had recalls for neurological damage to cats!!",
      "rating": 1.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 4,
      "publication_date": 20190918
    },
    {
      "title": "It solved our flee issue.",
      "text": "Best flea and tick stuff that I have used yet. Seems like every year we deal with flees no mater what I stuff I put on my dog. This year is the first with no issues. I am very thankful for that. I will be buying this product for next summer as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Colt and Missy",
      "helpful_votes": 13,
      "publication_date": 20170627
    },
    {
      "title": "Cat lost it's hair",
      "text": "I would not recommend this to ANYONE. My perfect healthy female cat, OVER 5 pounds has lost all it's hair in the area I put the drops and it has been 2 weeks and hasn't grown back and the Vet says it probably WON'T DO NOT BUY! I should contact a lawyer to get my money back and to get a refund for the vet bills!",
      "rating": 1.0,
      "verified": true,
      "author": "EnsJohnnyMaestro",
      "helpful_votes": 5,
      "publication_date": 20190903
    },
    {
      "title": "SEVERE REACTION - WILL NEVER USE AGAIN",
      "text": "Within minutes of using this product on our cat, he started running around frantically. The smell was so bad. Thirty minutes later the cat was panting and would not come near us. We tried to wipe the product off with wet towels. Now where the chemical was used on the back of the cat's neck, all the hair is gone. He has a bald area now. I will never use this product again on a cat. Please do not purchase this Hartz item!!!",
      "rating": 1.0,
      "verified": true,
      "author": "McRxcop",
      "helpful_votes": 3,
      "publication_date": 20200706
    },
    {
      "title": "This product seriously harmed my pet",
      "text": "My cat had an extreme allergic reaction to this product. That is WHY it gets one star. I placed it on the back of his neck as directed and within a few hours he was bleeding and lost all of the hair from that exact area. When I washed off the product the reaction stopped getting worse but it still took over a week to heal. I guess I have to say something nice, the packaging is acceptable, the product was dangerous to my cat though.",
      "rating": 1.0,
      "verified": true,
      "author": "Privacy is nice",
      "helpful_votes": 3,
      "publication_date": 20191206
    },
    {
      "title": "Awful smell smelled like poison not normal",
      "text": "Do not purchase this product buyer beware I opened up the packaging and put it on my cat then after I put it on her the smell came very noticeably. Poor cat, washing didn't remove the horrible smell. Cat is miserable and so am I, had to open a few windows to air that smell out. No skin reaction as of yet will never purchase again !! Go ahead and spend a bit more do you and your cat a favor and don't bother with this treatment.",
      "rating": 1.0,
      "verified": true,
      "author": "branden boling",
      "helpful_votes": 3,
      "publication_date": 20191023
    },
    {
      "title": "Works!",
      "text": "No ticks for a full 30 days each dose! Easy to apply (though having another pair of hands to hold my cat still was helpful) and didn't notice any side effects. I thought I might be able to go over 30 days, but sure enough it wore off and found one on him. Applying the second dose today :)",
      "rating": 5.0,
      "verified": true,
      "author": "Jax",
      "helpful_votes": 4,
      "publication_date": 20190622
    },
    {
      "title": "works great",
      "text": "live in the woods, flea's and tick's can be a real problem for pets, but this makes my life and their's much happier, no scratching without relief for them. They are happy, which makes my life much easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Isabella L. Wilson",
      "helpful_votes": 6,
      "publication_date": 20181029
    },
    {
      "title": "Works good for prevention, or alongside other treatments",
      "text": "Love this stuff for preventing fleas and between stronger flea treatments. I had an infestation a year ago and this stuff did NOT do the trick, but a pet store associate told me it’s good to alternate brands in an infestation, so this was good between Cherestin or Frontline Plus treatments. What did the trick was treating every two weeks rather than four (just during an infestation) with alternations between this and a stronger one each time, AND flea home spray such as the one by Hartz (spraying places the cats hang out like beds, walking areas etc once every few days or so)",
      "rating": 4.0,
      "verified": true,
      "author": "Lindsey Hammond",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Made my puppy act weird",
      "text": "For a solid week after applying this on my puppy, she had way more accidents than normal and her behaviour was out of character. It also didn't work bc she still had fleas. So it wasn't worth the risk of her health and was returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Jamie Bruno",
      "helpful_votes": 5,
      "publication_date": 20190103
    },
    {
      "title": "Does not rid my dog of Fleas",
      "text": "Normally with similar products I give my dog a flea bath, then apply this flea prevention. However this product doesn't work the Fleas just get back on my dog. I even waited two weeks and repeated the process, yet still this product performed poorly.",
      "rating": 1.0,
      "verified": true,
      "author": "Jalen Barber",
      "helpful_votes": 5,
      "publication_date": 20190111
    },
    {
      "title": "We NEVER have fleas. Ever.",
      "text": "I’ve used this on all my dogs for about 10 years now. Every dog responds to it the same and we never have fleas, ever! My dogs don’t itch until just about when I need to reapply. That being said when I brought in a new flea bag riddled with ticks and fleas, it took about a month to rid both dogs of them using this and shampoo because they were everywhere in the house! We literally have not had fleas in our home for about 8 years and it’s amazing! Btw we lived in FL then SC and now NC if y’all are worried about the climate.",
      "rating": 5.0,
      "verified": true,
      "author": "nmzkaufman",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Satisfied customer",
      "text": "I use this on my little dogs. (Pekingese) it works satisfactorily. I’m very satisfied with it because I don’t want strong chemicals on my dogs.",
      "rating": 4.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 5,
      "publication_date": 20181130
    },
    {
      "title": "Took More than three weeks",
      "text": "Have fore dogs,they got a very bad case of flea infestation. gave them weekly flea baths,flea powder,flea spray for about two months.They still had fleas. Tried this product did not think it was working.After three weeks no real results,than all the sudden they were gone.Could not find any fleas.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy consumer",
      "helpful_votes": 5,
      "publication_date": 20181219
    },
    {
      "title": "Afraid to use it again",
      "text": "I have 2 cats. The smell was very strong and they both freaked out when I put it on them. My one cat even hissed at me and ran from me after I put it on him. I think that it may have burned or irritated their skin. They both scratched and pulled their hair out for a week after applying it. I found clumps of cat hair all over my house. I'm afraid to use it on them again.",
      "rating": 1.0,
      "verified": true,
      "author": "Angela B.",
      "helpful_votes": 4,
      "publication_date": 20190618
    },
    {
      "title": "Fleas - be gone!",
      "text": "My pups are always gets into odd spots and brings unwanted critters home...aka fleas. I bought the Dual Action 5-14lb, Pro 5-14lb and the Dual Action 61-150lb topical treatments. The treatments were fast acting and after a week its been fabulous as I have not seen any fleas when combing. Each of the dogs have different needs and get into various things. Each of the products fulfilled those needs and are currently preventing those unwanted fleas on my pets and in my home! Plus, the Pups are happy, so I am happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 2,
      "publication_date": 20181210
    },
    {
      "title": "It didn't work for my cats(inside cats)",
      "text": "Used on my cats who live inside all the time. For my cats it's not working. They seem to have multiplied since I used it. I am fed up with Hartz.. I'll never buy again. I'm going to a different on(hope it works) when the month is up to reapply.",
      "rating": 1.0,
      "verified": true,
      "author": "Gladys Faye Hanson",
      "helpful_votes": 3,
      "publication_date": 20190607
    },
    {
      "title": "One cat had a terrible reaction to this product.",
      "text": "We applied the product as directed to each of our 3 cats. 2 cats had no problems whatsoever. However one of our cats had a terrible and very strange reaction. She ran around the house like crazy and was in severe discomfort/pain immediately after applying the tick & flea guard. Subsequently she has totally lost a patch of hair where the product was applied. The bald patch is 3 to 4 square inches and was raw for a few days. It has now healed and the hair is starting to regrow. If we had applied concentrated acid to the cat then this is the reaction we had. My poor cat.... Never again my poor dear friend!",
      "rating": 1.0,
      "verified": true,
      "author": "Alex Divov",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Five Stars",
      "text": "I noticed immediate results the day after I gave my dog a bath, I will be ordering again.",
      "rating": 5.0,
      "verified": true,
      "author": "sylvester handy",
      "helpful_votes": 8,
      "publication_date": 20180216
    },
    {
      "title": "It easy I just order  5 box’s every month from Amazon",
      "text": "I use for my cats , I had 15 cats with me lived in Waimānalo , I buys 5 box’s for every month 👍",
      "rating": 5.0,
      "verified": true,
      "author": "David K.",
      "helpful_votes": 7,
      "publication_date": 20190704
    },
    {
      "title": "Do not buy",
      "text": "Literally made the hair fall off the back of my car and gave her a Superbad rash. Do not buy",
      "rating": 1.0,
      "verified": true,
      "author": "CabernetMountain",
      "helpful_votes": 4,
      "publication_date": 20190624
    },
    {
      "title": "Not strong enough",
      "text": "I have used Hartz products in the past. This time this particular product it did not work for my dog , twice. I followed the directions and went through a series of two applications. The fleas took up residence on her lower stomach. So it worked over her back and her torso but it did not work on her lower stomach where the product was not applied both times she had very bad fleas on her lower stomach that I had to buy a secondary flea product In addition to get rid of them. For what I spent I could’ve gotten a higher cost better brand and not put my dog or myself thru that.",
      "rating": 1.0,
      "verified": true,
      "author": "Judge Judy of Online Shopping",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Affordable product that works.",
      "text": "I use it monthly on the cats and it's not so strong that it makes them sick but it kills& repels fleas.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190414
    },
    {
      "title": "Hurt my cat!",
      "text": "This stuff gave my cat a chemical burn and did not get rid of the fleas.",
      "rating": 1.0,
      "verified": true,
      "author": "Debra",
      "helpful_votes": 4,
      "publication_date": 20190719
    },
    {
      "title": "Didn't work",
      "text": "Didn't work for us and we've tried several kinds of treatments. But the company was quick to send a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 5,
      "publication_date": 20180917
    },
    {
      "title": "If you want your cat turning into Rabid Satan, this product is for you",
      "text": "This product looks great in the design and packaging. However my cats turned into rabid satan when I put it on them. They are all over the required weight, I followed the directions perfectly. 3 different cats and the same 3 reactions. I'd say a big huge he double hockey sticks no to this crap. Seriously all three of my cats were panting for hours, foaming at the mouth, this crap is poison. Hartz can piss off, I won't ever buy anything of theirs again.",
      "rating": 2.0,
      "verified": true,
      "author": "Shannon ",
      "helpful_votes": 2,
      "publication_date": 20190630
    },
    {
      "title": "Doesn't work!!",
      "text": "This product is not showing any signs of preventing or activie killing. We have taken all the steps to prevent spread and preparation at our home. This product along with the dog version doesn't work. Especially on our cat its as if I never applied the fleas are noticeable and active. Highly disappointed at the value of cost I guess that should be expected. Disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Troy A.",
      "helpful_votes": 2,
      "publication_date": 20190718
    },
    {
      "title": "Never again",
      "text": "I bought this to treat our dogs and they both ended up with a sore at the back of their neck and the base of their tail within 2 days of application. My older dog sadly reacted a bit more and had sores all down her back so we had to shave her to clean and heal the sores. Luckily Im always prepared with my animal first aid kit but companies need to start going more all natural with these products so our animals dont have to suffer stupid side effects. Im glad it was just sores and no major reactions or death.",
      "rating": 2.0,
      "verified": true,
      "author": "NikkiFar83",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Nasty",
      "text": "Works for a few days. Smells so bad! Drives cats crazy from the smell for hours; they try to lick it off and then try to run from the taste if they get any in their mouths. It's miserable and I feel like a awful excuse for a pet owner for using it. Leaves fur sticky for a few days. Review updated: kills the first layer of skin on my cat's neck which sheds after a few days, along with half his hair. He is itchy and miserable. Does not repel fleas as far as I can tell. Awful s**t.",
      "rating": 1.0,
      "verified": true,
      "author": "AmyG",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Didn't work all the way.",
      "text": "I got this product hoping to get rid of this awful flea problem. I've been using all kind of products so edit this to the mix. I don't know exactly which product worked because it did get rid of the fleas for like 3 days? But then they slowly started appearing again. I'm about to rip my hair out! Perhaps this product would work for a dog that maybe lives in an apartment or something. But I have five dogs and it didn't work which makes me sad. So perhaps it works for others just not mine.",
      "rating": 2.0,
      "verified": true,
      "author": "Coco",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "One Star",
      "text": "My dogs are still scratching likes it's nobodies business a week later.",
      "rating": 1.0,
      "verified": true,
      "author": "Jon Reyn",
      "helpful_votes": 6,
      "publication_date": 20180502
    },
    {
      "title": "Works great",
      "text": "It works my dog didn't get sick and did not have any skin problems and it is a cheap option",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20170703
    },
    {
      "title": "Not \"Handed Directly To Resident\", as reported:  But Good Product",
      "text": "Our dogs have had this product used on them along with flea collars, the combination works well. However, the Amazon driver didn't show up (with only nine stops before us) for over an hour and a half. Then, he did as I instructed: He dropped the package at the curb, with no friendly words nor smile... Poor \"presentation\". But, that doesn't speak of how the seller nor the manufacturer did their jobs, which is \"GREAT!\". I'll likely order these, from Amazon, again, especially if they speak to their deliveryman.",
      "rating": 5.0,
      "verified": true,
      "author": "Edgar Mosier",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Treatment did not last as long as advertised.",
      "text": "Effect of this treatment ran out before a month was over. I found fleas on my white chihuahua & had to bathe her in flea shampoo & treat her bedding, etc. This has never happened to me. Either the product was weak, stored improperly or it just was not effective as advertised. I sincerely hope I received a bad batch, because exposing puppies to fleas & ticks can be dangerous & it’s not something I want my puppy to have to go through. I still have a treatment left , but I will be careful to inspect her everyday for 1 month to see if this happens again.",
      "rating": 2.0,
      "verified": true,
      "author": "christina newsome",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "don't know if this stuff is really good but I think it does the job and the ...",
      "text": "don't know if this stuff is really good but I think it does the job and the price is right. I try to use this for the 3 months then buy an expensive one for my dog then go back to this kind",
      "rating": 4.0,
      "verified": true,
      "author": "Natalle",
      "helpful_votes": 5,
      "publication_date": 20180404
    },
    {
      "title": "READ FIRST!",
      "text": "!! Please be cautious using this product. We put the treatment on our kitten and the next day put the collar on her. Quickly after she got super sick. We thought it was a cold but quickly landed us in the ER and her nearly dying. The drops and collar were poisoning her and she was so close to death. We had to call animal poison control(that cost $75 to just call) said that Hartz is one of the top brands that they have seen for toxicity. Thankfully we caught it in time and she is stable right now. !!",
      "rating": 1.0,
      "verified": true,
      "author": "BBrooks27",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Did Not Work",
      "text": "This Product did not work at all not even for a indoor cat. My daughter's \"indoor\" cat still got fleas and so did her 4 story house... What a mess that was !!!..It took months to get rid of them all with flea bombs- home flea pesticide sprays and Food Grade Diatomaceous Earth Powder and Clean Up. The problem is Fleas have/are becoming Mega Fleas just like the Lice did & built up a immunity to the weaker products and This Product doesn't Protect.",
      "rating": 1.0,
      "verified": true,
      "author": "patty pattison",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "PERFECT",
      "text": "I have been using this stuff on my dogs for years and not a flea or tick in sight! PLUS, it's SO much cheaper than other similar products! My only complaint is that my dogs' backs are greasy for a few days after application, but that has been the case with every topical flea treatment I have used so I don't mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Caitlyn Rifenburg",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Not effective and waste of money",
      "text": "Not worth the money. I always purchase organic chews and use vets best organic type spray like peppermint oil for our fur kids ( miniature schnauzers) and should have stuck to it. I thought it was a good deal and would try it and see. Didn't work at all, smelled awful , one of them got a rash and I feel awful I didn't realize what the ingredients were. Don't waste your money . They had just gotten a few fleas each and it didn't do anything to stop, yield etc",
      "rating": 1.0,
      "verified": true,
      "author": "TXGypsydoll",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "The chemical smell is disturbingly strong",
      "text": "Very strong chemical smell as soon as I opened the package. I thought one of the tubes must've leaked but all 3 were sealed and undamaged. Against my better judgement I still applied the treatment to my cat. An hour later she seemed lethargic and began vomiting from what I can only assume was an unfortunate reaction to the treatment. She's okay now but it could've gone differently and inexpensive (cheap?) products sometimes aren't worth the savings.",
      "rating": 1.0,
      "verified": true,
      "author": "TT",
      "helpful_votes": 3,
      "publication_date": 20190629
    },
    {
      "title": "Beware ask a vet first",
      "text": "My vet says this is the worse brand to use. I put some on my cat and some got on my dog and now she walks like she cannot feel the ground, left front leg shakes while she is peeing. She cannot use the doggie door or bend down for food/water dish. I cannot find a local vet who has an opening to see her which now she needs lab work. I am detoxing her and I hope she will be ok. She is a German shepherd and I hope this didnot aggrivate underlying issues that is in their bloodline. I am so sad and I hope she makes it okay. Day 3",
      "rating": 1.0,
      "verified": true,
      "author": "Caroline",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Ineffective.",
      "text": "I used the appropriate package for my 2 40lb dogs. I administered these drops as directed and 3 days after bathing. This product simply had little to no effect after just over 2 weeks and now one dog has a bald spot from scratching. I used to use an oral product which worked perfectly but now I cannot find it on Amazon.",
      "rating": 2.0,
      "verified": true,
      "author": "Arendayan",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Doesn't kill ticks!",
      "text": "I bought this just last week for my St. Bernard because its supposed to kill fleas and ticks - mind you, my dog had neither just did it for preventive purposes - a week later, we went on a hike and when we got home we found ticks on him!! Some were dead (they were small, so assume they were males) but many weren't (they were grey greenish, and fully engorged so I'm assuming they were females)! Not sure why it killed some but not all...therefore I'm giving this product a 2 star. Disappointed, now I need to find another product for my boys.",
      "rating": 2.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Barn cat approved",
      "text": "My baby Barnaby is an outdoor barn cat. He sleeps in my shed where it is warm but has a great time cuddling with all the local lady kitties. Somewhere along the line, he got deer ticks that were lined up all around the outside of his ears. This stuff did the trick within 2 days. He hasn’t had any since either. It has somewhat of a strong odor at first but it went away rather quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "OMG! My Poor Torie!",
      "text": "I have been using Hartz since my cats were kittens. I used this on my 4 year old Tortie and she went wild all over the house! At the location a large patch of her beautiful fur fell out and her skin is developed a rash by the time I got home from work! Did the formula change? DO NOT PUT THIS ON YOUR CATS!!",
      "rating": 1.0,
      "verified": true,
      "author": "Emi555",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Works, sort of...",
      "text": "My super fluffy outside cat seems happy with this and when she comes in the house to sleep, she seems OK. So, I guess it is working (the similar product for dogs is a dud).",
      "rating": 5.0,
      "verified": true,
      "author": "hotchas",
      "helpful_votes": 3,
      "publication_date": 20181030
    },
    {
      "title": "DO NOT BUY!!! Strong chemical smell, bad reaction",
      "text": "Do not buy this product! I put it on my cat today and within 20 minutes she started acting strange. She started panting like a dog, scratching like crazy, losing clumps of fur, rolling around like her fur was on fire. This typically clingy kitty was hiding like she was terrified. Once we were able to wash the bulk of it off, she started to calm down but is still leery of everyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Hartz Flea",
      "text": "I have used this product for about 3 years it works great and it’s a great buy",
      "rating": 5.0,
      "verified": true,
      "author": "J D Cook",
      "helpful_votes": 3,
      "publication_date": 20190504
    },
    {
      "title": "It killed our cat!!!",
      "text": "It killed our cat!!! Our vet told us it’s the 4 cat in the past 16 months she saw die from the stuff. Our cat went into shock with tremors. It was a horrible death with seizures! We tried to wash the product off but it was too late. Do not use it!! Do not buy it try to find a natural solution or speak to your vet first what they recommend. We sadly lost our cat!",
      "rating": 1.0,
      "verified": true,
      "author": "Martin/Family/Aubree",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Good value. “What do you go to lose” lol",
      "text": "I have inside dogs and it’s important that they remain flea / tick -less. This formula works for a monthly protection. I use the majority of Hartz products. It works for my dog. I’m mindful how often my dog gets wet.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny A.D. Zetino",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "HAZARDOUS MATERIALS",
      "text": "Horrible product! My cat was deathly ill from it. Cost a small fortune at the vet because it literally poisened her.",
      "rating": 1.0,
      "verified": true,
      "author": "Danielle M Stoner",
      "helpful_votes": 3,
      "publication_date": 20190324
    },
    {
      "title": "Not a bad product, but dosage seems excessive.",
      "text": "I used these drops for a litter of kittens to get rid of a small flea issue. It smells terrible and toxic and so i only used 3 drops on each kitten between shoulder blades. It worked really well, just using that tiny bit! No more fleas! However, i will note that I feel like using a whole vial may be detrimental to a cat's health, even a full-grown one. Just be careful with it.",
      "rating": 4.0,
      "verified": true,
      "author": "ashley",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "all is ok",
      "text": "We have been using this Hartz Ultra Guard Pro on our cat since he met the age and weight requirements and have not had any problems and he is flea free. Received this item in sooner than anticipated and the product was in excellent condition... Box wasn't crushed or mutilated.",
      "rating": 5.0,
      "verified": true,
      "author": "An occasional shopper",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "It doesn't work. Spend more,  save your pets",
      "text": "This was an exciting option. Inexpensive flea control for animals that don't have fleas. Problem is that it doesn't f______ work. Now after 2 months of using the product, all 8 cats and my home have fleas. Cats bleeding from the skin. Insisting on laying in the sink or tub. I understand that you get what you pay for. But i guarantee that these people don't use their own products",
      "rating": 1.0,
      "verified": true,
      "author": "Ira Hilt",
      "helpful_votes": 2,
      "publication_date": 20191008
    },
    {
      "title": "Do not buy!",
      "text": "This was a waste of money, just left a greasy spot on my dog's fur, I gave them a bath before using it and made sure they had not fleas, I have to small lap dogs so thought this would be good for them. Two days later the greasy stuff is still on their necks and they already have fleas. A total waste of money, do no buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Chatita",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "This stuff doesn’t work at all.",
      "text": "This does absolutely nothing to repel fleas or kill them. I am never buying this again. We have had more luck with dish soap and a bath tub than we have had with this stuff. I had been using this for months on my indoor cats, but then I moved in with a friend with an indoor/outdoor cat. I put it on all three cats for the past two months, and the cat that goes outdoors is still bringing in fleas and the flea problem is getting worse on my indoor only cats. We finally had to give up and bathe them this week to get rid of the fleas. This is not okay.",
      "rating": 1.0,
      "verified": true,
      "author": "Pamela",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Best value I have found and works great too",
      "text": "I have been using this Hartz UltraGuard Flea & Tick on my dogs for years and have had no flea/tick issues. It is a bit yucky on their necks for a couple days -- but beats a flea collar smell and works better. My dogs (all 4) have never had any bad reactions. It has remained a great value and I will continue to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Desert Daisy",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "My dogs are unhappy and so am I.",
      "text": "I put it on last week and my dogs still have flees. My big dog came in wining and itchy I checked her and she was crawling with flees. My dog with sensitive skin was burned by it but thank god it’s just a surface burn. I went to petco and got for meds and can not use this product that doesn’t work again.",
      "rating": 1.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Worked just as well as the name brands at a fracture of the price!",
      "text": "We used to use the name brand anti-flea/tick medications for our pooch, and they have always worked well. On a whim, we decided to try this cheaper option, and we were very pleasantly surprised! The packaging is not as fancy as some of the others that we've tried, but the application is basically the same. Apply at the neck of the dog and run a line down to the tail. It's been several weeks and we are still flea and tick free! Very pleased with this and would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Simon",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Highly Recommend!!!",
      "text": "I’ve been fighting fleas for 2 years. I started using this on the cats, the dog version on the dog and Harris Diatomaceous Earth Food Grade on the carpets floors and under couch cushions and I haven’t seen a flea, egg or dropping in 2 months! I was previously using the Diatomaceous with a different flea drop and it wasn’t working as well. Highly Recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Milady",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Works Well",
      "text": "This treatment worked well on my pup and he didn’t have any type of reaction that was noticeable. Would purchase again if needed...this works just as well as the more expensive brands without the expensive cost. I prefer to use a more natural approach however I am not dissatisfied with giving this a try this go round.",
      "rating": 5.0,
      "verified": true,
      "author": "Tenacity Best",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Don't buy",
      "text": "Product not good. Hasn't helped at all. And gave my dog blisters , wil never buy again",
      "rating": 1.0,
      "verified": true,
      "author": "Brandon N Felicia",
      "helpful_votes": 5,
      "publication_date": 20190409
    },
    {
      "title": "DONT BUY",
      "text": "I bought this for my cat. After putting it on him the next morning i found a huge bald spot on his back. This poison literally burned his fur and skin and left him with a bloody spot for nearly two weeks. After care and cleaning he is fine now. But please don’t buy this stuff.",
      "rating": 1.0,
      "verified": true,
      "author": "Alex W",
      "helpful_votes": 3,
      "publication_date": 20190705
    },
    {
      "title": "DOES NOT WORK!",
      "text": "This product did NOT work! I use all 3 tubs in 1 week and my little Maltese still have some fleas..😡😡 That teach me not to use a difference brand...",
      "rating": 1.0,
      "verified": true,
      "author": "EFN",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Caution!!",
      "text": "Do not buy this!! Within 20 minutes of applying this to my cat, her skin became red and inflamed at the site. She started scratching constantly and panting so I immediately gave her a bath which wasn’t easy. Luckily no vet trip",
      "rating": 1.0,
      "verified": true,
      "author": "Tiffany Curry",
      "helpful_votes": 3,
      "publication_date": 20190420
    },
    {
      "title": "This item is deadly to cats.  Please do not purchase it",
      "text": "I will never purchase this item again. Every cat I used this on has died within a week of using it. Please, please, my advice is to not use this item. The only reason I put a one star on here is because it wouldn't let post my review if I didn't put one.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190729
    },
    {
      "title": "Works great.",
      "text": "Used for 2 months so far and it seems to be working great. My only complaint is that it takes a long time to dry. The stuff I have used in the past that was similar dried much faster. But other it's good. I will buy it again. Just have to plan ahead a little. Adding on to this with my 3rd order. My dog has been flea and tic free through an entire summer, using just this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Toby Farrimond",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Was not ok for my cat",
      "text": "I purchased this product because of the price and i totally regret . I applied to my cat (female 6 years old) and in the next hour after i applied she just didn't stop scratching herself and running all around the house , obviously she was not ok with this product on her neck . i used other similar products on her before and never happened anything like this , also her skin on the neck turned red . i decided to wash her and take this thing out of her skin . i do not recommend at all this product due reaction on my cat's skin .",
      "rating": 1.0,
      "verified": true,
      "author": "JG",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Works great",
      "text": "Petted my kitty....saw he had fleas. Put topical between his shoulder blades and let him outside so no fleas would jump of him into my bed...kitty came back 2 hours later and tada! No more fleas on kitty. He's aloud on my bed again. 😁 Thanks Hartz for an affordable product that works!",
      "rating": 5.0,
      "verified": true,
      "author": "Shelly",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Good Cat Flea & Tick Topical Treatment",
      "text": "We have used this for several seasons on our 2 outdoor \"barn cats\" here on the farm -- the cats like to lay on our laps when we sit outside and rub on our legs -- no fleas or ticks on us as yet from the kitties, and the kitties don't scratch themselves, so we assume it works very well",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. R. G. Bauzman",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Worker for my Outdoor Kitty",
      "text": "I have a cat that comes and goes as she pleases. I needed to make sure she is protected from fleas and ticks. We never had a flea or tick one in the house and she did not have any kind of allergic reaction to this medicine. Worked great for our family and the price is hands down unbeatable.",
      "rating": 5.0,
      "verified": true,
      "author": "Alyson",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Dangerous stuff",
      "text": "I put this on my 11 yr old cat yesterday. She became extremely agitated. Vomiting and small seizure. Called Hatrz. They said it was her getting upset from fumes not the product. Regardless of what caused the seizure it's not good. Please don't buy cheap. You get what you pay for and could possibly injure your cat.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy Luding",
      "helpful_votes": 2,
      "publication_date": 20191025
    },
    {
      "title": "Very good.",
      "text": "I have two big dogs Komondor. This works great on them and save me big time. It very nice to see your dogs clean and happy, no scratching.",
      "rating": 5.0,
      "verified": true,
      "author": "Tinh Khau",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "This item fails for flea control",
      "text": "I was amazed how fast I ordered came in Thursday night and was at the door Friday afternoon . I put the drops on my cats that afternoon I applied like it says. Now today is Monday and my cats are still ffleas real bad these droplets don't work. I bought 3 boxes of 6 vials all 18 did not work. And yes I do have 18 cats",
      "rating": 1.0,
      "verified": true,
      "author": "sandra padgett",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Works well",
      "text": "I have 6 indoor/outdoor cats and have used a variety of flea and tick meds. This is reasonably priced and works well. I have been using this product for about 4 months. I will continue using it.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Lawrence",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Don't use it",
      "text": "Not worth the money. Didn't work and made a couple of our cats ill. Spent more money on vet costs so next time I'm buying the better stuff to save my cats the hell.",
      "rating": 1.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Horrible!",
      "text": "smells like paint thinner, made my cats sick, do not purchase!",
      "rating": 1.0,
      "verified": true,
      "author": "J M",
      "helpful_votes": 4,
      "publication_date": 20190406
    },
    {
      "title": "CAT OWNERS BEWARE!",
      "text": "Omg the smell! And it make all my cats gag and foam from the mouth you can tell theirs eyes burnt whole house smelt like acetone. Just no. Idk if it works or not but I'm watching over my cats closely tonight. Never again. Shouldn't be scared for your pets life after using a flea remover.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie Moore",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Very potent strong kills ticks quick",
      "text": "Put it this way .my dog had an engorged tick on her belly I put this on her less then five mins later the tick backed out of her and died. I'm curious to know how safe it is for her but it definitely is a fast killer on the critters. I got scared and gave her a bath.",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda Somers",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "-1",
      "text": "Buyer beware. This product is horrible I used it on both my dogs and it left their skin red and raw and bleeding. It was horrible. It didn't even kill the fleas. I'm just going to go back to using my Dawn Liquid Blue soap because that works.",
      "rating": 1.0,
      "verified": true,
      "author": "Southernmermaid85",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Good bang for your buck!",
      "text": "Not bad for the price, we have two dogs. One which has terrible skin allergies and the other is our cute little yorkie. Work's on both of them, we havent had any flea issues. There was no skin irritation on our ol girl that seems to be alletgic to everything. We give them flea baths 1 a month and a few days later we add the drops on. My only complaint is that it has a strong smell of pepper and I dont believe it's waterproof.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200421
    }
  ],
  "product_meta": {
    "title": "Hartz UltraGuard Flea & Tick Topicals for Pets",
    "description": "Size:Cats and Kittens 5 lbs and over| Style:Plus| Color:Cat\n\nHartz UltraGuard Plus Topical Flea and Tick Prevention for Cats and Kittens 12 weeks and older, is a monthly treatment that rapidly eliminates fleas within 15 minutes. Kills fleas, Brown Dog and Deer Ticks, flea eggs and repels mosquitoes for 30 days. Features the patented Pro-cision Flo applicator system that penetrates pet hair allowing for application of treatment at skin level. Quick-drying formula stays on and does not rub off. Package contains 3 monthly applications.",
    "rating": 4,
    "feature_bullets": [
      "Only for cats and kittens 12 weeks and older weighing 5lbs and over",
      "3 Monthly Treatments",
      "Rapidly eliminates fleas",
      "Lasts for 30 days",
      "Kills fleas ticks and flea eggs",
      "Kills and repels mosquitoes",
      "Prevents re-infestation for up to 30 days",
      "3-Monthly treatments"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3.75 x 0.88 x 6.69 inches; 0.8 Ounces",
      "Item model number": "3270010844",
      "Date First Available": "October 9, 2008",
      "Manufacturer": "Hartz",
      "ASIN": "B001HWEC2C",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Flea Drops",
      "Pet Supplies",
      "Flea & Tick Control",
      "Cats"
    ],
    "price": ""
  }
}