{
  "website_summaries": [
    {
      "verdict": "Best for camping and extended trips. Keeps rations fresh and ready when in need.",
      "pros": [
        "Water tight and keeps emergency food dry",
        "High marks for its strength",
        "Affordable price point",
        "Engineered to maintain the short-term preservation of food and water"
      ],
      "cons": [
        "Not designed for long-term food or water storage"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I really like it, however I noticed that it seems to ...",
      "text": "I just received this cooler Monday. I really like it, however I noticed that it seems to have already have stress points on the hinges. I am not sure how many people have this issue but I will try to keep everyone updated on changes in the future.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 160,
      "publication_date": 20170323
    },
    {
      "title": "Best lunch box ever!",
      "text": "Love love love! Well built, sturdy strap, union boilermaker working turnarounds, it carries breakfast lunch and dinner, with 1/2 gallon of tea, and all my trinkets in the tray, I wish I had this 20 years ago when I started!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 25,
      "publication_date": 20180818
    },
    {
      "title": "Not well insulated; didnt keep beverages cold",
      "text": "I wanted to love the cooler. Am disappointed in the product. I was only trying to keep cold beverages cold on a 4-day trip. I used multiple large and small frozen blue ice packs and placed it out of the sun. Nighttime temps in high 30s and daytime temps mod50s to upper 60s. I had to check it about every 15 hours. The cooler wouldn't even keep the blue ice from thawing. Ice would have been worse. I DEFINITELY WOULD NOT put food into with any hope of it staying cold.",
      "rating": 1.0,
      "verified": true,
      "author": "JEVH",
      "helpful_votes": 8,
      "publication_date": 20180124
    },
    {
      "title": "So far so good",
      "text": "2 months in and no complaints. Seems well made. I keep it in the rear bin of my truck with bottled water and ice. In August we were still averaging 100 degree weather. The ice was melted by about 3 pm but the waters were still plenty cold. Compared to my old ice chest (not sure of brand) the ice would be melted by 11 am in the summer. I have no idea how it would stack up to a yeti but I am completely satisfied with this one.",
      "rating": 5.0,
      "verified": true,
      "author": "rogshizzle",
      "helpful_votes": 9,
      "publication_date": 20171015
    },
    {
      "title": "Not worth the Money, Junk",
      "text": "Got a Colman Cooler at a yard sale for a Buck Holds Ice twice as long as this $72.00 one.....I know I checked. This is not even close to being worth $72.00...Looks good but doesn't keep ice more then a couple hrs. Junk Save your money don't buy this cooler.",
      "rating": 1.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 4,
      "publication_date": 20190818
    },
    {
      "title": "Keep your cool.....",
      "text": "Really happy with this cooler. I'm using it for a lunch box, although I'm sure it's going to see some double duty down at the lake. Keeps my stuff cool all day. Nice and light, solid construction. The tray inside could fit a little better. It falls down once in awhile. Not a big deal but it wouldn't take much to make it better. I would also prefer a little longer carry strap with a padded shoulder piece. I will be making one in the near future.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenny B.",
      "helpful_votes": 4,
      "publication_date": 20180603
    },
    {
      "title": "Great cooler",
      "text": "I work on the railroad and coolers get beat to hell on and off trains. This cooler has been great, it's the perfect size (19 qt) and shape to stuff places and fit enough food in case Im away from home for 2 or 3 days. The only down side is the hinges but those cane be replaced and I added a catch wire so the lid doest fall back too far when opening. It holds cold fairly well. Prechilled I usually get a solid 24 hours of frozen ice packs. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Beware, no warranty through seller",
      "text": "Started off as a great cooler however I've noticed cracks in the top by the handle. Ive had this cooler for 2 years and it states on the sellers page that there is a 5 year warranty. I contacted the seller and they advised me to contact Engel. After reading Engel warranty, they state that products purchased from Amazon will not be warranted. The seller close not to reply to my emails after I told them what I read. So don't purchase from this seller if you plan on turning something in for a warranty as they will not.",
      "rating": 2.0,
      "verified": true,
      "author": "A-A Ron ",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "What a GREAT deal!!",
      "text": "Got this on sale for $40!! And it’s pink! I LOVE it. Super lightweight when empty. Which is what i needed because I’m bringing this on my iSUP. The less weight the easier it is for me to paddle. I’ll have to update to review how well the ice manages after a full day out on the water in the brutal Florida sun. It worked just fine when we took it to the beach. I do store it under our tent tho when we are at the beach. Overall VERY happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Cherries27",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Excellent purchase. Very spacious and durable.",
      "text": "One of the best lunch boxes ever purchased. You get what you pay for. This box has plenty of room for all your lunch, and snack need. Plus extra storage space as shown in photo. Highly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 6,
      "publication_date": 20180709
    },
    {
      "title": "Where's the customer service?",
      "text": "I purchased my Engel 19 this past summer and I use it everyday for work. I work construction and it keeps my food cold and water packs frozen all day. I have been very pleased with my cooler and would highly recommend it. My only problem was the buckle for the strap broke and when I contacted Engel (e-mail) I never heard back from them. I would have been happy to buy a new one buckle, but I didn't hear anything from them. So now, I've got a piece of white electrical tape holding my shoulder strap together.",
      "rating": 4.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 4,
      "publication_date": 20181227
    },
    {
      "title": "Much better than our last cooler, but seems like it could be better.",
      "text": "There's no question that this 19qt. Engel keeps things cooler for longer than our Igloo Playmate. That's no surprise, given that the Playmate has no insulation (it's not even double walled in the lid), and no proper seal on the lid either. So the rubber seal on the lid on the Engel is a welcome plus. On the other hand, it's not completely clear to me that the Engel has any insulation between its walls either (the double walls in the sides and lid can flex inward quite a bit), and it remains to be seen if the Engel will last as long (20 years, I think) as our Playmate.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Great cooler",
      "text": "I bought this cooler for my wife's four-wheeler. I had to do some engineering and bolt a Coke tray to the wheeler for this cooler to sit in. It's a great personal cooler and we've used it on small trips and concerts but it's not as tough as you would want on a four wheeler. The side strap loop's are a little weak for strapping down compared to a yeti. I found the cooler fits perfectly in a Coke bottle crate that can be found behind any convenience store then just strap cooler to crate.",
      "rating": 5.0,
      "verified": true,
      "author": "James Ross",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Its a good cooler really worth it",
      "text": "My boyfriend is a rig welder . he often has to eat out in the middle of no where . this cooler keeps the ice well and food fresh. I'm a safety attendant and considering buying one for my self it has a good strap and can hold my weight. If I use it as a seat.",
      "rating": 5.0,
      "verified": true,
      "author": "Jasmine ",
      "helpful_votes": 6,
      "publication_date": 20180414
    },
    {
      "title": "Ice all melted after two days in an air conditioned travel trailer! Don’t waste your money!",
      "text": "I’m calling B.S on these keeping ice longer than yeti coolers. I filled this half way with ice and nothing else, to test it out. I kept it in my air conditioned travel trailer (68-81 max temp), and at the end of day two I had a cooler full of cold water! I could’ve guy a $20 cooler from dollar general that was bigger and I almost guarantee it would do a better job! I’m disappointed because I bought this to support local businesses (I live in Florida), and this is where Engel coolers office is. I doubt that this thing even compares to the cheapest cooler out there!",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew Gardner",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Buy at your own risk",
      "text": "I ordered Friday and received it Tuesday, so shipping was good even though it was through “prime” . I opened the cooler, glad that it had finally arrived and there is already damage (scratches on the top handle) !! I attatched a photo I took. It’s brand new , if there’s any scratches or wear and tear it should be done by me .in due time. Definitely not already to begin with.. There was also damage on the back hinge where it closes. Such a shame because it’s a great size for a lunchbox. It is way better than the 13quart and it does not look huge where you would look silly using it",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Husband's Lunchbox",
      "text": "My husband requested this exact cooler to use as his lunchbox for work. He likes the top tray to keep his items in and up away from his food during the work day. He used an Igloo cooler for over 20 years and said this cooler blows the Igloo out of the water. He said that it is airtight so it keeps the food much colder. Extremely please with this little cooler!",
      "rating": 5.0,
      "verified": true,
      "author": "Teach2Learn",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "This 19 qt. cooler/dry box does not keep ice after the first day.",
      "text": "The cooler is not insulated well. The ice melts off after the first day. To be fair about this review. I live and work in the south as a construction worker and the daily temps get up in the high 90's got it in July and it's August now. I am disappointed in their advertising and claims. I have the 19 qt. cooler/dry box tan in color.",
      "rating": 2.0,
      "verified": true,
      "author": "James P.",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Seems to keep things cold all day.",
      "text": "I purchased this for my husband who has to travel to job sites for his work. He's been struggling to find a good cooler to keep his food cold as he's often outdoors in the hot weather. So far so good. Though he didn't start using this in the high part of the summer, at this point, when he puts ice-packs in this cooler they are still partially frozen by the end of the day which was not the case with previous coolers. It seems to be good value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "L. A. Willis",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Perfect size and ice retention for weekend trips!",
      "text": "Great cooler! In my opinion it is the perfect blend of cooler features. It is solid and holds ice for multiple days (especially if you freeze water bottles and put them in), yet isn't bulky and cumbersome. Fits in your car and doesn't weigh so much that you need two people to move it. You can't jump on it, but can easily take a seat on it.",
      "rating": 5.0,
      "verified": true,
      "author": "SurfCRF450",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Very happy with this cooler",
      "text": "I was overwhelmed when I started looking for affordable \"Yeti alternatives\". There are so many out there and some are not that much more affordable than Yeti. I'm very glad to settle on this one. We need to take a 13-hour road trip. Because of the pandemic we decided to pack a picnic instead of stopping at restaurants for lunch. This cooler did its job well and we had a good picnic on the 13-hour road trips both way in the heat of July 4th weekend in the deep South!",
      "rating": 5.0,
      "verified": true,
      "author": "Wai Yin Ho",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Waste of money",
      "text": "Honestly it's not a very good cooler. It won't keep things cold. On a 10 hour work day by last break everything is warm and I don't trust my yogurt anymore. Plus the individual clasps are annoying to deal with and if you don't have enough stuff (weight) in the bottom when you open the lid it will fall backwards spilling everything. I gotta a 20 year old Igloo that puts it to shame. Definitely not worth 67 dollars!!",
      "rating": 1.0,
      "verified": true,
      "author": "Noah Seal",
      "helpful_votes": 3,
      "publication_date": 20190814
    },
    {
      "title": "Great little cooler",
      "text": "Awesome little cooler. Use it on job sites for my food and drinks. Has a great little dry storage spot for your phone or whatever else you don't want wet. Works great for all I use it for. Seals good and keeps stuff cold for quite a while. Very durable and holds up to the harsh conditions on a job site, planes, mud and in the back of the truck. Would definitely recommend this product to anybody that needs a small sized cooler or a decently sized lunch box for the job site or the boat. Five stars here",
      "rating": 5.0,
      "verified": true,
      "author": "Trim",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "It's ok at best.",
      "text": "Description says that it holds ice for days....unfortunately this hasn't been our experience at all. Maybe half the day before it's all melted. It seems to be constructed nicely, so it's a shame that it doesn't hold ice and stay cooler longer since thats what we got it for.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Wilcoxen",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "It's a good cooler I use it for my lunch bad hinge.",
      "text": "It's a good cooler I use it for my lunch. It keeps things cold all day and night. I give it two star's because the hinge crack the second day I use it. So I glued it I will order a new hinge. The hinge should have been metal then they won't break. They told me that they would replace the crack hinge for free once. Then I would have to pay to replace. The hinge are made poorly they know that they can't handle the lids weight. So I replace my hinges with one from the hardware store with metal ones working good.",
      "rating": 2.0,
      "verified": true,
      "author": "deano",
      "helpful_votes": 2,
      "publication_date": 20171226
    },
    {
      "title": "Great product and seller.",
      "text": "Great lunch box. Plenty big enough for a plant worker. It holds lunch, plenty of snacks, a few extra water bottles, two huge ice packs and still has extra room. The sliding tray on top adds extra storage too. Shipping took a few extra days due to Fedex not being able to find me, idk why, but the sellers customer service worked with me swiftly and endlessly to make sure my product arrived. Would definitely recommend this cooler or this seller to anybody.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald Shingler Jr.",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Coworkers are jealous!",
      "text": "My boyfriend completely loves this cooler. It’s the perfect size, he is able to fit plenty of drinks and food in it, as well as silverware, napkins and whatever else he needs. He’s gotten so many compliments on it and asked where it’s from. It’s so nice to be able to have lunch box where you don’t have to worry about the weather conditions ruining your lunch box (he’s a union operator), and the durability is so awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "alextiff_",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Keep looking, next!",
      "text": "I purchased this cooler to use as a sous vide tank. However the outer shell of the cooler cracked under the weight of 10 quarts of water (used less than 20 times. Waiting to receive correspondence for their warranty department - which is definitely hasn't been timely Likes: cheap Dislikes: the price definitely reflects the craftsmanship, overall quality and nonexistent customer service. Trying to do an warranty claim through the Engel site. But they've not responded in their outlined timeframe listed on their warranty page. Save your money and look at cheap igloo/coleman type cooler - same level of quality and cheaper 11/14 and I still haven’t received a response from the Engel Warranty Department!!",
      "rating": 1.0,
      "verified": true,
      "author": "Davie Boy",
      "helpful_votes": 2,
      "publication_date": 20181107
    },
    {
      "title": "Gets lots of compliments",
      "text": "Love this cooler. I get a lot of guys asking where I bought it because they want one for themselves. The only drawback I have is with the carry strap. Its a cheap strap and I don't have much confidence it won't break. I either avoid using the strap entirely or I'm very careful when handling with the cooler full of goods. Regardless for the price this is 100% worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "TYLER DUBOVSKY",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Excellent desert cooler",
      "text": "This cooler was amazing in the desert for 11 days and kept my refreshments nice and cold. All I did was refresh the gel packs 1-2 times a day and had fresh, cold cocktail makings for the duration of my trip. It was in the full desert sun for most of the day and was a champ. The size and shape are perfect to strap onto the back of anything with a flat surface . I bought an extra tray and having two in there was great for limes and cutlery storage. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa W",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Lunchbox",
      "text": "Really cool lunchbox and also very spacious. I have put various stickers on mine and also changed out the strap and have receiver several compliments on how awesome it looks. I have also had friends purchase this lunch box because they liked how mine looked. It keeps all my stuff nice and dry in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ramon Cabrera ",
      "helpful_votes": 3,
      "publication_date": 20171206
    },
    {
      "title": "Sturdy, roomy & well made",
      "text": "Cooler is very nice & well worth the money. My husband has only been using it a few days as a lunch bucket for work but so far he is happy. Roomy inside big enough to hold a 12 hour shifts worth of drinks & snacks. He works in the mines in sometimes wet conditions & was impressed that no water leaks in. The cooler is heavy enough to feel solid but not as heavy as I expected & thats a good thing. Latches & hinges are replaceable which helps to alliviate any concerns about wear and tear. I'll update later on durability if we have any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "BBJul",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Not for outdoor use",
      "text": "Nice for a dry box do t hold ice very well about 4 hrs if u work out side not a outdoor cooler invest in a retro molded cooler if u r a person who works outside in the heat if not it will hold ice longer indoors if that's where u work it would be great I give it a 5 for the way it built but a 2 for how well it holds ice could be better if it was insulated like they say but that's a lie lots of air were insulation should be",
      "rating": 2.0,
      "verified": true,
      "author": "Roxanne oneil",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Not a cooler...it’s a box",
      "text": "This is a box. This box doesn’t keep ice cold, but it in here and you got water. If you need an air tight box this is good. If you want a cooler, this ain’t it.",
      "rating": 2.0,
      "verified": true,
      "author": "PATRICK",
      "helpful_votes": 2,
      "publication_date": 20191024
    },
    {
      "title": "She loves it",
      "text": "My wife loves this which is all that really matters. The hinges are plastic and look flimsy. Care must be taken to not open too far as the hinges stop it from going all the way to *180 degrees. So far it is fine but this appears to be the weakness. My wife was out all day on *100 weather and the ice packs were still frozen",
      "rating": 4.0,
      "verified": true,
      "author": "Mitchell",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Ups is slow",
      "text": "Durable on my 4 wheeler ice just does last too long in south Mississippi heat index of 105 top side warped defective product",
      "rating": 1.0,
      "verified": true,
      "author": "Derek",
      "helpful_votes": 5,
      "publication_date": 20180709
    },
    {
      "title": "Does not keep ice longer than 3 hours.",
      "text": "Filled the cooler with drinks and a bag of ice, then out on the boat. The ice was completely melted within 3 hours. Second day, less drinks and more ice - could barely close it we packed in so much ice. All melted within 3 hours. Yes, it’s hot out, but this “cooler” offers no insulation against the summer heat. Definitely not worth the price! Tested in northern Virginia.",
      "rating": 2.0,
      "verified": true,
      "author": "Peggy Phillips",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "best cooler for the price",
      "text": "i work construction and all the guys i work with swear by this cooler. we all use them as lunchboxes and even in direct sunlight your lunch is gonna stay cold until lunchtime and even until you clock out. if you put ice in this bad boy it'll go 3 or 4 days if you keep it in the shade, what more could you ask for? it's light, strong enough to sit on (i'm a big dude), it's got a little cubby for your phone, keys, wallet and utensils and it stays cool. no brainer",
      "rating": 5.0,
      "verified": true,
      "author": "guile",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Highly recommend!",
      "text": "I ordered one of these because a friend of mine had one that he liked; for me, this is a perfect cooler. I use it for packing lunches for day trips (birding/photography). The cooler is a nice size, has a small dry box on top. I put one frozen ice packet in and find that it keeps my items cold all day! Love it, highly recommend it! I have bought less expensive coolers, but you get what you pay for.",
      "rating": 5.0,
      "verified": true,
      "author": "Janarie K. Ramelli",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Great but..",
      "text": "No doubt a great cooler. Does what is advertise. I work in heavy commercial construction wanted a cooler that can keep food cold inn the worst of summer heat and humidity, this can love the shoulder strap. However I doubt if this cooler would hold up to the abuse and longevity of my old Coleman. I love the tray inside metal snaps will probably go someday its expensive for a cooler but its nice. Also held up during the cold of winter.",
      "rating": 4.0,
      "verified": true,
      "author": "relaxin",
      "helpful_votes": 2,
      "publication_date": 20170718
    },
    {
      "title": "Keeps Butane Cannisters Cool in SE Texas Summer Sun",
      "text": "I use this to store butane cannisters for my camp stove. Left in the bed of my pickup, exposed all afternoon to direct sunlight on a >100F day, the interior (filled only with 22 full cannisters) never got above 90F, well below the max storage temperature of the cannisters (120F). Meets my needs well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "The included basket is nice for car keys and wallet or anything else you ...",
      "text": "I use this cooker for a lunch box. The only negative is the latches are a little bit of a pain to open up and secure if you are trying to get a drink while driving. Other than that it has worked out well and holds a gallon jug of water and plenty of food. The included basket is nice for car keys and wallet or anything else you do not want to have to dig for.",
      "rating": 4.0,
      "verified": true,
      "author": "Rob Hayton",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "I love this lunch box",
      "text": "I love this lunch box! I work construction so it gets all kinds of weather conditions beats and bangs around in buggies and busses. I sit on it lol 😂 great quality all around! I would recommend this it keeps my lunch cold with ice packs for around 12 hours.",
      "rating": 5.0,
      "verified": true,
      "author": "KK",
      "helpful_votes": 3,
      "publication_date": 20180210
    },
    {
      "title": "Defect",
      "text": "I had this same cooler for years. Its a great little cooler. It came time to replace it. When i received the new cooler i noticed the seal around the lid didnt sit right. The lid is actually bowed up and doesnt properly seal. Seems like a manufacture defect.",
      "rating": 1.0,
      "verified": true,
      "author": "brian",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Great product",
      "text": "Perfect as a dry box. It tipped in the back of my car while full of water and didn’t leak a bit. As a cooler, it’s not on par with Yeti or RTIC, but for $60 vs $250, definitely worth the price difference. Better than my old Igloo for sure. And it’s very sturdily built. I wish the lid hinge was metal and full length, and a locking system would be awesome, but I’m very happy with what I have.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Wallace",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Great box for your electronics",
      "text": "I bought this for a kayak trip down the Suwannee River. I basically used it for a dry box for my camera equipment and other electronics. It worked like a charm. I have yet to use it as a cooler, but the seal is great and I am sure it will perform well. I am actually gonna pick up the 30qt next.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaycue",
      "helpful_votes": 4,
      "publication_date": 20170327
    },
    {
      "title": "Recommend for industrial workers and others.",
      "text": "I almost went with the 13qt just because I wasn’t sure if I’d want to carry a lunch pale this big everyday. This cooler is light enough I’d recommend it because I can keep emergency food stash in it for those days I get stuck unexpectedly at work along with my daily lunch and it even has a little top tray that’s just right for keeping a couple pens, phone charger, note pad, and a few other small Knick-knacks. Great little coolers.",
      "rating": 5.0,
      "verified": true,
      "author": "1weldit",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "well made",
      "text": "this is a very well made dry box. i bought it to use as a lunch box at work, i had the 12 quart model before this one and that was about the perfect size. This one is a great size for a lunch out in the woods or on the lake with the family. The reason i bought this one this go around was it was actually cheaper than the 12 quart, my 12 quart was stolen is the only reason i had to replace it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "I recommend it, I have not tried it for going as an ice chest for dry storage it is excellent",
      "text": "It’s excellent I just I had ordered a larger one in one of the colors, one is a medicine box for me the other night teen court is a medicine box for my dogs one of the 17 course is for supplements and I haven’t figured out the other 17 court yet but since they give me my medication three months at a time and a lot of it comes in boxes, this is perfect it frees up a lot of space for me to put other things away",
      "rating": 5.0,
      "verified": true,
      "author": "Sara McCarthy",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Depends on what you need it for.",
      "text": "If you just plan to use this on a day trip, or will have access to someplace you can buy ice regularly while out this is great. It just doesn't hold ice for that long. After about 24 hours outside 3/4 of the ice was melted. Was hoping it would be better than that.",
      "rating": 4.0,
      "verified": true,
      "author": "Samantha Cline",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Now I'm wondering if its waterproof...",
      "text": "Sturdy, dimensions are good. Keeps something cold less than a day. You'll need lots of ice. Everything melts in mine. By 2pm from 6am the box is holding warmth not cold and i have an ice pack inside. Which is melted by 2pm.",
      "rating": 3.0,
      "verified": true,
      "author": "BrownBee88",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Tough, well made product",
      "text": "The 19 Qt Engle is perfect size for an all day road trip, picnic for two and it keeps the ice frozen and the items well chilled all day. It does not leak when tipped over with the latches closed and is not too bulky. The recessed handle is nice and the nylon shoulder strap makes it easy to sling over the back for carrying with the hand free.",
      "rating": 5.0,
      "verified": true,
      "author": "paulknolan",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Great for plant workers!",
      "text": "I bought this for my hubby to take his lunches in for work. Tons of space, keeps stuff cool, and extremely sturdy. The 19qt is perfect for lunches and all the extras plant guys need.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 3,
      "publication_date": 20180223
    },
    {
      "title": "Not all cracked up to be😞",
      "text": "I loved the pink color of this cooler and the size was perfect for my needs. Unfortunately, I had to replace the strap because my strap kept coming undone causing me to drop my cooler that resulted in the lid of my cooler cracking. The cooler is not able to keep ice or cold items as cold as it did before the lid was cracked. I would like to see this cooler more durable and with a strap that doesn’t disconnect because it does not perform as it should now.",
      "rating": 2.0,
      "verified": true,
      "author": "Tamatha Jackson",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Happy!",
      "text": "So far so good. Hubby loves it and has it covered in stickers. Keeps ice pack cool all day while box sits in a hot truck in summer temps. Hope it withstands the test of a little bit of time at least.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandy Richardson",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Very Nice Cooler",
      "text": "I really like this cooler, it's sturdy and durable. Bought it for the job site, it's not too big or small and has a handle for you to carry long distances. Keeps my food cool, would buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "My husband loved it",
      "text": "Bought as a Christmas gift for my husband and he loved it still carries it to this day haven’t had to buy anyone since he’s had it a good size and lots of space it holds up pretty good as well there’s no tares cracks rips are nothing in it I think he’s had it for a year now",
      "rating": 5.0,
      "verified": true,
      "author": "Bianca Fore",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Two thumbs up",
      "text": "The product build is solid and it keeps ice for the day, longer than cheaper coolers but still not long as I’d like. Going to get the next biggest size for more ice. If you’re looking for something for a day trip or for quick trips this will do the job.",
      "rating": 4.0,
      "verified": true,
      "author": "KAOS",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "😣",
      "text": "Extremely Disappointing, don't even try to keep anything cold.i would have been better off using the box it came in for an ice chest. I Really think they forgot to put any insulation in it.",
      "rating": 1.0,
      "verified": true,
      "author": "Holly Klemp",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "The cost per value is perfect, Thanks Engle",
      "text": "It's lite weight and easy to carry especially with the shoulder strap attached. I use it as a lunch box when i'm traveling. Holds plenty of food and beverages and keeps everything nice and cold. My only dislike is i wished i had gotten a darker color. Many of my co-workers also have the very same dry cooler and to be honest if does the same job as a Yetti but less expensive",
      "rating": 5.0,
      "verified": true,
      "author": "Jerald McNiel",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "This is the worst cooler I have ever purchased!",
      "text": "I have literally never been so disappointed in a product. It does not keep Ice well at all and the latch is already broken. May be ok for a dry box. As long as you don't want to keep things cool and you don't mind replacing the latches.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Great Lunchbox Cooler",
      "text": "I bought this for my son. He keeps his lunchbox in his truck. His food stays cold even in a hot truck. It's worth the money. Why spend $200 on a YETI when you only need a lunchbox?",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "A nice little cooler",
      "text": "It may not hold ice for 2 weeks or whatever, but it’s a great little cooler for a day trip or an overnighter. It’s my go to cooler for kayaking.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt E.",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Built cheap now!!",
      "text": "Have bought product before seems as they are making them cheaper. Lots of air gaps in molding. Had one before become popular. Good five years as construction worker. Now they cheaping out.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Great",
      "text": "Very well made. I use it for a lunch/snack box works very well the tray on top could stand to be bigger or maybe get a second but it is awesome",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Great product for the money",
      "text": "Everything stays cold hold ice for hours and hours all day long or you can use it as a drybox,Met all expectations thank you very much",
      "rating": 5.0,
      "verified": true,
      "author": "Leonard Morales",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Great box",
      "text": "Great lunchbox for construction. Would be nice if it had a lock but not a deal breaker. This is my second Engel, gave other one to a friend. This item is very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "cory edge",
      "helpful_votes": 2,
      "publication_date": 20180411
    },
    {
      "title": "... since the cooler is made in Thailand or somewhere like that. Overall it's a pretty good lunch box ...",
      "text": "The name ENGEL USA is deceiving since the cooler is made in Thailand or somewhere like that. Overall it's a pretty good lunch box but I wish that it had metal hinges in the back like the metal locking clips in the front but it doesn't. The front locking clips are made of metal but the hinges in back are made of plastic which doesn't make any sense. A little pricey but other than that I would buy it again",
      "rating": 4.0,
      "verified": true,
      "author": "Chad Taylor",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "I bought the 19 quart and I love it. I put a 12 pack of longneck ...",
      "text": "I bought the 19 quart and I love it. I put a 12 pack of longneck bottles and 2 16oz. DrPeppers with a small bag of ice and still had room. This Ice Chest is amazing. Great quality and easy to carry with just the handle on top. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Loretta Vogel",
      "helpful_votes": 0,
      "publication_date": 20170409
    },
    {
      "title": "Quality product",
      "text": "I use this for overnight trips at work. It keeps food cold for two days. I work for the railroad and my gear broken pretty quick. I've been beating it up for several months. It still looks brand new.",
      "rating": 5.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Love this box",
      "text": "Bought for my husband he’s an underground miner and has went though several lunch boxes this one has lasted the longest so far",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy santhuff",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Great Cooler",
      "text": "I work Constuction and it takes a beating. Everything stays cold through out the day. Nice strong cooler.",
      "rating": 5.0,
      "verified": true,
      "author": "Docroge",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Cracked",
      "text": "Top cracked within 6 months. No options to buy a new top to replace this one. Disappointed",
      "rating": 2.0,
      "verified": true,
      "author": "Lindsay Jacoby",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "It’s ok",
      "text": "Very average cooler. Keeps ice about 15 hours tops. Everything about it is just a little flimsy. I don’t think I would buy again, but it works for what I need. If I were to do it again I’d pay more for little tougher of a cooler.",
      "rating": 3.0,
      "verified": true,
      "author": "Steven McCracken",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Worth every penny!",
      "text": "my husband needed a cooler for work and after every other cooler failed to keep things cold long I decided to spend $70 and get this one. My husband has had zero complaints and one of his workers even ordered one after seeing how well it worked.",
      "rating": 5.0,
      "verified": true,
      "author": "BBAILEY",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Good cooler for the price",
      "text": "Does what it’s supposed to do, fits good in a pelican mustang yak . Tray comes in handy too",
      "rating": 5.0,
      "verified": true,
      "author": "tiny",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Very dissatisfied!",
      "text": "Not worth the money at all! Won't keep anything I put in it cold! Literally 2 hours on ice packs and warm! I will never this product again!",
      "rating": 1.0,
      "verified": true,
      "author": "clinton collins",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Weak. Plastic easily broken",
      "text": "Received the cooler on Monday after work. Got it all set up the next morning and ready to go was great the first day. Second day as I’m leaving the job, the strap that was given with the box came undone as I have it over my shoulder the box dropped to the ground and now a decent size crack in the plastic. So that’s cool. Not to excited about this box anymore. Pretty disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Good purchase. Still sturdy six months later.",
      "text": "I bought this in May. Now it is November. It hasn't broken. I didn't modify anything. It's heavy. I use it six days a week, sometimes five. The storage tray is nice to have but I don't use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Camper Hiker",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Good dry box--Poor cooler",
      "text": "Advertised to keep ice for 2 days. I've had days that ice barely lasted 2 hours.",
      "rating": 2.0,
      "verified": true,
      "author": "Skooter 37",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Nice",
      "text": "Great cooler. Pack lunch and other food items. Ice packs last 12 hours. Food and drinks stay cold. Cooler is either in my truck in the parking lot or in a forty foot container. So hot day and hot areas aren’t a issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew T.",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "It is very nice",
      "text": "It arrived on time free of defects it was packed pretty cheap but i was lucky it was not damaged first impression is i like it thank you.",
      "rating": 4.0,
      "verified": true,
      "author": "I like it",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Cute but Practical",
      "text": "Feels sturdy and quite charming looking. However, the Engel logo is white whereas the picture shows red. It still looks sharp in white, but it as not as expected. The cooler even came with a free Engel Coolers sticker inside. I can fit a 12 pack with room to spare for snacks and tanning lotion in the 19 qt cooler. Very nice!",
      "rating": 5.0,
      "verified": true,
      "author": "Emme Rutledge",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "This was a gift and they LOVE it!",
      "text": "We bought this as a gift for our kayaking, whitewater rafting, mountain biking family in Colorado and they love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Karlene Gentile",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Awesome cooler!",
      "text": "Bought this as a gift for my husband and he loves it! It’s super light weight, but sturdy. It’s very roomy too. You can even purchase metal latches to replace the plastic ones in the back of you want. My favorite part is that it floats!! Keeps our stuff super cold too. Definitely worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Priscilla",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "It’s ok a but disappointed.",
      "text": "It keeps drinks and food cold all day long at high temperature work places. But after 2 months using the handle to carry it. The lid broke around the handle so I had to use the strap to carry it around. It still does the job but can’t use the handle. I carry it from the house to my truck and didn’t misuse it.",
      "rating": 2.0,
      "verified": true,
      "author": "Christian W.",
      "helpful_votes": 2,
      "publication_date": 20180710
    },
    {
      "title": "Very useful ice chest/lunch box",
      "text": "I use it for my work in the refinery very useful in extremely conditions I put it in the back of the work truck 10 hours daily , sun, rain,dust,wind ,etc and my lunch and my personal items inside are intact",
      "rating": 5.0,
      "verified": true,
      "author": "Rene",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Durable , could stay cooler.",
      "text": "Works fine for sealing in liquid and keeping dirt out. The retention of the cold is a bit lacking however a 12 hour work day your stuff is beginning to warm up if it's very hot out. Other than that it's a fine cooler the locking and durability is top notch",
      "rating": 4.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "No problems only ordered off Amazon to get in two days",
      "text": "Like everything about this cooler except the length of the strap and the tray is a little small but at least it has one",
      "rating": 4.0,
      "verified": true,
      "author": "R0316",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Best lunch cooler I’ve had",
      "text": "Bought it for work. I’m a cement mason, so I work around a lot of concrete dust. Seal keeps all the dust out. Cooler is very durable. Temperature inside stays pretty good. Drinks stay cold with an ice pack from when I pack it to lunch time. Even in 100 degree weather, sitting straight in the sun. Very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Julian",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Good buy",
      "text": "Great cooler been using it for over a year keeps my lunch cool hold ice well I was the first one at work with this color now everybody popping up with the same one smh",
      "rating": 5.0,
      "verified": true,
      "author": "darian leblanc",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Great Value",
      "text": "Great cooler. In road construction and it keeps everything ice cold. My cooler packs are still solid 12-16 hours after packing. A Yeti that holds 19q would be way bigger and still not work as well. Awesome value",
      "rating": 5.0,
      "verified": true,
      "author": "MJD",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Good cooler color is off tho",
      "text": "Its a very good lunch box... although the “Coral” is more like a salmon or hot pink color",
      "rating": 5.0,
      "verified": true,
      "author": "Bea",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Cooler or lunch box",
      "text": "Great cooler. I bought as a lunch box. Perfect for both!",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Pittman-Zier",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Awesome as a lunchbox",
      "text": "Perfect size to use as a lunchkit for my nephews working turn arounds in the plants. Holds everything that he needs and is super sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "bubblekisses",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Great",
      "text": "Perfect size and good quality. Fits perfectly on our kayaks. Great little chest",
      "rating": 5.0,
      "verified": true,
      "author": "H. Maddox",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "We also like the outside finish on this model because it doesn't ...",
      "text": "My husband uses this cooler for work and absolutely loves it. It has a handy small container that sits in the top so he can keep smaller items in it, and it keeps his drinks and food cold all day while working outside. We also like the outside finish on this model because it doesn't show the little nicks and dings that come with working construction.",
      "rating": 5.0,
      "verified": true,
      "author": "nicolew926",
      "helpful_votes": 0,
      "publication_date": 20160802
    },
    {
      "title": "Not bad.",
      "text": "Not a bad cooler. I use it for a lunchbox and it works pretty good. It keeps my lunch cold as well as my sodas.",
      "rating": 4.0,
      "verified": true,
      "author": "Bookworm",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Must have for anyone is construction",
      "text": "I'm union iron worker and I hate carry my lunchbox up and down ladders. This box is spacious and has a strap to carry of your shoulder and sturdy enough to use as a chair. I'm 260 lbs and I don't feel like it's gonna break everytime I sit on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Quintanilla",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Love",
      "text": "Bought this for my husband to take his lunch in. I love that I can fit all his food in it and even some snacks! He works long days/nights so the more room the better!",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20190206
    }
  ],
  "product_meta": {
    "title": "Engel UC19 Ice/Dry Box, White",
    "description": "The ultimate leak-proof cooler. Ideal for hunters and kayak fishermen. Load it onto the back of your 4-wheeler or truck and head out for a great adventure outdoors. Keeps food and drinks cold. It doubles as a dry box - keeping out moisture and/or dust from your valuable electronics, emergency kits and cameras.\n\nFROM THE MANUFACTURER\nENGEL Coolers has designed a line of heavy duty coolers that are built for more than just keeping things cold. Rugged, Durable, High Performance Marine Coolers and AC/DC Overland Fridge Freezers are just some of the products that we have become known for. If your outdoor adventure or recreation require a heavy duty cooler solution, look no further. When the heat cranks up, ENGEL is here to cool things down. Adventurers, fisherman, hunters, and campers the world over rely on ENGEL high performance, heavy duty coolers.",
    "rating": 4.6,
    "feature_bullets": [
      "Keeps food and drinks cold and doubles as a dry box - keeping out moisture and/or dust from your valuable electronics, emergency kits and cameras.",
      "Features a unique airtight EVA gasket around the lid - for excellent ice retention and a water proof seal.",
      "Non-Absorbent surfaces are easy to clean and are stain and odor resistant.",
      "Features a recessed central carry handle in the lid & integrated adjustable shoulder strap. Also includes a removable hanging tray - for storing dry goods.",
      "All fittings secured with stainless steel screws. Rear hinges are self stopping. Front latches are stainless steel."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "Yes",
      "Product Dimensions": "16.6 x 11 x 13 inches; 3.5 Pounds",
      "Item model number": "UC19",
      "Date First Available": "December 20, 2007",
      "Manufacturer": "ENGEL",
      "ASIN": "B001OTEXFO",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Camp Kitchen",
      "Coolers",
      "Camping & Hiking"
    ],
    "price": 62.99
  }
}