{
  "website_summaries": [
    {
      "verdict": "Popular choice to groom larger dogs, especially given its heavy-duty design and overhead strap system.",
      "pros": [
        "Collapsible frame for simple storing",
        "Easy assembly",
        "Rubber mat keeps dogs from slipping on table and cleans nicely",
        "Pet grooming arms are adjustable for dogs of all sizes"
      ],
      "cons": [
        "Some customers reported hardware issues for which replacement pieces were difficult to locate"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "We have a 80 lb golden doodle. We bought ...",
      "text": "We have a 80 lb golden doodle. We bought this and then a 4 foot lifetime table from Walmart that the clamps work on. Our cuts normally cost $100 plus. We were used to do his cuts on the ground which was back braking. Money and back saver.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 54,
      "publication_date": 20170711
    },
    {
      "title": "Highly recommend for grooming",
      "text": "The grooming table I got only had a half arm, but my dog would still turn in circles. I got this arm to go across the entire table so I could put a harness on the neck and a flank harness for the back. This works exactly as I hoped. There are 3 connectors on the top to attach a harness and one on each arm that comes down to the table. Many options of hooking up your harnesses based on your needs. It is very easy to raise up or down to get the correct height for your dog, and is extremely sturdy when installed. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "EricaJo",
      "helpful_votes": 17,
      "publication_date": 20180625
    },
    {
      "title": "Good strong product. I highly recommend  this.",
      "text": "Don't know how I would manage without this! I have three (of five) beagles with hind end issues that can't stand for long, and a wriggly basset, this enables me to attach a wide belt in order to make them feel more comfortable whilst I'm drying them. Front end secure as is back end is secure and they're not all hunched up in the middle. They're held safely and comfortably in a natural position. Can't accomplish that with a half bar! Well made, safe and secure for ANY table.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy541",
      "helpful_votes": 12,
      "publication_date": 20180507
    },
    {
      "title": "Love this arm! (From a professional groomer)",
      "text": "This is by far my favorite grooming arm since it goes all the way over the table. This arm allows me to turn the dog to face the other way and clip them in place rather than having to walk around the table constantly, and it allows me to wrap their back end up for those doggies that don't want to (or physically can't) stand up for their groom! (That's my personal fur baby (an Aussie Kelpie) in the photo, he's highly trained and wouldn't jump off, I do not recommend anyone to leave dogs alone on any table)",
      "rating": 5.0,
      "verified": true,
      "author": "Daciana",
      "helpful_votes": 3,
      "publication_date": 20200619
    },
    {
      "title": "Great call on my part! Upgraded single arm to this.",
      "text": "So glad I purchased this upgraded grooming arm to go with my new table. It has made grooming my doodle pup so much easier!! I knew I would need restraint at both head and rear end, since she is a reluctant groomee. This is exactly what I needed!",
      "rating": 5.0,
      "verified": true,
      "author": "M. O'Brien",
      "helpful_votes": 22,
      "publication_date": 20170510
    },
    {
      "title": "Great product",
      "text": "Great product, my golden retriever doesn't like shower and blow dryer, this helped me a lot",
      "rating": 5.0,
      "verified": true,
      "author": "Yu Yueqi",
      "helpful_votes": 13,
      "publication_date": 20170830
    },
    {
      "title": "Great quality but odds are you will get a damaged one.",
      "text": "Excellent quality, with sturdy metal clamps but I think it would be best to buy it elsewhere. The first one arrived without one of the clamps. I loved the quality so I decided to replace it instead of returning it. The replacement one arrived today and the horizontal bar is bent...stinks. I am going to keep this one and try to work with it but I looks like whoever is selling his bought a bunch of defective ones.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Very sturdy! Great buy!",
      "text": "I would definitely buy this again! The frame and clamps are sturdy and work well. (The clamps fit over a plastic Lifetime folding table, no problem.) The center bar should be a few inches longer. It's quite a stretch to expand over a 48\" table. But overall a quality product for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "DJ",
      "helpful_votes": 3,
      "publication_date": 20180813
    },
    {
      "title": "Great grooming bar, better packaging needed for shipping",
      "text": "This bar is very sturdy. It fit on my table with a 2x10 top. The knob to tighten the bar in place came broken, so if I try to tighten it it cuts my fingers. Amazon can only replace the entire package; can't find a way to contact the manufacturer for a new knob. The plastic pieces should be shipped in protective Styrofoam instead of every piece in a plastic baggie.",
      "rating": 3.0,
      "verified": true,
      "author": "DH",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Buy this if your dog is 24” or taller and over 50 pounds! It’s a must-have for grooming!",
      "text": "LOVE IT!!! My golden doodle is about 55 pounds and he did not so well with the single arm and collars. He would try to walk all around and would sit down, bending the arm beyond repair. This full bar is amazing! It’s tall enough to keep him from sitting or moving around. Highly recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Cyndie",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Lifesaver",
      "text": "Very sturdy if you have it attached evenly. Pretty easy to adjust the height, but adjusting the width or disassembling it requires removal of 3 eye hooks with rubber-lined nuts. That can be a bit of a hassle, but if you don't plan on taking it down it is wonderfully strong. Had a 110 pound golden try to jump off of my table and this arm held fast without any issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebekah",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Two nuts and bolts missing.",
      "text": "I put it together by myself in one afternoon. There were only two nuts and bolts missing from the overhead bar. Fortunately we had acceptable replacement nuts and bolts to use. Since our standard poodle puppies are only 12 weeks old we will not be able to asses it's strength for larger dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "WXYZ",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "Sturdy with plenty of adjustment.",
      "text": "Use it to groom my doodle. Clamps and cross arm are sturdy. Plenty of eyelets to attach tethers. Lots of height adjustment. Did use an old belt for strap under his belly. Used it with a 2'x4' lifetime table with adjustable height legs. Perfect setup.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan S.",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Works Great",
      "text": "Very sturdy. Has already paid for itself thrice over instead of a costly grooming session for my long haired Keeshond. She loves being groomed by us (husband or me) rather than a stranger. We do it much more frequently, its a great bonding experience and she looks great. We attached this to a table we already had and cut an old yoga mat to fit so the dog doesn't slip around. Definitely a good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean L Emery",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Prissy dogs they are not....",
      "text": "I recommend this device for home grooming. My Shitzu’s are not prissy dogs and do not care if their long beautiful hair looks like a rats nest, they are very aggressive when the time comes to groom and this device helps keep them in a more stable position so I don’t get bitten.",
      "rating": 5.0,
      "verified": true,
      "author": "PJ Mexner",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Good product",
      "text": "Works really well for our dog, the only thing they should have done was put set screws where top bar connects to side bars, fits great on a plastic Walmart 2'x4' camp table.",
      "rating": 4.0,
      "verified": true,
      "author": "John Hardin",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Overall just ok.",
      "text": "It’s an ok product but the clamps are not wide or deep enough to hold very good. The loops at the top are difficult to reposition and get them tight again but the problem with that could be me. The cinch straps also don’t hold the small poodles I have.",
      "rating": 3.0,
      "verified": true,
      "author": "Fishnlady",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Check your box",
      "text": "Missing a lot or parts when arrived. The product is smaller than the arm I have now but I made it work. Might return if it doesn’t stay strong enough for a large dog.",
      "rating": 3.0,
      "verified": true,
      "author": "Tre",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Best. Purchase",
      "text": "As a groomer I'm asking myself why I never bought this before. It helps so much when a dog wants to sit down or is crazy on the table. Best. Purchase. Ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 4,
      "publication_date": 20161025
    },
    {
      "title": "Great product",
      "text": "It is perfect for me to trim my cocker spaniel's fur and I don't have to bend over anymore. It fits a bigger dog, roomy for my dog. Sturdy built and stylish, I am running out of room in the garage so put it in the patio, and it looks belong there nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Sally Chen Armstrong",
      "helpful_votes": 2,
      "publication_date": 20160925
    },
    {
      "title": "this is really good to keep my wiggly squirmy dog under control while ...",
      "text": "this is really good to keep my wiggly squirmy dog under control while I groom her. wish I had bought it years ago!",
      "rating": 5.0,
      "verified": true,
      "author": "Marcia B. Guittard",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Perfect for a 90 Pound GSD",
      "text": "This table is just what my dog and I needed. I set her ramp up to get on the table as she is a 90 lb. dog. I can brush without bending over and killing my back. She gets a longer brushing because we are both comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna  S",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Very Solid and Well Made",
      "text": "Very solid and well made. The attachments all around make it versatile for any configuration of leashes and straps. However, remember that this is going to require some training time. This is not intended to secure a dog who doesn't want to be there. :-) My dog is a good fellow, but we are going gradually and the plan is to groom a few minutes daily. He ain't gonna stand there an hour until he's much older. (10 month Great Pyr)",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 3,
      "publication_date": 20150520
    },
    {
      "title": "Works great!!",
      "text": "Bought a 4 foot plastic table for this to groom my two Cocker Spaniels...this was a much needed accessory and well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": ".",
      "text": "I was worried about the table not being sturdy enough, i was wrong, yaya, I love it! the tray is longer and wider then i expected so a happy surprise. I will order another one in the near future. Got on time and infinity stars to this vendor.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Does not include table!!",
      "text": "Make sure you read the description carefully. I thought I was buying the table it is only the overhead bars.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Misleading:only metal frame doesn't include table",
      "text": "I was very upset because after looking at the pictures and the reviews I thought this included the table but it was literally just the metal part with the leashes hanging down. So I had to go out at 8:30 at night and go buy the table. Now that it's all attached it goes fine but it was very misleading",
      "rating": 2.0,
      "verified": true,
      "author": "rebecca c.",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Not so easy to use",
      "text": "I like the idea of this type of bar but in order to raise or lower it takes two people.",
      "rating": 4.0,
      "verified": true,
      "author": "Trigger",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "My girls absolutely hate being restricted",
      "text": "My girls absolutely hate being restricted, I need the function of the table attachment. we are working on a compromise. Easy to attach to folding table variety of attachment points.",
      "rating": 5.0,
      "verified": true,
      "author": "Dora D. Payne",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "Great product",
      "text": "Absolutely love this. Had one at my old job and just had to buy my own for my new job. Hated going back to using single grooming arm.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracey L Keitz",
      "helpful_votes": 2,
      "publication_date": 20161220
    },
    {
      "title": "Better than what comes with the table",
      "text": "This is the bar only. Better than what comes with the table. Allows heights and more connects around the dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171119
    },
    {
      "title": "Versatile and Sturdy",
      "text": "I like the options of where to clip in; I can move the harness around as I trim. It's sturdy and tall enough for my doodle. I would have given it five stars, but it came used -- scratches and wear marks on the metal. However, the dog was bathed and ready to groom, so I didn't return.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Missing Part",
      "text": "Product came with one of the knobs missing so I can’t adjust height. I can’t find anything that fits.",
      "rating": 3.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Great tool to groom yo pet",
      "text": "Like it a lot. Be aware you need your own table.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "does not come with the haunch holder",
      "text": "I havnt used this yet, but the picture suggests that it comes with the no sit haunch holder which it does not. I had to order that separately . otherwise it looks like it's going to be a good investment for my bouvier that likes to lay on his side while being groomed",
      "rating": 4.0,
      "verified": true,
      "author": "lisa Waldron",
      "helpful_votes": 2,
      "publication_date": 20151217
    },
    {
      "title": "Great Tool!",
      "text": "Used for grooming our cocker spaniel who has issues with touching her feet, legs, and tail. She is 40 lbs. and a medium height. Makes it so much easier to clip her.",
      "rating": 5.0,
      "verified": true,
      "author": "terrkat",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Not happy!",
      "text": "This item appears used. Finger prints on metal and water type spots. Maybe it was a return. Should send back and order somewhere else!",
      "rating": 2.0,
      "verified": true,
      "author": "Kathy J. Murphy",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "much easier to groom dog",
      "text": "Well built makes the job of grooming my dog easier.",
      "rating": 5.0,
      "verified": true,
      "author": "ron",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Great item!!!",
      "text": "The table and overhead comes separately. We bought both and are thrilled with the quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristi",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Extremely helpful product!",
      "text": "If you groom your own dogs, this product is for you! I'm a senior citizen and I groom the two of my dogs that require it (a poodle and a schnauzer mix). I only wish I had bought this years ago. It is such a difference...no squirming, no twisting to get away, and no sitting down! Highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "nanato4grands",
      "helpful_votes": 50,
      "publication_date": 20120628
    },
    {
      "title": "Effective design",
      "text": "This grooming arm works well and helps keep the dog from turning on the grooming table. It might be more effective in keeping an energetic dog such as ours from turning on the table if there were eye bolts at the top of the uprights as well as across the overhead tube. I also recommend a two point attachment restraint rather than the single point No-Sit Haunch Holder to help keep the dog from 'spinning.' This one is good as far as it goes, it would be better if it went a bit further in keeping the dog oriented on the table.",
      "rating": 4.0,
      "verified": true,
      "author": "JLM AK",
      "helpful_votes": 2,
      "publication_date": 20140527
    },
    {
      "title": "Excellent product, although I haven't tried any of the ...",
      "text": "Excellent product, although I haven't tried any of the single arm restraints. Very strong clamps. NOTE: this product comes with restrain cords, no need to order another set!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "Great",
      "text": "No instructions but good product very strong does not come with table",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Sebban",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "I highly recommend this!",
      "text": "I got this to go with the Comfort Groomer Table....I highly recommend this!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Discerning Customer",
      "helpful_votes": 2,
      "publication_date": 20170126
    },
    {
      "title": "Great but",
      "text": "Great. Maybe won’t work on super big crazy dogs. But good for older dogs of most sizes",
      "rating": 5.0,
      "verified": true,
      "author": "Katiria",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Four Stars",
      "text": "This is a great thing to have for safety but I do wish it adjusted more easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Shell",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Can mount to anything",
      "text": "I also use this on my cat...but not without protest.",
      "rating": 5.0,
      "verified": true,
      "author": "Gizmosfriend",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Not so sturdy",
      "text": "We need to return this item. It was not very sturdy. It nearly fell apart when we tried to clip our dogs nails. He’s only 40 pounds. Maybe it would work for a smaller dog, much smaller.",
      "rating": 1.0,
      "verified": true,
      "author": "Dianna M. Shooner",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Great product",
      "text": "Great product. Love all the anchor points and eyelet anchors. It make grooming large dogs easier due to the variety on anchor points and the nice height that it goes up to.",
      "rating": 5.0,
      "verified": true,
      "author": "kellycolo.",
      "helpful_votes": 0,
      "publication_date": 20150308
    },
    {
      "title": "Overhead Bar",
      "text": "This is an excellent arm for a table. It is stable since it attaches at both ends. I recommend it highly",
      "rating": 5.0,
      "verified": true,
      "author": "Jeannie",
      "helpful_votes": 6,
      "publication_date": 20130919
    },
    {
      "title": "It is very sturdy and was easy to attach to a table that ...",
      "text": "It is very sturdy and was easy to attach to a table that I have used previously. I would recommend this one to the half arm any day. I would buy again ! Well worth the money !!",
      "rating": 5.0,
      "verified": true,
      "author": "Jazzysam",
      "helpful_votes": 0,
      "publication_date": 20170730
    },
    {
      "title": "I had one that fit over the head and haunches and it was like grooming a pinata",
      "text": "this makes grooming so much easier.I had one that fit over the head and haunches and it was like grooming a pinata",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Burreece",
      "helpful_votes": 3,
      "publication_date": 20160503
    },
    {
      "title": "Easy to assemble",
      "text": "Back saving device. Easy to assemble. I have it attached to an old desk/sewing table with some anti-slip shower mats underneath, They (the doodle boys) were scared at first but eventually relaxed as I save hundreds in grooming costs. I use a small nylon leash under the belly tied to the overhead support to prevent them from sitting down and the two, loose fitting nylon loops around their neck. Well worth the cost and the boys are a lot less stressed than going to the groomers!! Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Lazenby",
      "helpful_votes": 4,
      "publication_date": 20161030
    },
    {
      "title": "Great table",
      "text": "Sturdy my dog loves it get his hair cut on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven A,",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Good",
      "text": "Just wish it was easier to rais and lower both sides at the same time.",
      "rating": 4.0,
      "verified": true,
      "author": "Reyvin Windwolf",
      "helpful_votes": 0,
      "publication_date": 20160908
    },
    {
      "title": "No claps included.",
      "text": "I bought this a few months back. Decided to unpack and set up. Came with no claps. Have no idea how to get a hold of them.",
      "rating": 1.0,
      "verified": true,
      "author": "Timothy l williams",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "sturdy, useful",
      "text": "The overhead bar provides many options to keep twisty dogs still. My only criticism is that the attachment eyes could be larger. Its hard to tie through them, if you don't use snaps",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah Armstrong",
      "helpful_votes": 3,
      "publication_date": 20130518
    },
    {
      "title": "love it!",
      "text": "This arm is a god-sent! One of my dogs was paralyzed for a while and still has trouble standing. The extra loop keeps him steady and standing. Great help with unruly puppies. Keeps them safe.",
      "rating": 5.0,
      "verified": true,
      "author": "Affie mom",
      "helpful_votes": 0,
      "publication_date": 20150709
    },
    {
      "title": "Overhead grooming arm",
      "text": "You have to use a larger table. Luckily, I had one.",
      "rating": 5.0,
      "verified": true,
      "author": "CarolAnn Worsham",
      "helpful_votes": 0,
      "publication_date": 20150608
    },
    {
      "title": "Five Stars",
      "text": "great set up if you have the table. Strong and well built.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "Works pretty well.",
      "text": "This will help you groom your dogs, but it has fallen a couple times on me. A strong dog can do this. I had one dog that was so strong that he had it bending back and forth as he was fighting me to get loose. I was scared that he was going to break this, but thankfully it didn't. I haven't had a tall dog to groom yet, but when I do, I don't know how I will do this being as it may be to short for a tall dog. It has worked so far though.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura Texas Gal",
      "helpful_votes": 3,
      "publication_date": 20160730
    },
    {
      "title": "Not happy. The picture shows a table to set the dog on. This product didn’t have one",
      "text": "This is not like the picture I dont want them returning both",
      "rating": 1.0,
      "verified": true,
      "author": "Joanne Smith",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Easy to put up and sturdy",
      "text": "Makes an enormous difference when grooming my golden doodle! Easy to put up and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn Mate Cramer",
      "helpful_votes": 0,
      "publication_date": 20150711
    },
    {
      "title": "Strong support, good product.",
      "text": "Needed strong support for my wiggly labradoodle, and this bar does the job. I have him secured on the front hook, and around the waist on the back hook, now the wiggling stopped.",
      "rating": 5.0,
      "verified": true,
      "author": "Kirsten M.",
      "helpful_votes": 7,
      "publication_date": 20160910
    },
    {
      "title": "This produce is nice and sturdy",
      "text": "Tips: If you are grooming different height dogs by yourself - leave out the center top bar that connects the two ends. That way you can raise the two end pcs. independently by yourself. If however you have someone that helps you raise and lower the bar then no problem attaching the center top bar. This produce is nice and sturdy, clamps securely to the table and adjust's nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "RLG",
      "helpful_votes": 2,
      "publication_date": 20170625
    },
    {
      "title": "Five Stars",
      "text": "awesome for getting feet, head and tail from fussy pet",
      "rating": 5.0,
      "verified": true,
      "author": "Charles W. Michielsen",
      "helpful_votes": 0,
      "publication_date": 20160326
    },
    {
      "title": "Great help",
      "text": "I would recommend this item for anybody that has dogs..It helps alot keeping the dog standing up, until you finish with them..",
      "rating": 5.0,
      "verified": true,
      "author": "W",
      "helpful_votes": 4,
      "publication_date": 20140306
    },
    {
      "title": "Fast delivery",
      "text": "I will be using it to groom animals in the next year or so. I am happy with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy Toth",
      "helpful_votes": 0,
      "publication_date": 20140126
    },
    {
      "title": "They look sturdy and think they will fit my purpose nicely",
      "text": "My table came in with some problems and had to send it back, so I have not used my grooming arm yet. They look sturdy and think they will fit my purpose nicely.",
      "rating": 4.0,
      "verified": true,
      "author": "Mrs. Patricia Large",
      "helpful_votes": 0,
      "publication_date": 20150108
    },
    {
      "title": "Four Stars",
      "text": "Little thin but it will work good for my small dogs that I have. Like it",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "great item",
      "text": "love the item, very helpful made very well and strong, easy to apply to table",
      "rating": 5.0,
      "verified": true,
      "author": "ann williams",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "It's relatively easy to set up",
      "text": "This is a game changer for my home grooming needs. It's relatively easy to set up. Easy to store. The ability to groom my dogs at home has been awesome and I don't have to break my back now or fight with my dogs as much. I bought a sling type device off Etsy which has helped my groom my small dogs. The harnesses included help wrangle my dogs and immobilize them for trimming. Purchasing this item, my sling device, and professional clippers have all been a worthwhile investment. I have three dogs and the items have already paid for themselves with the money I've saved by not having to take them to the groomer.",
      "rating": 5.0,
      "verified": true,
      "author": "Ali",
      "helpful_votes": 0,
      "publication_date": 20160922
    },
    {
      "title": "Table rocks Saves my back Well priced Bought master's overhead ...",
      "text": "Table rocks Saves my back Well priced Bought master's overhead arm as well",
      "rating": 5.0,
      "verified": true,
      "author": "Cliff M Feldman",
      "helpful_votes": 0,
      "publication_date": 20150703
    },
    {
      "title": "Would have liked to have one more connector on top",
      "text": "This is exactly what is needed to get the job done! I groom 10-14 dogs a day and this helps make it much more manageable. If you also groom, this is a must have! Would have liked to have one more connector on top, but with figure something out.",
      "rating": 5.0,
      "verified": true,
      "author": "Got This Gift",
      "helpful_votes": 3,
      "publication_date": 20160502
    },
    {
      "title": "Exactly what I needed",
      "text": "Very sturdy once set up. I love being able to put two tethers on my dogs to keep them in place. I have two dogs, and one especially is a \"spinner.\" This makes it so much easier to control the dog and not worry about them falling and being injured if they do buck out of your control. The fact that it's adjustable means I don't have to lug along my entire grooming table when we go to the cabin for the summer. I simply unclamp this from my grooming table and clamp it on the picnic table (keeps the hairy mess outside, too).",
      "rating": 5.0,
      "verified": true,
      "author": "kbuell",
      "helpful_votes": 10,
      "publication_date": 20140527
    },
    {
      "title": "Feed back review",
      "text": "Very happy with this item make life so much easier when grooming, also very pleased with the whole of your service the updates and the delivery dates and times, very good packaging. I have rated this Item 5-5 because of the excellent service.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20131028
    },
    {
      "title": "Works fine, looks fine",
      "text": "A very useful addition to your grooming table. The ability to move the leash restraint to various positions makes it worth the cost. My five small dogs benefit from this in conjunction with the No-Sit Haunch Holder Dog Grooming Harness Leash Loop -- that has two leashes.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig",
      "helpful_votes": 2,
      "publication_date": 20160812
    },
    {
      "title": "Quality product",
      "text": "I purchased this for my growing Goldendoodle puppy. It is well made, a quality product I expect to get many years of service. It comes with only the neck harness, so I also purchased the double harness to keep her centered on the table. I like the many openings for repositioning the harness. Price was good also.",
      "rating": 5.0,
      "verified": true,
      "author": "C.M.King",
      "helpful_votes": 0,
      "publication_date": 20140817
    },
    {
      "title": "Extremely disappointed with this product",
      "text": "Not durable at all. The arm bent and the entire bar snapped. Lasted less than 4 months with moderate use. Extremely disappointed with this product.",
      "rating": 1.0,
      "verified": true,
      "author": "V. Lee",
      "helpful_votes": 4,
      "publication_date": 20171015
    },
    {
      "title": "Five Stars",
      "text": "very study and my small dog can be hooked up very fast....",
      "rating": 5.0,
      "verified": true,
      "author": "lin",
      "helpful_votes": 0,
      "publication_date": 20150408
    },
    {
      "title": "A must have for any grooming table!!",
      "text": "This is a must for any grooming table!! It's like having an extra hand to help you. The grooming table I purchased didn't have adjustable bar tall enough for Standard Poodles, which is a huge reason why an owner would like to groom their own dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "ChereeK",
      "helpful_votes": 2,
      "publication_date": 20150529
    },
    {
      "title": "Perfect for those new to grooming",
      "text": "Bought this item thinking it would be perfect for a beginner to grooming. Love the idea of not having one hook where my pups can end up hanging themselves. I am not disappointed. This product is solid, perfect to secure and hold my puppies in place. My only surprise was that the table wasn't included. Course, that was my fault for not reading thoroughly and basically buying off the photo. Glad I made this purchase. Would do so again.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Graham",
      "helpful_votes": 0,
      "publication_date": 20131116
    },
    {
      "title": "I like to full bar better than the 1-sided bar",
      "text": "I like to full bar better than the 1-sided bar, I have 1 dog that doesn't like the drying part & it helps me keep her more stable",
      "rating": 4.0,
      "verified": true,
      "author": "Tamara A Huinker",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "Five Stars",
      "text": "I love it were you can take care of your pet in a safe manner.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160601
    },
    {
      "title": "I have two Pomeranians and they require a lot of ...",
      "text": "I have two Pomeranians and they require a lot of maintenance. It was impossible to cut their hair with out this equipment. Now they stay steady and calm. Witch makes my life easier when I'm grooming them. Also, you can use it for giving a bath to the dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "Erik",
      "helpful_votes": 0,
      "publication_date": 20170519
    },
    {
      "title": "As the prod looks great my prob was that the brackets to attach it ...",
      "text": "As the prod looks great my prob was that the brackets to attach it to the table are too small and i have to return the product.felling bummed....",
      "rating": 1.0,
      "verified": true,
      "author": "masada",
      "helpful_votes": 9,
      "publication_date": 20150405
    },
    {
      "title": "Sturdy, works well",
      "text": "Sturdy, works well. A little pricey for what you get. I was disappointed the clamps aren't wide enough to fit my folding table. I had to saw a small notch into each end of the table in order for the clamps to fit. Otherwise, I am happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 2,
      "publication_date": 20170203
    },
    {
      "title": "Great grooming arm but...",
      "text": "The grooming arm itself is fantastic, the grooming nooses inclosed leave MUCH to be desired. The slide on the noose is a round ring that loosens too easily. Replace that with a better closure and this would get 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "SAM",
      "helpful_votes": 0,
      "publication_date": 20160620
    },
    {
      "title": "Five Stars",
      "text": "This has been super helpful when trimming my big dogs' nails. No more struggling!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie M.",
      "helpful_votes": 2,
      "publication_date": 20180213
    },
    {
      "title": "Worked great. Our wee dog had a great home trim",
      "text": "Used for the first time and attached to the skill-saw table (without the saw of course). Worked great. Our wee dog had a great home trim. At $40 at the local groomer the arch has nearly paid for itself.",
      "rating": 5.0,
      "verified": true,
      "author": "Froukje",
      "helpful_votes": 0,
      "publication_date": 20150403
    },
    {
      "title": "Saves my back, and let's me work with both hands.",
      "text": "Works well, and makes grooming an unruly dog much easier. It really needs a flat table with no lip to attach properly. We managed to make it work on a plastic folding table though. Seems sturdy, and it's very adjustable for different sizes dogs.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica E Smith",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Works well for regular grooming.",
      "text": "Works well. I bought it to go with a Master Equipment Adjustable Height Grooming table. I use it regularly when grooming a wheaten terrier.",
      "rating": 5.0,
      "verified": true,
      "author": "Brain",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "Read the details carefully",
      "text": "Well, stupid me didn't read the description well enough and for the price thought the table was included. Now I have to wait for my table to truly review this product. It does appear quite sturdy.",
      "rating": 4.0,
      "verified": true,
      "author": "J. S. Wasko",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Bad design. Good for small med",
      "text": "Broke 4 in last 2 yrs. Bad design. Good for small med dogs",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20161030
    },
    {
      "title": "Great!!",
      "text": "Great!!! Struggled so much with dogs nails previously, but now...what a HUGE difference and so glad we spent the money to do it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie L.",
      "helpful_votes": 0,
      "publication_date": 20160810
    },
    {
      "title": "Not overly pleased yet",
      "text": "The box arrived damaged, and one of the legs was missing an end cap. There were no packing orders included, and there were no directions for putting it together. For now, I will have to wait to use the product because it does not clamp to the table I have. I just wish I had some sort of manual.",
      "rating": 3.0,
      "verified": true,
      "author": "John E Deal",
      "helpful_votes": 4,
      "publication_date": 20140506
    },
    {
      "title": "Wwould be better if slightly",
      "text": "Had to cut down to allow my Newfoundland to get on, Wwould be better if slightly largely",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "Better for smaller breeds",
      "text": "Good quality but I had to return because I knew it would not hold my chow rescues while grooming them at home. I just didn't feel it was strong enough but suitable for a smaller breed.",
      "rating": 4.0,
      "verified": true,
      "author": "Upstate NY lady",
      "helpful_votes": 0,
      "publication_date": 20170520
    },
    {
      "title": "Great price and functional",
      "text": "Great price and functional. I no longer need to use 'leashes', my dogs now stay still once they are under the fixture.",
      "rating": 5.0,
      "verified": true,
      "author": "Whustian",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "Good investment",
      "text": "Life saver! Comes with two leashes, recommend getting some chain to use to make the dog stand sturdier for mid-large dogs, would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Niki",
      "helpful_votes": 2,
      "publication_date": 20161017
    }
  ],
  "product_meta": {
    "title": "Master Equipment Zinc-Plated Steel Overhead Pet Grooming Arm",
    "description": "Achieve maximum grooming versatility and control with the Master Equipment Overhead Grooming Arm. With two 48\" vertical posts and an adjustable 28\" horizontal connector bar, it fits tables 36\" to 48\" in length. \n\n• The grooming arm comes with seven eye bolts\n• Adjustable connector length fits tables from 36\" to 48\"\n• Position grooming restraints in a variety of positions to suit your needs\n\nMaterial: Durable zinc-plated square tubular steel with adjustable powder-coated aluminum clamps\nCapacity: Accommodate a table up to 1¼\" thick.",
    "rating": 4.3,
    "feature_bullets": [
      "A Top Choice for Professional Groomers – Secure dog grooming arm designed for professionals featuring two 48-inch vertical posts and a 28-inch connector bar",
      "Versatile Design – Features an adjustable connector bar; Table not included but arm fits tables ranging from 36 to 48 inches in length for maximum versatility",
      "Includes Grooming Nooses – Comes with two black grooming nooses to keep pets safe, secure and in place while you bathe, dry, brush, clip and trim",
      "Adaptable Components – Connector features 12 placement options for any noose or restraint so that you can place them in a variety of positions to suit your needs",
      "Professional Recommended – This product meets or exceeds the Professional Pet Groomers and Stylists Alliance (PPGSA) standards.Knobs are black nylon PA66"
    ],
    "specifications": {
      "Product Dimensions": "49.5 x 15.8 x 2.8 inches; 9.08 Pounds",
      "Item model number": "TP14634",
      "Department": "Racks/Futons",
      "Date First Available": "March 14, 2009",
      "Manufacturer": "PetEdge Dealer Services*",
      "ASIN": "B001VPEOXM",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Grooming",
      "Dogs",
      "Shower & Bath Accessories",
      "Pet Supplies"
    ],
    "price": 66.82
  }
}