{
  "website_summaries": [
    {
      "verdict": "Despite some minor flaws, Pure Digital's Flip Video Mino is the best mini camcorder for straight-to-Web video currently available--but it also costs more, and it can't match the features of a video-savvy point-and-shoot camera.",
      "pros": [
        "Ultraslim yet functional design",
        "easy to use",
        "relatively high-quality sound and video for its class",
        "one-touch video uploading to YouTube and AOL"
      ],
      "cons": [
        "A bit expensive",
        "no SD/MMC card expansion slot",
        "rechargeable battery isn't removable or replaceable"
      ],
      "aspects": {
        "Design": 9.0,
        "Features": 7.0,
        "Performance": 7.0,
        "Image quality": 7.0
      },
      "publication_date": 20080608,
      "rating": 7.8,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Entrepreneurial videos",
      "text": "I love my new Flip Mino camcorder. I was mega-skeptical about how good something this tiny could be, but I needed something quick, easy and practical for sales-oriented website videos. I was amazed at how easy it is to use the Flip Mino, and at the quality of the end product video. Is it the \"perfect\" camcorder for every ocassion? No, but for those impromptu, \"down & dirty\", on the spot videos it beats the heck out of using a big camcorder...or a cellphone. I considered buying a Sony \"Webbie\", but dollar for dollar you can't beat a Flip.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Crouse",
      "helpful_votes": 37,
      "publication_date": 20090825
    },
    {
      "title": "Have Camcorder, Will Travel",
      "text": "While it would never replace a larger, full-featured camcorder, this little Flip Mino is fantastic, and I never leave home without it. About the height of a pack of cigarettes, and less than half it's width and depth , this wonderful little piece of technology takes some beautiful video, and also surprisingly picks up all sounds and voices with clarity as well. Bottom line - the Flip Mino is for those that want/need something small, lightweight and simple, and don't want to fiddle with converting or encoding, as well as for those who love to upload videos to video websites or via email.",
      "rating": 5.0,
      "verified": true,
      "author": "Sage",
      "helpful_votes": 0,
      "publication_date": 20080825
    },
    {
      "title": "Great Little Camera",
      "text": "This is my second Flip Video Camera. I purchased the original one several years ago. I bought this camera to have improved video quality. I can definitely tell a difference, plus the Mineo which doesn't use AA batteries, is so light it's almost not there. The reason I didn't give it 5 stars is because when I first tried to charge it up, the AC adapter which came as free perk, would not give it a full charge. Tech support suggested I leave it plugged into my high speed USB port on the computer overnight. That worked. I would definitely recommend this camera to anyone who wants fairly good video with little cost and hassle.",
      "rating": 4.0,
      "verified": true,
      "author": "Splitpea",
      "helpful_votes": 0,
      "publication_date": 20091007
    },
    {
      "title": "Very easy to use, image quality not great, but good enough",
      "text": "This is a nice little video recorder. With my iPhone lacking video recording capabilities, I decided to give this little gadget a try. The whole process of setting up, recording, transferring videos and uploading them to YouTube (using the Flip software) was very easy. No issues whatsoever with the latest iPhoto, it downloads movies into the iPhoto library just like any other format. Very portable, nice product and package experience overall. Very pleased. The image quality could be better, but then again it's mostly for the Web so it doesn't matter. It works beautifully for blogging and sharing videos with friends and family.",
      "rating": 4.0,
      "verified": true,
      "author": "PMetal",
      "helpful_votes": 0,
      "publication_date": 20080718
    },
    {
      "title": "Decent enough camera.",
      "text": "Bought it more than 10 years ago for a college product, and because it was cheap. To this day, it still works and it puts out decent enough quality. Not high end, but it's good enough quality for an armature video.",
      "rating": 4.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Excellent, easy to use and carry",
      "text": "Got this recently. It works like a dream. Its partially pre-charged (nice touch) so you can get down to shooting as soon as you get it. The controls are easy- even the technologically challenged will find it a breeze. The transfer of the videos to the PC is easier. The best feature is the software which is provided within the Mino- so you can download/upload your software wherever you are. The software also makes it easy to upload your videos into websites- the compression feature is awesome. All in all, for the price its good. Wouldn't have minded if it was a little cheaper, but then the looks you get for it make up.",
      "rating": 5.0,
      "verified": true,
      "author": "Manu Kashyap",
      "helpful_votes": 0,
      "publication_date": 20080627
    },
    {
      "title": "Why did I wait so long?",
      "text": "This is an awesome product...small and incredibly light and sleek; I take it everywhere. No wires; USB flips out and you plug it into your port like a flash drive to charge & download. Totally intuitive interface; so easy to use! The unit is beautifully designed. Amazing price for such a satisfying and sophisticated product. The quality of the video is fine for full screen laptop display and it does an excellent job even in low light situations; also audio is excellent. Now I want the HD version! One caveat; to transfer videos to your iPhone you will have to install some proprietary software to convert the Flip's AVI files to MP4.",
      "rating": 5.0,
      "verified": true,
      "author": "Ina Saltz",
      "helpful_votes": 0,
      "publication_date": 20081130
    },
    {
      "title": "FLIP MINO IS AN EXCELLENT CAMCORDER",
      "text": "I tried several others and they were grainy in the evening. Not Flip Mino, it is excellent! You can take this thing out at night time and get a good picture with it, very impressive. Some others I tried were grainy even in household light. I didn't want to pay the extra money for HD, but the picture is sharp and clear. I'll probably buy an HD when the 3rd generation comes out. I have heard bad things about 2nd generation. For the money, you cannot beat this device. The sound is pretty good, much better than I expected. Try it out, you will like it!",
      "rating": 5.0,
      "verified": true,
      "author": "Atheist",
      "helpful_votes": 0,
      "publication_date": 20100410
    },
    {
      "title": "Good for PC not good for mac",
      "text": "I love this camera for it's ease of use. I use it primarily for quick videos for work and for personal. My 9 year old nephew loves it as well, and can run the whole thing himself no problem. Unfortunately it is not plug-and-play for mac OX10 and the new iMovie does not recognize the the file types. Apparently if you tweak some settings and do some conversions it works. But that sort of kills the whole point of an easy to use camera. I haven't had time to mess with it, so I can't use it with my mac, but it is quick and easy on the PC (XP operating system)",
      "rating": 4.0,
      "verified": true,
      "author": "Trip Hosley",
      "helpful_votes": 0,
      "publication_date": 20080906
    },
    {
      "title": "truly for dummies and the user manual-averse",
      "text": "I am the kind of person who never wants to, and often does not read the user manual for gadgets. I have yet to read the manual for this device, and I have been able to use it on an intuitive basis just fine. I am probably using 10 or 20 % of the true capabilities, but that has been enough for me - I just take footage of my daughter so that she won't berate me when she is an adult for not having captured all the cute moments. It's much easier and fun to use this recorder rather than my cell phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Beatrice Izzey",
      "helpful_votes": 0,
      "publication_date": 20090113
    },
    {
      "title": "I am soooo glad I made this purchase",
      "text": "The flip is great, primarily for it's convenience, ease of use, and quality video. It is easy to put on your computer, and then burn to a disc, and it's super easy to edit your video. I also love the internal battery. It charges itself, while you have it plugged in to take the photos off. The battery life is also very good. I have used the entire 60 minutes of record time and haven't even been past half battery strength. I even like this camera better than the HD flips.",
      "rating": 5.0,
      "verified": true,
      "author": "EM",
      "helpful_votes": 0,
      "publication_date": 20110524
    },
    {
      "title": "and the first 5 minutes or so looked very good, then in the remaining 45 minutes",
      "text": "I just used the camera which looked and appeared to be just as represented. I videotaped a person to use in a professional presentation, and the first 5 minutes or so looked very good, then in the remaining 45 minutes, the speaker was a distracting array of different fluorescent colors. It was very disappointing to me, as there was nothing in the description of the camera to indicate any problem.Kathy Small",
      "rating": 1.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20161107
    },
    {
      "title": "Flip Video Mino",
      "text": "For what this is and what it does -- it is just great! I've made a short video of a national basketball game just to see if I could, and was pleasantly surprised at the results. I also took a 40 minute video of a memorial service after a funeral for a friend and again was quite pleased. If you're looking or a professional video camera, this ain't it. But if you want something you can stick in your pocket and pull out for quick video opportunities, the Flip Video Mino will do the rick. I'd buy it again!",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Timothy K. Hoke",
      "helpful_votes": 0,
      "publication_date": 20081202
    },
    {
      "title": "Fabulous Flip!",
      "text": "I've really enjoyed using our Flip Video Mino. It's very easy to use . . . just turn it on and video! When you're done, put it in the computer's USB port (which also charges it) and import what you've videoed. I haven't used the included software to make a movie yet, opting instead for iMovie. It's very easy to edit the Flip video in iMovie and end up with a polished product, even adding music. Having a small digital camcorder that fits in your pocket or purse makes it easy to video on the go. Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Texas Susan",
      "helpful_votes": 0,
      "publication_date": 20090323
    },
    {
      "title": "The best yet!",
      "text": "This is the best little machine I have ever experienced. We are bikers and took this little thing on a 3200 mile motorcycle trip. It rode in my pocket and we pulled it out to send what we called \"video postcards\" to all our friends. It is reliable, simple and amazingly good quality. Several of our friends have bought one after seeing our travel videos. Most people buy a regular camcorder and it sits in the closet, the Mino is great for active people who want to take it along in a pocket.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria Alexander-lane",
      "helpful_votes": 0,
      "publication_date": 20080924
    },
    {
      "title": "Great easy to use camcorder",
      "text": "I love this camcorder, it's small and sleek and most importantly SIMPLE! I have a baby and I just need to record her, nothing fancy, and this works perfectly. There's not even a cord for charging the battery, which is great. I previouly got a Panasonic one that cost like 5x more, and I still have not figured out HOW to transfer the files to the computer/to mpeg format for sharing. I tried once and took me 3 hrs and still I don't have 1 converted video. I am so happy with the Flip Mino!",
      "rating": 5.0,
      "verified": true,
      "author": "M&M",
      "helpful_votes": 0,
      "publication_date": 20080622
    },
    {
      "title": "This is the bomb!",
      "text": "I bought this as the \"traveling Pants...video\" type thing. It has been all over the state of California in many different hands. It's compact size really makes it easy to stick in a pocket or my purse. The program is easy to use as well. We are in the process of clipping all the pieces of the pictures together to make a surprise birthday movie! It's been a kick and everyone who used it now wants one as well! Highly recommend getting one! You will never miss a moment for a good memory!",
      "rating": 5.0,
      "verified": true,
      "author": "L.A.A.",
      "helpful_votes": 0,
      "publication_date": 20080829
    },
    {
      "title": "Easiest Camcorder Ever!",
      "text": "This is the easiest & convenient camera in the world. I am a complete idiot when it comes to electronics & have no desire to learn. I never had to read anything for the Flip...just record & hook up to the computer & post videos. It does take a few minutes to email them but so worth it. Video quality is great & holds a charge forever. If you're like me & hate to carry digital & video cameras...this is for you. Easy & convenient that you'll never miss a moment worth recording.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori T",
      "helpful_votes": 0,
      "publication_date": 20090114
    },
    {
      "title": "Absolute Garbage",
      "text": "I ordered this as a present for my brother-in-law. The description said \"gray shading\". The \"gray shading\" was black fingerprints like it was used to film a house fire. After e-mailing customer service they told me that \"it clearly states gray shading\". Is this a joke? you sent me a dirty piece of s*** flip video. Never again with these idiots. Order a flip camera from anywhere else bug these morons.",
      "rating": 1.0,
      "verified": true,
      "author": "Chef Geoff",
      "helpful_votes": 0,
      "publication_date": 20121210
    },
    {
      "title": "Great Gift",
      "text": "I bought this as a gift for my roommate and when he opened it he loved it. He takes it snowboarding with him so its fairly tough for being so small. I immediately noticed that regardless of its size it still felt like a quality camera in my hands unlike all those other cheaper versions out there. Starts up fairly quick and plays back immediately. The only thing that could improve the Flip Mino is if it had the ability to take still shots. This camera is for video only!",
      "rating": 4.0,
      "verified": true,
      "author": "Aaron Fry",
      "helpful_votes": 0,
      "publication_date": 20100116
    },
    {
      "title": "Great everyday camera!",
      "text": "This is a great camera for everyday events and things. It is a tad pixulated but I deal with it because it is so easy! I don't like the buttons and how easy it is to accidentally press to stop or start. I have, more then once, been in the middle of recording and lightly tapped the middle button and it stops. I wish they weren't so sensitive. But upload to computer to DropShots is so quick and easy! I can share a ton of video in no time! :)",
      "rating": 4.0,
      "verified": true,
      "author": "pyreneesmom",
      "helpful_votes": 0,
      "publication_date": 20081003
    },
    {
      "title": "I love my Flip",
      "text": "I didn't even know I wanted a video camcorder until I received the Flip Mino for my birthday. I love it!! It is small and so easy to use...the manual is only about 4 small pages long. Perfect for everyday use. I am having a problem with loading videos on my computer using Flip software. It always uses my camera software to download them so there never any videos in my flip video library. I need to figure out why. Anyway, buy the FLIP!!",
      "rating": 5.0,
      "verified": true,
      "author": "SparkyGirl1012",
      "helpful_votes": 0,
      "publication_date": 20081020
    },
    {
      "title": "Well planned and made",
      "text": "The Flip Mino camcorder is ideal for the person who wants to be able to record special events or scenes without having an apparatus strapped to the back of your hand. I'm not a photographer and have never liked having cameras strapped around my neck, on my shoulder or strapped to my hand. It truly fits in a pocket; appears to be reasonalbly durable and is easy to use. The software also provides the necessary support to edit, store and email videos or snapshots taken from the videos. I gave it four stars instead of five because the picture quality is not as good as the larger, more expensive camcorder.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20080809
    },
    {
      "title": "Pocket Producer",
      "text": "If you would like to have a small inconspicuous device that you can stow away on your person easily and have it ready at a moments notice to record spontaneously those never-to-be-repeated moments then..........this is the device for you. The 60 minutes of recording time, the longer-lived lithium battery, the nearly instant startup far exceeds that of video cell phones. Plus, the image is much clearer and the software (included in the device) is very user-friendly. Highly recommended for all ages.",
      "rating": 5.0,
      "verified": true,
      "author": "wbc",
      "helpful_votes": 0,
      "publication_date": 20080727
    },
    {
      "title": "Great simple machine with great picture",
      "text": "I have not used this video recorder extensively yet, but shot various short films to test it. It is so easy to use that I can't think someone did not think of this before. Clearly, not for a professional, but to do some video of home movies, events, etc., is great. The output is in the AVI format and you can bring in the AVI film into Windows Movie Maker and complete a great production. Also, the transference of the film to your computer is real easy - just like plugging a USB thumb drive and then dragging and dropping the film to your desired location. The price also makes it a superb buy. Highly recommended.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim Belmont",
      "helpful_votes": 0,
      "publication_date": 20090905
    },
    {
      "title": "WONDERFUL FOR ENTIRE FAMILY",
      "text": "We have a grandson of 18 months which makes this the idea camera for taking videos and emailing to friends and family. We had earlier purchased another one for our son to send us videos of the family. As of now my sister and niece have them so keeping up with our family as they grow has become so much easier for all of us.Very easy to use. Overall we couldn't be happier and the price range is extremely reasonable.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Caporossi",
      "helpful_votes": 0,
      "publication_date": 20081125
    },
    {
      "title": "Tiny and good quality",
      "text": "I was not sure this small camera would cut it. It's so simpl my 6 year old son could work it without directions. The video quality is very good. Not as good as a $800-$1000 camcorder, but this think goes in your pocket. I think I will use this more than my \"normal\" camcorder. Software loads FROM the Camera. Simple Get one you will love this. 5 Stars for sure. Mark W (NJ)",
      "rating": 5.0,
      "verified": true,
      "author": "Mark w",
      "helpful_votes": 0,
      "publication_date": 20080919
    },
    {
      "title": "This has a great picture and records everything in avi",
      "text": "Bought this refurbished because I needed a decent video camera fairly quickly. This has a great picture and records everything in avi. Computer picked it up quick from plug in and has done ever since.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20141021
    },
    {
      "title": "Easy and simple",
      "text": "This little video camera actually takes better video than I thought It would. Its awesome ! Its so easy to handle . A kid can do it. Its a fun camera, just wish it had more power zoom and I would give it 5 stars . I recommend it for kids and for Adults that don't like fiddeling with a complicated video camera. We went to a Dodger game in L.A. and everyone was having fun with it. I bought two of them. One for my son and one for me. .",
      "rating": 4.0,
      "verified": true,
      "author": "G. Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20090602
    },
    {
      "title": "Love the Convenience",
      "text": "I love the convenience of my Flip Video. It fits in my pocket so I can carry it anywhere. When I'm ready to download my videos, I plug the camera directly into my USB port and click on the prompts that pop up on my screen. I am not a technology geek, so this is the perfect video camera for me. Lucy Adams, author of",
      "rating": 5.0,
      "verified": true,
      "author": "Lucy Adams",
      "helpful_votes": 0,
      "publication_date": 20081119
    },
    {
      "title": "GOOD LITTLE POCKET CAMCORDER",
      "text": "We have had many camcorders in the past, but for size, this one gives fairly good video and it's extremely easy to use. The software that comes with it is easy to install. The two drawbacks are that in low light it's very \"grainy\" and you also have to move very s-lo-w-l-y, or else when viewed back on a tv or when burned onto a DVD, it will almost make you dizzy. For the size though you can't beat it.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Steventon",
      "helpful_votes": 2,
      "publication_date": 20100718
    },
    {
      "title": "Flip Mino college student budget YouTube and video enthusiast",
      "text": "The Flip Mino is an excellent device. I'm an electronic head which alot of times is rare for females. This is the best portable video recording device I've encountered. I carry it with me everyday in my pocket no matter where I'm going and it never fails me when I'm capturing footage. It's so crisp clear and audibly amazing. If you have been looking for a pocket camcorder to capture footage or do vlogs or mess around the flip mino will do the trick and won't break your pockets. So buy one and then tell your friends.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Parker",
      "helpful_votes": 0,
      "publication_date": 20100214
    },
    {
      "title": "Good little portable camcorder",
      "text": "This is a fun little camcorder. Easy to operate. Connecting the camcorder to the computer is a cinch. You can view or do some simple editing on the Flip software. The internal battery is very convenient",
      "rating": 4.0,
      "verified": true,
      "author": "Dang Huynh",
      "helpful_votes": 0,
      "publication_date": 20150410
    },
    {
      "title": "Perfect for New Moms!",
      "text": "I love this video camera! It is small enough to take with me every where I go. It is SO easy to use/requires no skill. We use it almost daily to record all the cute new things our baby does with ease. 60 minutes is actually more than enough recording time. It comes with the software which allows you to freeze for photos, make greeting cards, email videos and more. It is really wonderful. I would recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Roon",
      "helpful_votes": 0,
      "publication_date": 20090120
    },
    {
      "title": "IT ROCKS!",
      "text": "I AM AMAZED HOW LITTLE AND EFFICIENT THE MINO IS AS WELL AS THE EDITING SOFTWARE. IF YOU ARE LOOKING FOR A PRACTICLE MECHANISM TO RECORD VIDEOS FOR YOUTUBE OR EVEN PERSONAL VIDEOS THE SOUND AND PICTURE QUALITY IS AMAZING AND THE PRICE IS EXTREMELY AFFORDABLE. I DO LOOK DISTORTED WHEN I HOLD THE CAMERA CLOSE TO MY FACE B/C I DID NOT BUY THE TRI POD AND I WALK AROUND NYC AND OUTDOORS IN CROWDS SOMETIMES RECORDING MYSELF SO I'M A CHALLENGING SUBJECT FOR THAT REASON HOWEVER THATS NOT A PROBLEM JUST A FACT! BUY IT NOW!!!!!!!!!!!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Tsoukaris",
      "helpful_votes": 0,
      "publication_date": 20090913
    },
    {
      "title": "Works well, hard to handle big files.",
      "text": "This product works as advertised. It is easy to take videos and transfer them to the computer. The battery last along time and you would be surprised with how many videos you can record in one hour. The software also does a good job. However, some times it is had to edit videos that are a few minutes long. It is great to record very short video for YouTube, that is it.",
      "rating": 4.0,
      "verified": true,
      "author": "J. D. Garcia",
      "helpful_votes": 0,
      "publication_date": 20090716
    },
    {
      "title": "Great Mino Flip Video",
      "text": "The Flip Video Mino is great for on the spot capture of events. I have used it in professional and personal settings. I use a Mac and the software downloads to the Mac instantly. Videos are easy to view and edit. It's like the Fisher-Price of video cams...even a kid can use it! If you're a techie you'll love to add to your gadget collection...even if you're tech-phobic, you won't mess up a shot.",
      "rating": 5.0,
      "verified": true,
      "author": "ChiTownSister",
      "helpful_votes": 0,
      "publication_date": 20080813
    },
    {
      "title": "FLIP FLOP",
      "text": "Bought this for my Dad as a birthday present end of September and it stopped working at the end of October. He used it twice. Will not re-set as per customer support. I guess battery lost charge, don't know still waiting on Flip support. Seems like this happens a lot when you Google this problem. It gives no warning...that's it, just stops working.",
      "rating": 1.0,
      "verified": true,
      "author": "Susy",
      "helpful_votes": 0,
      "publication_date": 20091221
    },
    {
      "title": "Perfect for my needs",
      "text": "I have eight months whit the Flip Mino Camcorder and I never have a problem, make great videos and whit good quality maybe not the best but a very good one for the size of this device, I used this camcorder a lot, the life of the battery is good too, and is so easy to manage the videos in the flip library. I highly recommend the Flip.",
      "rating": 5.0,
      "verified": true,
      "author": "Liliazuli",
      "helpful_votes": 0,
      "publication_date": 20090906
    },
    {
      "title": "Flip Mino Fantastic Product",
      "text": "Our family just grew with the birth of twin grandchildren. We were able to take pictures at the hospital and send them to all the relatives with the aid of Flip software. The size makes it easy to slip in my pocket and the pictures are crisp and clear. The sound is great. This will be a regular tag along in all our many future visits. Fantastic!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Patron175",
      "helpful_votes": 0,
      "publication_date": 20081216
    },
    {
      "title": "Fiipping over Flip",
      "text": "What's not to love? Easy to use. The flip software is not the most user friendly, but I don't use it anyway. I just access the DCIM directly from my computer, pulls the video to my desktop and use Windows Movie Maker or Premiere Pro to edit.",
      "rating": 5.0,
      "verified": true,
      "author": "Arthur Wolinsky",
      "helpful_votes": 0,
      "publication_date": 20140627
    },
    {
      "title": "Great Christmas Gift",
      "text": "Bought 4 minos (Amazon had the best price), one for each of my adult children and one for my sister! It keeps us all connected! My sister is retired and RVs so she shares the wide-open spaces as she travels. Nothing beats viewing the grandkids on video almost instantly! I feel pretty smart with my Christmas shopping this year.",
      "rating": 5.0,
      "verified": true,
      "author": "sctxgal",
      "helpful_votes": 0,
      "publication_date": 20081118
    },
    {
      "title": "YOU WANT \"SIMPLE TO USE\" & GOOD",
      "text": "IF YOU WANT A VIDEO CAMERA YOU CAN USE WITHIN MINUTES - \"OUT OF THE BOX\"........THIS IS IT. SOFTWARE IN CAMERA + YOU DON'T NEED CABLES TO HOOK-UP TO YOUR COMPUTER. JUST FLIP OUT THE USB CONNECTION THAT IS PART OF THE CAMERA. EMAIL, SAVE TO COMPUTER EASY. NO FIFTY PAGE MANUEL.....JUST A LITTLE FOLD OUT. ENJOY........I AM.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Wyler",
      "helpful_votes": 0,
      "publication_date": 20090711
    },
    {
      "title": "Flip Mino",
      "text": "We purchased this product as a birthday pary for our daughter who is 9 years old. She has had a lot of fun with it. She takes it with her everywhere she goes because the size is so convenient. It is also easy to charge given that the usb connction is imbedded in the device. For the price, this was a very good buy for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Abbieochoa",
      "helpful_votes": 0,
      "publication_date": 20110720
    },
    {
      "title": "Super easy",
      "text": "Super easy to use. Software could have a nicer interface, but is also very easy. You can also import your footage and edit your own movie editing software (i.e. Windows Movie Maker or iMovie for Mac). You can also pull still images from your footage using the software provided (quality isn't great but can be useful at times). Unlike older Flip cameras, you can charge the battery by just plugging into your USB port on your computer. Slim build and fun to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Laurenica",
      "helpful_votes": 0,
      "publication_date": 20090903
    },
    {
      "title": "Flip Mino",
      "text": "I am so glad to have purchased this product. It is the coolest. I am able to capture small snipets of our life and put it together as a funny collection. I like the mino because it is all in one there are no usb cables to keep track of and there are no batteries, just plug it into my computer for a short while and I'm all ready to go. It's way too cool.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Martin",
      "helpful_votes": 0,
      "publication_date": 20081221
    },
    {
      "title": "Flip over Flip Mino",
      "text": "A cute little camera that makes it easy to catch unposed videos. The software that comes with it also makes it easy to email them. The zoom feature is modest, but better than nothing. It handles the transition from bright to dim light fairly well. If you don't expect Hollywood quality video, this is a great camera.",
      "rating": 5.0,
      "verified": true,
      "author": "NOLA evacuee",
      "helpful_votes": 0,
      "publication_date": 20080915
    },
    {
      "title": "Fabulous little camcorder",
      "text": "This thing is AMAZING!! Anyone can use it; my 5 year old daughter picked it up and immediately just started using it. There is nothing difficult about this camcorder. I really like the still picture feature from the movies you take and if you have a bunch of short clips, you can make them into one longer clip and there is a great editing feature. It's fun to play with and inexpensive. I would recommend this to anyone that is more of a casual picture taker/home-movie maker.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Sullivan",
      "helpful_votes": 0,
      "publication_date": 20091130
    },
    {
      "title": "I love Flip!",
      "text": "I have an Ultra HD as well as a Mino HD and they both work really well. The video quality is great if you have good lighting (this camera doesn't work in low light). The sound is decent too. A great camera for capturing everyday life.",
      "rating": 4.0,
      "verified": true,
      "author": "BeforeDarknessFalls",
      "helpful_votes": 0,
      "publication_date": 20130424
    },
    {
      "title": "Great for on the go!",
      "text": "This is a good little video camera for carrying around everywhere you go for spur of the moment filming. Its very easy to use. The only problem I have with it is that it didnt work in windows movie maker at first but there are ways around that if you search the internet. Otherwise, its great!!",
      "rating": 4.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 0,
      "publication_date": 20120103
    },
    {
      "title": "FLIP MINO",
      "text": "This is one the best toys I have bought since my iPod Touch. Considering the size, the quality is amazingly good. Do not try and compare it with a camcorder because this is not what it's for. The Mino is so easy to use and it can edit and add disolves/fades and even a music track at the mere click of the self edit tab. Only one reservation, my view finder malfunctioned after only ten days. I am awaiting a replacement from Amazon. I only hope that I had a Friday or Monday mocdel and my fault is an exception. Apart from this glitch...Buy with confidence and have a ball!",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20080720
    },
    {
      "title": "First Impressions",
      "text": "I just got this product... Delivery was amazingly fast, by the way! It's *tiny*, and that was exactly what I wanted... And it works out of the box... So simple & easy to use, a triumph of design and execution. I have not done any editing yet -I'm looking forward to giving that a try! My first impressions are very positive!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Maverick",
      "helpful_votes": 0,
      "publication_date": 20080913
    },
    {
      "title": "Flip Mino",
      "text": "My Flip Mino is a great little videocam with very good picture and sound quality. My main problem is that it's difficult to play back my videos on the device. The \"play\" button is tricky and takes alot of pressing and minipulation to get the playback to work. I have no problem sending videos to my computer although I am not able to compress them for email. There is a program that can be downloaded from Flip that may help but I haven't used it yet. All in all, for the price and portability, it's a good camera to have.",
      "rating": 3.0,
      "verified": true,
      "author": "Lee Chapman",
      "helpful_votes": 2,
      "publication_date": 20091127
    },
    {
      "title": "video cam",
      "text": "I found this product reviewed in a magazine and did some further research. I found the best price on Amazon and purchased it. It has lived up to its billing. Very handy, versatile, easy to download, and takes good footage of all the activities I want to capture on film.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Lee ONeill",
      "helpful_votes": 0,
      "publication_date": 20080814
    },
    {
      "title": "Flip Mino video recorder",
      "text": "Don't be without one! Easy to carry and use. This is one grandma who got to see a grandson's first steps soon after, from across the country. Video posts easily on facebook, and probably other networks as well. Video and audio quality is quite good. Up to 60 minutes of video. You can't pause the recording, so you get separate clips, but for keeping up with family and events, it's great!",
      "rating": 5.0,
      "verified": true,
      "author": "Grandma23boys",
      "helpful_votes": 0,
      "publication_date": 20081030
    },
    {
      "title": "Flip Mino Camcorder",
      "text": "I am very guilty of not reading manuals when I buy gadgets like this. So, when my cousin told me that the Flip Mino came with minimal instructions, I thought, \"I have to get THAT.\" I bought it for my husband for Christmas, and all though we haven't used it as much as I thought we would, it is definitely very easy to use and very compact. The instruction guide was this small pamphlet, and I didn't even need to read it -- the Flip Mino is pretty self-explanatory. Press one button to record, then press it to pause. Press another button to zoom in/out. And press another button to turn it off. That's all we need!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate C.",
      "helpful_votes": 0,
      "publication_date": 20100118
    },
    {
      "title": "Flip Mino - small and simple",
      "text": "I purchased the Flip Mino to take videos at sporting events and concerts. Easy to take anywhere since it is the same size as a cellphone. It's simple to use, simple to upload videos with the Flip software, and charges while plugged into computer, although an A/C charger came with it. Video quality was better than expected from such a small device. Software makes it very easy to upload YouTube videos.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Jimbo",
      "helpful_votes": 0,
      "publication_date": 20091014
    },
    {
      "title": "Very Impressed.",
      "text": "If your looking for a inexpensive pocket sized video camera this is it. I have tried others in this class but the Flip is by far the best. Video quality and sound are very good for a unit this small. Low light conditions are acceptable but over all its a winner.",
      "rating": 5.0,
      "verified": true,
      "author": "Goldie",
      "helpful_votes": 0,
      "publication_date": 20080729
    },
    {
      "title": "Video Quality",
      "text": "Product is very nice for what it is advertised for. This camcorder records good video and audio up close. Definitely would recommend for casual use. Family parties, get togethers, etc. Not good for use in a more professional setting. This product is also extremely easy to use. Video is clear due to the light weight of the unit. Perfect for carrying around in your pocket for use on spur of the moment occasions.",
      "rating": 3.0,
      "verified": true,
      "author": "tsterrym",
      "helpful_votes": 0,
      "publication_date": 20080804
    },
    {
      "title": "Have been using it for 6 months, still love it",
      "text": "It's great! Size is perfect, same as a cell phone. Fits in pocket. Easy to use. USB connect to charge and transfer, no wires needed. Hooks straight up to my Samsung 50\" plasma for instant viewing. Want simplisity w/ quality, here ya go.",
      "rating": 5.0,
      "verified": true,
      "author": "SJM",
      "helpful_votes": 0,
      "publication_date": 20090131
    },
    {
      "title": "Great for those who are looking for easy",
      "text": "This little camcorder is so easy to use and the picture are really good. It downloads the videos quickly and its so easy to send the video to friends or family. I would recommend this to anyone who doesn't want to get a degree to use a camcorder. Just point and start recording.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Brazier",
      "helpful_votes": 0,
      "publication_date": 20081228
    },
    {
      "title": "A Great Purchase",
      "text": "It's simple to use and the videos are crystal clear.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Blount",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "Great product",
      "text": "This was a Christmas present to our daughter and her family - they requested this product after careful research and know they are happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo Eco",
      "helpful_votes": 0,
      "publication_date": 20130905
    },
    {
      "title": "Unreliable hardware",
      "text": "I bought in July 2009, and it died in Jan 2010. Even after trying to reset via a paperclip through the tripod connection, it won't power-on. Very annoying because I had travel videos on it. I liked it when it worked through.",
      "rating": 2.0,
      "verified": true,
      "author": "A. Webb",
      "helpful_votes": 0,
      "publication_date": 20100124
    },
    {
      "title": "Great little camera!",
      "text": "This video camera is easy to use, extremely easy to move around, and has pretty good video quality. My husband bought this for youtube videos and it works great! I have had some fun with it, making random videos, it's so easy to use! We have not used to software it comes with, we haven't even tried it, but I would definitely recommend this for anyone wanting a decent camera that is affordable!",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany Rose",
      "helpful_votes": 0,
      "publication_date": 20091228
    },
    {
      "title": "Really good product -- times change though.",
      "text": "It's really cool to review a product that isn't made anymore. But for what it's worth, the Flip cameras were great while they lasted -- I'm still using mine!",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20140804
    },
    {
      "title": "One Star",
      "text": "Bad picture, barely works and a total piece of crap.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20160227
    },
    {
      "title": "Love it!",
      "text": "Great Price for what I need. 1/3 of what I was going to originally spend and this goes everywhere with me. Just need wider pockets for this and my cell phone in the same pocket! Great software too! I didn't really have to mess with it too much to steal some stills out of the video I took.",
      "rating": 5.0,
      "verified": true,
      "author": "John A. Wells",
      "helpful_votes": 0,
      "publication_date": 20090429
    },
    {
      "title": "Great little recording cam.",
      "text": "We have gotten many hours of enjoyment from this handy little thing.",
      "rating": 5.0,
      "verified": true,
      "author": "frenchy",
      "helpful_votes": 0,
      "publication_date": 20150206
    },
    {
      "title": "Great product",
      "text": "I purchased this video camera in order to capture my grandson's cutest moments. It is very easy to use and so compact that I can take it everywhere. Saving the video's to my computer is a no-brainer. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy  Atkinson",
      "helpful_votes": 0,
      "publication_date": 20080804
    },
    {
      "title": "Easy performance in a small package.",
      "text": "This camcorder is easy to use and the clarity is fine for home videos and blogs. If you're looking for super high-def, look elsewhere. But if convenience and ease of use is what you're after, search no further.",
      "rating": 5.0,
      "verified": true,
      "author": "bluehouse",
      "helpful_votes": 0,
      "publication_date": 20080910
    },
    {
      "title": "Perfect replacement for my old Canon Mini-DV",
      "text": "I just got my Flip Mino and love it. It's perfect for my purse and no tapes to hassle with!!! I was a bit concerned when I saw the size of the playback, but then when I downloaded onto the computer, the quality is really good. Seems better than my clunky canon ZRMC-300. I know I'll be taking more video because of the small form factor of this device.",
      "rating": 5.0,
      "verified": true,
      "author": "dawgsnjets",
      "helpful_votes": 0,
      "publication_date": 20080725
    },
    {
      "title": "So fun and easy to use!",
      "text": "We bought this for our 8 yr old son and he has had the best time with it. It takes great video, the picture and sound are awesome. It can plug right into the tv to watch and charging it on the computer is so easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate S",
      "helpful_votes": 0,
      "publication_date": 20090519
    },
    {
      "title": "Wonderful",
      "text": "This very small camcorder is easily carried in a shirt pocket and makes great videos. The pictures are clear and the sound is excellent. My husband took videos of my 93 year old Mom and I talking and we were not even aware he was taking them.",
      "rating": 5.0,
      "verified": true,
      "author": "barb29123",
      "helpful_votes": 0,
      "publication_date": 20080825
    },
    {
      "title": "I love this little camera!",
      "text": "I am not a camera buff but this little video camera, right out of the box, is so much fun! You almost don't even have to read the instruction pamphlet it is so simple. You just turn it on and push the record button. All you do to put the videos on the computer is plug it into the USB port and it's right there to do whatever with. This is such an easy camera and I love it. Good size to carry with you. It has a nice clear picture and good sound.",
      "rating": 5.0,
      "verified": true,
      "author": "S. L. Burrell",
      "helpful_votes": 0,
      "publication_date": 20080930
    },
    {
      "title": "Flip Mino",
      "text": "So small and handy--I keep this in my purse. You will want to buy a case if you do this. Easy to download videos and post online. Quality isn't professional, so you will still want to use your real video camera for important events. Captures sound quite well and has a bit of zoom capability--not alot. Battery life is good.",
      "rating": 4.0,
      "verified": true,
      "author": "Junella",
      "helpful_votes": 0,
      "publication_date": 20090728
    },
    {
      "title": "Extraordinary - Flip Mino",
      "text": "I have purchased so many gadgets overtime and never wrote a review. This product is extraordinary! Fun, simple, easy to use. Incredible video clarity. The program it comes with has so many features. I printed photos from the videos. You can edit any video you make. Magical! Well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "PB",
      "helpful_votes": 0,
      "publication_date": 20080724
    },
    {
      "title": "1st Camcorder. Last Camcorder",
      "text": "I will say this, i am fully satisifed with this camcorder, it is the 1st mini camcorder that i ever owned, and am having a blast, definetely a must have. Put it on your list to Santa.",
      "rating": 5.0,
      "verified": true,
      "author": "R.C.",
      "helpful_votes": 2,
      "publication_date": 20091016
    },
    {
      "title": "love it!",
      "text": "sure its small and flimsy. but it's super easy to use, and does exactly what it's supposed to do. i know some people claim to have problems using it on their MACs but we havent had any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "upso",
      "helpful_votes": 0,
      "publication_date": 20081013
    },
    {
      "title": "Easy and convenient to use!",
      "text": "I bought this for my husband and it is great for catching quick moments of your kids, etc. I like it myself because it doesn't have a bunch of confusing buttons (I'm technology challenged with these types of things) and is easy to take on the go. I will say that it is better to use a traditional style video camera for occasions such as your child's Christmas play, etc. It does not have a zoom or focus so it is strictly meant to do some quick and simple stuff. I do love it and highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "j.s.",
      "helpful_votes": 0,
      "publication_date": 20100127
    },
    {
      "title": "Flip Mino",
      "text": "I'm pleased with this camera. Easy to use. Video quality is not as good as a couple of other cameras I have but it is good enough. My only regret is I didn't wait for the HD model. But then again most of the electronic gadjetry I've bought is quickly obsolete and if one waits for the next improvement forever one never buys anything.",
      "rating": 5.0,
      "verified": true,
      "author": "R. L. Leonard",
      "helpful_votes": 0,
      "publication_date": 20091006
    },
    {
      "title": "First timer",
      "text": "This is my first video camera. It's great. It's compact. Easy to use. Can email video. I carry it in my pocket and use it whenever, I see something I would like to make a record of.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr. Joe",
      "helpful_votes": 0,
      "publication_date": 20080824
    },
    {
      "title": "Flip Mino",
      "text": "This is a Great, Fun Camera. Perfect size to take with you anywhere for those spontaneous moments you would like to capture. Easy to use for everyone. The battery lasts and transferring the videos to our MAC is simple. I recommend this product to everyone. We have had a Blast with the camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesaa5",
      "helpful_votes": 0,
      "publication_date": 20080909
    },
    {
      "title": "Perfect for my purpose",
      "text": "Simple, compact, convenient. I bought this for my wife to take video of our 2 year old son. She loves that she can throw it in her purse, and then easily upload the videos to youtube or facebook. We like the fact that it charges when we plug it into the computer to upload video, so we don't have to worry about carrying batteries along.",
      "rating": 5.0,
      "verified": true,
      "author": "hondo305",
      "helpful_votes": 0,
      "publication_date": 20110515
    },
    {
      "title": "Great Little Video Camera...even when I paid full price",
      "text": "The Mino Flip is a great little video camera. I bought it when it first came out, and even though I paid $180, I have really enjoyed the Flip. Though video quality is FAR, FAR from HD (they now have an HD version), it is as easy to use as can be. It can be stored in pants pocket and video taken is easily transferred to any computer.",
      "rating": 4.0,
      "verified": true,
      "author": "Allen Lew",
      "helpful_votes": 0,
      "publication_date": 20081223
    },
    {
      "title": "SD Resolution Optimized for Sharing!",
      "text": "This FLIP MINO camera provides the ideal \"SD\" video resolution that's for me,... provides the OPTIMUM STREAMING size,.... USEFUL FEATURES ideal for SHARING VIA eMAI,... UPLOADING \"quickly\" to YOUTUBE, and providing a PICTURE QUALITY that is OPTIMUM when compare to a Cell Phone video. I do use \"HD\" format cameras that are for planned & special purposed recording or HDTV playback, but is NOT USED FOR UNSCHEDULED' Point & Shoot circumstances/events!",
      "rating": 5.0,
      "verified": true,
      "author": "Concept",
      "helpful_votes": 0,
      "publication_date": 20110720
    },
    {
      "title": "Flip For Flip",
      "text": "Purchased 3rd. Flip...the non HD Mino... the best thing about all the Flip cameras is the software...movies with my own music, editing, and still pictures...I use my Ultra for underwater video...I do not recommend HD as you have to step back away from subject, was not able to use with older computer due to amount of memory with HD, and subject not as bright as compared with plain Mino...I do not need 120 minutes as I download day by day...",
      "rating": 5.0,
      "verified": true,
      "author": "Mack Jacobs",
      "helpful_votes": 2,
      "publication_date": 20100514
    },
    {
      "title": "Flip Mino Camcorder, 60 Minutes",
      "text": "This camera is perfect for my 11 year old son. It's so small he can put it in his pocket and take it with him everywhere. It's very simple to use and the flip USB is great. No more searching for the write connection cord.I wish it had a bigger viewing screen and more zoom, which is only x2. Amazon had the best price. I paid $129. Other stores were selling it for $199.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Phinney",
      "helpful_votes": 0,
      "publication_date": 20090926
    },
    {
      "title": "Lots of fun",
      "text": "Nice product, pretty much idiot proof, good quality video. Would definitely buy it again/recommend it to friends/family. 2 things I'm not crazy about, but neither are showstoppers: 1) the controls on the back (for zoom, etc), are not as responsive as I would like, HOWEVER, I just got it yesterday, and I might get used to it and decide it's just fine 2) when I plugged it in, it did NOT put an icon for the software on my desktop as the instructions implied it would. I had to find the device in windows explorer and double click on \"Flip Video for PC.exe\" to run the software.",
      "rating": 4.0,
      "verified": true,
      "author": "Daevidius",
      "helpful_votes": 2,
      "publication_date": 20080618
    },
    {
      "title": "Small and Easy to use",
      "text": "I purchased this Flip mini camcorder for my brother in law for Christmas and he loves it. The small size suits his lifestyle, and he has been using it as soon as he received it. I can't wait to get one for myself. He \"flipped\" out and just marveled at the sleek design, and ease of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcella G. Rieser",
      "helpful_votes": 0,
      "publication_date": 20090111
    },
    {
      "title": "Flip Mino Camcorder",
      "text": "I opened the package, read the instructions, and used the enclosed AC adapter to charge the camcorder. The green light on the adapter shower green (it was working) and the LED blinking light on the USB arm was blinking indicating it was charging. The instructions indicated the charge should take 2 hours and it was fully charged when the blinking led stopped. 24 Hours later the LED was still blinking indicating it was still charging. I removed the Flip from the charger and checked the battery indicator and it had not charged at all. I returned the unit to Amazon for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert A. Neitzke",
      "helpful_votes": 0,
      "publication_date": 20091111
    },
    {
      "title": "Flip Mino",
      "text": "This camcorder is the smallest one I have found. I take it everywhere. It fits in my jeans pocket and my small purses. The video quality is great. Plus it is very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Hare",
      "helpful_votes": 0,
      "publication_date": 20100205
    },
    {
      "title": "Works as expected",
      "text": "Haven't used it much yet. Size is small. Fits in my already packed pocket. Simple to use. Software seems to work well on my Macintosh running Leopard. Video quality good. Wish it had a mute button to not record sound. Easy to capture a single frame as a jpg photo.",
      "rating": 4.0,
      "verified": true,
      "author": "BackupGeek",
      "helpful_votes": 0,
      "publication_date": 20080618
    },
    {
      "title": "Flip Video Camera",
      "text": "I have had mine for a while and I love it. The ease of using it and then transferring the pictures to the Internet is great. I have used it to make advertisements for autos I was selling on the Internet and they turn out great. It is great for family albums, etc. also.",
      "rating": 5.0,
      "verified": true,
      "author": "tara",
      "helpful_votes": 0,
      "publication_date": 20130423
    },
    {
      "title": "It stopped working after about a month and a half",
      "text": "We loved the little camcorder and it worked great for about a month and a half. Then my husband plugged it into the computer yesterday and it was not recognized nor did it charge. Completely dead. Luckily we had uploaded what was on there before the crash. Since others have had similar problems I would hesitate to order unless you got an extended return policy and even then, maybe just look for something else...",
      "rating": 1.0,
      "verified": true,
      "author": "Paige Kramer",
      "helpful_votes": 17,
      "publication_date": 20080827
    },
    {
      "title": "Great little product",
      "text": "This is a great little camera. Obviously some features are somewhat limited, like to zoom and telephoto lens, but what do you expect for the price. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "SteveW",
      "helpful_votes": 0,
      "publication_date": 20080920
    },
    {
      "title": "NOT FOR LIVE MUSIC!!!",
      "text": "If you are looking to record your band live, don't buy this! The *compression is so sensitive and really isn't as they describe. The Mino is great as a toy and is super easy to use. I like the user-friendly aspect of it, excellent and simple. *The volume levels will change drastically when recording live music due to the utra sensitive compression. UPDATE: Darn thing broke just after the warranty expired!!! Could have been from heating up in the sun, had it on a tripod for 45 minutes. My bad? Hmm?",
      "rating": 3.0,
      "verified": true,
      "author": "Noodle Mantonio",
      "helpful_votes": 2,
      "publication_date": 20080930
    },
    {
      "title": "Fantastic Mino Series Camcorder",
      "text": "This is the COOLEST electronic device that I have purchased in a long time. (and I buy lots) I keep it in my purse. It's perfect for pets and children because they don't usually notice they are being recorded. We have a new puppy and have some great videos of his training and playing. Beats the heck out of the old larger video camera we used for our children.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn A. Waters",
      "helpful_votes": 0,
      "publication_date": 20091023
    },
    {
      "title": "Very easy to use",
      "text": "This product along with the software make it very easy to use. You can edit , make movies and post them to the internet or send and email in seconds. The size of it (the same size as my LG Rumour cell phone) makes it simple to just put in your pocket and not have a bulge. Even my 8 year old can run it. And since it plugs directly into the computer you do not have to have extra cables.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Bargas",
      "helpful_votes": 0,
      "publication_date": 20100109
    },
    {
      "title": "Great Gift",
      "text": "Can't comment on the quality or ease of use of the product since it was purchased as a birthday gift, but let me tell you, it made a great gift and the recipient was ecstatic about receiving it. If it's as good a product as it was a gift, it's the real deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Shaw Lynn Preeste",
      "helpful_votes": 0,
      "publication_date": 20080706
    }
  ],
  "product_meta": {
    "title": "Flip Mino Video Camera - White, 2 GB, 1 Hour (1st Generation)",
    "description": "Color:White| Style:w/out AdapterFROM THE MANUFACTURER\n\n\nFlip Mino: The Power of Self Expression \n\nFlip Mino provides you the power of self-expression, enabling you to shoot and share your stories with the world. \n\n\n\n\nMino Overview:\n\n *  Super-slim Mino is the sleekest camcorder you can get \n *  Super-simple user interface features one-touch recording and digital zoom \n *  Holds 60 minutes of full-VGA-quality video on 2GB of built-in memory; no tapes or additional memory cards required \n *  Convenient flip-out USB arm plugs directly into your computer to launch built-in FlipShare software \n *  Built-in FlipShareTM software lets you easily email videos, edit individual clips, make custom movies, capture still photos from video, and even upload video to sharing sites like YouTube and MySpace \n *  FlipShare’s advanced compression technology allows for quick and easy sharing of high-quality video in compact-sized files (via email or publishing online) \n *  Internal Li-ion battery recharges through built-in USB arm while you’re plugged into your computer \n *  Produces incredible, full-VGA-quality videos that look crisp and clear when played back on a TV (TV connector cable included) \n *  Features a flat-back panel with touch-sensitive backlit buttons \n *  Instant playback, pause, fast forward, rewind, zoom, and delete functions \n\n\n\n\n\n\nSleek, Simple, & Portable\nThe super-simple, super-portable Flip Mino makes it easy to capture and share high-quality video anywhere and everywhere. Mino weighs only 3.3 ounces and features a sleek, pocket-sized design, allowing you to take it with you everywhere you go. Mino also boasts a rechargeable battery that powers up automatically while plugged into your computer. And while Mino is 40 percent smaller than its already-pocket-sized brother, the Flip Ultra, it’s got all the Flip Video features--simple user interface, one-touch recording, flip-out USB arm, built-in editing and sharing software, instant uploads to YouTube and MySpace--that folks have come to know and love. \n\nClick here for an interactive tour\n\n\n\n\nThe Power of Video in Your Pocket \nFlip Mino puts the power of video in your pocket. Weighing just over 3 ounces and featuring a super-slim, super-sleek design, Mino barely makes a dent in even the tightest of jeans. Mino’s small size is complemented by an interface that’s incredibly easy to use. Simply power on and press record--you’ll be capturing video in seconds. With a camcorder this small and sleek, there's no limit to where you can take it and what you'll end up shooting. Whether you’re creating a short film to enter in your favorite festival or just capturing footage of a hot new band, Mino makes it easy because it's always with you and always ready to go. \n\nIncredible Quality \nWhile small in size, Flip Mino produces video that is unbelievably high in quality. Its 2 GB of on-board flash memory records up to 60 minutes of full-VGA-quality video that looks sharp when played back on your laptop or television (TV cable included). The built-in microphone captures crisp, detailed audio, whether you're paddling down the Amazon or rockin' out at your favorite club. When it’s time to edit or share videos from your latest excursion, flip out the USB arm and connect to any Mac or PC to launch the built-in FlipShare software. \n\n\nClick here to learn more about FlipShare software\n\n\n\nBuilt-in FlipShare Software\nMino comes pre-loaded withFlipShare software, which makes it easy to organize, create and share your videos:  * Organize your videos. Drag and drop your videos into folders you've created, or use the automatic date-stamped folders. \n   \n * Create custom movies. Make movies featuring your favorite video clips, and add your own music to provide a more personal touch.\n * Capture still-image snapshots. Use enhanced freeze-frame capabilities to grab a snapshot from any of the thirty frames that comprise each second of your video.\n * Share privately. Send videos to your friends and family using attachment-free emails. Or create private Flip Channels to share your videos with specific groups of friends and family.\n * Share with the world. Publish your videos directly to Facebook, YouTube and other sites, all with the click of a button. \n\n\nRecommended Companion Products and Accessories: Flip Video Power Adapter\n\n\nThis compact adapter's USB port connects to your Flip camcorder's USB arm. FlipShare TV\n\n\nFlipShare TV offers the ultimate home movie experience by making it easy to watch your entire Flip Video library wirelessly on your TV or HDTV.\nFlip Video Tripod\n\n\nThe tripod screws into your Flip, and flexible legs let you take steady video almost anywhere. Flip Video USB Cables\n\n\nConnect your Flip camcorder to any computer, even those with hard-to-reach USB ports. \nWhat's in the box:  * Flip Mino Camcorder, with built-in FlipShare software \n * TV connector cable \n * Wrist strap \n * Soft carrying case \n * Quick start guide \n * Warranty \n * Product registration",
    "rating": 3.8,
    "feature_bullets": [
      "Pocket-sized camcorder; Flat back panel with touch-sensitive buttons; 1.5-inch color LCD screen",
      "2 GB of on-board flash memory--records up to 60 minutes of video; 2x digital zoom",
      "Internal Lithium-ion battery recharges when built-in USB arm is connected to a computer",
      "Connects to TV for instant viewing",
      "Built-in software lets you easily edit video files and upload them to video sharing sites"
    ],
    "specifications": {
      "Product Dimensions": "0.63 x 1.97 x 3.94 inches",
      "Item Weight": "3.32 ounces",
      "ASIN": "B0016BVKAQ",
      "Item model number": "F360W",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "3.8 out of 5 stars555 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#204,299 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 3, 2008",
      "Manufacturer": "Flip Video"
    },
    "categories": [
      "Camcorders",
      "Electronics",
      "Camera & Photo",
      "Video"
    ],
    "price": ""
  }
}