{
  "website_summaries": [
    {
      "verdict": "Despite its uninspired software, the Microsoft LifeCam VX-5000 proves its worth with outstanding image quality, a funky and useful design, and low price.",
      "pros": [
        "Excellent image quality, especially in low light",
        "flexible rubber stand provides a stable and versatile base"
      ],
      "cons": [
        "LifeCam application is lackluster",
        "not compatible with Macs"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 6.0,
        "Performance": 9.0
      },
      "publication_date": 20080514,
      "rating": 8.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Super Cam, Get It",
      "text": "Purchased this web cam (my first) to use with on-line chat. Picture quality is outstanding, zoom is awesome. Like the bendable foot which allows for different angles of mounting. Resolution adjusts for best picture and life-like colors and skin tones. Much better than built-in cam on a friend's Toshiba lap top. Microphone is unbelievable. I am 1/4 mile away from railroad tracks and train horn is clearly audible to person receiving my broadcast. One small complaint is that owner's manual could be more complete. Installation tip: turn off all automatic virus/malware/etc software during installation. After, cam works fine with these programs on. A definite winner, buy this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20110530
    },
    {
      "title": "Great Mic",
      "text": "Okay so this isn't the BEST quality, but man I've had this thing for YEARS and let me tell you. It just RECENTLY crapped out on me and man it has been a good webcam/mic since I accidentally bought it while drunk 5 years ago. RIP little bro.",
      "rating": 5.0,
      "verified": true,
      "author": "Katelyn Wilson",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "Okay",
      "text": "This is a decent webcam. It comes with lots of fun features like little cartoons you can add to your video or cool distortions. The problems are that whenever I turn off my lappie or unplug the camera, the camera is no longer recognized on my lappie until I restart it. It also just stops working in the middle of a video call. I'm not sure if it's just getting old, but I really don't use it that much so it's frustrating and disappointing. The final thing is that it is an MSN camera, and any time you adjust the camera you have to be careful because there's a button on top that initiates MSN webchat.",
      "rating": 3.0,
      "verified": true,
      "author": "Andream",
      "helpful_votes": 0,
      "publication_date": 20090530
    },
    {
      "title": "great webcam",
      "text": "This has been the best webcam I have ever owned.It is so lightweight,very strong and durable,long cord for moving around,and clear as ever.The options with this camera are numerous but easy to use and it comes with a special effects set that is hilarious.I love the bendable sturdy grip on the back for setting onto your laptop or whatever you want to set it on.If you want a very clear,high pixel webcam,get this one.Just plug it in,load the disk and that's all it takes.",
      "rating": 5.0,
      "verified": true,
      "author": "Navyservant50",
      "helpful_votes": 0,
      "publication_date": 20140414
    },
    {
      "title": "Unreasonably long setup, but does what it says on the box",
      "text": "Set aside a decent amount of time to get started with this camera, as installing the software took nearly an hour on a reasonably fast computer. The installer doesn't give any time estimates, and the progress meter fills up and resets probably a dozen times during the course of the installation, so you have no idea how far in you actually are. Once installed, though, the camera and software seem reasonably simple. Press the button on top of the camera and it launches MSN Messenger and asks you which of your contacts with whom you'd like to initiate a video chat. Quick and easy.",
      "rating": 3.0,
      "verified": true,
      "author": "Ben O.",
      "helpful_votes": 0,
      "publication_date": 20090322
    },
    {
      "title": "For the Price this is a Great Webcam!",
      "text": "I have been using this webcam for a few weeks now. I can really say that this is the best webcam for the value that I have used and come across. The picture quality is good. It was easy to install on a Windows based PC. Windows instantly recognizes it as soon as you plug in the USB and generates Windows Lifecam software. I might be asking for too much, but it would be cool if it came with a better interface software to do more with it. I would recommend this webcam to anyone on any budget. I can't give it a complete 5 star rating, but 4 stars is not too shabby.",
      "rating": 4.0,
      "verified": true,
      "author": "AC. Chabre",
      "helpful_votes": 0,
      "publication_date": 20110812
    },
    {
      "title": "Microsoft LifeCam",
      "text": "I bought this camera to use with Skype and it was pretty hard to get us all together where we could see each other at first and when we did, the picture quality on their end was horrible, but I saw them pretty clearly. The price is right with this camera, but they spent $20 more and got a much better camera. This one is hard to attach to the back of a flat screen and had to be duct taped on. Because I don't use mine often except to say hi to the grandparents I probably won't upgrade really soon, but if you want a really good camera, spend a couple extra dollars.",
      "rating": 3.0,
      "verified": true,
      "author": "L. Petersen",
      "helpful_votes": 0,
      "publication_date": 20100302
    },
    {
      "title": "Good Budget Webcam",
      "text": "For the price, this webcam is a good solution for basic webcam video chatting. It worked for me using skype, msn, and aim messenger. Works best with MSN messenger in my opinion. The video it produced was smooth without any hiccups using a Pentium D (dual-core) cpu, and 756K DSL connection. The quality wasn't clear as a 720p camera could produce, but it was still exceptional. The audio is also clear, and cancels out most background noise. Recommended for people on budgets. Don't get this if you want HD quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan N.",
      "helpful_votes": 0,
      "publication_date": 20110419
    },
    {
      "title": "Great for the 99th percentile",
      "text": "It does what I need it to do. I had some time with a VX3000 and this is heads and shoulders above that unit. The microphone doesn't cry for mercy when it gets loud and the picture quality is significantly better. Under low light conditions the vx3000 wouldn't even try. This one performs admirably. You're not going to make professional videos with this but for the 30 dollar price point you really cannot go wrong. Say what you want about Microsoft's business practices but their hardware offerings are usually quite solid. This is no exception. Buy with confidence!",
      "rating": 5.0,
      "verified": true,
      "author": "Lawrence Wang",
      "helpful_votes": 0,
      "publication_date": 20091030
    },
    {
      "title": "Good value",
      "text": "Installation was easy, though it does put a few unwanted extra's on the PC. Picture quality and sound are good for a low-er end camera. The flexible base works surprisingly well. I don't know why they bother to make them in colors as the blue one I have is almost entirely black. I experieinced no conflicts with Win XP and a basic test on Win 7 also went well. Not recommended for those who desire high quality images but good for average use. I use it primarily with motion detection software for security/home monitoring and have no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheff Jeff",
      "helpful_votes": 0,
      "publication_date": 20091021
    },
    {
      "title": "There are better choices",
      "text": "Mediocre resolution. Was required to buy this specific model for a part-time job, but the Microsoft LifeCam HD-5000 that we also have works much better.",
      "rating": 3.0,
      "verified": true,
      "author": "StratMan",
      "helpful_votes": 0,
      "publication_date": 20170903
    },
    {
      "title": "Worked for a while...",
      "text": "I bought this webcam over a year ago to Skype with my boyfriend in the military. I've had a few problems with it... 1) right out of the box, the snapshot/\"picture\" button on it didn't work. 2) it can be difficult to mount on top of a typical laptop. And 3) after about 5-6 months of use, I can't use it for more than 5 minutes before it flips the picture upside down and turns it green. Not sure if something inside is broken, but if that's the case, then it is a flimsy piece of crap camera. I expected better from Microsoft.",
      "rating": 2.0,
      "verified": true,
      "author": "Natalie",
      "helpful_votes": 0,
      "publication_date": 20111021
    },
    {
      "title": "For the price it's good",
      "text": "I just received this yesterday and tested it right away (well, almost right away, after downloding and installing it to my laptop for 20~30 minutes) I thought because of the reviews, I thought the picture quality would be very grainy and blurred but it's not. It's not HD or even your 8~10 megapixel camera quality but it's pretty clear enough for me. It will be mainly used for video conference with family. It's definitely worth what I paid for and glad that I got this and would recomment to friends and family who want something practical.",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy",
      "helpful_votes": 0,
      "publication_date": 20090110
    },
    {
      "title": "Great cam but....",
      "text": "Works perfectly w/ windows 7 (64bit). Great picture quality even in low light conditions. Would've given 5 stars all around if it weren't for the bloatware. If you want all the functionality of the cam you will have to install the software that comes with it which includes MS I.M. , Windows Live, etc etc. If you want a cam to just use with Skype like I did then just plug it in and let windows download the drivers for it. Bottomline, good value ($34), great picture/video, good sound, looks good, but no extra features unless you install all the bloatware.",
      "rating": 4.0,
      "verified": true,
      "author": "Mando",
      "helpful_votes": 0,
      "publication_date": 20100214
    },
    {
      "title": "Works ok, typical Msoft bug",
      "text": "Received the cam in a timely fashion. Installation was painless. We've been using it to webcam with family (grandma/grandpa) the video quality is ok for that purpose, the colors are a little off, our biggest gripe, is the Camera's microphone doesnt work. I don't know if its a camera problem or a software problem.... but everything Microsoft always seems to have some sorta bug which takes hours to figure out... overall it gets the job done... we just cam and use our landline speaker phone to talk...",
      "rating": 4.0,
      "verified": true,
      "author": "Jimbob1971",
      "helpful_votes": 0,
      "publication_date": 20091112
    },
    {
      "title": "Decent product",
      "text": "Use this to chat on skype and on other messengers. Works well. One problem is that it is difficult to mount it in the screen. There is not clips or anything just a small ledge kind of thing to support it. As such you wont be able to turn it at any angle and will only face straight ahead. Came with a CD and can create funny images by turning you into a bunny and that sort of thing. worked well as it was able to recognize my face and follow it as I moved around.",
      "rating": 3.0,
      "verified": true,
      "author": "Chanchal",
      "helpful_votes": 0,
      "publication_date": 20130101
    },
    {
      "title": "Good enough",
      "text": "I bought this camera for my wife's family who lives in another state. I purchased this webcam because it appeared pretty straight forward and simple to install and use. The quality of the camera is good. On occasion the sound will lag on their side yet I am not sure if this is due to connectivity issues, software issues, or hardware issues. Overall, I'll give this webcam four stars.",
      "rating": 4.0,
      "verified": true,
      "author": "onemanwolfpack",
      "helpful_votes": 0,
      "publication_date": 20140304
    },
    {
      "title": "Microsoft LifeCam VX-5000 review",
      "text": "I ordered the LifeCam through Amazon. It arrived in a timely manner and was easy to install. The video cam is good quality. However, there is a difficulty of making a Skype video call. My computer continues to want to connect with \"Conexant 2388x video capture\" and I have to go into tools, options, video settings, and select Microsoft LifeCam Vx-5000 every time I want to have a video conversation... Very annoying. How do I get rid of Conexant and default to Microsoft? HELP!",
      "rating": 4.0,
      "verified": true,
      "author": "R. Patterson",
      "helpful_votes": 0,
      "publication_date": 20090910
    },
    {
      "title": "Microsoft Life Cam VX-5500",
      "text": "This is a really good product. Is it the best? Dont know. But I am very please with the ease of stting it up and my daughter is the primary user. She has not complaints. Seems to give a better picture than others we are communicating with (mostly family). Again, easy to install and good quality item at a fair price. Dont think I need anything better unless it was for work but this would probably still suffice. I dont see anyone going worng with this.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Richter",
      "helpful_votes": 0,
      "publication_date": 20110131
    },
    {
      "title": "Great cheap all in one",
      "text": "The product arrived in a timely manner and beyond getting it out of the plastic box the setup was painless. Plugged in with the USB and Windows automatically installed my drivers allowing me to use it with skype in the time it took me to make a cup of tea. Haven't had any issues with not being heard, video problems or it falling off of the top of my monitor. I'm especially pleased that it comes WITH A BUILT IN MICROPHONE so that you can use it for VOIP or chatting. Great product",
      "rating": 4.0,
      "verified": true,
      "author": "L. Snyder",
      "helpful_votes": 0,
      "publication_date": 20130114
    },
    {
      "title": "Works as it should. Not sure how sturdy it is.",
      "text": "It works. It's a replacement unit so worked immediately when I plugged it in (software installed already). But I ordered it because the wires on the old unit were separating from the back - don't know how often that happens or why.",
      "rating": 4.0,
      "verified": true,
      "author": "Deborah Allen",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "Awesome",
      "text": "I was worried that this would be a poor quality webcam since it's so cheap. I was wrong. The picture is really clear and crisp. My Mom commented several times on how much clearer this camera is on her screen compared to her own, much more expensive, webcam. It doesn't have a light on it, but even though my livingroom is dimly lit it still has a clear, bright picture on the screen. I would recommend this to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Iisha",
      "helpful_votes": 0,
      "publication_date": 20121114
    },
    {
      "title": "great budget webcam",
      "text": "This is a great budget webcam. It takes decent videos and pictures and works as its supposed to. If you are looking for a cheaper webcam that works without all of the bells and whistles then this one is for you! I have windows 7 ultimate and it picked up the driver download the minute i plugged it in. I didn't use the included driver cd that came with it and it works just fine. i would definitely recommend this webcam to others.",
      "rating": 5.0,
      "verified": true,
      "author": "MT",
      "helpful_votes": 0,
      "publication_date": 20110326
    },
    {
      "title": "Works GREAT for Skype!  Excellent picture and sound quality.",
      "text": "I bought a Logitech webcam before buying this camera and it was awful. Very hard to focus. For LESS money, this camera is much nicer looking, smaller, more versatile, and has a MUCH better picture that focuses automatically. I use it for Skype and it works perfectly! Great video and great audio. The flexible stand is very versatile and easy to use whether you want to place this camera on top of your monitor, or on the desk. HIGHLY RECOMMENDED!",
      "rating": 5.0,
      "verified": true,
      "author": "David C. Franklin",
      "helpful_votes": 0,
      "publication_date": 20100207
    },
    {
      "title": "GREAT WEB CAM for the price",
      "text": "I purchased a pair of the VX-5000s so our family could more easily keep in touch with our daughter away at school. I selected the VX-5000s based upon reviews & price. Anything I purchased had to operate seemlessly with the XP, Vista & 7 OSs. (our family has an array of computers) The image & sound quality are so good that our college student was able to participate in our high school student's birthday party from over 2500 miles away. (via skype)",
      "rating": 5.0,
      "verified": true,
      "author": "anthony lang",
      "helpful_votes": 0,
      "publication_date": 20100526
    },
    {
      "title": "A Smart Buy",
      "text": "I bought this camera as a gift for my parents who live across the country so that we could video chat. The video quality is much nicer than on the camera that is built into my laptop. My parents are relatively computer savvy for their generation, but they aren't gurus and had never used a webcam before. They didn't have any trouble hooking the camera up to their computers though. The bottom line is that this camera is extremely user friendly and gives a clear picture.",
      "rating": 5.0,
      "verified": true,
      "author": "Smart Shopper",
      "helpful_votes": 0,
      "publication_date": 20100206
    },
    {
      "title": "Daily User of Life Cam",
      "text": "The Life cam was a very good purchase. I use it almost everyday and it has been flawless. The resolution is good and the built in mic is also very good. The person on the other end can hear me clearly. I highly recommend this product. I needed this life cam right away or else it could be bought at half the price with the back to school sales. I only had a problem once when I updated the software to the latest update from microsoft and the video stopped working. So I unistalled the software and reinstalled and it has been working fine ever since.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharada",
      "helpful_votes": 0,
      "publication_date": 20090911
    },
    {
      "title": "camera is great!",
      "text": "I hate Microsoft company, they always trying to get as much money as they can. Their customer service is not the best. I was scared to buy this camera especially for 40$ it is not cheap. Gotta tell you - I WAS SURPRISED FROM THE BOTTOM OF MY HEART. It installs in 2 mins, very easy, quality is great, it is fast. Seriously I love it! I would recommend it. Even a total idiot will figure out how to install and use it. It was simple and camera looks cool itself, matches my computer equipment. Buy it, it is worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "O. Henthorn",
      "helpful_votes": 0,
      "publication_date": 20100422
    },
    {
      "title": "The best entry-level webcam?",
      "text": "I got this one to just use for Skype now and then, but now I use it all the time. It is pretty good quality (not HD obviously, but I can't imagine both me and another person having the connection quality to support that anyway) that is only ever disturbed (in Skype) by bandwidth. For personal use it's great, too! It also makes a fantastic mic for online gaming and I have recommended it to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Fish",
      "helpful_votes": 0,
      "publication_date": 20131217
    },
    {
      "title": "Small and Efficient",
      "text": "Not the best webcam in the world, but for what it costs, works wonderfully. After my laptop webcam started having issues with deciding it would take more days off than on (not recognized USB blah blah...) got fed up and started looking for a webcam small enough for convenience without lowering the video quality. This lifecam has a better picture quality than the laptop installed webcam and worth the money. Now, if I were settling down in a house and wanted a really nice webcam, there are definitely webcams that are superior, but for what I need (small, reasonable price for good quality) I got just that.",
      "rating": 4.0,
      "verified": true,
      "author": "Kris D.",
      "helpful_votes": 2,
      "publication_date": 20100419
    },
    {
      "title": "Microsoft LifeCam VX-5000 with Microsoft bloated software.",
      "text": "Got this cam for my son and we both agree that we like the Logitech cams better. The main reason is the built-in connectivity to the Microsoft Live Messenger and all the extra adware \"bloat\" that is installed. Just more crud-ware that takes extra time to remove or disable on your system. The picture is average and does not look as good as the logitech cam that we have connected to another PC(both are 1.3 megapixel). If not for the great price here on Amazon we would have never even considered buying this cam.",
      "rating": 3.0,
      "verified": true,
      "author": "DGeorgeC",
      "helpful_votes": 0,
      "publication_date": 20090325
    },
    {
      "title": "Wow, not bad!",
      "text": "I'm pretty impressed with this little product. It installed easily and worked with skype (and Google Voice) right out of the box. The picture is just fine. Considering the upload speed that most people have on DSL or cable, you are probably not going to even use this at full quality for internet chats. Unless you are recording product reviews or other internet video you will be just fine with this model.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Griffin",
      "helpful_votes": 0,
      "publication_date": 20100904
    },
    {
      "title": "What a bang..",
      "text": "I expected a better product even for the price and its not bad,but there was no software and there is a tag saying load software. Plus it came in a brown small box, not like the one for the product. I expected more and got a pop not a bang. Other then that is nice. I would of given more stars if it had what it said it has like a program disk and then I wouldn't have to go to microsoft to get it.",
      "rating": 3.0,
      "verified": true,
      "author": "M.Whitmore",
      "helpful_votes": 0,
      "publication_date": 20121213
    },
    {
      "title": "A Rather Good Basic Webcam",
      "text": "Short and sweet review: (1) If you want top-of-the-line technology to use with business-level functions, this is not the cam for you. (2) If you just want to chat with friends and take easy (lower quality) images for social networking sites? This is the cam for you. Read the product description. It's quite accurate. For the price? An excellent deal. I'd buy another. If I needed another.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Coenen",
      "helpful_votes": 0,
      "publication_date": 20100921
    },
    {
      "title": "Solid webcam, nothing fancy",
      "text": "This is the first webcam I've owned. It is more than sufficient for video-calls with my fiance. Installation was a breeze and worked with skype and gmail chat right away. The picture is not cinema quality, but it is good for having paid $30 for it. The stand is a little awkward, but it balances on my laptop screen alright, although it wouldn't last long if I was moving around alot. Overall, this is a great webcam for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Bach",
      "helpful_votes": 0,
      "publication_date": 20090211
    },
    {
      "title": "Quality",
      "text": "I bought this webcam for my daughter who is proudly serving her country in Iraq. We have the same model here at home. Christmas was almost as nice as having her here. We opened gifts over Skype with her and for a little while we were able to forget she was thousands of miles away. My daughter LOVES the special effects that are easily accessible and drives her fiance crazy making silly faces. Having this really helps keep her closer to all of us until her deployment is over.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Morgan",
      "helpful_votes": 0,
      "publication_date": 20091226
    },
    {
      "title": "Perfect",
      "text": "This camera is awesome for the money. The picture quality is excellent for pictures or doing video chat (AIM, Skype, Windows Live) There are cool settings to play around with such as enlarged eyes, different colors, and animated features to add on to your head/face I was pleasantly surprised with how perfect this camera is for what I was looking for, especially for the price! I would definitely recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "KO",
      "helpful_votes": 0,
      "publication_date": 20100423
    },
    {
      "title": "after 2 years it works fine",
      "text": "I am using this camera for 2 years, every week on skype and I use the build in microphone when playing games online. It still works even though my toddler was messin with it multiple times, it landed on floors, cable got messed up - still works. Also the microphone seems to be of good quality, can whisper even when 2 feet away from it. Nothing high tec but I like it!",
      "rating": 5.0,
      "verified": true,
      "author": "K. K. Cialon",
      "helpful_votes": 0,
      "publication_date": 20130128
    },
    {
      "title": "Arrived in good condition, she was able to set it up ...",
      "text": "Bought this as a gift for my mother on mother's day. Arrived in good condition, she was able to set it up without me in town (saying something) and she seems to have a good handle on it. Talking from the other end of seeing the picture quality on my side of the skype chat, the video quality is decent (though, as always, dependent upon the internet connection), and she's able to move it around to show me home improvements well despite being tethered to a desk top. Thanks!",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20150622
    },
    {
      "title": "Great cam for what it is",
      "text": "This is a great web cam for its price and features. It is easy to install and easy to attach due to the flexible mounting. It did not come with an installation CD/DVD but after a quick google search I was able to get to the download page for it. The cam is great for skype and similar applications. If you are looking for an HD cam this is not it. I will recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Julian K",
      "helpful_votes": 0,
      "publication_date": 20121211
    },
    {
      "title": "Great little camera.",
      "text": "What more could a simpleton like me need. Easy to set up and never had an issue. It does video chat on Skype well and my 10 year old cousin had hours of fun with the face altering software that came with the camera (so did i). That's all i need from a webcam. It lost one star for the mount, its a little unstable and can be awkward when trying to get it to stay still on top of my screen. But that is a minor flaw.",
      "rating": 4.0,
      "verified": true,
      "author": "nickm",
      "helpful_votes": 0,
      "publication_date": 20120208
    },
    {
      "title": "Serves its purpose well",
      "text": "This web cam is great, and very user friendly. Its perfect for chatting with friends via skype, but I do not reccomend using this for business purposes. The transmission is great, but if you want to exhibit professionalism in your communication delivery you may want to invest in a better product. Overall, it is a definite must-buy for informal communication with friends and family. :)",
      "rating": 4.0,
      "verified": true,
      "author": "GAGal",
      "helpful_votes": 0,
      "publication_date": 20120818
    },
    {
      "title": "Better than expected!",
      "text": "Bought this for my mom when I was moving away so we could video chat. I set it up for her-very easy, quick as far as these things go. I was pleasantly surprised by the sound quality especially! The picture is very good too, probably better than my built-in on my Mac. I would definitely recommend this product. Best for the price, not worth spending more for vaguely better picture quality. Unless you want to spend a few hundred dollars, go with this one!",
      "rating": 4.0,
      "verified": true,
      "author": "Rach",
      "helpful_votes": 0,
      "publication_date": 20110812
    },
    {
      "title": "Affordable and Good quality Video",
      "text": "This is a nice gift to give to someone with a laptop that has no built in web cam. It is easy to setup, just plug it in and install the necessary drivers. It bends to fit to your screen and doesn't get in the way. The video is great quality, so decided to give it to my mother in law so that she could use skype. Cant beat this price at all",
      "rating": 4.0,
      "verified": true,
      "author": "Stone",
      "helpful_votes": 0,
      "publication_date": 20130710
    },
    {
      "title": "HP KQ246AA is way better",
      "text": "This thing takes forever to load the software drivers, even with Windows 7. Windows 7 does not automatically load the drivers for this device. Previously I had purchased the HP KQ246AA and that one you just plug in and go. I was trying to save a few bucks by buying this one but that was a mistake. Aside from that, picture and voice quality are fine.",
      "rating": 2.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 2,
      "publication_date": 20100317
    },
    {
      "title": "Only one problem.",
      "text": "I had a webcam that I purchased from amazon, for about $2. It wasn't very good, but for the price I didn't expect much. So, I thought it was time to buy a new one, but a better quality one this time, one that wasn't over over $20. I found this one. The quality is really good for the price, the mic works really well in my opinion. The one flaw was that I was sent then red one when I ordered blue. The pictures on the box all show the blue version, but mine was red. Oh well ,it's not THAT big of a deal, but I wish they didn't mess up on that.",
      "rating": 4.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 0,
      "publication_date": 20120626
    },
    {
      "title": "The Webcam......",
      "text": "I would have preferred some kind of manual. If you aren't on the computer a lot, and don't know a lot about the computer you are left wondering how to make it do what you want. I am 62, didn't have all the training kids have today. That makes a difference. For the money it is a great buy. received it through the mail promptly. I will continue to use Amazon for other purchases..",
      "rating": 4.0,
      "verified": true,
      "author": "Melody",
      "helpful_votes": 0,
      "publication_date": 20130720
    },
    {
      "title": "Microsoft webcam",
      "text": "The Microsoft LifeCam VX-5000 works as expected. The only problems we've encountered is slow transmission speed from the carrier. If that is encountered the webcam can \"freeze\". We've purchased three of these and have never experienced a defective unit. Again, if you have a fairly up-to-date PC and communicate with someone who also possesses modern equipment, and use a broadband transmission medium, you'll be very pleased with your Microsoft LifeCam VX-5000.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20091221
    },
    {
      "title": "A Tremendous Value",
      "text": "The video and sound quality are above average, never impeding the conversation. No instillation of software required. I simply plugged the webcam into one of my USB drives, my computer recognized the device and I was free to utilize it effortlessly with Yahoo chat and Skype. After nearly 3 years of regular use, the product stills works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Comperic2003",
      "helpful_votes": 0,
      "publication_date": 20110613
    },
    {
      "title": "Well worth the money.",
      "text": "Pros: -Great quality for the $ -Perfectly compatible and easy to use with Skype -Plug and play compatible installation for Vista Cons: -Base, while easy to flex and attach/stand, is not easy to create a desired tilt/angle -Software is not installation friendly Verdict: For $28, this is an impressive unit. The picture quality is surprisingly good for this price and functions well even in low light. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Jorel",
      "helpful_votes": 2,
      "publication_date": 20091024
    },
    {
      "title": "Works as expected",
      "text": "This webcam installed easily and started working right away. We use it primarily for video calling my in-laws in AZ and also between myself and my family while I am traveling. The video can get pixelated and choppy at times, but that is probably attributed more to the software and bandwidth than the camera. If you just view the video directly on the computer, it looks fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Aaron J. Kepler",
      "helpful_votes": 0,
      "publication_date": 20091230
    },
    {
      "title": "Great little webcam",
      "text": "I purchased this for my home computer as I was going away for 3 weeks for some training and wanted a way to stay in touch with my family. It was easy to setup, the picture is clear and is user friendly. The only thing that would make it 5 stars is a better way to secure the camera to the top of a monitor without moving side to side.",
      "rating": 4.0,
      "verified": true,
      "author": "Firedad",
      "helpful_votes": 0,
      "publication_date": 20121121
    },
    {
      "title": "AMAZING! If I could, it would be 1000000 stars.",
      "text": "This webcam is SO amazing! It is SO easy to install. I love this webcam! All you do is insert a disk, download a file, turn on the webcam, and you're done! It's so easy! It hooks onto the tops of monitors which is GREAT. It works really good - especially if you're a YouTuber - like me! I would SO DEFINITELY recommend this to ANYONE who is looking for a cheap, great, good quality webcam with great audio. Please, buy it!",
      "rating": 5.0,
      "verified": true,
      "author": "Star",
      "helpful_votes": 0,
      "publication_date": 20130208
    },
    {
      "title": "Great value with great microphone",
      "text": "Great value! I have found out - the hard way - that Microsoft products are just about the best value out there. I use the microphone instead of those provide with the laptop or desktop since it really works better.",
      "rating": 5.0,
      "verified": true,
      "author": "JET",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "very clear video",
      "text": "awesome web cam for the $$$. Easy to install, just plug it in. I downloaded Skype and away I went. No need to use software included unless you're going to be creative with your pictures. I purchased two of them so I can keep in touch with my grandchildren who live far away. I was able to ship both of them to different locations by using Amazon Prime two day shipping which was free. This web cam was well worth the money! There are many less expensive brands but do yourself the favor and purchase this one. No worries!",
      "rating": 5.0,
      "verified": true,
      "author": "trixie",
      "helpful_votes": 0,
      "publication_date": 20091220
    },
    {
      "title": "Web Cam",
      "text": "It's great..stays on desktop monitor and laptop..got the same one for my Mom...easy to use...and never falls off...great picture and sound..no problems at all..with computers..that is a relief.. I use it with skype..and can see and hear lot's of friends and family... Great..I recommend this one..have had others..that broke easily...",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Stevens",
      "helpful_votes": 0,
      "publication_date": 20110117
    },
    {
      "title": "Amazon's Microsoft LifeCam VX-5000 Webcam (Red)",
      "text": "It took awhile before I received shipment, but installation was simple. I was up and 'running' within just a few minutes! My only slight disappointment was I expected my webcam to be completely RED, not just a thin line around it's perimeter, otherwise I wouldn't have bothered to select a color. Other than that disappointment, I am very pleased with the performance of this webcam! I really appreciate the ease in which I am able to adjust the position of the webcam on top of my flatscreen monitor. I would recommend purchase of this webcam to anyone who is looking to purchase an inexpensive, yet competent webcam!",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy Iadanza",
      "helpful_votes": 0,
      "publication_date": 20110220
    },
    {
      "title": "Pretty good webcam, WORST SOFTTWARE",
      "text": "the only reason its getting 2 star is because of the software. All i want was a driver and it installed soo many sht on my laptop, took about an hour & half... wtf ? it dosn even include many options, it also installed a whole a lot of crap i'll never need. Worst software ever, im never getting a ms cam again, my old logitec was so much better.",
      "rating": 2.0,
      "verified": true,
      "author": "R. C",
      "helpful_votes": 2,
      "publication_date": 20091102
    },
    {
      "title": "Stop looking elsewhere, just buyr this here..",
      "text": "Great price, works great...sound and video. For the price, you simply can't do better. It does not include the software drivers, but they can be easily downloaded and installed from Microsoft's website. Just Google this model and drivers. I paid around $13 plus shipping",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly V. Folse",
      "helpful_votes": 0,
      "publication_date": 20130105
    },
    {
      "title": "Don' buy unless you want to use Microsoft Live Call",
      "text": "Okay camera but the software installation took forever. I have no idea why, It just buzzed along for 20 minutes. So be aware that your are giving Microsoft an opportunity to get into your software libraries. If you don'e plan to use this exclusively for Microsoft Live, don't bother with this camera , get a Logitech or other legitmate camera maker.",
      "rating": 2.0,
      "verified": true,
      "author": "Jersey Boy",
      "helpful_votes": 2,
      "publication_date": 20091024
    },
    {
      "title": "Awesome",
      "text": "This was my first webcam and its great. I wasn't sure if certain OS had webcams that went with it but this worked for my Windows 7. And the quality of the pictures and videos are great! I have a fairly dark room and it still works with dim light. And I love how it fits to any computer monitor, I have a 22\" Acer monitor and it fits great.",
      "rating": 5.0,
      "verified": true,
      "author": "Cenedra",
      "helpful_votes": 0,
      "publication_date": 20120122
    },
    {
      "title": "Works great!",
      "text": "I bought this for my pre-teen daughter for Christmas. It installed easily on an old Pentium 4, 2.8 GHz system, and she loves it. Her friends love it too, and they're jealous because theirs (different brands) don't work as well, so I guess it's good! She loves modifying her images with the software, so that seems to work well too.",
      "rating": 5.0,
      "verified": true,
      "author": "Old Radio Guy",
      "helpful_votes": 0,
      "publication_date": 20100902
    },
    {
      "title": "Camera review",
      "text": "The camera functions as promised. Close up the image is clear and focused. At longer distance the image is slightly blurred but still acceptable. The unit also has a microphone which was able to pick up conversations within a 15'. I am pleased with the cost and the item.",
      "rating": 4.0,
      "verified": true,
      "author": "Dr. Jerry Stettheimer",
      "helpful_votes": 0,
      "publication_date": 20131213
    },
    {
      "title": "great",
      "text": "this was delivered on time and yet when I opened it I thought that it was small, also it only came without a driver disk, I was apprehensive to say the least but when I connected it there was no problem it worked like a charm, the computer found everything it needed and I use it a lot through Skype.",
      "rating": 5.0,
      "verified": true,
      "author": "agenor12001",
      "helpful_votes": 0,
      "publication_date": 20130321
    },
    {
      "title": "HARDWARE YAY, software, boo",
      "text": "Typical Microsoft product. I give the hardware a 5. The software by Microsoft or it's OEM, a 0. Really, Microsoft? I have to close programs on my desktop to run your stupid application for a vidcam? I have to use a work around in my Chrome Blogger to insert pictures? You never did write software that was worth anything. And quit stalking me on the internet. You can't fix my stuff. Microsoft, you suck. 2 1/2 stars",
      "rating": 3.0,
      "verified": true,
      "author": "ViolaFury",
      "helpful_votes": 0,
      "publication_date": 20130123
    },
    {
      "title": "I love it",
      "text": "I love this webcam. This was my first experience using one, but needed one because my grandson was born out of state and I wanted to be able to keep up with his growth. I was a little afraid it would be complicated but it was a breeze to install and even easier to use. I use it with Skype and have had no major issues. I have used it several times and the picture was distorted only twice but cleared up pretty quickly. I plan on getting another one for another family member for christmas. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Millward",
      "helpful_votes": 0,
      "publication_date": 20101129
    },
    {
      "title": "Life Cam",
      "text": "Ok, this was purchased with an older computer. Do not use it anymore. Most of the time it would freeze up. It served its purpose, but you do not need it anymore as most computer come with cams",
      "rating": 3.0,
      "verified": true,
      "author": "Darlene Hatcher",
      "helpful_votes": 0,
      "publication_date": 20140622
    },
    {
      "title": "Works great on Vista 64bit",
      "text": "Great camera, great price, the picture quality is really good with exceptional quality in low-light conditions. It works fine with Skype and our kids say that the voice quality is good. The picture enhancements, like the applied cowboy hat are very clever; but, don't function with Skype and are probably worthless anyway. You can capture a still picture of yourself with any of the enhancements and save it. So, I guess it might be amusing for kindergarten crowd.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Guhl",
      "helpful_votes": 0,
      "publication_date": 20091004
    },
    {
      "title": "Works Well",
      "text": "I have a Mac Mini so it didn't come with a camera. I bought this and was able to walk my wife through the installation over the phone so I can video chat with the family while on the road. The sound quality was very impressive and the image quality is on par with nearly every other web cam on the market. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Hansen",
      "helpful_votes": 0,
      "publication_date": 20100513
    },
    {
      "title": "Skype Buddy",
      "text": "Right now my family is scattered- One sister in England, one in Idaho, my parents and baby brother in Maryland, and I'm in Utah. This webcam is everything I need to video chat with my family with ease and quality. It didn't take long to install and it takes seconds to become functional when I plug it in to use it. My only problem is that it doesn't clip onto my laptop, it just perches on top, so when I move my laptop I have to be careful, but it has been dropped a few times without any damage. Overall, a good quality device that does everything I need it to with ease and speed.",
      "rating": 5.0,
      "verified": true,
      "author": "ejbooks86",
      "helpful_votes": 0,
      "publication_date": 20101029
    },
    {
      "title": "Solid choice for inexpensive webcam",
      "text": "Bought this so my wife could Skype with family out of the state on our PC connected to our HDTV. It was easy to setup and use. The picture quality is a little grainy and motion can cause some blurring, but overall it is fine for it's intended purpose. The microphone works well, even when seated 4 - 5 feet across the room. Well worth the $20 I paid.",
      "rating": 4.0,
      "verified": true,
      "author": "steveowned",
      "helpful_votes": 0,
      "publication_date": 20110224
    },
    {
      "title": "Good Little WebCam",
      "text": "For the price, this little camera produces an excellent quality picture and the built in microphone works well also. The ability to sit ontop of a flatscreen monitor is a clever design. Obviously the installation went easy enough since it is a Microsoft devise hooking into Windows. Worked with Vista as well as Win7.",
      "rating": 4.0,
      "verified": true,
      "author": "jd",
      "helpful_votes": 0,
      "publication_date": 20091126
    },
    {
      "title": "LifeCam VX-5000",
      "text": "We purchased 2 Web Cams so that we could \"visit\" with our new granddaughter who lives far from our home. My son and I both found it easy to install and the picture is so clear that I ordered yet another Cam for the other grand kids who live in our town. It's just so nice to be able to \"visit\" with them via the computer when you can't be there in person. I would definitely recommend this to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda C -Pgh. PA",
      "helpful_votes": 0,
      "publication_date": 20091212
    },
    {
      "title": "All the cam I needed",
      "text": "Needed a cam to Skype with our son while he is in Iraq for a year. Installation and setup went without a hitch, picture quality is great...it's all the cam / mic we needed. Bought us one and upon installation and first use bought two more for our daughters to talk to their brother also. Mounts fine on a laptop screen as long as the laptop is stationary.",
      "rating": 5.0,
      "verified": true,
      "author": "Kwik",
      "helpful_votes": 0,
      "publication_date": 20091212
    },
    {
      "title": "Microsoft LifeCam",
      "text": "I had borrowed a Microsoft webcam to see how I liked it to be able to SKYPE my niece who left for college and friends across country. I liked it so I bought my own on Amazon. Easy installation-i'm really not tech savvy but had no problems with installation. Picture quality is great and sound is fine. Perfect for my uses. For Christmas I purchased a Kodak webcam for a gift-Black Friday special. When we SKYPED the other night I was very disappointed in the picture quality of the Kodak camera-Microsoft is much, much better. Wish I had purchased Microsoft as gift. Great camera at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Barn Boot Babe",
      "helpful_votes": 0,
      "publication_date": 20110112
    },
    {
      "title": "Good stuff.",
      "text": "It's so good it's not funny. I use it mainly for microphone and I can walk around the room while this thing sit on top of my monitor. I also use speaker during my conversation and there's no feed back. It's been working for over 3 years now.",
      "rating": 5.0,
      "verified": true,
      "author": "End User",
      "helpful_votes": 0,
      "publication_date": 20141005
    },
    {
      "title": "Good entry Level Camera",
      "text": "We purchased this camera to see who often we would use Skype Video calls. When we ordered the camera we figured it would be an entry level camera just to get us started. I wasn't expecting much in terms of picture quality but was pleasantly surprised once it was setup. Installation was a breeze in XP. I inserted the CD and waited for it to prompt me to plug the camera in. I had the camera installed and up and running within 5 minutes and was making a video calls within 10.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Russell",
      "helpful_votes": 0,
      "publication_date": 20101129
    },
    {
      "title": "Easy to use",
      "text": "Good product. Don't use a lot but easy to use when I do",
      "rating": 5.0,
      "verified": true,
      "author": "Linda R. Bookhardt",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "Amazon beat every stores price by 1/2!",
      "text": "This works great if you Skype. I bought it for my 93 year old mother and she does not have to do a thing with it. It auto focuses and the picture is great and very clear. Would recommend this highly!! Worth the low price I paid and much more!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "just4jan",
      "helpful_votes": 0,
      "publication_date": 20130428
    },
    {
      "title": "Great webcam",
      "text": "The Microsoft LifeCam vx-5000 webcam is just what I was looking for. Picture clear and sound is good. My problem with this purchase is that it did not come with software disk and was not a retail box item, did not see any information about it being a oem (just the webcam). This as it turned out was not a good price for a non boxed item. Would not have purchased this item if it had been made clear that it is an oem and not a retail boxed item. lje",
      "rating": 4.0,
      "verified": true,
      "author": "Larry Essman",
      "helpful_votes": 0,
      "publication_date": 20130505
    },
    {
      "title": "Nice Webcam & Price",
      "text": "The video quality is excellent! I only installed the driver & skipped the MSN Messenger. Everything works fine. I use it for Skype & Google video conference. The built-in microphone is great so I don't need to buy a separate headset. The webcam is small and ready to move anywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Lin",
      "helpful_votes": 0,
      "publication_date": 20100327
    },
    {
      "title": "Microsoft LifeCam VX-5000",
      "text": "The webcam is excellent for the price. I didn't use the software included with the webcam. I only used the driver (it would have been an easier installation if the driver was in a separate file). I'm using Skype with Windows XP. No problems with the picture or sound (only small problem is if you move too quickly, the picture blurs - I don't know if that's a software or hardware problem). The base isn't designed for a laptop. It doesn't fit tightly on the laptop screen, so you have to balance it on the screen or placed it on a table.",
      "rating": 4.0,
      "verified": true,
      "author": "Smitty in PA",
      "helpful_votes": 0,
      "publication_date": 20091205
    },
    {
      "title": "Perfect for Skyping",
      "text": "We use it for skyping - works perfectly in this role. This is not a precision German optical instrument. it is a practical small camera that installs in one mintue and does the job. The MS brand ensures easy compatability with the rest of your software and MS operating systems.",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20130218
    },
    {
      "title": "A decent camera for the price",
      "text": "This camera was decent quality - definitely not as good as a High Definition webcam. I had trouble keeping the camera attached to the screen of my laptop, as it fell off whenever I moved my laptop. The image quality was acceptable, but was often grainy and very slow - many of my webchats ended up being choppy. I suppose this low-quality camera would be a great buy if you don't want to feel self-conscious when you are webchatting. The low-quality image will be sure to not pick up on pimples and minor blemishes.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrew Won",
      "helpful_votes": 0,
      "publication_date": 20110702
    },
    {
      "title": "It's okay but not great.",
      "text": "Image clarity leaves a lot to be desired. I somehow expected more from this webcam than it delivered. It works okay but for a little bit more, there are a lot of better options out there.",
      "rating": 3.0,
      "verified": true,
      "author": "Gunter J. Steffen",
      "helpful_votes": 0,
      "publication_date": 20140904
    },
    {
      "title": "not compatible",
      "text": "Since we bought the camera to use it for skype connection we always have trouble with it. It works for 1 week and next week it just stop working. We contacted Microsoft support team who tried to help but then they told us the camera might not be compatible with our computer (PC XP). Returning the camera",
      "rating": 1.0,
      "verified": true,
      "author": "Zenzen",
      "helpful_votes": 0,
      "publication_date": 20110311
    },
    {
      "title": "More Than Adequate for the Average User",
      "text": "Easy to set up and use. As others have stated, works well in low light. Video quality could be better but for price I doubt you can beat it. It has some neat features as well. I can play checkers and other games with my kids when I'm out of town. It has some funny video effects that always make my kids laugh. I'm very happy with the product and recommend it for anyone looking to keep in touch with family and friends from out of town. Sending a video e-mail was quite easy too.",
      "rating": 4.0,
      "verified": true,
      "author": "Hawkdriver",
      "helpful_votes": 0,
      "publication_date": 20090920
    },
    {
      "title": "Microsoft lifeCam",
      "text": "This works good. I talk to my granddaughter with it. Although I'm not sure about the sound. We had to use a head set to hear each other. We have the same Web Cam. It's easy to hook up. You may have to adjust the pictuer quality the way you want it. I adjusted mine and it was fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Bittergreen",
      "helpful_votes": 0,
      "publication_date": 20100206
    },
    {
      "title": "extremely happy",
      "text": "I've had this product for 3 days now I don't usually leave reviews but this product works so well I had to recommend it to anyone looking for a web cam it takes great pictures I use it on skype I love it ...it very easy to set up not confusing to use at all ..this product exceeded my expectations...",
      "rating": 5.0,
      "verified": true,
      "author": "zelia jardin",
      "helpful_votes": 0,
      "publication_date": 20130106
    },
    {
      "title": "Great webcam",
      "text": "This webcam works great. It's very inexpensive, but works amazingly great. Super easy to use. Whomever I video chatted with said what a nice camera you've got. How bright and clear everything looks. So, I'm very happy with it and I certainly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Le musician",
      "helpful_votes": 0,
      "publication_date": 20130417
    },
    {
      "title": "Good webcam",
      "text": "Good quality webcam. I've been using it for several months. Sound and picture quality work well. Good price too. Not big and bulky on my monitor. USB port needed and the cord is a bit long.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Williams",
      "helpful_votes": 0,
      "publication_date": 20131205
    },
    {
      "title": "Great little webcam!",
      "text": "OK - the MS Lifecam VX-5000 is the only webcam I've tried (other than the $2000 Sonys I installed at work). For $35 or so its great. Simply to install - nice quality picture - software is pretty straight forward. Bought each of my adult kids one for Christmas so now we can all video chat - for free! This is way cool - even a baby boomer can do it!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Boysen",
      "helpful_votes": 0,
      "publication_date": 20090106
    },
    {
      "title": "No problems!",
      "text": "I wanted a camera to help me communicate with my daughter overseas. She complained that the old one was fuzzy. I had no trouble setting up the LifeCam (don't forget to set up the microphone setting to LifeCam). My daughter was amazed at how clear the picture was (she is in Japan). I would recommend this to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "S. J. M.",
      "helpful_votes": 0,
      "publication_date": 20090823
    },
    {
      "title": "Perfect for light-usage",
      "text": "I only use a webcam occasionally. This webcam has had a great quality picture and was really inexpensive. I have no need of the newest HD whatever cameras. This one has been perfect for my needs and at an unbeatable price!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Bauerle",
      "helpful_votes": 0,
      "publication_date": 20131006
    },
    {
      "title": "LifeCam User",
      "text": "The MS LifeCam is a decent webcam. It's better for laptop use than desktop because of the bendable base. I have two other Creative webcams, both w/ 1.3 MPixel resolution, and more expensive; But this one works better. You don't need the CD, so don't bother installing the software that comes with it. The audio works well also. I would recommend it to anyone looking for a webcam.",
      "rating": 4.0,
      "verified": true,
      "author": "Philinder",
      "helpful_votes": 5,
      "publication_date": 20090603
    },
    {
      "title": "Very Solid Item",
      "text": "Pros: The quality of the picture of the camera is very good. The camera's software and compatibility with other software is easy and straight forward. The installation was simple as well. Cons: Attaching it to your computer is a little bit of a hassle, but once you get it where you want it, it has been fine. Note: You need to install the software first before you ever plug the camera in or there will be problems, which is posted all over the instructions. This is only a problem for people who don't read the instructions.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Falkenstein",
      "helpful_votes": 0,
      "publication_date": 20100310
    },
    {
      "title": "Best webcam, but installing software took too long",
      "text": "Smallest, functional, fit nicely on top of my LCD screen. Picture and audio quality are very good. The only complaint is installing driver/software which took a long time; it seemed like it had to download the entire software even though it came with a CD. I take 1 star away for that.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Chieng",
      "helpful_votes": 0,
      "publication_date": 20090118
    },
    {
      "title": "No software",
      "text": "This is the 3rd VX-5000 I have purchased, so I am pleased with it. One for my daughter in AZ, one for me and the last one for one of my sons in NH. The one in NH arrived yesterday without any software. A real disappointment, we had all hoped to see each other on Christmas.",
      "rating": 4.0,
      "verified": true,
      "author": "Ed G",
      "helpful_votes": 0,
      "publication_date": 20091223
    },
    {
      "title": "LifeCam VX-5000 - Great little camera",
      "text": "Overall, we are very happy with our new VX-5000 and would highly recommend it. PROS - Very light - Very compact - Friends we've used the camera with report a great video signal - The built-in microphone is very handy CONS - Would have liked a travel pouch - Base is not as flexible as envisioned, but it's definitely adequate. OTHER - This does NOT work with the PS3. I wasn't expecting it too, but in case anyone is curious.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Anderson",
      "helpful_votes": 4,
      "publication_date": 20081230
    },
    {
      "title": "Microsoft LifeCam",
      "text": "I do recommend this product. We purchased it about five years ago. We use it to chat with my daughter who lives in Quito, Ecuador. The quality is very good and clear. We use it every week!",
      "rating": 5.0,
      "verified": true,
      "author": "Marysol Almonte",
      "helpful_votes": 0,
      "publication_date": 20140221
    }
  ],
  "product_meta": {
    "title": "Microsoft LifeCam VX-5000 Webcam (Red Accent)",
    "description": "Color:RedFROM THE MANUFACTURER\n\n\nOverview:\n\nSharp Video, Clear Sound, and Easy Online Photo SwappingShare more\n\n * Swap and share photos live during a video call\n * Windows Live™ call button for use with Windows Live Messenger.\n\nHear more * Crystal-clear audio\n * Built-in unidirectional microphone with acoustic noise cancellation\n * Echo cancellation*\n\nSee more clearly\n\n * World-class VGA optics\n * Auto-adjusts for low-light conditions\n * Pan, tilt, zoom**\n * Always focused***\n\nFun, Flexible Base * Bend, fold and shape the flexible base for the best angle on laptop screens, flat panels and traditional monitors. \n\n* Echo cancellation available with Windows Vista, Windows Live Messenger, and Microsoft® Office Communicator.\n** Not available when previewing and capturing video at 640 × 480 esolution.\n*** Focus depth of field from 21\" to 60\".\n\n\nSystem Requirements: * Windows Vista® * Intel Pentium® 4 2.8 GHz (Pentium Dual-Core 1.8 GHz or higher recommended)\n    * 1 GB of RAM (2 GB recommended), 200–600 MB Hard Drive\n   \n   \n * or Windows® XP * Intel Pentium 4 1.8 GHz (Pentium Dual-Core 1.8 GHz or higher recommended)\n    * 256 MB of RAM (500 MB recommended), 400–1250 MB Hard Drive300 MB free\n   \n   \n * Sound card with Windows compatible speakers or headphones\n * USB 1.1 (USB 2.0 recommended)\n * CD drive\n * Internet functions (post to Windows Live™ Spaces, send in e-mail, video calls) also require: Broadband (cable, DSL, or other) modem",
    "rating": 3.9,
    "feature_bullets": [
      "Microsoft LifeCam VX-5000 General Features: Red color VGA CMOS sensor technology",
      "640 x 480 motion video resolution 1.3 megapixel interpolated 55 diagonal field of view",
      "4x digital zoom USB 2.0 interface Integrated unidirectional noise cancelling microphone",
      "Flexible universal attachment base Digital pan and tilt Vertical tilt and swivel pan",
      "Live Call Button"
    ],
    "specifications": {
      "Product Dimensions": "8.1 x 7.1 x 3.2 inches",
      "Item Weight": "9.6 ounces",
      "ASIN": "B0015BYS74",
      "Item model number": "RKA-00014",
      "Customer Reviews": "3.9 out of 5 stars580 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#2,196 in Webcams",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 4, 2008",
      "Manufacturer": "Microsoft"
    },
    "categories": [
      "Computers & Accessories",
      "Audio & Video Accessories",
      "Webcams",
      "Computer Accessories & Peripherals",
      "Electronics"
    ],
    "price": ""
  }
}