{
  "website_summaries": [
    {
      "verdict": "Other cameras may deliver higher resolution and longer optical zooms, but the Panasonic FZ28 proves that the \"more is better\" presumption isn't always valid.",
      "pros": [
        "Useful 27mm wide-angle zoom",
        "excellent image stabilization",
        "full selection of manual and automatic exposure controls",
        "720p movie capture with operational zoom",
        "relatively fast"
      ],
      "cons": [
        "Prone to soft, noisy photos",
        "no hotshoe"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 7.0,
        "Performance": 8.0,
        "Image quality": 7.0
      },
      "publication_date": 20090521,
      "rating": 7.3,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "great camera.  expensive features for a lot less",
      "text": "This has been a great camera. It has an excellent zoom and great picture quality. I have been able to capture a lot of good moments with this digital camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Zane Garrison",
      "helpful_votes": 0,
      "publication_date": 20201024
    },
    {
      "title": "Astounding.",
      "text": "Here is a product sample for your own review. I personally give this camera 5 stars. This is merely a sampling of the high-def video. The still shots and intelligent auto on this camera are amazing and I've taken several thousand pictures with this camera already. If you're in the market for a great CONSUMER-level camera, then this is definitely a choice you should consider. If you're a professional you're probably not even looking at this camera. Keep in mind that the \"lens selection\" for this camera is consumer grade. If you are thinking of getting extra lenses and stuff like that, then you need a higher grade camera. This camera deserves 5 stars for the price and function regardless!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20081209
    },
    {
      "title": "Excellent Camera",
      "text": "This is a super easy to use camera with lots of extra features. The video setting is great and takes really good short videos. I used it to video a swim meet recently, then converted the files to a DVD and the quality was outstanding. The camera has settings for night, dusk, portrait, landscapes, etc, or you can use the automatic feature and the camera will pick the best setting for you. Pictures are clear and crisp. It's easy to use the flash and charging the battery is very simple. This is our second camera like this. I would recommend it highly as a good easy to use digital camera that takes quality photos and videos.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly A. King",
      "helpful_votes": 2,
      "publication_date": 20090604
    },
    {
      "title": "Great form, easy photos",
      "text": "Camera takes great photos in different lighting and scenery. It's automatic, but camera can also be put in program mode. Music playing with slideshow was cool bonus. Before buying, I had read reviews claiming lowlight conditions are difficult, but the camera is much better than my Samsung Z73 and I expected low light (like night vision googles low light) photos to be a problem for most commercial cameras. But there is little or no blurring. If it is grainy, you can edit in Photoshop or Picasa. In low light, best use the flash. The flash is good. Camera adjusts when flash is used so it does not wash out subjects that are nearer or really white.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 4,
      "publication_date": 20090403
    },
    {
      "title": "Best purchase I have made so far",
      "text": "Best purchase I have made so far. Fantastic quality and fantastic zoom and focus. Actually took full frame moon shots, in focus, with all the detail seen with high dollar lenses and cameras. Solid camera and outstanding battery life, even with the smart card I use for sharing.",
      "rating": 5.0,
      "verified": true,
      "author": "Mgldwng",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "More Features Than I Could Ever Use",
      "text": "I've had this camera for a couple of weeks now I'm still in the learning stage. Many more features than I need but it's not so complicated that I couldn't take a few photos within a couple of minutes without having to even crack open the manual. The controls are laid out very logically and the camera is easy to hold and shoot. The optical zoom is great and coupled with the digital zoom allows unbelievable closeups. Changing megapixel settings if very fast and can be done easily using the Quick Menu thumb button while still looking through the viewfinder. I'm very impressed with the camera and I know I'll be more impressed as I use more features.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Smith",
      "helpful_votes": 0,
      "publication_date": 20090515
    },
    {
      "title": "Incredible camera for an African safari",
      "text": "I know nothing about cameras or photography but the pictures I took with this camera on a recent safari seem to have everyone fooled. The 18x zoom was so fantastic that I used the camera instead of binoculars. The shots taken at 18x zoom look as though they were taken right up close - the autofocus is incredible. After a whole day out on safari the battery was still going strong. The video looks stunning and the anti shake makes it possible to casually film without a tripod. The camera is really light yet durable. I was able to figure out how to use it in an hour without touching the manual. I highly recommend this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Tara - Vedic Astrologer, Shamanic Musician",
      "helpful_votes": 4,
      "publication_date": 20081203
    },
    {
      "title": "Great camera, great pics for a great price.",
      "text": "I bought Fz28 after read some reviews on photo blogs and sites. I used to buy only nikon and canon cameras, even point and shoot models and slr's as well but never though to purchase Panasonic models. I'm surprised how good this camera is. The photos quality are outstanding and the controls are so helpful. Great zoom, great vibration stability mechanism too. I'm so satisfied about this camera and for shure this is a great deal. This camera stands between PS and SLR's camera, so if you think to go to a SLR's model and your experience is only about Point and Shoot cameras, FZ28 is a great bridge to take you to most advanced cameras on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "Sergio A. S. Santiago",
      "helpful_votes": 0,
      "publication_date": 20090525
    },
    {
      "title": "I love this camera",
      "text": "We replaced a Canon camera with similar mega pixel and zoom capabilities with this Panasonic. It simply blows the Canon away in quality pictures. It handles movement, low light, and zooming amazingly well versus the Canon. It also records video in HD which is a very nice feature now. I was worried about the battery pack but bought a Lenmar DLP006 replacement battery as a cheap backup and it works just as good as the factory battery. I am no camera buff but wanted a quality point and shoot camera that had great zoom capabilities and this is the perfect camera for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Parker",
      "helpful_votes": 0,
      "publication_date": 20101227
    },
    {
      "title": "Panasonic Lumix FZ28 -a creative choice.",
      "text": "I brought this camera a few weeks ago and it is unbelievable. There are 23 programs within the system, with additional variances within many of the sub-programs. I have not been able to test them all yet- too many. The camera is fast and accurate. Color reproduction is accurate. The camera is very light and fits naturally in the hand. There is an \"I\" or Intelligent mode; this is great for the beginner or anyone who wants complete automatic programming. Truly an excellent camera with a top rates lens. (This is an upgrade from my Panasonic Lumix FZ 10 which was more expensive).",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Bhola",
      "helpful_votes": 0,
      "publication_date": 20090509
    },
    {
      "title": "I was like..",
      "text": "I believe this was my first purchase from Amazon... at that time I was a student in the US, I am from Mexico and when the guys from UPS left it at the doorstep in the apartment that I was renting... I was like... What the hell!!! people are going to steal it!!!! But silly me, my neighbours were not mexicans.... anyways, this camera is still with me and I haven't had any problems with it. A very nice piece of equipment",
      "rating": 5.0,
      "verified": true,
      "author": "Eduardo Murphy",
      "helpful_votes": 0,
      "publication_date": 20150226
    },
    {
      "title": "Panasonic FZ-28 10MP digital camera",
      "text": "I replaced an older digital camera with this FZ-28 (Minolta)primarily to digitize slides,many of them.It is fantastic,some of the slides are over 40yrs old and they look on the computer like I took them today! I love this camera! however, the complexity of it and instructions can be some what intimidating. I relly think some of these camera companies creat devices that are more complicated than they need to be. I will likely not use 50-70 percent of this cameras capabilities. If you want great pictures for a good price,buy this one on Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "Pavlo",
      "helpful_votes": 0,
      "publication_date": 20090525
    },
    {
      "title": "Get great photos and lots of compliments on the photography!",
      "text": "This is a fabulous camera. I've had it since just before Christmas 2008, and I always have great comments from people who think I'm a \"natural\" photographer and want to know what kind of camera I have. It is truly the camera. I love the tracking, because taking pictures of animals and children can be tricky, but this camera makes it easy. Also, the zoom is phenomenal. I can sit in the balcony at my kids' schools and zoom in to their faces and the photos turn out as if I were taking the picture from right in front of them. Wow.",
      "rating": 5.0,
      "verified": true,
      "author": "darnett",
      "helpful_votes": 2,
      "publication_date": 20090507
    },
    {
      "title": "Gift",
      "text": "I bought this camera as a gift for my girlfriend who loves this camera. It takes fantastic pictures with excellent quality. I also preferred this camera to others as the glass is leica quality... for those of u who don't understand that. well leica also makes super high quality microscopes for medical personnel- that means they know what they're doing. A lens is uber important for pics. The ease of use of this camera is point and shoot but you can alter the settings extensively so that it becomes akin to a manual. It also looks great and zooms well. I'm considering buying one for myself actually.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy",
      "helpful_votes": 2,
      "publication_date": 20081012
    },
    {
      "title": "Amazing photos, Top rated camera!!!",
      "text": "It's my first Lumix/Panasonic camera and I love it. My previous camera was a 5-6 year old Sony 5.0 MP with 3x optical zoom.[...] Anyways, I have used this Panasonic FZ28 for a month now and have made some prints already and took a lot of shots. Battery life is above average. I am still learning all the options and features it has but it makes very good quality photos in it's Intellegent Auto mode. I am very pleased with my purchase and will recommend this camera to anyone who is looking for a camera in this category. I did a lot of research and this one came on top of the list. [...]",
      "rating": 5.0,
      "verified": true,
      "author": "Elijah,",
      "helpful_votes": 0,
      "publication_date": 20090629
    },
    {
      "title": "Perfect for the Scrapbooker and for Family Images.",
      "text": "Great Camera! Great Price! We owned a FinePix S3000 before this camera. I debated whether to get an SLR camera, or to stay with the full body point and shoot cameras. I chose the latter with the Panasonic Lumix DMC FZ28k so my wife would be able to get video as well with photo. The HD Video on this camera is amazing. You can't find many camera's with both a great picture, while also being able to get a nice video quality as well. This was a great buy, I recommend for anyone trying to just have a nice quality camera before taking a big step into the SLR's.",
      "rating": 4.0,
      "verified": true,
      "author": "CaptainInsano25",
      "helpful_votes": 3,
      "publication_date": 20081213
    },
    {
      "title": "AMAZING CAMERA",
      "text": "I did a lot of research regarding these 18x DSLR-like 10mp cameras. There are a number of them on the market. Some are cheaper than the Lumix. The reviews I saw put the Lumix at the top of the line. I believe it. When you understand how to maximize the use of this camera, it is absolutely fantastic! I will be taking it to Italy and Greece in August instead of my Nikon D40 and lenses (which I absolutely love). I need something versatile, simple and space saving. Graet buy! Don't hesitate!",
      "rating": 5.0,
      "verified": true,
      "author": "Arthur C. M.",
      "helpful_votes": 0,
      "publication_date": 20090702
    },
    {
      "title": "Great Camera",
      "text": "Have had several digital cameras throughout the years-this is the best so far. If you are looking for a solid alternative to a DSLR you won't be disappointed. The camera is accurate in its native setting readings, light in weight, great lens, long zoom, and RAW capable (but you will have to go to software site to download correctly). Camera takes fantastic pictures with great color reproduction. It is fairly easy to learn, and easy to use. Will take great sports pics, keeping up with the action. Have read numerous reviews by consumers and pros, and they all like this camera. Give this one a serious look-and you can't beat the price/value.",
      "rating": 5.0,
      "verified": true,
      "author": "James E. Bryan",
      "helpful_votes": 3,
      "publication_date": 20090522
    },
    {
      "title": "Panasonic FZ28",
      "text": "Purchased this camera several weeks ago to replace a Sanyo Xacti C6 that failed a while earlier. The FZ28 is nothing like the Sanyo. The Sanyo was very small and lightweight and it was extremely simple to use for both pictures and movies. However, the overall picture/movie quality and low-light performance of the Sanyo was inferior to the FZ28. I am very pleased with the FZ28; the iA mode setting makes it a simple to use point and shoot camers. The 18X optical zoom is amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Kennedy",
      "helpful_votes": 4,
      "publication_date": 20081124
    },
    {
      "title": "Awesome camera!",
      "text": "I love the features that come with this camera. Do be wary that the cord that connects it to the computer can break. Fortunately I had extra cords the same size, and it loads the pictures and accesses the camera from the computer perfectly. I did end up getting a replacement cord that was for the camera, and it has worked ever since. I was really surprised at how light this camera is. Everything works great.",
      "rating": 5.0,
      "verified": true,
      "author": "collin",
      "helpful_votes": 0,
      "publication_date": 20130116
    },
    {
      "title": "I love this camera",
      "text": "I love this camera. For a point and shoot the picture quality is very good. It is a bit bulky for a point and shoot, but not so bulky that it is a problem. I have a carrier pouch that attaches to my belt in which I carry the camera and it doesn't seem awkward or in the way. I would recommend this camera for sure. The Panasonic Lumix line is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20140602
    },
    {
      "title": "Wow!",
      "text": "I know people will cringe when I say this but just put it on auto and shoot. Picture looks awsome in HD 16:9 format on my 46\" Samsung LCD. This is the only way to truly view the pictures. Slide show is great. Makes your jaw drop every time. My wife says \"You could be a professional photographer\". Trust me, I don't even know how to use the camera other than auto. I guess a great camera makes up for a bad photographer. :)",
      "rating": 5.0,
      "verified": true,
      "author": "pooman",
      "helpful_votes": 6,
      "publication_date": 20081212
    },
    {
      "title": "Fantastic Camera",
      "text": "Read alot of reviews before making this purchase. I couldnt be more pleased with the camera. Takes great pictures with minimal effort. The zoom is terrific. The picture quality and zoom are second to none when considering size, ease of use, and cost. I can wear it around my neck all day turned on, snap pictures at will with no lenses to change or carry. The battery will last more than a day. Picture quality rivals that of cameras that cost three to four times the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Duke",
      "helpful_votes": 2,
      "publication_date": 20090527
    },
    {
      "title": "Great camera at reasonable price",
      "text": "I've had about 8 point-and-shoot cameras, and this is by far the best. Great pictures, easy to use for the amateur, and excellent battery life. I almost didn't buy it because it has it's own rechargeable battery - I like having AA's around for emergencies - but the OEM battery lasts forever. We took hundreds of pictures over a week at T-Giving and it kept on giving. Buy one spare, keep it charged, and you won't have a battery problem.",
      "rating": 5.0,
      "verified": true,
      "author": "GW",
      "helpful_votes": 0,
      "publication_date": 20081214
    },
    {
      "title": "Very happy at this point,, looking to learn more as time goes on",
      "text": "I am just going to throw this out there... I have loved the ease this Panasonic Lumix DMC-FZ28K has shown me.. So far I have pretty much only shot pics in the Intelligent setting,,, which is a perfect name for that.. Since I am on the learning curve of it all.. I am looking forward to using all the finer applications that I think this camera has to offer... The clarity of my pics coming right out of the camera with very little editing in the photofun studio program has me excited to learn more about the camera and photography.",
      "rating": 4.0,
      "verified": true,
      "author": "J. KEETON",
      "helpful_votes": 2,
      "publication_date": 20090321
    },
    {
      "title": "Excellent Camera",
      "text": "I am a very amateur photographer, but I wanted a camera that would give me good zooming capabilities and good pixel resolution - without having to spend the money for an SLR. I found exacly what I was looing for in the Lumix FZ28. It makes it easy to take great photos. By great I mean photos that I like to come back and look at again and again. If you are looking for a camera in the $250 - $300 range that will make you look like a better photgrapher than you really are - this is it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ulster Tom",
      "helpful_votes": 0,
      "publication_date": 20090601
    },
    {
      "title": "A camera to celebrate",
      "text": "I'm an incessant bird watcher and have feeders in the front and back of our house which attract hummers, gold finches, Eurasian collared doves, black-headed grosbeaks and many others. The telephoto attributes of this camera are outstanding, even when using the digital extension. I'm amazed at the sharpness, the correct exposure and ability of the camera to capture a quality image even when movement is involved. I'm am now a devoted fan. Kudos to Panasonic and Leica.",
      "rating": 5.0,
      "verified": true,
      "author": "Herman Kagan",
      "helpful_votes": 0,
      "publication_date": 20090625
    },
    {
      "title": "High Achiever",
      "text": "Very sharp lens and takes filters. Exceptional ability to lock focus even on extended telephoto and, in my case, on a moving platform ( a lobster boat in Maine ) The IA feature is also extremely effective - having been a manual film camera user, then a SLR and DSLR user I do not recall ever having left a camera on automatic - this was a first for me. Exposure compensation through a dedicated button was also helpful - indeed the use of dedicated buttons for a number of functions, in addition to the usual menu access made me feel quite at home. Good work Panasonic.",
      "rating": 5.0,
      "verified": true,
      "author": "Aware",
      "helpful_votes": 15,
      "publication_date": 20081003
    },
    {
      "title": "best for the money",
      "text": "bought 1 month in order to replace my 4 years old Olympus C8080 Wide Zoom. In picture quality, FZ28 almost reaches C8080 standard.(Olympus got huge optical lens 5x Zoom, Highest Quality in its field) In Camcorder aspect, FZ28 surpasses 8080 a mile. HD 1280x720 60 FPS vs 320x240 15 FPS. The cons are: cheap built, all plastic (C8080 is build on Magnesium alloy which is still shining when sets side by side with FZ28K), moive sound is low and dull. HD movie recording time is 9 minutes a time no matter how big your SD memory card is. But for the money, FZ28K is the best. C8080 costed me $[...] four years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "qw",
      "helpful_votes": 3,
      "publication_date": 20081221
    },
    {
      "title": "Years later, I still love it",
      "text": "Great camera, great buy. The camera is easy to use and impossible to master...there is so much you can do with this little machine. Great quality and very durable. I'm still learning how to use some of the more advanced features. I love the fact that I can take dozens of pictures of an athlete by just holding down the button. Awesome quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert K Anderson",
      "helpful_votes": 0,
      "publication_date": 20130204
    },
    {
      "title": "I absolutely loved it and recommended it to many of my friends",
      "text": "I have had this camera for 6 months and have taken thousands of pictures in a variety of situations. I absolutely love it. I have gotten lots of compliments for my photos. The camera is so light and so easy to handle that I can take it everywhere I go. The battery lasts a long time. The menu is easy to use. I also love the ability to choose to use the viewfinder instead of the LCD when outdoors.",
      "rating": 5.0,
      "verified": true,
      "author": "Busy at Having Fun",
      "helpful_votes": 3,
      "publication_date": 20090402
    },
    {
      "title": "Excellent for Non-Professional Photographer",
      "text": "I love this 'point 'n shoot' camera for its ease of operation, quality of image and the incredible zoom. It is one of the best out there. It is really hassle free once you have read briefly though the manual and played a bit. As previous reviewers have mentioned, it takes amazing photos. Totally happy with this purchase! Update 14 Jan, 2009. Took it on Safari in Botswana and got AMAZING shots of animals and the HD video works brilliantly. The zoom is fantastic. This is a great camera for the price. So glad that I did not go the SLR route.",
      "rating": 5.0,
      "verified": true,
      "author": "Lyle French",
      "helpful_votes": 4,
      "publication_date": 20081019
    },
    {
      "title": "Surpasses Expectations!",
      "text": "I began taking scores of photos as soon as the camera arrived and have been completely satisfied with its performance. I use it a lot for nature shots, especially animals, and find the 18X exceptionally effective. My HAND-HELD SHOTS AT FULL 18 X zoom are amazing - strong testimony to Panasonic's image stabilization. My assessment now is that this may be the last camera I will need. Worth the full 5 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Arthur E. Dewey",
      "helpful_votes": 6,
      "publication_date": 20081122
    },
    {
      "title": "great in every way",
      "text": "I've had the camera for about a month now and I love it. The quality is fantastic and the 18x zoom is incredible. Can't wait to take it to football games in the fall. Haven't used it enough without recharging the battery to see how it lasts. Functions are easy to use and understand. Love the ability to zoom during videos feature, and the wide range is very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Kremer",
      "helpful_votes": 0,
      "publication_date": 20090205
    },
    {
      "title": "I love this Lumix",
      "text": "I love this Lumix. Would be 5 stars but, where you insert the cord stopped connecting to the computer. It was used alot. The first one I bought was new for a few hundred bucks. The second was cheap, about $100 and still works.",
      "rating": 4.0,
      "verified": true,
      "author": "crustomer#1",
      "helpful_votes": 0,
      "publication_date": 20151001
    },
    {
      "title": "Wouldn't Trade It For Anything Else!",
      "text": "I've had the FZ28 for about a month and a half now, and i take it everywhere! it iA feature suits most situations perfectly, but, it's user-friendly enough to allow for my still-learning-self to experiment when i want without getting overly frustrated. it takes crystal clear HD video, as well. the only complaint, occasionally, the Flash washes out pictures. but, only occasionally, and that may very well be my own fault. if you purchase this camera, you'll be pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "John Wayne",
      "helpful_votes": 0,
      "publication_date": 20081228
    },
    {
      "title": "Excellent camera - Glad I bought this",
      "text": "I was really confused which camera to buy and finally I had settled with this camera. I am really glad that I bought this. It is not heavy for the size and easy to handle. iA mode is great to handle all situations. Output of the picture is great. One great thing I want to highlight is HD movie recording. It is so great that I am not using my 3CCD camcoder at all nowadays. The only issue in movie recording is auto focus. It is little slow for capturing motions. Overall it is an excellent camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Kalatheeswar Sivanesan",
      "helpful_votes": 2,
      "publication_date": 20090112
    },
    {
      "title": "Great and Simple",
      "text": "I purchased this camera to replace an old one. It is just wonderful. Very simple to use and makes great pictures. In automatic mode, just point and shoot, or you can fiddle with the settings for the perfect shot. The 18X optical zoom is just right but it also has a up to 72X digital zoom. I would recommend this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "jaxmike",
      "helpful_votes": 0,
      "publication_date": 20090621
    },
    {
      "title": "Amazing Camera!",
      "text": "I previously owned a Canon 20d and this camera is amazing, lightweight, and 4 times cheaper! I love it and would recommend it for anyone wanting vivid pictures. The colors are so much more vivid and \"alive\" much more than the Canon 20d. I love how with one lense I can get both closeup and zoom telephoto shots. Great camera, you will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Parker",
      "helpful_votes": 0,
      "publication_date": 20090526
    },
    {
      "title": "Panasonic Lumix DMC-Fz28K",
      "text": "It is fair to say, I am not a great photographer, just a good amatur one. I like the camera for the most part. However I feel the telephoto pictures I take with it are not as sharp as I would like, perhaps because some of the telephoto capability is optical and some digital? That disappointed me. I really haven't checked with Panasonic about it. Perhaps I am at fault? Great macro and snapshot pictures! Easy to use and light to carry around.",
      "rating": 4.0,
      "verified": true,
      "author": "Julie A. Ramsey",
      "helpful_votes": 0,
      "publication_date": 20090508
    },
    {
      "title": "Fantastic camera for the price",
      "text": "Wanted a new camera for vacation that was smaller that the digital SLR (Nikon D100). I was shocked to find out that this camera took better pictures, was alot easier to use (ie idiot proof) & was very very portable. All for less than $300. If you are looking for a bridge camera, you have to consider this model",
      "rating": 5.0,
      "verified": true,
      "author": "Texas Proud",
      "helpful_votes": 0,
      "publication_date": 20090720
    },
    {
      "title": "Very happy for",
      "text": "As soon as I learn all the features , Very happy for now",
      "rating": 5.0,
      "verified": true,
      "author": "Art Sing",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "A really great point and shoot.",
      "text": "I was looking for a great balance between a point and shoot and the prosumer SLR's. This camera definitely fits that profile, easy to use and takes great shots with little effort. I've never had a camera that was good at taking the extremely close macro shots, but...wow, this camera is amazing at it. The zoom is incredible and I would go out on a limb and say it's probably the best camera in this price range by far.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Page",
      "helpful_votes": 2,
      "publication_date": 20081223
    },
    {
      "title": "Awesome Camera",
      "text": "I love this camera so much. I lost our FZ18k - so I went shopping for another one to see if there was anything else out there. And it all came back to this one - the FZ28k. There's a few things different about this one - but it's all good stuff. I really like the video feature on it as well. We hardly ever use our camcorder anymore. This camera really surpasses them all. I'm so glad that we purchased from Amazon also. I got my order early and there were absolutely no mishaps with my order. I will order again from Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Roxanne Vernor",
      "helpful_votes": 0,
      "publication_date": 20090107
    },
    {
      "title": "Great camera",
      "text": "I have had the camera for 6 years and it works like a charm! Never had any problems with it. I cannot compare the camera to others, but the pictures are of great quality. Tom",
      "rating": 5.0,
      "verified": true,
      "author": "T. Jasiak",
      "helpful_votes": 0,
      "publication_date": 20140322
    },
    {
      "title": "awesome!",
      "text": "AWESOME transaction! The open box camera was indeed like new, and functioned perfectly. Shipping was prompt, and communication was excellent. By the way, the Panasonic camera while not as widely known as the \"big boys\", definitely is capable of taking great pics and is a great camera!",
      "rating": 5.0,
      "verified": true,
      "author": "Ace",
      "helpful_votes": 3,
      "publication_date": 20090304
    },
    {
      "title": "Spectacular camera",
      "text": "This camera is absolutely amazing. The intelligent auto-focus produces beautiful photos - regardless of distance to subject. It is by far the smartest camera I have ever owned. The buttons are well placed and the menus are uncluttered and easy to change a function or setting. But even if you don't use all of the bells-and-whistles this camera is worth the price just for the incredible pictures it produces. If I needed a second camera I would definitely buy another just like this.",
      "rating": 5.0,
      "verified": true,
      "author": "Jillo Gelatin",
      "helpful_votes": 0,
      "publication_date": 20090325
    },
    {
      "title": "Some Camera",
      "text": "Having researched and purchased this for a present for my daughter I have little time to play with it but what I have so far discovered it is nearly equal to my pricey full size SLR in function and so far picture quality. But for a mid size campact camera with what appears to be an excellent lens(not interchangeable) but with this one, and the average person, you would need nothing else. Most of all it is small enough to carry in a large pocket or purse.",
      "rating": 4.0,
      "verified": true,
      "author": "Penguin",
      "helpful_votes": 6,
      "publication_date": 20081112
    },
    {
      "title": "A Nice and Versatile Super Zoom",
      "text": "The Panasonic Lumix DMC-FZ28K is a versatile super zoom camera. I bought this camera for travel purpose. I had in the past a Sony H1. That camera gave me alot of nice pictures when I travelled. I wanted a camera that will give sharper and better pictures. After reading a lot of reviews online, I decided to try this. I am not disappointed. Its not perfect but better than my old H1.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20090106
    },
    {
      "title": "seems to be a good camera",
      "text": "seems to be a nice camera but the used one i received had a defect . after a few pictures the battery indicator would show the battery was almost all discharged.",
      "rating": 2.0,
      "verified": true,
      "author": "norm",
      "helpful_votes": 0,
      "publication_date": 20161012
    },
    {
      "title": "Great camera - no brain necessary",
      "text": "I bought this camera for the 18xzoom which is just great! It also works well for the \"point and shoot\" at close or far range and if you wish to do the adjustments yourself, you can. It is light enough to wear around your neck when travelling and the photos I developed had wonderful detail, close or far. Great buy for just over $300.",
      "rating": 5.0,
      "verified": true,
      "author": "B.R.",
      "helpful_votes": 0,
      "publication_date": 20081013
    },
    {
      "title": "wonderful camera",
      "text": "I love this camera. It takes amazing pictures; I love the zoom. I am interested in learning more about photography and wanted a camera that could grow with me a bit. It can take a while to set up (especially if you don't know what you're doing), but it has the intellegent auto available for quick pics. It is threaded for filters, though I haven't purchased any. I'm looking forward to learning how to use all the features.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Neri",
      "helpful_votes": 2,
      "publication_date": 20090107
    },
    {
      "title": "Close to DLSR for Point and Shoot Price",
      "text": "Super Zoom captures a great images. Convenient auto modes for the inexperienced. Images suffer after ISO 400. Typical for Lumix. Takes near HD video with quick-time format although the audio is sub par. The price has ballooned to Six hundred plus. I paid under three hundred for this unit October '08. Maybe a testament to the quality of this camera. This unit has never found a way to disappoint me.",
      "rating": 4.0,
      "verified": true,
      "author": "Keith D. Robinson",
      "helpful_votes": 0,
      "publication_date": 20090919
    },
    {
      "title": "Five Stars",
      "text": "Great camera for close up work. Has performed flawlessly. My second one.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161113
    },
    {
      "title": "Can't say enough about this camera",
      "text": "It has an amazing focus range. It takes \"wow\" pictures. It has a beautiful user friendly design and better quality than I expected (and I expected excellent quality). I sold my Sony DSLR to get this and I am glad I did. I'm very impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen P. Fletcher",
      "helpful_votes": 2,
      "publication_date": 20090416
    },
    {
      "title": "PanasonicLumix DMC-FZ28S 10.1MP Digital",
      "text": "I absolutely love this camera. The instruction book is not clear but after you figure things out you will love it. I wanted to be able to take pictures of action shots in flourescent lighting and zoom in... perfect. Low-light concerts and zoom in... perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "P.R.",
      "helpful_votes": 3,
      "publication_date": 20090224
    },
    {
      "title": "Really a good camera",
      "text": "I got this camera 4 years ago and so far even though it is and old camera, it stills deliver a good picture quality and functionality. But of course right now you have better options.",
      "rating": 4.0,
      "verified": true,
      "author": "E. Sanchez",
      "helpful_votes": 0,
      "publication_date": 20130305
    },
    {
      "title": "Best beng for your buck",
      "text": "Good camera i bought fz7 few years beck and i was happy with it so when i needed new camera i look for canon and other but after much consideration i bought this and its much better then my old lumix lot less noice then fz7 and i like ai mode for my wife just point and shoot and they have new function auto focus tracking ones somthing gets in focus and you can lock focus and it tracks the subject cool in short good for someone who wants manual control yet simple enough for my better half to use",
      "rating": 5.0,
      "verified": true,
      "author": "U. Patel",
      "helpful_votes": 0,
      "publication_date": 20081213
    },
    {
      "title": "Great camera, almost smarter than me",
      "text": "After looking at a lot of online camera reviews, I decided to purchase the Panasonic Lumix DMC-FZ28K. I had originally planned to buy a Nikon coolpix, but the online revews were poor. What a great buy - takes excellent digital pictures, compact, yet feature rich. Took it on my vacation to Mexico and yielded fantastic results. A great camera for beginners, intermediates, and even advanced photography buffs.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Knudson",
      "helpful_votes": 0,
      "publication_date": 20090626
    },
    {
      "title": "Great Camera",
      "text": "You can't beat this camera. It goes from 27mm wide to all the zoom you could need. It is lightweight, and has a Leica lens. As a professional photographer, I like simplicity. This camera is tops. My second Panasonic Dmz Fz series camera and I recommend it for anyone who doesn't want to lug around heavy cameras, but still can get shots that can compete with the best of them. And dollar for dollar, I'd say it is probably the best buy around.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher W. Raymond",
      "helpful_votes": 10,
      "publication_date": 20081022
    },
    {
      "title": "excellent camera",
      "text": "its a grand camera, much better than my former point and shoot film camera. excellent focus, pictures, movies, special effects,etc. no problems whatsoever. very happy i purchased through amazon--made my christmas very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Stu Erris",
      "helpful_votes": 0,
      "publication_date": 20090107
    },
    {
      "title": "Five Stars",
      "text": "Excellent camera. I've had it a long time and still use it. Rich",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Leamon",
      "helpful_votes": 0,
      "publication_date": 20151230
    },
    {
      "title": "Good camera",
      "text": "I have the FZ 20 and thought this would be an upgrade but feel it is not quite as good as the FZ20 in photo quality.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Bock",
      "helpful_votes": 0,
      "publication_date": 20150128
    },
    {
      "title": "HAPPY so far!!",
      "text": "Felt a little flimsy when it arrived.. turned out 2 b quite a nice camera EZ 2 use & quality pics",
      "rating": 4.0,
      "verified": true,
      "author": "Whaaat",
      "helpful_votes": 0,
      "publication_date": 20140330
    },
    {
      "title": "Great do-all camera.",
      "text": "Love it. Still have it. Haven't learned all its setting yet! Had it about 7+ years. Batteries last long time.",
      "rating": 5.0,
      "verified": true,
      "author": "redhead65",
      "helpful_votes": 0,
      "publication_date": 20131202
    },
    {
      "title": "Great pics, easy to use.",
      "text": "Took this to Australia recently and found it consistently gives great pics in the automatic mode, easy to adjust when conditions or a pic can be improved. Great camera for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "S.Wirth",
      "helpful_votes": 0,
      "publication_date": 20090520
    },
    {
      "title": "Fantastic Camera",
      "text": "After spending about a month researching consumer cameras I decided to buy the Lumix fz28. After a week I am very pleased with my purchase. While my wife uses the fz28 as a simple point & shoot I like using the camera in manual. the lens is amazing. 18X and at the two extremes of its range you can barely detect signs of image distortion. By the way the HD videos are very good.",
      "rating": 5.0,
      "verified": true,
      "author": "RonB",
      "helpful_votes": 4,
      "publication_date": 20081219
    },
    {
      "title": "I love this camera.",
      "text": "I have had this camera for three years. It is a little slow when taking pictures, but it takes really good pictures. I love this camera!",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20131115
    },
    {
      "title": "Panasonic Lumix FZ28K  another improvement from Panasonic",
      "text": "This is small camera and technically an improvement compared to the fz30 and 20, my previous cameras. The Smallness tends to seem to make it shake a bit more ( unsteady). Actuals pictures are very good. Low light, resolution and a bit more zoom are improved. Features are good!!!! Price is reasonable. Just to note, I just saw some Best Buy 20X zooms from other suppliers, a bit more costly. Go look.( then buy the FZ)",
      "rating": 5.0,
      "verified": true,
      "author": "Perry H. Wilhelm",
      "helpful_votes": 0,
      "publication_date": 20081102
    },
    {
      "title": "Five Stars",
      "text": "I am very accordant with the purchase very good quality",
      "rating": 5.0,
      "verified": true,
      "author": "Pio antonio aponte lopez",
      "helpful_votes": 0,
      "publication_date": 20141101
    },
    {
      "title": "Panasonic Camera FC-FZ28",
      "text": "Very good camera. Takes beautiful pictures. Lots of features for a creative user. Deserves 5 stars, but for detailed settings procedures difficult to remember. But, one can use Intelligent Auto Mode to take very good pictures without referring to the manual at all. Used it for a year. Definitely a 4* camera.",
      "rating": 4.0,
      "verified": true,
      "author": "TusharG",
      "helpful_votes": 0,
      "publication_date": 20110407
    },
    {
      "title": "$100 less for a lot of camera",
      "text": "A Leica lens on a Japanese camera.... Impressive most of the time. Bought it for photographing small objects to sell on ebay It has truly center waited focusing. Small objects photographed with ease (if you really work on the lighting) and 10.1 MP means that you can crop a small piece from a large image, then resize it back to full screen. Color balance has been a little bit of a challenge - but with enough lights and trying different combinations - I have it working fine. For $250 a bargain, for $350 I would look elsewhere.",
      "rating": 5.0,
      "verified": true,
      "author": "John C. Awald",
      "helpful_votes": 0,
      "publication_date": 20090115
    },
    {
      "title": "still works great. Great for learning manual",
      "text": "7 years in, still works great. Great for learning manual.",
      "rating": 5.0,
      "verified": true,
      "author": "martin g",
      "helpful_votes": 0,
      "publication_date": 20151001
    },
    {
      "title": "Incredible camera!",
      "text": "when I bought this camera I have some problems finding the size of the lens (diameter), becase some filters does not fit without an adapter. if somebody helps its a 46mm diameter lens! I bought this camera for a non professional use, but has a lot of functions just like a pro, I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaime Ascencio",
      "helpful_votes": 0,
      "publication_date": 20090612
    },
    {
      "title": "Great for the price",
      "text": "Good quality, good value, great intuitive interface. As a training bra to a SLR, it's holds its own and is great to look at what it produces until you upgrade to the real deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Michael",
      "helpful_votes": 0,
      "publication_date": 20090106
    },
    {
      "title": "DMC-FZ28",
      "text": "I have only had the camera for a week so far I am happy with it still working on some of the things that it will do but over all I glad that I did not go with a SLR",
      "rating": 5.0,
      "verified": true,
      "author": "R. Quillen",
      "helpful_votes": 0,
      "publication_date": 20090603
    },
    {
      "title": "Best buy",
      "text": "I bought 2 years ago, i been using it ever since and got no complains, taken any where with and collecting very good pictures, you can set manual the aperture, ISo to improve quality image.",
      "rating": 5.0,
      "verified": true,
      "author": "Humberto Henriquez",
      "helpful_votes": 0,
      "publication_date": 20110522
    },
    {
      "title": "U cnt get Wrong with this one",
      "text": "Just got the camera 3 days back, its a Flawless camera with No match !! Takes stunning picture with real good shutter speed. Overall I am very much satisfied and truly this is one of my Best camera ever bought by me. I highly recommend this to anyone who wants a great camera with real good zoom !!! Just go for it, I assure you, you wouldn't regret !!",
      "rating": 5.0,
      "verified": true,
      "author": "Luv Kashyap",
      "helpful_votes": 3,
      "publication_date": 20081011
    },
    {
      "title": "Lumix and Seller are great",
      "text": "The Lumix came fully packaged and in good shape. The delivery time was four days by regular shipping. I'd buy from the seller again--no questions asked.",
      "rating": 5.0,
      "verified": true,
      "author": "RWH",
      "helpful_votes": 0,
      "publication_date": 20090310
    },
    {
      "title": "Indoor pictures are a huge disappointment",
      "text": "We are having the same experience as Byron Bunge (review on December 14): using the iA (Intelligent Automatic) setting, we are getting consistently bad indoor photographs. Without the flash, the pictures are correctly exposed but almost invariably blurry, apparently due to camera shake or incorrect focus. With the flash activated, there is a HUGE shutter lag. We had to go back to our point and shoot camera to capture our holiday pictures. After reading all these glowing reviews, we have to presume that we got a lemon. Anyway, we're calling Panasonic and will be returning the camera unless they can help.",
      "rating": 2.0,
      "verified": true,
      "author": "Rosenhaus",
      "helpful_votes": 9,
      "publication_date": 20090104
    },
    {
      "title": "Great camera for the money",
      "text": "I've taken several pictures. The zoom works well; I get nice pictures with the camera set to 3MP (=~1.5MB/photo), which allows a 32.1x zoom. The minor annoyances: 1) The filenames of the photos can't seem to be set to the date taken (they are sequentially numbered) 2) video mode is on the opposite side of the dial from the intelligent autofocus (annoying because these are my two favorite modes). 3) The video files are so big that my older computer (Inspiron 6000 laptop) can't play them back smoothly (I may need to lower the resolution for video)",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Metz",
      "helpful_votes": 7,
      "publication_date": 20081018
    },
    {
      "title": "Good camera",
      "text": "Easy to use camera. Works great. It can shoot great video as well. My only complaint is it uses a special .RW2 RAW format, so I can't shoot pictures in RAW format and import them into Apple iPhoto or Apple Aperture 2.",
      "rating": 4.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 5,
      "publication_date": 20081220
    },
    {
      "title": "Great Camera!!",
      "text": "This has been very important to us. Use it to capture all holidays and birthdays of the grandchildren. Beautiful pictures and I am not a camera buff.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Graffeo",
      "helpful_votes": 0,
      "publication_date": 20130218
    },
    {
      "title": "Great Camera!!!!!",
      "text": "Great camera! Easy to use, takes awesome photos. No way you can find a better camera at this price. I'm been into photography for about 4 years now, I've used Nikon, Sony and Kodak but this Panasonic beats them all! I'm very, very, impressed!!!! From 1 to 10 this is a 9.7 to be sure! Check out the review @testfreaks.com",
      "rating": 5.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 5,
      "publication_date": 20081124
    },
    {
      "title": "Best for the money",
      "text": "High end lens and sensor give it great performance. The ability to shoot HD video and create RAW images make it the best deal for the money. It may not look or cost like a thousand dollar camera but it sure does think and act like one.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark D. Watkins",
      "helpful_votes": 0,
      "publication_date": 20090622
    },
    {
      "title": "Great Bridge Camera",
      "text": "Not much to say. Everything's been covered already. It's indeed a great camera. iA mode works great but I prefer manual controls. I've noticed some barrel distortion at wide angle. But this is what you get with a wide angle lens. Btw, you'll need a class 6 SDHC to fully enjoy recording HD movies.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Kurbanov",
      "helpful_votes": 4,
      "publication_date": 20081112
    },
    {
      "title": "Great camera!",
      "text": "Easy to use, great photos. I used it different times of the day indoors and outdoors and I am very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Passion for food",
      "helpful_votes": 0,
      "publication_date": 20090111
    },
    {
      "title": "Excellent Camera for the price!",
      "text": "Takes Awesome Shots Practically Every Time! The built in stabilizer keeps pictures still and crisp. The zoom is Great! I have been making breath taking panoramas also with the free software it comes it. I love this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Life Explorer",
      "helpful_votes": 0,
      "publication_date": 20090118
    },
    {
      "title": "Research and shopping at Amazon pays off",
      "text": "It took months and I actually bought The Nikon D60 and returned it first. I got such A super deal on a excellent camera. Video and photos are near pro in quality.",
      "rating": 5.0,
      "verified": true,
      "author": "jonjfromSFBay",
      "helpful_votes": 0,
      "publication_date": 20090215
    },
    {
      "title": "nice photos",
      "text": "nice photos, but i am surprised it doesnt come with an ac adapter. I was surprised how light weight but powerful the camera is",
      "rating": 4.0,
      "verified": true,
      "author": "Gamer guy",
      "helpful_votes": 0,
      "publication_date": 20090120
    },
    {
      "title": "Beyond expectations",
      "text": "This was a great purchase. Easy point and shoot, plus all the bells and whistles for you camera junkies!! You should see the pics developed from this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas H. Carroll",
      "helpful_votes": 2,
      "publication_date": 20081112
    },
    {
      "title": "thoroughly satisfied",
      "text": "This camera is amazing. I love the ultra zoom and the photos are clear. It is also user friendly.",
      "rating": 5.0,
      "verified": true,
      "author": "agent77",
      "helpful_votes": 2,
      "publication_date": 20090615
    },
    {
      "title": "Panasonic DMC-FZ28: A great camera.",
      "text": "I've had this camera for 4 weeks now, and couldn't be happier. It is a great camera for amateur photographers (like me) who don't want to pay for an SLR but still want to take great pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "Chad Barrows",
      "helpful_votes": 0,
      "publication_date": 20091030
    },
    {
      "title": "Excellent pictures",
      "text": "Camera takes excellent pictues, can get super close. Only negative is that is is rather large, comes with a neck strap not a wrist strap, won't be taking it everywhere, but great for special occasions where you don't mind carrying a larger camera. I already have an everyday camera.",
      "rating": 4.0,
      "verified": true,
      "author": "GrumpyOne",
      "helpful_votes": 0,
      "publication_date": 20090130
    },
    {
      "title": "Who guarantees?!",
      "text": "The product is excellent. However I can't say the same thing about the seller. When I recieved the package there was a missing piece of it.The hood (firstly included in the package) wasn't there.I e-mailed the seller and I received an answer reasuring me that he would send me the hood wherever.I sent him a new adress and after that I didn't get any more information. I tried to reach the same mail later, but all I got was a massage that such e-mail adress does not exist...",
      "rating": 3.0,
      "verified": true,
      "author": "Mon",
      "helpful_votes": 0,
      "publication_date": 20100929
    },
    {
      "title": "Great camera, Great price",
      "text": "The camera is very easy to use, takes great pictures with little effort. Pictures a crisp, flash is excellent, lens is great. 18X zoom in sports mode takes great pictures. Camera has plenty of features and options. I highly recommend this camera. If you get it you won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Armonicash",
      "helpful_votes": 3,
      "publication_date": 20081122
    },
    {
      "title": "Good Camera, Misleading Spec's",
      "text": "I bought this camera because I like the way that the Panasonic camera operates. I currently own a DMC-FZ7 and it has served me well for over 2 years. I thought I would upgrade to the FZ28 for the increased zoom length and 10 megapixel ccd. However, what Panasonic doesn't make clear is that the zoom extension is on the lower end of the focal range. The zoom range on the high end is still the same (35 mm equivalent of 468 mm)as that of the FZ7 with the 12 power zoom. It's a great camera, easy to use but I'm disappointed over the zoom range.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Martin",
      "helpful_votes": 10,
      "publication_date": 20081027
    },
    {
      "title": "Perfect as a semi-professional camera",
      "text": "If you are looking for a semi-professional camera, this is your guy. The only problem I had was the image quality under certain lighting, like in Arizona botanical desert garden. The pictures did not appear in real colors, but instead in a smoothed way. Video capturing and zoom performance are both very well. Would recommend the newer versions FZ38 or 40.",
      "rating": 5.0,
      "verified": true,
      "author": "sumeyra ummuhan demir",
      "helpful_votes": 0,
      "publication_date": 20110426
    },
    {
      "title": "Awesome Camera!",
      "text": "Wow! Great 18X WA Lens, 10 MP Processor, Image Stabilization,and Red Eye Reduction! Easy to use and great price! All in one awesome camera!",
      "rating": 5.0,
      "verified": true,
      "author": "S Murphy",
      "helpful_votes": 2,
      "publication_date": 20081129
    },
    {
      "title": "Article as described",
      "text": "Article as described sent within a reasonable time the article complies with the data described at the time of purchase, the price is reasonable.",
      "rating": 5.0,
      "verified": true,
      "author": "ULISES ARGUELLO SALGADO",
      "helpful_votes": 0,
      "publication_date": 20130107
    }
  ],
  "product_meta": {
    "title": "Panasonic Lumix DMC-FZ28K 10MP Digital Camera with 18x Wide Angle MEGA Optical Image Stabilized Zoom (Black)",
    "description": "Color:BlackFROM THE MANUFACTURER\n\n\n Panasonic's Lumix DMC-FZ28 digital camera boasts a premium 27mm wide-angle Leica lens with an 18x optical zoom, ideal for tight indoor shots and long-distance action photos. The 10.1-megapixel digital camera also features an enhanced Intelligent Auto Mode (iA), with the new AF (auto focus) Tracking function, making it easier for photographers at any level to shoot sharp, well-focused photos, even when the subject is moving -- making it ideal for action shots. \n\nThe AF Tracking function, the latest component to be added to Panasonic’s iA system, allows users to lock focus on a moving subject. The camera then automatically tracks the subject as it moves, keeping it in focus without the need to hold the shutter halfway down. AF Tracking makes it easier to capture moving subjects and spur-of-the-moment action shots. The AF Tracking technology also improves Face Detection (up to 15 faces), by providing continuous adjustment of the focus and exposure, even if the face is turned away from the camera. \n\nIn addition to the AF Tracking functionality, Panasonic’s other iA technologies include: \n\n *  Intelligent Exposure: Helps prevents photos from being under- or over-exposed by instantly analyzing the framed image and adjusting the brightness in areas that are too dark because of dim lighting, backlighting or the use of the flash. The camera will automatically adjust the brightness accordingly. \n *  Digital Red-eye Correction: This feature helps to eliminate the red-eye problem that sometimes results when taking flash shots at night. Incorporated into the camera, the built-in flash emits a small preliminary flash before the main flash, detects red-eye and will digitally correct it. \n *  MEGA O.I.S.: Gyrosensors detect hand-shake and the lens system shifts to compensate, helping to prevent hand-shake from creating a blurry image. \n *  Intelligent ISO: Determines if the photo subject is moving and changes the ISO setting and shutter speed accordingly, thus giving a blur-free photo. \n *  Intelligent Scene Selector: Senses the ambient conditions, recognizes the shooting environment and will automatically select the appropriate scene mode from: Scenery, Portrait, Macro, Night Portrait or Night Scenery mode. This intuitive technology, helps the consumer use the most common scene modes that are built into the camera, but often go unused, without making any manual adjustments. \n *  Face Detection: Detects faces in the frame (up to 15 faces), even if they are moving, and selects optimal focus and exposure settings so portraits come out clear. \n *  Quick AF (Auto Focus): Starts focus on the subject by just pointing the camera at the subject, thus minimizing the AF time. \n\nThe high-quality, high-performance Venus Engine IV supports a faster response time, allowing the camera to shoot 2.5 shots per second at full resolution and 13 shots per second in High-Speed Burst mode. In High Sensitivity mode, the FZ28 can shoot up to ISO 6400 in extremely low-lit situations. The Lumix DMC-FZ28 also is equipped with a 2.7-inch large, high resolution LCD with 230,000 pixels, and a high resolution electric viewfinder equivalent to 201,600 pixels. \n\nThe DMC-FZ28 also features High Defintion (HD) video capabilities with a resolution of 1280 x 720p at 30fps. Still photos can also be shot in a 16:9 aspect ratio for optimal full-screen viewing on a HDTV. Panasonic VIERA Plasma or LCD HDTVs also feature an integrated SD Memory Card slot, allowing users to easily view photos by simply inserting the SD Memory Card into the convenient SD Card slot built into the TV. Consumer can also enjoy watching videos in HD quality and view still images by connecting the DMC-FXZ28 via an optional Panasonic component cable (DMW-HDC2). \n\nAdditional features of the Panasonic Lumix DMC-FZ28 include:  *  Image Leveling: When a captured image \"leans\" to the right or left because the camera was held at a slight angle when the photo was taken, the Image Leveling function rotates the image to straighten it and crops the unnecessary edges. No computer needed! \n * Scene Modes: The DMC-FZ28 offers a total of 37 scene modes to respond easily to any shooting situation. The new Pin Hole and Film Grain modes add unique, film camera-like effects and ambiences to images. Additionally, the actual effects of the scene mode can be viewed on the LCD before taking the shot. \n *  Flash: Reaches a distance of 8.5 meters at the wide setting and 5.4 meters at the telephoto setting (ISO AUTO). \n *  SILKYPIX Developer Studio 3.0 SE: Software application comes bundled with the DMC-FZ28 for editing and developing images in the RAW file format.",
    "rating": 4.5,
    "feature_bullets": [
      "10-megapixel CCD captures enough detail for photo-quality poster-size prints",
      "18x wide-angle MEGA Optical Image Stabilized zoom lens",
      "2.7-inch high-resolution LCD screen; HD video capture",
      "Full SLR-like manual operations including aperture, shutter, program and full manual modes with Advanced Scene modes",
      "Capture images to SD/SDHC memory cards (not included)"
    ],
    "specifications": {
      "Product Dimensions": "4.65 x 3.5 x 2.95 inches",
      "Item Weight": "14.7 ounces",
      "ASIN": "B001CCLBSU",
      "Item model number": "DMC-FZ28 Black",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.5 out of 5 stars397 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#281,808 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "July 22, 2008",
      "Manufacturer": "Panasonic"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": ""
  }
}