{
  "website_summaries": [
    {
      "verdict": "The Sony Cyber-shot DSC-S750 is a convenient, budget-friendly pocket camera that takes pictures--just not very good ones.",
      "pros": [
        "Inexpensive",
        "good looking, lightweight, and small",
        "fast, accurate face detection"
      ],
      "cons": [
        "Slow",
        "battery/memory card door opens too easily",
        "mediocre photo quality"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 6.0,
        "Performance": 6.0,
        "Image quality": 5.0
      },
      "publication_date": 20081016,
      "rating": 6.2,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "The ease of operation",
      "text": "I was very pleased with the seller who substituted this newer model for what I had originally ordered then added the original model for free and also another battery. I am a little bit disappointed that it doesn't use regular batteries but rather one that has to be recharged with a charger. The seller was extremely helpful with a lot of e-mail and phone contact.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Albertson",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Very pleased",
      "text": "The seller sent a beautiful little camera that was exactly what it replaced. It worked perfectly with my software installed years ago from Sony. He threw in a battery and charger and a beautiful little case for it. The whole package looked like it was new. Very impressed with the price and fast shipping. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Horn",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Sony Cybershot",
      "text": "Sony Cybershot is a good little camera for the price. One can take pictures in color, sepia, or black and white. The camera also has video capabilities. I bought the last two Cybershots as gifts for my grandchildren. It's an affordable camera to give pre-teens a real camera experience. The only thing I've found wrong with the one I own is that the battery latch isn't secure. It pops open easily, and the camera turns off in the middle of a shot. Otherwise, I've been pleased enough with the pictures that I have chosen this camera for my grandchildren.",
      "rating": 4.0,
      "verified": true,
      "author": "Teacher",
      "helpful_votes": 5,
      "publication_date": 20081221
    },
    {
      "title": "Sony DSC-S750 7.2MP",
      "text": "This is an older model,but still takes great pics. It has a re-chargeable battery pack that seems to last longer than the re-chargeable AA NIMH's used on the DSC-S650. Also it doesn't come falling out when the door is open.2-Gig memory card stores over 10K pics on J-peg for E-mail. Saved $$ by purchasing an open box. Looks & performs as new. Has features I'll never use,but just point & click & your done. I'd recommend this to anyone looking for a digital camera except(yawn)a snobby/nerdy Tech geek which could spot flea poop in black pepper. They'll have to spend more $$$ to be satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "R.B.",
      "helpful_votes": 2,
      "publication_date": 20090612
    },
    {
      "title": "MIsleading",
      "text": "It was listed as used good working. First time use (2 Dec after our 30 day return window) It was whiting out the photos so they were unrecognizable. We somehow corrected this but now it leaves lines across the picture like shooting through louvered blinds. I do not consider this good.",
      "rating": 1.0,
      "verified": true,
      "author": "James Dunkle",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Great camera for the price",
      "text": "I gave this camera to my daughter for Christmas and she has been clicking her way to nirvana. I live in Jamaica, and getting the sony card was a little challenging, but we managed to find that for the additional storage. Also unfortunately that memory stick does not fit in my card reader. Other than that, the camera has been great so far. Perfect for a budding point-and-click photographer.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Jones",
      "helpful_votes": 0,
      "publication_date": 20090120
    },
    {
      "title": "Easy and inexpensive replacement",
      "text": "I love this camera. I had damaged my old one and wanted another, so I shopped around and found the exact same camera with a case which will prevent the damage I experienced on the old one. And, at a really good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Tower",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Love my cameras",
      "text": "I had a camera like this before so I wanted the exact same kind. It works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Superdie of Largo",
      "helpful_votes": 0,
      "publication_date": 20170702
    },
    {
      "title": "Great point & shoot for the price",
      "text": "I was looking for a simple point and shoot for my nephew to use at a decent price and I found it. He's been loving it so far!! Shipping was quick and hassle free.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Ferro",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Beware",
      "text": "Had no battery bought one had to get another one +a charger and a reader total 78.00 for a 15.00 camera but it’s better than my first one I like it despite the headaches",
      "rating": 4.0,
      "verified": true,
      "author": "jim",
      "helpful_votes": 0,
      "publication_date": 20130802
    },
    {
      "title": "Excellent product",
      "text": "A great camera, just what you expected from what you can see in the pictures, worth the money for the good quality",
      "rating": 5.0,
      "verified": true,
      "author": "Nelson Zambrano",
      "helpful_votes": 0,
      "publication_date": 20131217
    },
    {
      "title": "Nice easy to use camera",
      "text": "What I liked about the camera ( i have since gave it to a friend that is not good with digital equipment, due to its ease of use ) long battery life. easy to set , and to switch from photo to camera, I feel the volume control could be better. but the photos taken are adequate for general use.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeffrey Huff",
      "helpful_votes": 0,
      "publication_date": 20150408
    },
    {
      "title": "Excellent value",
      "text": "The camera was received quickly after ordering and is a solidly built and compact camera. Very good value for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "H. W. Richardson",
      "helpful_votes": 2,
      "publication_date": 20090131
    },
    {
      "title": "Sony Camera",
      "text": "Love this camera. Would highly recommend it! It's easy to use, requires very little previous knowledge of digital cameras. Heads up however, you will have to purchase memory card separate.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20090101
    },
    {
      "title": "sorry",
      "text": "Perhaps my fault,??!!! the camera does not work properly, it does not focus, blurry pics and the lens does not always retract,..this was not noted in the sale, I should of bought new, I guess,..dont always believe what you read",
      "rating": 1.0,
      "verified": true,
      "author": "dennis white",
      "helpful_votes": 0,
      "publication_date": 20130108
    },
    {
      "title": "it takes amazing, high quality pictures",
      "text": "it takes amazing, high quality pictures, and okay video. the only con is you can't use the zoom when recording video.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele Stachowiak",
      "helpful_votes": 0,
      "publication_date": 20140830
    },
    {
      "title": "A lot for a little",
      "text": "This is a pretty good camera to have in your pocket or purse. I have a Fuji S7000 and a Sony H2 and they are to big to haul around on short trips into town and errands. This is perfect for that. It provides a good quality photo for a small price. Very nice compact camera",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20090125
    },
    {
      "title": "Not as good as I thought.",
      "text": "I initially liked this camera when I bought it, but the longer I have it, the more things I don't like. The construction has this cheap-feeling plastic around it and you need to have a very steady hand to take a clear picture. The shutter speed is also way too long.",
      "rating": 2.0,
      "verified": true,
      "author": "Blake Owens",
      "helpful_votes": 0,
      "publication_date": 20090131
    },
    {
      "title": "Nice for the price",
      "text": "Very vice camera with 7.2MP for the price was good. Viewfinder difficult to see in some light situations.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas M. Key",
      "helpful_votes": 2,
      "publication_date": 20090204
    },
    {
      "title": "love the new camera",
      "text": "I couldn't be happier with this camera. It does everything it claims and it takes great pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Graziano",
      "helpful_votes": 0,
      "publication_date": 20090128
    },
    {
      "title": "Sony cyber-shot DSCS750",
      "text": "The item came on time, and was exactly what was expected. It was a gift and the recipient was delighted to receive it.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Burke",
      "helpful_votes": 0,
      "publication_date": 20090130
    },
    {
      "title": "very user friendly-takes great photos",
      "text": "I bought this camera for my husband who hates having to read pages of instuctions. He found the camera very easy to use, needed to refer to the manual for certain features and found those easy to understand-HE LOVES THIS CAMERA!!!",
      "rating": 4.0,
      "verified": true,
      "author": "L. Guidotti",
      "helpful_votes": 25,
      "publication_date": 20080720
    },
    {
      "title": "Good Value",
      "text": "Nice camera for the price. Easy fit in purse or pocket to always have handy.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Ortiz",
      "helpful_votes": 0,
      "publication_date": 20090215
    },
    {
      "title": "Good camera",
      "text": "This camera it is good, it have a large lcd screem to see your pictures, and the pictures are made with good quality.",
      "rating": 4.0,
      "verified": true,
      "author": "E. Albino",
      "helpful_votes": 5,
      "publication_date": 20080908
    },
    {
      "title": "Nice Cute Little Camera But No More Pictures Review.",
      "text": "My husband purchased this little camera at a retail store for around 100 bucks when we were on vacation. It takes nice pictures and the battery lasts long. The only problem is not long after we purchased it, something went wrong with it and the pictures review button didn't function any more. That means we can still use this camera to take pictures but we can't review the pictures we take until we uploaded them into the computers. I wonder anyone out there has any idea regarding how to fix it. Thanks.",
      "rating": 3.0,
      "verified": false,
      "author": "AMAZON-LOVER",
      "helpful_votes": 0,
      "publication_date": 20160220
    },
    {
      "title": "Perfect for a basic digital camera.",
      "text": "This camera doesn't disappoint for a simple, compact digital camera. It has the ability to take 7MP size pictures, but if you're only ever going to view them from a computer and print 5\"x7\", you'll only need to shoot at 3MP, which then gives you even more storage capacity. I recommend investing in a 2GB memory card for this device.",
      "rating": 5.0,
      "verified": false,
      "author": "Paul Moser",
      "helpful_votes": 2,
      "publication_date": 20090210
    },
    {
      "title": "Good, cheap camera.  But don't drop it!",
      "text": "I used this camera for almost a year and I liked it very much considering the price. My one big complaint, however, is poor construction. I dropped it once, from about 2.5 feet, and it never worked again. To have it fixed by Sony costs almost as much as a brand new camera. So, in short, it is a decent camera, but it is not sturdy and is definitely \"throw-away\" if it's damaged at all.",
      "rating": 3.0,
      "verified": false,
      "author": "Jason Signalness",
      "helpful_votes": 0,
      "publication_date": 20091102
    },
    {
      "title": "So far, so good...",
      "text": "Well I purchased this camera a couple of days ago and really enjoy it so far. It is very compact (nice to carry in pocket) and has a 'sleek' design. The pictures look fantastic and the different modes make it easy to get the perfect picture. On the other hand, my camera's lense makes a strange noise upon opening (maybe they all do that). Also, most normal SD memory cards are not compatible- meaning I had to get a new memory card. Other than that this camera is a great pick- I recommend it.",
      "rating": 5.0,
      "verified": false,
      "author": "Kathy D. Sterrett",
      "helpful_votes": 12,
      "publication_date": 20080814
    },
    {
      "title": "Great camera for its price",
      "text": "I got this camera recently and must say that its a very nice camera for its price. The pictures are very clear and the camera has a very sleak design. The one thing I don't like is the fact that it takes only memory sticks (which are expensive), but then thats something common to all sony cameras. All in all I love this camera.",
      "rating": 5.0,
      "verified": false,
      "author": "Anonymous",
      "helpful_votes": 17,
      "publication_date": 20080911
    },
    {
      "title": "Not a very good camera",
      "text": "I received this camera for Christmas and I have to say...Both my LG Chocolate and my wife's LG Voyager cell phones take better pictures. Indoors, outdoors, close, distant, all the pictures were pretty bad. I found someone to buy it on that other resale site. I'm looking to buy a Canon.",
      "rating": 2.0,
      "verified": false,
      "author": "M. Fettig",
      "helpful_votes": 0,
      "publication_date": 20090503
    },
    {
      "title": "Sony Cyber-shot DSCS750 7.2 MP Digital Camera with 3x Optical Zoom",
      "text": "Excellent with only one imperfection the battery. I am not sure yet but when the battery needs recharged, must be removed from camera and placed in a charger. I purchased the optional power pack hoping that as the battery needs charging that I can power the camera with AC and this will recharge battery. Like I said I have not had item long enuf to see. Other than that I am satisfied with this purchase.",
      "rating": 4.0,
      "verified": false,
      "author": "Charles Smith",
      "helpful_votes": 0,
      "publication_date": 20090116
    },
    {
      "title": "Awsome Camera!",
      "text": "Sony has been around for a long time,and they have a great reputation,all my stereo components are Sony.This Sony camera is compact,lightweight,and takes great photos.Great zoom,much better than most cameras,the overall performance is awsome!",
      "rating": 5.0,
      "verified": false,
      "author": "Jim Mac",
      "helpful_votes": 3,
      "publication_date": 20081104
    },
    {
      "title": "Older model. Be sure and purchase the memory card ...",
      "text": "Older model. Be sure and purchase the memory card as they are no longer sold in stores for this model.",
      "rating": 3.0,
      "verified": false,
      "author": "Lynne",
      "helpful_votes": 0,
      "publication_date": 20140916
    },
    {
      "title": "OK Camera, but cannot email pics",
      "text": "If anybody can tell me how to scale down the picture quality so that every photo I take can be easily emailed, I would be delighted to learn it! I take lots of pictures for work, and I just assumed when I bought it that I'd be able to set the default image quality, like every other camera I've owned. Anyway, technically not a review, but that drawback makes it virtually useless for my purposes. Nowadays, even for recreational use, everybody I know wants to be able to email his or her pics, and printing them is not so important. So 7.1 megapixels are great when you need them, but...",
      "rating": 3.0,
      "verified": false,
      "author": "Gene Basler",
      "helpful_votes": 2,
      "publication_date": 20090209
    },
    {
      "title": "AWFUL!",
      "text": "This camera is the worst camera I've ever owned. I had the camera for about 2 months, and the USB part of the camera broke. I sent it in for repair (per Sony), and it came back to me still broken. Sony was VERY unhelpful and didn't even seem to care about my broken camera. I will never buy another Sony camera. This camera does take good pictures, but if you're looking to download the pictures onto your computer then I would suggest finding a better camera! Buyer Beware!!!!",
      "rating": 1.0,
      "verified": false,
      "author": "K. Guerin",
      "helpful_votes": 9,
      "publication_date": 20090105
    },
    {
      "title": "Broke really easily",
      "text": "This worked great until we downloaded the first set of pictures. As soon as the pics finished being put on the computer, the camera never worked again.",
      "rating": 1.0,
      "verified": false,
      "author": "Bunnee",
      "helpful_votes": 2,
      "publication_date": 20090107
    },
    {
      "title": "Good Camera",
      "text": "This is a very good camera for a gift. My issue with it is that it does not come with the memory stick and the memory stick for this camera is a special one. The pictures are great and the camera is easy to use. Thanks.",
      "rating": 3.0,
      "verified": false,
      "author": "A. Ibeagha",
      "helpful_votes": 3,
      "publication_date": 20090114
    },
    {
      "title": "great!!",
      "text": "great product, im having a lot of fun with this. looks great, works great, takes excellent pictures, who could ask for more with such a low price.",
      "rating": 5.0,
      "verified": false,
      "author": "A. Wallace",
      "helpful_votes": 0,
      "publication_date": 20090512
    },
    {
      "title": "Sony got greedy",
      "text": "I recently bought this new Cyber Shot camera to replace my old one which is about 4 yrs old, and for which I had invested about $100 on memory sticks. The new one arrived just in time for my trip to visit my sister. After taking only a few pictures the camera ran out of memory. Then I discovered my memory cards would not fit into the new camera. Shame on Sony for trying to force those of us who want to stay with Cyber Shot cameras to have to buy new memory sticks. I returned the camera and will look for something besides Sony.",
      "rating": 2.0,
      "verified": false,
      "author": "Catherine Crozier",
      "helpful_votes": 3,
      "publication_date": 20090208
    },
    {
      "title": "great camera",
      "text": "I replaced a 4.2MP with this one. It is just what I wanted. I also got a 4 GB memory stick for $12. The pics are great & I can choose the resolution I want. Since I don't print at 11x17, I save space on the picture files.",
      "rating": 5.0,
      "verified": false,
      "author": "W. Mosby",
      "helpful_votes": 0,
      "publication_date": 20090125
    },
    {
      "title": "Not good colors with flash.",
      "text": "I'm not really happy with this camera when it comes to colors when using flash. I worked before with P200 and colors were always vivid, here you can't really choose white balance and it makes colors far too white, even in P mode. Nice green shirt looks gray etc. If you need something with true colors I wouldn't recommend this camera. I'm going to return it and buy better model.",
      "rating": 3.0,
      "verified": false,
      "author": "NewYorkx",
      "helpful_votes": 20,
      "publication_date": 20080919
    },
    {
      "title": "Happy",
      "text": "With me being a very picky person when it comes to camera's, I have to say that I was very impressed with the Sony S750. I've taken pictures indoors and outdoors and have been very pleased with the outcome. I was also impressed after I downloaded the images on my computer. I like that it's small and affordable. I would recommend anyone to purchase it.",
      "rating": 5.0,
      "verified": false,
      "author": "C. Huggins",
      "helpful_votes": 34,
      "publication_date": 20080515
    },
    {
      "title": "great camera",
      "text": "i carry it with me every where i go. great compact, battery effecient, and easy to operate digital camera.",
      "rating": 4.0,
      "verified": false,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20090308
    },
    {
      "title": "Great item",
      "text": "I am happy with my purchase of Sony Cyber shot . I am enjoying it.",
      "rating": 5.0,
      "verified": false,
      "author": "Anjana J. Patel",
      "helpful_votes": 0,
      "publication_date": 20090218
    },
    {
      "title": "AMAZING!",
      "text": "This is an amazing little camera. I recently purchased it and it takes GREAT pictures and can take pictures in pretty much any light. I HIGHLY recommend this camera to anyone who reads this. Definatly worth the money.",
      "rating": 5.0,
      "verified": false,
      "author": "Kerianne M. Roehl",
      "helpful_votes": 16,
      "publication_date": 20080514
    },
    {
      "title": "Hector J",
      "text": "This item is a great purchase , it gives you some option to get pictures in any whether as well as videos from all that you want and love.",
      "rating": 5.0,
      "verified": false,
      "author": "Hector J",
      "helpful_votes": 9,
      "publication_date": 20080613
    },
    {
      "title": "disappointed",
      "text": "The camera functions fine, however, I thought this was a newer model. I had just purchased the newer model for my son at the same price, but could not find it available in the stores for my daughter. I thought this was the same thing. It's not and she knows. Very disappointing.",
      "rating": 3.0,
      "verified": false,
      "author": "Sharon M. Goettel",
      "helpful_votes": 0,
      "publication_date": 20090222
    },
    {
      "title": "Good",
      "text": "So far so good. Buyer is lighting fast. Received the item within 24 hours",
      "rating": 4.0,
      "verified": false,
      "author": "Maran K",
      "helpful_votes": 0,
      "publication_date": 20081214
    }
  ],
  "product_meta": {
    "title": "Sony Cyber-shot DSCS750 7.2 MP Digital Camera with 3x Optical Zoom",
    "description": "Sony dsc-s750 digital camera\n\nFROM THE MANUFACTURER\n\n\n With Sonys Face Detection technology, the DSC-S750 detects up to three faces and optimizes focus, exposure, and color for accurate, natural photos of family and friends. You can capture stunning detail thanks to its 7.2-megapixel resolution and 3x optical zoom lens, while high ISO sensitivity helps reduce blur when shooting indoors or at twilight, even without flash. Compose your shots on the bright, 2.5-inch LCD screen. \n\nCyber-shot DSC-S750 Highlights \n\n7.2-megapixel Super HAD CCD More megapixels give you more detail and definition when you make big prints or crop in tight on your subject. The advanced Sony Super HAD (Hole Accumulated Diode) CCD design allows more light to pass to each pixel, increasing sensitivity and reducing noise. \n\n2.5-inch TFT LCD display The large, bright 2.5-inch TFT LCD display makes it easy to compose shots, check results, and read menus in sharp natural color, even in bright sunlight. \n\n22 MB internal memory Even if you forget your flash memory card, you can get the shot because 22 MB internal memory lets you capture a limited number of shots with in-camera convenience, then easily transfer your shots to a PC or optional Memory Stick Duo media. \n\nMemory Stick Duo media convenience A built-in slot accepts optional Memory Stick Duo media or Memory Stick Pro Duo media -- the compact, high-capacity storage media that make it easily to upload photos to your PC and are compatible with millions of devices worldwide. \n\nBurst mode You can fire off three shots automatically at 1-second intervals (VGA standard mode) or 2-second intervals (full resolution mode) -- a great way to capture a childs first steps or a pets best tricks. \n\nConvenient Photo modes To adjust quickly for specific shooting situations, you can choose from several convenient photo modes, including Auto, Program Auto, and Scene Selections such as Twilight, Landscape, Soft Snap, Snow, High Sensitivity, and Beach environments. \n\nFace Detection Face Detection technology automatically controls focus, exposure, color, and flash to help reveal faces in shadows, make skin tones look more natural, reduce red-eye, and eliminate harsh facial glare, so your photos bring out every expression on every face in every shot. \n\nFunction Guide This beginner-friendly function helps manage various functions and settings by displaying the description of chosen functions or settings on the LCD screen. The Function Guide can also be switched off. \n\nHigh Sensitivity (ISO 1250) mode For sharp, flash-free photos without blur, high sensitivity (ISO 1250) allows shooting at higher shutter speeds for better pictures in low-light conditions -- great for birthday parties, indoor gatherings, and candid portraits. \n\nPicture Motion Browser software Supplied software makes it easier to upload, organize, and search photos on your PC. When shooting photos using your camera and an optional GPS unit, the software even provides a convenient map view function that lets you sort photos by location and display their origin on a world map. \n\nQVGA Movie mode Capture 320 x 240 audio/video clips at high frame rate (up to 30 frames per second), with length limited only by the capacity of your media. \n\nSimple setup controls A quick press of the Home button opens your user-friendly graphical interface -- and you can select functions by simply moving a cursor vertically or horizontally to the appropriate icon. Function names and the on-screen Function Guide display make it easier to learn camera setup operations. \n\nSmart Zoom feature The Sony Smart Zoom feature intelligently \"crops into\" the central portion of interest in your photo, helping avoid the image degradation of other digital zooms. \n\nStamina Battery Power Provides extended battery life and shooting capacity when using a fully charged Lithium Ion battery-- enough to cover a long weekend or a whole vacation.",
    "rating": 3.7,
    "feature_bullets": [
      "7.2-megapixel CCD captures enough detail for photo-quality 14 x 19-inch prints",
      "3x optical zoom; 2.5-inch LCD display",
      "Face Detection; Smart Zoom feature",
      "High Sensitivity (ISO 1250) mode",
      "22 MB internal memory; capture images to Memory Stick Duo/Pro Duo media"
    ],
    "specifications": {
      "Product Dimensions": "3.58 x 1.06 x 2.2 inches",
      "Item Weight": "5.9 ounces",
      "ASIN": "B0011E67AG",
      "Item model number": "DSCS750",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "3.7 out of 5 stars66 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#197,740 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 23, 2008",
      "Manufacturer": "Sony"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": ""
  }
}