{
  "website_summaries": [
    {
      "verdict": "Stands out for its very loud alarm and a nice feature set, but consider using your own tape or other mounting method with these.",
      "pros": [
        "Comes in packs of 1, 2, 4, 6, or 12",
        "Alarm is a loud 120 decibels",
        "Also has an off and Chime mode",
        "Easy to install",
        "Small and discreet",
        "Batteries included",
        "Button to test for low battery"
      ],
      "cons": [
        "Tape isn't great, which can cause the alarms to go off on their own",
        "Some reports of alarms arriving broken"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "REALLY LOUD...",
      "text": "We were looking for something to curb our nearly four year old son from walking out into the backyard without asking us first. I didn't want to lock the door, I wanted him to learn the lesson that he needs to communicate his wants/needs to us when we tell him to. This did the trick. Very loud, very effective, and no more sneaking out without us knowing about it.",
      "rating": 4.0,
      "verified": true,
      "author": "Truck_Driving_Pottymouth",
      "helpful_votes": 410,
      "publication_date": 20170622
    },
    {
      "title": "Great product for a great price",
      "text": "Great product for a great price. Good quality and the sound is loud enough to hear. The product does come with batteries all you have to do is pull the plastic tabs off the batteries, install and you have a great security system for $10. Important part for me is the volume of the sound and I am very pleased with the product! Easy setup.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie W.",
      "helpful_votes": 32,
      "publication_date": 20180309
    },
    {
      "title": "Wish it was user error, but alas.",
      "text": "I was really looking forward to receiving this product so that we could have some extra protection for our 3-year-old, who loves to open ALL of the doors. ;) The product was delivered yesterday, so my husband and I got to work to install it on our front door. Unfortunately, the chime only went off when I switched it on. After trying numerous times to have the two pieces match up and test opening the door, we finally decided that it didn't want to work and put it away. Hopefully, this particular set of door chimes were just defective. Waiting for a response from the manufacturer for a replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "B Scott",
      "helpful_votes": 14,
      "publication_date": 20190520
    },
    {
      "title": "Good price, very loud, cheap adhesive",
      "text": "I like these things, but I have a couple of problems. I bought them so that my mother would be able to hear if her doors are being opened. First, when they go off you think, \"Bloody hell, the Luftwaffe are coming in for another run.\" There is no volume control at all, full volume all the time. I found a way around this by taping a small piece of cardboard over the emitter. Second, the adhesive on these things is wimpy. One stayed up relatively well, but the other fell back off the door within a half hour of installing it (proper method - thoroughly scrubbing the area with alcohol and allowing it to dry completely.)",
      "rating": 3.0,
      "verified": true,
      "author": "big daddy",
      "helpful_votes": 18,
      "publication_date": 20161104
    },
    {
      "title": "Great with young kids",
      "text": "My 4yr old loves to open the front door, even when it is locked, to delivery men or just to go outside. This alarm has been SO helpful in knowing when she is doing so. Our house has 3 levels, so if I am in the basement doing laundry, I will know when she opens the door on the main floor. The alarm is VERY loud and reminds me of 7-eleven, but we put a piece of tape over the speaker so it is not so alarming. But we can still hear it from every room in our house.",
      "rating": 5.0,
      "verified": true,
      "author": "LilyBelle",
      "helpful_votes": 14,
      "publication_date": 20170323
    },
    {
      "title": "Poor Sticker Quality",
      "text": "The sound is great! Definitely loud enough to let anyone (including your neighbors) that it's going off. However, the stickers that are attached are very poor. They do not stick to my wood door frame. I set them up one night and fell asleep and that night the alarm went off and I thought someone broke in. Turns out they just fell off.",
      "rating": 2.0,
      "verified": true,
      "author": "L & J ",
      "helpful_votes": 15,
      "publication_date": 20170602
    },
    {
      "title": "Terrible.",
      "text": "Fell off of the door after about 1 week and woke me up in the middle of the night thinking someone had gotten in the house. Terrible.",
      "rating": 1.0,
      "verified": true,
      "author": "Calvin R",
      "helpful_votes": 49,
      "publication_date": 20150729
    },
    {
      "title": "Works great, just missing one feature...",
      "text": "These work great! and do exactly what they're supposed to. I put one on my front door and one on my sliding glass door. They both perform well. I have two small complaints - one, the adhesive used to put it on can be kind of wobbly. Bumping it can knock it askew. Two, I wish there was some way to set the alarm when I'm NOT in the house. At least it would make a loud enough noise to alert my neighbors to an intruder if it did. But it requires the door to be shut for it to be set or it goes off.",
      "rating": 4.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 4,
      "publication_date": 20190303
    },
    {
      "title": "READ THIS REVIEW",
      "text": "I’ve used these at 3 apartments and the house we just bought. I originally bought these when I lived alone as a female on a ground floor in a larger city in not the best area. Then I moved and moved again and now we have a house with a security system and I still use these. The batteries last forever. They’re loud. And they will chime if the window is opened. They give me a sense Of security even with double hung windows. Even when I lived alone in a big city. These just helped give me a sense of peace in my home and they offer a less expensive reliable alternative to a security system.",
      "rating": 5.0,
      "verified": true,
      "author": "kodi_ko3",
      "helpful_votes": 2,
      "publication_date": 20200207
    },
    {
      "title": "If it worked as designed I would like it a lot more.",
      "text": "If it worked as designed I would like it a lot more. Got this a few weeks ago for our small storefront business and it was working great for a while. But now it randomly goes into alarm mode instead of chime. I can not get it to go back to chime. Side note: it is pretty loud! It startles some of our customers even after I muffled it with some fabric and tape.",
      "rating": 1.0,
      "verified": true,
      "author": "Joel and Carissa",
      "helpful_votes": 9,
      "publication_date": 20171116
    },
    {
      "title": "Easy to install, very loud",
      "text": "Update: 1 of the 2 won't stick anymore. Less than 3 months and falls off. Easy to install. I have it on chime mode. I was worried that I wouldn't hear it. Yeah... no worries there. It's an ear splitting chime. It's supposed to chime when you open AND close the door. It only chimes when I open the door. I wish the chime was at a more normal doorbell volume. It is advertised as a doorbell chime.",
      "rating": 1.0,
      "verified": true,
      "author": "dragonflower",
      "helpful_votes": 4,
      "publication_date": 20190325
    },
    {
      "title": "Inexpensive But Effective",
      "text": "I am quite happy with these door/window alarms. The two sides do not need to touch or line up perfectly for the alarm to work properly. I have some strange door frames but was still able to make these work for my needs. I dis have to add an extra foam sticky pad under one to make the connection, but the problem is with my door frame and not the alarm. The chime and alarm settings are plenty loud. I would definitely but these again!",
      "rating": 4.0,
      "verified": true,
      "author": "Heather Johnson",
      "helpful_votes": 10,
      "publication_date": 20170127
    },
    {
      "title": "Keeps little ones out of where they shouldn't be",
      "text": "This thing is no joke. It is crazy loud. Perfect for us. After our 3 young children wouldn't stop raiding the pantry at night to make science experiments with our groceries, we installed a simple hook lock.... that was way too easy for them to figure out. The won that round. I put this bad boy up and I can hear the pantry being opened from 2 floors up. Not to mention the enjoyment I got out of the startle it gave my sneakiest child the first time he set it off. I've won this round. I imagine this would also work well for less crazy applications but what can I say other than parenting is hard and this helped.",
      "rating": 5.0,
      "verified": true,
      "author": "H.kess",
      "helpful_votes": 2,
      "publication_date": 20200113
    },
    {
      "title": "Easy installation, works well",
      "text": "We bought these to alert us when our 5 year old twins opened the entry door and door to the garage. Installation was very simple, the alarm is loud enough, the only thing is that I wish the alarm didn't shut off when you closed the door, I wish it stayed on longer so that it had to be disarmed and reset, because if you miss the alarm and the child shuts the door the alarm shuts off and you may not realize the child has opened the door and gone out, but it's been working really well for us so far. I am satisfied with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "MarshaOz",
      "helpful_votes": 4,
      "publication_date": 20181004
    },
    {
      "title": "Very loud and will wake you up",
      "text": "Very handy if you don't have a security system from adt, simplisafe, ect...gives you piece of mind knowing you will be woke up if someone opens the door or window(wherever you choose to put it). Most criminals will flee when it goes off but for the desperate ones that don't, at least u have a heads up to grab your gun/weapon and call 911. If no self defense weapons in your home then you will have the heads up to call 911 and lock your door or go to kids room and lock the door. Will wake you up even if they close the door right away which will turn the alarm off(only flaw with this item).",
      "rating": 5.0,
      "verified": true,
      "author": "G. Hofmann",
      "helpful_votes": 7,
      "publication_date": 20170124
    },
    {
      "title": "Highly Recommend For Homes with Kids",
      "text": "So, after a lot research and reading reviews. I decided to purchase these to entry/exit monitors my 5 and 8 year olds while in the house. It is too easy to get busy and have a child just walk outside the house. These proved to be perfect. If you have kids then I recommend this product. Plus, even for security. You will know when someone enters or leaves the house or room you are monitoring. I can't emphasize how better we feel knowing these are now in place. The price is nothing compared to the confident feeling you get knowing they are in place. Easy to setup and use and they come with everything you need to get started.",
      "rating": 5.0,
      "verified": true,
      "author": "Trusted Buyer",
      "helpful_votes": 7,
      "publication_date": 20160922
    },
    {
      "title": "Incredibly great. I bought this after my Autistic daughter got ...",
      "text": "Incredibly great. I bought this after my Autistic daughter got out of the front door. Now we have something to warn us.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 16,
      "publication_date": 20180110
    },
    {
      "title": "Too damn loud!",
      "text": "you can either turn the volume off or leave it on hideously loud level. what on earth?? Why not do a few level settings so you don't wake up the whole house each time you open the door. Thanks but no thanks. returned it. if you need this to just be the audible loud alarm when someone opens the door then cool, use it. great deal and great price. but if you plan on using it for everyday opening and closing action then you'll go nuts in no time!",
      "rating": 1.0,
      "verified": true,
      "author": "LA ShopperTop Contributor: Golf",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Barely can hear one foot away!",
      "text": "This was a hugh disappointment. I do not know how loud 120 decimals is (that is how it was advertised) but two foot away it is barely heard! My dripping faucet makes more sound! HUGH DISAPPOINTMENT. Can't get to post office to return, as we are still \"social distancing\" so will eat this cost.",
      "rating": 1.0,
      "verified": true,
      "author": "Busy Senior Citizen",
      "helpful_votes": 2,
      "publication_date": 20200626
    },
    {
      "title": "Not fail proof but great price/product!",
      "text": "The only reason I am giving these a 4 instead of 5 stars is because a well-known competitor offers 4 for the same price at Home Depot. Besides that, the chime is awesome for my toddler during the daytime and the way I was able to install on my awkward shaped doors is incredible! I didn't see anyone else post this out of the over 2500 reviews. Excited to say the least. Will update as needed and I also reinforced the tabs with duck tape for added security. Thanks for a solid product. Much more peace of mind when my husband is away at work!",
      "rating": 4.0,
      "verified": true,
      "author": "Vargas Family",
      "helpful_votes": 2,
      "publication_date": 20180929
    },
    {
      "title": "Not as loud as expected from Ad description",
      "text": "Very small. Sticks in place with double sided tape. Magnet has to be Very close to alarm. Slide switch very small. High pitch sound not as loud as desired. Requires special button batteries. Batteries are expensive & harder to find compared to AAA batteries like the old Doberman door alarms used to have. Overall: disappointed. Guess better than nothing. Would have preferred something more substantial.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Good",
      "text": "These are good, easy to install. The only downside for me is that I would prefer to have the switch settings on the outside of the unit in case I want to switch from bell to alarm. Instead, you have to slide the battery cover off and make the switch. This can be annoying because the tiny batteries fall out sometimes. There are units out there that do have the switch on the outside, but this isn't one. These are good though, does the job.",
      "rating": 3.0,
      "verified": true,
      "author": "Sheila Kosztowny",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "It's a hit or miss....",
      "text": "I bought these to put on my front door as a chime. They worked great when removed from the package and tested. As soon as I installed the first one it immediately became unpaired with the sensor and no longer functioned as it was supposed to. I can't even return them as there's apparently a no return policy on this item. I wonder why 🙄....",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 4,
      "publication_date": 20190131
    },
    {
      "title": "Works for clever toddlers!",
      "text": "I have more locks than fort Knox but my toddler is active and clever so this loud little gem gives me peice of mind for when were home and at night we have it on the screen door so if someone was to Jiggle the door hard enough it would go off! Current events are also making nervous and this would give is time to get prepared to defend ourselves if the police no longer come!",
      "rating": 5.0,
      "verified": true,
      "author": "hair biz",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "These are LOUD and do the job!",
      "text": "These alarms do the job. They are easy to install, it took my boyfriend all of 10 min to install both. We bought them for our back door leading to the pool. Our two year old has figured out how to open the back doors and we needed an alarm to know if she goes outside. Well these do the job. They are LOUD!! The chime will make you cringe it's so loud. But it's a good peace of mind knowing I can hear the chime or the alarm thought the house. We have a 1,666 sq ft home and can hear the chime in the room farthest from the back door.",
      "rating": 4.0,
      "verified": true,
      "author": "Meg@n",
      "helpful_votes": 8,
      "publication_date": 20160708
    },
    {
      "title": "Great for foiling sneaky children",
      "text": "This works great as described. We used it on our daughters door (age 7) to let us know when she was trying to sneak out instead of going to bed, lol. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Herder of goats.",
      "helpful_votes": 13,
      "publication_date": 20160702
    },
    {
      "title": "Effective High Pitched Alarm and Chime If That's What You're Looking For",
      "text": "The alarm is very loud as is the chime option. I intended to use these as soft alerts when doors were open but an elderly family member. I tested one of the alarms and nearly evacuated my bladder. Not the type of alarm I wanted, but this would be great for a business with multiple doors. I can see the chime being used in like a gas station, convenience store, warehouse, or small shop with enough space that the chime or alarm can alert effectively. These were returned, but these small devices packed a punch.",
      "rating": 5.0,
      "verified": true,
      "author": "Stella",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Perfect for pool safety",
      "text": "Exactly what we were looking for. Needed something to add another level of protection for our two little ones. We have a pool in the back yard and two boys who love to be outside. Chime and alarm are very loud and we can hear them upstairs. I really like that we can change between chime, alarm, and off. You will be woken up by the alarm weather it's a sneaky toddler or an intruder. Batteries are easy to access when they need to be changed. Definitely a must have with curious little kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla Weston",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Worth more than what I paid!",
      "text": "Loud and works great! We bought this to let us know when our daughter goes into her bathroom. She has autism and tends to go in there and play when we are unaware, so it's nice to be alerted when she opens the door. Would also be great for front doors for wanderers or for extra security on windows. The chime and alarm are very loud!",
      "rating": 5.0,
      "verified": true,
      "author": "Shaun O'Roark",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Does not work for slanted doorframe",
      "text": "Before purchasing, I read a bunch of reviews that claimed this alarm worked when placed on a doorframe with a slant. However, this did not work for me. My doorframe slants into the door slightly and that caused the pieces to be off a little bit (not completely, as about 3/4 of each piece still crossed one another). The alarm would not work when placed on the slant. I even doubled, tripled, and quadrupled the sticker under the piece on the door to try and match the slant, but it would just not work.",
      "rating": 2.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 4,
      "publication_date": 20170811
    },
    {
      "title": "Wanted to love it but couldn’t",
      "text": "The first pack came with one unit that didn’t work. The one we did put up fell off our front door around midnight three days after we put it up. We ordered another pack but decided to send it back unopened. We bought these to alert us if our autistic child lets himself out of the house but I can’t trust this unit. We’re still looking.",
      "rating": 2.0,
      "verified": true,
      "author": "Lindsey J.",
      "helpful_votes": 2,
      "publication_date": 20190529
    },
    {
      "title": "Cheap and Effective",
      "text": "Super easy to install, it comes with adhesive already on the backings. Works well. As you can see from my window, the window is a little more recessed in than the frame which makes the alarm and the contact point at slightly different levels, it still works perfectly. It has three different modes, Alarm, Chime, and Off. I keep mine set to Alarm, but turn it off when I open the window. works great. For the price, I recommend everyone gets this.",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "OK, but hard to fit on doors.",
      "text": "Got these to help secure some basement doors. Turns out they cannot be used on a door with trim. MUST be a flush surface. I wish I knew that before buying. We were able to get them to work (although slightly off-level) on our doors but I wish I knew this before buying. They should include they only work on flush surfaces and with no trim. Also they are TINY. which is good, and VERY loud. I am still trying to figure out how it will deter a robber if the robber can just re-close the door (thus turning off the alarm) once they have made their entrance into the house?!?",
      "rating": 3.0,
      "verified": true,
      "author": "SW",
      "helpful_votes": 6,
      "publication_date": 20150917
    },
    {
      "title": "Perfect if you are caring for a loved one with Alzheimer’s",
      "text": "We got these when we has our mother with us she had Alzheimer’s and would frequently go out doors we were frightened that one day she leave and no one would see her , so we put these alarms on all the doors ‘thank God she never left again until 6/2/18 that she passed away in the hospital:(",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "INSANELY loud. Great small solution to open windows.",
      "text": "My son is the absolute escape artist. Child-proof is merely a challenge to him. No locks or switches or gates or handles have kept him from getting out. It’s caused us a lot of anxiety and sleepless nights. A friend told me about these alarms and I figured for the price, I’d try it. Let me tell you that the alarm on this thing could WAKE THE DEAD. It is insanely loud. Piercingly loud. There’s no way, even the deepest sleeper could sleep through this alarm. No way at all. It also scared my son so much he’s now too scared to even touch the window.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Bennett",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "NOT NEAR 120 DB  MORE LIKE 12 DB",
      "text": "WISH I COULD GIVE THIS ZERO STARS WHAT A RIP OFF MY DOOR BELL IS LOUDER JUNK DO NOT BUY WASTE OF MONEY VERY UNHAPPY",
      "rating": 1.0,
      "verified": true,
      "author": "Smiley",
      "helpful_votes": 2,
      "publication_date": 20200718
    },
    {
      "title": "Louder than you expect",
      "text": "Living in an apartment i wasn't able to get an alarm system installed (management policy). So i ordered these for my windows and doors... wow these are louder than i expected. Great little product. I definitely recommend these, they can have multiple uses.",
      "rating": 5.0,
      "verified": true,
      "author": "SG",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Loud as hell",
      "text": "Too loud to use. Basically the chime is loud enough that it scares my son and dogs. I just wanted it to gently know if my toddler decided to leave without my knowing, but basically its so loud it hurts everyone's ears. Don't recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Kyle T.",
      "helpful_votes": 3,
      "publication_date": 20181023
    },
    {
      "title": "Perfect for apartment living",
      "text": "Great little device with very loud alarm and chime. I like that there are no wires involved because I live in an apartment. Very easy to install. I had to add some extra 3M adhesive tape to the alarm portion when applying to my sliding glass door because the door and wall were not level. I attached some pics to show.",
      "rating": 5.0,
      "verified": true,
      "author": "Coolj21",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Works Great",
      "text": "Have someone with dementia who'd wander off and get lost without us knowing. Easy to install and use. There are two alarm choices. Loud enough to hear throughout our home if the door opens. It also has a switch to put disarm if you're bringing stuff in and don't want to hear the alarm. It's being a lifesaver for us! The battery life may be great but I've only have been using for a couple of months so we'll see how long they actually last.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Black",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Peace of mind",
      "text": "We put these up because we have a 2 year old that can open our front door. I set it to the chime setting and so far the noise alone keeps him from letting himself out of the house. I thought about putting one of the knob covers on the front door but for fire safety that just didn’t feel very safe. This way I can hear if the door opens from anywhere in the house. My only complaint about the alarm is that if you have a door frame with trim around it you can’t use the alarm setting, you have to use the chime setting.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Loud, Proud & Easy!",
      "text": "These are great for a low-cost, temporary security system. I'm in an apartment now and feel so much safer having these on the doors. Main points: 1. 3M strips & side switches make these things super easy to install and change settings as needed. 2. They look great; they're small and unobtrusive. 3. When these go off - DAMN they are loud! My only complaint about them is the door opening chime is the same volume as the alarm's siren. I bought these with the intention of having the chime on during the day, alarm at night, but the chime is loud enough to terrify my cat. So, alarm at night only for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Mariah",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Way Too Loud",
      "text": "Chime and alarm works great. My only complaint is that it is WAY too loud for home use. Unless you have a really large house. Probably better suited for a business. The sticky tape really adheres well. The device is so loud I considered taking it off my door, but it stuck so well I feared it would leave a mark. Just be sure to clean and dry the surfaces well before applying, and you'll have no problems.",
      "rating": 4.0,
      "verified": true,
      "author": "H-Bar",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Loud",
      "text": "They are so high pitched & loud I think I hurt my ears every time I open the door for my office! Very easy to install and it makes me feel safe knowing they are so loud to startle a burglar if someone came in! Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Snyder",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Way too loud for small spaces/ apartments",
      "text": "This alarm does work and does it’s job but it is VERY LOUD. Like too loud lol. I know an alarm is supposed to alert you but I had to take it down because even the chime was too obnoxious for our apartment. It would work well for someone with a home or large apartment or store. Definitely not for small apartment renter security. I worry we would set it off on accident and scare our entire building",
      "rating": 4.0,
      "verified": true,
      "author": "Mak P",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Sure easy to use for anyone and helps her with piece ...",
      "text": "This works wonders! My mother lives in a retirement community and they have restrictions on what they can do to the walls and of course personal security system services are not allowed. My mother had concerns with someone coming into her condo when she was sleeping or showering and not hearing them so I purchased this and installed it with ease for her. It has a couple sound settings to choice from and just a basic on and off mentality. Sure easy to use for anyone and helps her with piece of mind. I feel much happier knowing this simple and inexpensive device helps my Mom sleep at night better!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Chabot",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Way too loud",
      "text": "I guess it depends what you’re using this for but for in home use it is WAY too loud. I bought this to let me know when someone opens the front door. I figured it would give off a pleasant chime (or at least have a volume setting). The sound this sensor makes is EAR PIERCING. If you’re using this solely as an alarm then it’s great. It’ll scare the crap out of anyone who tries to walk into your house.",
      "rating": 3.0,
      "verified": true,
      "author": "jay-",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Super super loud worth every penny",
      "text": "Just ordered a third set one for my mother and one for my daughter install mine six months ago and haven’t had one problem with it the tape is super strong the alarm is very very loud Don’t really care for the “quickie Mart” setting Every time I hear it I want to say thank you come again LOL Great if you have a little kids and trying to keep them from going outside without you knowing I have one on my front door and one of my sliding glass door, It’s also a great extra security from people entering your home without you knowing ...",
      "rating": 5.0,
      "verified": true,
      "author": "Kat702",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Works great, and VERY easy to use...",
      "text": "Ok, I'm the type that can mess everything up, but these were super easy to use. Great service - on time delivery and good packaging. I put it on my freezer because the door doesn't have a sensor and I had a whole freezer melt down 1 day when the door was left open. It works like a dream! I put a piece of tape over the speaker to mute the sound down since these are used indoors.",
      "rating": 5.0,
      "verified": true,
      "author": "Jala",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Very small but loud",
      "text": "Overall I like the small size of the alarm. I would of given it 5 stars but I think there is a better way to secure the alarm instead of 3M tape. I'm scared this will fall off after a while and scare my family with a false alarm. I may eventually put some super glue on the back of it. Did not rate battery life because I have not had then long enough. I would order this product again.",
      "rating": 4.0,
      "verified": true,
      "author": "Anna Baker",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "nice for my needs",
      "text": "I bought these to put in my small show case for jewelry in my booth at antique mall. If someone is able to get into the case the alarm has a shrill sound that the clerks hear. Whenever I open the lid of the case it goes off so I know it works. I have had it for maybe 3 mos. I don't think mine is for motion and not sure about battery life. All I know is I like it and have another to replace if needed!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Wohrer",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Simple cheap way to know when your kiddo is leaving your yard!",
      "text": "Use them on my outside Gates because my kiddo was escaping out of the yard. The chime was so loud I had to put four layers of duct tape over the speaker area two tone it down a little bit. But otherwise it works! Totally simple to install with the provided double-sided tape. Mine are both on outdoor Gates and so far I've had no problem with the elements affecting their performance.",
      "rating": 5.0,
      "verified": true,
      "author": "Canuck72",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "These were a good purchase. If you install a pool",
      "text": "These were a good purchase. If you install a pool, you are required almost everywhere I know of to have pool alarms on your doors. The funny thing is, almost no one has them. That is because after they pass inspections, most people turn them off because they don't like the noise. No comment on that but I think that these are inexpensive enough to save you money if you are looking to pass inspection without spending a lot of money. They work well and are loud. If you are going to leave them up permanently, you will probably have to maintenance the double stick tape as that is how they are attached.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Free",
      "helpful_votes": 4,
      "publication_date": 20160719
    },
    {
      "title": "Perfect",
      "text": "I purchased these for my apartment door as I didn't want to buy a pricey alternative. All you had to do is put in batteries and they work great. there is a setting for a chime and a setting for a very loud alarm! Keep in mind that even the chime is very loud even if it only chimes once. the alarm will sound until the two receivers are touching again. Personally it does its job and I'm happy with it. there is also an off switch that you can set it to you during the day and turn on the chime or alarm at night.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Cassell",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Exactly what I wanted!",
      "text": "I love these little alarms. They fit on uneven surfaces and on pocket doors. Maybe they'll scare someone off, maybe they won't. I got them to wake me and my dog if an intruder comes when I'm sleeping. That gives me time to get my 45 and diall 911 in that order.",
      "rating": 5.0,
      "verified": true,
      "author": "CarolAnne",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Loud and proud",
      "text": "Loud and proud. I have an Airbnb guest room that leads out to a pool so the city has required I install these door alarms. They are very effective and also very loud. I have them set to chime versus the alarm. The alarm will wake your neighbors three doors down I think. The deduction of one star is for the fact that I really don’t like the sound of the chime. Sounds like you’re walking into a dry cleaners.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Snider",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Perfect price and very effective!",
      "text": "My son is 7 years old and a non verbal autistic. He's very sweet and pretty obedient, but occasionally forgets to ask for company before he tries to open the door to go on a walk. Normally, our multiple locks work as a deterrent against him leaving the house unaccompanied, but recently he figured out how to open these. These magnetic alarms are one of the added measures we've taken to make sure everyone is safely in the house! They work and they're very affordable/ easy to install!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. W",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Decent product but a little bit let down",
      "text": "these are ok, I had one put on my nursery door and they get the job done but my only complaint is that they are only held on by a double-sided piece of adhesive and it has an annoying tendency that if you close the door to fast that it'll fall off! you may want to invest in your own, better way to secure it to a door but for the alarm function works great, nice and loud.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark Miller",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Much Too Loud as a Door Chime",
      "text": "I expected something like the chime sound I often experience when entering stores-loud and clear, somewhat annoying but more melodic than alarming. Nope, this is an alarm. The \"chime\" mode is just an abbreviated alarm. It doesn't work well to indicate the door is ajar in an everyday way. As other reviewers indicate, this seems like something that could work better on windows.",
      "rating": 3.0,
      "verified": true,
      "author": "Vanessa",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Easy install. Wish it used AAA or AA batteries.",
      "text": "I added these to sliding doors that lead out to our backyard pool so I know if kids are trying to sneak out. I like the chime or ding-dong feature option. Only reason for 4 star rating is because it uses a stack of small watch batteries. I’d rather it have been a AAA or AA because they’re easy to find anywhere. That being said, the battery life seems to be quite long (several months and counting) and the alarm is just as loud as day one. Very easy to install, peel and stick.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Simple Home Security Improvement",
      "text": "If you have recessed doors as I do, these work fine with a thin, circle magnet you can find online or at a big box store. Bring the alarm to the store and test that it works. Weaker, strip magnets do not. If your door is perfectly flush and recessed, you may need to use a bit to drill a recessed circle to fit it into. For the price, I can’t think of a reason not to add these to your home security set up. You can even put them in closets, drawers, etc. to give you a heads up if the kids like to get into things they shouldn’t.",
      "rating": 4.0,
      "verified": true,
      "author": "Parictis",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Perfect door entry and exit alarm or chime",
      "text": "The product works as intended when love ones, anyone entering or exiting the home. There are two parts to this personal security. Larger part with the chime, alarm and off attach to the door and the smaller part attaches to the frame. Be sure that the arrows are inline with one another. It can be used as chime or alarm or it can be turned off. Plenty of loud even on chime mode. You get two alarms, double-sided tapes and LL4 type batteries already installed.",
      "rating": 5.0,
      "verified": true,
      "author": "RB",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "So easy to install!",
      "text": "I bought these for my daughter who lives in an apartment at college. She has been scared because of a few break-ins in the area and these will give her (and me) peace of mind. She is armed but it will help to know she'll be made aware of anything happening while she's sleeping. I give this product 5-stars for ease of installation. It makes a very loud noise on chime AND the alarm. This is the first day she's had it so if anything happens to change my rating, I'll change post why.",
      "rating": 5.0,
      "verified": true,
      "author": "JRBW",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Super loud even on chime. Easy to install. May not work on some doorway frames.",
      "text": "These are great. The chime was really loud though and can cause one to jump. I guess that’s good on a security standpoint, I just didn’t expect ‘chime’ to be so loud. Good for those in your house who are known to wander, as well as startling anyone who may be trying to get in unwanted. Easy to install and sticks good to wall, however you have to make sure it’s not too far away from the sensor. Which means it may or may not work on all door way frames.",
      "rating": 4.0,
      "verified": true,
      "author": "Alana Bossie",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Love these",
      "text": "I’m a very heavy sleeper and it makes me nervous to think that I would sleep through someone breaking into my house. I bought these and they have given me such a sense of security because I feel like I would at least have a heads up if someone did try to break in! At the very least if I did sleep through it, hopefully the alarm would scare off the person trying to get into my house.",
      "rating": 5.0,
      "verified": true,
      "author": "Meredith Harden",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Simple and works",
      "text": "I can use these for anything! Not just my windows. Battery lasts a good time. Sound is loud, which sucks when you accidentally forget to turn it off, even on chime. I think the chime should at least be at a lower decibel because if you're putting it on chime, you're not looking for the next door neighbors to hear it and call the police if it goes off. That's the alarm. Would be easy to turn off, though. So, is more like a temporary solution for windows. Was great for my college apartment. Make sure to peel off slowly and be kind when taking the tape off or it'll stick and be a pain to get off the wall.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 2,
      "publication_date": 20161012
    },
    {
      "title": "Perfect",
      "text": "We got a pool out in our back yard and I immediately started having nightmares of my kids sneaking out the door at night. These are so much louder than I expected and give me a huge relief. I ordered some for my parents house so that when they watch my kids I don’t worry so much either.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Hall",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Perfect apartment addition.",
      "text": "We recently moved into an apartment while building our home and I quickly found out my 2 year old could easily unlock our deadbolts. The doors also open and close very quietly so it made me very nervous. These were easy to install and I can clearly hear when the door is opened. The 2-pack is perfect as we have 2 doors also. I like that there is an alarm and a chime option. I feel much more at ease with them. I'm also happy that there will be no damage to the walls once removed. And the price seriously can not be beat!!!",
      "rating": 5.0,
      "verified": true,
      "author": "E",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Great price good security",
      "text": "This is good and price is good . I needed something affordable and have some security in case someone try to break in . This is pretty loud so it will definitely wake up when I’m Asleep ..",
      "rating": 5.0,
      "verified": true,
      "author": "mwang",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Perfect for what we needed: freezer door",
      "text": "We used this on our freezer door. I am a nursing mom and worked hard building up a stash of breastmilk. One day I came home to find that the door wasn't completely shut and EVERYTHING in our freezer was a total loss. I was devastated and determined to not let that happen ever again. So we tried this out and had great results. It was screechingly irritating, so we put some duct tape over the speaker part so that it muffles the noise a little. It was STILL loud and served its purpose without waking up the baby.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "My bad",
      "text": "The alarm makes noise, but I can't use it. My fault for not checking my doors first to make sure it would fit. My door jambs make it impossible for the right and left side of the alarm to be close enough so that a noise is emitted when the door is opened. Not sending it back because it was my fault, but check your door jambs and make sure the alarm can sit flush before ordering.",
      "rating": 3.0,
      "verified": true,
      "author": "Em Rider",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Defective product?",
      "text": "Would have liked if one of them didn’t stop working after 10 minutes of installing it. It kept on falling off after we took it off to try and see if we could fix it. One is working fine. I will say, it is nice and loud (the one that works) EDITED: A replacement was sent and so far so good. Fits our needs. We just have them on our front door and basement so we can hear if the kids try to go out on their own. Loud enough to hear in our smallish house. Easily turned off in the day when we're in and out. Happy, hoping that they last this time.",
      "rating": 4.0,
      "verified": true,
      "author": "gary simoneau",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Nice little alarm.",
      "text": "So far I like this alarm. Took about 10 minutes to put up and most of that was just finding the right location on the door to place it. It’s on my front door screen so that when I am in the back of my house I would be alerted if someone opened the door since the screen does not have a lock and one would not be easily put on. Seems to be sticking well with just the adhesive tape that came in the package. A perfect alarm for the cost and for my needs. I would recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori K",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Works wonders",
      "text": "Love love love it works for my daughters balcony anytime she opens it. It has two alarms. A ding dong and a very loud obnoxious alarm which i used once to scare them with lol",
      "rating": 5.0,
      "verified": true,
      "author": "Tiff",
      "helpful_votes": 2,
      "publication_date": 20190612
    },
    {
      "title": "How do you leave without a big noise?",
      "text": "We bought the product to use in our RV on the door. However, if you turn it on while in the RV, you get the alarm trying to get out. Earsplitting since you are by the door. We tried going out and trying to set the alarm and closing the door quickly. Big noise. The bigger problem was it upset the pets when we were 'leaving. Lots of big noises from them.",
      "rating": 2.0,
      "verified": true,
      "author": "Cliff",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Effective and cost efficient",
      "text": "Very easy to install and loud enough to get your attention. We put these on our exterior doors after our 3 year old revealed to us he was in fact Houdini reborn. They are loud enough to let us know when he's up to something and easy enough to turn on and off. Be prepared to forget you put it there and scare yourself a few times at first.",
      "rating": 5.0,
      "verified": true,
      "author": "hiker0811",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Product  effectiveness/ easy install/ very loud",
      "text": "This product is awesome, extremely loud and affective for every day security.. I use this on all major doors and windows when I am not home or at night as a 3d measure of security. The product has included everything you will need to open and use. It has 3 settings.. chime ,loud entering alarm, and off. I highly recommend this for the average family who doesn’t want to pay or can’t buy a monitored security company service, this is a way easier way to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Sierra",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Childproofing lol",
      "text": "So lately my 5 year old has been leaving the house when no one is looking. True we don't live in a busy neighborhood and our community is rather small and I feel pretty safe here, but you never know, right? So yeah, these are working as we hoped. The chime is loud and annoying, so it's working as a nice deterent lol heavens help us when she gets into those teenage years.",
      "rating": 5.0,
      "verified": true,
      "author": "Erica Cunningham",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Not good for little kids",
      "text": "This product is great if for just adults or older people in the home that just need this for security purposes. I purchased this to help keep my son from going outside without me knowing about it and the works but is very easy to turn off any little child could do that as it's just a button. I think that it should be made a little more difficult to just turn off the system",
      "rating": 4.0,
      "verified": true,
      "author": "Justine",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Easy installation but not good for an alarm as it goes silent once you close your window/door.",
      "text": "Installation was easy and the alarm is very loud. My only issue with the alarm is that it shuts off once you close the window or door it's attached to. I bought this to install on my new apartment door until ADT can come over to transfer my service and was disappointed to see that it just shuts off once you close the door. I was expecting the square thing in the center might be a button and that you'd be required to hold it for 5 seconds or something to disable the alarm but it's not.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Peace of mind",
      "text": "These alarms are extremely easy to install, within 10 minutes you're all set. We bought these for the back door of our house that leads to the pool as a safety net in case our toddler were to ever figure out how to open the door. The other set we mounted to our front door for the same reason. The alarms are extremely LOUD and definitely calls for attention. They work as advertised and I'm happy with my purchase. It's a good peace of mind knowing I can hear the alarm if we were upstairs or fast asleep. 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Kailey",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Great!",
      "text": "Used this product for my back & front doors to my house. The back door has a window so i was always worried about the back mainly. I just wanted something small and inexspensive just to let me know when the door was opened(9 times of 10 im up listening wondering if i heard the door). These little alarms are perfect. Easy to put up.( I used command strips). Veryyyyyy loud. I will def hear it from my bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Loud and easy to install",
      "text": "Very loud. Can hear from top floor of my home, two floors down. I have a three star because the first night of installation the second alarm wouldn’t work. We took it apart and tried to see what was wrong. Swapped batteries etc. nothing. We went ahead and reorder another pack because we wanted to have two alarms for another door.",
      "rating": 3.0,
      "verified": true,
      "author": "Ashley Cluck",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Good for a classroom",
      "text": "I love it...although I would like it w a volume control...I use it for my classroom. I have almost 600 kiddos, some walk out, but now I’m aware who’s sneaking out 😁",
      "rating": 5.0,
      "verified": true,
      "author": "adry",
      "helpful_votes": 3,
      "publication_date": 20180821
    },
    {
      "title": "Works great. Both pieces have to line up but if ...",
      "text": "Works great. Both pieces have to line up but if you have an odd shaped door like our apartment does, they can be off a little bit. The alarm won't sound until the two pieces become completely separated. Also an off setting and a chime setting which will chime to advise you of anyone opening the door/window. Great for toddlers that open doors.",
      "rating": 5.0,
      "verified": true,
      "author": "Travis Kwin",
      "helpful_votes": 6,
      "publication_date": 20170503
    },
    {
      "title": "LOUD & DOES IT'S JOB",
      "text": "I ordered the two pack and placed them on the baby gates at our house. I set it to the convenience store chime sound haha. The second one is ear piercing it hurts and it doesn't stop until the gate it closed again. This one chimes when door opens and stops. Then, next time you open the door again, it chimes once again.",
      "rating": 5.0,
      "verified": true,
      "author": "Buse",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "It suits me just fine.",
      "text": "Saved me from sleepless nights. I had to take care of my mother who suffers from dementia. She wonders off. I bought this because the first night she stayed with me she did just that. Note that you'll have to figure out how to attach this if you have any deep profile moulding around your door. I used layers of hot glue to even out the profile. The sound it emitts is loud enough to wake me if it does happen again. However, that really depends on the proximity of this alarm to where ever you are. It suits me just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Jangler",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Very loud!",
      "text": "I bought the 2pack for my apartment since i love my myself and have 2 entry doors. they are extremely loud and have been up for 2 weeks without falling off! it took some serious work to figure out the placement for my back door as it’s recessed, but it worked out! both alarms work perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Audrey Edgell",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Great little alarm",
      "text": "Holy smokes, this little thing is loud! It works very well and was very easy to install. We are using it in the office. Since my desk is in another room, it's great to have this alarm on the door to let me know when somone has entered. There is no mistaking the sound for anything else, you know when that door gets opened.",
      "rating": 5.0,
      "verified": true,
      "author": "David Hightower",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "The volume is startlingly too loud",
      "text": "We jump each time we open the door because we're still not used to it. It is quite loud on the lower pitched sound. The siren noise is very startling and very alarming. I have it for my in-home childcare business. I need to know if a child is escaping, so I guess I need it that loud to catch my attention if there is a lot of noise in the house.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Jones",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Peace of Mind",
      "text": "Only need a few seconds of 120 decibels to reach for the peace maker. If someone uses a pry bar or kicks a door open thr alarm screams. Have had these units for 4 years just ordered a new one to replace a damaged one. The batteries have lasted the entire time. 3M tape to hold in place easy install peace of mind at night.",
      "rating": 5.0,
      "verified": true,
      "author": "DZM",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Amazing quality for the price!!",
      "text": "These work amazing. I got them for my kid’s room. I have an ADHD child that likes to gorge on junk food in the middle of the night. This lets me know when my kids get up at night. Also great to alert me if they get sick at night and run to the bathroom. The chime option is great b/c it only sounds off once. The chime and alarm options are very loud. I plan on buying more to use on our windows and entry doors on the alarm setting for home security.",
      "rating": 5.0,
      "verified": true,
      "author": "Georgina Ramsey",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "These are great! But too loud for us",
      "text": "I will give these a 5 star because they do exactly what they say they will do and they are cheap. I did end up returning them just because they are so LOUD. Too loud for everyday use on our front doors. It would drive me crazy. It sounds a lot like when you go to a store and there’s no way to change the volume. So for our personal use it won’t work. But if I was using the alarm feature instead of the chime it would be perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Silva",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Good volume",
      "text": "I got these for security for my son he is autistic and often times is up in the middle of the night, he will play in his room but I wanted to be sure I knew if he left to go into the rest of the house, the alarms and chimes are very loud so I can hear from anywhere. I sleep so much better knowing I will indeed wake up if he leaves his room at night. They do not come with the adhesives though which is why I did not give it 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Perkins",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Best thing for cheap security.",
      "text": "This product is amazing! I ordered one just to see how i liked it after seeing a review on how loud the alarm is. It works amazing for those who are moving into an apartment with no security (like my house i am renting). I have them mainly on windows bc we are in an old house where some windows don’t latch. You move it the slightest inch from the arrow it’s going off. Even scared my roommate one night when i forgot to turn the alarm off going outside to take trash out. So inexpensive, loud & easy to put up.",
      "rating": 5.0,
      "verified": true,
      "author": "Cara Jackson",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Great little gate latch reminder.",
      "text": "Problem solved Used! Mowers forget to latch gate. Used this little wonder to keep my dog gate latched correctly. I wish it was weatherproof. Added tape to prevent water and superglue it to fence. Need to check back in a few months. So far, its excellent!!",
      "rating": 5.0,
      "verified": true,
      "author": "Yoshidad",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Works very well, and is quite loud! Great for kids or disabled individuals!",
      "text": "Was very easy to install and includes adhesive pads that work very well and have kept the product stable. No issues with the alarm malfunctioning or going off by itself. I like that there is an alarm feature or just a single ring feature as it is quite loud. I got this after my 2 year old figured out how to work the front door and slipped outside. I can comfortably say that this alarm is awesome and you can hear it from anywhere in your house. I got a two pack, one for me and one for my quadriplegic father so he knows when someone or one of his nurses comes into his house. Includes batteries also!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Cherry",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Great product but not near enough sound.",
      "text": "Excellent size and manufacture, extremely easy to install,, the only reason I gave 3 overall stars is because the alarm and chime is not near loud enough for me to hear. I have an upstairs bedroom so there is no way I'm hearing them from up there. If they could make them 360db or higher they'd be perfect",
      "rating": 3.0,
      "verified": true,
      "author": "Rex white",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Loud noise, awful adhesive",
      "text": "They are definitely loud and do exactly as they're suppose to. The adhesive on them isn't great though. It actually stuck better to the paint on our door casing than than the casing itself. It peeled the paint off everytime it fell off, which was several times a day. After it fell off in the middle of the night scaring us half to death we ended up just buying a chain.",
      "rating": 3.0,
      "verified": true,
      "author": "KR",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "It did not sound and chime like it said it would when opening the door or ...",
      "text": "This item did not work AT ALL!!! I would've sent it back but it wasn't worth it! Spend the money on a real alarm. It did not sound and chime like it said it would when opening the door or window but will randomly set off at odd times of the day when the door or window is still closed.",
      "rating": 1.0,
      "verified": true,
      "author": "Danyelle Quinn",
      "helpful_votes": 8,
      "publication_date": 20160907
    }
  ],
  "product_meta": {
    "title": "GE Personal Security Window/Door Alarm, 2-Pack, DIY Home Protection, Burglar Alert, Wireless Alarm, Off/Chime/Alarm, Easy Installation, Ideal for Home, Garage, Apartment, Dorm, RV and Office, 45115",
    "description": "Size:2 Pack| Style:Window/Door AlarmThe GE Personal Security Window/Door Alarm provides a simple-to-use, cost-effective security solution to protect you and your family against home invasions thanks to the 120-decibel alarms, loud enough to make a would-be intruder think twice about entering through your doors or windows. The alarm is also extremely easy to use. The window/door alarms feature a contemporary design with easy access buttons and controls for simple operation. This straightforward concept makes using the GE Personal Security Window/Door Alarm intuitive, no matter what your technological skills may be. The GE Personal Security Window/Door Alarm also includes two independent window/door alarms, each with a built-in 120-decibel alarm for even greater home security. With no wires required for installation, protecting any window/door in your home is as easy as attaching the alarm to your window/door with double-sided tape (included). Each window alarm features an on/off/chime switch for easy operation and a low battery test button for checking battery life. Perfect for homes, apartments, dorm rooms and offices.\n\nFROM THE MANUFACTURER\nThe GE Personal Security Window/Door Alarm provides a simple-to-use, cost-effective security solution to protect you and your family against home invasions thanks to the 120-decibel alarms, loud enough to make a would-be intruder think twice about entering through your doors or windows. The alarm is also extremely easy to use. The window/door alarms feature a contemporary design with easy access buttons and controls for simple operation. This straightforward concept makes using the GE Personal Security Window/Door Alarm intuitive, no matter what your technological skills may be. Perfect for homes, apartments, dorm rooms and offices.",
    "rating": 4.5,
    "feature_bullets": [
      "Includes two window/door alarms, each with three adjustable settings off/chime/alarm",
      "Loud 120-decible alarm sounds when door or window opens, helps deter intruder and alert residence",
      "Easy and convenient to install, requires no wiring, mounting hardware and instructions included, designed for indoor use only",
      "Built-in low battery test button to easily check battery life, includes four LR44 batteries for each alarm",
      "Comes with a 90-day limited warranty. Perfect for home, garage, apartment, dorm room, mobile home, RV, office and more"
    ],
    "specifications": {
      "Manufacturer": "Jasco Products Company",
      "Part Number": "45115",
      "Item Weight": "3.2 ounces",
      "Product Dimensions": "5 x 4.5 x 1.25 inches",
      "Item model number": "45115",
      "Batteries": "4 LR44 batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Size": "2 Pack",
      "Color": "White",
      "Style": "Window/Door Alarm",
      "Power Source": "Battery-powered",
      "Item Package Quantity": "2",
      "Included Components": "GE Personal Security Window/Door Alarm, 2-Pack, DIY Home Protection, Burglar Alert, Wireless Alarm, Off/Chime/Alarm, Easy Installation, Ideal for Home, Garage, Apartment, Dorm, RV and Office, 45115",
      "Batteries Included?": "Yes",
      "Batteries Required?": "Yes",
      "Battery Cell Type": "Alkaline",
      "ASIN": "B00178HMCI",
      "Customer Reviews": "4.5 out of 5 stars5,867 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#2 in Home Security Systems",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "April 4, 2008"
    },
    "categories": [
      "Home Security Systems",
      "Security & Surveillance",
      "Electronics"
    ],
    "price": 10.97
  }
}