{
  "website_summaries": [
    {
      "verdict": "Altec Lansing's BackBeat Plus 106 earbuds may not deliver as much bass as their step-up siblings, but they're a good value at $20.",
      "pros": [
        "Comfortable fit",
        "solid sound for the money",
        "tangle-resistant shoelace style cord is a plus"
      ],
      "cons": [
        "When the cloth cord rubs against your clothing, you can sometimes hear it",
        "they don't fit as well as step-up BackBeat earphones",
        "a little light on the bass"
      ],
      "aspects": {
        "Design": 6.0,
        "Features": 7.0,
        "Performance": 7.0
      },
      "publication_date": 20090417,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "All 3 sets broke",
      "text": "I really liked the sound quality of these earbuds. I loved the way they fit into my small ears and the noise-cancelling technology really worked in my noisy gym. The first pair were fabulous, till I dropped them and one earbud stopped working. The second set arrived with one earbud dead; fortunately Amazon was really good about replacing them. The third had slightly diminished volume but they were still good for about 3 months. But then one earbud stopped sending sound into my ear while I was working out. I'm done with this brand.",
      "rating": 2.0,
      "verified": true,
      "author": "kojo",
      "helpful_votes": 4,
      "publication_date": 20111001
    },
    {
      "title": "Fantastic headphones for the price.",
      "text": "I have purchased headphones for $50 that don't sound half as good as these sound. It's insane how much bass these things get, but they also have perfect high tones as well. These are definitely worth at least $50 if not more, and for the price of $9 that I bought them for, it's almost like I stole them. You can't go wrong with these if you like the sound isolating in-ear headphones. They are also very comfortable to wear. I wore them for 8 hours straight the other day, with no fatigue at all. I also love the rope style wire that almost never gets tangled and can stand up to every day use.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Dobis",
      "helpful_votes": 3,
      "publication_date": 20120411
    },
    {
      "title": "Excellent sound quality and design, but breaks almost instantly",
      "text": "*DISCLAIMER* These earbuds are not the UHP106, but rather the UPH106N. The only difference is a slightly different design. With that said, these earbuds have a wonderful and stylish design, and have incredible sound quality with a perfect amount of bass. These were my sixth pair in about a year. I would listen to them for about 1-5 hours a day, every day. When I was done with them, I would put them in a case. The problem is that they just don't last. I've gone through 2 pair in 30 days, including shipping time. Each of the six pairs I've had have broke in a different way. Stay away.",
      "rating": 2.0,
      "verified": true,
      "author": "Veoozo",
      "helpful_votes": 0,
      "publication_date": 20121121
    },
    {
      "title": "Great sound poor quality",
      "text": "I absolutely love the sound that comes out of these things, but iI share there is a self destruct timer in these things. They are made very poorly. I have had 3 pairs literally come apart in my pocket. One some how cracked in half sitting on my night stand... But the sound, for the price is unmatched... They are just as good as bose in my opinion... I have bought so manybecause they sound aamazing but don't expect more than a few months out of them.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Dez",
      "helpful_votes": 0,
      "publication_date": 20140801
    },
    {
      "title": "love em so much..I'm getting another pair",
      "text": "These ear buds may give up something to Bose for sound..but with a mobile device, the right app to drive the speakers makes them almost as good... BUT they blow all others away for sound and construction...I've had one pair for approximately 2 years... Haven't ever had a short or a contact or corossion issue...no dry rotting in the wires...I love em...the second set is on the way... I'm sure they'll be just as awesome....great sound..just like their old d-130 speakers..",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Rivera",
      "helpful_votes": 0,
      "publication_date": 20131211
    },
    {
      "title": "Intermittent open circuit may want to try a different vendor",
      "text": "Developed intermittent open circuit that has progressed to complete failure . Now out of warranty",
      "rating": 2.0,
      "verified": true,
      "author": "Customer reply",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "The best headphones for working out",
      "text": "This is my second pair of headphones. One I lost and I just bought these. I originally bought these headphones at Bestbuy. When I asked a customer what he thought between the two I had in my hand he didn't choose those and he recommended something completely different, i.e, these headphones. These are PERFECT for exercising whether this may be running or lifting weights. There is more than enough wire for movement, which has a rope type material around the wire. This was a pretty cool design. But most importantly, I have yet to hear sound quality as good as these in the headphone category. I'm not any audio engineer, but these certainly do the trick for me.",
      "rating": 5.0,
      "verified": true,
      "author": "lefty",
      "helpful_votes": 0,
      "publication_date": 20110728
    },
    {
      "title": "Good sound",
      "text": "For about half the store price of a similar Altec headphones that look just like this one I am very pleased with the product. With multi size ear inserts I was able to find a size that stays in my ears. Great for going into another world filled with music at such boring places as the laundromat. Works on both my mp3 player and iphone. Noise reduction good. They are a keeper. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "nanc",
      "helpful_votes": 0,
      "publication_date": 20130318
    },
    {
      "title": "Will continue to buy",
      "text": "These do not break easy. I purchase them for all my kiddos (17 at last count) and unless they are lost (the pouch is easy to either leave behind or fall out of a pocket) definitely worth every penny! Very long lasting and tough! The ones marked women work for all my boys. I only pay attention to color.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Dimaruo",
      "helpful_votes": 0,
      "publication_date": 20150305
    },
    {
      "title": "For the price they are amazing.",
      "text": "This is the second pair of Altec Lansing headphones I have bought for my son. The first pair were much more expensive and lasted for years and years. I replaced them with this set and he is very pleased with them. He says he will never bother with headphones that aren't Altec Lansing again. The build quality is above any other brand and the sound is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellen M. LaPlante",
      "helpful_votes": 0,
      "publication_date": 20130127
    },
    {
      "title": "A Good Notch Above Cheap-o Headphones for a Decent Price",
      "text": "This is the second pair of these I have bought. I can't bring myself to spend a lot of money on headphones, but want a pair that doesn't need to be replaced every month. These are exactly right for the price - they don't break immediately like other less expensive headphones, the sound quality is good (enough for me), and they are comfortable. They also do a really good job blocking ambient noise.",
      "rating": 4.0,
      "verified": true,
      "author": "TheFranimal",
      "helpful_votes": 0,
      "publication_date": 20110506
    },
    {
      "title": "Old but Gold",
      "text": "I've bought a few pairs of these for myself and family. I've owned my pair since they first came out when I was working at a popular retail chain I won't mention for obvious reasons. I am rough on headphones and usually went through pairs at least once a month. I got to try a variety of different kinds, even different Altec Lansing pairs, I liked these the best. They've lasted me a long time, I use them daily and for hours. Not every pair will work out perfect but I really have gotten great use from mine.",
      "rating": 5.0,
      "verified": true,
      "author": "Eliza Beth",
      "helpful_votes": 0,
      "publication_date": 20141112
    },
    {
      "title": "Excellent...but treat them as a commodity",
      "text": "These are some of the best headphones I've ever used. When I had to pay $27 for them at Best Buy, it was not a wise investment. However, since I can readily get them on Amazon for $11-12, it is money well spent. Take heed -- these headphones need to be treated as a commodity, like razor blades or toothbrushes. The build quality is such that the earphone housing breaks and the plug is susceptible to breakage with only moderate pressure. All that said, I buy them 2-3 at a time and each one lasts two months or more. The sound is wonderful, they fit my ears just about perfectly, and the tangle free cords are the best.",
      "rating": 4.0,
      "verified": true,
      "author": "Jack Warren",
      "helpful_votes": 0,
      "publication_date": 20121025
    },
    {
      "title": "Great deal at this price",
      "text": "I bought 11 of them as a quick gift when I was visiting during Chrismas break. Everybody loved it. Most of them are still using it but some of them just broke.",
      "rating": 4.0,
      "verified": true,
      "author": "gck",
      "helpful_votes": 0,
      "publication_date": 20160327
    },
    {
      "title": "I would buy this again in a heartbeat.",
      "text": "I bought 3 different models to try out. They were all around $10 and works great - even in demanding live performance in-ear monitor applications. Some models have a microphone for cell phone use, with a hang up button (it will also pause the music player if engaged). Performs better than much more expensive ear buds.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary J. Allsebrook",
      "helpful_votes": 0,
      "publication_date": 20130529
    },
    {
      "title": "Great everyday earbuds",
      "text": "I've had multiple pairs of these for years. They're great everyday headphones. Not the best audio quality in the world, but for packing into your purse or laptop bag to ensure you always have a pair, they can't be beat.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Tiernan",
      "helpful_votes": 0,
      "publication_date": 20140712
    },
    {
      "title": "It does look a little cheap looking but for 13 bucks it a great deal.",
      "text": "They come with soft pleasant bass-driven sound you would expect from Altec. Mids and Highs are not very crisp and clear though. It does look a little cheap looking but for 13 bucks it a great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Nima A.R",
      "helpful_votes": 0,
      "publication_date": 20141010
    },
    {
      "title": "Ear Bud Headphones",
      "text": "Love these headphones. They are well made. If you take care of them, they will last. Don't wrap them around your device as that will cause a kink in the wire. These are my second pair and I would buy them again. I am going to try and take better care of these. Bargain priced too.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Grant",
      "helpful_votes": 0,
      "publication_date": 20130212
    },
    {
      "title": "Good earphones but issues develop with time",
      "text": "These are great ear bud headphones with good sound. One issue: both pairs I've owned of these eventually developed some kind of short-circuit such that one channel or the other continually dropped out and you had to keep adjusting the plug to get both channels back, to the point that they had to be replaced. About two years' worth of good performance before this problem developed. Considering the reasonable price, I just replaced them. But it would be nice if they were a bit more durable.",
      "rating": 3.0,
      "verified": true,
      "author": "Mark A. BEHM",
      "helpful_votes": 0,
      "publication_date": 20131112
    },
    {
      "title": "Excellent headphones",
      "text": "Great sound, nice cable and style for a little more then a combo at McDonlands. I was looking for a decent pair of in-ear headphones for under$15. I looked around different stores, read reviews and ended up at Altec Lansing. I listening to all types of music and I enjoy clear sound. These headphones provide a great range and are bassier than I expected. It would be cool to spend a $1 more and they would include a case or some type of holder for it. I plan to keep these for awhile, and I'm the person who goes through headphones every month.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20120311
    },
    {
      "title": "What you see is not what you get",
      "text": "The picture associated with this item is incorrect The picture is the Backbeat 906 which is Bluetooth capable What you really get is a set of stereo earphones (In the Ear) that are wired Again the picture is misleading in my view Earphone are good but generally know better then any others I have tried.",
      "rating": 2.0,
      "verified": true,
      "author": "Randy L. Murphy",
      "helpful_votes": 0,
      "publication_date": 20100112
    },
    {
      "title": "soft sounds for your ears",
      "text": "Love these they are so comfortable you forget you have them on. Best Buy told me they aren't going to carry them any more.",
      "rating": 5.0,
      "verified": true,
      "author": "Bobbi Sox",
      "helpful_votes": 0,
      "publication_date": 20140711
    },
    {
      "title": "altec lansing ear buds",
      "text": "The earbuds have great sound and a very comfortable. Here comes the but. The ear buds are poorly constructed. I have had them for a few months and there is a short in the plug end. I have to adjust the plug wire to hear all the sound.",
      "rating": 3.0,
      "verified": true,
      "author": "james holston",
      "helpful_votes": 0,
      "publication_date": 20120927
    },
    {
      "title": "Beyond Expectations!",
      "text": "After perusing through umpteen number of ear phone models, I chanced upon Altec Lansing UHP106. The gold and black colour drew my attention. I have 95% satisfaction with the product. The beats are clear and distinct. Noise is greatly reduced. I am reserving the 5% as it does not have a mic. The delivery was 2 days ahead of the actual date. Hence, overall, it was a wonderful buy.",
      "rating": 4.0,
      "verified": true,
      "author": "vaidehi ananthakrishnan",
      "helpful_votes": 0,
      "publication_date": 20121117
    },
    {
      "title": "Excellent sound quality for the price",
      "text": "These are well designed and well made earphones that have an overall very good sound, including bass frequencies. I really like the tangle free cloth cables, they will surely help prevent wiring shorts associated with other similarly priced earphoines. Ordered 3 pair at $9.99, and another 2 pair at $11.99.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Shutts",
      "helpful_votes": 0,
      "publication_date": 20130211
    },
    {
      "title": "best low priced buds",
      "text": "These sound GREAT for a fraction of the cost of the others. Can't go wrong with this. Very comfortable, sleep with them every night.",
      "rating": 5.0,
      "verified": true,
      "author": "tazmaniac",
      "helpful_votes": 0,
      "publication_date": 20130429
    },
    {
      "title": "Love These Headphones",
      "text": "My first pair broke after about a year so I ordered this second pair I esp like the cloth cord,",
      "rating": 4.0,
      "verified": true,
      "author": "Zymaze",
      "helpful_votes": 0,
      "publication_date": 20140512
    },
    {
      "title": "Great fit and sound",
      "text": "These have been the best ear buds I've ever had. This is actually the second I've purchased for just in case.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Hansen",
      "helpful_votes": 0,
      "publication_date": 20130524
    },
    {
      "title": "Great Headphones for the Price",
      "text": "Excellent sound quality. You will get feedback from the cord hitting your clothes etc. However I use these headphones when i'm at the gym and I'm either tuned out or have the music up load enough to where it never effects me. Good bang for the buck. Even has gone through the wash acouple of times and still work!",
      "rating": 4.0,
      "verified": true,
      "author": "Claire",
      "helpful_votes": 0,
      "publication_date": 20121206
    },
    {
      "title": "Great sound and durability for the money.",
      "text": "My two teenagers have used many differant brands of headphones have found Altec Lansing to the best for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20140117
    },
    {
      "title": "Good but broke quickly",
      "text": "When I first got these headphones, they seemed really great. The sound was good, they fit comfortably in my ears, and the cord seemed to be thick and sturdy. About a month after the item came in though, they've started to break. The left phone doesn't work at all anymore, and the right one sometimes skips in and out.",
      "rating": 2.0,
      "verified": true,
      "author": "Bgabe",
      "helpful_votes": 0,
      "publication_date": 20120922
    },
    {
      "title": "best pair of earbuds i have ever bought",
      "text": "i use them while riding my bike. other earbuds that i have used in the past always end up developing break in the line near the plug. these have a heavier cloth wraped wire that doesn't tangle and is much stronger and rugged than most earbuds. highly recommended for people that use earbuds during exercise.",
      "rating": 5.0,
      "verified": true,
      "author": "David Lawton",
      "helpful_votes": 0,
      "publication_date": 20130715
    },
    {
      "title": "Good Value",
      "text": "Won't break the bank and good bass response, black fabric woven wire insulation that won't tangle. Good for the gym, poolside, air travel, noisy waiting rooms, reading, study and meditation.",
      "rating": 5.0,
      "verified": true,
      "author": "stevow99",
      "helpful_votes": 0,
      "publication_date": 20130323
    },
    {
      "title": "Ear Buds",
      "text": "This is my second time buying these ear buds. the wires tend to break at the plug after extended use.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce A. Bogucki",
      "helpful_votes": 0,
      "publication_date": 20140415
    },
    {
      "title": "Excellent value for the money",
      "text": "Very good sound quality and comfortable in ear fit. I especially like the fabric covered cord which does not self-cling and resists tangling.",
      "rating": 5.0,
      "verified": true,
      "author": "John Peterson",
      "helpful_votes": 0,
      "publication_date": 20130510
    },
    {
      "title": "Great sound",
      "text": "These ear buds are sooo awesome for the price. This is the second pair I have. I liked the first so well I got a second. Love the fabric covered chords too, feel as if they will last longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20121128
    },
    {
      "title": "Cheap",
      "text": "Looks good but poorly made. My cord separated from the RCA plug after one day. Can't recommend.Sound is average cord doe not tangle.",
      "rating": 1.0,
      "verified": true,
      "author": "R. Kelley",
      "helpful_votes": 0,
      "publication_date": 20130404
    },
    {
      "title": "Ear buds",
      "text": "I originally got a set in Marshalls Could find them again untiI I saw them on this site. They were exactly what I wanted Price was good and they came promptly",
      "rating": 5.0,
      "verified": true,
      "author": "howard schwartz",
      "helpful_votes": 0,
      "publication_date": 20140408
    },
    {
      "title": "Awesome sound!",
      "text": "These in ear headphones are SO awesome. Got a pair for myself and immediately had to get one for the hubby. Shipping was super fast too! Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Quitania",
      "helpful_votes": 0,
      "publication_date": 20130606
    },
    {
      "title": "Nice for the price",
      "text": "I have used similar earphones before and these for the money by far out perform more expensive earphones.Great sound and quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Alan",
      "helpful_votes": 0,
      "publication_date": 20130106
    },
    {
      "title": "good headphones",
      "text": "A really good set of earphones, could have been even better if the had a built in mic. sounds great",
      "rating": 4.0,
      "verified": true,
      "author": "Tauqir H. Abdulla",
      "helpful_votes": 0,
      "publication_date": 20130626
    },
    {
      "title": "Five Stars",
      "text": "Love them. Sound great and block out background noise well.",
      "rating": 5.0,
      "verified": true,
      "author": "wardie",
      "helpful_votes": 0,
      "publication_date": 20150414
    },
    {
      "title": "Good Earphones.....Bad Craftmanship",
      "text": "I bought two of these because they were half the price of what they used to be in the store......and they broke right away. The ear bud just deconstructed inside my ear. Horrible experience and I am completely done with Altec Lansing",
      "rating": 1.0,
      "verified": true,
      "author": "Pete Z",
      "helpful_votes": 0,
      "publication_date": 20140506
    },
    {
      "title": "Cloth Cables are Noisy",
      "text": "I have a major complaint about these earbuds is that the cloth cover cord make an amazing amount of noise every time I shift or move. When I am sitting stationary and listening to my iPod -- the sound quality is good. As advertised, the cloth cords are tangle-free. I bought these because they were inexpensive. So, I don't feel that much of a loss. I recommend finding a set of earbuds with non-cloth cords.",
      "rating": 1.0,
      "verified": true,
      "author": "H.P.",
      "helpful_votes": 6,
      "publication_date": 20090423
    },
    {
      "title": "Meh.",
      "text": "Meh.. Sound was bad for the Price, real bad. Wont be buying again. Sounds was Hallow, flat and well, just sucked. There's better buds out there.",
      "rating": 2.0,
      "verified": true,
      "author": "M. Moreno",
      "helpful_votes": 0,
      "publication_date": 20130831
    },
    {
      "title": "sound, for the money, great!",
      "text": "nice earbuds with a great sound. very comfortable in the ear canal and a great sound for the money. I brought 3 sets in always replace them as they wear out. don't step on them, as I did, they are not that tough.",
      "rating": 3.0,
      "verified": true,
      "author": "Buddy",
      "helpful_votes": 0,
      "publication_date": 20120118
    },
    {
      "title": "great",
      "text": "this product is the best,the bass in the headphones sound like nothing i ever heard except in expensive headphones.definitely will get another pair.",
      "rating": 5.0,
      "verified": true,
      "author": "clifton",
      "helpful_votes": 0,
      "publication_date": 20121003
    }
  ],
  "product_meta": {
    "title": "Altec Lansing UHP106 Backbeat Series In Ear Headphone with Ulitmate Ears technology (Discontinued by Manufacturer)",
    "description": "Product Packaging:Standard PackagingMuzx Series In Ear Headphone with wood finish",
    "rating": 3.8,
    "feature_bullets": [
      "Features 10 mm speaker delivers rich audio sound",
      "Features 6 piece custom fit kit with mulitple tips for reduction of background noise",
      "Features tagle free cloth cable"
    ],
    "specifications": {
      "Product Dimensions": "1.25 x 2.75 x 8.25 inches",
      "Item Weight": "0.8 ounces",
      "Manufacturer": "Altec Lansing Technologies",
      "Language:": "English",
      "ASIN": "B001GUNJPG",
      "Item model number": "UHP106",
      "Customer Reviews": "3.8 out of 5 stars91 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#28,348 in Earbud & In-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 1, 2008"
    },
    "categories": [
      "Earbud Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": ""
  }
}