{
  "website_summaries": [
    {
      "verdict": "An excellent tool in the proper application, but some of its competitors are better options overall.",
      "pros": [
        "Durable and sturdy",
        "feels good in the hand",
        "Venting system protects motor from grit",
        "Paddle switch is a nice feature",
        "Carrying case is a plus"
      ],
      "cons": [
        "Warranty is underwhelming",
        "Runs hot and will sometimes smoke before failure"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "No protection from overheating",
      "text": "The grinder's initial build quality and workmanship seemed good considering the price. However, as someone new to using angle grinders, I was unaware of the risk of damaging the motor via overheating. Within 24 hours of opening the box, I had damaged the device by overworking it while grinding concrete. Because this is a common problem with angle grinders, imho Makita should have taken AT LEAST ONE of the following steps: (a) discussed the risk of overheating in the owner's manual, (b) provided a mechanism to issue a warning and/or shutdown the tool when internal temperature is too hot, and/or (c) covered this kind of damage in their warranty. Unfortunately none of these things is the case.",
      "rating": 3.0,
      "verified": true,
      "author": "PseudoRandomGuy",
      "helpful_votes": 21,
      "publication_date": 20190603
    },
    {
      "title": "Can't go wrong with this Purchase!",
      "text": "Wow what can I say! This makes my 20th Makita small tool purchase dating back to 1980 when Rockwell circular saws went out of business. I have never known ANY problems with my Makita tools, like so many claim to have. When they wear out I send them back and have them rebuilt. I have been doing construction since 1975 and built over 400 homes renovated over 200 more and have operated some really junky tools but none of them are Makita's. This little grinder is a breeze to operate and the case is TOP SHELF! Four grinding disc's and a diamond wheel cutter and an extra wheel guard for under 80 bucks. WOW just WOW!",
      "rating": 5.0,
      "verified": true,
      "author": "sixfooter",
      "helpful_votes": 10,
      "publication_date": 20180701
    },
    {
      "title": "Is this a joke?",
      "text": "A fine example of Chinese quality. It looks like my old Makita, but after the first few minutes it started making a bad noise and the motor slowed noticeably. After less than five minutes it was apparent that the grinder head was trying to seize. They should give these to prisoners for April fools and watch them try to cut their way out, for fun. This grinder was a bad joke! I guess I'll try Milwakee or DeWalt.",
      "rating": 1.0,
      "verified": true,
      "author": "Rebecca Wells",
      "helpful_votes": 23,
      "publication_date": 20170324
    },
    {
      "title": "Runs hot",
      "text": "Great grinder with great accessories. Bought mine to grind down the frame of my truck with a wire wheel. Got about 10% of the way (20mins of constant grinding) until I noticed the grinder getting very HOT but i kept going. Eventually I started to see smoke come from the vent area on the grinder. Let it cool down for an hour and it still seemed to work. Not sure if this is normal or not.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 16,
      "publication_date": 20160804
    },
    {
      "title": "A Good Value- Good for Occasional Use.",
      "text": "Yes, there are better angle drivers. But do you need a better angle driver? In my case where it will be needed occasionally, the answer is no. It's solid and easy to handle with the reversible grip. The paddle lock out switch makes for easy starting. The aluminum case is better than a bag and nice for storage. Along with 5 grinding wheels and 1 diamond wheel makes this the one of the best valued package. Recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael J. Evans",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "VERY VERY difficult to change attachments - Extremely poor shaft lock function and placement",
      "text": "VERY VERY difficult to change attachments - Extremely poor shaft lock function and placement. Also cannot use several common attachments with the guard installed and which is also awkward to adjust and/or remove. Not user friendly AT ALL. I hate it. I've had many positive experience with Makita products over several decades but now am VERY disappointed in the quality of their design staff's competence.",
      "rating": 1.0,
      "verified": true,
      "author": "lonewolfmtn",
      "helpful_votes": 5,
      "publication_date": 20180613
    },
    {
      "title": "Better value than Milwaukee and Dewalt",
      "text": "I would give the tool 5 stars for value of the purchase for having a hard case with a foam insert that holds the discs with an extra guard. Better value than Milwaukee and Dewalt. This angle grinder is lighter then the comparable models and I do love the deadman switch. I gave 4 stars because the way the angle grinder was packaged with no bubble wrap in a big box. The case kept the tool safe during delivery but the case ended up with a few scratches and dings. Overall happy.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 2,
      "publication_date": 20180521
    },
    {
      "title": "Works very well for light/medium use.",
      "text": "Very handy tool. Gets the job done with no fuss. It will heat up with continued use, so it's not for using all day. I needed to remove about 30 fence posts; the kind you drive in with a sledge hammer. I did about 10 a day and it cut through them beautifully, using several blades. I had a pack of 10 blades. I probably still have 7. I then used it to cut angle iron, and square bar; pretty heavy stuff. It worked great. Take your time and ease it thru the metal. Any grinder throws a lot of red hot particles, so it can be a fire hazard. Prepare accordingly.",
      "rating": 5.0,
      "verified": true,
      "author": "David A.",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "It doesn't get in better than Makita",
      "text": "This is the second Makita grinder (someone stole the first one) I've purchased and just like the first one it is a versatile use item. I'm using it now to cut metal lawn edging using a thin Makita metal cutting blade. The grinder is well built, easy to operate, easy to change discs and as a bonus comes with a heavy duty storage case. I highly recommend this grinder.",
      "rating": 5.0,
      "verified": true,
      "author": "Harley R.",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Nothing i dont like about this tool and case",
      "text": "Bought this tool 4 years ago. My second one after first was stolen. I use it hard all year long. Eventually burned up the worm gear inside the head and was able to locate a part on line and repair it myself for about $12. This grinder blows away my other dewalt. Im a big fan of the paddle switch but also really like the case that comes with this. Keeps all my attachments and wheels all in one spot all the time. For a corded grinder i dont think you can go wrong here.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee Money",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Been using these for many years, they hold up well and are of good quality.",
      "text": "We've been using variations of this same model angle grinder now for over 20 years in a commercial/industrial business environment. They simply are the best for the money - yes, you can find cheaper ones, bigger ones, other ones, etc.., but this thing will work for 90% of people 90% of the time. Very good quality (even after all these years). Highly recommended, the latest one we purchased has been used regularly now for almost 5 years with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "FlyboyyyTop Contributor: Running",
      "helpful_votes": 3,
      "publication_date": 20170531
    },
    {
      "title": "Easy to use grinder and powerful for its size",
      "text": "Needed a grinder for my Jeep project. Had to cut into my Jeep’s hood and picked this Makita grinder since we use this brand at my work place. These grinders will last you forever and are very powerful. It was very easy to manoeuvre and cut straight through the hood. Attached are some pictures of the project. Will use this grinder for several other projects in and around the house!",
      "rating": 5.0,
      "verified": true,
      "author": "Martijn",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "POWERFUL GREAT BUY! Makita 9557PBX1 4-1/2\" Paddle Switch Cut-Off/Angle Grinder",
      "text": "10 AMP motor, nice case, good selection of grinding wheels included. Much more powerful than cheaper 3-6 amp angle grinders. Our first use was to power a grinding diamond wheel for tile thin set removal. No problem, drove through heavy, dusty loading well. I would buy again without hesitation. I have always had good service from Makita power tools and looks like this grinder will be a good one as well. If you are facing thin set removal, see my reviews on other components to do that job. (Makita A-96198 Double Row Anti-Vibration Diamond Cup Wheel, 4-1/2\"; Dust Collecting Wheel Guard, 4-1/2 In by Makita)",
      "rating": 5.0,
      "verified": true,
      "author": "LHurn",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Excellent, just excellent.",
      "text": "This is great kit for the money. You can feel the power of this tool when you fire it up and it sure makes work on projects a lot easier. This one is replacing my old Makita which worked great for years and probably still does, I just can't find it anywhere. Also kudos to Amazon for the fastest shipping ever. I ordered this kit at 7:30 PM Friday night. At 9:30 AM Saturday, the door bell rang and when I answered it, there was a brand new Makita sitting there. From the time I made the order to the time it arrived, 14 hours. I'm absolutely \"STUNNED.\"",
      "rating": 5.0,
      "verified": true,
      "author": "Kamja",
      "helpful_votes": 2,
      "publication_date": 20170326
    },
    {
      "title": "Smoothest grinder, and best price.",
      "text": "I chose this unit after comparing dewalt, makita, and ryobi directly from home depot and Lowe's. They ask did the same thing. But the makita was the smoothest, least vibration, most comfortable in the both mine vs my husband's big hands. This unit with case, diamond blade and 5 extra grinding disks was $10 cheeper than the bare tool at the store. The extras alone were $75 if you bought them individually. I paid $69 for the kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy R",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "FALSE CLAIM... NOT A TOOL-LESS GUARD ADJUSTMENT",
      "text": "Fool me once, shame on you. The product description includes a phony claim of a tool-less guard adjustment. This might be a good grinder, but the guards included with this kit clearly require a screwdriver. Because of the nature of what I do with this tool, constantly changing angles around the job site, the tool-less guard adjustment feature was very important to me... suffering buyer's remorse now.",
      "rating": 2.0,
      "verified": true,
      "author": "Kyle Hines",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "great tool, strong and durable",
      "text": "i have used it for just about everything in my house. from finishing my entire bathroom, tile cutting, sanding concrete slab uneven parts, wood and outside garden projects. You must read instructions carefully and make sure you have guard on all the time. The ability to change blades is great but I do wish most of them would have a guaranteed lock mechanism and not just rely on pressure turning to lock in blade.",
      "rating": 4.0,
      "verified": true,
      "author": "Luartech",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Great Product",
      "text": "Great Product. Versatile. Did a lot of rock cutting with it this year putting a flagstone walkway. It never let me down. Comes with an assortment of grinding wheels plus one diamond masonry wheel - I have not used any of the grinding wheels yet. I have used Makita masonry wheels and metal cut off wheels extensively with this machine. Still going strong",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 2,
      "publication_date": 20170811
    },
    {
      "title": "Powerful",
      "text": "I am so glad I got this grinder. I had just demolished a grinder (different brand) doing exactly the same thing: remove old thinset from ceramic floor tiles, so that they can be reused. Huge difference. This device took it all with great confidence. The other one had literally fallen apart. And, it comes with all these freebies. Talk about a bargain.",
      "rating": 5.0,
      "verified": true,
      "author": "Francisco",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Great grinder! I used a cut off wheel to ...",
      "text": "Great grinder! I used a cut off wheel to make a bunch of cuts through metal, a precision cut, and it worked great! Then I put on a concrete grinding disk and scribbed solid stone, which is hard work and the grinder worked great on that as well. On that project, I had the grinder running for long periods without a break, and there was no stress at all in the tool. One last point, please be sure to wear eye projection whenever you use a grinder!",
      "rating": 5.0,
      "verified": true,
      "author": "techguy",
      "helpful_votes": 2,
      "publication_date": 20170427
    },
    {
      "title": "Great tool value!",
      "text": "This is a great value and for a few dollars more than the tool only you get a decent (albeit not super heavy duty) storage case that stores not only the tool and included disks but also a few other cutoff/flap disks. The tool itself is very comfortable and never seems to lack for power and the additional grinding disks and diamond blade are a lot of extra value as well!",
      "rating": 5.0,
      "verified": true,
      "author": "BnE",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Fine Tool For Home Craftsmen",
      "text": "All of us have owned a variety of Makita power tools over the last decade or so. I have always found the firm to offer fine quality for the home crafts-person. I needed an angle grinder for metal cut-off and this was my price point for quality, longevity and for performance. I purchased specialty disks to meet several needs and that flexibility is a plus for the system. So, everything works as expected. I am not doing 'industrial' or long-time grinding; I am not testing the limits of the motor for overheating. This is the right tool for my home craftsman needs.",
      "rating": 4.0,
      "verified": true,
      "author": "James EllsworthTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "STAY AWAY FROM THIS TOOL.",
      "text": "I USE THIS GRINDER FOR LITERALLY 5 MINUTES AND IT BURNS. MY FRIEND USED HIS FOR A FEW WEEKS AND THE SAME THING HAPPENED. STICK WITH DEWALT THEY ARE MUCH BETTER. HAD ONE FOR 5 YEARS AND ITS STILL WORKING.",
      "rating": 1.0,
      "verified": true,
      "author": "BUDD",
      "helpful_votes": 3,
      "publication_date": 20190515
    },
    {
      "title": "As expected for the most part",
      "text": "Box inside the Amazon box was a little beat up. So I expected damage to the case and was surprised that there was only one little dent, guess I got lucky. Upon opening everything looked clean and well packaged as expected. As of now I would recommend this.",
      "rating": 4.0,
      "verified": true,
      "author": "B4U2D0",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Very impressed",
      "text": "I always like tools that come with a case because I try to keep them protected and clean, especially carrying them around in the back of the truck. I have used this on metal and concrete and it worked great. The only down side is the latching switch. If you latch the switch down for longer use - just bumping the switch will deactivate the grinder. Seemed to have plenty of power and the case has places for additional wheels.",
      "rating": 4.0,
      "verified": true,
      "author": "For Him",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "for 5 Makita grinding wheel and a Makita cut off wheel with a case is like $30. for the grinder Home Depot doesn't have ...",
      "text": "I shopped around and $80. for 5 Makita grinding wheel and a Makita cut off wheel with a case is like $30. for the grinder Home Depot doesn't have them in stock for that price. The case is a little flimsy black plastic and aluminium with sponge cut outs to hold the wheels, grinder, and guard, but its better than throwing it in the tool bin with the other stuff, but I don't think it'll hold up.",
      "rating": 4.0,
      "verified": true,
      "author": "David M.",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Highly Recommend",
      "text": "Haven't had the opportunity to use this too much but so far it seems really good. The grinder is easy to control and operate. I easily cut through some emt tubing i had laying around in my garage and the cutting guard it comes with really helped keep metal shards from flying everywhere. All the extras really put this tool over the top. This Makita replaced a brand new Milwaukee that cost just as much but didn't have any of the extras and was hard to control due to switch placement.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20160513
    },
    {
      "title": "Didn’t work first time used!",
      "text": "Doesn’t deserve one star. First time out of the case, five minutes into use, motor smoked, entire unit got too hot to hold! Definitely didn’t over work it. Couldn’t cut through a hollow metal post. Save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "I am old.",
      "text": "Sadly this was too difficult for me to hold down lock pin and loosen for blade changes. Needed 3 hands and I only have 2. Bought because it is light weight but will have to keep looking. Have used power tools for years without any problems.",
      "rating": 1.0,
      "verified": true,
      "author": "Margaret Strauss",
      "helpful_votes": 2,
      "publication_date": 20190907
    },
    {
      "title": "Great deal for home use",
      "text": "My initial impression of this grinder is that it is a good deal for what it is and perfect for light to medium home use. I do not see the case, especially, holding up to daily contractor use but it is nice to keep things organized at home.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Troyer",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Great Tool!",
      "text": "Great tool, I've been using it to cut, grind and sand mild steel for two months now. It has plenty of power; it cuts 1/4\" in seconds. It came with five grinding wheels and I'm yet to wear through two of them. The case is nice, it's not heavy duty, I wouldn't kick it around the shop, but it protects the tool just fine. For the money there isn't a better package out there. If you need a grinder for light metal fab or automotive work you found it.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20160522
    },
    {
      "title": "Great price! . .  I am happy I chose Makita.",
      "text": "Makita goes above and beyond with this angle grinder . . . Powerful motor and light 4.5lb weight. . . The handle is not too big which makes it easy for me to hold. This is a high quality tool that I expect to have for years. The hard case and extra discs make this an excellent value. A++ Highly recommended !",
      "rating": 5.0,
      "verified": true,
      "author": "C. Bow",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Makita is not so great upgrade",
      "text": "This unit is not a good choice for a lot of different reasons the switch is located in the grip is not conducive to true muscular grinding .you can accidentally turn the unit on just by picking it up, that's never good at how many thousand RPMs.",
      "rating": 2.0,
      "verified": true,
      "author": "Racer X Maine",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Don't be fooled",
      "text": "Please note: the description of this item DOES NOT match the item. No soft start, no rotating gear housing, no ac/dc switch. Just a basic grinder with accessories. I was sorely displeased and returned the item.",
      "rating": 1.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Great for Automotive DIY-er",
      "text": "I have used this primarily when doing car work, especially when it involves rusty exhaust systems. Forget unbolting clamps and all that mess - just cut it out :) But I have also used this to sharpen axes (grinding wheel), remove paint/rust (wire wheel), and cut a variety of other metal objects. Most recently, I attached a twisted wire wheel and took the finish/paint/rust off several of my suspension parts to prep for powder coating. The grinder was running for close to 2.5 hours straight, and I wasn't applying \"light pressure\". This ain't no harbor freight tool. The case is REALLY bulky, but I won't knock the review down a star just for that..",
      "rating": 5.0,
      "verified": true,
      "author": "mtd240",
      "helpful_votes": 0,
      "publication_date": 20131212
    },
    {
      "title": "Great package",
      "text": "Great choice for an everyday, or occasional grinder. Stout design, plenty powerful for the size, and should stand the test of time. This is the kind of tool that makes me find reasons to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "High quality",
      "text": "I've always had good experiences with makita tools. This one has much less vibration than the cheaper one I had before. The extras on this bundle make it a really good deal.",
      "rating": 5.0,
      "verified": true,
      "author": "J M",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "My new go to grinder, It is a great buy.",
      "text": "My go to grinder. I have wood, metal and concrete disk for 4 1/2 inch grinders. This magnificent tool does it all. Doesn’t overheat or complain. 1st makati and hands down the best.",
      "rating": 5.0,
      "verified": true,
      "author": "jwilkins",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Okay for $80",
      "text": "The first time I used this grinder sparks from my outlet melted the tips of the plugs prongs. Turned from silver to gold. After that I attached a power surge/extension cord to it and everything's fine. Most likely my outlet was the issue since it's an outside plug. The grinding wheels that come with it show less wearing compared to the cheap brands at my local store. The case is solid and has enough space for a few extra pieces.",
      "rating": 4.0,
      "verified": true,
      "author": "ER",
      "helpful_votes": 0,
      "publication_date": 20151015
    },
    {
      "title": "Useful tool",
      "text": "I have used it to cut and grind1/8” thick steel plate and had no problems.Just needed to get use to maneuvering it to the best position to grind or cut using the appropriate disc. Also used to sharpen lawn mower blades.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth Lee",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Can’t beat the price!",
      "text": "For this price you usually just get the box, instructions and tool. With this deal you get the quality tool, case and accessories. Super value on a quality tool.",
      "rating": 5.0,
      "verified": true,
      "author": "John H.",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Do your grinding with Makita",
      "text": "This is a really solid product, quite a bit more powerful than some. Came with case and some grinding / cutting disks, so I think it’s good value for a top brand",
      "rating": 5.0,
      "verified": true,
      "author": "Dhopewell",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Very happy",
      "text": "I really loved this package. It came in very nice box, well organized inside. came with the diamond blade which I was in need. I had to modify my kitchen granite counter top that was a peace of cake with this angel grinder and the blade included. Did the job like a pro and packed it for a later use. I had to pay $200 for a pro to come and do it for myself. instead I paid less than half for this tool and did it myself and get to keep this great tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Ali E",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "Awesome Grinder",
      "text": "This has got to be one of the best grinders I've ever used. Awesome for home use. And, the molded case with extra wheels is the push over the top. I give this a 5 star, but there is one thing. If you plan to keep it stored in the case like I do, you will need to either remove the handle each time you put it away or cut the foam to permit the handle to remain installed. But, that is not a feature I was looking for when I bought this. So, product met all my needs and still gets 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "rich",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "Best 4 1/2 in Grinder I've Ever Used",
      "text": "Well, yeah, it's just a grinder but it's a Makita so it never breaks and the damn case is worth it's weight in gold. Everything you need, wherever you are, is right there inside the case! Handy as hell and I use this tool all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom F.",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Excellent tool for the money!",
      "text": "Replaced an older Makita with this one. Very nice grinder. Sturdy case. The paddle switch is a great upgrade from the one it replaced. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Thain",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "High quality tool",
      "text": "This is a contractor quality tool that has tons of power, great features and seems to be one that will be in my tool shed for years.",
      "rating": 5.0,
      "verified": true,
      "author": "cabin creature",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Love the tool",
      "text": "So far used the tool to cut clay bricks. The enclosed diamond disk does it like a snap, tens of cuts with no visible change to the disk or the tool. The nice looking tool box makes the tool very easy to store and reach.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff P.",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Product is great. but I got missing parts",
      "text": "I got last week this. Product is great. but I got missing parts. amazon price was good but missing parts worth then deal. I was warehouse deal and 'inspected' sticker on it. but they never inspected. watch yourself when you got warehouse deal. it is not the deal, and they haven't 'inspected'",
      "rating": 1.0,
      "verified": true,
      "author": "jUNG-MIN",
      "helpful_votes": 4,
      "publication_date": 20170601
    },
    {
      "title": "Great buy",
      "text": "This is a good strong performing grinder. The grinding wheels, blade, and case make it a great bargain. This grinder does not have makita's sjs system to prevent drive gear wear during really hard use, but I am sure it will last many years without it. Great tool for any kind of metalwork",
      "rating": 5.0,
      "verified": true,
      "author": "steven hall",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "Great Buy",
      "text": "Grinder is easy to use great for any job with the correct attachments, sand disks, etc Have two will buy again if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Phydo11",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Great Option for Makita Angle Grinder",
      "text": "I bought the same Makita angle grinder (7.5 amp) from my local box hardware store. I would have been pleased it with it until I saw this package on Amazon. Same price plus the numerous accessories and case = awesome value. The grinder itself is fantastic. I've owned a couple over the years and this is my first paddle-switch operated one - and I am quickly becoming a fan. Plus this has a locking option to keep the unit activated for longer term operation. The case is great for keeping everything associated with your grinder in one place. It's not a big case, but does the trick for a few extra disks.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Putnam",
      "helpful_votes": 0,
      "publication_date": 20130818
    },
    {
      "title": "Awesome, Versatile Tool",
      "text": "Awesome. Just bought this recently for removing thinset off of my subfloor - which it does but it also cuts metal, concrete, and brick with ease not to mention grinding. This tool is so versatile I should have bought one long ago. Now I can kiss my hacksaw goodbye.",
      "rating": 5.0,
      "verified": true,
      "author": "04rk88",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "Fantastic Deal",
      "text": "Great looking Case, the angle grinder works well and it also brings some extra cut wheels. Wonderful product. Also for some unknown reason this product to longer then it was estimated however because I'm a prime member, Amazon gave me discount for the inconvenience.",
      "rating": 5.0,
      "verified": true,
      "author": "R3",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "Great grinder.",
      "text": "This angle grinder kit is great. I've had no issues at all! It has lots o power and the case and extra grinding wheels were nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Rod",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Great price and package.",
      "text": "Love the way this works. Most grinders I have used have a slide power button and this one has a large trigger style. Great item that will give years of work I am sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott S.",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "great for cutting metal.",
      "text": "Good grinder. Not heavy and easy to use. I bought with metal.disks to cut some metal pols. Worked as described!",
      "rating": 5.0,
      "verified": true,
      "author": "Maximyshka",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Perfect",
      "text": "Excellent value. Grinder works flawlessly and there are enough grinding wheels in the box to last for years.",
      "rating": 5.0,
      "verified": true,
      "author": "Andre",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "I highly recommended this to anyone interested",
      "text": "I love ❤️ everything about this machine and the hardware that come with this the grinder is very very responsive",
      "rating": 5.0,
      "verified": true,
      "author": "Jorge B",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "After 3 years of almost no use the product is worthless",
      "text": "I bought the grinder 3 years ago. I almost didn't use it. only occasional use. in home improvements, not professionally. Last time it started overheating and sparks started to came out!! I don't know if makita will cover this!",
      "rating": 1.0,
      "verified": true,
      "author": "NYC",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "nice case and the extra blades is a bonus",
      "text": "The only reason I did not give this a 5 star is because of the paddle switch safety latch and the paddle switch. The safety takes a little time getting used too, on how to release the paddle switch. The paddle switch is a little awkward when using the grinder for longer periods of time. I was using this to cut out the old wall tile and cement from the walls of my bathroom. The grinder took a beating and was used hard and no problem, nice case and the extra blades is a bonus.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer's",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "Excellent tool with multiple uses",
      "text": "I used this for cutting a trough in my basement foundation to add plumbing for a new bathroom. It worked like a charm and then doubled as a tile cutter when it came time for flooring.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Im a chick and this is my first grinder!",
      "text": "Great grinder! My husband wanted it but while redoing a Hull of a boat, mostly on my back, this grinder is light weight and has an extra long cord. It is not very loud either which is nice. It comes in a nice compact aluminum case and has a few wheels with it. I have no issue using it or changing the wheels. Great product and Great name! Must buy for a good grinder!",
      "rating": 5.0,
      "verified": true,
      "author": "Anastasia",
      "helpful_votes": 10,
      "publication_date": 20120626
    },
    {
      "title": "Works Great!",
      "text": "This grinder worked great and the case is great to store it on the shelf and not lose parts and pieces like I usually do. I bought it to cut out a new floor register in the tile floor of our bathroom while installing an all new furnace. The included masonry blade did the job very well going through the porcelain tile and the 1/2\" durock underlayment. I have since used one of the cutoff wheels to cut sheet metal while making new inner fenders on a car project. I wouldn't hesitate to buy this grinder again.",
      "rating": 5.0,
      "verified": true,
      "author": "BWell",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "Very well made",
      "text": "Really well made. Exactly what you want in a power tool - solid, rugged, more than powerful enough, comfortable in the hand. Love the metal case as well. I'm not a pro, so I can't comment on daily use, but for what I do (cutting, sharpening, stripping, etc.) this is a great tool. First Makita tool I've owned - impressive.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Reeves",
      "helpful_votes": 0,
      "publication_date": 20160710
    },
    {
      "title": "Not always what you read",
      "text": "It looks like the unit was AC/DC by the ad & the information but when I received it it was only AC",
      "rating": 3.0,
      "verified": true,
      "author": "Richard R Alcantar",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Get one now",
      "text": "Fantastic grinder, protective case, starter discs. No better value out there currently!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Cook",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Power and quality",
      "text": "Was highly rated in my researching. Was thinking of the Harbor Freight models (as you could probably buy a few for the price) but figured I did not want to take a chance as I needed it to work for my purposes (cutting Metal rods, grinding concrete). Worked well, was relatively quiet, powerful and minimal vibration. A good addition to my toolbox. The unit came in an aluminum case, with 5 grinding wheels and one diamond wheel. Would have been nice if they included a metal cutting wheel too, but not a showstopper in my opinion)",
      "rating": 5.0,
      "verified": true,
      "author": "R.S.",
      "helpful_votes": 0,
      "publication_date": 20130424
    },
    {
      "title": "Good buy",
      "text": "Great tool, a bit larger than my old one. But love the paddle switch and slow start.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Great tool for the job.",
      "text": "Plenty of power and takes hard knocks and keeps on running. That's what I care about and Makita delivers! The included grinding wheels are mediocre. The cut-off wheel is good. The tool is fabulous.",
      "rating": 5.0,
      "verified": true,
      "author": "Hawaiian Cooks",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "Very pleased",
      "text": "Haven't tested it out on an actual job yet, but it's very high quality, sturdy, and well made. I'd highly recommend. Great deal. The blades that come with the grinder however are solely for grinding and cutting masonry. If you want to cut porcelain or tile, you'll need to purchase a continuous rim blade which will set you back at least another $25-30 bucks.",
      "rating": 5.0,
      "verified": true,
      "author": "Charl3yBoy",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "Best grinder",
      "text": "Used this Makita grinder with many past jobs. Decided to finally buy one for myself at home. Great price and these little grinders really last forever, takes a beating. The aluminum case is a real bonus, very well made. Can't belive they sell it so cheap. Everyone should have one of these in their garage.",
      "rating": 5.0,
      "verified": true,
      "author": "Lawrence",
      "helpful_votes": 0,
      "publication_date": 20160109
    },
    {
      "title": "Honestly wish I had went Milwaukee",
      "text": "Basic grinder built with Makita quality but without tool- free guard.",
      "rating": 4.0,
      "verified": true,
      "author": "G. Franks",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Good Angle Grinder",
      "text": "Works as advertised and it's quieter than other units that are more costly.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Juliano",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "A must have multi purpose use for home",
      "text": "Multi purpose, lite good power A must have tool for multi purpose use",
      "rating": 5.0,
      "verified": true,
      "author": "Gjon Berisha",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "This grinder is amazing. I zipped right through granite",
      "text": "Wow what a difference between my old grinder. This grinder is amazing. I zipped right through granite. I had to enlarge an opening for a drop in stove. I can not image a project that would require anything more ... unless you needed to cut deeper than 2 inches. For the home diy person it is great. Low noise, low vibration ( my neighbor thanks you Makita)",
      "rating": 5.0,
      "verified": true,
      "author": "AtlantaArtist",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "MUST HAVE!",
      "text": "This thing is bad ass! Great power and nice durable case. Just be sure to let the tool cool down before returning to case.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "so far works great",
      "text": "work great got alot of power i beenusing it on building go carts so far no complats work great",
      "rating": 5.0,
      "verified": true,
      "author": "Alien zone",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Great Buy",
      "text": "It works great. I used it to make a lot of cuts in concrete for over an hour and I had no heating up issues. I will try it out next with a concrete grinding stone. I also have a lot of tools in my garage and I really like tools in a case.",
      "rating": 5.0,
      "verified": true,
      "author": "Linam g",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "Everything you will need, all in one place!",
      "text": "Great Product! I absolutely love the hard case it comes in to protect the tool and keep al accessories together in one place.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "It’s only a medium duty tool 7 amp",
      "text": "Cuts Maney things ,comes with a variety of disc in packaging,good for homeowners and part time hobbyists,professional use would require higher amp tool,nice sturdy case fits everything,has been there ready whenever I needed it",
      "rating": 5.0,
      "verified": true,
      "author": "charles",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Incredible Bargain",
      "text": "Great deal on a kit with 6 grinding disks including a diamond disk, not to mention the aluminum case. Top quality grinder is icing on the cake!",
      "rating": 5.0,
      "verified": true,
      "author": "Dwight M.",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Very well made and powerful, and worth it to get the case and wheels",
      "text": "This is a very high quality tool. The carrying case is very convenient as well, and you get 4 wheels plus a diamond cutter wheel - and all fit conveniently in the case. It's extremely powerful and goes through steel like butter - no overheating or lack of power here. Just get this one, you won't regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20120619
    },
    {
      "title": "Excellent angle grinder",
      "text": "Bought to take care of a bad tile job. Was able to grind away tile in order to get a outlet plate on properly and replace the receptacle. Finding other uses for it here and there. Among other things grinding off a lock on my shed the original owners left. Great performance, accessories and case are great. Plus its makita, how can you go wrong?",
      "rating": 5.0,
      "verified": true,
      "author": "Candice srail",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "I should have gotten one of these long ago",
      "text": "I should have gotten one of these long ago. I've used it for so many things this summer from grinding down concrete to cutting cast iron pipe and rebar.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Piper",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Great grinder, Unbeatable package deal",
      "text": "The grinder is great - it does what you expect it to do. However, it is the quality of the case and value of the accessories included make this an incredible deal. You could easily pay more for a similar tool without any of the extras.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Hoffman",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "10/10",
      "text": "I weld structural steel for a living, and I needed a smaller grinder to get in tight spaces, as my company only has the big 7\" makitas. Anyhow, I've only used this for a day so I can't say how long it will last, even though it feels very well built. It's one of the best compact grinders I've used. It makes my job much easier. It seems to have a very powerful motor that'll make your grinding go quickly and easily. The packaging was very nice and everything seemed of very good quality. I'd highly recommend this to any welder/fabricator/DIY'er.",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie L",
      "helpful_votes": 0,
      "publication_date": 20160103
    },
    {
      "title": "Cheap",
      "text": "Didnt last burned up quickly within two weeks moderate use",
      "rating": 1.0,
      "verified": true,
      "author": "TNinLP",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Great for concrete, mortar, and brick",
      "text": "This grinder worked great to cut my raised hearth so my floating wood flooring could go under it.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Fits nice in my welding tool bag",
      "text": "Fits nice in my welding tool bag. Runs well. Have been using Makita for years, nice stuff and still made well.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Kent",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "... don't use this grinder a whole lot but I love it when I do",
      "text": "I don't use this grinder a whole lot but I love it when I do. Excellent tool. I also like having the carry case.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike H.",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "I have only used it so far to sharpen lawn mower blades but it did a nice and quick job",
      "text": "It is a powerful grinder for the money. I have only used it so far to sharpen lawn mower blades but it did a nice and quick job. It's not a toy so obviously be vigilant about wearing the proper eye protection that keeps any potential flying debris. The case isn't super sturdy but it is definitely a bonus.",
      "rating": 4.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20160621
    },
    {
      "title": "Cant go wrong with this Makita",
      "text": "Grinder feels solid and has been working great. Case is nice to put the tool away neatly.",
      "rating": 5.0,
      "verified": true,
      "author": "MikeyBuysAlot",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Best buy I have found",
      "text": "Best buy I have found. I have also run 7\" disks on this grinder without issue. I'm a home user though and not continuously using. Paddle lock is a bit of a pain at times when trying to keep it locked on.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20180202
    },
    {
      "title": "Good product, great price.",
      "text": "I would have chosen 4.5 stars, but not an option. I don't rate anything as high as it can be, because nothing is perfect and there is always room for improvement. Likes: Great power, lightweight and balanced. Included grind wheels and diamond blade, big bonus. Dislikes: Paddle switch. It's too easy to disengage the auto on switch. Minor detail though, good machine. Recommend highly to anyone that needs a grinder for multiple purposes, it's a stand up machine.",
      "rating": 4.0,
      "verified": true,
      "author": "daryl kruta",
      "helpful_votes": 0,
      "publication_date": 20140522
    },
    {
      "title": "Great indispensable tool",
      "text": "Great indispensable tool. I use it all the time and the price with the case was very competitive. This was a new tool that replaced my 12 year old one. .",
      "rating": 5.0,
      "verified": true,
      "author": "Gary M",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "Great Angle Grinder",
      "text": "Works great! My Makita cordless drill has withstood a lot of use and abuse so I figured I'd stay with Makita. Another decision point for me was that it is sealed to prevent dust from getting in to the motor.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Everything else was fine except for the casing",
      "text": "Received this item with the casing having been damaged. A crack appears on the casing. I really bought this because of having the casing to go with the grinder accessories. Everything else was fine except for the casing. I don't know how long will it last in the casing because of moving from site to site. Poor packaging.",
      "rating": 3.0,
      "verified": true,
      "author": "Fiyo",
      "helpful_votes": 5,
      "publication_date": 20141216
    },
    {
      "title": "pretty sweet unit!",
      "text": "Power! Nice mid range unit, feels solid, comes with 5 grinding wheels and 1 diamond blade. The case is a nice bonus. Can't comment on the durability as i have only had it for a few days but will update my review of something comes up. **UPDATE** 1/9/19 I've abused the heck out of this grinder and it hasn't skipped a beat! Tough as nails! Love it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jay Roberts",
      "helpful_votes": 0,
      "publication_date": 20150505
    },
    {
      "title": "Always love the Makita tools",
      "text": "All I can say can't go wrong with these grinder. Makita serving me wells, no complain.",
      "rating": 5.0,
      "verified": true,
      "author": "J.N.Bui",
      "helpful_votes": 0,
      "publication_date": 20191114
    }
  ],
  "product_meta": {
    "title": "Makita 9557PBX1 4-1/2\" Paddle Switch Cut-Off/Angle Grinder",
    "description": "Style:Tool OnlyMakita’s 4-1/2” Cut-Off/Angle Grinder combines 7. 5 AMP power with comfort and motor-protection features for longer-lasting industrial performance. The 9557PB Angle Grinder delivers 11, 000 RPM, with soft start for smooth start-ups. The Cut-Off/Angle Grinder also features a range of durability features including labyrinth construction which seals and protects the motor and bearings from dust and debris for longer tool life, as well as a protective zig-zig varnish engineered to seal the armature from dust and debris. Ease-of-use features include an extra large paddle switch for comfortable operation, and a lock-on/off feature for continuous operation. The 9557PB weighs only 4. 5 lbs., with a side handle that can be easily installed on either side of the tool. In addition, the “tool-less” wheel guard adjustment provides easy clamping. This grinder also has an AC/DC switch for use with alternative-power sources. The 9557PB is a versatile and powerful grinder engineered for cutting, grinding and polishing applications. The 9557PBX1 is a kit that includes the Angle Grinder, 5 4-1/2” grinding wheels, metal tool case, cut-off and grinding wheel guards, as well as a Makita Diamond Blade with turbo rim engineering for constant contact with material for a smoother cut and finish.\n\nFROM THE MANUFACTURER\nThis powerful 7.5 Amp Makita angle grinder has an exclusive labyrinth construction that seals the motor and bearing from contamination.The 9557NBX features a switch (AC/DC) that is conveniently located on the top of the motor housing and a small circumference barrel grip for easy handling. 4-1/2\" Angle Grinder AC/DC, 7.5A Motor For Heavy Professional Grinding Applications, Spindle Lock For Easy Wheel Changes, Small Circumference Barrel Grip For Easy Handling, Side Handle Can Be Installed On Either Side Of Tool For Operator Convenience, Switch Is Located On Side Of The Motor Housing; Lock-On Feature, Grinder Includes: 4-1/2\" Grinding Wheels, Side Handle & Wheel Guard, Includes Extra Diamond Wheel and carry case.",
    "rating": 4.7,
    "feature_bullets": [
      "Powerful 7.5 AMP motor for high output power in a more compact tool (only 4.5 pounds)",
      "Small diameter barrel grip (only 2 to 1/2 inches ) for added comfort",
      "Labyrinth construction seals and protects the motor and bearings from dust and debris for longer tool life",
      "Lock on/off feature for continuous operation",
      "AC/DC switch for use with alternative power source",
      "Protective zig zig varnish seals the armature from dust and debris for longer tool life",
      "Extra large paddle switch for comfortable operation",
      "Thicker coil wires are wound more closely to reduce heat and energy loss",
      "All ball bearing design and metal gear housing for durability",
      "(1) 4 1/2inches General Purpose Turbo Rim Diamond Blade A 94552",
      "Aluminum case",
      "Diamond wheel",
      "Metal gear housing",
      "Paddle switch ; (5) 4 1/2 inches 24 Grit Grinding Wheels",
      "4 4 1/2 grinding wheels"
    ],
    "specifications": {
      "Manufacturer": "Makita",
      "Part Number": "9557PBX1",
      "Item Weight": "12.42 pounds",
      "Product Dimensions": "5.75 x 15 x 10 inches",
      "Item model number": "9557PBX1",
      "Is Discontinued By Manufacturer": "No",
      "Style": "Tool Only",
      "Material": "Plastic",
      "Power Source": "Electric-powered",
      "Voltage": "120 Volts",
      "Item Package Quantity": "1",
      "Measurement System": "Inch",
      "Special Features": "Compact",
      "Included Components": "4-1/2\" Diamond Blade, Turbo, General Purpose",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "1 year",
      "ASIN": "B0010DHFTK",
      "Customer Reviews": "4.7 out of 5 stars1,121 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#5,228 in Tools & Home Improvement",
      "Date First Available": "May 16, 2006"
    },
    "categories": [
      "Angle Grinders",
      "Power Tools",
      "Tools & Home Improvement",
      "Power & Hand Tools",
      "Grinders"
    ],
    "price": 77.89
  }
}