{
  "website_summaries": [
    {
      "verdict": "An expensive space-saving model that works best for people who iron only occasionally.",
      "pros": [
        "Convenient \"stow-away\" board",
        "Attractive chrome construction",
        "Mounting hardware is included"
      ],
      "cons": [
        "Difficult to install",
        "Not suitable for ironing larger items"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Poor Quality",
      "text": "Parts out of the box are missing and metal brackets are bent. There are no video instructions online. The box says installs in 15 minutes. I was 2 hours in when I found important metal parts were bent, and I’m a handyman. You won’t be able to install this in a face frame cabinet without a table saw. Wish I had bought a different brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Luke",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Does not lay flat",
      "text": "Easy installation but unfortunately when correctly installed per instructions the front half of board is slightly inclined. No where in instructions or advertisements is this stated. Do not buy if you are expecting a perfectly flat board. Wont happen!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Your wife will love  it!!!",
      "text": "Wife loves it!!! she has thrown out her old one that she always complained about having to take out set up and then put away.. now she just opens a drawer flips it open and is able to close it just as quick. Out of site out of mind... Install took about 45 min.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "My in drawer ironing board is perfect in every way",
      "text": "My in drawer ironing board is perfect in every way. If you, like me, hate to get out the ironing board every time you want to iron anything, and you have a pullout drawer you can sacrifice in laundry or closet, I recommend it highly. My contractor found it simple to install and it fits perfectly. No problems thus far.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith ",
      "helpful_votes": 2,
      "publication_date": 20160905
    },
    {
      "title": "Great idea, but poor design.",
      "text": "Installed this in a rental property of mine, Fairly easy to install but the latching mechanism really sucks. Couldn't put any pressure on the ironing board without the latch coming loose and the board starting to fold. Had to remove the built on latch and installed one much more sturdy. Works great now, but customers shouldn't have to redesign their product. Wouldn't purchase this again.",
      "rating": 3.0,
      "verified": true,
      "author": "G. H.",
      "helpful_votes": 14,
      "publication_date": 20150626
    },
    {
      "title": "Absolutely horrible. A nightmare to install and now both drawer ...",
      "text": "Absolutely horrible. A nightmare to install and now both drawer runners are stuck. The only way to remove was to hammer them out and unbolt from cabinet. This is the worst Rev A Shelf product I've purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Blanche Welborn",
      "helpful_votes": 4,
      "publication_date": 20170911
    },
    {
      "title": "Buyer beware",
      "text": "Save yourself time and money . I had this installed by a professional contractor not once but twice and both malfunctioned. It was impossible to open and close the drawer. Customer service was rude. Very poor quality",
      "rating": 1.0,
      "verified": true,
      "author": "denise",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "great product if installed properly",
      "text": "I installed this product into a prefabricated cabinet I purchased from a home improvement store. It's a great product and my wife and I love it. However, installation could be a challenge if you have to add internal wooden support for the metal brackets. Overall the product is very sturdy and a great addition to our laundry room.",
      "rating": 4.0,
      "verified": true,
      "author": "Ecerda",
      "helpful_votes": 20,
      "publication_date": 20111205
    },
    {
      "title": "Item was as described but some screws had come loose ...",
      "text": "Item was as described but some screws had come loose prior to receipt. We hope nothing was lost but will find out more when installed.",
      "rating": 4.0,
      "verified": true,
      "author": "Phil B",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Maybe it's me or maybe it's just hard to install.",
      "text": "I'm only giving this three stars because of the difficulty in installing it. I'm very happy with the final product.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161030
    },
    {
      "title": "Quality Product",
      "text": "Quality product. Not a hard installation, as directions are clear.",
      "rating": 5.0,
      "verified": true,
      "author": "Art Mulvey",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "I WOULD HATE TO LIVE WITHOUT IT",
      "text": "THIS IS MY SECOND ONE. I WOULD HATE TO LIVE WITHOUT IT.",
      "rating": 5.0,
      "verified": true,
      "author": "Luke",
      "helpful_votes": 0,
      "publication_date": 20150801
    },
    {
      "title": "Space saver",
      "text": "Little hard to install but it works great No more cluster with ironing board set up in room recommend to everyone",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Seiter",
      "helpful_votes": 4,
      "publication_date": 20140505
    },
    {
      "title": "rev-a-shelf fold out ironing board",
      "text": "Quality product. Was just what I was looking for to install in a new laundry room addition. Arrived on time in the condition promised.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Wilson",
      "helpful_votes": 11,
      "publication_date": 20110927
    },
    {
      "title": "Great \"touch up\" board in a laundry room, but probably not the perfect \"main\" big ironing board.",
      "text": "If you buy this knowing it's limitations, it's a 4 star product...but if you buy it thinking it's a perfect full size heavy duty ironing board for everything you'll be disappointed. As other reviewers have noted, the \"mechanism\" can be a bit finicky (and it's not the smoothest functioning thing in the world, even installed properly). It's a great sized \"touch up\" ironing board, but also has limitations (like not slipping jeans over it, the folding mechanism can be insecure). Overall I still rate it 4 stars. We have it installed in a laundry room cabinet. Install wasn't super easy, but still worked out fine. Overall I feel it is worth the money and I would purchase again.",
      "rating": 4.0,
      "verified": true,
      "author": "FlyboyyyTop Contributor: Running",
      "helpful_votes": 4,
      "publication_date": 20170628
    },
    {
      "title": "Love this.",
      "text": "Love this ... I only iron occasionally so it's great to have the board hidden away until I need it. Sturdy and well made. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "August Reader",
      "helpful_votes": 4,
      "publication_date": 20160220
    },
    {
      "title": "Great product.",
      "text": "It was pretty easy to install, and overall we love the new board.",
      "rating": 4.0,
      "verified": true,
      "author": "Chowder",
      "helpful_votes": 0,
      "publication_date": 20170805
    },
    {
      "title": "it'll work",
      "text": "Somewhat flimsy, but its okay if you are only ironing infrequently. If you're ironing every day or 2-3 times a week... probably will become frustrating.",
      "rating": 3.0,
      "verified": true,
      "author": "SH",
      "helpful_votes": 3,
      "publication_date": 20140731
    },
    {
      "title": "Great Choice for limited space",
      "text": "We were tired of having the large ironing board take up a corner of our bedroom. This little hide-a-way board works out great. Somewhat tricky to get installed but I find that is the case anytime that you are working in a cabinet. The instructions could be a bit more explanatory but after reading over a couple of times you get the point.",
      "rating": 5.0,
      "verified": true,
      "author": "NorthernBear",
      "helpful_votes": 14,
      "publication_date": 20130324
    },
    {
      "title": "Buyer be cautious",
      "text": "I bought this ironing board. Unfortunately, did not work, as described, and because my cabinetry was delayed, did not discover until after the 30-day return date. Seller was not helpful. So, now I’m stuck with this ironing board. I guess I will have to live with my mistake.",
      "rating": 2.0,
      "verified": true,
      "author": "thebuyer",
      "helpful_votes": 0,
      "publication_date": 20201216
    },
    {
      "title": "Not for serious ironing",
      "text": "I did not like this at all. If you see in the picture, the drawer front of drawer that it is installed in does not fold down, as some of the others do. Do you know what that means? It means that you CANNOT open up the waist of a pair of pants (or shorts) and pull them onto the board to iron. Same with skirts, etc. It was impossible to iron around the pockets, etc. Very, very frustrating. If you were just ironing flat work, you would be fine with this.",
      "rating": 1.0,
      "verified": false,
      "author": "Patay",
      "helpful_votes": 46,
      "publication_date": 20140825
    }
  ],
  "product_meta": {
    "title": "Rev-A-Shelf VIB-20CR Bathroom or Closet Vanity Drawer Cabinet Adjustable Pullout Ironing Board, Gray",
    "description": "Rev-A-Shelf has ironed out the inconvenience of storing and setting up that bulky ironing board with the introduction of its VIB Series. The uniquely designed expandable frame mounts easily in a vanity drawer between cabinet sides from 14-1/4 inches to 21 inches wide and the fixed brackets allow for easy mounting of all standard drawer fronts. It features a chrome finish and unique ball-bearing slide system that provides sufficient over travel for maximum utilization. Simply open until the gravity lock engages, unfold board and you are ready to iron. Double-check your cabinet's opening (inside dimensions) to allow the best fit. Measure side to side (width), front to back (depth or length), and top to bottom (height). Double-check to make sure your product is within measurements and don't forget to take into account any obstructions (plumbing, hinges, etc.).",
    "rating": 4,
    "feature_bullets": [
      "MAXIMIZE YOUR SPACE: Maximize your space with this pullout ironing board that features an adjustable width from 14.25 to 21 inches wide. Overall Dimensions (D x W x H): 19.86 x 21 x 4 inches",
      "FOLD AWAY DESIGN: Ironing surface measures 11.8 inches wide by 37.7 inches long and folds away for compact, easy storage",
      "DURABLE CONSTRUCTION: Metal construction with ball-bearing slides extends fully supports up to 150 pounds",
      "EASY INSTALLATION: The uniquely designed expandable frame mounts easily in a vanity drawer between cabinet sides from 14-1/4\" to 21\" wide and the fixed brackets allow for easy mounting of all standard drawer fronts",
      "INCLUDES: 1 fold-out ironing board, cover, and mounting hardware"
    ],
    "specifications": {
      "Item Weight": "16.91 pounds",
      "Manufacturer": "Rev-A-Shelf",
      "ASIN": "B0016J9XTI",
      "Item model number": "VIB-20CR",
      "Customer Reviews": "4.0 out of 5 stars45 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#510,478 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Finish Types": "Silver Metallic",
      "Is Assembly Required?": "Yes",
      "Warranty Description": "Limited lifetime.",
      "Batteries Required": "No",
      "Included Components": ""
    },
    "categories": [
      "Home & Kitchen",
      "Irons & Steamers",
      "Ironing Boards"
    ],
    "price": ""
  }
}