{
  "website_summaries": [
    {
      "verdict": "A great looking and rugged boot, although your first step should be to outfit it with a good insole.",
      "pros": [
        "Made of leather and cordura",
        "100% waterproof",
        "GORE-TEX liner is engineered to keep your feet dry and comfortable",
        "Good support",
        "Comfortable and durable",
        "Looks great"
      ],
      "cons": [
        "A little on the pricey and heavy, side",
        "Has minimal arch support, and takes a bit to break in"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "they are a little snug but wearable. I would ...",
      "text": "they are a little snug but wearable. I would have ordered up 1/2 size if I had known but I am hoping they stretch some and plan on keeping them. I have been wearing them for a while now and I am happy to say they do stretch some and are comfortable fpr long days on my feet. I love how they help my back and legs with the support.",
      "rating": 5.0,
      "verified": true,
      "author": "Leigh",
      "helpful_votes": 2,
      "publication_date": 20160724
    },
    {
      "title": "Best pair of work/EMS boots I've ever had",
      "text": "Best pair of work/EMS boots I've ever had; this is the second pair of Acadia's I've purchased in my career. The first pair lasted ~10 years with only 1 resole (from a local shop)... Love 'em! :)",
      "rating": 5.0,
      "verified": true,
      "author": "J-Archi",
      "helpful_votes": 3,
      "publication_date": 20170312
    },
    {
      "title": "Would buy again",
      "text": "I've had these boots for about 2 months now and am extremely happy with them. First day out of the box I wore them on a 4 hour training session which involved both hiking in flat but rough terrain (gullies, climbing over downed trees, holes, woods, streams..) and a lot of stationary standing for briefings. These boots were comfortable in both scenarios. I had brought a pair of old boots with me in case I got some rubs or soreness from wearing brand new boots, but I did not need them. These have continued to perform well in similar circumstances. I would definitely recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "DawnC",
      "helpful_votes": 7,
      "publication_date": 20131002
    },
    {
      "title": "My wifes farm boots",
      "text": "I have personally owned 10 pair of Danner Men's Acadia's and have been wearing them almost every day for 25 years they are by far the lightest most comfortable, most durable water proof boots EVER! I have preached this to my wife for 6 years now and she finely caved in and and asked for a pair for her birthday. She LOVES them just as I thought. They are a little pricey but well worth every penny! Just a little info the vibram sole bottom layer is what gets replaced when you have to get these resoled for me on lots of concrete and dirt about every 18 Months cost about $60. Hope this was helpful. Thanks, Genoa, Illinois Farmer",
      "rating": 5.0,
      "verified": true,
      "author": "1trophybuck",
      "helpful_votes": 11,
      "publication_date": 20120917
    },
    {
      "title": "It's very comfortable then under armor",
      "text": "The boot is half a size bigger then the regular size boot. I believe it's the style of the boot becuz I wear a 7 in the under armor boot. It's very comfortable then under armor!",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "I Love Danner Boots",
      "text": "I've had Danner boots in the past for wild land firefighting. I purchased the Acadia as my duty boot as a sheriff's deputy. I was a bit surprised when they arrived as they looked huge, but they fit perfect once I put them on. While they feel a bit heavy compared to some other brands, they are very well built, rugged, and look great under uniform. Comfortable for extended periods of time. Water proof, and hopefully they will be warm through the winter.",
      "rating": 5.0,
      "verified": true,
      "author": "ShaylaTucker",
      "helpful_votes": 0,
      "publication_date": 20141026
    },
    {
      "title": "Solid American made boots!",
      "text": "These boots are great. takes some time to break in, but after its been broken in it will feel like an extension of your foot. Uber comfortable and will last you a lifetime, just get them resoled or refinished if it gets worn out.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 2,
      "publication_date": 20141115
    },
    {
      "title": "5 STARS!",
      "text": "Good boot. They look really nice after you shine them up. Good ankle support. They are a little heavy, and it takes some time to mold them to your feet, but other than that- this is an awesome pair of boots!",
      "rating": 5.0,
      "verified": true,
      "author": "Roxana",
      "helpful_votes": 0,
      "publication_date": 20160426
    },
    {
      "title": "Great boots",
      "text": "The boots run a full size lower than regular boots, So I usually wear a 6 and got these in a 5. Otherwise, they are very well made, sturdy, provide great support, are comfortable, and should last me the next 10 yrs of my career.",
      "rating": 5.0,
      "verified": true,
      "author": "Wende",
      "helpful_votes": 0,
      "publication_date": 20140625
    },
    {
      "title": "Five Stars",
      "text": "Love these Danner boots - have worn them for years and can't see myself wearing anything else before retirement.",
      "rating": 5.0,
      "verified": true,
      "author": "iimpressyou",
      "helpful_votes": 0,
      "publication_date": 20170702
    },
    {
      "title": "Perfect",
      "text": "I love them and would recommend them to everyone. I am on my feet all day and these are the only boots, that I have had, that feel wonderful on my feet!",
      "rating": 5.0,
      "verified": true,
      "author": "Paula Pischl",
      "helpful_votes": 0,
      "publication_date": 20150319
    },
    {
      "title": "Great boot",
      "text": "They keep my feet warm and they are sized correctly. They look good. My only complaint is that they are very stiff and it is taking a while to break them in. The other reviews said once they are broken in they feel great. I am just not there yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Cassie S",
      "helpful_votes": 0,
      "publication_date": 20160215
    },
    {
      "title": "Have to wear pretty heavy sock for them to fit snug - once ...",
      "text": "Have to wear pretty heavy sock for them to fit snug - once they break in shouldn't be a problem. Comfortable right out of the box, We'll see after a 12 hour shift standing in them. V-",
      "rating": 3.0,
      "verified": true,
      "author": "Virginia ",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "Love these boots",
      "text": "Love these boots. I put insoles in since I wear them daily. Took about a week to wear in. But they are comfortable and look great.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie L Vanoni",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Awesome Boots!",
      "text": "These are wonderful boots! They only took a few weeks to break in and now they are my favorite duty boots. Worth the money if you work 10 to 12 hour shifts. Excellent buy!",
      "rating": 5.0,
      "verified": true,
      "author": "B B",
      "helpful_votes": 2,
      "publication_date": 20130817
    },
    {
      "title": "Super comfortable and durable",
      "text": "This is my second pair- but only because I have work boots and dress boots. Super comfortable and durable, and I've tried everything.",
      "rating": 5.0,
      "verified": true,
      "author": "CautionaryTale",
      "helpful_votes": 0,
      "publication_date": 20150906
    },
    {
      "title": "Decent Boot",
      "text": "Danner Acadia women's boots are somewhat comfortable- they slack foot arch support. Other than this, they hold a good shine and look sharp.",
      "rating": 4.0,
      "verified": true,
      "author": "JDHZ",
      "helpful_votes": 0,
      "publication_date": 20150429
    },
    {
      "title": "Love danners, fit well right out of the box",
      "text": "Love danners, fit well right out of the box. I do need the heel inserts, to bring up my heel a bit",
      "rating": 5.0,
      "verified": true,
      "author": "Shanon Kimball",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "high quality boots!",
      "text": "Taking a little getting used to but I LOVE them!!",
      "rating": 4.0,
      "verified": true,
      "author": "Abby ML",
      "helpful_votes": 0,
      "publication_date": 20150205
    },
    {
      "title": "Nice looking",
      "text": "Boots are ice looking but definitely not to be in an 8 or plus shift. Pinch at the the ankles. Somewhat hard. Returned item.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151231
    },
    {
      "title": "but so far so good. I have really high arches and had to ...",
      "text": "I've only worn them for a few days, but so far so good. I have really high arches and had to use the arch support provided along with my own arch supports.",
      "rating": 4.0,
      "verified": true,
      "author": "Melisa Renae Potts",
      "helpful_votes": 0,
      "publication_date": 20150324
    },
    {
      "title": "Danner boots are the best. Working 12 to14 hour 6days a week I ...",
      "text": "Being a police officer I have to have top quality.equipment. Danner boots are the best. Working 12 to14 hour 6days a week I need a comfortable boot.My last pair of boots have lasted eight years. They still look good,the soles have worn out and I refuse to be without my Danners until they are repaired. Thank you for the workmanship and quaility of your boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie D. Yarnell",
      "helpful_votes": 2,
      "publication_date": 20140922
    },
    {
      "title": "Fitting",
      "text": "We ordered the size that my daughter would normally wear and we had to return them. I would suggest ordering a size bigger, or even a half size bigger.",
      "rating": 3.0,
      "verified": true,
      "author": "John Field",
      "helpful_votes": 2,
      "publication_date": 20140107
    },
    {
      "title": "All day comfort!",
      "text": "Thanks Danner, you get what you pay for! I work on my feet 15 hours a day and these rugged boots fit perfect, feet stay cool, totally dry and feel like I am walking on clouds.... even with that hard plastic insert! I thought it would be something I would not use as it would make my feet hurt, but it works great. Well built pair of boots. Glad to know there are still great companies like this one out there who know exactly what they are doing.",
      "rating": 5.0,
      "verified": false,
      "author": "Jason Fowler",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "clown shoes?",
      "text": "Runs large, I got these as a gift, got size 5.5 and it looks like a size 7.5 .. I would return it and buy a smaller size, but for some reason the size 5 costs like $50 more for the same shoe... I even compared these to my size 5.5 Timbs (it says 3.5, but the measurements for womens size 5.5 and juniors size 3.5 is the exact same/ I got juniors 3.5 because it costs less than womens 5.5 and it's the exact same size and style shoe) I get that the Danner boots are supposed to be a bit chunkier looking, but damn lol.... I was really looking forward to having some sturdy boots. Shame :'P",
      "rating": 1.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20151202
    },
    {
      "title": "Very Durable.  Very uncomfortable.",
      "text": "PROS: The most durable boots I own, and I mean durable. These will last forever. Not just waterproof, but very waterproof. You know when you wear these, nothing will get through. CONS: They are very expensive. They are very heavy. They are uncomfortable. They take forever to breakin These are not tactical or quiet.",
      "rating": 3.0,
      "verified": false,
      "author": "Radio Raheem",
      "helpful_votes": 6,
      "publication_date": 20100112
    },
    {
      "title": "Three Stars",
      "text": "The leather is extremely stiff & painful to break in.",
      "rating": 3.0,
      "verified": false,
      "author": "randie",
      "helpful_votes": 0,
      "publication_date": 20141027
    }
  ],
  "product_meta": {
    "title": "Danner Women's Acadia W Uniform Boot",
    "description": "At Danner, they are craftsmen. They pay attention to details. They forgo quantity for quality, with the knowledge that the boots they craft are no better than the hands that create them.",
    "rating": 4.3,
    "feature_bullets": [
      "100% Leather and cordura",
      "Vibram sole",
      "Shaft measures approximately 8\" from arch",
      "Heel measures approximately 1 1/4\"",
      "Platform measures approximately 3/4\"",
      "Boot opening measures approximately 10\" around",
      "Danner's famous stitch down construction",
      "8\" of support and durability",
      "Stable underfoot platform",
      "Recraftable",
      "Plain toe"
    ],
    "categories": [
      "Boots",
      "Women",
      "Shoes",
      "Clothing, Shoes & Jewelry",
      "Mid-Calf"
    ],
    "price": 349.95,
    "specifications": {}
  }
}