{
  "website_summaries": [
    {
      "verdict": "Taller and narrower than other options, this pressure cooker offers a strong build and quick cooking times.",
      "pros": [
        "Comes in several sizes, up to 8 quarts",
        "Has two cooking pressure settings: 8 psi and 15 psi",
        "Constructed of 18/10 stainless steel",
        "Sturdy and durable",
        "Dishwasher safe",
        "Pot is tall and narrow",
        "Cooks fast"
      ],
      "cons": [
        "Reports of this option arriving with a broken handle",
        "Some buyers say that this cooker fails within a few months (leaks and stops building up pressure)"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Worked ok for few months but often would not get ...",
      "text": "Worked ok for few months but often would not get up to pressure. So I had to turn down heat, open lid and reset on pot holding it down very tightly with all my weight and turning handle to lock. That worked for a few months. Now I cannot get it up to pressure at all. It just keeps spewing Steam and never locks in. I am going to try to get a replacement or my money refunded through the Fagor company. Will keep you posted.",
      "rating": 1.0,
      "verified": true,
      "author": "JR in Sonoma",
      "helpful_votes": 3,
      "publication_date": 20180821
    },
    {
      "title": "quality pressure cooker",
      "text": "Read my review for the 3.3 quart pressure cooker. Stovetop pressure cookers are the way to go. I bought both sizes and find them useful for my style of cooking. The 3.3 quart is useful for everyday supper cooking. I used the 8 quart this morning to cook up a pile of marrow bones to make rich broth for my famous borscht. Magefesa makes a quality cooker. It is not necessary to pay more. These cookers have two pressure levels, which means these cookers cook really fast, unlike the electric pressure cookers. The lower level isn't as low as the old pressure cookers used to go, but is still good. Stainless makes cleanup fast and easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Phoebe",
      "helpful_votes": 0,
      "publication_date": 20131117
    },
    {
      "title": "cooks like my other one just a little taller",
      "text": "replacing the 2003 version I used. They don't make the pan handle I have, they upgraded the pan handle later on with a screw to hold it on the pan mine is pressed on I don't have the tools to modify it and they charge to much to do the work for there. This one has 2 settings for pressure cooking once you get use to what foods and settings to use it with just keep the manual close by. cooks like my other one just a little taller.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike D",
      "helpful_votes": 3,
      "publication_date": 20150916
    },
    {
      "title": "A Great Pressure Cooker",
      "text": "Quality built, easy and safe to use. We had one for 15 years and abused it by continuously washing it in salt water on the boat we lived on. We finally bought this new one to replace it and found that it was just as high in quality as the first one and had some nice improvements as well. Unbelievable value for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "DaveOMT",
      "helpful_votes": 0,
      "publication_date": 20161025
    },
    {
      "title": "Seems well made",
      "text": "I like that it has 2 settings. Seems well made and works with induction burner. A welcome addition to my RV kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "beechridge",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Pretty good device",
      "text": "This item replaced a pressure cooker I'd had for many years which had broken handles. It has been a challenge to get used to this new style, but I use the manual and get excellent results. My main problem is that it's so tall and I'm not! So I must do my checking on tiptoe and am extra careful about escaping steam.",
      "rating": 4.0,
      "verified": true,
      "author": "LitLady",
      "helpful_votes": 0,
      "publication_date": 20140425
    },
    {
      "title": "The meat really is good!",
      "text": "Ok, you know that soft tasty meat you always wondered how to cook? well, this is the first time my meat didn't come out tough. It is easy to use and a beautiful looking pot. I had one before with the little thingy that bobbled in the steam hole. This is better than that in so many ways. I need to experiement more with it, but meat is good!",
      "rating": 5.0,
      "verified": true,
      "author": "anon",
      "helpful_votes": 0,
      "publication_date": 20140818
    },
    {
      "title": "Superior pressure cooker",
      "text": "The best! Light weight, great size as it is not too heavy, improved design from the last same model (my last one quit after 3 years, but it was worth it) Buy one ASAP especially if you are a vegetarian and eat lots of beans!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20170611
    },
    {
      "title": "Very good and quality pressure cooker",
      "text": "Very good and quality pressure cooker. I was searching for a non China made one for a long time. This one is made in Spain. Very, very situated.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 3,
      "publication_date": 20151220
    },
    {
      "title": "This is a bad purchase if you want reliable pressure cooker.",
      "text": "This is a very bad quality. Looks good but things burnt every time. The base is not good. too.",
      "rating": 1.0,
      "verified": true,
      "author": "Muzaffar A. Chaudhry",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Five Stars",
      "text": "I LOVE this pressure cooker. Beautiful in its simplicity, excellent results, vast improvement over my prior pressure cooker.",
      "rating": 5.0,
      "verified": true,
      "author": "RNsolutions",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Great Pressure Cooker.",
      "text": "I have the larger Magefesa pressure cooker that I've been using for some 20 years, and wanted another, smaller one. Love it as much as my older model. Priced very competitively and has all the safety features. This will be something I can pass down to the kids.",
      "rating": 4.0,
      "verified": true,
      "author": "Heather Kellstrom",
      "helpful_votes": 2,
      "publication_date": 20150929
    },
    {
      "title": "Chefs choice",
      "text": "I use it in my restaurant every day sometimes 2 or 3 times. Love that is easy to used for cooking or canning, durable and perfect size. Recommend I got 3 of them♥️",
      "rating": 5.0,
      "verified": true,
      "author": "Giusseph arrazcaeta",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Small enough for two",
      "text": "While the pressure cooker is small it is enough for 2 meals. Cleaning it is easy. The instructions were really long and put me off from using the pressure cooker for a while. Now that I am using it I am glad I purchased it.",
      "rating": 4.0,
      "verified": true,
      "author": "DLo",
      "helpful_votes": 2,
      "publication_date": 20140527
    },
    {
      "title": "great cooker",
      "text": "I love this. Works just as expected. Use it to make a version of espresso on the stove. The pressure button that pops up tells me just when the pressure is reached and when I can open the lid.",
      "rating": 4.0,
      "verified": true,
      "author": "GMT",
      "helpful_votes": 2,
      "publication_date": 20140427
    },
    {
      "title": "better than jiggle top",
      "text": "This style of pressure cooker is much better than jiggle top models. If you are considering your first pressure cooker it is worth the money to buy one of this type and Magefesa are some of the most reasonably priced. Your first should really be a 6-8 quart, though. Lorna Sass's cook books are the best for PC-ing. Happy cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "Mj Bute",
      "helpful_votes": 5,
      "publication_date": 20101129
    },
    {
      "title": "It was great and delicious in a great deal of shorter time",
      "text": "Received it last week and since then I used it twice, making Stew and pulled pork, using recipes from the Internet. It was great and delicious in a great deal of shorter time. It is an excellent cooking gadget for people who does not have alot of time but wants to cook good meal in a shorter time. So far very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "ReDe",
      "helpful_votes": 0,
      "publication_date": 20140922
    },
    {
      "title": "The old one had better pressures and reduced cooking time",
      "text": "This was to replace my old Fagor... The old one had better pressures and reduced cooking time... Wish I could switch it....",
      "rating": 3.0,
      "verified": true,
      "author": "BlueAxis",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Works good",
      "text": "Works good. Cleans like a dream. Shine just like new after using, good size. Still can't figure out why I have to write more, when I said all I needed to in the first few words",
      "rating": 5.0,
      "verified": true,
      "author": "GG",
      "helpful_votes": 0,
      "publication_date": 20140106
    },
    {
      "title": "Really a terrific value",
      "text": "We destroyed the last one of these (purchased at COSTCO several years back) by accidentally placing the plastic handle on a hot stove burner. This is clearly NOT the fault of the manufacturer as the cooker had been working perfectly and is used 3 or 4 times weekly to make beans or chicken soup. We replaced it with another brand thinking that we would like it even better-- but we were disappointed. The Magafesa is far superior to the other cooker (which was twice the price.) We returned the other cooker and purchased another Magefesa and we are still delighted with it. Highly recommend trying pressure cooking AND this brand of cooker.",
      "rating": 5.0,
      "verified": true,
      "author": "LKF",
      "helpful_votes": 2,
      "publication_date": 20160102
    },
    {
      "title": "Great product, wonderful quality",
      "text": "Working great. So much more sturdy than previous pressure cookers we've owned! The base is thick and it doesn't seem like it is going to get warped. I'd recommend reading the instructions if you haven't used one of these with a multi setting valve before. We cooked beans with the lid open the first time around...",
      "rating": 5.0,
      "verified": true,
      "author": "ALMUDENA M.",
      "helpful_votes": 2,
      "publication_date": 20150826
    },
    {
      "title": "Great fast cooking pressure pot!",
      "text": "Easy setup and good security features, its scary at first because it feels like its gonna blow up but just make sure no water is escaping the pot and thats how you know its sealed correctly",
      "rating": 5.0,
      "verified": true,
      "author": "Miguel ",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "This will last a lifetime",
      "text": "Learning how to cook with a pressure cooker. Great product. Glad I got the large one as you can only fill 2/3 of the way. Bought Miss Vickie's P.C. cookbook and have had great success with the pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Cenacooks",
      "helpful_votes": 3,
      "publication_date": 20120825
    },
    {
      "title": "Magefesa pressure cooker",
      "text": "Very simple and safe to operate. the instruction manual is worthless so download the English version from the website or the internet. Get Miss Vickie's book and the first part will explain all you have to know to run it safely. I cooked a seven pound chicken in thirty minutes. It is very fast.",
      "rating": 5.0,
      "verified": true,
      "author": "C. P.",
      "helpful_votes": 0,
      "publication_date": 20110910
    },
    {
      "title": "... hard to close since I have arthritis but I love this cooker",
      "text": "The top is hard to close since I have arthritis but I love this cooker.",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy P.",
      "helpful_votes": 0,
      "publication_date": 20160106
    },
    {
      "title": "my favorite cookware. Saves alot of money on my gas ...",
      "text": "my favorite cookware. Saves alot of money on my gas bill since i dont need to cook that long with my stews.",
      "rating": 5.0,
      "verified": true,
      "author": "Seppie",
      "helpful_votes": 0,
      "publication_date": 20160228
    },
    {
      "title": "This Magefesa has the perfect size, two pressurization levels and it is easy ...",
      "text": "This Magefesa has the perfect size, two pressurization levels and it is easy to release the pressure. The automatic closing once the lid is aligned is a nice touch. Cooking times seem very accurate.",
      "rating": 5.0,
      "verified": true,
      "author": "Pedro Perez-llorente",
      "helpful_votes": 0,
      "publication_date": 20150613
    },
    {
      "title": "Perfect for veggies that take a while to cook",
      "text": "Perfect for veggies that take a while to cook, and when you don't want to make a huge mess in the kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne Strelko",
      "helpful_votes": 0,
      "publication_date": 20141130
    },
    {
      "title": "Great Value",
      "text": "After buying and returning a cheap aluminium pressure cooker, I am extremely pleased with the quality and ease of operation of this pot.",
      "rating": 5.0,
      "verified": true,
      "author": "William M. Cole",
      "helpful_votes": 0,
      "publication_date": 20140123
    },
    {
      "title": "Good cooker",
      "text": "We have got this pressure cooker about a month ago and it is really a good cooker. I think it can go to higher pressures than the cooker we had before and it cooks really fast. In 10 or 15 minutes you can have beans or cheakpeas well cooked and soft. And it preserve well all the taste. Easy to open and close, with a safety valve to prevent you open it before the pressure drops, and easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "MARTIN GAINZA ORDOQUI",
      "helpful_votes": 0,
      "publication_date": 20140114
    },
    {
      "title": "A servicable pressure cooker that is easy to use for stock making and steaming rice.",
      "text": "The positives - it came with a manual and recipes in clearly written English. It has a silicone seal. It seems to be made solidly. When the pressure is reached the steam blows out of it. It really is easy to use. The negatives- this pot has the same diameter that my 6 qt pressure cooker has, making it very deep and somewhat narrow. It would be a hard pot to brown meat before cooking. It comes with no steamer rack, and food tends to stick to the bottom.",
      "rating": 2.0,
      "verified": true,
      "author": "truth serum",
      "helpful_votes": 3,
      "publication_date": 20150418
    },
    {
      "title": "Good value.",
      "text": "It cooks almost as well as the really pricey ones. Easy to clean, fool-proof. Much better than the old-fashioned lids with the weight. The instruction book is in Spanish ... but I have friends. I am satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "Scout",
      "helpful_votes": 3,
      "publication_date": 20120629
    },
    {
      "title": "This is Great",
      "text": "This is one one the best things I have ever bought. It does just what it's suppose to do. It is worth all the money they ask for. It was Not cheap, yet let's face it you do get what you pay for. I'm a pretty good cook. This has helped me make some very nice dishes at home. I would Highly recommend this product to all who think that pressure cooking is a waste of time.",
      "rating": 5.0,
      "verified": true,
      "author": "michael reid",
      "helpful_votes": 0,
      "publication_date": 20140111
    },
    {
      "title": "I would marry it if I could",
      "text": "We went vegetarian nearly a year ago and I concluded that I really needed to stop using canned beans. The best way to do this was to get a pressure cooker. So, I looked around and this one was recommended by Vegan Coach. I agree with other reviewers, who declared the manual fairly useless and to also buy a Lorna Sass cookbook. My manual was completely in Spanish! I downloaded the English version but it was still fairly vague, so I was happy to have the cookbook as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Christine Prado",
      "helpful_votes": 6,
      "publication_date": 20120323
    },
    {
      "title": "Good product and recommend seller",
      "text": "Good product and recommend seller. Really satisfied with the purchase as fulfilled the expectations, good pot as is as shown in the publication",
      "rating": 5.0,
      "verified": true,
      "author": "Idais Villarroel",
      "helpful_votes": 0,
      "publication_date": 20141204
    },
    {
      "title": "Pressure Cooker",
      "text": "This is a great cooker. Have one myself and sent this one for a gift. Thanks, Amazon. I love ordering everything I can through you.",
      "rating": 5.0,
      "verified": true,
      "author": "Janice Kay Farley",
      "helpful_votes": 0,
      "publication_date": 20111028
    },
    {
      "title": "great product.",
      "text": "As much a review of Amazon as the pressure cooker. First one came damaged as can happen. The exchange was fast and efficient. As for the product, great quality with great results.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Johnston",
      "helpful_votes": 0,
      "publication_date": 20140726
    },
    {
      "title": "Really good.",
      "text": "Really great product. I'm a Jamaican and I use it to pressure my oxtail as well as my red peas. Can't wait to try other recipes.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150405
    },
    {
      "title": "and we are so pleased! The Magefesa practika plus stainless Steel pression cooker ...",
      "text": "we could prepare a lot of black beans in it, and we are so pleased! The Magefesa practika plus stainless Steel pression cooker is fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Andres Guigñan",
      "helpful_votes": 0,
      "publication_date": 20141211
    },
    {
      "title": "Bam",
      "text": "Can beat it. One of the greatest pieces for my kitchen. I love the fact it is real fast. yummy",
      "rating": 4.0,
      "verified": true,
      "author": "Enforcer Torres",
      "helpful_votes": 0,
      "publication_date": 20140321
    },
    {
      "title": "Magefesa Practika Plus SS Pressure Cooker Trio-Can't take the heat!",
      "text": "I really wanted to like this product and I would if the handles could be used on a higher btu range like a Viking. When I tried using it I smelled a bad burning smell like plastic. Even when the flame was adjusted to low. I also heard popping noises. Upon inspection I found that the lower side of the handle was melting and pieces actually popped off of it. I tried to write Magefesa about this and they never replied. I have no choice but to return it as a malfunctioning product. There is nothing in it's description that limits it to a specific type of range. Bummer....",
      "rating": 2.0,
      "verified": true,
      "author": "Jopalis",
      "helpful_votes": 4,
      "publication_date": 20110413
    },
    {
      "title": "good purchase.",
      "text": "I am happy with my purchase. It is working fine without any problem. you can cook beef completely in about 30 minutes completely. I like it.",
      "rating": 4.0,
      "verified": true,
      "author": "jack",
      "helpful_votes": 0,
      "publication_date": 20120115
    },
    {
      "title": "So many safety mechanisiums it does not seem to work",
      "text": "see the lid on the left side, that is a hole and inside is the rubber grommet, it seems to leak from that safety feature all the time, so I don't even think I am getting a seal. Wish I got something with a plain weight on top.",
      "rating": 2.0,
      "verified": true,
      "author": "Leland T. Snyder",
      "helpful_votes": 3,
      "publication_date": 20130216
    },
    {
      "title": "Nice pot",
      "text": "We have owned several pressure cookers and this one is the nicest. Very quiet, easy to operate, and the bottom is constructed to provide even heat",
      "rating": 5.0,
      "verified": true,
      "author": "chef wannabe",
      "helpful_votes": 0,
      "publication_date": 20121227
    },
    {
      "title": "What a nice product.",
      "text": "I got this product few months ago and it has been working very well for me and I will recomend it to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Bridget I. Okoye",
      "helpful_votes": 0,
      "publication_date": 20130318
    },
    {
      "title": "magefesa gasket leak",
      "text": "You can solve the problem of sudden loss of pressure by simply put a light film of olive or vegetable oil on the gasket.",
      "rating": 5.0,
      "verified": true,
      "author": "S. BROCKMYER",
      "helpful_votes": 0,
      "publication_date": 20130829
    },
    {
      "title": "An excellent value!",
      "text": "A stainless steel cooker for the price of aluminum! The first pressure cooker arrived with a broken handle lock tab. To amazon's credit, they shipped a new one right away which works perfectly. It is easy to clean and after months of nearly daily use, is holding up great! If it weren't for the first one that came broken, I would give this item 5 stars. Save some money and buy this pressure cooker!",
      "rating": 4.0,
      "verified": true,
      "author": "OEM",
      "helpful_votes": 8,
      "publication_date": 20120302
    },
    {
      "title": "Five Stars",
      "text": "Bought this for daughter-in-law.....I'm sure it would work perfectly IF SHE WOULD JUST LEARN HOW TO USE IT!!!",
      "rating": 5.0,
      "verified": true,
      "author": "hightech",
      "helpful_votes": 0,
      "publication_date": 20150325
    },
    {
      "title": "great",
      "text": "I use this all of the time for chicken, beans, veggies, flank steak, pork. It is really easy to use! Quality is pretty good, still using it today!",
      "rating": 5.0,
      "verified": true,
      "author": "ABC",
      "helpful_votes": 3,
      "publication_date": 20130904
    },
    {
      "title": "Love it!",
      "text": "It has been many years since I last used a pressure cooker. This one is so quiet you hardly know it is cooking! I have made some really good dishes. I would recommend this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Lora Widman",
      "helpful_votes": 3,
      "publication_date": 20121027
    },
    {
      "title": "Five Stars",
      "text": "Perfect. Can cook stews and baby food with out stress.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel Moreno",
      "helpful_votes": 0,
      "publication_date": 20150102
    },
    {
      "title": "I love the stainless steel and how it safely locks and ...",
      "text": "I love the stainless steel and how it safely locks and seals. My first purchase was an electric pressure cooker that broke within 4 months.",
      "rating": 5.0,
      "verified": true,
      "author": "kshort",
      "helpful_votes": 0,
      "publication_date": 20150310
    },
    {
      "title": "Lo siento no hablo español",
      "text": "This seems to be well constructed and I look forward to using the product, however the only documentation shipped with it is entirely and only in Spanish. Normally with cookware this wouldn't be an issue, but it does seem there are unique safety concerns to address in the world of pressure cooking. If only I had take Spanish rather than French in high school...",
      "rating": 3.0,
      "verified": true,
      "author": "John C. Rowland",
      "helpful_votes": 2,
      "publication_date": 20111228
    },
    {
      "title": "Two Stars",
      "text": "I came with the handle of the broken lid is located right where the safety valve",
      "rating": 2.0,
      "verified": true,
      "author": "Pedro Martinez",
      "helpful_votes": 0,
      "publication_date": 20150419
    },
    {
      "title": "I used 2 times it burns food at the bottom ...",
      "text": "I used 2 times it burns food at the bottom of the path even I setup at lower heat.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "superb",
      "text": "The Magesfesta Practika Plus Stainless Steel Pressure Cooker is the best of all pressure cookers that I've every owned and used.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 3,
      "publication_date": 20101230
    },
    {
      "title": "Don't buy if you don't know Spanish",
      "text": "First one came used. Got a new one quick enough but now the instructions are in Spanish. No english anywhere, hopefully I can find something online.",
      "rating": 2.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "Excelent Super fast pressure cooker",
      "text": "My family enjoy the food that I made in my Magefesa Practika Plus and the flavor of the meats are better and now I have more time to share with my family.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20100215
    },
    {
      "title": "it owful",
      "text": "I purchase Magefesa praktika plus stainless steel 4 and 6 quart pressur cooker,first of all, the door does not match the 6 quart one.and when the pot started to boiling water and steam stared to leak out from the door sides.and the 4 quart one,the door match the pot but it burn the food even when the pot has extra water in it.so i am so unhappy with this purchase.it is a useless product.",
      "rating": 1.0,
      "verified": true,
      "author": "shohreh",
      "helpful_votes": 2,
      "publication_date": 20111027
    },
    {
      "title": "Cant use",
      "text": "Manual is not in English cant find one it should tell you if you cant reed spanish dont buy done",
      "rating": 1.0,
      "verified": true,
      "author": "Paul Kendall",
      "helpful_votes": 2,
      "publication_date": 20130227
    },
    {
      "title": "Best purchase in a long time.  Excellent value for the price.",
      "text": "Love it! SUPERIOR Quality. RECOMMEND NO SALT OR DISSOLVE ALL FORMS OF GRANULATED SALT TO PROTECT FROM PITTING THE BOTTOM. No regrets in buying this however you see it is made in Spain an the instructions are only in Spanish language.l. Recommend to anyone and everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill Myers",
      "helpful_votes": 6,
      "publication_date": 20151206
    },
    {
      "title": "DO NOT BUY THIS !!",
      "text": "Bought in 2013 and it's now June 2015...the device never worked properly..the lid was always fussy....and required a lot of adjusting to get it to close properly ( usually 2-3 times to get it right) and seal to build pressure. Now...the silicone seal has broken...how- I'm not sure...but when I go online to buy the spare part ($14.95) the SHIPPING WILL COST $35 for GROUND DELIVERY !!! That's over 2x what the part costs...so needless to say I'm buying another pressure cooker. My Advice - do not waste your time on this Spanish piece of **** !! Get something that works well and you can get spare parts for without getting ripped off !!!",
      "rating": 2.0,
      "verified": true,
      "author": "Marc",
      "helpful_votes": 4,
      "publication_date": 20150624
    },
    {
      "title": "I recommend the Magefesa Practika Plus",
      "text": "I really love this item and use it almost everything since I took up the cooking hobby. I know a lot of people recommend getting the Instant Pot, but I have no regrets buying a stovetop pressure cooker as there is something about working on the stove rather than setting it and forgetting about it, and I probably would end up completely forgetting about it if it was an Instant Pot. But this Magafesa pressure cooker has been great and easy to use. Only reason I dinged it a star is it's sometimes hard to put the lid on.",
      "rating": 4.0,
      "verified": true,
      "author": "mtux96",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "it performs great and it's faster than any previous cookers I've owned",
      "text": "I was a bit concerned about buying this because there was talk about it not being made in Spain but in China and complaints about the quality. I've looked all over it and the packaging and I can't see where it's made and to be honest I don't really care because the quality is outstanding ... it performs great and it's faster than any previous cookers I've owned. ... I made beef barley soup in 20 minutes today. I'm making pot roast over the weekend ... I'll keep you posted.",
      "rating": 5.0,
      "verified": true,
      "author": "chrixon",
      "helpful_votes": 2,
      "publication_date": 20150213
    },
    {
      "title": "Worth it's Weight in Gold! 5 Star Product",
      "text": "My last Magefesa pressure cooker lasted over twenty years. If I hadn't dropped the lid on floor, it probably would have lasted another twenty. I've tried electric pressure cookers and they usually have a removable, non-stick pot inside. We found that the coating retains odors from the last meal prepared in it. Non-stick can't handle the pressure that a stainless steel pot can. This cooker is easy to use and easy to clean. I highly recommend this pressure cooker, it's a workhorse. I use mine a lot. Packaged with care, and quick ship. A+ on all counts.",
      "rating": 5.0,
      "verified": true,
      "author": "CnBe",
      "helpful_votes": 2,
      "publication_date": 20160519
    },
    {
      "title": "Great Cooker!",
      "text": "This is a heavy, gorgeous pot that cooks beautifully. I've had it 2 months now and I'm so happy with the results that I've started searching for blogs with pressure cooking recipes. I've even made a delicious, moist meat loaf in it in less than half the usual time. I've had absolutely no problems with it; it only requires about half a cup of liquid to cook and there is a marking for max fill which is helpful. Also, easy to tell when pressure has been reached. For a single person like myself it's the perfect size. PS. As others have already mentioned there are only 2 pressure settings not 3 as listed in description.",
      "rating": 5.0,
      "verified": true,
      "author": "Dslsurfer",
      "helpful_votes": 4,
      "publication_date": 20111023
    },
    {
      "title": "... reputation and stainless steel construction and it has not disappointed. I purchased a separate rack to place inside ...",
      "text": "I chose this brand pressure cooker due to its reputation and stainless steel construction and it has not disappointed. I purchased a separate rack to place inside to hole vegetables and other foods up off the bottom to reduce possibility of burning and this has helped immensely. I recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "ChristineN",
      "helpful_votes": 0,
      "publication_date": 20161108
    },
    {
      "title": "Cooking time",
      "text": "It is perfect size. Works well for the cooking. But the down side is that the pressure indicator is too difficult to read when the optimal pressure is reached. I bought a Fagor pressure cooker from Macy's and the yellow pressure indicator pops up & easy see when the cooking pressure is reached & also it drops down when the pressure is released.",
      "rating": 4.0,
      "verified": true,
      "author": "jeevan",
      "helpful_votes": 0,
      "publication_date": 20140627
    },
    {
      "title": "Excellent Pressure Cooker",
      "text": "We've really enjoyed this cooker. It took us a few tries to get to using it correctly but now we use it a couple of times a week. We purchased it after going through ratings at Amazon as well as elsewhere. It's easy to use and very easy to clean. If you want it shiny a quick scrub with a bit of white vinegar brings the bling back. We've found it not at all intimidating to use, It proceeds through its stage without any problems and creating no fear for the fainthearted. It seals properly every time. The cooker has been used for over a year now and we're as pleased as we were at purchase time.",
      "rating": 5.0,
      "verified": true,
      "author": "B. A. Potter",
      "helpful_votes": 0,
      "publication_date": 20130425
    },
    {
      "title": "Excellent Pressure Cooker",
      "text": "I purchased this pressure cooker over two years ago. This is an excellent product. It is very well made from heavy gauge stainless steel. After years of having used the old fashioned pressure cookers with the weighted gauge, there was a slight learning curve with the Magafesa, but it was well worth the effort. Without hesitation, I would buy this pressure cooker again.",
      "rating": 5.0,
      "verified": true,
      "author": "Photojo",
      "helpful_votes": 0,
      "publication_date": 20140316
    },
    {
      "title": "Love it",
      "text": "This is worth the money and works great. Even on induction which was nice. Read the instructions carefully if you've never used a pressure cooker before. Botched my first batch of black beans. Can't beat the fast cook of soups and beans. No soaking overnight required! Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "nom nom nom",
      "helpful_votes": 10,
      "publication_date": 20120603
    },
    {
      "title": "Excellent purchase at a great price!",
      "text": "I was in search of a 8 quart pressure and saw the review on this and decided to take the plunge. I really like it. PROS: Excellent pressure monitoring system which makes it near impossible to open the cooker until the pressure stabilizes. There is a locking mechanism which makes sure that the pot is properly closed CONS Don't like the height of the pot",
      "rating": 4.0,
      "verified": true,
      "author": "NORBIUS",
      "helpful_votes": 0,
      "publication_date": 20140907
    },
    {
      "title": "Magefesa",
      "text": "Maybe I should review yet since I haven't used it, but it is a really nice looking pressure cooker. Just a bit smaller than the 4 quart pressure cooker and perfect to use for 2 folks. I love the size. The regulator is built on to the cooker so you don't have to worry about misplacing it.",
      "rating": 5.0,
      "verified": true,
      "author": "SM",
      "helpful_votes": 0,
      "publication_date": 20140304
    },
    {
      "title": "Wonderful Cooker.",
      "text": "The first pressure cooker since my old one, that I love. Highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "whiteowl",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Directions are in spanish",
      "text": "I received the pressure cooker today and I realized the directions are in Spanish. This is my first cooker and I have no idea how to use it. I will go online and try to find the directions in English. I found the directions online. I have been using teh pressure cooker since a bought it, but I noticed that is leaking at the handle. I will contact customer service to see if there is anything that could be done abou it. Otherwise the cooker is great. I absolutely love it.",
      "rating": 4.0,
      "verified": true,
      "author": "Ella",
      "helpful_votes": 0,
      "publication_date": 20140228
    },
    {
      "title": "Five Stars",
      "text": "Good quality and works very nice cook fast save energy.",
      "rating": 5.0,
      "verified": true,
      "author": "wai",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Much better Pressure pot",
      "text": "Love it and much quieter than the older kind. Like that it is stainless steel. The pot is deep enough and fits the burner's on my ceran stovetop.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "Disappointed",
      "text": "This particular pressure cooker came highly recommended from a person who runs a Vegan website. I'm so disappointed in it. It worked once, but now everytime I use it, the pressure suddenly begins escaping from under the lid. I've tried numerous times after reading and rereading the directions. Finally, I bought a cheaper model from another maker and it works great!",
      "rating": 1.0,
      "verified": true,
      "author": "MStarke",
      "helpful_votes": 5,
      "publication_date": 20120317
    },
    {
      "title": "Great pressure cooker at a decent price",
      "text": "Great pressure cooker at a decent price. A bit more complicated in its design and execution than others, but it works very well and you can get used to it. I also ordered the basket and glass cooking lid. One has arrived so far, the basket, and it is nice as well.",
      "rating": 4.0,
      "verified": true,
      "author": "pdk7297",
      "helpful_votes": 0,
      "publication_date": 20140719
    },
    {
      "title": "Love It",
      "text": "I love my new 8-Qt Pressure Cooker from Magefesa Practika. I had an old rocker style pressure cooker that gave up the ghost several years ago and it was such a joy to have one again. Using it for the first time was easy and seamless. My roast came out tender and juicey. I am so excited to have this product in my cooking arsenal.",
      "rating": 5.0,
      "verified": true,
      "author": "JoaniE",
      "helpful_votes": 0,
      "publication_date": 20150917
    },
    {
      "title": "Excellent quality, you just need to play with the ...",
      "text": "Works perfectly! Excellent quality, you just need to play with the temperature. easy to clean",
      "rating": 5.0,
      "verified": true,
      "author": "Paul C.",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "I love it. I bought it used and it has ...",
      "text": "I love it. I bought it used and it has a little problem with the seal being used and letting a little water out but it does not bother me.",
      "rating": 5.0,
      "verified": true,
      "author": "Marina G. Corbin",
      "helpful_votes": 3,
      "publication_date": 20150116
    },
    {
      "title": "Excellent quality product",
      "text": "Excellent quality product. Looks great and helps cook ingredients much faster. I liked it so much that I bought a couple extra ones as gifts for family members.",
      "rating": 5.0,
      "verified": true,
      "author": "Hawke",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "Super safe pan and it lasts for a long time",
      "text": "Super safe pan and it lasts for a long time. Just got from my mom. Her magefesa pan had lasts 10 years and after some replacement pieces it is new!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161002
    },
    {
      "title": "The one to buy",
      "text": "A friend who has a Magefesa introduced us to pressure cooking. We did lots of research on the different brands and this is the one to buy. Perfect size, very well made, easy to use controls and great results. You will need a good cook book also. The one by Lorna Sass has the best recipes.....\"Cooking Under Pressure\".",
      "rating": 5.0,
      "verified": true,
      "author": "Sergei",
      "helpful_votes": 45,
      "publication_date": 20090317
    },
    {
      "title": "Working great so far",
      "text": "My wife has had no problems using this on our induction stove so far. Great results and easy to operate and clean. Will post update if that changes.",
      "rating": 5.0,
      "verified": true,
      "author": "Lakefarm",
      "helpful_votes": 0,
      "publication_date": 20151116
    },
    {
      "title": "Great product",
      "text": "High quality item. This is the first pressure cooker I have ever owned but this product is a high quality product and is relatively easy to clean. I would order this product again.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul_Seattle",
      "helpful_votes": 0,
      "publication_date": 20161120
    },
    {
      "title": "came with good instructions. nice quality",
      "text": "came with good instructions. nice quality. plastic handle even fells like good quality. Made in Spain...so if you are like me and trying to find one not made in China, this is the one.",
      "rating": 5.0,
      "verified": true,
      "author": "Lone Star Safari",
      "helpful_votes": 2,
      "publication_date": 20150402
    },
    {
      "title": "Excellent quality heavy gauge stainless steel set",
      "text": "I bought this set because I did not know if I wanted a 4 quart or 6 quart pressure cooker, this set solved my problem. When I got this set I was impressed with the quality as it was heavy SS inside and out. My pressure cooker set had only two settings, one for 15 psi and another for 8.5 psi, not three that this listing said. I also ordered the steam basket and trivet ($20), extra gasket ($12), and a SS top ($20) for either base from Magefesausa.com who told me that their pressure cookers only have the two pressure settings and that description of 3 settings was in error.",
      "rating": 5.0,
      "verified": true,
      "author": "denny",
      "helpful_votes": 37,
      "publication_date": 20080928
    },
    {
      "title": "Magefesa pressure cooker set",
      "text": "Great product, I have made quite a few meals in the short time that I have had it. Bought this to replace an old four quart Aluminum model, decided that having a 6 quart pot as well as 4 quart might come in handy. Very glad I did, as I am using the 6 quart pot much more than the 4 quart one. Once the correct pressure is reached I turn the gas down to just above simmer, saving energy and not heating up the kitchen. Very silent, only a slight hiss while operating. Beats the old rocker type pressure cookers hands down. You won't be sorry buying this one.",
      "rating": 4.0,
      "verified": true,
      "author": "denny",
      "helpful_votes": 4,
      "publication_date": 20120120
    },
    {
      "title": "Great product",
      "text": "I use this pressure cooker all the time. Very happy with the quality and ease of operating it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161211
    },
    {
      "title": "Five Stars",
      "text": "Excellent well designed pressure cooker and very safe and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark A.",
      "helpful_votes": 0,
      "publication_date": 20150228
    },
    {
      "title": "Works great. Cooks great",
      "text": "Works great. Cooks great...only issue is sometimes it takes a while for the safety pin to pop up and start the steaming process.",
      "rating": 4.0,
      "verified": true,
      "author": "Jupiter",
      "helpful_votes": 0,
      "publication_date": 20150518
    },
    {
      "title": "This is one of my favorite things",
      "text": "You can cook dry beans really fast, without having to presoak. It makes a potroast to die for. Stainless steel construction, this thing was built to last.",
      "rating": 5.0,
      "verified": true,
      "author": "robbie",
      "helpful_votes": 0,
      "publication_date": 20140409
    },
    {
      "title": "Useful, Great size for everyday meals.",
      "text": "Nice size. Button lock requires careful fitting of the lid or it won't seal properly. Makes an excellent match with my induction burner.",
      "rating": 4.0,
      "verified": true,
      "author": "Barb",
      "helpful_votes": 2,
      "publication_date": 20141124
    },
    {
      "title": "Works Great - Great Product",
      "text": "I have used my Magefesa Practika Plus Stainless Steel 8 Quart Super Fast Pressure Cooker with confidence. I do not steam up my walls and I cook food faster. Happy Days are with me in my kitchen now.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothea",
      "helpful_votes": 0,
      "publication_date": 20110621
    },
    {
      "title": "Great product!",
      "text": "I love cooking with these. The food taste better and seems easier to digest witch was what I was after. Very easy to use and shortens cooking time.",
      "rating": 5.0,
      "verified": true,
      "author": "Little Bird",
      "helpful_votes": 0,
      "publication_date": 20130920
    },
    {
      "title": "Great product!",
      "text": "I love cooking with these. The food taste better and seems easier to digest witch was what I was after. Very easy to use and shortens cooking time.",
      "rating": 5.0,
      "verified": true,
      "author": "Little Bird",
      "helpful_votes": 0,
      "publication_date": 20130920
    },
    {
      "title": "It works",
      "text": "Used five times so far, have not blown the house up yet, cooks just fine",
      "rating": 4.0,
      "verified": true,
      "author": "Bright Day",
      "helpful_votes": 0,
      "publication_date": 20160127
    },
    {
      "title": "Magefesa pressure cooker",
      "text": "This pressure cooker is great. I use it at least twice a week. I chose the 3.3 Quart size because I can make smaller amounts. I would buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Piedrita",
      "helpful_votes": 0,
      "publication_date": 20131122
    }
  ],
  "product_meta": {
    "title": "Magefesa Practika Plus Stainless Steel 8 Quart Super Fast Pressure Cooker",
    "description": "Size:8 QuartPreserves vitamins and minerals which are usually lost with conventional cooking methods. (Pressure cooking retains important water-soluble vitamins and minerals lost in conventional cooking so meals are healthy and delicious). Reduces cooking time up to 70% so you will be using less energy and saving money. Pressure control system with 2 cooking levels: fast cooking -8 psi-, super fast cooking -15 psi. Made of 18/10 stainless steel. 5 additional safety systems: working pressure valve, pressure indicator valve, security valve, safety edge lid window and \"easy lock\" system (prevents opening before pressure is completely released). Bakelite and ergonomic handles. Easy fit lid. Induxal tri-ply base: 18/10 stainless steel, aluminum, and 18/10 stainless steel for even heat distribution. Trivet and steamer optional. Suitable for all type of surfaces: gas, electric, ceramic and induction stoves. Dishwasher safe pot. Ten-year warranty. Designed in Spain. Family of 6-8 people. Can be used as a pressure canner.",
    "rating": 4.4,
    "feature_bullets": [
      "Pressure control system with 2 cooking levels: fast cooking -8 psi-, super fast cooking -15 psi",
      "Made of 18/10 stainless steel",
      "Designed in Spain",
      "Dishwasher safe pot",
      "Ten year warranty"
    ],
    "specifications": {
      "Product Dimensions": "16 x 12 x 11 inches",
      "Item Weight": "8 pounds",
      "Department": "Kitchen and Dining",
      "Manufacturer": "Magefesa",
      "ASIN": "B0018A9AUM",
      "Item model number": "01OPPRAPL75",
      "Customer Reviews": "4.4 out of 5 stars257 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#171,325 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 23, 2008"
    },
    "categories": [
      "Home & Kitchen",
      "Cookware",
      "Pressure Cookers",
      "Pots & Pans",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}