{
  "website_summaries": [
    {
      "verdict": "Known for removing nature's stains and having a pleasant aroma as well.",
      "pros": [
        "Effectively removes surface stains with a touch of manual labor and a scrub brush",
        "Helps preserve interior from the effects of sunlight as well",
        "Loyal customer base notes the quality of clean for single uses and over time"
      ],
      "cons": [
        "Doesn't provide a deep clean, but it will do a good job removing surface debris and stains"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "the nice combination of sun block and red dirt from Lake ...",
      "text": "We have used several products over the past few years trying to get our seats clean, including Vinyl Sauce and Simple Green, and nothing has worked very well - these products worked on superficial stains and dirt only but did not do much to remedy the discoloring grime from using the boat all summer (for example, the nice combination of sun block and red dirt from Lake Powell). This product did not totally remedy the situation, but our seats are cleanest they have been since we purchased the boat. I used a soft brush.",
      "rating": 4.0,
      "verified": true,
      "author": "Akamai Okole",
      "helpful_votes": 3,
      "publication_date": 20180612
    },
    {
      "title": "Finally, Something That Works!",
      "text": "I have been asking all of my friends what they use to clean their vinyl boat seats. One friend told me about this product and used in conjunction with Mr. Clean miracle sponges, it’s the magic combination. Work so much better than any other boat cleaner I have tried !",
      "rating": 5.0,
      "verified": true,
      "author": "SueS",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Cleans well and smells good.",
      "text": "I used this in combination with a Magic Eraser and it cleaned up white vinyl very well.",
      "rating": 4.0,
      "verified": true,
      "author": "Gina",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "It just works....",
      "text": "I used this on a pure white golf cart seat. I was blown away how good this product works without being so aggressive that it hurts the vinyl. I've told a few people about this gem. All of them have been satisfied. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Tresco B.",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "I had fantastic results with this on my boat seats",
      "text": "I had fantastic results with this on my boat seats. Covered in mold and dirt. I washed the seats with baking soda and vinegar mix. This did not take care of problem. I, then, used Babe's Boat Care spraying directly on seats and using clean white cloths/towels, then a bar scrub brush. This worked great. I just bought pack of white washcloths and when one was dirty, I used the next and so forth. Then took the small hand bar scrub brush purchased at the all things a Dollar store to finish the job. LOVE IT!! My seats were gross, heavily covered top to bottom and overdue for cleaning. Definitely buying again and again.",
      "rating": 5.0,
      "verified": true,
      "author": "amazonbeth",
      "helpful_votes": 2,
      "publication_date": 20151003
    },
    {
      "title": "Smells great though",
      "text": "Worked of on surface on my boat seats but didn't get pores clean even using scrubbing with magic eraser. Smells great though",
      "rating": 3.0,
      "verified": true,
      "author": "KFA3",
      "helpful_votes": 2,
      "publication_date": 20170731
    },
    {
      "title": "Babe's really did help get oak leaf stain off vinyl ...",
      "text": "Babe's really did help get oak leaf stain off vinyl. But I did have to put bleach on paper towel and let sit on the spot to get the most stubborn part off.",
      "rating": 4.0,
      "verified": true,
      "author": "Randy R.",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "The miracle soap I’ve been searching for!",
      "text": "First review I’ve left on a product before. I feel like I’ve boat every upholstery cleaner on the market, with in seconds I was amazed by this stuff! Took my 15 year old boat looking amazing! Also, what normally took me half a day only took about an hour (I took breaks though). Don’t hesitate on this stuff, just buy it!",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Smith",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Awesome cleaner for seats and trim",
      "text": "This was a god send and made cleaning the boat seats and trim so easy. Just used a soft cloth and some of those tough stains came right out. Going to try it in the car next.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott LoRusso",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Amazing!",
      "text": "Just tried this product because I love Babe's boat bright and I love it. It worked so well cleaning the upholstery that I used it in my car. Wow, all the grime has come off around the handles, seats, center console... Amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Kim",
      "helpful_votes": 0,
      "publication_date": 20160902
    },
    {
      "title": "Great removes most anything.",
      "text": "This is a great cleaner it removed far more then I was expecting. Great product will continue to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas D Malone",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "Broken Nozzle, But a Great Product!",
      "text": "Product arrived with a broken spray nozzle, not much product leaked into the shipping bag. Is there any way I could be sent a replacement spray nozzle? Anyway, this is a great product. Cleans great, smells great!",
      "rating": 5.0,
      "verified": true,
      "author": "Brett Lytle",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Smells Great Too",
      "text": "If you haven't tried it, then your boat seats aren't as sharp as they could be.",
      "rating": 5.0,
      "verified": true,
      "author": "clearly deranged",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "Babe's Boat Care products rock!",
      "text": "Once you try Babe's products, you'll never use anything else!",
      "rating": 5.0,
      "verified": true,
      "author": "Janece McClung",
      "helpful_votes": 0,
      "publication_date": 20170622
    },
    {
      "title": "Best Boat Seat Cleaner Out There!",
      "text": "I use all the Babe's products. My boat is 11 years old. I'm constantly surprising people who think it's anywhere from 2 or 3 years to brand new.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Wise",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Smell to die for",
      "text": "I dont know whats in this stuff but the smell is great. I could sniff this stuff all day. And by the way, works pretty good at cleaning my boat seats.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "Great product for any leather",
      "text": "Great product for any leather , used for my car & leather furniture in home . It made my leather conditioned and soft .",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Thomas",
      "helpful_votes": 0,
      "publication_date": 20140724
    }
  ],
  "product_meta": {
    "title": "Babe's Boat Care BB8016 BABE'S SEAT SOAP PINT BOAT CARE SEAT SOAP - 16 oz.",
    "description": "Size:1 PintBABE'S Seat Soap cleans vinyl, plastic, and leather surfaces and is specifically formulated to lift dirt, scum and suntan oil without harming or drying out the surface. Especially suited for the extreme conditions of marine environments, BABE'S Seat Soap has a conditioning base solution that enhances the natural qualities of your interior surfaces while it cleans. No pre-washing is necessary; spread BABE'S Seat Soap directly on upholstery and wipe with a clean towel. For deep crevices or stains, rub with a soft brush before wiping off. BABE'S Seat Soap has been tested and approved for use by the leading boat manufacturers including Malibu and Mastercraft. Keep BABE'S Seat Soap on hand to keep your seats looking sweet. Sweet seats!",
    "rating": 4.6,
    "feature_bullets": [
      "Cleans vinyl, plastic, and leather surfaces and is specifically formulated to lift dirt, scum and suntan oil without harming or drying out the surface",
      "Conditioning base solution enhances the natural qualities of your interior surfaces while it cleans",
      "Spread BABE'S Seat Soap directly on upholstery and wipe with a clean towel",
      "Especially suited for the extreme conditions of marine environments",
      "Tested and approved for use by the leading boat manufacturers"
    ],
    "specifications": {
      "Manufacturer": "BABE'S Boat Care Products",
      "Brand": "BABE'S Boat Care Products",
      "Model": "BABES BOAT CARE",
      "Item Weight": "1.25 pounds",
      "Product Dimensions": "11 x 2 x 2 inches",
      "Item model number": "BB8016",
      "Manufacturer Part Number": "BB8016",
      "Cover Included": "BABE'S BB8016 Seat Soap - Pint",
      "Vehicle Service Type": "Marine-personal-craft",
      "ASIN": "B00123DLWI",
      "Customer Reviews": "4.6 out of 5 stars104 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#12,672 in Automotive",
      "Date First Available": "February 26, 2010"
    },
    "categories": [
      "Sports & Outdoors",
      "Maintenance Supplies",
      "Automotive Parts & Accessories",
      "Sports & Fitness",
      "Boating & Sailing",
      "Boating",
      "Cleaners"
    ],
    "price": 10.95
  }
}