{
  "website_summaries": [
    {
      "verdict": "The Zoom H4n is a mobile recording dynamo with features that outperform competitors that cost twice as much. It is an outstanding value for musicians and podcasters who demand professional-sounding results.",
      "pros": [
        "The Zoom H4n uses a sturdy, intuitive design, quality stereo microphones, phantom-powered inputs, and includes the capability to record four channels simultaneously"
      ],
      "cons": [
        "The design is bulky, mixer settings aren't intuitive, and the minijack microphone input is awkwardly placed"
      ],
      "aspects": {
        "Design": 9.0,
        "Features": 9.0,
        "Performance": 8.0
      },
      "publication_date": 20090413,
      "rating": 8.7,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Rubberized coating has gone all sticky with age",
      "text": "I wish manufacturers would stop using this rubberized coating on their products. I pulled the Zoom out of it's case today after not using it for about a year and the back of it has gone completely sticky. There's really no easy or safe way to remove this coating, since there are small rubber foot-pegs in the back, as well as the battery compartment. Just use regular plastic for crying out loud. This is so disappointing. I never ever took the factory screen protector off the front screen, and the back of this device is a total mess.",
      "rating": 1.0,
      "verified": true,
      "author": "T. Brophy",
      "helpful_votes": 28,
      "publication_date": 20190628
    },
    {
      "title": "Nice unit",
      "text": "This is my first field recorder and overall I'm very pleased with it. The only issue I have is the start-up time: it takes literally a minute or two to start up with a 32GB memory card installed. My understanding is that the start-up time is related to memory card size, so it might be much faster with a smaller one. Also, it would be nice if this unit encoded to OGG format instead of / as well as MP3, but its absence is understandable. One caution: be gentle with the power/hold switch.",
      "rating": 4.0,
      "verified": true,
      "author": "icewater",
      "helpful_votes": 11,
      "publication_date": 20151129
    },
    {
      "title": "1)Sterio link for 2 XLR Input not working  2) limiters not working",
      "text": "So, Guys, I had an old version from zoom And I know what I'm talking here watch my videos I Uploaded 1) when you using 4ch mode and when you connect only 1 microphone you have to turn on 1/2 Link and <<1/2 Link is not working>> Result records only mono and left side 2) sound Limiters not working Resulting sound clipping no matter what Level I record Its made for musicians but it's deffecti or unprop 3) 2nd exlr input and 1/4 inputs not working Even if I connect my electric guitar Customer service doesn't have clue what Setting are there I updated 2x firmwhere 1.10 and didn't help at all",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Fragile as an Eggshell",
      "text": "This is not well made. I used it lightly for a year and 1/2, and the sound chip holder broke. Just started rejecting every chip I tried to insert, which means no more recording. Contacted customer service and they offered to replace it at a cost of $140. But I already spent $220 on this only to have it break in under two years. Would be nuts to invest another $140 on a piece of equipment that’s as fragile as an eggshell.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20190809
    },
    {
      "title": "Great audio.",
      "text": "The audio from this is outstanding. Paired with a noise cancelling headphones the audio sounds better than the actual sound. Crisp and clean. It's sound with hd. I use this to record sound effects in the outdoors and it does a great job. I did have an issue where one of the buttons failed. I email Zoom got prompt respons and in not time a new was shipped to me at no extra cost. This was after the defective unit was returned. Fantastic product and customer support.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos Mencia",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Fabulous",
      "text": "It sounds fantastic. I’m an avid violinist, and also do talking video for YouTube. I sound better on my violin recorded than my ear hears while playing, seriously. Recorded talking video to SD card for video shot with my DSLR camera, then sync’ed in Di Vinci resolve. Easy, and sounds perfect. I did a cheap lav mix to my DSLR and the background noise was horrible. This is perfect. Love the XLR cable inputs for future expansion. The price is not cheap by any means, but what a value. Worth every penny. Menu, etc. not super intuitive, but not hard to figure out either.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Paul",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Audio quality is top notch. Battery and load time are the draw back.",
      "text": "I use this for interview audio to sync with a multi cam set up and it has uppedy production quality significantly. Because I'm using a lav that need +48 phantom power the battery drains fast even on stamina (get some rechargable AAs) other then that I have had to wait 5+ minutes for the recorder to boot up and load up the SD card which can be killer if you have a tight time window. You'll get amazing audio out of this thing but you have to deal with the qwerks. Note: I use a 32gb 45mbs SanDisk SD card in this.",
      "rating": 4.0,
      "verified": true,
      "author": "Aaron Anglin",
      "helpful_votes": 3,
      "publication_date": 20170825
    },
    {
      "title": "Worth the difference over H1",
      "text": "Great recorder for easily recording multiple tracks and easily setting up input levels. I'm taking away a star because I really think it should have a nicer, rechargeable battery, or come with the cable to power it via wall outlet. It can be powered via usb, but only when using it as a USB audio interface. Speaking of the audio interface feature, that's a great benefit of this device. I can easily hook it up to my computer, plug in a 10$ SM57 clone to the XLR inputs, and it becomes great for recording big, loud instruments (trumpet, tuba, etc.) The fact that the XLR connectors double as female 1/4 connectors is great too.",
      "rating": 4.0,
      "verified": true,
      "author": "Cameron O'Neill",
      "helpful_votes": 2,
      "publication_date": 20160603
    },
    {
      "title": "The Best Audio Recorder",
      "text": "This audio recorder offers the absolute best sound quality that I have experienced from a digital recorder. You must use a 32 or lower SD card with it because a larger one- although has more space, will take longer to load. I would love to say more about it. It's durable, although made from plastic, and it has an exceptional interface for easy access to menu and features to make you sound great. I use it with my phone to record interviews, or use external microphones which are EXCELLENT to pick up ambient sound... THE audio recording QUALITY is EXCEPTIONAL. It's a little bit of an expense... but this audio recorder is well worth the $$.",
      "rating": 5.0,
      "verified": true,
      "author": "Manouche DeLeau",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Poor sound quality",
      "text": "Terrible sound quality. I could not get any usable audio while using the zoom. One event I recorded was my kids marching band competition. The audio quality was terrible i ended up using the audio from another parents video taken with her cell phone which had poor video but much better sound than the zoom. Very disappointed in this product, returned for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Jimmy H.",
      "helpful_votes": 2,
      "publication_date": 20191029
    },
    {
      "title": "Five Stars",
      "text": "very good for capturing ambient sounds in stereo like trees, rain, and hellfires",
      "rating": 5.0,
      "verified": true,
      "author": "ES",
      "helpful_votes": 5,
      "publication_date": 20170320
    },
    {
      "title": "Great little recorder!",
      "text": "I bought this from Amazon in Feb, 2018, to replace an H2N. The first unit shipped had a problem - a mechanically faulty control - but Zoom was very responsive and replaced it immediately. Since then, it has worked perfectly. Outstanding audio quality. I especially like the ability to use external mics with XLR connections, but the built-in mics work remarkably well. There's a fairly steep learning curve, but that's to be expected in a unit with so many functions. It has weathered many band practices - meaning, it has stood up to vigorous use under less than ideal conditions. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "James D. Besser",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "The best in its category",
      "text": "The best in its category! My friend that works in the movies industry recommended it and I'm glad I listened. I use it for my hobby and for recording my kids, lectures, nature sounds, etc. The quality of the sound recorded with its mics is fantastic, it is capable of producing movie like sounds like floor creeks, doors shutting, people steps. It is full and rich of features. It really is a compact recording studio. Visit YouTube and you will find tons of good reviews and excellent tutorials so you are not intimidated by its configuration options.",
      "rating": 5.0,
      "verified": true,
      "author": "ACustomer",
      "helpful_votes": 3,
      "publication_date": 20161126
    },
    {
      "title": "SCREEN STOPPED WORKING ON THE FIRST USE (CRITICAL ISSUE FOR H4N)",
      "text": "Build quality and quality control is everything for a product or brand – at least, one to be taken seriously. On my very first usage of the H4N I bought on Amazon, the screen stopped working. Blank screen. Googled it and found many other customers with the same problem. Here in Amazon we can see other customers complaining about other build quality problems. Zoom has an almost non-existent support. Unless you want to play russian roulette with three bullets on the barrel, run away from this brand. Never, ever again.",
      "rating": 1.0,
      "verified": true,
      "author": "Juliano Barata",
      "helpful_votes": 7,
      "publication_date": 20170331
    },
    {
      "title": "Great 4-track Recorder",
      "text": "Two built-in microphones for recording live stereo sound, plus two direct inputs (for either microphones, or line inputs.) I'm using it for recording my drums to a playback track. I just experimented a bit with placement (for me, it's two feet in front of the bass drum, at the height of the snare & angled down a bit.) The resulting sound is excellent, requiring just a bit of EQ to bring out the low frequencies on the kick & the mid-low frequencies on the snare (which also enhances the toms.)",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Allen",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "I love my ZOOM H4n!",
      "text": "I started using this device out of the box and not many day go by when I am not using it for something. It is very versatile and I appreciate the quality of the product. I use it to record audio for my videos. I also use it for recording podcast audio and I have also used it for dictation to provide files for voice recognition. I am about to use it as an audio interface for my computer. I am very satisfied with this product so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark D. Wecht",
      "helpful_votes": 2,
      "publication_date": 20170819
    },
    {
      "title": "Simple. Powerful.",
      "text": "This is what technology used to be, before it tried to be more than it needs to be. Simple interface. Powerful product. I used it for run-n-gun interviews, ambient room noise, and line adapted input for film. Fits perfectly in the hand. Designed to be operated with a single hand, where all buttons and wheels are immediately available to index and thumb.",
      "rating": 5.0,
      "verified": true,
      "author": "Kai Staats",
      "helpful_votes": 3,
      "publication_date": 20170508
    },
    {
      "title": "Works very well",
      "text": "Works very well. Produces excellent quality sound files without having the best acoustics to work with (hanging in the living room recording In House Jazz sessions). The Ultimate Lithium batteries last a long time in it. The controls are not as intuitive as I would like but you just have to go through the manual a couple of times.",
      "rating": 4.0,
      "verified": true,
      "author": "D. D. Weller",
      "helpful_votes": 4,
      "publication_date": 20170207
    },
    {
      "title": "Complete fail of critical production tool. Pretty much no support from the company.",
      "text": "Second total fail of this recorder. Bought another when the first incident happened. Now #2 is dead in the water with same issue. Frozen on the USB Storage screen. Will not reset or return to main menu. This is a production tool. \"Send us a video and we may be able to do something\" is not an adequate response. I will be using another company's product by then.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff Hanley",
      "helpful_votes": 3,
      "publication_date": 20190903
    },
    {
      "title": "Love it",
      "text": "This Zoom recorder has been with our company for a few years now. We love it, and still use it weekly. Rented it out once, came back broken, put it back together and voila. One of the Microphones on top wiggles a bit now. This is not the reason I gave it only 4 stars, even though it is a great recording device, some things could be asked for. The thing goes through batteries quickly, and while the AC adapter is life saving, its positioning is awkward and cannot be used with the stand on a table top. That said, I highly recommend this product, very easy to use for amateurs, and enough settings to keep professionals happy.",
      "rating": 4.0,
      "verified": true,
      "author": "Wissam",
      "helpful_votes": 0,
      "publication_date": 20160731
    },
    {
      "title": "Does not include any required cables",
      "text": "Unless I'm missing something, you need either an SD card or USB cable to a computer to use the device; it comes with neither. They were kind enough to include 2x AA batteries, but if you want to use an external power supply you'll need to provide your own cable for that too. And the inputs at the bottom too of course. None of these are particularly hard to find, but I was unprepared and kinda disappointed that now I need to wait a few more days of shipping (not to mention the extra cost). Can't comment on quality yet, but I'm sure that'll be fine.",
      "rating": 3.0,
      "verified": true,
      "author": "Alexei gousev",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "What a pyle!",
      "text": "Well the H4N is perfect. Arrived quickly, faster than expected and was in flawless condition. The unit is heavy, you can tell its quality just by holding it in your hand. The Pyle mic set that came with it,... well i mean they were pretty much free so i can't complain. However one of the two mics, has a hard time picking up anything over a certain octave. Seem to be really really cheaply made. The wireless range is pretty decent, however i think that these are best used for PA or talking, they don't work so well for singing / karaoke.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Not Intuitively Obvious",
      "text": "Way too complicated, not intuitively obvious. I grew up on the Tascam Portastudio. This makes no sense. I cannot figure out how to make it function, even with all the data in the manual.",
      "rating": 1.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "No AC adapter??",
      "text": "I just unpacked my H4N, and I'm thrilled to be reunited! I had to leave \"mine\" behind when I left my job. I used this model for several years, so I know it's 5 star, but I just could not be leave that an AC adapter was not included as part of the basic purchase. Truly shocked. I guess I will be purchasing it separately, but I really think that it is a basic, essential component and should be included in this package.",
      "rating": 4.0,
      "verified": true,
      "author": "Liz in Arizona",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "Freezes nearly every time I start it up.",
      "text": "The Zoom recorder is a great unit for recording sound \"on location\". However, almost every time I start it up, within about 2 minutes, it freezes. The only way to fix it that has worked so far is to remove the batteries. Sometimes I need to do this multiple times. Very frustrating. But once it gets past that, it works very well.",
      "rating": 2.0,
      "verified": true,
      "author": "Brett",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Go anywhere, record anything!",
      "text": "Great tool. Can be a field recorder, usb interface, 4 track recorder or a camera mic. Pretty much only limited by your imagination. Fairly easy to understand although spending some time with the manual will definitely help you get the most out of it. For instance I discovered it has an inbuilt tuner and metronome which is handy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20160731
    },
    {
      "title": "Perfect equipment. The genius is in reading the manual",
      "text": "Perfect equipment. The genius is in reading the manual. I REALLY NEED TO DO THAT! This company makes many excellent recorders. I have no complaints, except I should have realized I was too close to the speakers and the feedback was so bad. This, of course is my fault. This is hyper sensitive equipment. I highly recommend testing it to gage your levels and DO NOT record with a mic and speakers nearby. This is most likely common knowledge to musicians. I am only a comedian :\\ Lesson learned. Great device though!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Amazing tool for recordists",
      "text": "I had an original H4 for 10 years, and when one of my clients insisted on buying it (I had been loaning it to them), I upgraded to the new one. It works and sounds just as good, but has more flexibility in features. This is an amazing tool for the price, but it has more depth than meets the eye and has a bit of a learning curve, even in upgrading form the older model. (I am a pro engineer).",
      "rating": 5.0,
      "verified": true,
      "author": "stev0",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Zoom H4n",
      "text": "Great recorder. Has the capability of an XLR to plug in directly or 1/4\". Also has the option to supply phantom power to a mic plugged into it if need be. Can run off of batteries or a mini usb to wall power unit. Has the ability for 2 direct plugged in audio devices as well as utilizing the audio mic attached. Or one or the other. Mic has always worked extremely well.",
      "rating": 5.0,
      "verified": true,
      "author": "andrew",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "Definitely would recommend to anyone but especially musicians",
      "text": "I absolutely love this thing! I've been using it to record my music and I've recorded my own live shows with drums, bass, singing, and 2 guitars and it picked up everything. I've also directly plugged in my guitar and created an entire track using 4 different tracks put together all within the device it self which was great for coming up with new songs. The tuner is great and also the guitar effects sounded great as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Geek Out Reviews",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "I hate it so much but it does its job.",
      "text": "Seriously, you have to click twice to record... why? Why? The amount of times this has happened is so frustrating. Because of it, I just ended up connecting an aux to my camera to record the audio directly to that and forget about another record button.",
      "rating": 3.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Bulky but good",
      "text": "I have been using this for many years. It is bit bulky and could be designed much better. Sound quality is good and easy to operate. Reviewing late because I love to use products for a while before say something.",
      "rating": 5.0,
      "verified": true,
      "author": "Mizanur Rahman",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Superb piece of kit",
      "text": "this is just the best recording device I have ever used. Absolutely so easy to use, intuitive, great functionality and well worth the money, rugged as well so I don't feel if it does get knocked it's going to break. Really worth investing in if you need to record anything",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Taylor",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Great, but two little things keep it from being perfect",
      "text": "Great sound quality, which is the most important part. Easy to use, but does need a bit of clicking and scrolling through the menus for some of the functions. The two things I don't like...1) the 3.5mm mic jack is on the back of the unit. You cannot lay it flat when you have a mic plugged in there. 2) The date has to be reset whenever you remove the batteries. For the cost of this unit, the date should not need updating whenever the batteries run out.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "The positives to it though are the battery life is great and I've never personally had corruption using one",
      "text": "It takes forever to turn on (2+ minutes), it takes forever for the memory card to mount (3+ minutes), and for the memory card to format (3+ minutes). I film a lot of events, so does not work for me. The positives to it though are the battery life is great and I've never personally had corruption using one.",
      "rating": 2.0,
      "verified": true,
      "author": "Kyle William Scott",
      "helpful_votes": 5,
      "publication_date": 20151005
    },
    {
      "title": "Just Started Using This and Impressed so Far",
      "text": "Fairly easy to get started and KILLER sound. Even after reading good reviews on sound quality, I was shocked at how good the sound is. I not too experienced with this type of gadget but so far it has been fairly intuitive to use. Will update later. JimBene",
      "rating": 5.0,
      "verified": true,
      "author": "jim bene",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Built-in microphones went bad",
      "text": "The built-in microphones went bad only days after the warranty expired. Now, one mic is way hotter than the other, making good stereo recordings with the built-in mics impossible. I babied this thing and it still went bad. Buy something else from a different manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "J H",
      "helpful_votes": 8,
      "publication_date": 20170322
    },
    {
      "title": "Fantastic Product (I especially love the soft record button)",
      "text": "Don't get me wrong. Its a fantastic audio recorder. High quality, stereo audio at the touch of a button. But I wish Zoom would have included some form of charging with this product. It \"ZOOMS\" through batteries like crazy. I recommend this product if you are serious about audio and I also recommend you purchase a charging block to carry in your pocket or rechargeable batteries.",
      "rating": 4.0,
      "verified": true,
      "author": "bambofett",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Solidly built to last",
      "text": "bought these to record my drummer to then insert his live drums into Pro Tools session. This unit records pristine, clear wav files and is a super solid build. great little recorder for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Dale Kath",
      "helpful_votes": 3,
      "publication_date": 20170503
    },
    {
      "title": "XLR Inputs never worked!!!!!!!!!!!!",
      "text": "My product never worked properly when I received it!!!! Amazon needs to fix the problem, my XLR inputs never worked!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20180304
    },
    {
      "title": "Great for the audiophile",
      "text": "This H4N Pro replaced an H4N non Pro - which I have used and enjoyed for many years. It's a great product. I used it to record, among others, a pipe organ - which by it's nature has enormous dynamic and frequency requirements. The Zoom has always handled it flawlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "Blake Alexander",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Videographer's need this recorder",
      "text": "I really needed one of these recorders for filming so I bought this zoom h4n. I love the quality of it, but I wish it zoomed further. I think you get that more with the h5n, but this does a great job of acting as an affordable boom mic, interview mic, and I think every videographer needs one of these. I usually attatch it to my boom mic and on top of my camera. I went so long without one and once I bought one, I'm glad I did. It is pricy, but it's a great investment.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric Daniel Medina",
      "helpful_votes": 0,
      "publication_date": 20160910
    },
    {
      "title": "Perfect for the Independent Filmmaker",
      "text": "The H4N is the perfect portable stereo recording device! And it's really easy to use! It's the perfect tool for the independent filmmaker. I animate short films myself, and it has recorded some great sound effects for my films. I could also mount it on top of my D-SLR camera, which then becomes a pretty good run-and-gun set up. It's portability is useful for documentary filmmaking, where ongoing action may require you to setup pretty quickly. It's also ideal for recording music. It's very well made; it's solid and has a rubbery texture for gripping. The screen interface is clean and simple; easy to understand. Again, it's the perfect portable stereo recording device.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel",
      "helpful_votes": 0,
      "publication_date": 20140329
    },
    {
      "title": "Great little hand held recorder.",
      "text": "This is a great little portable recorder but it is also a great multi track recorder for any kind of recording. I have even used it as an interface on occasion. Very easy to use also. It even has internal effects for guitar and bass plus there is reverb and delay. You can't ask for more out of a portable hand held recorder. Works on battery's as well as AC power. Comes with the adapter. Well I would hope so, right. Goes without saying. But the thing really does a nice job all around. It's a little pricey but when you hold and operate it you know it was worth the money spent.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Giuffrida",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "Zoom recorders are fantastic. They will record the true sound of my ...",
      "text": "Zoom recorders are fantastic. They will record the true sound of my video recordings. I connect it to my camera's audio input AND IT IMPROVES THE SOUND 100 % I just love the recorder. It works great for my line of work the Zoom H4n does the job. You will never be sorry. great price here in amazon!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jay Tech jr",
      "helpful_votes": 2,
      "publication_date": 20170403
    },
    {
      "title": "It is a BEAST!",
      "text": "Well it certainly is not all the practicing my son's ben doing that makes him sound so sensational...okay I'm sure it helped. But this little recorder is ideal for the musician that wants to self-audit their playing, self-create audition tracks, and just have a heck of a lot fun recording sounds that most recorders distort or cannot give their proper credit. So many settings and features and so little time!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina S.",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Love it. Making videos",
      "text": "Love it. Making videos, recording guitar, using as an Audio Interface. This device has blown me away with build and sound quality. My only complaint is that the navigation wheel on the side is not very clever, I got used to it quickly but there are much better methods available. Other than that I highly recommend this device.",
      "rating": 5.0,
      "verified": true,
      "author": "Rama",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "Great piece of equipment",
      "text": "This is a staple item. I bought it refurbished and the first one was defective, but the company quickly send another replacement and this one works perfectly. Not ready for the higher priced models, but for how I capture professional audio, this is a must have.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymund Kubassek",
      "helpful_votes": 3,
      "publication_date": 20170506
    },
    {
      "title": "Sweet piece of gear",
      "text": "Fantastic digital recorder. With an external preamp and mixer this is really studio quality hardware. And you get 90% of that in just the handheld unit alone. Excellent battery life for the performance it delivers (and external power can plug in if you need it)",
      "rating": 5.0,
      "verified": true,
      "author": "Doc",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Great little recorder.",
      "text": "The Zoom H4n 4-track portable recorder - along with a good mixing board - are the essential tools for a podcasting setup. The H4n is light, reliable and surprisingly versatile. Now, all your podcast needs is some interesting content to record.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Rustad",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Value for money is fantastic!",
      "text": "Every feature you could ever wish for is crammed into the H4N Pro! Audio effects, great stereo mic, locking XLR, 96Khz 24 bit, and much more! My only real gripe is the disgusting startup time! With my 32GB 90 Mb/s SD card, I get startup times in the range of 30 seconds, and when I use a slower card, I’ve had startup take over five minutes! I havent had this problem on any other recorders, so why the H4N Pro? Hope this helps everyone!",
      "rating": 4.0,
      "verified": true,
      "author": "Cfm down under",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "Great on so many levels",
      "text": "This product can be used in so many ways, that's what makes it great on so many levels. I work in real estate and use this recorder for all my audio. The built in recorder is great, but I typically plug an external microphone to get a crisp sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Stopped working after 45 days",
      "text": "After 45 days the product has stopped working. It has been used regularly and kept in its case, and now the on/off button will not work rendering the product useless. Please help with this issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel J O'Brien",
      "helpful_votes": 11,
      "publication_date": 20160630
    },
    {
      "title": "EXACTLY what every sound buff needs.",
      "text": "Got this on sale. One of the best decisions I've ever made. The H4N has it all: 2 XLR Connections (which double as 1/4\" connections), Phantom Power, A Plug-In Power 1/8\" connection, PLUS two on-board mics that rotate to capture 90 degrees and 120 degrees for wide stereo sound, headphone port, etc. etc. The list goes on and on. It's built VERY nicely and is very affordable. I use this constantly in short film productions and recording sound effects as well as field work doing interviews. I HIGHLY recommend this for anyone doing Short Films, Sound Design, and Field Work. Can't beat it for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor S Mefford",
      "helpful_votes": 0,
      "publication_date": 20141024
    },
    {
      "title": "The Zoom H4N does it all and more!",
      "text": "This is a great piece of equipment. I decided against picking up the pro version as there wasn't a significant enough difference to entice me to spend the extra money. The Zoom H4N does it all and more! I use it for recording my affirmations and use it for my music as well. EDIT: This recorder's life came to an end a few days outside of it's one year warranty. As I recall, one of the buttons fell off or was severely disabled. Since it was out of warranty, all Zoom would do is offer me a refurbished unit for a ridiculous $100 some odd dollars. I was disappointed and passed on their offer.",
      "rating": 5.0,
      "verified": true,
      "author": "bubbradio",
      "helpful_votes": 0,
      "publication_date": 20160603
    },
    {
      "title": "Sounds quality can't get any better.",
      "text": "Using for YouTube production. Really good sound quality. Get some rechargeable batteries (a few pairs) if you're planning to plug extra microphones. 30-45 min and best batteries are gone. The rest = you get BEST sound quality and great recorder that did bring our video production to the next level. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Vera S",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "This was my solution",
      "text": "I needed something to make a good recording of playing acoustic guitar and singing in my home studio. This recorder has worked beautifully. All I needed to do was find the best placement for it - the results were outstanding. It has a USB interface, so I easily uploaded the files to my mac and then edited the audio files in Audacity - which primarily involved snipping off the ends and amplifying some. Even though I did not want to spend this much, it is much cheaper than going to a studio, and since I am not a professional musician, and I figured a lot of takes might be required, this was a much better alternative.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Knight",
      "helpful_votes": 0,
      "publication_date": 20140613
    },
    {
      "title": "Zoom ZH4N Handy Portable Digital Recorder",
      "text": "I have this as an added feature to recording musical acts as part of my video/stills business. I performs great atop my camera, or even mounted on the side, depending on the room and its source to record. Easy to see controls and viewing is good until the display turns off, which helps to control the battery drain, but make for poor adjustments, too. Easy to use and figure out, sturdy and reliable. I use this as a directional mic, either at a 90 or 120 degree area to record. I also use the H2n on stage for an ambient sound, and mix all 7 tracks in my audio editor for an outstanding sound on my videos!",
      "rating": 5.0,
      "verified": true,
      "author": "David Winarchik",
      "helpful_votes": 2,
      "publication_date": 20130909
    },
    {
      "title": "DON'T BUY THE BUNDLE, BUY THE H4n PRO ALONE",
      "text": "The h4n pro is great... the onboard mic is quite hissy but the pre amps are super quiet. Don't be fooled like me and stay away from the bundle. The lavalier mic can't be used with the H4n... i can't undestand why amazon permits this behavior... i guess they can't sell that unsable mic alone so they try to ship it with the H4n pro, so i'm giving 3 stars only for that.",
      "rating": 3.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Old Trusty - Built like a Tank!",
      "text": "I’ve owned my recorder for over 4 years now and I can say with absolute certainty this is the most reliable piece of gear I’ve ever owned. Aside from the rock solid reliability, the preamps record clean, low noise audio. Sure the menus and buttons are a bit dated now, but oh can do better than this guy (expect maybe the updated model).",
      "rating": 5.0,
      "verified": true,
      "author": "Ra Tier Eir",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Only complaint is that the battery life is not as good as the rival Tascam DR-40",
      "text": "So much functionality packed into a portable package - no regrets at all and didn't realise you can record using both XLR inputs and the 1/8\" input at the same time so I can record up to three different devices at once. Only complaint is that the battery life is not as good as the rival Tascam DR-40, but that does not include an audio interface or the ability to record from both the XLR inputs and the 1/8\" input.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20161226
    },
    {
      "title": "Great recorder for music and film work",
      "text": "This recorder was easy to use, recorded much better audio than my dslr camera, and allowed me to place the mic in various locations when recording audio vs having it on my camera",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "4 channel recording",
      "text": "I'll probably never exhaust the possibilities with this recorder, but it does all I want it to do. 4 channel recording allows me to mike my piano with the onboard microphones as well as 2 Samson CO2 microphones. It captures the full brilliance of my instrument. There are no hums to filter out, just beautiful sound.",
      "rating": 5.0,
      "verified": true,
      "author": "DJB",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Great podcast recorder!",
      "text": "Has many different functions and features. I've been using it to podcast for a month now and it works phenomenally well. Runs down batteries fairly fast, but a fair tradeoff for the sound quality. I simply use rechargeable AA batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "S.N.",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Professional tool, Very good for Price:",
      "text": "The Zoom H4N multitrack Recorder is very good. I've done a few tests but have not used it for production to date however, its responsive, easy to navigate and the audio recording tests I've done suggest it will be ideal for my video production purposes. It is a little bulky but I do like the screen size and the rugged exterior finish. I'm still working through the instructions but the inclusion of phantom power is a real plus. Headphone playback is accurate and its easy to navigate the file system.",
      "rating": 4.0,
      "verified": true,
      "author": "Ron Rodger",
      "helpful_votes": 0,
      "publication_date": 20150920
    },
    {
      "title": "Fantastic for doing live interviews",
      "text": "Bought two of these for doing live interviews at a conference, that would then be used for podcasts. They worked flawlessly. And the unit is easy to understand and use. Bravo!",
      "rating": 5.0,
      "verified": true,
      "author": "Urban Fanta-Seer",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "As a giging musician and head of the piano department at a local college, this is very helpful",
      "text": "This is a great, handy tool for a musician. The recording quality is surprisingly very high with a great number of features and adjustments, and it can get even better when you hook up professional microphones to it. It records directly to an SD card, making file transferring very simple. It can also be hooked up directly to an instrument, like a guitar or electric keyboard, and record what you play (without the room noise.) This records such a high quality sound in such a portable way that you can't pass this up if you need a recording device. It's the best thing after an actual recording studio.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah L.",
      "helpful_votes": 0,
      "publication_date": 20131214
    },
    {
      "title": "This thing is awesome!",
      "text": "Pros: 1) records excellent audio through built in mics 2) records excellent audio through all the inputs and is very portable and versatile. 3) I love the 4 track ability and the effects built in to the device. I can record multiple things in less time especially when I'm just messing around to get a feel for a song 4) comes with a memory card and batteries so it was ready to go out of the box. Cons: 1) battery life is weak 2) built in mics have to be placed very well so not to pick up other noises and only what you want.",
      "rating": 5.0,
      "verified": true,
      "author": "eatablog",
      "helpful_votes": 0,
      "publication_date": 20130402
    },
    {
      "title": "A Great Recorder for a Budget",
      "text": "I used an older model of a H4N Pro during my High School years for video projects and is a great way to recorder audio. Though it has a microphone on the top of the H4N, it's recommend to buy a XLR cable Microphone for the BEST quality audio. Many ways to recorded and straightforward instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "E7",
      "helpful_votes": 0,
      "publication_date": 20170503
    },
    {
      "title": "Great just as expected",
      "text": "I believe Zoom is the de-facto standard in standalone audio recording. This recorder captures very clean audio with minimal artifacts or hiss. I'm surprised how sensitive the on board microphones are. You can also attach three devices of your own. Of course you can fine tune your volume settings as well as set your file output settings. I may pick up another one as multiple recorders do come in handy for larger video productions.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan French",
      "helpful_votes": 0,
      "publication_date": 20161025
    },
    {
      "title": "Versatile",
      "text": "I bought this to use as a recorder for my 3DIO FS XLR and it works amazingly! The monitor is my favourite feature as someone who does ASMR and enjoys the sounds of it myself. Used alone, the Zoom H4n mics give a pretty crisp sound. This was confirmed by many friends I called while using this as my input microphone.",
      "rating": 5.0,
      "verified": true,
      "author": "shota",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Absolutely love this unit",
      "text": "Use this for double duty...first of all, it makes a good digital interface for a computer. I use this quite often to hook up a mic or straight line in a guitar cable, to hook up to my Mac for Garage Band. It allows me to record two different inputs at the same time. No latency issues at all. And, as a separate recorder, it works great for that too! I've used it with external mics, with its built in mics, and with both (for 4 channel recording) and everything about it has exceeded my expectations. The interface takes a little getting used to, but once you know your way around, this works wonders.",
      "rating": 5.0,
      "verified": true,
      "author": "RandyG",
      "helpful_votes": 0,
      "publication_date": 20131228
    },
    {
      "title": "My input is not giving me that neat sound it should produce.",
      "text": "Good day I have tried different settings on my zoom h4npro it seems the input is not recording my sound to the standard it surpose to record from day 1 I received the recorder.",
      "rating": 1.0,
      "verified": true,
      "author": "Enegide C.",
      "helpful_votes": 2,
      "publication_date": 20190916
    },
    {
      "title": "Worked ok, but not the greatest quality",
      "text": "Used this to record podcasts. The quality is raspy and highly dependent on background noises. Do not recommend unless you are on a tight budget.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer Sun",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Doesn't come with a power cable for phantom power use",
      "text": "Out the gate, I was just excited to receive the Zoom h4n. The one downer for me was the fact that no power cable or memory card came with this unit. Overall, it's a sturdy sound recorder, works as it should, very sensitive to audio for sure. It's a good buy for someone who takes audio seriously and wants a piece of equipment for 3-5 years on a low to mid level budget with the intent to level up later. Totally worth the price!!",
      "rating": 4.0,
      "verified": true,
      "author": "Alexander",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "NPR Satellite Office",
      "text": "I volunteer for my local NPR station writing/recording/editing PSA's. Originally, I would book studio time, then bring the files home for editing. One time the studio was booked solid, I had a hot PSA to record, so the station manager put me into an eventual studio (now a catch all) with this little gem. I was amazed at the sound quality, immediately bought one on line, and now do most all of my volunteer work from the comfort of my own home.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick, Gallup, NM",
      "helpful_votes": 0,
      "publication_date": 20140419
    },
    {
      "title": "Extremely handy piece of equipment!",
      "text": "I love everything about this recorder except maybe the kind of old interface but that is maybe because it is not the latest model available. Nevertheless, it is just perfect for my needs. I take it everywhere and I use it all the time, with my cameras, with external mics and even to record street or nature sound clips. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Henry",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "very good product",
      "text": "I use this for recording audio and enhancing video sound it works really well and I would buy again but if you can afford it you should go with the H6",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "I love this recorder",
      "text": "I love this recorder. The quality is crisp and clear. I'm working on a sample pack with it and I'm very happy with it. The price is great too IMO.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "Overpriced garbage",
      "text": "Buy the Tascam DR40. Reading so many people having hardly used theirs and this model just stops working. Mine stopped working after light use...it still looks new. Garbage product!",
      "rating": 1.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Awesome Recorder",
      "text": "Jumping from the h4n to the h4npro super simple but extremely satisfying.. great quality sound... extremely easy to use and operate with a rode mic or any other external mic system",
      "rating": 5.0,
      "verified": true,
      "author": "A Darby",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "One of the most useful SD recorders around",
      "text": "This small portable SD recorder works great. Being able to record as wav or mp3 is nice. The built-in microphones are surprisingly good. The xlr and 1/4 phone inputs also are helpful. The compressor for voice level fluctuation helps avoid distortion in situations where levels change quickly. This is an excellent recorder to complement video recording or use for podcasting. Move the files to your computer via the SD card and a USB SD card reader. Be aware that using phantom power for mics when operating on the AA batteries will limit their runtime. If you can run on the AC adapter when using phantom power over xlr, that is best.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Brand",
      "helpful_votes": 0,
      "publication_date": 20150519
    },
    {
      "title": "H4n",
      "text": "Excellent recorder. I have both the older H4 and this H4n. The only difference I've seen is that my older H4 seems to work better as the sound interface to my computer. Apparently there are issues with AMD processors on laptops with the newer H4n. Also, registering and unlocking CUbaseLE which comes with the recorder was as royal pain. I did get it unlocked though on it works great on my computer. If you're a musician you can't go wrong with this recorder and the included sound processing software that comes with it. I use this every week. I think the newer H4n on auto rec level records better then the older H4, although both of them are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Astronomy buff",
      "helpful_votes": 0,
      "publication_date": 20101020
    },
    {
      "title": "I had kept this in great condition and have been very careful with it",
      "text": "I had kept this in great condition and have been very careful with it. Unfortunately it stopped working after a year and a half. It was awesome while it lasted though. I used it to record my band practices so I could go home and analyze the music. It went through batteries quickly though, so it's good to have rechargeable batteries for it.",
      "rating": 2.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20160512
    },
    {
      "title": "Fantastic",
      "text": "This thing is simply a beast. Does everything I need it to, a year-plus later I haven't outgrown it yet. Highly recommend as a rock solid, quality recorder for newbs to intermediates to semi-pros and even pros. Can't go wrong here. Even the battery life is great.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Highly recommended if you're looking to step up your video production/editing.",
      "text": "Sound is such a critical component of professional looking video. I've really enjoyed using this unit. Works well and picks up sound you might not otherwise consider in your video production. Huge step up from the typical mic that comes embedded in your camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Wade Radcliffe",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Music for the Years & Ears",
      "text": "Been wanting this type of device for years! Could be a bit more user friendly, easier to use. Instructions could be more illustrated and in much more understandable.",
      "rating": 5.0,
      "verified": true,
      "author": "Chad Hallman",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Won’t go wrong with this recorder!",
      "text": "This unit is amazing. I returned the Tascam DR40 due to it not staying on. This has had no issues at all. Sound quality is great when recording. I use it for wedding videography, hook directly to the mixer and record the reception. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Cruz",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Best for entry level user",
      "text": "professional sound quality. Best for entry level user. Many great features such as built-in low cut filter, compressor and limiter. 2x XLR input + built-in stereo microphone + 3.5mm stereo microphone input makes it a pretty extendable recording device. Okay for smaller scale production such as garageband, mini concerts, small events, news gathering, interviews, documentaries and lectures. I have used it as a backup device for feature films as well. It does a great job as a secondary unit.",
      "rating": 4.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20150822
    },
    {
      "title": "Could not be happier with anything else",
      "text": "The versatility and quality of this product blew me away. It is so useful in many ways and quickly has become an indispensable part of my setup. Excellent audio quality all around and has so many uses and gives me options of how I want to record anything at any time. My only complaint is the startup and card formatting times, but it's not TOO much of a big deal. Doing anything on the actual device is kind of slow, but the benefits far outweigh the cons.",
      "rating": 5.0,
      "verified": true,
      "author": "Red",
      "helpful_votes": 0,
      "publication_date": 20151220
    },
    {
      "title": "and start enjoying this fine recorder. I use it for video interviews of ...",
      "text": "Read the manual over, glean from it what you need, and start enjoying this fine recorder. I use it for video interviews of celebrities, indoor and outdoor concerts and events, and the only time I had a glitch, it was caused by operator error - not the unit itself. Would easily buy another if I had need for one, but this works just great for me. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Cowboot",
      "helpful_votes": 0,
      "publication_date": 20170520
    },
    {
      "title": "Professional quality recorder",
      "text": "I record podcasts, I could not be happier with this recorder, although I use an external XLR microphone I was surprised by the quality of its built-in microphones, I use rechargeable batteries, if you want longer battery life use alkaline batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "Fran Bego",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "It records really good quality, and very portable",
      "text": "I've gotten so much mileage out of this. It records really good quality, and very portable, you really can't beat it for the price too. Update (8/27/15) I run a contemporary classical music festival for 4 years now. Me and my program directors (3 of us total) all have one of these and used all 3 of ours to record the last concert so we could get sound from many angles and mix the tracks together. Came out wonderfully!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth K",
      "helpful_votes": 0,
      "publication_date": 20150204
    },
    {
      "title": "Songwriter's Listen Up!",
      "text": "This thing is great. I was a little hesitant because I really wasn't familiar with the company, but this product exceeded my expectations. In fact, it's the best thing I've bought so far. Easy file management for verses, choruses, etc. The microphones are outstanding, but to facilitate my songwriting for time management I use a twenty five dollar sony clip on microphone and a woody magnetic pickup for my acoustic, and place the recorder on a mini camera tripod for which its designed, you can lay in bed and write away, if you're serious about songwriting you really need this or something similar, great product five stars all the way!",
      "rating": 5.0,
      "verified": true,
      "author": "kelly w rose",
      "helpful_votes": 0,
      "publication_date": 20140316
    },
    {
      "title": "Just what I needed",
      "text": "I first bought the Zoom H1 and loved the quality and ease of use. The external mics are the same on this one but it has so many great features I now use the Zoom as a backup for emergencies. Or when I want something very lightweight. What I love the H4N for is the big display so you can easily see what is going on. It is heavier and larger and that isn't a bad thing. You won't be in danger of losing it somewhere. I have yet to do multi-track recording but for voiceover, interview with an external lav mic and for music this has been great.",
      "rating": 5.0,
      "verified": true,
      "author": "jlabel",
      "helpful_votes": 0,
      "publication_date": 20140430
    },
    {
      "title": "A must have",
      "text": "Ahhhhhh man what can I say... get it if your in to videography and doing interviews or capturing great sound clips bc this will definitely take you to another level of post.",
      "rating": 5.0,
      "verified": true,
      "author": "Micah",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Excellent recorder",
      "text": "I bought the H4n to replace a missing H2n. This is a larger, heavier unit with better, more intuitive controls. I'm not wild about the way Zoom handles some of their menu functions, but I guess it's just a matter of getting used to it. Other reviewers have provided excellent information on the pro's and con's of the H4n. It's clearly a quality piece of gear. I've also purchased a Zoom H1 which is a much smaller, highly portable, inexpensive recorder. At ninety nine dollars, it is also a sweet unit when small size and being inconspicuous is important.",
      "rating": 4.0,
      "verified": true,
      "author": "Arlcrane",
      "helpful_votes": 3,
      "publication_date": 20110417
    },
    {
      "title": "This is a great product. I am professional video creator and have ...",
      "text": "This is a great product. I am professional video creator and have used a Zoom H4N for years. This Pro version does actually have a better pre-amp for less noise. This is probably one of the best little products I've ever used honestly. I think I lot of love went into the design. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160901
    },
    {
      "title": "Sound recorder",
      "text": "This device is very easy to operate, The sound quality and setup are not complicated AAA+++++",
      "rating": 5.0,
      "verified": true,
      "author": "Luis G Coreas",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Kind of low tech, clunky to use",
      "text": "Not too impressed with usability of this device. I paid a decent amount just for the portability, but its not worth it. Operates like a 90s era device.",
      "rating": 3.0,
      "verified": true,
      "author": "Alex W.",
      "helpful_votes": 0,
      "publication_date": 20190330
    }
  ],
  "product_meta": {
    "title": "Zoom H4N Handy Portable Digital Recorder - 2009 Version",
    "description": "style:H4n (2009 model)Zoom H4N Handy Portable Digital Recorder",
    "rating": 4.6,
    "feature_bullets": [
      "Onboard X/Y Mics: High quality with easy to set selectable recording width (90 and 120 degrees)",
      "2 XLR/TRS Inputs: Connect mics, instruments, and line level devices for added possibilities",
      "24-bit/96kHz Recording: High resolution audio",
      "Expanded Capabilities: Built-in effects, audio interface mode, and onboard speaker make it the recorder of choice",
      "Included Accessories - old version: 2G SD card, power adaptor, microphone adaptor clip, foam windscreen, plastic case, USB cable, 2x AA batteries, Cubase LE, manual."
    ],
    "specifications": {
      "Item Weight": "9.9 ounces",
      "Product Dimensions": "2.87 x 6.15 x 1.38 inches",
      "ASIN": "B001QWBM62",
      "Item model number": "ZH4N",
      "Batteries": "2 AA batteries required.",
      "Customer Reviews": "4.6 out of 5 stars1,886 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#406 in Musical Instruments",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 28, 2009",
      "Size": "Recorder",
      "Battery type": "Alkaline",
      "Standing screen display size": "1.9"
    },
    "categories": [
      "Portable Recorders",
      "Studio Recording Equipment",
      "Musical Instruments"
    ],
    "price": ""
  }
}