{
  "website_summaries": [
    {
      "verdict": "Stands out among its competitors for gas-reducing design.",
      "pros": [
        "A popular design that reduces tummy issues with its patented internal vent construction",
        "Wide design mimics natural breastfeeding"
      ],
      "cons": [
        "Tends to leak when when shaken, making mixing formula in them difficult"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "just like others say",
      "text": "I purchase at least 2-5 items a week on Amazon, many are baby items. I have never given a one star, but had to today. These bottles leak, just like others say! Don't buy. But, if you are looking for wide neck Dr. Brown bottles, purchase the newer version called, Dr. Brown's \"Options\" Wide Neck bottle 3 pack 9oz. They do not leak. They have a green tube in the middle, verse a blue. Also, they ounce numbering is blue, not clear. Much easier to read. I LOVE the \"options\" bottles.",
      "rating": 1.0,
      "verified": true,
      "author": "Kathleen",
      "helpful_votes": 30,
      "publication_date": 20170713
    },
    {
      "title": "Why make a great product and forget those who's eyes aren't what they ...",
      "text": "This was a replacement bottle for one that disappeared. My wife thinks Dr. Brown's really help with gas and spitting up. Thats all that really matters right. I agree with her about the the benefits...but as a slightly older first time parent, I can't read the numbers on the bottle without reading glasses! I don't think they could have imprinted smaller, more translucent numerals on the bottles than they have. Heck, I'm sure my son has gotten the wrong oz. to formula ratio because of this. Why make a great product and forget those who's eyes aren't what they used to be. This may be a non-issue for younger parents but for us 40 somethings, these can be frustrating.",
      "rating": 4.0,
      "verified": true,
      "author": "Deborah S. Sears",
      "helpful_votes": 123,
      "publication_date": 20150624
    },
    {
      "title": "Rate zero",
      "text": "I bought three original wide neck bottles and the word “by” on the bottles is different from the picture ,they’re from China and they were not made in USA .These bottles’s nipples have big smell after rinse with warming water. I would like rate it zero.",
      "rating": 1.0,
      "verified": true,
      "author": "A Book Reviewer",
      "helpful_votes": 12,
      "publication_date": 20190117
    },
    {
      "title": "Great for gassy babies!",
      "text": "They're a little more work with all the parts, but worth it if you have a gassy baby. Our baby is so much happier with these bottles and rarely has gas anymore. I tell everyone these bottles were a life changer! I don't understand all the folks who have issues with leaking. They only leak if you don't follow the instructions. Follow the instructions and there's no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Face426",
      "helpful_votes": 9,
      "publication_date": 20170623
    },
    {
      "title": "Do not shake! Stir formula and it won't leak!",
      "text": "I was hesitant to buy these because the reviews said they leaked. And this is my first time buying Dr. BROWNS. My friend recommended them to me because my daughter has acid reflux and was told this brand helps reduce constant spit up. I followed all the directions, which the only thing that was different was STIR the formula instead of shake, because if you shake it, it will leak. So I think most posters who have said that, didnt follow directions. I haven't had any leaks at all and everything came in great quality. And her spit up has been greatly reduced. I wish I would have bought these sooner!",
      "rating": 5.0,
      "verified": true,
      "author": "kgray",
      "helpful_votes": 15,
      "publication_date": 20150813
    },
    {
      "title": "Like if helpful please:)",
      "text": "The is a BIG difference between the blue and the green. CON: -This one has the # see through and VERY small. Its difficult making a bottle at 10am n worst at 3am. -The nipple is also different and a little more difficult for baby to comfortably drink milk. -It doesnt work without the long blue part. Not even to shake milk. If u shake the milk with it, dry milk gets stuck on the top n inside. Pro -eassy to hold -eassy to clean -good size In my opinion, its beat to get the GREEN one. I will be exchanging this once. (Baby is 2 month old)",
      "rating": 4.0,
      "verified": true,
      "author": "Dulce Gutierrez",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Favorite Bottles",
      "text": "This is my 3rd time purchasing these bottles. I have used Dr. Browns Wide Neck Bottles for 3 children and they are by far my favorite brand and style. The wide nipples seem to be the most similar to real breasts and it was a easy transition from breast feeding to bottle (*maybe an initial resistance, but eventually took after a few tries). My children did all have gas, but it did seemed to be less than other brands. The best feature is that the bottles are lightweight enough that my 5 month year old seemed to easily be able to hold it and feed himself when propped on a boppy/pillow/resting chair, leaving me handsfree for all the feedings! SOLD!",
      "rating": 5.0,
      "verified": true,
      "author": "SYK",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "I love Dr Brown's bottles because my baby loves them",
      "text": "I love Dr Brown's bottles because my baby loves them. I used others when he was first born and he didn't eat as cleanly. He would make more noise and choke more, and had more drool coming out the side and I'd have to stop to burp him more. While these have more parts to wash, I'd rather spend my time washing them than dealing with an unnecessarily gassy baby. Once you get routine down on washing the parts, it's a minute out of your day to clean them. I include that bit about cleaning them because that's the #1 question I'm asked when people see me using them; \"how is it cleaning all those parts?\"",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 2,
      "publication_date": 20180403
    },
    {
      "title": "Amazing for thicker fluids or babies with reflux!",
      "text": "Our little one has been drinking formula mixed with oatmeal cereal since she was 2 months old. These bottles are phenomenal for allowing the thicker fluids to pass through & the blue venting pieces inside do a great job in reducing the amount of air during her feedings so her spit-up, hiccups, & reflux are almost non-existent! Bought these after calling & speaking with a rep at Dr. Brown's for their advice on where to go from the smaller 4oz bottles. Would not buy any other bottle now!",
      "rating": 5.0,
      "verified": true,
      "author": "MEMomma",
      "helpful_votes": 3,
      "publication_date": 20171124
    },
    {
      "title": "Love love love these!",
      "text": "My son has a feeding issue and has to have his formula twice as thick as normal babies, which means lots of added cereal to his bottles. It was making it hard for the formula to make it through the Dr. Brown's slim bottles so we thought we'd go out on a limb and try the wide-neck bottles. WE LOVE THEM! They work wonderful for us. They don't leak, they are easier to clean, and they are honestly easier to hold! The only issue I have is that the numbers on the bottle are clear so it makes it a little more challenging to see. But other than that we love these bottles! Would definitely recommend making the switch!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Patterson",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Great quality and system.",
      "text": "We love them. The Wide Neck bottle are much larger than the original ones I used on my last son. It took a little getting used to. WE got these b/c we are also breast feeding and they were supposed to be better for breast feeding babies. I dont know about that part. The nipple seems the same as the original ones to me. Just the bottles are huge! Kinda wish we'd just gotten the regular sized ones. But the quality is awesome. Dr. Brown's has always been my favorite for many many years. Love their system.",
      "rating": 5.0,
      "verified": true,
      "author": "Barnett",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "I'm so glad I bought these bottles",
      "text": "I'm so glad I bought these bottles. I am unable to breastfeed and he has been so incredibly gassy for the last three months. We have tried so many bottles that claim to help with colic and gas but they never work. The nipple flow is always too fast even if it is the smallest size. He loves these bottles and likes that he can go his own pace. We now have very little gas issues! The only thing that drives me nuts about these bottles is that I clearly cannot see the measurements. They are so hard to see!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20170209
    },
    {
      "title": "Soo disappointed",
      "text": "The nipple fell inside the bottle while my baby was feeding and when I noticed It she and the whole bed was wet. My baby is 10 months old and can hold her bottle on her own and while i was making her bed she was supposed to drink her milk instead it all spilled and i am very disappointed as this was my pumped milk and I don’t have more milk for her.. it isn’t just money that I waisted. I just received this bottle today and definitely won’t use it ever again.",
      "rating": 1.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Excellent Quality",
      "text": "These are the only bottles that my son would drink from and I didn't have to burp him every ounce. The wide nipples seemed to be more comfortable for him than the standard bottles. However, make sure to use the scrub brush to clean out the hole in the center of the white \"straw\" attachment. I soak the bottles overnight in very hot water and clean them in the morning. I noticed that they can get really slimy so make sure to clean them in every nook and cranny.",
      "rating": 4.0,
      "verified": true,
      "author": "Brooke Erin Shufflebotham",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "I Wouldn't Use Anything Else for My Baby!",
      "text": "I still believe that these bottles are the best and the ones least likely to give a baby extra air. My daughter never had issues with gas or colic, however I don't know how much was these bottles and how much was just her. I wasn't willing to test out different bottles to see. I think the wide neck is better than the regular as my friends with the regular bottles all see to have leaking issues. We occasionally have leaks, but not like they do. The biggest con is all the parts to wash, but I'd rather wash those than have my baby get bad gas!",
      "rating": 4.0,
      "verified": true,
      "author": "RA523",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Cannot mix formula in these bottles",
      "text": "All DB bottles I have purchased are great with the exception of this version. I found then to be cheaper in construct and when using cap and disc, shaking bottle to mix formula was a disaster, formula flew everywhere. Again, I stand by DB product, just not this cheaper version. Spend a few extra bucks, get the $22 pack and save yourself the money of having to throw these bottles out, which is what i needed to do in this case. All other bottle I own are DB - so I remain loyal!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jam",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "We love dr Brown!",
      "text": "Dr Brown is all we used with our first! Decided to switch to the wide nipple for baby #2 on the way because the original nipple was too small for my breastfeeding baby!",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia",
      "helpful_votes": 5,
      "publication_date": 20180510
    },
    {
      "title": "All they do is leak",
      "text": "The bottles leak. I bought two different sets of these bottles and both leak. I tried to contact the company to get help with the issue. I was assuming I assembled them incorrectly and was causing the leak. I have waited 2 weeks for response and nothing. I'm done with these bottle. I bought them based off my aunts recommendation, as she is a NICU nurse for the hospital. These are a big disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "D.D.L.Santos",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Not recommended for newborns",
      "text": "We got these based on Amazon reviews. Our son came 11 days early. The pediatrician and lactation consultant both agreed the wide neck bottles have too much of a natural flow. Our son ate too quickly and spat up milk. I'd recommend getting the narrow neck bottles with the preemie nipples for newborns. Our son is eating slowly and with minimal spit up with the narrow flow bottles and preemie nipples.",
      "rating": 2.0,
      "verified": true,
      "author": "etranwong",
      "helpful_votes": 5,
      "publication_date": 20170311
    },
    {
      "title": "The only bottle I'll use from now on",
      "text": "I absolutely love these bottles they are the first ones I found that my baby doesn't choke on or swallow too much air they are a little more expensive than your average bottle and the parts are kind of fussy to clean but as I read it another review a fussy bottle is better than a fussy baby",
      "rating": 5.0,
      "verified": true,
      "author": "rebekah",
      "helpful_votes": 7,
      "publication_date": 20161219
    },
    {
      "title": "These bottles are TERRIBLE.",
      "text": "These bottle are TERRIBLE. 1. They leak. Everywhere. In large amounts all over your clothes, the baby, the furniture. You lose at least an ounce at a time. 2. THEY DONT FIT SPECTRA FLANGES!! Why make a wide neck bottle if you're not going to make them compatible with sprectra flanges???!!!! This was the only reason I bought the wide neck in the first place. I like the skinny Dr. Browns but we're probably going back to Avent. I hate these bottles.",
      "rating": 1.0,
      "verified": true,
      "author": "Kaitlin Purdham",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Double Check That It's The Right Nipple!",
      "text": "2 stars because when it works, it works well but: I bought this twice now. first time - no problem. second time - I received 3 nipples that are closed (see attached pictures) and defective. the left picture is the defective nipple and the right picture is what the nipple is supposed to look like. pretty unhappy with the inconsistency of the products!",
      "rating": 2.0,
      "verified": true,
      "author": "Kaninta Hill",
      "helpful_votes": 2,
      "publication_date": 20190328
    },
    {
      "title": "Random leakage in otherwise good bottles",
      "text": "I like those bottles because of the vent and because we think it's important to use if your baby suffers from colic, however... They leak sometimes. We figured they leak if the vent or rather the rubber end of it is a tad wet when put back together, even if it's just one drop, it's enough. But sometime it will leak while sitting in the bottle warmer too. When the formula heats up and steam go up, milk will literally start pouring out from under the cap and into the warmer! Not something I want to deal with when holding a crying, hungry, hysterical baby.",
      "rating": 3.0,
      "verified": true,
      "author": "Mory",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Good bottles. But it kinda takes time to wash ...",
      "text": "Good bottles. But it kinda takes time to wash all the tubes and clean up all the holes, and it takes more time to dry them. The ventilation design is cool, but need to be careful when heating the milk in bottle warmer, you need to take out all the tubes, otherwise the milk will flow out through the ventilation tubes. My hubby has wasted a lot of my milk forgetting taking them out...",
      "rating": 4.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 2,
      "publication_date": 20171018
    },
    {
      "title": "Good bottle but one did leak",
      "text": "Our newborn lost over 12% body weight while in the hospital, and our lactation consultant suggested we supplement with pumped breastmilk and formula to get her weight up. She recommended we get a wide neck bottle to help our little one transition easier between breast and bottle. Our daughter is currently 2 weeks old and has had no issue going back and forth between the two, which is exactly what we were hoping! We haven't had any issues with gas or fussiness and these bottles are fairly easy to take apart and clean. I would have given this product 5 stars, but one of the bottles has a hole in it, and started leaking milk everywhere.",
      "rating": 3.0,
      "verified": true,
      "author": "Tania",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Great but leaks!",
      "text": "This is my first set of bottles. Seems to do the job well enough but my only complaint is that it leaks and I don't know where the leak is coming from. I tighten is as much as I can but it still leaks here and there. Otherwise, good product and does the job well. My daughter doesn't seem to have any complaints about gas. The wide neck feature of the bottle makes it easier and cleaner to put powdered formula in.",
      "rating": 3.0,
      "verified": true,
      "author": "Azumi",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Hands down the best bottle for a colicky baby",
      "text": "Hands down the best bottle for a colicky baby! Helped my little one tremendously! She sleeps through the night now! So so so happy that I took a chance with these bottles (I've tried the nuk, playtex, medela bottles) the nuk wasn't too bad..but still caused issues...then I ordered these and now this mama gets some sleep! Oh...and don't listen about the rave of how cleaning is such a problem/issue, it's soo easy' takes a extra 30 seconds if that! Good luck mamas!",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla",
      "helpful_votes": 2,
      "publication_date": 20170504
    },
    {
      "title": "it is much better to feed",
      "text": "Difference between standard bottle on this is nipple ,height and marking (measurement).Wideneck nipple is little harder and it has some stoppage on mouth, it is much better to feed. Wider and shorter height is making big plus on easy to hold and feed. But Marking(measurement) is harder to read even on day light that need to be change. Sometime this bottle can leak for no reason at all. I can live with this all the cleaning and assemble bs my baby get easier on feeding and less spit up and colic.",
      "rating": 5.0,
      "verified": true,
      "author": "bluenavy",
      "helpful_votes": 0,
      "publication_date": 20161126
    },
    {
      "title": "DO NOT BUY!!!!",
      "text": "At first I loved these bottles. I read reviews and most said 1 of 2 things. 1.Gets rid of gas(which was what I needed for my son) and 2.They leak. I kept thinking maybe the people writing they were leaky just didn’t know how to properly assemble. Boy was I wrong. They leak every single time. And yes the lid is tight and even my fiancé has them leak on him. It takes 10 minutes to make a damn bottle. By the time I’m done my kid has taken in so much air from screaming that the bottles only redeeming quality(eliminating the gas) is basically useless. I wouldn’t recommend these to my worst enemy.",
      "rating": 1.0,
      "verified": true,
      "author": "Aubrey E",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Great bottles, especially for breastfed infants!",
      "text": "Only bottles we have used with our breastfed son. Love them. No problems with leaking (we don't use the dishwasher. Always just soak in hot, soapy water and then scrub parts with a bottle brush). If breastfed, recommend sticking with premie flow nipple or Level 1 nipple, so that they don't develop a preference for faster-flowing bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 2,
      "publication_date": 20170810
    },
    {
      "title": "Great brand, not their best bottle",
      "text": "We love Dr. Brown's bottles. These are pretty standard. I will say, we have a bottle warmer where you submerge the bottle in water. The bottles have overflowed into the warmer when the lid is left on them. My other Dr. Brown's bottles don't do this (they have a different setup). My only other complaint is the numbers are clear and it makes it hard to see what the milk is at in the bottle. Taking those two things into consideration, once you get past the learning curve, the bottles do what they need to do! I would probably just get the same brand with the measurements in a text you can see.",
      "rating": 5.0,
      "verified": true,
      "author": "Alaina",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Great Bottles!",
      "text": "Great bottle, we were using Lanisoh bottles when I was breastfeeding but have since switched to formula. These bottles are amazing for spit up, gas, and colic. I was able to stop my little guys reflux medication when we switched to these. I prefer wide neck bottles, and it is especially nice for formula feeders, no more powder on the counter tops! Missing a star because the travel caps included cause leaks, so we purchased some screw ons.",
      "rating": 4.0,
      "verified": true,
      "author": "SR1618",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Great Bottles, Terrible for reading Volume.",
      "text": "The bottles work great. The biggest flaw is that they have clear embossing for the volume markers. When it is 2 AM I don't want to have to squint and catch the right light to see how many ounces the kiddo drank.",
      "rating": 3.0,
      "verified": true,
      "author": "Jason DeBoer-Moran",
      "helpful_votes": 10,
      "publication_date": 20170221
    },
    {
      "title": "I love everything about these bottles except for the fact that ...",
      "text": "I love everything about these bottles except for the fact that they leak. I’ve tried all of the different sizes and types of Dr Brown bottles and I’ve had the same issue with each one. I thought that maybe they were starting to leak because they were a few months old, so I purchased a new set, only to have them start leaking within three weeks. I called Dr Brown’s customer service, and while they were nice, I was told that “not all babies are the same”. Not sure how that matters. I can hold a bottle upside down without a baby anywhere around and it’s still going to leak.",
      "rating": 2.0,
      "verified": true,
      "author": "erica",
      "helpful_votes": 2,
      "publication_date": 20171212
    },
    {
      "title": "They work okay I guess",
      "text": "Edited to say these bottles leak. I bought these because we needed a few bottles to send to daycare. We use the Dr. Brown's Options wide neck at home. These were cheap so I got them. As long as the nipple was the same as the others we use, I didn't care how nice they were. They work well. I took away a star because as other people have mentioned, they are really hard to read. Clear writing on clear bottles is a bad idea.",
      "rating": 2.0,
      "verified": true,
      "author": "StarDust",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "The blue bottles work best!!",
      "text": "Don’t waste your money on the new green Dr. Brown bottles because they leak after a while of use. The blue are the best ones. The vent isn’t the funnest to clean but it helps my baby be less gassy and that’s worth it to me!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandie P.",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "Loved them until they started leaking everywhere.",
      "text": "We loved these bottles when we first got them. They really helped limit air intake for our babies, and they seemed happier once we started using them. Flash forward 4 months and they are LEAKING everywhere. We have tried drying all of the parts before assembling them, to no avail. It gets worse when you use the bottle warmer too. We are currently looking for a new bottle brand to use because I can't deal with the leaking anymore. There is nothing more annoying than getting formula all over the place during a 3:00am feeding........ Also, washing all of the parts gets exhausting after a while.",
      "rating": 3.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20161123
    },
    {
      "title": "A Life Saver",
      "text": "These bottles solved our problems! Our baby was beginning to suck down bottles really fast and developed a lot of gas in the process. She got to the point where she couldn't sit through a feeding comfortably and was definitely bothered by it. We tried Dr. Brown's on a recommendation and it was a world of a difference. It forced her to slow down and she wasn't taking in a lot of air. Now she drinks comfortably in our arms as we feed her. These wide bottles are great too for pouring in the formula. The narrow ones make it tricky and its easy to spill. Highly recommended and we will definitely be using these for our next baby.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew Sullivan",
      "helpful_votes": 2,
      "publication_date": 20160213
    },
    {
      "title": "We like the less air and slow flow",
      "text": "Our baby swallows a lot less air when feeding from this bottle. The other plus for us is that it is as slow-flow as natural breastfeeding. I feed her breast milk from the bottle, and other kinds are way too fast - she is done in five minutes, and thus does not get full satisfaction from the feeding, even when she has enough food in her belly.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "On kid #4 and these have been great",
      "text": "I have four children and all four have been weened on Dr. Brown's bottles. With our last child we decided to go exclusively with the wide-mouth bottles because they're just easier to pour powdered formula into and mix. They are a little tedious to clean but I can confirm the claims that they help control gas and colic. Really love these products.",
      "rating": 5.0,
      "verified": true,
      "author": "MiamiMe",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Every great but they leak!",
      "text": "These are alright. I like the size and shape. My gripe is with the lids and the mechanism built in the inside. The lids don't fit tight and they tend to leak a lot even with the internal pieces in. Don't even think about leaving those pieces out though. Without the internal pieces these leak like a banshee. For my older child the internal pieces don't seem necessary, but they are to avoid her wearing half a bottle of milk to bed.",
      "rating": 3.0,
      "verified": true,
      "author": "JeronimoHIllam",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Good for baby and to help gas, they are hard to clean",
      "text": "This is the easiest bottle for our baby but they take time to clean. They do help reduce gas as air cant be sucked in easily. Warning: they can leak easily if everything isn't assembled 100% correctly. Luckily they come with little brushes to help with cleaning.",
      "rating": 5.0,
      "verified": true,
      "author": "MariaJ",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Great!",
      "text": "Really great product and extremely good price. Three of these bottles costs more than this here in NZ. Cost me less than buying here even including the postage. I read the reviews and all the stuff about leaking bottles but have used them and no leaking. I can see that some people would overfill the bottles which apparently can cause leaking as you can only fill to about half the bottle but they seem to work really well. Would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Sally",
      "helpful_votes": 0,
      "publication_date": 20170711
    },
    {
      "title": "Hate It....",
      "text": "i wish i can give zero starts , it is so so so bad , every night my baby is soaking in the milk coz of leaking caused by unknown reason. I used the tall bottles before ,never had this problem , after using this one everyday im regretting . I hate it like anything .....",
      "rating": 1.0,
      "verified": true,
      "author": "Suresh Kollipara",
      "helpful_votes": 2,
      "publication_date": 20180520
    },
    {
      "title": "Almost five stars",
      "text": "These bottles would get five stars if they weren't so annoying to clean. There are way too many parts to clean, but coming from a parent who has tried nearly every other bottle out there in efforts to avoid spending too much time washing, I will admit that the extra time needed for cleaning is worth it given Dr. Brown's really do minimize air in the milk. This, in addition to the slower flow nipples make these bottles a must. Natural vs. Standard bottles: Obviously size is different, but i do like the wider grip on the natural bottles better. The nipple does appear to mimic a real nipple, so that is a plus.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "it's a very good product. because i pump",
      "text": "the only problem with this product is there are SO many parts to wash! other than that, it's a very good product. because i pump, i go through so many bottles per day and extra parts to wash makes it less desirable to use. i end up only using my medela bottles (because i have a medela pump) 95% of the time. the quality is great--nice and thick but the downside is it takes MUCH longer to heat up. again, i stick to the medela bottles.",
      "rating": 4.0,
      "verified": true,
      "author": "jenz",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "Great bottle!",
      "text": "Based upon a recommendation from a friend, these are the only bottles that we have used. Our baby transitions perfectly from breast to bottle with no 'rejection' of either. And, we don't have any issues with spit up! I will say- cleaning 6 pieces/bottle is time consuming... but, seemingly worth it! (We use the Dr Brown's bottle brush)",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20170419
    },
    {
      "title": "Great bottles, except you have to loosen the top ...",
      "text": "Great bottles, except you have to loosen the top when warming milk. Otherwise, the steaming bottle warmer causes milk to be pumped out. This happens with different bottle warmer brands, including the Dr. Brown's warmer. That being said, I have purchased these bottles for all three of my kids and would do it again.",
      "rating": 4.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "Love Dr. Brown's, But These Leak",
      "text": "I love Dr Browns bottles, despite all of the small pieces, but the wide neck bottles leak. I also had this problem with their regular sized bottles, but followed the suggestion of another reviewer who stated to let all of the inner parts dry completely after washing before reassembling, this did the trick with the regular bottles but unfortunately not the wide neck. Also, I think because of the larger surface area of the bottom, when heated, the bottom heats rapidly causing the milk to shoot up the inner tube and leak out of the edges, whether or not you heat in a microwave or on the stove.",
      "rating": 3.0,
      "verified": true,
      "author": "Anthony S",
      "helpful_votes": 2,
      "publication_date": 20141004
    },
    {
      "title": "These became our back up bottles for our son, ...",
      "text": "These became our back up bottles for our son, who seemed to take more to the Avent bottles. They seem to flow a lot faster than others, even the newborn nipples, and even a few months later he'll have a messier meal with these than Avent or Gerber. However, they do seem to help in reducing air bubbles with the feeding and that's a definite plus!",
      "rating": 4.0,
      "verified": true,
      "author": "Meri",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Leaks all the time!",
      "text": "I have purchased other Dr. Brown’s bottles and never had this problem. I don’t know if the problem is with these specific bottles or the lot, but they leak all the time and leave rings on all the surfaces. These are not condensation rings. These are milk rings, as if the bottle leaked from the bottom. They also leak while I feed my baby. Will never purchase again.",
      "rating": 1.0,
      "verified": true,
      "author": "Aura C.",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "cool product..",
      "text": "Heard about this from few of my friends and wanted to try it. And trust me.. I am not repenting at all. This is a perfect bottle for your babies. It absolutely reduces the gas accumulation and congestion in the stomach. Very easy flow and quite easy to hold for my son. He has been using this since he was 6 months old. And this is a bigger one, and is perfectly working since 3 months. Certainly recommend this product. This one comes in a 3 pack, which is perfect for a day and can be washed up in the night for the next day.",
      "rating": 5.0,
      "verified": true,
      "author": "JCK",
      "helpful_votes": 0,
      "publication_date": 20160420
    },
    {
      "title": "So..",
      "text": "So I got these thinking there just like the dr brown ones I already had.. but there not. I just these are blue the older/Different Version and made in China. The other ones I have are green and made in the USA. So.. that’s that. Didn’t really wanna trust bottles from China so I gave them to someone that didn’t care.",
      "rating": 3.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Will deff use and purchase again!",
      "text": "These are great bottles. My daughter has not been gassy since I switched over to these. I love the wide nipples over the regular Dr. Brown bottles. My daughters lips fit comfortably around the wide neck nipple. With the regular size nipple, the whole nipple was in her mouth and I just didn't like the way her mouth fell around it. I thought she may choke. I been using wide neck bottles for nearly a year now and it was the best switch I ever made. Will deff use again!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandie P.",
      "helpful_votes": 0,
      "publication_date": 20161108
    },
    {
      "title": "Highly recommend! Have to have these for a gassy colicky baby!",
      "text": "My baby has acid reflux and colic; was using playtex vent bottles for the gas but switched to these, best bottles ever! The bubbles go away before even getting to her mouth. Easy to clean too. I bought 2 sets!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "8oz makes bottles leak",
      "text": "If your child is drinking 6 oz or less, buy these they'll work great! If your child is drinking 8 oz, like my daughter is now, I would avoid these bottles. They leak while she's drinking half the time and when you put the bottle down it leaks like a fountain. I have to wrap a towel around the base of the cap to keep it from leaking.",
      "rating": 3.0,
      "verified": true,
      "author": "NotSteve82",
      "helpful_votes": 0,
      "publication_date": 20170715
    },
    {
      "title": "They leak no matter what you do!",
      "text": "I bought these bottles for my great grandson. I gave one to his grandmother, one to his mom, and kept one for when he is here. They leak terribly all. 3 bottles leak as soon as you get ready to feed him. The other Skinny Brown bottles do not leak. I think they threw theirs away and I still kept mine but not for long. I would never buy these again! I wish I could return them or something. But I thought I wouod warn others about these bottles.",
      "rating": 1.0,
      "verified": true,
      "author": "Becky Franklin",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Great bottle!",
      "text": "Great bottle that helps with colic. I like the soft nipple that keeps the hard bottle ring off baby's lips. More natural fit (like breast) and you can see when the milk is almost done so baby does not suck air. I have used this brand with 2 babies. I even kept the first ones and bought new ones. I did not mind doing that because they are bpa free.",
      "rating": 5.0,
      "verified": true,
      "author": "Yusuf",
      "helpful_votes": 2,
      "publication_date": 20160429
    },
    {
      "title": "Leaks with sippyy cup nipple",
      "text": "I bought these bottles because I had the supply cup nipples to help my little guy transition from bottle to sippy cup. We love dr browns and they were the only bottles we used throughout his infancy. The y’all skinny bottles gave us no problem, and these wide necked ones have no problems or leaking with bottle nipples on them. Not sure why it leaks with the sippy cup nipple (it’s a dr browns supply cup nipple so it should go with these bottles). Needless to say, we don’t use them for sippy cups and I had to buy other sippy cups for him.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica ratliff",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Happy baby = Happy momma",
      "text": "I absolutely love these bottles! It is the best low flow nipple I can find and due to some issues, a combination of my supply and my baby not latching We had to start him on some formula. Long story short he cannot handle any formula very well even when mixed with breastmilk, but with this bottle he did SO MUCH BETTER. Happy baby=happy momma. Also I saw some comments on the extra cleaning, the pack comes with a brush and it is literally an extra 5 seconds, totally worth s less fussy baby.",
      "rating": 5.0,
      "verified": true,
      "author": "Caitlin Wyckoff",
      "helpful_votes": 0,
      "publication_date": 20160813
    },
    {
      "title": "Love them!",
      "text": "I love these wide mouth bottles!! They don’t leak like I found the newer style of the Dr. Browns bottles to do. My infant seems to like the width of the nipples too. On the regular size bottles her lips will touch the cupplink as she’s drinking. I don’t think it bothers her, but I think the wide mouth seem to mimic the breast better than the regular size bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily C",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Prefer the Original Size",
      "text": "I really like these bottles for both formula feeding and breastmilk. The wide neck allows for easy pouring of formula powder, milk bags, etc. I only have two complaints: 1. They stain easily in the dishwasher. The bottles and parts are all now yellow after a few washes. 2. The size of the bottles makes it harder for a baby to start grabbing onto them. They're really big, much bigger than the standard narrow bottle and I've found it's harder for my baby to really grab onto them the way he would a normal bottle.",
      "rating": 3.0,
      "verified": true,
      "author": "Austin Walsh",
      "helpful_votes": 0,
      "publication_date": 20160106
    },
    {
      "title": "Amazing bottles!",
      "text": "Love these bottles. Here's a tip to make sure they don't leak: Put the parts in tact, and ensure that the top is screwed on tightly. If you take time and assemble it correct, it will NOT leak. If it's leaking, you aren't assembling it right.",
      "rating": 5.0,
      "verified": true,
      "author": "WhatTheJNell",
      "helpful_votes": 0,
      "publication_date": 20170819
    },
    {
      "title": "Great bottles and customer service",
      "text": "I am very impressed with these bottles. I like the wider opening so that powdered formula does not go everywhere at 3 AM when you're trying to fill them. Also, I lost a couple of the plastic caps and could not find where to reorder them, so I called the company. The company was nice enough to send me some for free. I would recommend these bottles they are pretty good for the price. The only issue I have ever had with them is that at my son's daycare they tend to leak in the warmer. Otherwise they're great!",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20160722
    },
    {
      "title": "Major flaw",
      "text": "I love these bottles. However, I gave them 3 stars because the measuring line on these clear bottles is clear. So it's hard to see during the day, and especially challenging at night. Major packaging flaw.",
      "rating": 3.0,
      "verified": true,
      "author": "Alla M.",
      "helpful_votes": 6,
      "publication_date": 20170630
    },
    {
      "title": "Works well when not leaking",
      "text": "My kid doesn't seem to be super picky, but he hasn't had any issues with gas or colic. We have only used these bottles. They are pretty easy to clean and fit easily into the dishwasher. After one month of once daily use, one of our six bottles is leaking from the bottom, resulting in lost milk, possibly contaminated milk, and a very upset me when thinking about the effort that went into pumping for that bottle. Thoroughly inspected the bottle and can't figure out why it's leaking (no cracks). Pretty disappointed and hoping this is a fluke. We otherwise like the bottles.",
      "rating": 4.0,
      "verified": true,
      "author": "CAMONY",
      "helpful_votes": 0,
      "publication_date": 20160704
    },
    {
      "title": "Love these bottles",
      "text": "My son can hold easy and he really attached to the bottle. I must have order 6 of them or close to it. I love Dr. Brown’s bottles. The cleaning it’s okay but I will order again if I need too.",
      "rating": 5.0,
      "verified": true,
      "author": "Cash",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "The Best Part is...minimal spitting up.  The Worst Part is...",
      "text": "...they leak like crazy. I've purchased several extra nipples, thinking I got a bad batch. I've ordered more bottles with the same results. They leak. It wasn't so much of a problem when we were holding him, but when he wants to hold his bottle at bedtime, his PJs get wet or the pillow.",
      "rating": 4.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Awesome customer service at dr browns",
      "text": "The only reason why I cant give 5 stars is because these bottles don't have the inked markings for the measurements. They have what Dr Brown's calls embossed markings. They are clear and during night feedings virtually impossible to see especially when you don't have your glasses on. I wrote to Dr Brown's and they had me return them and gave me a set of newer options bottles that have the inked markings. Dr Brown's has awesome customer service.",
      "rating": 4.0,
      "verified": true,
      "author": "Kim Eldred",
      "helpful_votes": 0,
      "publication_date": 20170214
    },
    {
      "title": "Easy to assemble and was",
      "text": "Can make a HUGE difference for babies who have gas or colic. Easy to assemble and was. Has the ounces/ml written on the side. My newborn has gotten her meals from these bottles since she was just a few days old. Despite the fact that they cost more than the usual bottles, the design of these bottle are genius! These allow the air to travel through the straw looking thing so that your baby isn't drinking air/bubbles and are GREAT for reducing gas and fussiness. Why settle when it comes to your Baby's Health :D",
      "rating": 5.0,
      "verified": true,
      "author": "vjshanky",
      "helpful_votes": 0,
      "publication_date": 20150123
    },
    {
      "title": "No leaking easy to use!",
      "text": "Love these bottles! My daughter was making a huge mess with her tommee tippee bottles as she couldn’t get a good latch and milk would drain out the side of her mouth, not an issue anymore with these bottles! I put all the pieces in the dishwasher everyday and they are holding up fine, also love the wide neck for adding formula! I was hesitant to purchase because of reviews about leaking but we have had no issues at all.",
      "rating": 5.0,
      "verified": true,
      "author": "TBell",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Not a fan of these particular Dr. Brown bottles ...",
      "text": "Not a fan of these particular Dr. Brown bottles. They leak too often, compared to the smaller (5 oz) Dr. Brown bottles. The stem design is different, and it seems this design is inferior. I'd say these leak about 50-60% of the time. I finally just stopped using them in favor of the smaller size bottles that leak far less often.",
      "rating": 2.0,
      "verified": true,
      "author": "J. M.",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "This bottles are a waste of money",
      "text": "I hate these bottles! No matter what we did they leaked. We read several different forms to help fix this and they still leaked! It was so frustrating for both us parents and baby! We followed all the recommendations with no luck.",
      "rating": 1.0,
      "verified": true,
      "author": "Gabriela Hernandez",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "The only bottle you will ever need.",
      "text": "I cannot say enough good things about these bottles. I wish I would have had them from the very beginning. I will definitely use these until we are done bottle feeding and just go up in nipple size. They are easy to clean, have a tight seal, and are a good size for baby to learn to grip. The measurements on the side are clear, small, and hard to see, but the benefits of this bottle definitely make it worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mgvsiren",
      "helpful_votes": 0,
      "publication_date": 20160930
    },
    {
      "title": "Do not buy!",
      "text": "Terrible item. These bottles leak and they overflow when heating breastmilk or formula on them. I love Dr. Brown's bottles, but stick to the original bottle(small neck).",
      "rating": 1.0,
      "verified": true,
      "author": "Alie",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "They don't leak",
      "text": "The newer dr. Brown's bottles with the green stem and then narrow nipple have always leaked on me and never worked. I figured even though the reviews I read said these bottles leaked like crazy I still wanted to give them a try and see if they really did leaked. I haven't had them leak yet I've been using them for months it was definitely a good buy. Great bottles",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie Kestler",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Can't read the ounce markings!",
      "text": "I love Dr. Brown's bottles. I have the glass wide-neck options, the plastic small neck originals, and I just purchased these wide neck originals. On all my other Dr. Brown's bottles, the ounces are imprinted in blue and so easy to read. On these, the numbers are the same color as the bottle and they are nearly impossible to read, especially when filled with formula. I need to see the numbers as my baby is drinking. The fact that I can't makes these nearly unusable in my opinion. I would return if I hadn't already opened the box and used one. I am so frustrated with this small but important detail!",
      "rating": 2.0,
      "verified": true,
      "author": "Randy R.",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Too many compartments to clean",
      "text": "Too many compartments to clean Love these bottles but too many parts to clean... makes for long time spent at the sink..... had to reduce my daughters bottles from 6 to 4 because I was spending so much time just cleaning them.... also started doing more oz per feeding so I could just put extra in the fridge so that I can save wash time.... now that she's in daycare... I spend a good chunk of the evenings washing all four bottles and nipple, and airflow tubs, and vents, etc.",
      "rating": 3.0,
      "verified": true,
      "author": "Ami O.",
      "helpful_votes": 0,
      "publication_date": 20160421
    },
    {
      "title": "Work well although not sure if avoid gas",
      "text": "My 3 month old baby girl loves this bottles (and the narrower version) although I'm not sure whether this is avoiding her to have gas since she is having gas from time to time. At the beginning (2 months old) she was using nipple level 1 and it was pretty hard for her to finish it. Now, however she is doing great with the level 2",
      "rating": 5.0,
      "verified": true,
      "author": "Mª Carmen",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Leaky Bottles",
      "text": "I bought these because the air-flow design seemed like a very good idea. And the good part is that the airflow design works great! The bad part is that these bottles do not seal well and they leak a lot. I haven't been able to determine why they leak, it just seems that the bottle doesn't seal properly when you tighten it all the way up. It does not leak from the nipple, it leaks around the neck of the bottle. If it weren't for this, I would give these bottles 5-star ratings.",
      "rating": 2.0,
      "verified": true,
      "author": "Onesimus",
      "helpful_votes": 0,
      "publication_date": 20151210
    },
    {
      "title": "Does not fit Spectra S2 Pump - Original more compact and will fit Specra S2 w/ Maymom attachment",
      "text": "SUMMARY: BUY THE ORIGINAL NARROW NECK AND IF PUMPING WITH SPECTRA BUY THE $15 MAYMOM ATTACHMENT. PRO: (1) They do the job of a Dr. Brown Bottle -- feed the baby, no gas. CONS: (1) Not compatible with Spectra S2. Original Dr. Brown can fit Specra S2 with a $15 part from Maymom. (2) Original sizing takes up less space in the refrigerator (3) Original sizing is easier to travel with.",
      "rating": 3.0,
      "verified": true,
      "author": "Laura E. Shortill",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Love the wide neck",
      "text": "I used the Dr Brown standard bottles with my son, but my daughter was much more picky with bottles and would take the standard. She gagged on the nipple. I read about using the Dr Brown wide neck with the Lansinoh nipple which she liked. This combo worked perfectly for her. Now that bottle feeding is established, we use the nipples that came with the Dr Brown wide neck. Since I had to go back to work, bottle feeding was a must. These bottles have a wider neck which makes it so much easier to pour the breast milk into. Any mom that pumps knows how precious every drop is!",
      "rating": 5.0,
      "verified": true,
      "author": "KPM1105",
      "helpful_votes": 0,
      "publication_date": 20140321
    },
    {
      "title": "Leas like crazy!",
      "text": "These leak SO bad!!! They leak all over my diaper bag every time! They also spill out in a cooler when you have breast milk. It’s terrible. Also if you shake them after warning to get rid of hot spots you will get milk everywhere. Try Avent anti colic bottles. Same exact nipple!",
      "rating": 2.0,
      "verified": true,
      "author": "KG",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Good bottles. They worked pretty well but are a ...",
      "text": "Good bottles. They worked pretty well but are a pain to clean, especially without a dishwasher. I definitely liked the wide neck bottles better than the originals! These bottles will leak though so they must stay upright. I found that out the hard way all over my brand new diaper bag. I found a different brand that has the same amount of parts but much easier to clean and no special brushes needed. They are also more comfortable to hold.",
      "rating": 3.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20160708
    },
    {
      "title": "Awesome baby bottles",
      "text": "My daughter loves these bottles and now that we are expecting my first grandson we will use these like we did for my granddaughters great brand and babies no gas and the peditration highly recommended them and they are great",
      "rating": 5.0,
      "verified": true,
      "author": "carmen sanchez",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "I have Dr. Brown bottles with the green inserts ...",
      "text": "I have Dr.Brown bottles with the green inserts (starter pack) and bought these as extra to have thinking they were the same. These leak all over, on my baby, in my bag, ugh! I don't know what is different about them but I wish I could return them unfortunately we've tossed the packaging and we've used them already",
      "rating": 2.0,
      "verified": true,
      "author": "Cibi A. ",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "I used to loved Dr. Brown's bottles as my baby used to ...",
      "text": "Bottle started to leak after using Level 3 Nipple. I have a set of 9 bottles and all leaks a lot after switching to nipple #3. I used to loved Dr. Brown's bottles as my baby used to take them so easily. But it is just impossible to use it with #3 Nipples. It leaks A LOT. I gave up using Dr. Brown's with #3 Nipple and at that day I gave my 6 month baby Formula on a regular glass (believe me it was less messy!). Now switch to Avent bottles.",
      "rating": 1.0,
      "verified": true,
      "author": "HENRI",
      "helpful_votes": 0,
      "publication_date": 20160801
    },
    {
      "title": "My baby couldn't get a good latch. I don't know if it makes a ...",
      "text": "Well, all I can say is that each baby is different....for us this wide neck version of the bottle didn't work. My baby couldn't get a good latch. I don't know if it makes a difference but my son is almost exclusively breast fed and only once a week o so need to use a bottle. that may make a difference. however we have never had an issue with the narrow neck bottles.",
      "rating": 2.0,
      "verified": true,
      "author": "johann cuellar",
      "helpful_votes": 2,
      "publication_date": 20150420
    },
    {
      "title": "The only bottles we will use",
      "text": "We tried many different bottles in attempt to ease colic symptoms, wish we had started here! Been using these for a week and our little one is feeling so much better for it. We tried the latch bottle system, was terrible, leaked from the valve on the bottom of the bottle and created serious vacuum resulting in our child taking in more air than milk. We finally found dr. Brown's and we are sticking to it.",
      "rating": 5.0,
      "verified": true,
      "author": "Avidreadervividreamer",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Everything time i screw on a lid it leaks and ...",
      "text": "Everything time i screw on a lid it leaks and I have to re-screw it on. I will not be buying this brand bottle again.",
      "rating": 1.0,
      "verified": true,
      "author": "megan186",
      "helpful_votes": 4,
      "publication_date": 20160516
    },
    {
      "title": "Leaks everywhere",
      "text": "Do not purchase these bottles! They leak everywhere! I am so disappointed with these what a waste of hard earned money! My son is soaked with baby formula every single time he has a bottle!",
      "rating": 1.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "1st time mom",
      "text": "i love my dr. browns prefer these to all the other bottles my daughter isn't very picky on a bottle as long as its feeding her but she doesn't have colic or anything like that and when we feed her we have to try hard to burp her so i would like to think that she isn't getting any air due to this bottle.i gave it 4 stars tho because i pump and use formula and i go thro a lot of these bottles in a day so at the end having to wash all these parts is a bit trying for me. so just keep that in mind when buying these bottles. other than that i absolutely love them.",
      "rating": 4.0,
      "verified": true,
      "author": "l",
      "helpful_votes": 0,
      "publication_date": 20140310
    },
    {
      "title": "These do not fit standard breast pump",
      "text": "I was under the impression these fit standard breast pumps but they do not. However, Dr. Brown's bottles are amazing for reducing gas/air swallowing and no drips/leaks on baby.",
      "rating": 4.0,
      "verified": true,
      "author": "Juju Rafii",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "No leak bottles",
      "text": "I like this bottles. They do not leak as long as you screw the top on correctly. They are a pain to clean. There are a total of 6 pieces that you clean with every bottle. The blue middle piece gets pretty gross (with milk formula residue) but they give you a little thingy to clean it with. I'm not so sure that it helps cut down on spitting up. I think spitting up is a phase all babies go through. Luckily they grow out of it. Around 8 months, my son just stopped spitting up after every bottle. So hold tight parents.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexis",
      "helpful_votes": 0,
      "publication_date": 20140821
    },
    {
      "title": "A must for any new parents!",
      "text": "These are the only bottles that you should ever use! My daughter spit up maybe twice and I am NOT lying! The design of the bottle helps with air not getting in and keeping most of the milk down in my babies tummy! I am one happy mommy and would never go to any other bottles. Clean up isn't that bad. They send a little brush so you can clean the middle part.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20160331
    },
    {
      "title": "They leak a LOT",
      "text": "All three of these leaked within 10 uses. They are difficult to clean, but that is similar to many anti-colic bottles. We threw them out after less than a week because they were leaking all over baby and anyone feeding him.",
      "rating": 2.0,
      "verified": true,
      "author": "ar",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Great customer service, but bottles continued to leak",
      "text": "I was constantly having problems with the bottles leaking. I contacted customer service and they were fantastic, they even sent me replacement bottles, vents, etc., but I continued to have the same issue. Eventually I just threw all the bottles away ( I had 8 of them). I have been using Tommee Tippee bottles with no leaking issues.",
      "rating": 2.0,
      "verified": true,
      "author": "Lisa C",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "I'm a believer!",
      "text": "Okay, so a few of the reviews had me nervous about leaking and things, but I have had none of the problems that people mentioned. I just make sure everything it put together nice and tight (clean ad dry is good too) So, my daughter was super spitty, on acid meds with no reduction in the spitting. These bottles are amazing. She spits up so much less and is not fussy after eating, or super gassy. They are a good flow and they wash easily. For moms worried about extra parts, there are only two extra parts and they are very easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina E.",
      "helpful_votes": 0,
      "publication_date": 20140831
    },
    {
      "title": "Top descriptions says made form glass, silicone. I ...",
      "text": "Top descriptions says made form glass, silicone. I received three plastic bottles today when I expected glass! Yes, if you read down the materials say polypropolene...but come on! Haven't used yet but already feel screwed.",
      "rating": 2.0,
      "verified": true,
      "author": "David S. Cherington",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Wide are easier!",
      "text": "If you are going to use dr browns then the wide mouth bottles are a must! These are easy to clean because of the wide openings on the bottle and venting innards. They fit nicely in the dr browns sterilizer too. I have one bottle of the narrow tall regular dr browns and what a pain! I can see why people complain about the narrow ones because they are difficult to wash. These wide mouth are the way to go. And I think they reduced my sons sensitive tummy gassiness. Will definitely be using for my next kid too.",
      "rating": 5.0,
      "verified": true,
      "author": "Myndibear",
      "helpful_votes": 0,
      "publication_date": 20140606
    }
  ],
  "product_meta": {
    "title": "Dr. Brown's Original Wide-Neck Bottle, 8 Ounce, 3-Pack",
    "description": "Size:3 CountThe Dr. Brown's Natural Flow Wide-Neck Baby Bottles offer a wonderful feeding experience with innovative vent technology. Dr Brown's bottles use a patented 2-piece internal vent system for your baby's comfort. This system creates positive-pressure flow for vacuum-free feeding that is similar to breastfeeding. The breast milk or formula flows freely without nipple collapse. As the baby feeds, air is channeled from the nipple collar through the vent system to the back of the bottle. Air never mixes with the breast milk or formula so oxidation is prevented, thereby maintaining essential vitamins such as C, A and E. The vent system eliminates air bubbles in the formula or milk, which helps to reduce feeding problems like colic, spit-up, burping and gas. Dr. Brown's bottles are completely BPA, PVC, lead and phthalate free for your baby's safety. Each bottle comes with 1 Level-One silicone nipple, 1 two-piece patented internal vent system, 1 cleaning brush and instructions. To Prevent Leaking: Do not shake bottles; Do not warm bottles with parts inside; Make sure you are using the correct nipple level for baby. Please visit Dr. Brown's webiste to contact customer service with any questions or concerns.\n\nFROM THE MANUFACTURER\nThis is created by a physician. Dr. Brown's Natural Flow baby bottles feature a patented internal vent system that helps reduce colic, spit up, burping and gas. Its positive pressure design allows babies to feed comfortably, because the vent system eliminates the air bubbles and vacuum. All the parts are dishwasher safe. Dr. Brown's 3-pack of wide neck 8 oz Polypropolene baby bottles comes with Level 1 silicone nipples and cleaning brush.",
    "rating": 4.4,
    "feature_bullets": [
      "Material: Plastic",
      "Made in US",
      "Helps reduce feeding problems, known for reducing colic, spit-up, burping, and gas",
      "Proven to help preserve bottle milk nutrients",
      "Vacuum-free feeeding helps digestion",
      "Fully-vented bottle design, closest to breast feeding. Suggested Age- Newborn and Up. Microwave Safe",
      "Internal Vent System and silicone nipplw work together to controll flow so babies feed at their own pace"
    ],
    "specifications": {
      "Product Dimensions": "2.8 x 8.3 x 9 inches",
      "Item model number": "480-P3",
      "Is Discontinued By Manufacturer": "No",
      "Target gender": "Unisex",
      "Minimum weight recommendation": "1 Pounds",
      "Maximum weight recommendation": "96 Pounds",
      "Material Type": "Polypropylene",
      "Material free": "BPA, Nitrosamine, Phthalate, PVC, Latex",
      "Care instructions": "Wash with warm soapy water before using",
      "Number Of Items": "3",
      "Style": "8 Ounce",
      "Batteries required": "No",
      "Dishwasher safe": "Yes",
      "Bottle nipple type": "Internal Vent System and silicone nipplw",
      "Bottle type": "Wide Mouth, Vented, Anti-Colic",
      "Specification met": "No",
      "Is portable": "No",
      "Item Weight": "13 ounces",
      "ASIN": "B001LENCUE",
      "Customer Reviews": "4.4 out of 5 stars2,761 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#2,894 in Baby",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More"
    },
    "categories": [
      "Bottles",
      "Bottle-Feeding",
      "Baby Products",
      "Baby",
      "Feeding"
    ],
    "price": 18.18
  }
}