{
  "website_summaries": [
    {
      "verdict": "One of the most well-made, powerful wrenches in its class – surpasses the competitors in design, build, and quality.",
      "pros": [
        "Stands out for its extra wide jaw (1 1/2 inch) and etched metric measurements",
        "Built for durability and comfort, thanks to its comfort grip and chrome vanadium steel craftsmanship"
      ],
      "cons": [
        "On the costly end of the price range for this type of hand tool",
        "A few reports of wrenches with misaligned jaws upon arrival"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "a great product and it looks cute.",
      "text": "hello, having owned a set of crescent wrenches since the early 60s, the limitation of those is size. this one adjusts to a wider opening without the whole wrench being 6 feet tall and taking over the tool drawer. it is compact, but the opening fits almost 90 percent of our household / garage needs. so, it is handy, grips well and has been moved up to the daily tool use drawer, just because of the multiple uses daily/weekly. a great product and it looks cute.",
      "rating": 5.0,
      "verified": true,
      "author": "jnaki",
      "helpful_votes": 15,
      "publication_date": 20180813
    },
    {
      "title": "Absolutely Outstanding Tool!",
      "text": "Must have tool for the HVAC trade. Period. I carry this in my Veto TP4 pouch, and the wrench is pure perfection. This wrench has the same positive no slip feel as Snap-on. You set the adjustment on the nut or bolt and it stays tight. In fact you can adjust this so tight on the work you have to loosen it just so you can remove it. I really like the comfort gripe handle also. Lastly I haven't encountered a service cap or bolt size yet that this tool can't handle. Great Tool, Channellock got this baby right.",
      "rating": 5.0,
      "verified": true,
      "author": "Wingnut",
      "helpful_votes": 20,
      "publication_date": 20170423
    },
    {
      "title": "I love this wrench",
      "text": "I love this wrench. I mainly use it for adjusting leveling bolts because we have a wide range of sizes and they dont need a lot of force to be turned so using a really big adjustable wrench is overkill. I have had many coworkers ask me where I found this wrench after using it. The only down fall of this wrench is the comfortable handle. While the handle is comfortable the grip will become loose and try and slip off the metal handle. It can simply be pushed back on but it is a little annoying.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott Poland",
      "helpful_votes": 11,
      "publication_date": 20180312
    },
    {
      "title": "Jaws out of alignment",
      "text": "Jaws out of alignment, The rubber handle is slippery if you have the slightest amount of moisture or sweat on your hand. handle is very thick and will provide good padding and the measurements are nice but not worth the price. mine came in open package with nicks , scuffs and dirt on it but amazon refunded me so i will continue the quest for a great adjustable wrench.",
      "rating": 2.0,
      "verified": true,
      "author": "jim",
      "helpful_votes": 5,
      "publication_date": 20200116
    },
    {
      "title": "Best Adjustable Wrench. Will Ruin All Others",
      "text": "This wrench opens extremely wide. I knew what I was getting when I read the description, but it is oddly large when you see it in person. 8\" is the perfect size for a wrench this wide. When it arrived, there was a slick film on the grip, but after an initial wipe down of the handle, I can say I can the grip is grippy and comfortable. Going back to regular wrenches, I notice the amount of pressure they put on my hands. This one wrench completely replaced my chest of adjustable.",
      "rating": 5.0,
      "verified": true,
      "author": "Rutgers Student",
      "helpful_votes": 4,
      "publication_date": 20200427
    },
    {
      "title": "Works great",
      "text": "Easily adjusts smoothly, with precise size settings and has a good firm grip. Like other reviews have said, it opens closer to 1-3/4\", the tips are narrower than most crescent wrenches, and has a shorter handle. I have not found it to dent more than other wrenches I own. It has served well as an additional specialty wrench because of the features mentioned, and because of it's size helped install a faucet where other longer wrenchs would not fit.",
      "rating": 5.0,
      "verified": true,
      "author": "bBar",
      "helpful_votes": 11,
      "publication_date": 20160715
    },
    {
      "title": "Wide opening narrow jaws crescent wrench",
      "text": "I needed a replacement crescent wrench for one that was stolen. I needed especially narrow jaws on the wrench, which I use to attach my water hose to my RV Trailed. The hose connection is within a narrow recess, so thin jaws must be used to tighten the hose so it doesn't leak. The jaws on this wrench were a little thicker than the wrench that was stolen, but they seem to work well enough for my purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Chamberlain",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Good Azz Wrench (but maybe change the name b/c why?)",
      "text": "Bought this as a gift for my sister in law's tool set since it's highly rated. Seems to be working great so far, and felt really sturdy compared to other wrenches. But really with that name?! Women are shamed enough for their bodies and we all know that \"wide ass\" is a commonly derogatory term used towards fat women. There are other ways to be clever!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah O. ",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Wrench was fine, but not new",
      "text": "The wrench works, but it was clearly used and then repackaged poorly. Like comically poorly. As in, someone opened the clamshell, took the wrench out, used it, stuck it back in the clamshell with the handle of the wrench sticking out the side, and then scotch taped it shut with the handle coming out the wrong part of the package. A wrench that's been used a couple of times is basically just as good as a new wrench, and the wrench itself is fine, but I'm getting kind of tired of the complete lack of standards for sellers.",
      "rating": 2.0,
      "verified": true,
      "author": "James M. Harvey",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Great quality, versatile tool",
      "text": "The best thing about this wrench is its size. It's small enough to carry around without weighing you down, but versatile enough to handle just about any size bolt you'll encounter. If you get one of these, a pair of Vamplier screw-extracting pliers, and a multi-bit screwdriver, you'll have just about everything you need to assemble/disassemble most stuff (excluding car parts).",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Get IT, Get IT NOW, you need IT>",
      "text": "This is a little beast. Not available in stores locally, shortish handle + wide mouth = getting into tight spots where others won't. As an Industrial electrician, this is THE tool we use to make up TMC, TMCX fittings for CLX cable glands. Gets in between other fittings under panels. Tool can be modified to open wider than stock by removing the adjustment thumb-wheel and grinding OFF 1.5 ridges, which gives it another 1/4'' usable width.",
      "rating": 5.0,
      "verified": true,
      "author": "db",
      "helpful_votes": 5,
      "publication_date": 20150823
    },
    {
      "title": "smooth operation",
      "text": "Everyone says they're big. Of course. And they have opening size markings which is cool. But the big surprise is how smoothly the wheel operates. You can tighten them without fear they'll stick in place. Not super long but they're great for under-the-sink work where you need two wrenches on a large diameter compression fitting nut and you don't have much room.",
      "rating": 5.0,
      "verified": true,
      "author": "S. EckertTop Contributor: Camping",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Buying more..",
      "text": "Needed a replacement for a narrow jaw, wide opening adjustable wrench. This is it! Perfect for almost any job and made with sturdy materials. Grip is very good and screw adjustment is perfect. I have to buy more.",
      "rating": 5.0,
      "verified": true,
      "author": "chillausmc",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Great thin wrench for tight spaces.",
      "text": "Excellent quality wrench that fits between tight fittings and has a shorter than average handle that wroks in tight spaces. I wouldn't use this as a \"go to\" wrench as the handle doesn't provide as much leverage as a standard wrench - I consider this a specialty tool. The jaw opens to a full 1.5\" and has a very smooth travel. The handle color is a bit odd but it does make it easy to identify in toolbag.",
      "rating": 5.0,
      "verified": true,
      "author": "Duane Scaggs",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Good but heavy",
      "text": "Pros: The wide jaw is very handy for my job, the adjustment of the knob is smooth, and there is only a little bit of play so the wrench stays tight against the nut or bolt. Cons: It's a bit heavy and I'd personally like it if the hole in the handle were bigger like the ones on the old Crescent wrenches. On my job we use the hole in the handle to tighten screw jacks and I can't do that with this wrench. Luckily I don't do a lot of rigging. All in all, I've been carrying it every day for a couple of weeks. I wouldn't if I didn't think that it has redeeming qualities for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonas Grumby",
      "helpful_votes": 0,
      "publication_date": 20151207
    },
    {
      "title": "Works fine for light work, don't know if they can take heavy torque given how thin the jaw are",
      "text": "The metal jaw part is thin and it makes it feel cheap to me, but functionally they have been fine. I don't think how they would do if you need to a lot of torque. They are wide for their size, and while they didn't actually work for the project I bought them for (my fault), they came hardly shortly after to fix a stuffed sink. They are also n the short side, and that was a welcome feature when you are under a sink.",
      "rating": 5.0,
      "verified": true,
      "author": "Allan Wind",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Must have !",
      "text": "It has taken the place of all the wrenches I use for plumbing accept the pipe wrench, nice tool, i just completed a plumbing project, i used this wrench extensively, great handle and feel, very smooth and quick adjust , very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "KET19",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Great Quality Nut-Rounder",
      "text": "Great quality nut-rounder. I purchased this to sit in my car kit, and I have already had to use it to break down some metal shelving at work. The short handle makes it very useful, and the long caliper-grips are great for figuring out the size of the hex-heads you're dealing with. I highly recommend this wrench for any kit that is size constrained, or for any variable application in tight spaces.",
      "rating": 5.0,
      "verified": true,
      "author": "Hyperiox",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Highly recommend this adjustable wrench",
      "text": "I researched adjustable wrenches. My son uses hand tools in very oily and dirty conditions under extreme circumstances. He needed an adjustable wrench that would not loosen during use and that had the backbone to handle full torque. Glad that I picked this one. He loves it. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Michaels",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Best wrench I own",
      "text": "This is a quality product at a fair price. I needed a wrench that would not mar my Chicago kitchen faucet. The machining of the wrench is as good as it gets with negligible play in the mechanism. First rate!",
      "rating": 5.0,
      "verified": true,
      "author": "Claremont Guy",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Versatile wrench",
      "text": "This wrench works well; it's easy to adjust and is therefore very versatile. I'd prefer it if the handle were black, rather than pale blue, but that's a minor quibble; it grips well.",
      "rating": 5.0,
      "verified": true,
      "author": "River Temarc",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "You Will Like This Wrench",
      "text": "Very well made, fits the hand well, the jaws do not flop around and the dial does not rattle like on so many other crescent wrenches (unfortunately even those made by Crescent). This has clearly etched graduations on both sides, mm and inches. It opens up quite wide (WideAzz for sure) and the well shaped jaw tips are very narrow. You can get these into more places than the fat boy wrenches. I will end up buying one with a longer handle, too. I really like this one. No slop, accurate, great jaw shape, huge capacity. WIN!",
      "rating": 5.0,
      "verified": true,
      "author": "PachydermTop Contributor: Woodworking",
      "helpful_votes": 0,
      "publication_date": 20150902
    },
    {
      "title": "Great",
      "text": "Well in hvac work a small adjustable wrench is a must, but so often you come across a cap that is just a 1/16 big than your wrench will open, and then its back to the truck for a larger heavier wrench, well this one here is perfect, opens wide and has comfortable grip, edges are little sharper than i like , not that it will cut you, but brush against it in a tool bag and it might break the skin. Over all very happy. saves me trips back to the truck and isnt wieghting my tool bag down",
      "rating": 5.0,
      "verified": true,
      "author": "Karl",
      "helpful_votes": 0,
      "publication_date": 20161029
    },
    {
      "title": "Best adjustable wrench I've used",
      "text": "I really like the sturdiness of this wrench. Have been using other \"standard\" ones but this is much better. Looks better and feels better too :)",
      "rating": 5.0,
      "verified": true,
      "author": "Brian5",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Money well spent.",
      "text": "Machined very well, the spindle feels sturdy and connected to the rod well. The only critique i could really make is maybe debur the mouth before packaging but thatll just happen from use anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "Lord Snow",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "An absolute unit of a tool",
      "text": "Bought from recommendation of Wirecutter. It’s pretty nice for a home tinkerer who doesn’t need heavy usage but the universal form factor this provides.",
      "rating": 5.0,
      "verified": true,
      "author": "Doctor Karamazov",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "My go-to wrench",
      "text": "This is one of those essential tools that everyone should keep handy. I have multiple \"crescent hammers\" in my toolbox, but the thin jaws and wide opening on this model make it my go-to wrench. I plan to buy one more of these to keep at my reloading bench",
      "rating": 5.0,
      "verified": true,
      "author": "NoVA Music Lover",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Everyone DIY'er should have a wrench like this!",
      "text": "I don't give five stars. This is an exception. Actually, I have two of these, one at home, one in the RV. It has really wide jaws and a relatively short handle. It's easy to work in tight spaces and still get some leverage. Once adjusted, it stays adjusted. I have lots of tools, but this is the only one I would ever feel motivated to rate. If you don't have one, but use an adjustable wrench often, you need to have this on hand. And don't settle for a cheap knock-off, they tend to become loose while in use.",
      "rating": 5.0,
      "verified": true,
      "author": "George B. Davis",
      "helpful_votes": 2,
      "publication_date": 20140214
    },
    {
      "title": "Great value, great tool. Replaces two or three ajustable wrenches.",
      "text": "-Just- over 1 1/2\" is amazing. Grip has slipped off on me once but as a matter of truth I may have been using it to hold against a 3/4 air impact... It held up perfectly though. I've since cleared out all but one other ajustable wrench from my toolbox.",
      "rating": 5.0,
      "verified": true,
      "author": "Perry Puckett",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Quality product with thin jaws.",
      "text": "Well made with very little play. Thin jaws for easy fit. Compared others & thought this was the best value. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "RV-n-Smokies",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "It is a Wrench that is worth the extra cost!",
      "text": "MADE IN USA!!!!!!!!!!!!! That is to say, it is extremely well-made and very, very strong for its relatively narrow profile. A superb tool. What ESTWING makes in America is made to perfection.",
      "rating": 5.0,
      "verified": true,
      "author": "Damian",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Great design and very effective",
      "text": "This wrench is really nice, comfortable, and STRONG! I love it. I've had my share of crescent wrenches, but this one is definitely the nicest one I have ever owned. It has very smooth action when adjusting the mouth. It holds like a clamp when you need it to. The handle is comfortable enough where it will not dig into your hand too badly when wrenching on something really hard. And the narrower jaws allow you to get in some tighter spots. Overall, a wonderfully designed wrench.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20160219
    },
    {
      "title": "Soft metal and poor precision",
      "text": "The metal is soft and attempting to apply any kind of force will bend it (see pics). In addition, the adjustment mechanism is extremely loose (see video), meaning you have to re-tighten after almost every turn.. Absolute rip-off, especially at the $20+ price point.",
      "rating": 1.0,
      "verified": true,
      "author": "Luwen",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "awesome",
      "text": "cant go grown nice and firm supostly it open to 1 1/2 inch but it opens a litle more up to 1 5/8 inch 🤠👌🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Edwin Rios",
      "helpful_votes": 6,
      "publication_date": 20170510
    },
    {
      "title": "Great tool",
      "text": "Well engineered, smooth tight gearing. Will very little slop. Opens a bit over 1.75. Thickness of tool isn’t bulky. The con is the bulky blue handle, I’ll be cutting mine off shortly.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J. Malone",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "I've had cheaper ones in the past and this is the best one I've owned",
      "text": "Really well built and smooth as silk to adjust. I've had cheaper ones in the past and this is the best one I've owned. Machining is solid and tight. For a wrench around the house this is great investment and something you'll be happy you spent more on when you need to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Burnt Out",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "The best adjustable wrench I've had",
      "text": "I've had a number of adjustable wrenches over the years. All have been ok, but have had the same problem. Jaws that were too loose and wouldn't hold adjustment. Here's what you can do. Buy a cheaper adjustable wrench and deal with the loose jaws, or buy this wrench and not have to worry about it. Buy this wrench, pay a lot more, but have a quality tool that will last and that you can hand down. I've bought three of the 8\". One for myself, 2 as gifts. I've bought 2 of the 6 inch. 1 for myself, 1 as a gift. These are great adjustable wrenches. No doubt about it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin K.",
      "helpful_votes": 0,
      "publication_date": 20140715
    },
    {
      "title": "Great for my tool kit.",
      "text": "Great product. Essential tool for my kit. Thin to use in tight places. Good grips. Worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "DQT",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Great quality",
      "text": "I have limited ability to carry multiple pools at once. This tool gives me the flexibility I need and is wonderful addition to my tool kit",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Houser",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Bridges the 8 to 10 inch Gap",
      "text": "This 8 inch wrench expands to 1 5/8 inch wide. That is wider than a 12 inch can go and with the comfort grip you can get torque comparable to a 10 inch wrench in tight spaces.",
      "rating": 5.0,
      "verified": true,
      "author": "Apprentice",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Took all others adjustables out of my tool bag !",
      "text": "Most adjustable wrenches are have short jaws. My co-worker has one of these (8WCB) and I loved it so much, I had to get one. Could not find them anywhere in the big box home stores. The wide gap and long reach on the jaws make a big difference when working on equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "trip68",
      "helpful_votes": 3,
      "publication_date": 20160523
    },
    {
      "title": "Impressed",
      "text": "You know when you use a crescent wrench and it had the \"play\" so it constantly slips and strips the bolt/nut? Well this one doesn't do that (as much). It moves a little, but it's been a work horse. Worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "CiG",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Great wrench",
      "text": "My 2nd purchase of these type of wrench. I bought the smaller version. Great for most of my plumbing needs. Love how it opens extra wide",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Great for a plumbing repair problem",
      "text": "This excellent wrench and some penetrating oil succeeded where other tools failed to loosen two Kohler brass under sink lavatory faucet mounting nuts. On previous attempts I unsuccessfully tried tapping, wire brushing, WD-40, a strap wrench from above, and a basin wrench from below. The Channellock 8WCCB fit the 1 1/2\" nuts in a tight installation, and I am very happy to have bought it. Great tool!",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "Wrench Gap",
      "text": "Real comfortable grip and works really well. My only complaint is that there is a gap between the rubber handle and the actual wrench inside it. The wrench does not slip out of the handle, so this can cause problems if water gets inside. The water could cause the wrench to rust or cause mildew and mold in an area that you can't clean. Next time I will be buying a wrench that is latex dipped like the Klein Tools D509-8 so that there are no gaps for water to get into.",
      "rating": 4.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 3,
      "publication_date": 20140705
    },
    {
      "title": "With the money",
      "text": "Very durable! Love how large this opens up. It’s my go to for all my wrench needs. Only down fall is how short the handle is. If you need to get leverage it makes it difficult.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Caldwell",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "The best crescent wrench I have owned",
      "text": "The tight tolerances make this wrench feel great. High quality. Its actually usefull.",
      "rating": 5.0,
      "verified": true,
      "author": "Ballpark",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Great Tool, American Made",
      "text": "Great to find an American made tool, great quality and has a scale built into the jaws. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Wildlife",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Great",
      "text": "Feels great, looks great, and does the job without slipping. You know how some adjustable wrenches have wiggle room- not this one.",
      "rating": 5.0,
      "verified": true,
      "author": "chrispriiice",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "US Made Excellence",
      "text": "This tool is built great. No Chinesium to be found. I love my other tools from them and this is no different.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Billmore",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Love these wrenches!",
      "text": "The wider jaw opening on these adjustable wrenches is just awesome. It takes up the same space in my tool bag as a standard adjustable wrench, but now I can carry fewer large open ended wrenches, so this actually saves me a lot of space in my tool bag. I ordered two of these and then took out all my regular open ended wrenches which freed up a lot of space and weight in my tool bag. These things are also built great and will hold up, no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Eddelman",
      "helpful_votes": 0,
      "publication_date": 20141012
    },
    {
      "title": "very handy",
      "text": "Opens to a 1.5 in and short handle can maneuver in tight places Very good quality",
      "rating": 5.0,
      "verified": true,
      "author": "ColBuckshot",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Wide",
      "text": "Smooth but not loose. Wide as stated. This blue handle has a strange feel, but it's fine.",
      "rating": 4.0,
      "verified": true,
      "author": "k",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Worth the $21",
      "text": "I have stopped carrying my 12\" wrench with me all day. The small handle is still a good size and the plastic grip fits my hand size. I would only change it to a smoother plastic that doesn't grip cloth in a tool pouch or pocket.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Johnson",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Too bulky. yet. Too stubby.",
      "text": "Big jaw, short-fat handle = low torque + big hardware (this does not add up) This is the de- evolution of a good tool. Tolerances are nice, and the markings are a nice addition though.",
      "rating": 3.0,
      "verified": true,
      "author": "elijah rebello",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "The absolute most valuable tool when doing plumbing.",
      "text": "This is the handiest adjustable wrench I've ever owned. It's a little shorter than most automotive adjustables, but because it'll got to 1.5 inches wide, it gets used all the time on every plumbing job. It's truly one of those 'must have' tools if you do any home or commercial plumbing.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike-K",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "Solidly built to last.",
      "text": "Not only is this wrench wide-azz it is deep-azz too. Well made, comfortable and very little play in the jaws.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick S.",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "WideAzz",
      "text": "Quality tools are a joy to use. WideAzz is one of those. It's nice to have a short wrench that can grip large nuts and bolts. It's like having 2 complete sets of metric and SAE wrenches in your pocket. Since it arrived, I've used it several times. One time was when the mower quit running. It saved a long walk to the garage to get a wrench I probably didn't have. Handy little tool and a pro mechanic approved of it.",
      "rating": 5.0,
      "verified": true,
      "author": "BillD",
      "helpful_votes": 0,
      "publication_date": 20140807
    },
    {
      "title": "Widazz short crescent!!",
      "text": "My favorite crescent wrench. Jaws are tight little slop. They are also fairly thin and fit well in many places. They also make a thin jaw set if you have the need. Open to just over 1 1/2 wide with a short 8 inch handle. Had a 6 foot cheater pipe on this wrench to take of a hydraulic fitting and it held up to that abuse. Use it everyday as a heavy duty mechanic. In fact I’m on my second one because I lost the first. Recommend this wrench highly.",
      "rating": 5.0,
      "verified": true,
      "author": "Lance Goblirsch",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Marine Diesel Tech",
      "text": "I am a Marine Diesel Technician and use a variety of tools. Whenever I need to remove a sensor or a fuel line with a large fitting, this tool is perfect and fits right in the outside pocket of my bag. Thick handle so you can get some leverage and there was no slop/play in the adjusting jaw. Definitely doesn't replace the leverage of a large adjustable, but jaws open much wider than anything of comparable size. Just bought a second one for personal use- to keep nice; because the one in my work tool bag takes a pounding.",
      "rating": 5.0,
      "verified": true,
      "author": "Victor Hebert",
      "helpful_votes": 0,
      "publication_date": 20160601
    },
    {
      "title": "I selected this item based on an \"expert's recommendation on ...",
      "text": "I selected this item based on an \"expert's recommendation on the Internet. I now wonder whether a longer wrench would make more sense, because of the greater leverage a longer wrench could provide. Nevertheless, I do not regret the purchase. The product seems well made and works properly.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170709
    },
    {
      "title": "High quality, adjustable wrench",
      "text": "As an industrial mechanic these are my best friend. Operators are constantly using wrong tools and hardware. This make my job more difficult and I can’t carry a whole set of wrenches in my pocket. This handles whatever I throw at it.",
      "rating": 5.0,
      "verified": true,
      "author": "nick hollis",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Good quality!",
      "text": "Great purchase! I keep this in one of pouches for service work. Good quality & good value!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Arellano",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Love this tool.",
      "text": "This adjustable is great because of the slim jaw width.",
      "rating": 5.0,
      "verified": true,
      "author": "TLW",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "This was very helpful when I replaced the bathroom faucet ...",
      "text": "This was very helpful when I replaced the bathroom faucet. When I was underneath the counter/sink, this was the only one that had a handle short enough to fit a confined space with a 1.5\" jaw that was wide enough to fit around the valve nut.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "great wrench",
      "text": "I'm a service tech and this is one tool always on my service tool bag it is very compact and easy to use the quality is great",
      "rating": 5.0,
      "verified": true,
      "author": "Oscar Barrios",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "A must for equipment repair",
      "text": "I use this and its 6\" little brother mainly on hydraulic lines on industrial vehicles at work (lawn mowers, tractors, bobcats, trucks etc). However I also use them while performing automotive and truck repair. They're worth their weight in gold, can get into tight spaces and have never let me down. Short handles and super wide opening jaws like these are hard to find.",
      "rating": 5.0,
      "verified": true,
      "author": "E.P.",
      "helpful_votes": 0,
      "publication_date": 20150622
    },
    {
      "title": "Great for large nuts in tight places.",
      "text": "Really like this little wrench. Its small but opens up to 1 1/2 inches.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Mancini",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Awesome.",
      "text": "Awesome wrench. Mechanism is tight, not a loose wallow-y adjustment. Big enough for the flats on garden hoses.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Collins",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Great",
      "text": "Very applicable for many uses, well built and designed, Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Howard",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Best adjustable wrench ever",
      "text": "I'm an industrial mechanic. I use this wrench every day. It's the best adjustable wrench I've ever used. I carry it in my pocket all day. I even bought the 12 inch version for more leverage because I like this one so much. And I've used all the big name brands. My co-workers borrow mine a lot and one of them even bought one himself.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaydee",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Precision",
      "text": "Had the 6\" version and now the 8\". They are made so precise, that I've used them to pull a small splinter out of my hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Great tool!",
      "text": "Great tool with wide opening, use it mostly for large pipe fittings. Probably won't have to use my gigantic tongue & groove pliers as much. Cushioned grip is a nice bonus. Could have a longer handle for torque but for around the house jobs shorter is actually better. Oh, and Channellock tools are MADE IN THE USA!!! Ok, after looking at the handle today this is made in Spain, go figure...",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Man",
      "helpful_votes": 2,
      "publication_date": 20130426
    },
    {
      "title": "Must have tool",
      "text": "I think anyone who fixes things should have two of these. I just wish they made one in a ten inch size.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Barnash",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "great wrench",
      "text": "I recently bought this wrench to replace my current Channellock 808W, which is also a great wrench but only opens to 1-1/8\", approx. As soon as I had the 8WCB in my hands I loved it. the grip is comfortable, the jaws open up to 1-5/8\", and the action is smooth, although maybe a little hard due to the newness of the wrench. The 8WCB is a must have for anyone needing a low leverage wrench on a large fastener.",
      "rating": 5.0,
      "verified": true,
      "author": "Beb's Repair Bench",
      "helpful_votes": 0,
      "publication_date": 20130914
    },
    {
      "title": "The Best Adjustable Wrench",
      "text": "Best and most well-designed adjustable wrench I've found. I use it everyday at work. No fat/stubby jaws, smooth adjustment and adjusts very wide. Made in Spain, not China. PS: Cut off that goofy rubber handle for high-speed/low drag use.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Scott",
      "helpful_votes": 0,
      "publication_date": 20170622
    },
    {
      "title": "Be aware of the handle.",
      "text": "They are great wrenches after you bust your knuckle the first time the plastic handle slips off. I would pull the handle off if you plan on using it in an industrial setting having to put good torque on a nut to get it loose.",
      "rating": 4.0,
      "verified": true,
      "author": "David K. Guin",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "Awesome crescent wrench",
      "text": "This has replaced my older traditional wrenches. The compact size size of this wrench along with the width of the jaws has made this my go to wrench.",
      "rating": 5.0,
      "verified": true,
      "author": "NeoTalon",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Works great:)",
      "text": "Pros: 1) Well built, 6\" length is nice, and it does go an extra 1/8\" wide. Cons: 1) a bit cheaper would be nice, but no problem since I expect to use it for forever.",
      "rating": 5.0,
      "verified": true,
      "author": "roger h",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "top quality",
      "text": "prefect tool... love the very wide calibrated jaws in inches and millimeters... short handle.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Not good for the money",
      "text": "I am a bit surprised by the fact it seems to get suck at the lower end, around half an inch. For the money, the quality it just not there. Also there is a l too much play.",
      "rating": 2.0,
      "verified": true,
      "author": "ABCEFGH",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "AWESOME awesome AWESOME awesome!!!!! These are so cooooooool (no joke)",
      "text": "AWESOME!!!! What else can you say? We use these all the time around the shop. They go so huge they will fit on just about anything we work with. I wouldn't recommend if you really need to tighten something like a huge bolt, but for water fittings and other plastic parts that are big, but don't need to go crazy tight, these work great!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jon H.",
      "helpful_votes": 0,
      "publication_date": 20150506
    },
    {
      "title": "Buy it. It is a great tool",
      "text": "I love this thing. So very useful. Big mouth and just works",
      "rating": 5.0,
      "verified": true,
      "author": "John S.",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "A great wrench!",
      "text": "This is a very handy wrench! I like the oversize capacity for the many areas that just aren't accessible with a larger wrench, particularly electrical and refrigeration fittings. I have three of these wrenches, one in every tool box, and they are my go-to wrench nearly all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Renz",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "worth the price",
      "text": "Great for tight to reach places and heavy duty. Made in spain and there is no movement or wiggling once you pick an opening size.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcos Mejia",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Delighted, use frequently. Outstanding tools good price, would buy again",
      "text": "Delighted, use frequently. Outstanding tools good price, would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Wade B.",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Must have!",
      "text": "I'm a tower climber and this is a must have! It replaces a couple crescent wrenches, making my tower bag lighter during the climb. It's pretty convenient",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Great from work",
      "text": "My husband liked that it fits almost everything he use's at work,",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Awesome wrench",
      "text": "Love this wrench make changing txv heads easy worth every penny",
      "rating": 5.0,
      "verified": true,
      "author": "RAMON L. PITT JR.",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "THE wrench to have",
      "text": "If you have only one adjustable wrench, this should be it. The jaws are long, narrow, pointy, and STRONG. There is very minimal play in the worm gear. The finish is excellent, no flaking or chipping. The handle is grippy, and well padded. The whole works cleans up easily, restoring to a like-new condition every time. I love this wrench, and get loads of comments at work.",
      "rating": 5.0,
      "verified": true,
      "author": "robb",
      "helpful_votes": 0,
      "publication_date": 20130910
    },
    {
      "title": "Excellent wrench. I needed something that would go to ...",
      "text": "Excellent wrench. I needed something that would go to 1-1/2 and had a short handle to tighten a lose big nut under my kitchen faucet (very limited space there due to two protruding sinks around) and this one did the job",
      "rating": 5.0,
      "verified": true,
      "author": "D. & E.",
      "helpful_votes": 0,
      "publication_date": 20170516
    },
    {
      "title": "They should make them all like this",
      "text": "This is my favorite adjustable wrench of all time. It has a very fine adjustment and goes very wide. High quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Cory Combs",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Best Channellock on Amazon!!",
      "text": "Multi-Purpose Channellock is great for any tasks, Built to last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Ali Baba",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Overall the channel lock cresent isn't bad. The wide mouth is nice to have at ...",
      "text": "Overall the channel lock cresent isn't bad. The wide mouth is nice to have at certain times. It's not to heavy. The only complaint I have and why I rated it three stars is because the rubber handle pops off a lot when using it. It's pretty annoying when it happens.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "This is a great wrench. It is now my go to wrench",
      "text": "This is a great wrench. It is now my go to wrench. I have sockets and open end wrenches, but it's easier to grab this wrench. I tried it on the oil drain plug on my truck, the drain plug on my riding mower and removed the mower blades for sharpening. It adjusted tight to the bolts and did the job. The stores in my area didn't carry it. I am glad I found it on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Clean Yard \"Paul\"",
      "helpful_votes": 0,
      "publication_date": 20150611
    },
    {
      "title": "Good construction, good value, functional adjustable wrench",
      "text": "Works good for wrenching those weird sizes you don't have a fixed size wrench for. The wide jaw can be difficult to fit in smaller spaces.",
      "rating": 5.0,
      "verified": true,
      "author": "amazonreviewer123321",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "There's no competition for Channellock wrenches",
      "text": "I'm an engineer technician at Time Warner Cable, and this thing locks in place like no tomorrow. It stays on with a tight fit, and when you want to loosen it, you just shake up and down and it comes off with no problem. The grip is phenomenal and is easily visible due to the aqua blue type handle. Definitely recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "chiapetx1",
      "helpful_votes": 0,
      "publication_date": 20140624
    },
    {
      "title": "Good and tight with large jaws",
      "text": "I use this for txv powerheads and it works. Nice and tight components forbprice",
      "rating": 5.0,
      "verified": true,
      "author": "mag",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Not the Channellock I Grew Up With",
      "text": "I bought this based on all the five star reviews. It arrived with the jaws out of alignment. Overall, the quality is just not there like the Channellock of old. It is being returned.",
      "rating": 2.0,
      "verified": true,
      "author": "Dovetail",
      "helpful_votes": 4,
      "publication_date": 20141222
    },
    {
      "title": "I love Channellock tools and this adjustable wrench is of high ...",
      "text": "I love Channellock tools and this adjustable wrench is of high quality and has held up very well with heavy usage. I carry both the 10 inch and 8 inch Wide Azz in my tool bag. These are good wrenches to have if you are in the trades, as they are tough as nails. I highly recommend...",
      "rating": 5.0,
      "verified": true,
      "author": "Mark V.",
      "helpful_votes": 0,
      "publication_date": 20150521
    }
  ],
  "product_meta": {
    "title": "Channellock 8WCB 8-Inch WideAzz Adjustable Wrench | 1.5-Inch Wide Jaw Opening | Precise Jaw Design Grips Tight - Even in Tight Spaces | Measurement Scales Engraved on the Tool for Easy Sizing of Diameters | CODE BLUE Comfort Grip",
    "description": "Size:8-Inch WideAzzValue Not found.\n\nFROM THE MANUFACTURER\nThe Channellock 8WCB WideAzz 8-Inch Adjustable Wrench with Code Blue grips has the same capacity as a 12-Inch wrench. Longer jaws grip better, avoiding slippage or nut round off. Measurement scales (in. on front mm. on reverse) are handy for sizing nuts, pipe and tube diameters. Greater jaw capacity supports larger nuts and bolts. Thinner jaws for greater access in tight spaces. Precise jaw design grips tight the first time, every time. Four thread knurl and non-protruding jaws provide greater capacity; minimal head width improves performance in confined spaces. Code Blue grips are designed for durability and comfort. Made in Spain to the highest quality standards of Channellock, Inc.",
    "rating": 4.8,
    "feature_bullets": [
      "Extra Wide opening to 1-1/2\"",
      "Longer jaws grip better, Thinner jaws give greater access in tight spaces.",
      "4 thread knurl and non-protruding jaws provide greater capacity; minimal head width improved performance in confined spaces",
      "Precise jaw design grips tight the first time, every time",
      "Measurement scales (in. on front mm. on reverse) are handy for sizing nuts, pipe and tube diameters",
      "Chrome Vanadium steel construction",
      "Code Blue grips are designed for durability and comfort"
    ],
    "specifications": {
      "Manufacturer": "Channellock Inc",
      "Part Number": "8WCB",
      "Item Weight": "12 ounces",
      "Product Dimensions": "1 x 4 x 12.2 inches",
      "Item model number": "8WCB",
      "Is Discontinued By Manufacturer": "No",
      "Size": "8-Inch WideAzz",
      "Color": "Blue",
      "Material": "Metal",
      "Item Package Quantity": "1",
      "Measurement System": "Metric",
      "Included Components": "Wrenches, Handtools, Adjustable Wrench",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B001I70C34",
      "Customer Reviews": "4.8 out of 5 stars739 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#7,301 in Tools & Home Improvement",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "April 1, 2004"
    },
    "categories": [
      "Hand Tools",
      "Tools & Home Improvement",
      "Power & Hand Tools",
      "Wrenches",
      "Adjustable Wrenches"
    ],
    "price": 25.41
  }
}