{
  "website_summaries": [
    {
      "verdict": "A larger option for customers wanting a circular folding mirror.",
      "pros": [
        "One mirror shows 10x magnification, while the other offers the true image",
        "Folds down to one inch thick",
        "Mirror can be propped upright for hands-free use",
        "Glass is distortion-free"
      ],
      "cons": [
        "LED lights could be brighter",
        "Some buyers report issues with the product's durability"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Nice slim bright travel mirror!",
      "text": "This is a great little travel mirror. It's very bright (and I need more light) . The magnification is like my big 10X floxite mirror, I have to get close to it, but the 5X isn't enough. I suggest testing magnifications at a store that sells this type of mirror so you'll know what you need. It's slim and will travel well!",
      "rating": 5.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 11,
      "publication_date": 20180219
    },
    {
      "title": "Fell Apart On First Use",
      "text": "I used this mirror for the first time on a trip this past weekend. The front cover fell off and cannot be re attached,since the inserts that allow the lid to hinge fell out. I could only find one and cannot re attach the lid. It's been sitting on a shelf in the box since it was purchased in April. This was the first use. The time frame to return ended May 29. Obviously, I'm pretty ticked! The one star is because the concept is okay. It's just shoddily made.",
      "rating": 1.0,
      "verified": true,
      "author": "DMarie",
      "helpful_votes": 17,
      "publication_date": 20160615
    },
    {
      "title": "Found a Travel Case for this Mirror",
      "text": "This mirror is great for travel with it's compact size, bright mirror, and 10x magnification. Since they no longer sell a travel case I was able to purchase a tablet case which is padded and the perfect size.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie R",
      "helpful_votes": 9,
      "publication_date": 20181027
    },
    {
      "title": "Love it!",
      "text": "Gosh, I can see every little blackhead, age line, and scar on my face! Great for putting on eye makeup. Definitely would purchase again if need be. Great product. The only thing I wish it had was a secondary regular mirror, like the older models did. My sister has one like that by this maker.",
      "rating": 5.0,
      "verified": true,
      "author": "Patti C",
      "helpful_votes": 5,
      "publication_date": 20180821
    },
    {
      "title": "Either Either",
      "text": "Awful mirror. Can't see ANYTHING unless you are holding it up to you's nose. And that's about all you are going to see backsplash because the mirror doesn't allow you to see the sides of your face like you should be able to. So having a stand does not help because you have to hold it to you's nose to see. It is pretty much a bust for me, but others who have purchased it seem to love it so I guess it's just one of those things where some like it just fine and some don't",
      "rating": 1.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 6,
      "publication_date": 20161021
    },
    {
      "title": "Magnification and lighting fantastic!",
      "text": "Bought this for my son who wears contacts and plays travel hockey. Hotel mirrors and lighting are not always consistent and he has terrible eyesight. The strong magnification works well for him in putting in his contacts. Have only had it for 2 weeks, but it's traveled to WI and now in NV already and held up well properly cushioned in luggage. Would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Chipping",
      "helpful_votes": 3,
      "publication_date": 20180620
    },
    {
      "title": "A little extra money but a great value!!",
      "text": "This is my second floxite mirror. My first one lasted 10 yrs. I'm only replacing it because I dropped my first one. I went with a cheaper mirror in fact 2 different mirrors but I had to bite the bullet and spend the money. It is a great mirror, from the size to the brightness nothing comes close! It's more money but worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Angle goes back too far",
      "text": "I was disappointed with this mirror. The plastic doesn't seem very strong to hold up and the fact that the mirror goes back too far, I cannot see my face to apply my makeup. I tried putting something behind the hinge to keep the mirror at a better angle for me, but that didn't work either. I will be returning it and order something different.",
      "rating": 3.0,
      "verified": true,
      "author": "A.. Vidrick",
      "helpful_votes": 2,
      "publication_date": 20180616
    },
    {
      "title": "Very good for the price !!",
      "text": "This came in very handy on a recent trip. The light was sufficient , could have been better . The distortions were present , you need to have the mirror very close to the face to see clearly, but having said that, it served its purpose well. I would not been able to see properly with the lighting provided in our hotel room, so I'm not complaining . It's nice and light and takes up barley any room to pack !! Tried a few others and this one proved the best !!",
      "rating": 4.0,
      "verified": true,
      "author": "Kiki",
      "helpful_votes": 6,
      "publication_date": 20151024
    },
    {
      "title": "Bright and good magnification",
      "text": "I always like when a product comes with the batteries already installed. The light is very bright and should serve perfectly and the magnification is just what a person putting on makeup might desire to have. I like the fold up feature of this mirror. I'm not sure how long it will last as have not traveled with it yet but it is very light and does not take up much as folds up so compact. It also will only open up in one position so if you want to adjust the level of the mirror you will have to set it on something or to adjust the angle put something behind it. Will not adjust in increments.",
      "rating": 5.0,
      "verified": true,
      "author": "DK",
      "helpful_votes": 5,
      "publication_date": 20160118
    },
    {
      "title": "Complete Junk",
      "text": "I had to return the mirror as the image was so distorted it was unusable. Had I been able to use the mirror I would have kept it since I wanted to for a trip the next weekend; however I felt the product was of poor quality and design. The plastic used was far too flimsy for a travel mirror. The angle of the mirror would require you to stand bent at almost a 90 degree angle to use. Most likely you would need to use a towel to prop it up at the correct angle to use.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Not sturdy enough for travel",
      "text": "Needs to be sturdier for Travel. This is the 2nd one I have ordered. The battery cover broke on the 1st one and it is now duct-taped which does not work well. I figured maybe I was a bit rough on it. I ordered a 2nd to use in a different place and this one is no better. The hinging system to keep it open has fallen apart after a few uses. Very frustrating. The mirror itself is very good, but the casing is poor.",
      "rating": 2.0,
      "verified": true,
      "author": "lynnski",
      "helpful_votes": 2,
      "publication_date": 20161118
    },
    {
      "title": "Great mirror.  Great lighting.",
      "text": "OMG! I can see everything on my face! That's good, or it could be bad! Makes for precision makeup application and ease for tweezing brows. It's bigger than I wanted, but I still love it. I thought this was purse-size. No way.",
      "rating": 5.0,
      "verified": true,
      "author": "HeartofAvalon",
      "helpful_votes": 3,
      "publication_date": 20170705
    },
    {
      "title": "Love it!",
      "text": "My husband wanted a wall mounted magnifying mirror. I'm so glad we got this one instead so I can travel with it. It works too good. Looking at my face is almost scary! Lol. Everything is so large (pores, hair, etc.) It really helps me when I pluck my eyebrows for touch ups. It's easy to hold, or it sits on a stand. It's great. The light is super bright",
      "rating": 5.0,
      "verified": true,
      "author": "SEAC",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Excellent travel mirror with magnification and light",
      "text": "Excellent travel mirror with magnification and light!! I bought it for my trips, now I can see my face when I apply my make up. Love it and highly recommend it!! Great size and light weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 2,
      "publication_date": 20180728
    },
    {
      "title": "Good travel mirror",
      "text": "While a bit large it folds flat to fit in luggage easily. Magnification is clear and the lights are evenly distributed to give you a clear picture of your face. Sometimes a little too clear for we older women.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeg",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "For my contacts",
      "text": "I was traveling with a full size lighted makeup mirror because of my contacts. Way too much trouble. There is always a surface I can set this on so I can see to put my contacts in. Just bright enough to make contact insertion easy. So much easier to travel with than the full size version.",
      "rating": 5.0,
      "verified": true,
      "author": "DSB",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Great for travel!",
      "text": "I love this mirror and it travels with me everywhere. Many hotels now have magnified mirrors but they are mounted to a wall in poor lighting. Never a problem with this anymore. Worth the money if you travel a lot, or even to use at home.",
      "rating": 5.0,
      "verified": true,
      "author": "Gail A.",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "When opening the mirror and placing this non-skid fabric under the \"lid\" I can put the mirror at any angle when open versus only",
      "text": "I am on my second Floxite travel mirror. I use it everyday. It travels well in my suitcase in-between clothes. I did purchase an adapter ($10 in 2015) from Floxite directly and use it instead of the batteries. An idea I had may be helpful to you. I cut a piece of thin non-skid fabric the size of the mirror. I sandwich that between the mirror and the lid when traveling. When opening the mirror and placing this non-skid fabric under the \"lid\" I can put the mirror at any angle when open versus only \"double backing\" it like the picture. This gives you many more viewing angles and standing options.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 4,
      "publication_date": 20160912
    },
    {
      "title": "Everything is clear",
      "text": "Only buy this if you really want to see everything on your face! The glass is clear, not wavy, seems to be good quality. The lights around the edges are bright. You will be able to see every hair or spot on your skin. Some people have said that it is not adjustable and I know what they mean. But, I have been able to work around that by setting it on top of a few magazines or on a different counter. It would be nicer if it were adjustable, but it does exactly what it is supposed to do. I have traveled with it and it folds pretty flat so it doesn't take much room.",
      "rating": 5.0,
      "verified": true,
      "author": "Quilter",
      "helpful_votes": 0,
      "publication_date": 20170312
    },
    {
      "title": "A little distortion around the edges",
      "text": "There seems to be a little bit of distortion around the edge of this mirror and I had thought Floxite mirrors were known for being extortion free.",
      "rating": 4.0,
      "verified": true,
      "author": "Laurel C",
      "helpful_votes": 2,
      "publication_date": 20181211
    },
    {
      "title": "Not For Me!",
      "text": "I looked at this product for awhile before I ordered it......big mistake! Time was an issue before I was leaving for vacation. The mirror came, packaged well and liked the lighting. Two problems ...had to have it so close to my face to use and couldn't adjust the height. If I had the mirror the slightest bit further away from my face it was distorted. Now what I don't understand is how my image is upside down if it is further away! IF I had the time I would have sent it back but didn't! Learned a lesson!",
      "rating": 2.0,
      "verified": true,
      "author": "HR from FL",
      "helpful_votes": 2,
      "publication_date": 20150504
    },
    {
      "title": "Not worth the money!",
      "text": "I bought this mirror so that I could use it for travel. This morning, the lights were dim so I went to change the batteries. I put brand new batteries in it and it wouldn't turn on. I then put the old batteries back in. Still nothing. Now it won't even light up at all. If the window for returning hadn't passed, I would be sending this piece of junk back.",
      "rating": 1.0,
      "verified": true,
      "author": "robslaw",
      "helpful_votes": 2,
      "publication_date": 20170810
    },
    {
      "title": "Not worth the price",
      "text": "It is bulkier than I was hoping for. The plastic is flimsy and cheap. It serves its purpose but for the price, I'd rather have something sleek and better looking when it's folded up. But the lights are good and the magnification is strong and clear.",
      "rating": 2.0,
      "verified": true,
      "author": "Crystal Ayotte",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Will save some eye doctor trips",
      "text": "My aging eyesight has made taking removing those troublesome eyelashes very difficult, I just can't see to remove them. Trips to the eye doctor are inconvenient and costly. I knew the increased magnification would help as I've been using a mirror with less magnification mostly successfully for years. I had no idea how nice the built-in light would be, and hadn't even noticed it in the description when I purchased this mirror. The mirror seems to be well made and folds nicely. I highly recommend this mirror.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20151009
    },
    {
      "title": "Great Solution",
      "text": "Bought this for a family wedding we all had to travel to. We rented a home and I knew there would be too many women competing for the mirror when getting ready for the wedding. I set this up on top a chest of drawers in my bedroom and did my makeup in peace.",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie Nielsen",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Perfect Travel Mirror!",
      "text": "Perfect travel mirror! This provided great lighting and super magnification that I needed to put on my make up while on a recent 9 day trip. It is really light and packed easily. Would be nice if it was a two sided mirror and had a regular mirror with no magnification as well. Will never travel again without it! Definitely recommend this product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "The magnifier is stronger than most makeup mirrors so it can be good for close work",
      "text": "The single mirror is for magnifying use only. It seems well made. The magnifier is stronger than most makeup mirrors so it can be good for close work. But close work (tweezing for instance) can require some time, and the lights surrounding the mirror are extremely bright. They seem brighter than they need to be, so bright that it can be annoying for extended use. I think the mirror is fine for certain uses but I wouldn't travel with it and expect to not need a regular mirror.",
      "rating": 3.0,
      "verified": true,
      "author": "Joie",
      "helpful_votes": 0,
      "publication_date": 20151211
    },
    {
      "title": "Nice mirror, but not bright enough",
      "text": "This mirror is not as bright as my other Floxite 10x magnification lighted mirror, but it is very convenient for travel in that it closes and is compact. I have an adapter from my other Floxite mirror, so will be using that whenever I have an AC outlet, as the mirror does not come with the adapter. Within the box, the directions sheet explains that for $10.00 you can purchase one through Floxite. It would certainly be more convenient if they adjusted the price of the mirror and included the adapter, as they advise that using any other adapter than theirs could damage the mirror.",
      "rating": 4.0,
      "verified": true,
      "author": "Susan F.",
      "helpful_votes": 0,
      "publication_date": 20150413
    },
    {
      "title": "but overall very pleased with this product",
      "text": "The angle takes a tiny bit getting used to, but overall very pleased with this product. Business and personal travel take me to hotel rooms with inadequate lighting and the travel and home Floxite is perfect! Only have it 4 stars because I wish it had adjustable option, otherwise its great. I would buy it again!!",
      "rating": 4.0,
      "verified": true,
      "author": "Paty R.",
      "helpful_votes": 0,
      "publication_date": 20170715
    },
    {
      "title": "Awesome mirror with great magnification and batteries included!",
      "text": "Bought this for my elderly mother. She loves it. Its size is also perfect for traveling yet not intended for that purpose for mom. Comes with batteries so that was also a plus!! Excellent small mirror with super magnification. Thank you!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "LINDA-RAE S.",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Great mirror. May be a little big for travel.",
      "text": "It is a little big but the functionality is great. The magnification and clarity is wonderful. I love that the cover opens into a stand. This is very versatile.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Queen",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "My 'go to' travel mirror!",
      "text": "Fairly small, thin and travels easily. Very durable and very bright. I have been very pleased. The best travel mirror I've every used.",
      "rating": 5.0,
      "verified": true,
      "author": "Audrey",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Great little mirror I'd recommend this product.",
      "text": "Love this mirror...Great for travel...love it's fold up stand and it's compact but a good size. If your like me and need glasses to see this is a great little travel make up mirror.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose Syriac",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Don't give this as a gift",
      "text": "I bought this for my grandmother who has vision loss and when she opened it, she was so terrified of her face up close that she almost threw the mirror at me. I immediately felt horrible for my gift idea of this magnifying mirror because it upset her so much.",
      "rating": 3.0,
      "verified": true,
      "author": "Rootimer",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Half the Price of Sharp Image",
      "text": "My mother in law really likes this mirror. She asked me for one for xmas from sharper image for $70. This one was $35 and had all the same features. It delivers as promised. NO regrets.",
      "rating": 5.0,
      "verified": true,
      "author": "kwat734",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Awful Mirror",
      "text": "What a crappy mirror. I thought I could use this for shaving, but no chance of that. You have to get within an inch or two to see anything in this mirror, and then you can only see a tiny portion of your face like your nose or cheek. I paid about $26.00, and now I have to pay $8.00 to return it. This is a complete ripoff, do NOT buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Ken Shoop",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "Floxite Travel Mirror, Best Portable Mirror for Travel",
      "text": "Excellent travel mirror! I loved having this mirror traveling in Europe. It helped me to get ready in the mornings and to see what I was doing. (Great to see the whole face, not just a portion as some travel mirrors provide!) Sometimes I would put some books under the mirror to elevate it to the right height, but that was easy. After trying out other travel mirrors, I think this one is the winner. It's light weight and portable. Great for traveling, I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "K. C.",
      "helpful_votes": 0,
      "publication_date": 20141015
    },
    {
      "title": "Great for Travel.",
      "text": "I got tired of wrapping up my old stand mirror when we travel in our trailer so I bought this and am happy I did. It will be much easier to pack and find a place for it. It seems like it will not break easily and it is a nice mirror. Lke some people mention the lights are not that bright. It either needs more lights around it or brighter bulbs other wise I would have given it five stars.",
      "rating": 4.0,
      "verified": true,
      "author": "S. tamburinTop Contributor: Swimming",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "travel mirro",
      "text": "I take this with me when traveling and use when shaping eyebrows works better than my 3x mirror in my bathroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Best for traveling",
      "text": "I use it for traveling. This is my second one. I left my last one in a hotel and ordered this one. It is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Shopper",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Will this one break too?",
      "text": "This is the 3rd one I’ve purchased. The plastic back breaks pretty easily resulting in not being able to stand on its own. And I need it to. The most resent one is NOT near as bright as the previous ones. Even with new batteries.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "If you are ok with how slanted it sits, you really can not see your face that well.",
      "text": "I really needed it to sit up straight because the way it slants You can not see what you are doing.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Bostwick",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Old eyes see detail again!",
      "text": "At 61 my eyes aren't what they used to be. I found lots to tweeze using this mirror (even though I'd just done it the day before using reading glasses). It takes a little getting used to (such as the fixed angle, and whether to use reading glasses or not). I am soooo grateful for this mirror. It's a little large for travel use so I also bought an unlighted 10X hand mirror half the size of this mirror that I can take on longer trips.",
      "rating": 5.0,
      "verified": true,
      "author": "LP",
      "helpful_votes": 0,
      "publication_date": 20150506
    },
    {
      "title": "Nice mirror, but too big for traveling 'light'.",
      "text": "It's a nice mirror, but a lot larger than I was expecting. It's too big for a single carry-on. The lights are nice, but I'm not using it right now. I am still looking for a TRAVEL lighted magnifying mirror.",
      "rating": 3.0,
      "verified": true,
      "author": "Carol Newlin",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "It really is the best lighted travel mirror I have ever been able to ...",
      "text": "Welp, I just put another one of these babies in my cart - that's three now - in the last few years. It really is the best lighted travel mirror I have ever been able to find anywhere. So that's nice. The reason, however, that I've had to keep replacing it, is that the hinges break and fall apart. So there's that too. No, I'm not that hard on it. Bad design? Planned obsolescence? I don't know. Each time I swear I won't buy another, but I do.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161105
    },
    {
      "title": "Great travel mirror",
      "text": "Great travel mirror. I went back and forth over whether to get the 5x or 10x. I ended up getting the 10x because I'm 47 and I figured that my eyes won't get any better over the years. It is a little more magnification than I need currently (my home make up mirror is 5x), but it will be great for putting on eye makeup, tweezing, and touch ups. The lighting is great around the mirror and I like how it folds up. I'm very happy with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "lacalobo",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "Good for longer trips",
      "text": "My mirror just arrived and I put the batteries in to see how it works. It is large, and I could see really well with the 10x. The lights weren't as bright as my home (plug in) magnifying mirror, but they are enough to see what I really need to see. It is a little heavy for travel, but there are times I really need a mirror like this, so for longer trips I will take it. Maybe not for a weekend away when I am trying to pack lightly.",
      "rating": 4.0,
      "verified": true,
      "author": "Lynne G. Lascheid",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "Didn't Come With all the Pieces",
      "text": "Mirror arrived with the center connectors missing, so it was in two separate pieces. From what I could see while trying it out as it was laying flat, it seemed to be a decent product. There was good surrounding light and the mirror is a good size. However, since I couldn't use it, I returned it.",
      "rating": 3.0,
      "verified": true,
      "author": "Rhonda",
      "helpful_votes": 0,
      "publication_date": 20160512
    },
    {
      "title": "Very Poor Quality!",
      "text": "Received mirror \"damaged\" - therefore the 1 star rating. Overall the quality of the mirror/lights is not bad, but the mirror came with only one side of the cover hinged (the screw apparently fell out on this side before shipped)....and within 2 days of using the other screw fell out which made the cover fall completely off. So basically the construction is a piece of junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Pittsburgher",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Quality",
      "text": "Borrowed this mirror from a friend while on vacation.. omg the best mirror I have ever used. .. would definitely reccomend for those needing to wear glasses having difficulty seeing up close...",
      "rating": 5.0,
      "verified": true,
      "author": "T Cowan",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Keeping it but it is not the greatest",
      "text": "Product came used (not expecting that) as one of the batteries was leaking. Changed out the one battery and good to go. Used it on cruise but had to put more batteries in. The angle of the mirror is not correct for me but just propped it up with a towel. No problem. Light is not as bright as I thought it would be but OK.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "so if you don't have a surface to sit it on it won't be very useful. The light is very bright and the mirror ...",
      "text": "I'm sorry to say that the flimsy plastic hinge broke within a week or two. It is too large and heavy to use as a hand mirror, so if you don't have a surface to sit it on it won't be very useful. The light is very bright and the mirror is of good quality. However, the broken hinge is annoying and I don't recommend the product for that.",
      "rating": 1.0,
      "verified": true,
      "author": "Gladerunner",
      "helpful_votes": 0,
      "publication_date": 20151011
    },
    {
      "title": "Great but it broke right away",
      "text": "I loved the mirror at first. Well lit and lightweight and the magnification was great. But, then after several days use(once a day while traveling), the plastic pins that held the hinge together fell out. I found one in my suitcase but never found the other one. It still flopped apart with only one pin in. I had carefully packed it every day because I was worried about breaking the glass. I was gone over 30 days so when I got back and tried to report it on Amazon the \"contact seller\" tab did not come up. I am going to pursue this and try to get a pin replacement because I really did like using it.",
      "rating": 2.0,
      "verified": true,
      "author": "Catherine Cain",
      "helpful_votes": 0,
      "publication_date": 20160227
    },
    {
      "title": "MIRROR",
      "text": "LOVE IT USEFUL BUT I DONT LIKE LIGHT YELLOW SHOULD BE LED WHITE INSTEAD",
      "rating": 5.0,
      "verified": true,
      "author": "Audrey",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Problem with hinge",
      "text": "Nice mirror. Wife uses it everyday. Purchased 2 of them over past 2 years.the last July of 2015. Only problem is the hinge pins fall out. If you don't find them it makes its use a bit of a problem. Talked to the company that sells them floxite. That don't sell parts for it. It's made in China. They just say send it to them and if they can't fix it , sell you another one. FYI.",
      "rating": 4.0,
      "verified": true,
      "author": "FD",
      "helpful_votes": 0,
      "publication_date": 20160112
    },
    {
      "title": "Perfect",
      "text": "Second one. Can't live without it. Of course if your rough with it, it'll break. But my first one I've had it 4 years, it still works. Second one is for car! Stop looking, just buy it!",
      "rating": 5.0,
      "verified": true,
      "author": "dedums",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "The light on this mirror is terrific. There are so many places when traveling that ...",
      "text": "The light on this mirror is terrific. There are so many places when traveling that the light is too dim and using cheaters to put on makeup just doesn't work. However this mirror only tilts at one angle and finding a place to sit it when traveling where it is the proper angle to use is difficult. I found I had to find a tall dresser to sit it on- not found in many bathrooms or be able to sit on something and hunch over to see. I'll take it traveling next month to Cuba and see how it works. The material seems to be pretty cheap and I'm hoping it won't break.",
      "rating": 2.0,
      "verified": true,
      "author": "Shelia",
      "helpful_votes": 0,
      "publication_date": 20160323
    },
    {
      "title": "Very Big Disappointment",
      "text": "Very disappointed with this product. The lights burned out with a month of buying it. It was like throwing money away. Amazon should quit selling it. The only bad product I ever bought for Amazin.",
      "rating": 1.0,
      "verified": true,
      "author": "Kathleen Birmingham",
      "helpful_votes": 3,
      "publication_date": 20151118
    },
    {
      "title": "Good travel mirror",
      "text": "Good overall travel mirror. Works well for travel but it sits back a bit so I have to put something under it to tilt it forward when using.",
      "rating": 4.0,
      "verified": true,
      "author": "LC",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Does it work",
      "text": "LOVE THIS MIRROR. WENT TO VISIT MY SISTER AND SHE HAD ONE SO I ORDERED MYSELF ONE",
      "rating": 5.0,
      "verified": true,
      "author": "FAYSIE",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Do not hesitate to buy this!",
      "text": "I had one of these for several years and loved it for travel and at home! It's very stable when open and sits at the perfect angle for make-up application. My sister admired it and I don't remember \"giving\" it to her but mine disappeared. After trying several other travel mirrors - smaller, didn't tilt at the right angle, not 10X, dull lights - I came back to my favorite!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jody H.",
      "helpful_votes": 0,
      "publication_date": 20141007
    },
    {
      "title": "Works as described.",
      "text": "I very much like having a lighted mirror that does not need to be plugged in. I can easily move from bathroom to bedroom without having to plug and unplug to an electrical outlet. The 10x magnification is a good amount because with it you can view your entire face. With 15x magnification, I find it hard to see other than the small portion of my face the magnification shows. So far ... so good.",
      "rating": 5.0,
      "verified": true,
      "author": "coffee lover",
      "helpful_votes": 0,
      "publication_date": 20150222
    },
    {
      "title": "I can see my face!",
      "text": "I love this lighted mirror. The only problem is that I think the lights need to be brighter. I keep wondering if it's really LED, since it takes 3 batteries and dims pretty rapidly. But, since there is nothing else to compete with it, I'll be happy.",
      "rating": 4.0,
      "verified": true,
      "author": "RMBranch",
      "helpful_votes": 0,
      "publication_date": 20160728
    },
    {
      "title": "I bought for travel & was pleased with size & illumination",
      "text": "I bought for travel & was pleased with size & illumination. However the lid, which becomes the stand when you open the mirror, broke off about the 4th time I opened it! So not very happy. Will try to return/replace, but doubt I have original packing material now as I took the mirror on a trip immediately after receiving. I didn't forsee that it would break so easily, so I'm probably out of luck as I'll be on my trip for 3 weeks.",
      "rating": 2.0,
      "verified": true,
      "author": "cc",
      "helpful_votes": 0,
      "publication_date": 20160214
    },
    {
      "title": "Five Stars",
      "text": "works great for travel. small, thin so easy to pack",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "This is the best mirror I have purchased, perfect for contacts and eye makeup.",
      "text": "This is the best mirror I have purchased. I am +40 now and need to put contacts in daily, however I travel quite a bit for work so need something very portable. Lights are bright and the magnification is very strong. Perfect for contacts and eye makeup.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "Not as expected...",
      "text": "Not enough lights around the edges. Needs more with ability to have hi-lo settings. No way to adjust mirror angle. I wear glasses, but have to take them off for some things then put back on for others...yet still can't always get view I need. Too expensive for value received.",
      "rating": 1.0,
      "verified": true,
      "author": "K B.",
      "helpful_votes": 0,
      "publication_date": 20160316
    },
    {
      "title": "Best travel makeup mirror",
      "text": "This is an excellent travel mirror. It is lightweight and slips easily into the edge of a suitcase, the lights turn on at the push of a button and are blindingly bright, magnification is excellent, the mirror surface is very clear and easy to clean, and the mirror is very effective in dimly lit hotel bathrooms and bedrooms. I'm not going anywhere again without it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bearwife",
      "helpful_votes": 0,
      "publication_date": 20151029
    },
    {
      "title": "I love this mirror",
      "text": "I love this mirror! It is wonderful. I took it to Italy for ten days and did not require new batteries. It works great! I used to travel with my big mirror. This is unnecessary now. I would highly recommend this mirror to anyone who tweezses. I am 55 years old and need the magnification.",
      "rating": 5.0,
      "verified": true,
      "author": "LISA FIGURA",
      "helpful_votes": 0,
      "publication_date": 20161129
    },
    {
      "title": "definitely a great travel mirror",
      "text": "A little larger than I thought it would be, but could fit in a large bag, definitely a great travel mirror. Easy as a handheld mirror or to sit on a nightstand. Gets you out of the bathroom so someone else can use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine Bodenstedt",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Excellent product for the money.",
      "text": "I take this mirror everywhere I travel. It fits beautifully in my suitcase or travel bag.",
      "rating": 5.0,
      "verified": true,
      "author": "lisa hansen",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Too expensive not to have a plug included",
      "text": "For the price of this mirror shame on the manufacturer/seller for not including a plug. You have to go back to them to buy it or find one to purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "Dapsdaughter",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "This mirror's worst feature is that it's advertised here as 10x/1x",
      "text": "This mirror's worst feature is that it's advertised here as 10x/1x. Not true. It is only 10x, a magnification that is useless unless your nose is nearly touching the glass. Otherwise is seems well made and folds down to a slim size that would fit nicely in a suitcase. Too bad it doesn't really have a 1x side.",
      "rating": 2.0,
      "verified": true,
      "author": "Kelly Hess",
      "helpful_votes": 0,
      "publication_date": 20150405
    },
    {
      "title": "unHappy",
      "text": "Changing my review...I actually had bought two of these because I broke the first one. Loved it, until all of a sudden, for no reason it wouldn't light up anymore. Changed the batteries and everything. No light. I had only used the new one a couple of times. When the lights work, it's great.",
      "rating": 1.0,
      "verified": true,
      "author": "Debra",
      "helpful_votes": 2,
      "publication_date": 20150102
    },
    {
      "title": "A mess from start to finish, sorry to say",
      "text": "Ordered by accident. Design very poor. Difficult to open, side with mirror much heavier than other side (have to flip it to use it). Lights must be turned off manually and when in use, shine in your eyes!!! No power adapter!!! There is an input jack for one. No indication if or how batteries can be used.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Mercier",
      "helpful_votes": 0,
      "publication_date": 20150922
    },
    {
      "title": "Best Makeup Mirror EVER!",
      "text": "I bought this mirror in March for myself. Initially it was purchased as a travel mirror but I have literally used this every day since I've had it (9 months now). It folds flat and travels very well. You can see every pore on your face -the LED lights and magnification make this the best makeup mirror ever. Just purchased two more for my mom and sister for Christmas <3",
      "rating": 5.0,
      "verified": true,
      "author": "HollieWho?",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "Perfect travel mirror",
      "text": "This mirror is very lightweight and fits perfectly in suitcase or overnight bag. It provides a very bright light. The batteries last for about 2 weeks if used every day. I use this mirror for every trip and I travel quite a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele G",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "All good..",
      "text": "All good....would be better if entire ring emitted light instead of spots, but still good. I am happy with the product. I like the way it stands and that it will run on batteries (easy to use anywhere).",
      "rating": 4.0,
      "verified": true,
      "author": "natalie marie",
      "helpful_votes": 0,
      "publication_date": 20160524
    },
    {
      "title": "Pro: The lights Con: The size",
      "text": "Larger than expected. Bought it for travel and although it's flat, it is still large and not super light. The lights are what sold me and they do help. If you don't need the light, then go for a smaller mirror.",
      "rating": 3.0,
      "verified": true,
      "author": "JFW",
      "helpful_votes": 0,
      "publication_date": 20161020
    },
    {
      "title": "I love this mirror",
      "text": "I love this mirror. It works much better than an expensive one I have. The lighting is also better. The only downside, is that the angle is not adjustable. If you need it angled higher you have to put something under the base to lift it up. The design needs to be modified so that the base is adjustable. I still love it but wish it was adjustable.",
      "rating": 5.0,
      "verified": true,
      "author": "Painted Savvy",
      "helpful_votes": 0,
      "publication_date": 20150415
    },
    {
      "title": "Nice mirror",
      "text": "The clarity on the mirror is very good - no distortion as promised. Compact & easy for travel.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Fantastic magnifying/lighted mirror",
      "text": "I've ordered 2 extra mirrors because I absolutely love this lighted magnifying mirror. I have one in the house, one in the motor coach and one in my travel bag for when I have to travel by car or plane. I recommend getting one (or more) of this makeup mirror",
      "rating": 5.0,
      "verified": true,
      "author": "Lee M.",
      "helpful_votes": 0,
      "publication_date": 20150924
    },
    {
      "title": "This is my third Floxite and I really like it's 10X power for applying make up and plucking ...",
      "text": "This is my third Floxite and I really like it's 10X power for applying make up and plucking eyebrows. The covers/stands broke off, hence the need to buy the third one.",
      "rating": 5.0,
      "verified": true,
      "author": "Penny",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Decent enough",
      "text": "It was MUCH bigger than I thought it would be and the magnification is too much but the lighting is decent enough. Because it's big though, it takes a good amount of space for the base to sit on, and it's probably too big for travel for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Canon",
      "helpful_votes": 0,
      "publication_date": 20150901
    },
    {
      "title": "dizzying",
      "text": "The extreme curvature of the mirror makes me dizzy, and it is hard to focus clearly on any one area without seeing the other edge of the mirror......other than that, the workmanship is good, the LEDs way to intense. Not happy with this item.",
      "rating": 3.0,
      "verified": true,
      "author": "arztin",
      "helpful_votes": 0,
      "publication_date": 20160425
    },
    {
      "title": "Needs some modifications.",
      "text": "I really wanted this to work. First trip used it and the magnification was good and light was perfect. Went to use it on the 2nd day and the little pin thing that holds the mirror angled in open position was gone and the mirror will not stand open now.",
      "rating": 2.0,
      "verified": true,
      "author": "Martha",
      "helpful_votes": 0,
      "publication_date": 20160608
    },
    {
      "title": "it did help me apply makeup more confidently because I could see better.",
      "text": "It is not real glass. However, it did help me apply makeup more confidently because I could see better.",
      "rating": 2.0,
      "verified": true,
      "author": "Nicki J",
      "helpful_votes": 0,
      "publication_date": 20160729
    },
    {
      "title": "Large in size and thin enough for travel",
      "text": "This mirror is for my wife while traveling. After reading many reviews, she settled on this one due to the larger size. First look and she was sold. Large enough to see her whole face for applying makeup, and thin enough to place in her luggage.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20151215
    },
    {
      "title": "Great Mirror",
      "text": "Great Mirror for up close use! It doesnt have a non magnified side though. Its bright and great for brow work!!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Great mirror! Perfect for a vanity and a great",
      "text": "Great mirror! Perfect for a vanity and a great, protected travel mirror. If you are looking for a very magnified mirror, this is it!",
      "rating": 5.0,
      "verified": true,
      "author": "Ginger",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Buy this mirror it's the best!",
      "text": "When I saw this for the first time I already off QVC. Then I brought a other one at Bath and beyond. The third one I got was from Amazon. I have given one to my mom and my sister. My aunt even brought one too. It's perfect to travel with if you don't have good eyes you should definitely buy this.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy",
      "helpful_votes": 2,
      "publication_date": 20140129
    },
    {
      "title": "Nice for travel but you must set it on something for elevation.",
      "text": "The magnification and illumination are fine. The size is great for a travel mirror and it folds almost flat. The only downside I found is that you have to set it on something to use it. On my last trip I had to set it on top of a roll of toilet paper plus 2 books in order to use it at the desk. There was no way to use it in the bathroom.",
      "rating": 4.0,
      "verified": true,
      "author": "Dr Robin",
      "helpful_votes": 0,
      "publication_date": 20150507
    },
    {
      "title": "Needs some improvement",
      "text": "The magnification on this mirror is just fine. The problem is that there is no way to set it to the position that you need it to be in so you can see properly. I've tried putting things in the back of it to hold it in place but it really doesn't work that well",
      "rating": 3.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 0,
      "publication_date": 20160213
    },
    {
      "title": "LED Lighted Travel Mirror",
      "text": "Love the size and case, but needs ability to adjust the settings -- angle is not quite right. Always having to lay it down flat, or prop it up to get the right angle for makeup application, LED's don't provide enough light where needed and magnification is almost too much. Use it for travel only -- searched for years, haven't found anything better in a small travel size.",
      "rating": 3.0,
      "verified": true,
      "author": "designergal",
      "helpful_votes": 0,
      "publication_date": 20140113
    },
    {
      "title": "Nice and large, good lighting",
      "text": "Love how large this is-- allows you to see your whole face and hair. Folds thin so easy to take for travel. The lighting is very good on it. Only downside is that it does not stand up higher, but if it had a stand it would take more space when traveling",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20160315
    },
    {
      "title": "Most compact for Air Travel",
      "text": "This isn't the best lighted mirror I use but it's the most compact for travel. My impression is that it's not well lit and not quite as strong a magnification as I'd like it to be but it's better than nothing. Baggage handlers destroyed a previous mirror and the first replacement mirror I bought, which I love, is too bulky for packing so I bought this one.",
      "rating": 3.0,
      "verified": true,
      "author": "60andcounting",
      "helpful_votes": 0,
      "publication_date": 20140909
    },
    {
      "title": "My wife uses it when we travel in our camper... Loves it!",
      "text": "I didn't think this would be a good product when I bought it for my wife but she loves it and she uses it while we travel in our camper. Floxite should advertise this in camping magazines, it is great for travel and folds up flat.",
      "rating": 5.0,
      "verified": true,
      "author": "wayarm",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "Let There Be Light",
      "text": "After spending a weekend in a hotel room with terrible lighting in the bathroom, I bought this mirror. Fast forward to another dim hotel bathroom and... I love this mirror! Now my lipstick is actually on my lips! Nice size, folds flat & the cover protects the LED bulbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessisme33",
      "helpful_votes": 0,
      "publication_date": 20160208
    },
    {
      "title": "Just what I was looking for",
      "text": "This is great for anythign that needs a close up mirror and the lights are nice and bright so you can see what you're doing. I'd order again for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori Snyder",
      "helpful_votes": 0,
      "publication_date": 20161016
    }
  ],
  "product_meta": {
    "title": "Floxite LED Lighted Travel and Home 10x Magnifying Mirror",
    "description": "Size:10X| Color:GrayFloxite LED Lighted Travel & Home - 10x Magnification. Bright lighting - bulbs never need replacing. Operates with 3 AAA batteries (included). Cover turns into stand for hands-free viewing. Folds flat (1 inch) for easy travel and storage. Includes mirror and instruction manual. Silver.",
    "rating": 4.1,
    "feature_bullets": [
      "The 10x magnifying distortion free glass combined with the focused light is the perfect mirror to apply makeup.",
      "The protective cover folds back to become the stand enabling you to use this mirror \"hands free\".",
      "8 LED bulbs illuminate your face to show details clearly plus the bulbs never need replacing. Can be used for Contact Lens Insertion",
      "The mirror measures with a 7 x 9.25 inch frame, 6 inch diameter viewing area, and folds down to less than one inch thick making it perfect for travel and storage.",
      "Operates with 3 AAA batteries which are included so you are set to go when you receive it"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1 x 7 x 9.2 inches; 1 Pounds",
      "Item model number": "FL10LFM",
      "Department": "Womens",
      "Batteries": "3 AAA batteries required. (included)",
      "UPC": "744855108411",
      "Manufacturer": "Floxite",
      "ASIN": "B0013KY6QA",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Compact & Travel Mirrors",
      "Mirrors",
      "Tools & Accessories",
      "Appliances",
      "Beauty & Personal Care"
    ],
    "price": 41.85
  }
}