{
  "website_summaries": [
    {
      "verdict": "These nutrition-concentrated tablets plummet to the bottom of your aquarium like a rock, and it won’t stay there long because this algae-based formula is a magnet for hungry plecos.",
      "pros": [
        "Concentrated green algae center that plecos can’t resist",
        "Wafers quickly sink to the bottom",
        "Fortified with essential vitamins and nutrients",
        "High fiber diet",
        "Vegetarian meal"
      ],
      "cons": [
        "While these pleco wafers feature a large amount of delicious algae, they also contain wheat and artificial food colorings"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Our giant plecos absolutely love this stuff",
      "text": "Our giant plecos absolutely love this stuff! We've tried most of the brands too. This is by far their favorite. They come out of their hiding spots almost as soon as it hits the water. We have 2 plecos in the 125G tank. One is over 14\" long the other 10\".",
      "rating": 5.0,
      "verified": true,
      "author": "helodriver20",
      "helpful_votes": 29,
      "publication_date": 20170527
    },
    {
      "title": "Cloudy, with a hint of algae.",
      "text": "I was very excited to finally find a \"true\" veggie wafer for my fish. While these wafers are about 1/2 to 1/3 the thickness of the algae wafers I've been using, 2 wafers significantly clouded up the water in a 40 gallon crystal clear aquarium. They seem more like potato chips than algae wafers. The fish ate them, and I'm hoping the tank clears up in a couple hours. I'll finish the bag by feeding these at night, before I go to bed, and hope the water is cleared up by morning. Wouldn't purchase these again. Note: The water does clear back up within a couple hours after feeding.",
      "rating": 2.0,
      "verified": true,
      "author": "Netcub",
      "helpful_votes": 18,
      "publication_date": 20161224
    },
    {
      "title": "My fishes only eat the inner algae disc",
      "text": "My common pleco and guppies only eats the inner algae disk. The outer yellow ring were only partially eaten on first few feedings then they completely ignore the outer portion. The yellow rings started to make water cloudy after few days. I found breaking off the yellow outer ring works better for my fishes.",
      "rating": 3.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 10,
      "publication_date": 20180918
    },
    {
      "title": "Happy snails.... to you.... until .. we meet.. again...",
      "text": "Tried a few different algae wafers to make sure our snail and other algae eaters are content. All I can say is.. our tank is pretty clean.. and Gary, our 2+ (3+?) year-old snail, is reallly plump and happy!",
      "rating": 5.0,
      "verified": true,
      "author": "RedRob",
      "helpful_votes": 22,
      "publication_date": 20160515
    },
    {
      "title": "Don't Buy - Hard to Sink",
      "text": "Don't trust the reviews. I think they include the solid algae wafers, without this beige stuff. I've made the mistake of buying these with the beige ring on the outside. They're horrible. First of all, THEY DON'T SINK. You have to soak them in water first and hope they'll stay down. It's ridiculous. Secondly, the beige part breaks off and grows nasties quickly. It creates a slimy, fungi like substance you have to remove from the tank(s) to keep them healthy. Thirdly, my plecos and other algae eaters aren't too fond of these. Always leftovers. Don't waste your money. I'm going back to the Northfin KELP WAFERS. I will upload a video later.",
      "rating": 1.0,
      "verified": true,
      "author": "Some Blue Devil",
      "helpful_votes": 2,
      "publication_date": 20200316
    },
    {
      "title": "Really don't want to give a bad review just because my guy is picky",
      "text": "My pleco won't touch these. Think maybe I made a mistake trying a different brand than what he's used to. Didn't realize until I noticed my neon tetras were diminishing in number without the evidence of dead bodies. He started cannibalizing his neighbors out of sheer hunger. Had to go back to Hikari wafers. Really don't want to give a bad review just because my guy is picky. Didn't work for me but might work for you.",
      "rating": 3.0,
      "verified": true,
      "author": "TGB",
      "helpful_votes": 4,
      "publication_date": 20180420
    },
    {
      "title": "Not your average aquarium supplement",
      "text": "I purchased Tetra PlecoWafers because my aquarium has a plecostomus (duh) and I have been satisfied with other Tetra products. Typically my pleco is boring because it is rather nocturnal. When the Amazon order arrived I offered a wafer and the pleco immediately behaved as if I had given it an underwater frisbee. Pleco picks up the wafer and carries it around in a really amusing manner. Then the gourami join in on the fun. They bite off pieces of the wafer too. I have no idea if it is a recommended gourami food but at 28% protein, it can't hurt.",
      "rating": 5.0,
      "verified": true,
      "author": "Delay",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "My shrimp otos and platys like them",
      "text": "I originally bought these as an extra food supplement for my shrimp and Otocincluses, but it turns out my Platys will occasionally take a nibble even though they're getting their own food. These wafer are quite large, so for my nano tank, I only feed half of one at a time so there isn't any left over. If you're not careful, these can cloud up your tank, so be sure to keep track of how much you're putting in. They expand and break into floaty chunks if not eaten. Otherwise, no real complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Enigma4youTop Contributor: Pokémon",
      "helpful_votes": 2,
      "publication_date": 20181027
    },
    {
      "title": "Great snack and healthy for community fish and inverts",
      "text": "I have a 75 gal freshwater aquarium and I House freshwater shrimp, micro fish, corys, various catfish, otos, snails, flying fox, and banded loaches. Every single one of those LOVE these wafers. I drop 1-2 in per day and everyone fights to be the first to eat them. Nothing goes to waste and they do not cloud the tank or cause extra waste. I’ve been using them over a year and have them on a subscription so we never run out. These are perfect for community tanks and apparently they all love the taste!",
      "rating": 5.0,
      "verified": true,
      "author": "Moriko",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "keeps the truck clean",
      "text": "The directions say you need a #2 phillips screwdriver. You need a Torx#15 to remove existing screws. I used my 1/4 socket with the T15. Did not have to remove the tires. Was easy to drill the 1 hole in each fender. I am 68, and did it in about 1 hour. Once you get the first one done, it goes fast. I used loctite on all the screws when I replaced them. These seem pretty heavy duty. They also look good on the truck.",
      "rating": 5.0,
      "verified": true,
      "author": "SGM HORNE",
      "helpful_votes": 3,
      "publication_date": 20190107
    },
    {
      "title": "Mr. Belvedere loves them!",
      "text": "So, my pleco - Mr. Belvedere - is a huge fan of pleco wafers (it's in the name, people). Mr. Belvedere swims vigorously to get to the wafer when I drop it in the tank. The goldfish - Mate - always tries to make a go for it, but Mr. Belvedere (normally a very 'let me get out of your way' type o'fish) makes sure to stake his food claim. Mate then has to wait the 5 seconds for me to drop the goldfish food (another good item) in the tank. I have bought the wafers multiple times and will continue to do so!",
      "rating": 5.0,
      "verified": true,
      "author": "soy.de",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "YOUR PLECOS WILL LOVVVVE THESE!",
      "text": "Loved the way the plecos jumped-figuratively speaking!-on these little mini-fried egg-looking discs: yellowish with a green center. And, to show you their appreciation for such a great treat, overnight they will decorate your plants and decor, kind of like popcorn strings on a Christmas tree! In the morning you may be transported back to your high school days when TP-ing a favorite individuals house and trees was a really fun thing to do! UNLIKE the toilet paper, the strings of digested wafers will eventually fade away. The plecos love these, so, I do, too!",
      "rating": 5.0,
      "verified": true,
      "author": "SJD",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "My snail likes it",
      "text": "I dropped one of these wafers in the water, and my gold mystery snail started chomping on it right away. He spent at least 8 minutes feeding, so he clearly recognized it as a good source of nutrients.",
      "rating": 5.0,
      "verified": true,
      "author": "NorEsBo",
      "helpful_votes": 4,
      "publication_date": 20181217
    },
    {
      "title": "makes water dirty",
      "text": "My mystery snail really likes them. The only problem is that after a few hours they get fluffy and gunk up my water. As I only have a 2 gallon tank with a betta and a snail, I decided on no filter for this tank. I could not find any other algae food options that do not mess up the water just like this one. All of this considered, I have been leaving one of them in the tank for only a few hours, letting it get barely soft and then taking it out regardless of if my snail has started eating it or not. That way it does not totally dissipate into my water.",
      "rating": 5.0,
      "verified": true,
      "author": "Claire",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Holy cloudy water Batman!",
      "text": "So these were such a great deal I ignored all the negative reviews saying they clouded your water. I mean I have a 50 gallon tank and just feed my algae eater two little discs a day so I mean it couldn’t do that much harm. Ummmm by the third day (6 discs that are like as thin as a dime and as big as a nickel) my water (which I had just done a 1/3 water change plus two new filters) was so cloudy it looked like the bottom of a swamp. SIX DISCS! My algae eater might like em but I’m going back to my old brand because this is ridiculous!",
      "rating": 2.0,
      "verified": true,
      "author": "derwood",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Pleco won't touch them plus they have yucky artifical dyes",
      "text": "My pleco hates these pellets. He won't touch them. He sucks them in and spits them right out. I've tried for days to get him to eat them, and he will not touch them. Plus, since he won't eat the pellets, they proceed to cloud up my fish tank. I looked at the ingredients, and one of them is artificial dye. Yuck! Usually, Tetra has been a reliable company with good products, but these pellets suck. I'll be contacting Amazon to get a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "LP",
      "helpful_votes": 7,
      "publication_date": 20160318
    },
    {
      "title": "Everyone loves these",
      "text": "Had I written a review a week after I ordered I would have been critical as the ONLY fish interested in the wafers was my Pleco. After some time EVERYONE loves these.. so much so the pleco gets booted off of them. Corys, loaches, ottos, you name it. Everyone approved.",
      "rating": 5.0,
      "verified": true,
      "author": "Eddie",
      "helpful_votes": 2,
      "publication_date": 20200120
    },
    {
      "title": "Fish won't eat them",
      "text": "I had forgotten that I used these once before with the same results. My plecostomus will not eat them. They dissolve on the bottom of the tank and even my cichlids won't eat them. They look cute though with the little green centers. How do I answer the question about flavor? I'm not going to taste them myself and my fish won't tell me if they like the flavor or not. I have to assume not.",
      "rating": 2.0,
      "verified": true,
      "author": "Orlando Bill",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Fish eat the middle out of the wafers first",
      "text": "It's funny to watch but all my fish do their best to just eat the middle of the wafer first, which makes me thing the outer ring may be a little bland or useless to them - but given that my fish don't care for algae tablets, this seems to be the best (if not a little wasteful) way to get them the algae they crave. They do sink VERY slowly so you may have to \"guide\" them a bit to make sure where you want them in the tank. I want mine near my pleco's cave or they won't come out to eat them.",
      "rating": 4.0,
      "verified": true,
      "author": "Jan S",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Bottom feeders love it",
      "text": "My algae eaters, and plecos love this product. The price is very reasonable for the quantity of food supplied. I have two glass algae eaters , one gold albino algae eater and an albino pleco. All of these fish seem to love this food. I feed them twice a day about 12 hours apart and give them one wafer each. I rarely have any remains between meals. I recommend this product as an economical way to feed these types of fish.",
      "rating": 5.0,
      "verified": true,
      "author": "James M. HIll",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "DO NOT BUY !!!!!!!!!!",
      "text": "Holy cow, this stuff is TRASH. It DESTROYED my tank water within an hour of dropped 2 pellets in a 45 gallon tank. My fish avoided them like the plague and my water turned green, cloudy, and stinky within an HOUR. Had to do a 50% water change after doing a change the day before and I still feel like I need to go in to take out more.",
      "rating": 1.0,
      "verified": true,
      "author": "alex",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Great price but..",
      "text": "I got these for my new ramshorn snails. I placed a pellet on the tank and only one of my snails went for it ( I have 8). I left it there for about about a day, and then I noticed very tiny worms were all over my tank. To be fair, I had just added my new snails, so it could have been stuck in them somehow. So I cleaned the tank again, and I haven't seen any more detritus worms in my tank, but I haven't added more pellets. I will try again soon once the baby snails hatch, but since only 1 snails liked them, then my review will stay at 3 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "Joli",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "My pleco loves these wafers",
      "text": "I addd a plecostomus to my chiclid aquarium over five years ago. It did a great job removing algae, but after over five years it stopped eating much algae. I asked the local pet store, and they said as a pleco ages, they frequently stop eating algae from the sides of the aquarium and need to be feed an alga based food to maintain their health. I tried these and the fish loves them. My pleco is now 10 inches long and eats 5 - 6 of these day.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Killed everything in my eco globe in 18hrs",
      "text": "I’m so upset. I bought these to feed all the organisms in my eco globe because they ate all the algae. It killed everything in it in like a day. Everything. I don’t know what the hell they put in these but it must have extreme levels of nitrates or something because even the water fleas died. The snails. The mud worms. Even the little shrimp. All died.",
      "rating": 1.0,
      "verified": true,
      "author": "tommy ohlrich",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "HORRIBLE! GAVE MY FISH DROPSY",
      "text": "This stuff is absolutely horrible I don't know what they put in it, I let it sink in my tank my snails and pleco did not want to eat any of it at all. However my Bettas were eating it and half a week later two of my perfectly healthy Bettas have developed dropsy because of this! Now I have to treat the whole tank with antibiotics because this food came with some horrible disease causing bacteria. Would give zero stars if I could, how can they sell this junk that kills fish as gosh food?! And it clouded my water!! DONT BUY",
      "rating": 1.0,
      "verified": true,
      "author": "Crescent",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Mystery snails love them",
      "text": "I got these for my mystery snails. At the beginning, they didn’t really care for them and I had to scoop them out of the tank the next day. However, after trying for about 5 days, I’ve noticed they started disappearing the next morning. Add the fact that my mystery snails have grown quite a bit larger since I’ve got them and I’m pretty sure that they are eating these at night. Pretty happy with these and they’re pretty cheap too.",
      "rating": 5.0,
      "verified": true,
      "author": "Xing W.",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Good basic supplemental food for my plecostomus. Besides fresh zucchini, frozen peas, and wood.",
      "text": "I feed this to my pleco and the other South American cichlids also like it. But its not the sole food. I mix it up with slices of fresh zucchini, thawed frozen peas, and wooden structures. If you are a newbie, you need to have some type of wood in the tank. There are organisms that grow in the wood that are essential to a happy pleco. Do your research. My pleco is 10+ years old and over a foot long.",
      "rating": 5.0,
      "verified": true,
      "author": "El See",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Killed everything within 24 hours",
      "text": "I added these to a freshwater tank that had a living plant on top with its roots extending into the tank. We were growing tadpoles in the tank for about 3 weeks happily but I bought these for nutritional support. I added one wafer which was definitely overkill since it was still half there a few hours later. Within 16 hours the plant was dead. I though it was a fluke but within 24 hours our biggest tadpole was dead. We released the remaining tadpoles into the stream in hopes they would make it. Frustrating that I had to buy not only one, but two bags of these, which I now will never use for any living thing again.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Good product",
      "text": "Price was cheap and my pleco got sick. Switching to this food magically made it better after 2 days. The bag is a good size and as far as taste or flavor, I drop 2 or 3 in the tank and walk away.... 4 hours later the tablets are gone so I guess that means it likes them",
      "rating": 5.0,
      "verified": true,
      "author": "Megan Thomas",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Fish love them. I hate them",
      "text": "My algae eaters get these a couple times each week to make sure they have enough to eat and are well nourished. I don't know what they did to the formula, but these leave the water very cloudy for days. The older formula looked different and didn't cloud the tank. Tetra products are typically very good but this is frustrating and IU will have to use a different brand.",
      "rating": 2.0,
      "verified": true,
      "author": "Ryan hale",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Works great",
      "text": "All the fish love them include the Plecostema. I feed the wafers around 15 minutes after the auto feeder. I have some large fish that eat them like a graham cracker after the normal feed. I drop 1/2 of them flat side to the glass directly in front of the Plecostema lair and he comes out and scarfs them down. I only feed them every other day. Works like a charm. Good luck. D",
      "rating": 4.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Sneaky fish but it must be eating these",
      "text": "Our plecostomus loves these. We think. As anyone who has ever had a plecostomus can tell you, they are very sneaky and secretive fish. But every night we drop several of these veggie wafers into its tank, and by the morning the wafers are gone. And the plecostomus has grown from about four inches long to over one foot long in less than one year. So, we vote for these wafers as excellent food for a very cool (but sneaky) fish.",
      "rating": 5.0,
      "verified": true,
      "author": "George Waters",
      "helpful_votes": 19,
      "publication_date": 20131117
    },
    {
      "title": "Our plecostamus loves these!",
      "text": "We have been feeding these to our pleco for some time and he loves them. I transfer them to an air tight container when they arrive. It makes them easier to feed. They would not work for a small pleco. Our pleco is 8 inches long and he can easily eat these discs.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin and Mari Cornish",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Pollutes Water!!  False advertising!",
      "text": "Nothing in the tank eats these things. They must taste horrible because even the snails avoided going near them. Instead they sit on the bottom, swell up, make the whole tank murky and cloudy and then you must do a water change within a day to keep parameters healthy. What a waste of money!! Package says \"Clear H2O formula\". Ha! That is a bold faced LIE!",
      "rating": 1.0,
      "verified": true,
      "author": "Runs with scissors",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Good product for my fish",
      "text": "I didn't care for the wafers personally (a little too bland for my taste) but my Plecostomus and clown loaches sure like them. Even my aneas catfish like them too. Guess I don't have to like the taste - as long as the fish do is all that matters.",
      "rating": 5.0,
      "verified": true,
      "author": "Al Lingofelter",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Should have listened to 1 star reviews!",
      "text": "This stuff is awful! I've never had a problem with a foggy tank until I started using this. Tank became cloudy after the very first use. After the 3rd feeding I decided to hold off on it and see what happened. The tank cleared up in a few days. Added another tablet and the very next day the tank became cloudy again. Don't recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Pauline",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Discolors tank water, floats",
      "text": "The plecos love these but they keep floating in the tank. I think the plecos would enjoy them much more if they would just sit at the bottom like they're supposed to. The plecos definitely smell them in the water and come out looking for them. Also, I have noticed that my tank water gets dirty much faster when feeding with these.",
      "rating": 3.0,
      "verified": true,
      "author": "kbwils",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Fish will not eat these",
      "text": "I have purchased Tetra products for over 40 years - this is the first time I have been unhappy with one of their products. These are different algae tabs than I have had before. They advertise a \"2-in-1 tablet\" with a algae core in the center and some sort of food concentrate around the outside of the core. Problem is, my otocinclus and loaches won't eat the outside material and so it gets slimy and begins to grow fungus. I had never had this happen with the standard Tetra tabs or any Hikari product. I had to return.",
      "rating": 2.0,
      "verified": true,
      "author": "Coach Z",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "arrived on time and plecos love them",
      "text": "Needed these for our plecos that keep the glass so clean on our aquariums that they get hungry. These little wafers are great and the plecos (standard and bristlenose) both love them. THey do not cloud the water and price was right. prime shipping made this a better choice than the 30min drive to the pet store.",
      "rating": 5.0,
      "verified": true,
      "author": "shelly k.",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "My Snails Didn't Like It",
      "text": "My snails didn't like the Tetra Algae Wafers. However, the Betta fish took a few chomps out of it. He seemed kind of protective of it, so I thought maybe the snails were just avoiding him, but I tried another snail snack and that one was popular. Who knows. I can't read the mind of my snails, I can only report that I ended up having to clean these snacks out of the tank.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Fully-vegetarian food, a rare find.",
      "text": "The only truly vegetarian fish food I could find on Amazon (assuming the vitamin and mineral supplements listed in the ingredients are also plant-based.) Lots of other algae-based feed products actually contain fish meal. I don't keep fish but the ramshorn snails in my tank loved it. I use it for supplementary feeding when there doesn't seem to be enough algae growing to keep them happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Erick",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Good food source, better starter for an algae bloom",
      "text": "Used these sparingly over the past couple months, my Dwarf gourami , Cory Catfish and Plecco loved them. I dropped one in weekly. Unfortunately I didn't notice my water turning from crystal clear to green and correlate the tabs to the cause in time. After changing 25-50% of my water for a couple days I am back to normal, but no more wafers in my planted tank....",
      "rating": 2.0,
      "verified": true,
      "author": "CLTGUY",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Best munch meal!!!",
      "text": "Okay guys so I have 7 Khuli Loaches and 2 African Dwarf frogs and some snails all in different tanks with other fish/ shrimp and I found these pellets online and let me tell you they are insanely good for them all of them love to munch on them it’s even fun to watch the only downside is that it will leave your tank cloudy if they don’t eat it right away which is somewhat understandable because they dissolve super quickly so I would give them as soon as you know your fishes are hungry also if you have a good filter it won’t be that much of a problem but definitely worth buying !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "There were supposed to be two bags, but they only gave me one.",
      "text": "There were supposed to be two bags, but they only gave me one. The minimum order was two bags, which I selected. And there is not a way available to request the missing bag. There is only the option of returning the item for a refund, and then reordering, which I do not want to hassle with. We are experiencing a pandemic after all. On the other hand, my amano shrimp love these and fight over them.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael Sears",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Excited Snails!",
      "text": "My snails and catfish get REALLY EXCITED whenever I put one of these in the tank. I don't know if you've seen excited snails before, but I have and this does the job. It's like opening a bag of fritos near my husband. Instant happy and munch. If you leave the leftovers in the tank it can cloud the water, so follow the package directions and take out any leftover after an hour.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessie",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Not really healthy for fish...",
      "text": "I got these to try them out, the fish really do like the smell of the pellets but unlike other products, these are literally all wheat and grain. There is literally more yeast in this, the algea is only there for smell and color. If you have another 2 bucks, do yourself and your fish a favor and get something that doesn't have grain as the first ingredient and seaweed/algea as the LAST",
      "rating": 2.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Not for Nerite snals or glass shrimp and created huge mess.",
      "text": "I purchased these for use with ghost/glass shrimp and nerite snails. Nerite snails are exclusive algae eaters and totally ignored these.. The ghost shrimp, which tend to gobble up algae in my tank in the past, picked a bit but ignored it for the most part. The worst is the mess. After two hours, the table broke up into ever smaller dissolving pieces. Huge mess to clean up.",
      "rating": 1.0,
      "verified": true,
      "author": "DataHaunt",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "My fish won't touch these",
      "text": "My fish won't touch these and they cloud the water a little. I use the API brand (API Algae Eater Alage Wafer) and the fish love them but when I put these in for the first time they darted to them like the API brand but quickly darted away and will not touch them. I got them due to cost but I guess you get what you pay for. Just to test I waited a couple of days and then dropped in one of each (API and this one), the fish went straight to the API but again would not touch this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Justyn W.",
      "helpful_votes": 5,
      "publication_date": 20141218
    },
    {
      "title": "Great for Snails and Crawfish!",
      "text": "Bought these to add some nutrition to our snails and crawfish. They love them and especially the brown part around the edge, a lot more than the green middle. We drop one or two every other day and they just love it. Planning to keep buying them once our happy snails and crawfish are running low.",
      "rating": 5.0,
      "verified": true,
      "author": "Javier & Annaliet",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "this is how to keep your snails alive",
      "text": "I killed the first snail I added to my betta tank not knowing they needed these algae wafers to eat. My snail is almost a year old now. The betta likes the wafers as well. I drop in one per week. Funny side note: my Pomeranian thinks they're treats and has to have one a week as well. Silly dog!",
      "rating": 5.0,
      "verified": true,
      "author": "Prime Kat",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Clouds water.",
      "text": "I couldn't figure out what was causing the water in my aquarium to get cloudy. It's the outer brown edge to this product. I just cleaned the bowl again and will try chipping away the brown as the center is supposed to contain algae. I'll follow up with my review if it does. My Snails didn't want to eat it.",
      "rating": 2.0,
      "verified": true,
      "author": "Dena.",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Wafers keep my fish happy",
      "text": "These are called pleco wafers but they should just be called fish food. My platys love to eat the wafers also and manage to push it into cracks where the 8 inch pleco can't reach. Needless to say, the pleco gets distressed and charges the platys for his food. I added in extra wafers to keep everyone happy.",
      "rating": 4.0,
      "verified": true,
      "author": "Galactic llama",
      "helpful_votes": 2,
      "publication_date": 20171002
    },
    {
      "title": "Read the description carefully!",
      "text": "My bad. I did not read the description completely. They are algae plus protein. Unfortunately my pleco did not like these. He prefers algae only wafers. They don’t dissolve quickly, which was actually good when I realized he wasn’t eating them. Made it much easier to scoop them out of the tank.",
      "rating": 3.0,
      "verified": true,
      "author": "Sheila O'C",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Floating and the plecos don't like them",
      "text": "This new bi-color formulation seems worse than the first, They float instead of sinking and my bristlenose plecos don't seem to like them. They taste them once then ignore them. The shrimp and guppies like them, but I bought them o feed the plecos. So ... a fail.",
      "rating": 2.0,
      "verified": true,
      "author": "Denise M.",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "My fish love them",
      "text": "These are great for my two large Plecos. They love them and rush to snatch them up whenever its feeding time. No excess algae build up in my tank after switching to these and the do not make the water overly cloudy either. Granted, my filter setup is a bit of overkill for my tank but still rather clean nonetheless. Did not notice any flaking off as they sank, stayed together until they were consumed. The price was lower than local shops and the shops around me never seem to have any of these or any other algae disk in stock.",
      "rating": 5.0,
      "verified": true,
      "author": "AMasterofMayheM",
      "helpful_votes": 2,
      "publication_date": 20160502
    },
    {
      "title": "Fish went nuts for this food he loves it",
      "text": "The bottom feeding fish went nuts for these I was using the little balls. When I put some of this in my bottom feeder toile it to his hiding place to keep it all to himself he didn’t dinner this with any other food. It was funny to watch him. Had to wait it’ll he was off eating the 2 he took I put another one in for the 2 very small cat fish",
      "rating": 5.0,
      "verified": true,
      "author": "Michele M.",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Good pleco pleaser.",
      "text": "Our pleco loves these things. Within minutes of dropping one in he consumed with it. Word to the wise, if you don't want long trails of pleco poo floating throughout your tank (and have wood for them), only give one tab every other ( or couple) of days.",
      "rating": 5.0,
      "verified": true,
      "author": "BrickieBella",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "My fish love them, my tanks do not.",
      "text": "My catfish and plecos absolutely love these. It's an outright feeding frenzy seconds after these hit the gravel. That said, I know I'm in for hours of cloudy tank after I drop a couple in, and I've seen a decline in my filter life from 3 weeks to 1.5-2. The bags are huge. Can't wait to finish these up so I can go back to my old algae wafers that don't cloud my tanks and clog my filters.",
      "rating": 3.0,
      "verified": true,
      "author": "Gene L.",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "WATCH OUT!",
      "text": "My Pleco, shrimp, snails ~ NOTHING eats this stuff. I've lost some shrimp and think this is way. I have never lost shrimp like this before and I have abt 200 of them.... I wish I had read the reviews befor buying this stuff!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Nana",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Not for my mystery snail",
      "text": "I bought this for my mystery snail. He doesn’t eat any of it, and it pollutes the water in a few hours. The food itself looks high quality, it is just not for my snail. Going back to regular floating food (which eventually sinks down to the bottom after a little while).",
      "rating": 3.0,
      "verified": true,
      "author": "Bewdiemai",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Love and will buy more.",
      "text": "My albino Plecko and especially my bristlenoe Plecko love them as do the Mollies in my tank. BUT I also slice zucchini and poach it in hot water for 5 min, use a straw or knife to remove seedling center and they munch the heck out of them til there is nothing left of either the zuccini nor the wafers.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary_Selix",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Great Value and slow dissolving",
      "text": "These are the best wafers I have found and the price is great as well. They dissolve very slowly and do not make the water cloudy as others have in the past. The shelf life is very long so when you can buy it on sale, stock up!",
      "rating": 5.0,
      "verified": true,
      "author": "Callie",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Delicious!",
      "text": "First, I gave this 5/5 stars for flavor but I have to be honest, i haven’t tried them personally. My tropical fish, including plecos, mollies, and gouramis all LOVE these! They do make a huge mess if you feed too much, so beware of that!",
      "rating": 5.0,
      "verified": true,
      "author": "Castle",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Killed every fish in my fish tank",
      "text": "I must’ve received a bad batch because it killed every single fish in my tank. But the blame is on me because I should’ve went to the pet store instead of Amazon for pet supplies. Do you live you learn and don’t but pet food from amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "New formula? Bad batch?",
      "text": "I've been feeding my pleco Tetra's algae wafers for as long as I've had him. After finishing the last bag, I purchased another one here on Amazon. For some reason, the wafers are not sinking like they usually do, no matter how much you push them down in the tank. Now, just a few days after using it, two of my mollies are dead. My tank is clean and the water conditions are fine. I won't be buying this again.",
      "rating": 1.0,
      "verified": true,
      "author": "Mara",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Pro is Dirtier than standard all Green ones",
      "text": "The pleco loves these just as much as the all green Tetra Pleco Wafers, but these cloud the water much more than the green ones. In the future I'll stick to the solid green ones, not sure what is in the brown outer edge, but it turns the tank looks brackish for a couple of hours after feeding.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric B.",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "D The plecos and loaches in the tank like them a lot",
      "text": "These look different than your typical algae wafer. You can see the difference in color on the center. That didn't mean much to me since I'm not the one eating them :D The plecos and loaches in the tank like them a lot, but WOW! The silver dollar fish absolutely love them! I'm still not going to eat them, but they must be doing it right to have that feeding frenzy that occurs when I drop these in the tank!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Pleco Approved",
      "text": "Our pleco and apple snails eat these at night. I shake a handful into the tank and by morning they are all gone. Even our Oscar tries to eat them. I wish them came in a bigger bag. Our pleco is about 12-14 inches and he eats a lot.",
      "rating": 4.0,
      "verified": true,
      "author": "CRunk",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Mystery Snails love it!!",
      "text": "My snails are addicted to this treat. Honestly it’s like crack to them. Don’t worry about it clouding up, it mainly sits at the bottom of the tank once you submerge it in water and breaks apart when the snails eat it. If you are worried about the rubbish left behind, you can always suck it up with a gravel vacuum. Overall, not a super messy product with snails grubbing the mess away!",
      "rating": 5.0,
      "verified": true,
      "author": "Ms246",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "My Fish Loves These!",
      "text": "My pleco loves these! I had used another brand in the past and he didn’t care for them and only at them when they had been sitting for awhile. The first time I fed him these wafers, he immediately starting eating it. Now, he goes straight to the water as soon as I feed him.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline77",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Not so good",
      "text": "Not you average sinking wafers, two tone and look like dog food. The fish steer clear of them, and I got two because of the price. Thought it was because it’s different, but they still will avoid it. Weird..waste.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessie Hester",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "My snails and cory catfish love it",
      "text": "Our snails and cory catfish love these. I’ve had no clouding issues with our tank while using these wafers. So far so good. The wafers didn’t turn into blob in my tank like it has for other reviewers. My snails and fish get busy the moment I drop a wafer in.",
      "rating": 5.0,
      "verified": true,
      "author": "Kailey",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Not a fit for my fish",
      "text": "My fish and snails/shrimp ignored these wafers. For some reason they did not like them. I switched to a different brand and they were all over it. I'm not saying these are bad, but they just didn't work for me",
      "rating": 3.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Wafers came with snail eggs",
      "text": "Three or four days after using these wafers my tank is now filled with these tiny triangle shaped snails. I haven’t introduced anything new to the tank in months except these wafers. It looks like an infestation.",
      "rating": 1.0,
      "verified": true,
      "author": "Bobpemb",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "My guppies love it",
      "text": "I use this as a supplement to my guppies’ diet along with hikari Fancy Guppy. They seem to love it so far. I usually put one piece of this into water and soak it for 5 minutes before feeding to my guppies because this way it’s easier to break it up into softer little pieces. I have some Malaysian trumpet snails that came unexpectedly on my plants so I can’t over feed my guppies or have food sink down the tank. This way I can keep the snail population pretty much controlled.",
      "rating": 5.0,
      "verified": true,
      "author": "Moonlit cat",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Nickel size, good nutrition and apparently tasty!",
      "text": "My suckermouth fish (pleco) loooves these. I drop one in the morning and I have no clue when he eats it but it’s gone soon after and boy, let me tell ya, he has grown a whole lot! The pellets are the size of a nickel and one bag lasts couple of months. Happy to report, we have a big, healthy and happy pleco thanks to these little wafers :)",
      "rating": 5.0,
      "verified": true,
      "author": "A. Balladares",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Overpriced",
      "text": "Good quality, but severely overpriced. If you look around, it’s easy to find people making their own algae wafers that are at least comparable, but far cheaper. I made the switch a few years ago, and never looked back. Probably cannot give you the exact reference, so just think which “bay” do people visit for online private party purchases.",
      "rating": 2.0,
      "verified": true,
      "author": "Engineer D.",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "its good but making my water really foggy",
      "text": "I used other products before and my snails and pleco loved it but and always finished it but when I started using this I don't see them eating this a lot and it makes my water foggy I will give 3 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "Shahzad Ahmed Memon",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Clouds water",
      "text": "Not impressed. My snails eat the wafer within minutes but the water ends up really cloudy after. I even tried replacing the water and filters, test the water with test strips and tried feeding them again. The water clouded up big time again after just one feeding. Very frustrating!",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Happy Pleco's",
      "text": "Weather was bad and we were running low, so we gave these a try. The pleco's love them, and so do the cats. Looks like we'll be buying these from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazing Phil",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "My plecos, angels and guppies all love them.",
      "text": "Fine product as far as an algae based wafer is concerned. Seems to be less messy then some of the cheaper brands that I've purchased. These will be my go to from now on. With 14 aquariums it is important that they don't just dissolve into a mess on the tank floors. My plecos, angels and guppies all love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Earth2Frog",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Sinking wafers are floating",
      "text": "I've bought these in the past and they were good. The latest ones have more air in them and they are floating and getting stuck to the filter. They are supposed to sink. I may return all 5 bags I bought because they all seem defective.",
      "rating": 2.0,
      "verified": true,
      "author": "chiburbbrat",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Takes a while for it to sink.",
      "text": "I read a few reviews both positive and negative, nobody mentions that these take forever to sink. When the eventually do, the Pleco finds it and eats it just as fine as the previous product I used. But the previous one ssnk instantly. So that's my only complaint.",
      "rating": 3.0,
      "verified": true,
      "author": "Leonel Hormaza",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "It's ok...",
      "text": "I bought this for my algae eater and snail and at first they love it! It is good food source for them however I gave a two star rating because I only use one pellet (broke in half) because my algae eater and snail are small and it turned my water murky In just two days. I didn't think it would make the water so cloudy...im a little disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Stacy H.",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "My pleco and other fishes love these",
      "text": "I have kept fish for over 30 years and have been using this product since I became aware of it. My pleco enjoys munching on the wafers and the other fish do too. I buy them over and over again.",
      "rating": 5.0,
      "verified": true,
      "author": "etrinity",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "1 wafer under 29g tank, if not, instant water change",
      "text": "1 wafer on tanks 29g or below unless you want murky water. The stuff is enjoyed by my snails and other algae/bottom feeders, though contrary to package instructions, 2 wafers, within minutes, will cloud your tank.",
      "rating": 3.0,
      "verified": true,
      "author": "Lexx28",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Fish won't eat the the brown portions",
      "text": "I switched from Tetra's regular \"Pleco Wafers\" to \"Pro Pleco Wafers\". Unfortunately my fish will only eat the green centers. They won't tough the brown ring...and I end up with uneaten rotten food that fouls my water. I'm still a fan of Tetra foods, but switching back to the regular Pleco Wafers.",
      "rating": 2.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Dead fish. Smelly water. Sad kids.",
      "text": "Purchased this product 12/11/19. Around Christmas time, I noticed a weird smell in my son’s room (where the fish tank is located). I thought it was....just my kid’s room. Two days after Christmas, all the fish were dead - including the beloved pleco. On a whim, I decided to look at the reviews for this food and there are a lot of negative reviews for smelly water and dead fish. If I could give this product -10 stars, I would. You made my son cry.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Best Deal $",
      "text": "I'm not sure about flavor, and about the value the price keeps going up:(( I feed them to my 10-12 in plecos don't know if they eat them or not? But I have to feed them something. .... They are still aljve so I guess they eat them :0 ;)",
      "rating": 4.0,
      "verified": true,
      "author": "CCB",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "... a pleco currently but was told that cory cats love these too",
      "text": "I don't actually have a pleco currently but was told that cory cats love these too. Strangely enough my 7 corys all ignore these but my snails love them! Not sure I'll buy these again just for the snails, but I'd try them again in the future when/if I get a pleco.",
      "rating": 4.0,
      "verified": true,
      "author": "MDTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "They prefer sail meat now :(",
      "text": "I honestly haven't seen the snails eat them at all, but I think they just don't care like other snails might. I bought them this because they were killing each other and I read that they might not have enough food. But I think they are maybe just evil snails and now have the taste for snail meat and not these discs of food....",
      "rating": 3.0,
      "verified": true,
      "author": "Jilly Jenkins",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "Little guys love them",
      "text": "My aquarium is overloaded with plants and bottom feeders to keep it low maintenance. I have several green Cory cats and they stop everything they are doing when I drop one of these in.",
      "rating": 5.0,
      "verified": true,
      "author": "RAV",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "My algae eaters love them",
      "text": "I have several plecos and bottom feeders in my tanks. They need to be fed too, since there is not enough algae in my tanks to support them. There is never food residue/leftovers in the tank in the morning.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl ",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Great product",
      "text": "Purchased these for my bottom feeder fish in my 55 gallon fish tank. My clown loach and pleco enjoy them. As do all of the others tropical fish. Doesn't cloud the tank and they eat all of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Hug life",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Not dropping to the bottom of the tank for over 10 minutes",
      "text": "Having bad experience with this algae thin for my fishes. It is not dropping to the bottom of the task after putting it in the water. It keep floating around for more than 10 minutes. I tried using a stick to push it down, then it pop right back up. I expected it to sink to the bottom for my bottom feeder but it just keep on floating around in the water.",
      "rating": 2.0,
      "verified": true,
      "author": "Vivian",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Nope",
      "text": "These wafers turn into a gel without losing their shape, even when I reached into the water to remove it. That seems odd & is unlike other wafers. Also, my bottom feeder won’t eat them.",
      "rating": 2.0,
      "verified": true,
      "author": "Irisa Hernandez",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Tetra algae wafers",
      "text": "My fish love these. What I dislike is how they discolor my aquarium water. My water turns a clear yellow color. Also there is a smell in the water that wasn’t there before.",
      "rating": 1.0,
      "verified": true,
      "author": "bobogold",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Otocinclus snack",
      "text": "My otocinclus love these. If left in the tank uneaten overnight they will cloud the water. I hate that about them. So what they don't eat I suck out with a turkey baster.",
      "rating": 5.0,
      "verified": true,
      "author": "Spicysweet84",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Fish like the food I like the price",
      "text": "Gave this a 4 star because some of the wafers float for quite a long time. Not alot of them but some. The fish like them and the price was excellent. Will purchase again",
      "rating": 4.0,
      "verified": true,
      "author": "T. Jennings",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Well maybe",
      "text": "I got these to feed my snails but the huge goldfish swallows them whole and looks like she is going to have a heart attack for a while afterwards until it \"goes down\" to her gullet.",
      "rating": 3.0,
      "verified": true,
      "author": "FunGuy",
      "helpful_votes": 0,
      "publication_date": 20200709
    }
  ],
  "product_meta": {
    "title": "Tetra Algae Wafers",
    "description": "Size:5.3 ozTetra PRO PlecoWafers are a nutritionally balanced, complete daily diet for herbivore bottom feeders such as plecos. These sinking wafers have a concentrated algae center for a nutritious, vegetable-enriched staple food or vegetable supplement for all bottom-feeding fish. Patented extrusion technology allows the staple diet and concentrated algae center to be combined in one sinking wafer. This easily digested formulation is naturally high in fiber. Tetra PRO PlecoWafers include the patented Tetra Optimal Health blend, with precise amounts of select vitamins and nutrients to help support your fish’s immune system. These wafers will not cloud water when used as directed.To ensure that your herbivore bottom feeders and other algae-eating fish species are provided with complete daily nutrition, feed only the amount that your fish will consume within a few hours each day. Since 1951, Tetra has developed the world’s most comprehensive body of fish food knowledge, and fishkeeping enthusiasts have looked to the brand for products and solutions that add ease and beauty to their home. Whether you're an experienced hobbyist or just starting out, Tetra has everything you need – from a large variety of quality fish food and innovative equipment to test kits and decor.\n\nAMAZON.COM\n\n\nQUALITY NUTRITION FOR ALL FISH\nTetra has been revolutionizing and improving fish nutrition since the company’s birth in Germany in 1951. Since that time, Tetra has developed one of the most comprehensive bodies of flake fish food knowledge in the world. A full team of biologists, chemists, and nutritionists continually study and discover what keeps fish thriving and living long, healthy lives.\n\nTETRAVEGGIE EXTREME ALGAE WAFERS\nThis nutritionally balanced, all vegetable diet is ideal for Plecostomus, and is an excellent supplement for all bottom feeding fish. patented, state-of-the-art extrusion technology allows a staple diet and concentrated algae center to be melded into one. TetraVeggie Extreme Algae Wafers are an excellent way to offer vegetable variety and Tetra’s patented, health enhancing ProCare blend.\n\nCLEAN, CLEAR WATER\nTetra formulas feature micro milled, exotic, high-protein fish meal as a core ingredient—making them pure and digestible with fewer colorants. This leads to less waste and a cleaner, clearer aquarium.\n\nPICK THE TETRAVEGGIE FOOD THAT'S RIGHT FOR YOUR FISH\nTetraVeggie Flakes The perfect vegetable supplement for all Algae Grazers. Spirulina-enriched flake blend enhances the diets of plant eating tropical fish, marine fish, and even goldfish. TetraVeggie Algae Wafers These vegetarian sinking wafers are ideal for all bottom-feeding tropical fish. Provides nutritious, fiber-rich variety to keep fish in peak condition. Vegetarian, no animal proteins. TetraVeggie Extreme Algae Wafers Sinking wafers with concentrated algae center perfect for all bottom-feeding fish. An excellent way to offer vegetable variety and extra nutrients. Vegetarian, no animal proteins. WORLD CLASS MENU FOR EVERY FISH TYPE\nTetra understands that every fish is unique. For this reason, they have created a full menu of food to help meet the needs of every fish; from bottom feeders to top-feeders and small Bettas to Large Cichlids.\n\nFlakes: Flakes make up the most popular type of fish food. Tetra flakes are formulated to keep water clean and clear and include ProCare for added health benefits.\n\nCrisps: Tetra crisps float longer and create less waste. Crisps are ideal for small and medium-sized fish.\n\nGranules: Bite-sized morsels sink slowly to reach all fish in your aquarium, including mid-water feeders.\n\nTablets: Tablets are complete, balanced nutrition that sink quickly for all bottom-feeding fish such as catfish and loaches.\n\nAlgae Wafers: Large, sinking wafers are perfect for veggie loving bottom feeders like piecostomus catfish.\n\nSticks: Complete and balanced sticks provide hearty nutrition to larger fish such as Oscars, Cichlids, and marine fish.\n\nPellets: This floating food is ideal for mid to large sized fish like Cichlids and Goldfish. Tiny pellets are available for Bettas.\n\nGel Foods: Innovative Grazing Blocks are great for long periods away from home. Gel Foods strive to feed fish the way they would eat in nature.\n\nSupplements/Treats: Great in conjunction with Tetra’s Primary diets, these foods provide healthy variety for fish.",
    "rating": 4.6,
    "feature_bullets": [
      "age_range_description: all ages",
      "Item Package Height: 7.75",
      "Item Package Length: 1.75",
      "Item Package Width: 4.75"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1.75 x 4.75 x 7.75 inches; 5.44 Ounces",
      "Item model number": "16448",
      "Date First Available": "October 19, 2006",
      "Manufacturer": "Tetra",
      "ASIN": "B0017JAPMQ",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Food",
      "Pet Supplies",
      "Fish & Aquatic Pets"
    ],
    "price": 4.26
  }
}