{
  "website_summaries": [
    {
      "verdict": "Choose this nail lacquer if variety and affordability are your top priorities. You'll also most likely get streak-free results and longevity from your Orly manicure.",
      "pros": [
        "An affordable lacquer by a popular name brand that provides reasonable wear",
        "Comes in just about any shade you can imagine, including vibrant, bold, and neutral colors",
        "Lasts a long time"
      ],
      "cons": [
        "Some colors may look a bit different in person, and some shades, such as those with special effects, tend to chip faster"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Thinned out terribly!!!!",
      "text": "This nail polish was thinned out A LOT. When I opened the bottle the whiff of paint thinner, or nail polish remover, or whatever they used was so strong that I knew right away. It took three coats to get an even color, and the paint only lasted a week. Orly is my favorite brand, I have several colors they produce. My bad for trying to buy a color they seem to no longer make. BUYER BEWARE!!! I did not try to contact the seller because they would just ship it out to someone else. I tried to buy a color Orly no longer makes and paid for it. Hope this keeps anyone from making the same mistake I did.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert Hawley",
      "helpful_votes": 33,
      "publication_date": 20180719
    },
    {
      "title": "Beautiful color-terrible finish",
      "text": "Ordered Glowstick...love the color...glides on beautifully but polish quality is terrible-left tons of bubbles when dry. Thought the manicurist messed up somehow so I decided to redo my nails myself and same thing happened. Didn't even shake the bottle before I redid them to see if that made a difference and it didn't. Gave an extra star for the color.",
      "rating": 2.0,
      "verified": true,
      "author": "JOANNA LOPEZ",
      "helpful_votes": 37,
      "publication_date": 20170707
    },
    {
      "title": "The best nail polish PERIOD!!!",
      "text": "The BEST nail polish PERIOD!!! I have gone through so much stress, looking for what I wanted, almost gave up, and finally found this! ORLY!!! What I love about this whole company: 1. One layer is perfect: not too clear, not too thick! 2. Absolutely no streaking 3. Dries FAST! —all the three I got on Amazon this week dry really fast! 4. It wears really long! 5. The shine is incredible! No need for a top clear layer. 6. Colors are sophisticated, especially all of the French Manicure line. 7. The brush is very thick and has a rounded tip. 8. Easy to remove too! Orly, please keep making your nail polish forever!!! 😁😁😁",
      "rating": 5.0,
      "verified": true,
      "author": "Vera D.",
      "helpful_votes": 5,
      "publication_date": 20191207
    },
    {
      "title": "Great color; product and packing materials triggered my tobacco smoke allergy",
      "text": "I love the color and it was well-packed against damage. However, I am highly allergic to cigarette smoke and both the bottle of polish and the bubble wrap and envelope were so thickly permeated with the stench of tobacco that I had to immediately wash my hands and carry the wrappings to an outside trash dumpster. The bottle of polish is currently soaking in a bowl of warm water and detergent. Sellers, please be aware of common allergies such as mine.",
      "rating": 3.0,
      "verified": true,
      "author": "P. W. Sinclair",
      "helpful_votes": 12,
      "publication_date": 20180322
    },
    {
      "title": "Smooth, Consistent Color & Great Application Brush",
      "text": "I was never a fan of black nail polish because it always appeared lumpy to me but not this one. This polish goes on smooth and consistent. I've used it without a top coat and it lasts a week or more without chipping or peeling. I think out of all the polishes I have, which is a lot, this one is my favorite. Not only because of the color but because it is a great quality and even when I don't use a base coat, it doesn't stain my nails. It also has a great application brush that reaches the corners of the nail bed with ease. Orly is now my top 2 favorite polishes.",
      "rating": 5.0,
      "verified": true,
      "author": "NC Dawn",
      "helpful_votes": 6,
      "publication_date": 20180924
    },
    {
      "title": "Sterling Silver Rose is My Favorite of All Time",
      "text": "Orly Sterling Silver Rose is my most favorite nail polish color of all time. I found it years ago and have gone through a few bottles since then. It's a lovely medium pink color with a silvery sheen. Every time I wear it, I get lots of compliments. I was so happy to find this color on Amazon. I hope I'll find it again next time I need to order. It's such a unique color, it would be difficult to find a similar replacement. Goes on smooth too, and with a top coat, wears very well.",
      "rating": 5.0,
      "verified": true,
      "author": "TeNe",
      "helpful_votes": 7,
      "publication_date": 20171130
    },
    {
      "title": "Wrong item received.",
      "text": "I originally gave this a positive review as I was so excited to be able to get the color beach cruiser on line as I have difficulty finding it in local stores. I didn't notice at the time but I received a different color all together. I decided to give it a try and the quality of the polish is also not the same as other bottles or Orly nail polish I have used in the past. I\"m not sure why but the polish is very thin and does not cover well.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191112
    },
    {
      "title": "Purple Crush is PINK NOT PURPLE",
      "text": "This is NOT purple it’s pink. I was hoping for a pretty purple, since the name is “purple crush” but it is pink. If you want pink get this if you want purple, wait until you can leave your house from quarantine and buy one at the store. (I can’t leave a picture but trust me I’m so disappointed-my teenager is thrilled since she loves pink)",
      "rating": 1.0,
      "verified": true,
      "author": "Kristina Arciniega",
      "helpful_votes": 2,
      "publication_date": 20200418
    },
    {
      "title": "JAUNDICE, nope!",
      "text": "Ugh. I bought this because I wanted a nice, bright orange and when I finally recieved it I couldn't wait to try it out!!! It is SO sheer I would probably have to put on 5 coats to make a difference. The color shouldn't be called \"Crush on You\" it should be called \"JAUNDICE on You\" because that's what it looks like! The orange picture online is NOT what I received. Gross. Never, ever again. Shame on me for being too lazy to go to the store instead of buying a crappy color online.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicole Parker",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Nice!",
      "text": "So pretty but be prepared to breeze through the process bc this is a very thin polish that dries immediately. You definitely need two coats but it looks as pictured and goes on smooth!",
      "rating": 5.0,
      "verified": true,
      "author": "Dawkir1",
      "helpful_votes": 2,
      "publication_date": 20200720
    },
    {
      "title": "Knock off",
      "text": "I have used orly multiple times, beach cruiser is my favorite color. I finally received it in the mail and it was completely separated, 1/2 the bottle was pink and the other 1/2 was clear. I decided I would shake it well and apply it to my pinky to test it, fail! The polished dried with a matte finish like it had been thinned out with acetone. Further inspection of the bottle and I realize it has Chinese writing on the back, I feel like it was a knock off.",
      "rating": 1.0,
      "verified": true,
      "author": "jennifer M-E",
      "helpful_votes": 3,
      "publication_date": 20190707
    },
    {
      "title": "Pretty color and excellent application",
      "text": "Hawaiian Punch - The name fits the color. Very nice deep pink color and looks just like the color in the bottle. The application was even and 2 coats was enough, no streaking at all. Va Va Voom - (it won't let me post seperate ratings) is so awesome! Striking neon pink that doesn't dry matte flat! I bought two other colors and the pinks here are my favorites by far. Easy application with great coverage.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth A.",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "VERY DILUTED!",
      "text": "I had read a review about this product being very diluted with acetone but I was hoping that wasn't the case. Unfortunately it is VERY diluted. The color is beautiful and bright IN THE BOTTLE. Once you put it on your nails you needled multiple coats. I am very disappointed. I was really looking forward to this color which I could not find at the stores.",
      "rating": 2.0,
      "verified": true,
      "author": "Marvin Monroy",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Chips Very Easily- Does not last long",
      "text": "Super pretty color and glows under blacklight. However, it chips SUPER EASILY. The day after I painted my nails (using OPI bottom and top coat, high-quality products that make other polishes last a long time) entire nails had chipped off. I was sitting around studying for a test and huge chunks were coming off. Would not recommend this product, will probably not use again as it is incredibly frustrating.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Love it!",
      "text": "I loved this nail polish. Its not like your average glitter polish. The sparkles are tiny and they sparkle nice. You see the sparkle yet not so much the shape of the tiny glitter. I cant even call it glitter. It just makes your nails sparkle and it spreads on sparse. If you want more you do another coat. With 1 coat you get a nice shimmer to your nails. I have been looking for a sparkle polish like this for awhile. Glad I bought this.",
      "rating": 5.0,
      "verified": true,
      "author": "DMC",
      "helpful_votes": 5,
      "publication_date": 20160806
    },
    {
      "title": "Zero stars and unreturnable!!!",
      "text": "Very disappointed! Very purple toned blah color. Not as pictured at all. Thought I was getting a hot pink. Also apparently there are NO RETURNS on any nail polish via Amazon (wish I'd know that before I ordered). So now I'm out $10 and stuck with a bottle of polish that neither me nor my 3 daughters nor my niece will wear.",
      "rating": 1.0,
      "verified": true,
      "author": "MamaRia",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Great Product and Delivery!",
      "text": "My wife loves the Passion Fruit color she could no longer find in our local stores. She receives lots of compliments on the color. She has not tried it yet, but it appears to brand new and not a fake. Speedy delivery, too.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephen Flory",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Would not purchase again",
      "text": "This was the worst clear nail polish I have ever used in my life. After one day, it chips. Not to mention, it is not very shiny at all. The polish will peel off like vinyl after the second day. Would not purchase again.",
      "rating": 1.0,
      "verified": true,
      "author": "B1234",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "My wife loves it, I just buy it for her",
      "text": "My wife loves this stuff and cannot find it locally anymore. I just initiate the \"purchase order\" for her. She is not a reviewer writer, so I will just state that she has used a lot of nail lacquer in her life and this is her current favorite product and color.",
      "rating": 5.0,
      "verified": true,
      "author": "Kendall Toney",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Not the color I thought I was getting",
      "text": "I ordered cupcake, which in the sellers pictures looks like a pretty baby pink color. What I got is a very pail pink that looks like it has a touch of gray in it. It was also very separated with streaks of white. Very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "T. Johnson",
      "helpful_votes": 2,
      "publication_date": 20180702
    },
    {
      "title": "Not the color advertised.",
      "text": "I ordered shimmering mauve, when I saw it online it was a deep red, almost a wine or maroon. Since I’m not the one that named the color, I assumed I would be getting the picture shown. I received my polish today and it isn’t the color that was shown. The color I received was almost like a rose gold color. It has tones of mauve and copper. It also smells heavily like an open bottle of acetone. Definitely not like the other ORLY polishes that I have. I’m not dissatisfied with the product past the misleading picture. I gave it 3 stars for the color not being what was advertised and the smell.",
      "rating": 3.0,
      "verified": true,
      "author": "LD0585",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Does not match the bottle AT ALL.",
      "text": "So the design on the bottle in the image is the old design, so they must have changed the formula or something for Melt Your Popsicle. I looked up pictures of the polish online before I purchased, and I loved the colors I saw online. This was nothing like that. Most of the pictures online matched the tone shown on the bottle perfectly. This is nothing like that. This is like reflective neon traffic cone orange. I can't even find a picture to match this shade, and my camera is not capturing the shade at all. I wouldn't have bought it if I'd have known it was going to look like this.",
      "rating": 3.0,
      "verified": true,
      "author": "xEleanorxRigbyx",
      "helpful_votes": 0,
      "publication_date": 20141126
    },
    {
      "title": "Great summer color!",
      "text": "A very pretty bright pink that I was looking forward to for my new summer color! Love it! Only gave 4 stars because I just did it today so I am unsure about the longevity of the polish and not as BRIGHT as I expected (pretty nonetheless)",
      "rating": 4.0,
      "verified": true,
      "author": "Malisa",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "It's absolutely beautiful and I've gotten mannnnnnnny compliments",
      "text": "The shipping company that Amazon uses screwed up my shipping so it took about 2 weeks to get this nail polish but boy, was it worth the wait!! It's absolutely beautiful and I've gotten mannnnnnnny compliments. It's just about the same color as the rose-gold that the iPhone 6s is...The best swatch comparison can be found here:  ...I was looking for that but it was either not selling or too expensive so I got this Orly color and I LOVEEEEEEEEE ITTTTTT!!!!!!!!! Perfect for year round!! :)",
      "rating": 5.0,
      "verified": true,
      "author": "I.C.",
      "helpful_votes": 0,
      "publication_date": 20151209
    },
    {
      "title": "So quick and easy! I bought my first bottle at Marshalls/TJMaxx and ...",
      "text": "So quick and easy! I bought my first bottle at Marshalls/TJMaxx and LOVED it so much ~ ordered it here. Beautiful with a sheer pink on top ~ short, clean and active, just like Coco Chanel started! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "sallie Opicka",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "It’s okay",
      "text": "Although the color is pretty. You have to apply at least 3-4 coats. It’s very watery and not very pigmented with one coat so you need multiple layers. Would be nice if it was a thicker consistency.",
      "rating": 3.0,
      "verified": true,
      "author": "Ola",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "A nice new shade for summer",
      "text": "Very nice mint green for summer. The brush is thinner than usual for Orly, but applies colour nicely without streaking. I have olive complexion and needed 3 coats to get the colour I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "AB",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "the color glides on easily. Two coats provides complete coverage although I always ...",
      "text": "At last!! I have searched every known nail color brand and at least 10 different shades to find perfection and it finally arrived. No orange tint at all. Of course since it is Orly, the color glides on easily. Two coats provides complete coverage although I always add a topcoat. I use a keyboard all day and have gone five days chip-free. This looks exactly like the true red my mother used to wear. I wish Orly made lipstick to match. This nail color is fabulous.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Mae Thompson",
      "helpful_votes": 2,
      "publication_date": 20160822
    },
    {
      "title": "A professional option from a manicurist",
      "text": "As a manicurist, I was expecting a soft sheer white with a pink iridescent hue to it based on the picture & description \"Love Each Other is a very soft sheer white that you can layer for more color or just give your nails a subtle gleam with one coat.\" This polish no where near this at all and is a CLEAR a polish that has a purple iridescent. Very disappointing, misleading and nothing like the description states AT ALL.",
      "rating": 1.0,
      "verified": true,
      "author": "marcie reznik",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Would definitely recommend",
      "text": "Has the wider brush that makes such a difference in applying. Reallly beautiful effect. Would like to also find one a little brighter. Definitely recommend. Received quickly and price was good.",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine McConnel",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Not holographic",
      "text": "Bought what I thought was a backup to the Prisma gloss I already had, and I received a completely different polish. Should have been a holographic gold topcoat, and instead I received a plain gold shimmer with scattered iridescent glitter. Not at all what I wanted.",
      "rating": 1.0,
      "verified": true,
      "author": "Tara May",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "My favorite Black Polish!",
      "text": "Beautiful black shiny polish! I love it! I am definitely sticking to this brand of polish! Just one coat does it! Very happy with the price on Amazon, the seller, fast shipping! Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Save your money.",
      "text": "Isn’t Orly supposed to be a good brand? Top broke right off of bottle. I figured at least I’d get to polish once, and then throw away, since it broke. Polish like water, gross and awful to use. The dollar store polishes are better than this. Was this a real bottle?",
      "rating": 1.0,
      "verified": true,
      "author": "RachelOk",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Go to Sally’s market instead of paying full price for a cheap looking polish",
      "text": "Expected a polish that was different and nice for the summer but this shade was not all thick enough to coat my nail the first or second time, it still looked sheer.",
      "rating": 1.0,
      "verified": true,
      "author": "MO",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Not lavender colored",
      "text": "I was excited for this lavender color but was very disappointed, should have read the reviews. It showed up and was a very unattractive light grayish white.",
      "rating": 1.0,
      "verified": true,
      "author": "Vj",
      "helpful_votes": 0,
      "publication_date": 20170331
    },
    {
      "title": "Exactly as described",
      "text": "Quick delivery, exact color as what was shown, she loves it, and so do I, and it looks AWESOME under a black light. 5 stars. Certainly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Chips like a bag of Lays....",
      "text": "This polish is literally good for maybe 12-24 hours after application. It chips away something awful. Color is fantastic but it’s the worst polish I have ever put on my nails.",
      "rating": 1.0,
      "verified": true,
      "author": "Carbon",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Would not recommend.",
      "text": "This was my first Orly purchased. I had heard good things about the brand, so I wanted to try it. Well, I have to admit that I was disappointed. The polish does not go on evenly and takes at least two and maybe three coats to fully coat the nail. Also, it chips easier than dollar store brand. I would not recommend it.",
      "rating": 2.0,
      "verified": true,
      "author": "Lolo",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Fast shipping, legit product!",
      "text": "This is the real deal looks and acts just like my original bottle of Orly hot shot I am going to use it tonight and I'm sure it'll be just fine I love it and it shipped super fast thank you so much",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Nauer",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "My Favourite nail polish",
      "text": "I saw someone wearing this nail polish online and thought to see if it actually as neon as I wanted. Turns out this nail polish after the third coat looks like it could glow in the dark by how bright!! I have not found a nail polish even remotely similar to this beautiful cool!! Definitely have and will continue to recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Cristina G.",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "What you receive is not the color in the picture.",
      "text": "Unfortunately, what I received is nowhere near the color shown. I chose it because it was like a blacklight purple color, but when I got it, it was more like a bright pink. I requested a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "Kean",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Disappointed",
      "text": "This product says glow in the dark. So I assumed that's what it was, that's what I needed for costume. It does NOT glow in the dark. Disappointed. Also, it peeled/chipped very fast.",
      "rating": 1.0,
      "verified": true,
      "author": "Bella",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Love this bright yellow color",
      "text": "Love this bright yellow color! I've so far only used it in gradients but it's a gorgeous vibrant yellow that goes super well with pinks, purples, reds, and oranges (I sponge it on top of white polish). I like that the brush is big so it's easy to apply a lot in one stroke. The formula is a bit watery and I'm not sure how many coats it'll take to be opaque over the natural nail but I usually sponge 3-4 coats on top of my white polish and it shows up really well.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaylee",
      "helpful_votes": 7,
      "publication_date": 20171207
    },
    {
      "title": "Not like picture",
      "text": "The Lemonade is nothing like the picture. Very disappointed. Would send picture of actual color is I was able to",
      "rating": 1.0,
      "verified": true,
      "author": "gary lantz",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Flat and worn off toes in 3 days.",
      "text": "So disappointed in this product. After 3 coats the color remained flat. Wore off in 3 days as the photo shows.",
      "rating": 1.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "So Sparkly!!",
      "text": "This color is spectacular!! I wore this for Christmas through the new year. I received so many compliments! Only reason for 4 stars for “easy to remove “ is because there is actual glitter in the polish so when I removed it I had to use a nail file to remove the final layer of glitter. Can’t wait to wear this again for a special occasion!!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Carroll",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "This color pops..",
      "text": "This is one of my favorite colors. I always get compliments on it when I wear it. It’s very bright. The only downfall to this product in my opinion is it is very thin. In order for it to look presentable you really need about 4 coats and then a good top coat. I recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Todd Burcham ",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Never chipped after almost 2 weeks.",
      "text": "I purchased space cadet and I love this color. Depending how your hands move and light it will look kinda pinkish purple, light burgundy, gold, or copper. I wore this for almost 2 weeks without a top coat and it didn't chip also.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeannette B.",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Halo",
      "text": "I purchased Halo by Orly as I was looking for a gold glitter nail polish that wasn't ridiculously chunky. This fit the bill. However, in addition to the gold glitter, it also has silver (a lot!) and champagne colored glitter. I gave it 4 stars because it looks like it's mostly gold, but is not. It's still very pretty. I put this atop navy blue nail polish for a pretty ombre effect on my nails. I recommend using a top coat to give it some staying power. Overall, very happy with this glitter nail polish.",
      "rating": 4.0,
      "verified": true,
      "author": "Traci",
      "helpful_votes": 0,
      "publication_date": 20131226
    },
    {
      "title": "Gorgeous!",
      "text": "Perfect color, not true black rathe that's some red brown undertones but very dark and neutral!",
      "rating": 5.0,
      "verified": true,
      "author": "TF",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Love the color, but it chips like crazy",
      "text": "This is such a bright, happy color. Perfect for Summer. It goes on pretty thin so you need to apply several coats to get full coverage. It chips like c r a z y so I am unable to wear it on my fingers for very long. Even on my toes it only lasts a couple of days. Might need a better top coat but I haven't found that yet.",
      "rating": 2.0,
      "verified": true,
      "author": "Anna Hanson",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Amazing color that goes with ANYTHING!",
      "text": "Perfect product! I love this color and so happy I found it on here, as it has been discontinued.",
      "rating": 5.0,
      "verified": true,
      "author": "duneatic",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Likely fake product",
      "text": "Product was very watery. It barely had any color to it and would just drip off of my nails. Also was more orange toned than it’s supposed to be. Seller was supposed to send a replacement about 2 months ago but I never received it. Very unhappy.",
      "rating": 1.0,
      "verified": true,
      "author": "MegFouq",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "ABSOLUTELY DISAPPOINTED WITH THE QUALITY OF THE PRODUCT",
      "text": "I purchased the glowstick nail polish and believe me when I say ABSOLUTELY DISAPPOINTED WITH THE QUALITY OF THE PRODUCT. At least 3 coats is required for this polish and it dries very terribly, no sheen nor is the matte even attractive in anyway.",
      "rating": 1.0,
      "verified": true,
      "author": "Sash",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Not happy with with seller",
      "text": "When I applied this product to my nail it was thinned out like a polish remover was added to a used bottle. Very disappointed with this seller. I’ve bought this product before at Ulta and it went on just fine. You could tell something was added to this one.",
      "rating": 1.0,
      "verified": true,
      "author": "jgroll",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Perfect Vampy Maroon to Give a Man the Finger",
      "text": "Exactly the color I was looking for. The perfect rich vampy maroon to wear when you're packing up a man's belongings for the last time & giving him the finger. It has an almost golden shimmer, enough to remind him that you're worth a million bucks, but not so much that you'll get sentimental thinking about being alone for Christmas. It's velvety & decadent. Not matronly like a lot of shades I've looked at & not a sultry red, either.",
      "rating": 5.0,
      "verified": true,
      "author": "Tricia Jones",
      "helpful_votes": 3,
      "publication_date": 20141112
    },
    {
      "title": "nail polish",
      "text": "Used with a China glaze turquoise this is beautiful. Been using same ones for years",
      "rating": 5.0,
      "verified": true,
      "author": "MB",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Thank you! My favorite brand! Definitely will buy from this seller again.",
      "text": "Cupcake is my absolute favorite by color, texture and brand. I've never seen another brand with the formulas and colors quite like these. I've ordered from this brand before with no problems, but recently, a defective product was delivered to my house. Thankfully, they were kind enough to replace the damaged product! Will definitely be buying from here again!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn Golden",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Beautiful color!!!",
      "text": "Wow! This color is incredible--great for fall, DIDN\"T have an odor at all--when does that happen?--NEVER!! easy to apply and lasts quite some time! HIGHLY recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "lesley",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Looks great!",
      "text": "I really like how shinny it is. I had it applied with a small amount of gold glitter on one nail for a special occasion.",
      "rating": 5.0,
      "verified": true,
      "author": "Mona",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Love this color",
      "text": "I love the luxe color because it looks like pure gold on my fingers. I often bring it to the salon and have them apply it when I want a pick me up, or just opt to apply it myself when I’m in a rush. Always looks nice and not too blingy.",
      "rating": 5.0,
      "verified": true,
      "author": "lalatranslated",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "Love it",
      "text": "Love this color apparently lots of others do too. Can get it in the stores easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Kiki",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "NOT THE ACTUAL COLOR!!",
      "text": "The color in the picture is nothing like the actual color! It is pink and It is non refundable as well!",
      "rating": 1.0,
      "verified": true,
      "author": "ASHLEY RYKIEL",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Love this color and it sparkles too.",
      "text": "Love this sparkly red nail polish and makes for a colorful polish on your hands or toes.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Rusnak",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Disappointed",
      "text": "This is NOT Cotton Candy (color). I’ve been using Cotton Candy since 1994! I’m disappointed that I can’t return this item, I will never use this color.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Nice purple!",
      "text": "It's a nice purple. It goes on easily. I wear it for a week. It cleans of quickly. It is of good quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Natalie Henry",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Nice and Bright like a Highlighter",
      "text": "I bought the Glowstick color to paint on house keys and TV remote buttons for my aging relative (power button didn't light up, so i painted it). It works great for just that!",
      "rating": 5.0,
      "verified": true,
      "author": "Ginga Ninja",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Color is beautiful ~",
      "text": "This is a beautiful color! It went on easy. It’s a fave of mine! You will enjoy this.",
      "rating": 5.0,
      "verified": true,
      "author": "Joy Allington",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Nail polish",
      "text": "This is my favorite nail polish color.Cant find it anywhere else",
      "rating": 5.0,
      "verified": true,
      "author": "krys15",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Poor coverage",
      "text": "Takes more than 3 coats to even look decent. Would not recommend",
      "rating": 1.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "This is one of my favorite colors!",
      "text": "I really like to have a nice subtle color on my finger nails and something bright on my toe nails. This is just perfect for my finger nails. It's such a soft pink that it doesn't really stand out, it's not a statement color for sure. It has just enough color to brighten up your nails but not make them stand out. It takes two coats , it goes on smooth and last ok. I'm really rough on my nails so most nail polish wont last too long on me. This stuff doesn't chip though, I'd say it does last a little better than cheaper nail polish I have used. And i've never found another color quite like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tessa Cabrera",
      "helpful_votes": 0,
      "publication_date": 20130728
    },
    {
      "title": "Thin and see through",
      "text": "This color is very thin and see though. Took 4 coats to cover. Bummer.",
      "rating": 2.0,
      "verified": true,
      "author": "AJ Wash",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Great seller, product, & delivery!! Very pleased thanks a bunch!!👍😀⭐️⭐️⭐️⭐️⭐️",
      "text": "Great seller, product, & delivery!! Very pleased thanks a bunch!!👍😀⭐️⭐️⭐️⭐️⭐️",
      "rating": 5.0,
      "verified": true,
      "author": "Desiree Celeste Costillo",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Long lasting and beautiful color",
      "text": "I love this color and I love how the color last awhile.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Love the color",
      "text": "think so takes a few coats but pretty greenish (blue) color.",
      "rating": 5.0,
      "verified": true,
      "author": "Don",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Poor quality coverage",
      "text": "I'm giving this 2 stars because I love the color but the quality is not that great, it took many coats and even over a white coat I had to apply quite a bit of layers to get an okay coverage.",
      "rating": 2.0,
      "verified": true,
      "author": "Diana Aranda",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Love this color!",
      "text": "I just had a manicure at a salon and picked this color. I was so pleased that I purchased my own polish from Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "K. L. Miller",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Uneven finish",
      "text": "Love the color but requires three coats to look good.",
      "rating": 3.0,
      "verified": true,
      "author": "serious consumer",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "LOVE Frolic Polish",
      "text": "I absolutely love this polish. I bought my first bottle at Sally's and looked all over for it. I bought 4 bottles when I found it on Amazon. The color is a little more richer pink in person and is bright. This color showed in the picture is not the true polish color and I was a little nervous when I saw it online, because the real polish is much more bolder and brighter in person. This is such a BEAUTIFUL color on! You can't go wrong with this color if you like purple and pink as it is a mix between the 2 colors.",
      "rating": 5.0,
      "verified": true,
      "author": "TSteinyRN",
      "helpful_votes": 0,
      "publication_date": 20111104
    },
    {
      "title": "Glad I purchased it.",
      "text": "Pleased with everything about this product. Complimented color I wore it with. Both colors “popped”.",
      "rating": 5.0,
      "verified": true,
      "author": "Nonna",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Purrtty",
      "text": "An absolutely beautiful color. Worth buying. 1 star off for having to add 3 coats of nail polish though...waist of product.",
      "rating": 4.0,
      "verified": true,
      "author": "Cecy",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Favorite polish ever!",
      "text": "My favorite nail polish! I love the color and how smooth it goes on and lasts!",
      "rating": 5.0,
      "verified": true,
      "author": "Regina Lakes",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Love Orly",
      "text": "This has to be my favorite brand of nail polish! The color is so rich that I only needed one coat. It dries...matte, obviously! It is perfect for nail art, and Orly has the awesomest tops! They arent plastic and slippery, making it hard to open. I can actually get a nice grip on this top! Mani suggestion...mix matte with shiny surfaces to make a stand-out design! Remember, to keep this polish matte, DON'T TOP COAT with a SHINY TOPCOAT!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20121230
    },
    {
      "title": "Pretty Color",
      "text": "I LOVED this nail polish and it lasted a long time. I recommend putting a white nail polish underneath to make it pop!",
      "rating": 5.0,
      "verified": true,
      "author": "Jerod and Nicole Leftige",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Not The Right Shade",
      "text": "Purchased Lollipop and it looks nothing like the shade.... Lollipop is supposed be a pale pinkish purple. This color is a medium purple.",
      "rating": 2.0,
      "verified": true,
      "author": "Sand",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Wrong color",
      "text": "My bottle has the right name on it but the color is not right. It's also watered down and impossible to use. Returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Lori Hackney",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Sparkly nails!",
      "text": "My absolute favorite color and brand! Applies easily! It's hard to find so I'm pleased to have found it here! Plus,it's at a better price!",
      "rating": 5.0,
      "verified": true,
      "author": "Michele M.",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "Thinned out??",
      "text": "Bottle came with something stuck and dripping down the side that is not the same color as the polish - makes me assume this was thinned out with some sort of solvent. It cannot be returned so I hope my nails don’t fall off.",
      "rating": 1.0,
      "verified": true,
      "author": "Erika S",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Beautiful color.",
      "text": "Gorgeous color. Bought it for my Nan’s because it’s her favorite shade of nail polish.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonshopper",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Well that sucks!",
      "text": "This product even though advertised as glow stick does not glow in the dark at all. Like not at ALL.... Supper disappointed. And I cannot return it because its nail polish.... :(",
      "rating": 1.0,
      "verified": true,
      "author": "Jason Steele",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Hassle!!!",
      "text": "This is the most watered down nail polish I have ever used... I love the color so much I just kept trying but it took 4 coats to be smooth and full coverage.. I stick with OPI",
      "rating": 3.0,
      "verified": true,
      "author": "nikki",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "My fav color pink for my toes",
      "text": "This is my foavorite color pink for my toes. I’ve had the same color toes for over a year. I bring it with me when I go get my pedicures every two weeks. It’s so colorful and looks good with my dark tanned skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Beautiful color",
      "text": "I was getting a manicure and the lady across from me had this polish on so I decided to get it too. It looked silver on her (she was a pale lady) and it looked more of a gold/bronze on me (I'm olive-skinned). I loved the color on me anyway and decided to order it. The only cons are that it chips pretty soon if I don't use a clear topcoat (all my Orly's do that), and Amazon.com can't ship it overseas where I live so I had to ship it to my mom who held onto it after I decided I was going to visit, and I found it cheaper at Sally's.",
      "rating": 4.0,
      "verified": true,
      "author": "letterx",
      "helpful_votes": 0,
      "publication_date": 20120410
    },
    {
      "title": "Color",
      "text": "This color was definitely not Seashell. I have purchased Orly Seashell for a long time. I have had at least six bottles of it as have my friends. This is not Seashell. This color is pink. I am very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Serene",
      "helpful_votes": 0,
      "publication_date": 20160618
    },
    {
      "title": "Watery watery watery",
      "text": "This nail polish is completely watered down.. Even with four coats on it still is really watery!! Not sure why they would water nail polish down.. I will never buy this again",
      "rating": 1.0,
      "verified": true,
      "author": "Jaime ",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "I love the color but...",
      "text": "I took off a single star because you absolutely must use a white base coat and it takes around 3 coats to reach full opacity. But once on, it's a really cool color and wears well.",
      "rating": 4.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Purple Crush is pink",
      "text": "The formula is awesome. No problem with the polish. But the picture the seller has up for Purple Crush is completely different from the color that actually shows up. It's more of a fuschia. Not purple at all.",
      "rating": 3.0,
      "verified": true,
      "author": "HannahBanana",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Wrong color",
      "text": "Color was pretty but it most definitely was not the color that I ordered. I ordered the bright deep purple color and I got a light grape color that requires 3 coats in order to be dark enough. Super disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Justin M Jankowiak",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "I'm a fan now!",
      "text": "I love the purple with the grey undertone! Orly nail lacquer provides the perfect amount of product with every dip of the brush. I fell in love with the application of this product. I would definitively recommend this polish for nail polish lovers, like myself!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160406
    },
    {
      "title": "Perfect holiday color",
      "text": "Perfect holiday color! This is a great color to wear as a topcoat to another color or my personal favorite is to do two coats of this color. So sparkly and festive.",
      "rating": 5.0,
      "verified": true,
      "author": "Hilary",
      "helpful_votes": 0,
      "publication_date": 20160824
    }
  ],
  "product_meta": {
    "title": "Orly Nail Lacquer, Pink Chocolate, 0.6 Fluid Ounce",
    "description": "Flavor Name:Pink ChocolateThis unique formula delivers a cutting edge resin technology to improve lacquer adhesion and wear ability. This grips nail lacquer to the nail surface for lasting adhesion.",
    "rating": 4.3,
    "feature_bullets": [
      "This unique formula delivers a cutting edge resin technology to improve lacquer adhesion and wear ability",
      "This grips nail lacquer to the nail surface for lasting adhesion",
      "A superior range of shades and the hottest special effects and textures"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1.25 x 1.25 x 3.06 inches; 2.4 Ounces",
      "Item model number": "OA416",
      "UPC": "096200204164 784190293496 096200000537",
      "Manufacturer": "Orly",
      "ASIN": "B0019QXQGO",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Nail Art & Polish",
      "Nail Polish",
      "Beauty & Personal Care",
      "Foot, Hand & Nail Care"
    ],
    "price": ""
  }
}