{
  "website_summaries": [
    {
      "verdict": "A good budget way to add some great low-end sound to a boat without spending too much money.",
      "pros": [
        "Simple design and construction",
        "Enclosure is surprisingly sturdy due to the stiff ABS dust cap and outer shell",
        "Design limits the amount of artifacts and distortion produced",
        "Built for all types of boats"
      ],
      "cons": [
        "Installation may require professional help depending on the boat"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "More space more bass",
      "text": "2cf per woofer with 30sq in of port area and these will blow your mind ... one in a bigger vented box is just as loud as 2 sealed",
      "rating": 5.0,
      "verified": true,
      "author": "Tandrews93",
      "helpful_votes": 2,
      "publication_date": 20180208
    },
    {
      "title": "Soldering issue",
      "text": "Good subs however they were not soldered correctly and ended up shorting out after a month or so. Luckily I had a buddy of mine resolder it and now it works fine.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Excellent speaker. I didn't realize the sound I was ...",
      "text": "Excellent speaker. I didn't realize the sound I was missing.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom L.",
      "helpful_votes": 0,
      "publication_date": 20150916
    },
    {
      "title": "Nice",
      "text": "Put into a small band pass box and it SLAMS.",
      "rating": 5.0,
      "verified": true,
      "author": "GS",
      "helpful_votes": 0,
      "publication_date": 20150613
    },
    {
      "title": "Great sub.",
      "text": "My Lincoln MKS really rocks with this thing in the back powered by a 500W amp. Blows the OEM sub completely away!",
      "rating": 5.0,
      "verified": true,
      "author": "Mikey",
      "helpful_votes": 0,
      "publication_date": 20140430
    },
    {
      "title": "Wow",
      "text": "Just bought two of these for my 19 foot crownline, only got 1hooked (I ran out of speaker wire) and I can't beloved how good the 1sounds. Damn good speaker for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20120319
    },
    {
      "title": "awesome !",
      "text": "this sub is awesome , with a 400 watt amp i got it to knock , it hits hard , really clean bass ! MUST BUY",
      "rating": 5.0,
      "verified": true,
      "author": "esteban_alvrz",
      "helpful_votes": 0,
      "publication_date": 20120716
    },
    {
      "title": "Bump",
      "text": "Older version, but still a great sounding sub. Very accurate and can get low.",
      "rating": 5.0,
      "verified": true,
      "author": "Cody S.",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Great sub for the money, buy not the best",
      "text": "Really nice sub, fits in a rather small area, but not the best I've heard",
      "rating": 4.0,
      "verified": true,
      "author": "Mark Weeks",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Clean Tight Bass",
      "text": "I bought this to install in my suburban with a Polk digital amp as part of an all Polk Audio speaker setup. The amp's feeding 400 watts (at .1% distortion!) to it.The bass is very clean and tight, not muddy or boomy at all (I've got it in a non-ported box that meets Polk's specs). If you want great bass and still want to be able to hear the music, not just a thumping noise, I highly recommend this. I called Polk 3 times in the process of component selection and installation. All 3 times, very knowledgeable techs answered right away. Killer customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 2,
      "publication_date": 20121216
    },
    {
      "title": "Wrong item recieved.",
      "text": "I received a dual voice coil sub (DB1240DVC) instead of the single voice coil sub (db1240) that I had ordered.",
      "rating": 1.0,
      "verified": true,
      "author": "Skax",
      "helpful_votes": 0,
      "publication_date": 20131123
    },
    {
      "title": "Very great sub and very affordable",
      "text": "I owned two of these a few years back and now that i look back at it i realize they were way too much for me. Im not exactly sure how these were hooked up because my friend did it while i was at work. But let me tell you did they ever pound. They came in a ported box made for them by polk audio, and were hooked up to a sony xplod 1400 watt amp. They impressed people with much louder systems and shook everything in my suv. Very great sub and very affordable.",
      "rating": 4.0,
      "verified": false,
      "author": "Brandon Nierenhausen",
      "helpful_votes": 0,
      "publication_date": 20150219
    },
    {
      "title": "Great Subs/Great value",
      "text": "I bought these subs from abc warehouse and theyre really impressive. these subs match up with my friends 600+ dollar system. I have mine in a ported box and my rear view fell off the second day i had em.",
      "rating": 5.0,
      "verified": false,
      "author": "RobBrooks93",
      "helpful_votes": 2,
      "publication_date": 20120704
    },
    {
      "title": "Just try them!!!!",
      "text": "Very good speakers, you would swear I have competition but, it's never what you have, it's how you hook it up. I'm knocking so hard, Damm it boy!!!!!!",
      "rating": 4.0,
      "verified": false,
      "author": "Wynell henry",
      "helpful_votes": 2,
      "publication_date": 20150604
    }
  ],
  "product_meta": {
    "title": "Polk Audio db1240 12-Inch Single Voice Coil Subwoofer (Single, Black)",
    "description": "The Polk Audio db1240 12 inch single voice coil subwoofer speaker is incredible sound at an affordable price. The polypropylene cone with rigid ABS dustcap stiffens the cone for greater mechanical stability and lower distortion. Marine Certified Polk db series speakers are built tough to withstand the toughest environments so they are perfect for use in boats of all types. That's why Correct Craft offers Polk Audio speakers in their award winning Nautiques ski and wakeboarding boats. The db series subwoofers from Polk Audio are all about belting out deep, precise, stomach shaking bass. The db Series Subs produce gutsy bass in sealed, ported and band pass enclosures. No matter how you like your bass, you get the tight, musical loud bass that db is known for.",
    "rating": 3.8,
    "feature_bullets": [
      "A marine single voice coil subwoofer speaker",
      "Equipped with 12 inch black Dynamic Balance polymer composite cone",
      "Frequency response: 27 200 Hz",
      "Power handling: 360 watts continuous, 720 watts peak",
      "Marine certified Polk db Series speakers are built tough to withstand the toughest environments"
    ],
    "specifications": {
      "Product Dimensions": "12.6 x 12.6 x 6.3 inches",
      "Item Weight": "12 pounds",
      "ASIN": "B0016GZ3PO",
      "Item model number": "AA1241-A",
      "Customer Reviews": "3.8 out of 5 stars20 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#218,847 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Other display features": "Wireless",
      "Manufacturer": "Polk Audio",
      "Date First Available": "November 1, 2007"
    },
    "categories": [
      "Electronics",
      "Car & Vehicle Electronics",
      "Marine Electronics",
      "Marine Subwoofers"
    ],
    "price": ""
  }
}