{
  "website_summaries": [
    {
      "verdict": "This minimizer bra is a practical choice for women seeking a bra that's comfortable, supportive, and provides full coverage.",
      "pros": [
        "This minimizing bra offers full coverage and is easy to put on and take off thanks to a hook and eye closure",
        "Double layer underwire cups provide essential support"
      ],
      "cons": [
        "Some women caution that this bra is very high cut, making it difficult to wear with certain shirts and tops"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great price, Great Bra",
      "text": "Comfortable bra. Bali is the only bra with an underwire that fits me good and doesn’t feel like the wire is jabbing me all the time. Great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Nice bra",
      "text": "I found this bra to be just right which is surprising because up until the last couple years, I wanted to try a bra on before I bought it. It fits well and gives you a smooth look.",
      "rating": 5.0,
      "verified": true,
      "author": "Lulu43",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Great comfort and support",
      "text": "Very comfortable with excellent support. I was extremely pleased to finally find a bra that provides the support I need while still being comfortable enough to sleep in if I need to! I barely notice I'm wearing it all day. It's definitely not a tee-shirt bra--in the cold weather at least!--but it's perfect for wearing under a sweater or sweatshirt.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171202
    },
    {
      "title": "Not Terrible, but not great.",
      "text": "My underwire snapped after a year of use on my VS bra just in time for my husband to lose his job. I didn't want to spend $40 right away on another VS bra (even though I love them!) so I came onto amazon and purchased this one. It's not the greatest thing in the world. When I put it on it always makes snapping/popping noises like I'm stretching it too far even though I'm not pulling hard or far. When I finally get it on its super form fitting and digs into me some. Just not really my cup of tea when it comes to bras. I also wish it was a little thicker through the cup area.",
      "rating": 3.0,
      "verified": true,
      "author": "Kiyonai",
      "helpful_votes": 0,
      "publication_date": 20130528
    },
    {
      "title": "Great Bra for Fuller Figures",
      "text": "I love this bra. I bought one to check it out. It was a PERFECT fit based on their fit guide - not on prior bras. The cup has side coverage too which I wanted and needed with a large cup size. The bra is very comfortable, the back hook closure is even and solid, the straps are easily adjustable without sliding down again, and I feel excellent support. Got the girls uokp and off the lower chest. I liked it so well I went ahead and bought more",
      "rating": 5.0,
      "verified": true,
      "author": "Julie F",
      "helpful_votes": 0,
      "publication_date": 20160128
    },
    {
      "title": "Manufacture Issues",
      "text": "I tried one of these on at Kohls and it fit like a dream. I knew they were cheaper here on Amazon so this is where I ordered. It is not the same. The one at Kohls fit absolutely perfect, and this one the band is tighter and there are issues with the cups as well. I'm not sure where the one in Kohls was manufactured at, but the one I ordered here was made in Honduras.",
      "rating": 3.0,
      "verified": true,
      "author": "blehman",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "finally - a minimizer in smaller sizes!!",
      "text": "i was so happy to find a minimizer in my size (32C). i don't like a big boob look, prefer a sleeker line under clothes, & this bra accomplished that. plus it's extremely comfortable, no digging & the silky finish means cotton tees lay smoothly without bunching. i only wish Lingerie Diva had another one in stock, as i know i can trust them to send the same product; however i loved this bra so much, i'm ordering a second one from another Amazon supplier & hoping i get the same quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Zombies8me",
      "helpful_votes": 0,
      "publication_date": 20120815
    },
    {
      "title": "Priced Right & Comfortable",
      "text": "My bra of choice. If you are large this is the bra for you. Comfortable and reduces your breast size. Great price too.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol B",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "A Winner!",
      "text": "I am giving this a 5 * because of the comfort & support. I love the fact that the shoulder straps are centered more towards the actual center of your chest- where actual support is needed and NOT under your arm pits which does nobody any good. (male designers, surely!) It minimizes fine but is not an athletic-feeling bra, which can either be a plus or minus depending on your needs. It sounds painfully cliche, but I forgot I had on my NEW bra 1st day I wore it, it was that comfortable. Definitely worth purchasing-- at least to try.",
      "rating": 5.0,
      "verified": true,
      "author": "Isaacdog1971",
      "helpful_votes": 0,
      "publication_date": 20130202
    },
    {
      "title": "Fit is large compared to others",
      "text": "I ordered my normal size 40DDD and this bra was too big. I think a 38 would have fit better. I think it runs a little larger because of the material. (very stretchy) When I tried it on, it was very comfortable though. Even if it had fit, I would not have kept it. The \"minimizer\" actually maximizes. Breast tissue gets pushed to the sides and makes you appear even larger. It does seperate well though. Maybe it will fit a different shape better.",
      "rating": 3.0,
      "verified": true,
      "author": "DDMARSH",
      "helpful_votes": 0,
      "publication_date": 20120928
    },
    {
      "title": "Makes me look like a 1970's car with headlights!!",
      "text": "Bought this to replace the passion for comfort minimizer style 3642 which was discontinued. Not happy with this one, though, because of the piece of fabric they inserted between the cups which spreads breasts widely across the chest. I feel like a 1970's car with headlights when I have this on!!!",
      "rating": 3.0,
      "verified": true,
      "author": "In My Opinion",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "Excellent bra with soft fabric and a great minimiser!",
      "text": "Really soft fabric that feels so smooth against the skin. It is a great minimiser bra and can be worn the whole day(with ease). Be sure to hand wash your bra though. It is great value for money. I was all for those expensive Wacoal ones from Macy's until I saw really good deals from Amazon. I would strongly recommend Bali Minimiser bras from Amazon. Excellent service and free returns by Amazon. What more could you ask for! Excellent daily wear bra!",
      "rating": 5.0,
      "verified": true,
      "author": "Gav Bac",
      "helpful_votes": 0,
      "publication_date": 20121212
    },
    {
      "title": "My new favorite",
      "text": "This is by far the best bra that I've worn in a very long time. Over the years I've bought a lot of different bras but now that I've found this one, I won't bother with any of the rest. So far I've purchased it in white and beige and love them both. It's a little harder for those of us with a larger bust to even find something that fits without overflowing over the top. Let alone a bra that's so comfortable and attractive, so I'm very happy to have found this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20090803
    },
    {
      "title": "Very good bra",
      "text": "It's a good minimizer, comfortable, and not a harness. 3 hook back closure and tagless. There's nothing scratching your back and no uncomfortable side wire. The fabric is soft and smooth. The bra can easily be worn with lower cut tops. Surprisingly, the cups are true to size, but the bra give very good separation and cleavage....just like the photo. The straps are comfortable. I don't normally wear underwires. These underwires are comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Trend",
      "helpful_votes": 2,
      "publication_date": 20091117
    },
    {
      "title": "Bad bra",
      "text": "Definitely not a good bra. Cheap made and very uncomfortable.",
      "rating": 1.0,
      "verified": true,
      "author": "Shelly Richey",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Good support and worth buying!",
      "text": "These bras are heaven sent. I’ve been buying this brand and style for years and love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "I do not like underwire bras because of my short torso the wire ...",
      "text": "I do not like underwire bras because of my short torso the wire is too long and digs into my underarms. Wish this one came without the wire but since I like it so much I just cut the wire out, very easy to do. Only wish this bra came without underwire, maybe the manufacture might make one like this minus underwire.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Scott",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "so comfortable",
      "text": "this bra is so comfortable, i wore it all day just around the house yesterday and forgot i was wearing it, and i normally cannot stand bras. i especially don't like underwire, but the underwire in this is soft and flexible. it ran *slightly* large in the cups for some reason. (36C) great bra though, and flattering. perfect for everyday wear.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Brannan",
      "helpful_votes": 0,
      "publication_date": 20120517
    },
    {
      "title": "great comfort, good price and quality",
      "text": "I ordered or bought about 10-12 of this type in different colors in the last 2 years. wearing it everyday at work (food service), at home or out shopping or dancing. I wear a 38d and this bra gives me great support and comfort throughout the day. I definitely recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Rox",
      "helpful_votes": 0,
      "publication_date": 20130629
    },
    {
      "title": "Not for very full busted women as cut too low in the middle!",
      "text": "If you are full busted this might be cut way too low for you. I found myself bulging out of this bra in the middle as I am very full busted. Didn't work for me at all, so sending it back. Nice and soft material, tho, so it is too bad.",
      "rating": 2.0,
      "verified": true,
      "author": "Tootsie",
      "helpful_votes": 0,
      "publication_date": 20140802
    },
    {
      "title": "Good bra for activity",
      "text": "I have a hard time finding a bra that can really be worn doing physical labor. Sports bras tend to have me falling out the bottom. I have a small rib cage and large cup size, wires usually end up poking, straps sag, this bra is even better than the previous model because of the metal strap cinch, it truly does not move even after a long day of hard work. For an underwire as comfortable as you can get, wires have never stabbed me or rolled even if I am not so good about washing by hand, etc. This bra even looks pretty although it's all function. Yea! Thanks Bali!",
      "rating": 5.0,
      "verified": true,
      "author": "Renette M. Saba",
      "helpful_votes": 0,
      "publication_date": 20140812
    },
    {
      "title": "Doesn't look like picture",
      "text": "The Bali bra I bought didn't look like the picture. It looked more like a female vickings chest plate. The cups covered the majority of the chest area. I do have to say other than it's unattractive look it does give great support and the material is quite comfortable.",
      "rating": 3.0,
      "verified": true,
      "author": "Lubna",
      "helpful_votes": 0,
      "publication_date": 20140124
    },
    {
      "title": "Heaven for the sistas!",
      "text": "Perfect coverage, super comfortable. I'm a 32ddd, and it fits superb. NEVER buying from Victoria's secret ever again.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Bradley",
      "helpful_votes": 0,
      "publication_date": 20161004
    },
    {
      "title": "amazing bra",
      "text": "I have searched everywhere for all kinds of bra.....and believe me this is the best....it fits so perfect and feels so smooth I am looking forward to order more....my only concern is they don't have too many color options in 32c",
      "rating": 4.0,
      "verified": true,
      "author": "mbs",
      "helpful_votes": 0,
      "publication_date": 20120412
    },
    {
      "title": "My New Favorite Bra",
      "text": "So comfortable even for fuller figures - and like many others I was amazed that it fit so well without a try on first - Bare Necessities is a great seller and I have purchased many other items from them - you can't go wrong on this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Joanneva12a",
      "helpful_votes": 0,
      "publication_date": 20090327
    },
    {
      "title": "Very confortable and minimizer really works! I read a ...",
      "text": "Very confortable and minimizer really works! I read a few reviews here saying that this bra usually is bigger than the expected size. For this reason instead of ordering a 34DD, I bought a 34D. HUGE MISTAKE. The 34D fits exactly how a 34D should...",
      "rating": 4.0,
      "verified": true,
      "author": "Lila",
      "helpful_votes": 0,
      "publication_date": 20150709
    },
    {
      "title": "Best Bra Ever",
      "text": "Best bra I ever had. Fits perfectly and holds the girls up very nicely without making me look huge.",
      "rating": 5.0,
      "verified": true,
      "author": "Dunkinqueen",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Nice and well made",
      "text": "Being a size 42DDD, it is hard to find bras that not only fit right, but are comfortable too. This one does the trick! It's the best minimizing bra I've owned. It is comfy and sturdy, I think it will last quite a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Patti",
      "helpful_votes": 0,
      "publication_date": 20140223
    },
    {
      "title": "okay but better bras out there",
      "text": "These bras are okay for price but don't keep shape for long. I am fussy with bras and only handwash. Next bras I purchased were body by Wacoal and they are superior and great quality. If you are busty I would definitely recommend Wacoal - a little more expensive but worth it.",
      "rating": 4.0,
      "verified": true,
      "author": "LG",
      "helpful_votes": 0,
      "publication_date": 20150819
    },
    {
      "title": "True size",
      "text": "It is a great product. True size and fits great. I ordered white color and i felt happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Hema",
      "helpful_votes": 0,
      "publication_date": 20130515
    },
    {
      "title": "I kept this one and sent the Victoria Secret's back",
      "text": "I'm a 36C and hate anything itchy or pokey or too ridiculously \"girly\" - this is a winner. Nothing pokes out on top, the girls are happy. I highly recommend you give it a try.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20140210
    },
    {
      "title": "Wow!",
      "text": "\"Really, how good could it be?!?\" I thought to myself. It doesn't cost a fortune and it's not a \"expensive brand name here\". This bra is comfortable and separates the girls so no funk is happening in between. I won't use it for sports activities but this bra is pretty, comfortable and functional. I'm buying more!",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 0,
      "publication_date": 20130301
    },
    {
      "title": "perfect for me",
      "text": "Perfect! For the past years I've been using a certain expensive brand because it was the only one that fitted me perfectly until now. This bra was better than what I expected. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Claudia",
      "helpful_votes": 0,
      "publication_date": 20150101
    },
    {
      "title": "Poor fit--terrible!",
      "text": "I just bought this bra because of all the wonderful glowing comments. I wish I had just read the 1 & 2 star reviews before purchasing. The bra is a terrible fit. The cup is too small in places and too large in places. Yep, you read that right. It's awful. I don't think I will ever buy another Bali.",
      "rating": 1.0,
      "verified": true,
      "author": "ohhhdear",
      "helpful_votes": 2,
      "publication_date": 20130509
    },
    {
      "title": "Almost perfect",
      "text": "The Bali bra fits very well, great fabric, suport, minimizing and fit. But show through is an issue, the perfect minimizer bra would have all the great Bali fit features and the concealing fit that comes with most Bali bras, happy but still looking.",
      "rating": 4.0,
      "verified": true,
      "author": "Kirstin Miller",
      "helpful_votes": 0,
      "publication_date": 20120317
    },
    {
      "title": "Wonderful Bra!",
      "text": "For a bra that decreases your size and gives you the comfort that last all day, this is the bra. I have always worn a minimizer bra and this is the best. I highly recommend this bra!I never feel the unwire! Bali Passion for Comfort Seamless Minimizer Underwire",
      "rating": 5.0,
      "verified": true,
      "author": "Pat",
      "helpful_votes": 0,
      "publication_date": 20110208
    },
    {
      "title": "but super comfortable as well",
      "text": "This is the only bra that works for me after my reduction. Since I am much more round now, I have a hard time staying in most bras the correct size. These are not only functional, but super comfortable as well, I forget I have it on most days. I wish there were more designs however, and a thinner strap.",
      "rating": 4.0,
      "verified": true,
      "author": "Liza Huffman",
      "helpful_votes": 0,
      "publication_date": 20160613
    },
    {
      "title": "bras don't fit",
      "text": "I purchased my size and got all four bras too big. I spent over $60 and I need amazon to do something about this.",
      "rating": 1.0,
      "verified": true,
      "author": "Me122",
      "helpful_votes": 0,
      "publication_date": 20131214
    },
    {
      "title": "Wow, wow, wow is right: This is my new bra!",
      "text": "It's hard to find a good bra that fits those of us with very large cup sizes (38DDD), usually something ends up binding or rubbing in the wrong place, but NOT this bra. Soft, comfortable, stylish and supportive, this bra is absolutely wonderful to wear. I also don't find myself re-adjusting the straps all day long. And no annoying pattern to show though my blouse. I love this bra, and will be getting many more!",
      "rating": 5.0,
      "verified": true,
      "author": "MonaLS",
      "helpful_votes": 109,
      "publication_date": 20080526
    }
  ],
  "product_meta": {
    "title": "Bali Passion For Comfort Minimizer Underwire Bra",
    "description": "Bali #3385 is America’s #1 women’s minimizer bra style\n\nSource: The NPD Group / Retail Tracking Service, U.S. dollar sales, 12ME July 2019\n\nPassion for Comfort bras are elegant yet comfortable bras that will help you feel beautiful whenever you wear them. The silky-smooth lining offers just the right level of modesty under your blouses and sweaters without adding extra padding. Lightly cushioned straps help eliminate shoulder stress. This minimizing bra helps reduce bust projection up to 1½,\" slimming your silhouette.",
    "rating": 4.4,
    "feature_bullets": [
      "Adjustable closure",
      "Minimizes up to 1 1/2\" - slims your look and helps clothes fit better",
      "Hidden, encased underwires help provide a more comfortable fit",
      "Silky smooth lining pampers your skin",
      "Easy-on-you straps adjust in back",
      "smooth cups with elegant lace insets at the straps"
    ],
    "categories": [
      "Minimizers",
      "Women",
      "Lingerie, Sleep & Lounge",
      "Lingerie",
      "Clothing, Shoes & Jewelry",
      "Bras",
      "Clothing"
    ],
    "price": 39.98,
    "specifications": {}
  }
}