{
  "website_summaries": [
    {
      "verdict": "These sticky traps will take care of a number of household pests. Trap location is everything when it comes to sticky traps like this one.",
      "pros": [
        "Effective against a number of different pests, including mice",
        "A good solution where snap traps and poisons are prohibited",
        "Cheaper than an exterminator"
      ],
      "cons": [
        "Pests are trapped but not immediately dispatched",
        "Larger pests can walk away from sticky traps"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I had a super mice. I have tried over $500 worth of ...",
      "text": "I had a super mice. I have tried over $500 worth of service and products to trap this super mice. I think this mice is the great Einstein in reincarnation. Every single attempt was successfully deflected by this little pint size critter. But wait as they say NFL - Not for long. Thanks to CatchMaster Mouse sticky pads. I get these little pads today on Amazon prime. 3 hours later, Mr. Einstein super mice is stuck and ready to be eaten al a carte by the owls. Picture attached. Au Rovoir my nemesis. You were a good match.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Haniffa",
      "helpful_votes": 12,
      "publication_date": 20170903
    },
    {
      "title": "Garbage. The mice ate the mouse trap glue and all",
      "text": "The mice ate the trap. I placed two traps. One open with glue side up and the other assembled as a tunnel. The mice left footprints in the upright trap and ate the tunnel trap glue and all. Useless garbage traps.",
      "rating": 1.0,
      "verified": true,
      "author": "IT Tech",
      "helpful_votes": 8,
      "publication_date": 20190304
    },
    {
      "title": "Wow",
      "text": "Wish I hadn't dropped one face down on garage floor. Trust me when I say you can't pull it off! Also caught 2 scorpionsin my garage and they stayed put. Packaging says for snakes too and I believe it. Hope my dog doesn't step on these or he will be stuck too...",
      "rating": 5.0,
      "verified": true,
      "author": "Orvis",
      "helpful_votes": 3,
      "publication_date": 20200317
    },
    {
      "title": "Sticky is weak",
      "text": "It doest stick well. I have \"catchmaster\", my dog pursues mice and will tear up furniture to get to them, (actually greatful for that). But in his pursuits has gotten attached to two difffernt stickies...and all I had to do was step on a corner so he could remove himself from it. Im glad my dogs ok, but we haven't caught a mouse with these and I dont think we will .",
      "rating": 1.0,
      "verified": true,
      "author": "Amazonian",
      "helpful_votes": 2,
      "publication_date": 20200820
    },
    {
      "title": "Excellent crazy cricket catcher",
      "text": "Re: peanut butter smell - only noticed when opening the box. Once traps are in place, no odor. Peanut butter loving dog completely ignores. In less than 24 hours, cricket issue is under control in the furnace room.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Wren",
      "helpful_votes": 6,
      "publication_date": 20191005
    },
    {
      "title": "Inexpensive and effective",
      "text": "These glueboards work very well. As my wife and mother-in-law are both highly-sensitive to chemical odors I had to fine some means to capture/kill insects around the home and do so without noxious fumes. I distributed several throughout our respective homes and they've been collecting 'bugs' ever since. Caution--the adhesive is *very* sticky. The boards are pre-creased to form into small 'boxes,' and if the adhesive is allowed to contact itself while folding you will NOT be able to separate the surfaces. If used without folding, do NOT use to swat at running insects. Don't ask. |:-\\",
      "rating": 5.0,
      "verified": true,
      "author": "Amphion612",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "unattractive & not very effective",
      "text": "I wish I had paid more attention to people's photos. I assumed that all the green writing and graphics would be on the paper you remove, and not on the adhesive itself. Since I lay these flat in front of the door to my balcony, which is in my living room, it's not very attractive. (neither are dead bugs, but I cover them up with small pieces of paper until it's time to replace them!) I was using another brand which is all white, and was much stronger and was catching more silverfish and spiders. I tried these because they're less expensive, and now they're going in the trash.",
      "rating": 2.0,
      "verified": true,
      "author": "gailcnh",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Not working",
      "text": "I tried 3 different brands for cock roaches, only one works, however this is the useless one.",
      "rating": 1.0,
      "verified": true,
      "author": "dreamwander",
      "helpful_votes": 4,
      "publication_date": 20200328
    },
    {
      "title": "Great, use peanut butter morsels",
      "text": "This is the second time I've purchased these. First set were hard to peel, second not so much. I think the bait was also stronger in the first set. So I bought some reese's peanut butter morsels. I press one or two of these dead center and leave them wide open, flat. I've also tried chocolate and cheese. Personally I think the pb morsels work the best. Then when I catch them I cover them up with a rag and whack them over the head . WEAR PLASTIC GLOVES cuz the glue is strong.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Catches mice,rats 🐀  and 🐍 snakes!",
      "text": "We have had such great success ridding our country mobile home of small mice but what a surprise when it caught a rat 🐀 snake under our sink! Will never buy anything else now. Wonderful sticky product.",
      "rating": 5.0,
      "verified": true,
      "author": "CHERYLE C EDWARDS",
      "helpful_votes": 2,
      "publication_date": 20200808
    },
    {
      "title": "The traps smart mice avoid.",
      "text": "Mice know to avoid these. Bugs not so much. I use these more to deter the mice not so much to trap them as they seem to know to steer clear of the glue traps. Many years ago I trapped a mouse in a corner and had the sense of mind to get a bunch of glue traps. The mouse got on top of a bag I had, surveyed the situation (being surrounded by glue traps) and attempted to Evil Knievel across them. He failed and got stuck on a trap. Since then I knew that glue traps only work on stupid mice and most of the mice in my house went to Harvard.",
      "rating": 4.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Great supplement to regular pest control - Scorpions and spiders oh my!",
      "text": "I've been using these for years with great results. I place them under night stands, beds, couches, behind toilets, in pantry, laundry room, etc. I try to remember to replace them once a year with fresh ones. Dust accumulation reduces their stickiness. I think this time around I am getting 30 for like $14, so cheap. They always have different size scorpions, spiders and other creatures stuck in them that you don't want crawling on you! When I first learned of these, I used them in my garage to take care of a field mouse issue. They worked great for them too. Now-a-days, in Central Texas, I like them for Scorpions the most.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Dekreek",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "It will stick to whatever steps on it.",
      "text": "I have caught a dozen mice and bugs with this product. Anything that steps on it will be glued to the catch board, with no exceptions. If you step on it, sorry you will lose your shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "joey X.",
      "helpful_votes": 2,
      "publication_date": 20200311
    },
    {
      "title": "Works!",
      "text": "I had a fly problem! Gross! I tried all kinds of \"natural\" ways to rid myself of these insects.... they all worked, but it was slow. So, I bought these to augment those natural efforts, to my relief, it only took a few hours until the \"sticky boards\" had cleared my home. These boards do not smell, they are nontoxic, and are designed to attract bugs. I had to use only 3 boards, so I have plenty if I should have a problem again. When I run out, I will be back for more.",
      "rating": 5.0,
      "verified": true,
      "author": "Ginny",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Crappy trap",
      "text": "I caught a mouse 1st night, I threw it in the trash it looked to be really stuck. This morning I woke up went to take the trap to outside garbage and the mouse was gone",
      "rating": 1.0,
      "verified": true,
      "author": "Lori Thomas",
      "helpful_votes": 2,
      "publication_date": 20200422
    },
    {
      "title": "These do work... maybe not the best, but they work.",
      "text": "It is been a year and I have used 30 of these. I find that these work nearly, if not just as well, as more expensive ones. At first, I didn't think so, but who am I to get into the mind of these bugs to find out why the other brands seemed to catch more than these. Here is the evidence (see the picture). They work! I don't have mouse, rat, or snake trouble so I can't review for those, but spiders and centipedes do find their death on these things. For the price, I'm a fan. Getting more now.",
      "rating": 4.0,
      "verified": true,
      "author": "D and R",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Didn't trap the mice",
      "text": "Damn mice, and rats, were eating my outdoor cat's dry food. I got a trail camera and it triggered more than 50 times in one night. Apparently the mice were jumping from the trash can to the raised platform where I fed the cat. I put one of the sticky traps on top of the trash can lid, and the next morning I did not have any trapped mice, but the pad was dirty from multiple mouse feet. It did work in that they couldn't jump from the sticky pad ... but it didn't trap them.",
      "rating": 3.0,
      "verified": true,
      "author": "Henry",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Awesome!! Great value and works great for mice",
      "text": "Caught the very last b*stard mouse in my house that has been taunting me for days..... he survived a traditional wood snap trap and tomcat glue trays. But this catchmaster glue board caught him the 1st night I set them out. I used them unfolded and tucked into the corners...GOTCHA SUCKA!",
      "rating": 5.0,
      "verified": true,
      "author": "JewelHellcat707",
      "helpful_votes": 2,
      "publication_date": 20181016
    },
    {
      "title": "Works great",
      "text": "Catches a whole bunch of things while you sleep. Know what's running around in your house. AND CATCHES SKINKS OUTSIDE TOO. There number just got too high around our house. I'd catch 10-20 a week when I started. They were around all summer, but there numbers were definitely decreased. 2 birds died getting caught in the traps as I think they were looking for an easy meal. :-(",
      "rating": 5.0,
      "verified": true,
      "author": "T. Denn",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "They don’t work real good",
      "text": "I will not buy these again. Caught some mice but others were able to get off the glue trap. I even saw one had pieces of insulation and other stuff on it like the mouse thought it was a joke but no mouse. One board was partially chewed up so apparently the glue isn’t sticky enough if it ate it. Some of the boards were moved. The glue on the board needs to be thicker. One glue trap board ended up being upside down on my linoleum away from where it was put but no mouse. Will go back to buying the ones at Home Depot or Lowe’s.",
      "rating": 1.0,
      "verified": true,
      "author": ":-)",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Not effective!",
      "text": "I've used all kinds of traps, and these were by far the least effective. Twice I found the boards with mouse fur on them, but no mice, apparently they escaped! Finally I caught one mouse after putting out 30 of these. It was still alive and moving around on the board so I had to kill it. NOT FUN :( Meanwhile I caught a mouse every single day during the same time period using other devices. (Yes, I caught over 60 mice total- whohoo country living!) But 1 in 60 is not a very good ratio. Go with snap style traps, they killed 59/60 mice and work much better than these.",
      "rating": 1.0,
      "verified": true,
      "author": "Hillary in the hills",
      "helpful_votes": 3,
      "publication_date": 20170628
    },
    {
      "title": "They Work for Crickets",
      "text": "My garage was absolutely infested with crickets. I bought these and placed them strategically around the perimeter and within a couple days all the crickets were gone. I have plans to do a thorough cleaning and try to seal up the doors a bit better, but will definitely keep these traps around to catch any that get in. These also caught a handful of (read: big, hairy!) spiders. I don't really get the red print on the sticky side...there is even one that looks like little bugs which always makes me double-take at the trap. It doesn't really change how effectively the traps work, just a weird design decision.",
      "rating": 5.0,
      "verified": true,
      "author": "Melundie",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Have caught 6 mice.  Peanut scent is not bad.",
      "text": "Have caught six mice with these traps in the basement and garage, after putting out about a dozen. The scent of peanuts is quite noticeable, but not offensive, and weakens fairly quickly. Those who have sympathy for little critters might be bothered by the fact that the mice don't die right away after being caught, though this should be obvious. They get stuck and wiggle around until they die of fear or starvation. If you notice that one is caught, you might be able to think of a humane way to finish it off (and I would like to hear about that!).",
      "rating": 5.0,
      "verified": true,
      "author": "Gorman Pedigrew",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "These work just fine.  Big bugs, small bugs.",
      "text": "In so calif we have those huge cockroaches/water bugs that come frm outside. Terrifying creatures! Huuuge. Up to 4\" long with additional 3\" antennaes. I wonT use anything toxic in a house, and these monsters suddenly are everywhere. Very fast too. My neighbors are already used to my horrifying murderous screams when i see one... these glue pads are my choice of weapon. They do work. I wish therewould be non toxic way to bomb the house once and be done.",
      "rating": 5.0,
      "verified": true,
      "author": "health nut",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Caught a Scorpion!!!",
      "text": "These are amazing. I recently moved to Oklahoma and I've never experienced creepy crawlers coming in my home like I have here. These traps are a life saver for me and my little one. They have caught baby snakes, scorpions, spiders, sliverfish and a bed bug that was hiding in the apartment. I suggest them to any parent with a small child or infant. Also, peppermint oil diluted with water helps to deter the same critters.",
      "rating": 5.0,
      "verified": true,
      "author": "Lina Dominguez",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Really not effective",
      "text": "I originally purchased some D Con sticky traps that have caught a few mice and also smell like peanut butter. But, they’re expensive. I decided to try these that are much more economical. Unfortunately, the mice just don’t seem to care about them. I placed them in the garage and shed, and they haven’t caught any. I gave three stars because maybe my mice are just snobs and only like the fancy glue traps. Maybe your mice are more down to earth, buffet mice.",
      "rating": 3.0,
      "verified": true,
      "author": "Bob 🎮💻",
      "helpful_votes": 2,
      "publication_date": 20171128
    },
    {
      "title": "Thee work great",
      "text": "Not sure if it is the peanut butter smell but i catch more spiders, centipedes, ants and other insects with these traps. Some I leave flat, not folded as they cover more space and are in spaces that do not have foot traffic. Cover loosely with raised boards if you have pets. This is my second order of these glue boards. I use the other smaller type of glue boards too, folded up and placed on both sides of all entryways, behind the toilets and even under the head of the beds. Always surprised at how many creepy crawlers they cstch. I sleep better at night too.",
      "rating": 5.0,
      "verified": true,
      "author": "GEORGE FARQUHAR",
      "helpful_votes": 0,
      "publication_date": 20170506
    },
    {
      "title": "Great product great price  Bueno cosa!",
      "text": "Was buying similar ones at $ store. Can be cut in half or thirds. The stickum lasts 3-4 days. Don't bother folding tents like they show unless squeamish factor involved. Will buy again. Of course this is in addition to chemical warfare. Estaba comprando otros similares en $ store. Se puede cortar por la mitad o tercios. El stickum dura 3-4 días. No te molestes en plegar tiendas como se muestran a menos que haya un factor aprensivo. Will comprará de nuevo. Por supuesto, esto se suma a la guerra química.",
      "rating": 5.0,
      "verified": true,
      "author": "Hurricane Ferris",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "These will hold to anything.... even ...",
      "text": "These will hold to anything....even the side of the dryer if you're not careful,lol... If you have pets, please, don't put these any where that they can possibly get to 'em.. They will not let go.. If they was to put their little nose and mouth on it they wouldn't be able to breathe and it would take a while to un-stick 'em...If you just yanked it off it would take part of their nose, I think... I guess I just worry too much...but do keep that in mind if you get 'em and have fur babies,but, they will do the trick for creepy crawlies if they go to it....",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Walker",
      "helpful_votes": 0,
      "publication_date": 20170513
    },
    {
      "title": "Catch Scorpions",
      "text": "These are great for catching scorpions, but be sure to dispose of them when they're caught as some seemed to be working their way off of the glue board. I cut them in threes length wise to get more mileage out of them and put them near entrances and around high traffic areas. Caught all kinds of other bugs too that we weren't even targeting like fire ants, and earwigs, sadly some crickets. Be sure to warn guests as people we had over to the house always seemed to step on them for some reason.",
      "rating": 4.0,
      "verified": true,
      "author": "Ana R",
      "helpful_votes": 4,
      "publication_date": 20151127
    },
    {
      "title": "Creepy crawlers beware",
      "text": "I bought these for my garage. We live out in the country and have lots of spiders and bugs. I just lay them flat in the corners and around my washer and dryer. So far I have caught lots of spiders and 2 big lizards. My kids love to look at the traps and see what we have caught! I don't find the smell annoying but I would be careful of letting pets near them as they are extremely sticky. We had a stray cat walk into the garage and leave with one of the traps stuck to het side. She was not happy when I caught het to pull it off.",
      "rating": 5.0,
      "verified": true,
      "author": "Frugal Mom",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "Honey Glue Spider Traps",
      "text": "I love these!! They smell good enough to eat, and the spiders think so too, which is exactly why I purchased them. We live in a wooded area, and due to the heat especially this summer, they are really coming in to keep cool, right into these traps!! Thank you for having such a great product. Guarantee I'll be purchasing more, for I like the fact that the cardboard is sturdy too, and not cheap. These are very well made and worth the money. Proudly made in the USA, and GREAT PRODUCT!! Very happy customer, Calam",
      "rating": 5.0,
      "verified": true,
      "author": "calam",
      "helpful_votes": 21,
      "publication_date": 20120804
    },
    {
      "title": "Catches giant roaches/ water bugs",
      "text": "These work great on those giant roaches , some say water bugs . Either way they are nasty creatures . I had one sticky trap under my stove for almost 2 months . I just pulled it out again tonight and for a creepy surprise . My building Super wants the exterminator to spray in my apartment . I told him I don't want chemicals in my place , I'll handle it myself .",
      "rating": 5.0,
      "verified": true,
      "author": "Ernst J. Voye Jr.",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "2 for 2 - These work, no scent needed, just a little real Peanut Butter",
      "text": "These have worked now twice in a row, once with no scent, once with the PB scent. Both were baited with real PB, and I was able to catch the mouse both times. The trick both times was leaving the knife with PB on, and leading to a trap and a flat laid out board. These work if used right (be smart) and no scent is needed with real PB bait, smeared on a knife leading to a trap setup.",
      "rating": 4.0,
      "verified": true,
      "author": "Joshua Glazer",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Works, look at the picture.",
      "text": "We live in a new subdivision, homes are populated which means that every insect, animal and pest is seeking new habitat. For example, field mices have found an opportunity or a hole to sneak its way in. In my case, the corner of the garage frame and door. And it's hurricane season. Rain is flooding their nesting hole.",
      "rating": 5.0,
      "verified": true,
      "author": "Frankie white",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "my seasonal purchase for the invasion of crickets and other many legged critters Amazing how many things are stuck in it!",
      "text": "This is my seasonal purchase for the invasion of crickets and other many legged critters. It is amazing just how many things come out at night and scurry across my floor. There are some super tiny scorpions in there along with a few spiders. If I smash a cricket, I put it into a setup trap to lure more in. The crickets don't seem to be able to chirp after they wander in. They fold easily and this year the paper comes off easier. I will be back next year for the on-slot next year.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn K",
      "helpful_votes": 0,
      "publication_date": 20170627
    },
    {
      "title": "Too much printing under the glue",
      "text": "It's a good product what I don't like about it is underneath the glue they have a lot of printing and that's inhibiting to see how many bugs you actually have on your pad I would not buy these again I prefer a plane had under the glue no writing whatsoever that way you're able to see what you have on the glute pad",
      "rating": 4.0,
      "verified": true,
      "author": "Lindy",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "do not recommend",
      "text": "Just awful. This is not a little box. This is a piece of cardboard with heavy glue and is extremely hard to get the peeling off of it. I got glue all over my hands and ruined a shirt. It isn't just that--,you would be torturing insects to death--blah!!!! I got my money back and bought the ultrasonic soldier for $12.99.",
      "rating": 1.0,
      "verified": true,
      "author": "Kathryn L. Tate",
      "helpful_votes": 3,
      "publication_date": 20171018
    },
    {
      "title": "They work!",
      "text": "My parents recently bought a house in a more rural area of California. The garage was over run by mice! My parents told me I could store one of my car's there but there was no way I was going to until I solved the rodent problem. I sealed up the garage with my father and bought 2 packs of these. Since then we have caught 30+ mice, dozens of cockroaches, and countless spiders. Now we have 5 traps spread around the garage and catch the occasional bug or two that get in while we have the garage open.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20170327
    },
    {
      "title": "Awesome Product!",
      "text": "I don't have a mouse problem, but I do get a lot of small creyp crawlies and crickets. I do not wish to use a company that sprays toxic chemicals around the house, so I opt for these glue board traps. I was surprised the next morning when I had lots of various bugs stuck on one of the traps I set. The next morning I even got a small lizard. Thumbs up on this product. Highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "WH",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "They work!",
      "text": "Living on a farm we have spiders, field mice and snakes everywhere. These traps have worked better than anything else. We use them in all our buildings and home. I no longer see spiders inside my home except on the traps by the doors.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelli",
      "helpful_votes": 2,
      "publication_date": 20180928
    },
    {
      "title": "Non-toxic.",
      "text": "Have used this product for years, mostly to catch Brown Recluse spiders. Non-toxic to pets and people. Sticky side traps spiders, other bugs. And, yes, over the years these traps have caught an occasional mouse and small snake. When the traps get full of bugs, just throw away.",
      "rating": 5.0,
      "verified": true,
      "author": "SavvyConsumer",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Catchin' Critters",
      "text": "I don't know what critter we have, but before we bought these I would see poop all over our patio. Couldn't tell if it's a mouse or squirrels, I haven't seen squirrels during the day, just speculating it's mice. We just got it and we got a lot of insects, I think the longer I leave it out there, sooner or later that mouse/mice will be really tempted, then \"BAM!\" stuck! No gettin away!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Hudson",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Works",
      "text": "Have used along borders in garage and driveway - good for small mice, chipmunks, and small bugs. Cut some in half and needed to use goo gone on scissors. I did see one bug initially caught which later wasn't there, maybe bug was too light. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "RVA Shopper",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Great for german roaches",
      "text": "I have used this traps for years and they are awezome. I used to live in an apartment which got infested with german roaches. I put a bunch of this traps around the kitchen and even after the first day some of the traps were full, kinda gross to find how many roaches where in the kitchen. Within a a couple of weeks the roaches were mostly gone, just a few here and there. I used some other poison to kill them. But the traps took care of most of the problem. Definitely recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Javier",
      "helpful_votes": 2,
      "publication_date": 20160923
    },
    {
      "title": "If you suspect that you may have mice, get these traps.",
      "text": "Good value, caught so many mice that I didn't kmow I had in my apartment 😯. Thank you for these glue traps. My granddaughter is terrified of anything that crawls. I sleep better knowing these traps a quietly working their magic to rid my apartment of those unwelcomed visitors.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Love",
      "text": "I love them. I put them in a catch n release box with some peanuts & .then when i get 1 i just throw out the glue trap say im sorry & repeat. They cant get away then & the kids cant get stuck to them. I wasn't a fan of folding it. It was hard to see it i had 1.",
      "rating": 5.0,
      "verified": true,
      "author": "beth mills",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "The fragrance was far too strong to use - it has like a weird almost perfumey/savory scent that I can't put ...",
      "text": "I can't review on the effectiveness of these because we had to return it as soon as I opened the package. The fragrance was far too strong to use - it has like a weird almost perfumey/savory scent that I can't put my finger on. We are very sensitive to smells so this was a no and we returned it immediately. May be ok for outdoor use but we needed it in the laundry room behind the washer and the smell was drifting into the house.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Catch Master Glue Traps - Crappy",
      "text": "These 30 Catchmaster Mouse glue traps are so crappy they DO NOT WORK!! I have them all in the area the mouse visits and the adhesive on it is so crappy it literally has the Poooo left from the mouse...ugh. Unfortunately, I cannot return as I have already placed them not worth the $$.",
      "rating": 1.0,
      "verified": true,
      "author": "you and me",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Does not do what it say",
      "text": "Easy to use. We layed out 5 pads in a row in our garage, literally saw a tiny mouse get stuck, free it self and kept on walking. WHAT!!! Next time saw a mouse just walk over one of the pads without getting stuck at all. Its good for bugs and insects but not mouse.",
      "rating": 3.0,
      "verified": true,
      "author": "MINA",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Sticky, does the job!",
      "text": "Wow these are definitely sticky. Using them to for bugs and pests that may get in the garage. I also cut a few and placed them in pots of indoor plants to catch gnats and fruit flies. Highly recommend, would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "JoM",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Didn't work for me.",
      "text": "These things were absolutely useless for me. I put at least 10 of these in my house and garage and found fresh droppings next to them 4 days in a row. Put out one Tomcat glue trap (without any bait) and caught a mouse in 10 minutes. Maybe the horrific smell scares them off (it really is awful)? The glue surface seems very sticky - perhaps they'd work better unscented? The price is right though - that's what drew me to them (which is why I upped my rating to 2 stars from one).",
      "rating": 2.0,
      "verified": true,
      "author": "OC Mom",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "Already caught 6 mice",
      "text": "These traps work! It's been less than a week since I put these traps out in my kitchen, they have already caught 6 mice. Hopefully these traps will eradicate all the mice in my house soon. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Lawrence",
      "helpful_votes": 2,
      "publication_date": 20200303
    },
    {
      "title": "Sticky Situation",
      "text": "These glue traps came in handy when Riddex Sonic Plus Repeller product failed to perform as stated on website. The only thing is I don't like the smell of them which is very noticeable or maybe I just have a keen since of smell. The mice are quite smart cause sometimes they will jump over them because they too recognize the smell. I am smarter though cause I will place 2 at a time and lay them flat; works every time.",
      "rating": 4.0,
      "verified": true,
      "author": "NY'r",
      "helpful_votes": 3,
      "publication_date": 20151013
    },
    {
      "title": "Great for fruit flies too!",
      "text": "I had originally purchased these to take care of some spiders that I had seen in our basement. They worked wonderfully for that -- I placed a few in out of the way corners and I haven't seen a spider in weeks. However, where these have really impressed me is with taking care of our fruit fly problem. Every year when we start to harvest tomatoes from our garden, our kitchen becomes infested with fruit flies. I got the idea to lay one of these traps out with a cotton ball soaked in apple cider vinegar in the center. Within 2 days, the adhesive was coated with fruit flies and my kitchen infestation was taken care of.",
      "rating": 5.0,
      "verified": true,
      "author": "SeriousKeto",
      "helpful_votes": 0,
      "publication_date": 20150925
    },
    {
      "title": "Great product",
      "text": "Adhesion is amazing. I had a small mouse and it was caught in one night after putting a few of these down. I thought for some reason it would be dead but it was just stuck lol I felt sad. In the trash it went.",
      "rating": 5.0,
      "verified": true,
      "author": "Ness",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "How much does a mouse weigh?",
      "text": "If you mouse is light weight, he or she can simply walk all over without getting stuck. See attached photos to see his foot prints. These were great for insects, but not for small mice. Luckily, I have no insects, but sadly I still have 2 small mice.",
      "rating": 2.0,
      "verified": true,
      "author": "flute player Victoria",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Cleaned us out",
      "text": "Of scorpions, fiddlebacks, and other creepy crawlies. We had no idea how infested we were, until we placed a half-dozen of these along the baseboards near our outside entrances. These work great! I'm embarrassed to mention how many scorpions were caught, but it's impressive.",
      "rating": 5.0,
      "verified": true,
      "author": "Obi-Don",
      "helpful_votes": 24,
      "publication_date": 20121113
    },
    {
      "title": "I really like that I can fold the trap into a box",
      "text": "I really like that I can fold the trap into a box. I seemed to always drop everything possible onto the flat glue traps in the past. I suggest you fold them first, then remove the paper and tuck in the top. However, it is harder to kill the mice humanely and instantaneously if they are trapped inside the box. And of course, the bulk purchase price is much better -- half the price compared to the local hardware store.",
      "rating": 4.0,
      "verified": true,
      "author": "Yukine",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "Catches mice, but having live mice is a hassel.",
      "text": "Great product, does what it says it will. However, after using these for a few years I can't recommend people choose this type of trap. You're left to deal with a live mouse, which is a pain. Simply letting the mouse perish on the pad is inhumane. Finding a way to dispatch the mouse can be a challenge. I recommend you try other types of traps if you can. These do work very well though.",
      "rating": 5.0,
      "verified": true,
      "author": "Hugger",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Works as advertised",
      "text": "We have wolf spiders here in Missouri, this is the only trap that will trap them!!️👌",
      "rating": 5.0,
      "verified": true,
      "author": "Krusty's Ranch",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "I would highly recommend this in combination with a poison if you're having ...",
      "text": "I can not begin to tell you the amount of crawly things this trap has caught. I've laid a few out in the kitchen, den, and below the couches. It's only been about a week and I've already caught a number of spiders, roaches, and ants. I would highly recommend this in combination with a poison if you're having a infestation problem. I live in Florida where the Summers are just full of bugs trying to get into homes, and this is perfect for me to keep them at bay without having to hire a pest control service. Thank you for a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "MermaidKeyla87",
      "helpful_votes": 0,
      "publication_date": 20160628
    },
    {
      "title": "Super Sticky.. they work!",
      "text": "Not at all humane, but I am very tired of having the mice run my house! Every trap I have put down has caught at least one within a day. I like that they are a box and I don't have to see the mouse inside. I put one on my kitchen counter and it caught some of those big flying roaches. MUCH less costly than Roach Motels!",
      "rating": 5.0,
      "verified": true,
      "author": "Claire",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "couldnt get past the smell !",
      "text": "the smell to me is a real sinus irritant. put them all around the basement and the smell built up and made me feel sick upstairs. peanut butter smell is very strong and irritatingly artificial and burned my sinuses making me feel sick and annoyed that i had to gather them all up and throw them out. i think the mice ran the other way too. i couldnt catch any and the usual catch is 5 or more per week with non smelling version.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff S",
      "helpful_votes": 2,
      "publication_date": 20160904
    },
    {
      "title": "Loved them from the beginning",
      "text": "Loved them from the beginning, but they were too big and the bugs all got stuck on the edge and the middle was unused. Duh Me here!! Couldn't figure out how to cut without sticky on scissors!! CUT THEM BEFORE REMOVING THE PROTECTIVE FILM - THEN ATTACH A PIECE OF THE PROTECTION SHEET TO EACH END OF YOUR STRIPS THAT DON'T HAVE A PLACE TO HOLD. Great for near baseboards and in areas where pets and children can't \"STICK\". I love them this way. I fold them in half toward the center to throw away in garbage without sticking. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "shirleyone",
      "helpful_votes": 0,
      "publication_date": 20160324
    },
    {
      "title": "These suckers work!!️👏🏾",
      "text": "Alright ! I feel like I got away with something by buying these for this price and it actually be so damn good ! Mannnnnnn when I tell you that these traps caught these suckers onto the trap 😩 WATCH OUT WHERE YOU PUT THEM!!!!! I GOT STUCK TO THEM ABOUT 3 times lmfaoooooo ! All and all worth every dollar spent if not more 👏🏾",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea B.",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Good product at a reasonable price",
      "text": "We've had a bug problem recently and tried to find non toxic solutions for that problem. While some companies offer services in this area, it seems they want your first born child as payment (I mean extremely expensive). So far these sticky traps seem to be doing the trick and we don't see quite so many. I would've given it 5 stars, but I've seen bugs pull off the trap and walk away a few times. It's rare, but does happen.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe B",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Economical glue trap that really works.",
      "text": "This catch-master glue board works great, and is inexpensive compared to others found in Home Depot, etc. I have caught a variety of insects: flys, beetles, scorpions, spiders, etc. The traps due have a fairly strong peanut scent, which may attract mice. I do not have a rodent problem, so can not attest to the mouse efficacy. The trap is blind so use caution. It caught a friendly alligator lizard looking to score a free meal, but got stuck. After 20 minutes and copious amounts of soap water, I was able to free him.",
      "rating": 5.0,
      "verified": true,
      "author": "John  from NorCAL",
      "helpful_votes": 0,
      "publication_date": 20161130
    },
    {
      "title": "Great product great price!",
      "text": "Great price definitely purchase again. High-quality. Fast shipping. It’s amazing all the different bugs you can catch with this! I have caught stinkbugs in the attic, crickets in the basement, and ground wasps outside! And by the way it is extremely sticky be careful when you are taking off the paper for you will catch yourself! I know this from experience LOL oh and it works great for mice too!",
      "rating": 5.0,
      "verified": true,
      "author": "Monica ann",
      "helpful_votes": 0,
      "publication_date": 20171013
    },
    {
      "title": "Catched one or two mouse everyday",
      "text": "Highly effective in capturing mice and insects. No bait needed. Roaches get caught, so do lizards. Left them flat for the most part, but also made the box, The box was the easiest for disposal.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Yuen",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Good trapping device for the spawns of satan",
      "text": "I HATE SPIDERS! This works just as advertised. Gotta catch em all. I do recommend having someone come out to spray for spiders on the outside and inside of your home first then spreading these around inside in your problem areas. But yes they are very sticky and work great.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Good against insects only",
      "text": "Have used it for about 6 months. I placed them in places where I know mice are going. I have covered for the whole width of the path but it was not able to catch a single adult mice. The only thing it caught was once a very tiny baby mouse - that it. Though, if you have a lot of spiders or any other insects it works for that only.",
      "rating": 2.0,
      "verified": true,
      "author": "Guess Who",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "Mice won't walk on these!",
      "text": "Had a mouse problem in my basement and I didn't want to put bait out because we have dogs. I put these out and haven't caught anything! They smell like peanut butter and are definitely sticky, but none of the mice seem to go onto them. I've put peanut butter in the center hoping to lure them, but still nothing. I put regular mouse traps out and success! I finally got rid of the rodent problem, but these sticky traps don't seem to work for me.",
      "rating": 2.0,
      "verified": true,
      "author": "David C. Renar",
      "helpful_votes": 0,
      "publication_date": 20160407
    },
    {
      "title": "Catches the good guys. Not good.",
      "text": "We watched a cockroach walk up to it, turn around, and walk away. It did catch two lizards. We felt so guilty we removed all of them. We got it to catch scorpions. No luck.",
      "rating": 1.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "a whole lotta nothing",
      "text": "These DO NOT work!! I thought I would try it for spiders, but they can’t even catch a fruit fly. I’ve left them out for about two weeks and they managed to trap NOTHING! Again I repeat, NOTHING!!",
      "rating": 1.0,
      "verified": true,
      "author": "🌙Katrina🌙",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Great traps at a good price",
      "text": "These have a great price compared to the ones at the big box stores. They work great on lizards, mice, crickets, beetles, etc. I place them around the garage and basement",
      "rating": 5.0,
      "verified": true,
      "author": "BRT 1",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Save your money",
      "text": "Not only did these NOT catch field mice in my house, they got glue all over my floors after the mice ran right over them and now I have impossible to remove mouse foot prints all over my house. Save your money and purchase \"snap-e mouse trap\" instead.",
      "rating": 1.0,
      "verified": true,
      "author": "Lia Doak",
      "helpful_votes": 4,
      "publication_date": 20160430
    },
    {
      "title": "perfect rodent catcher",
      "text": "This works as advertised, got rid of the pesky rodents using my garage as a thru way to the back yard, caught some little critters eating my wife's bird food. Love this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Works to get critters",
      "text": "My basement is partially underground and critters tend to like to occupy my space. These work very well to give them a home they can stick with. Then went they stay too long, I move them outdoors to the closest landfill. This product is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "I AM MORE THAN PLEASED WITH THIS PRODUCT",
      "text": "This is my third time purchasing this product, and that is because they work. We live in the country, and have plenty of various types of creatures passing through. I bought them for the mice, but they catch anything that touches the surface. We have coughe 2 medium sized snakes since I bought this batch. Some people say that they don't work, but I don't use them the recommended way. I just lay them out flat in the places that they are seen frequenting. I don't make them into a box shape. If you use the tabs, you can string a whole line of defense. I don",
      "rating": 5.0,
      "verified": true,
      "author": "Girmawit  Bush",
      "helpful_votes": 2,
      "publication_date": 20151106
    },
    {
      "title": "Cricket catcher",
      "text": "These worked really well for me. I had a minor crickets-in-the-kitchen problem and deployed these to combat it. The crickets, to their peril, seemed to be quite attracted to these. Soon, they stopped showing up and I could only hear them outside again. The peanut butter scent is kind of pleasant to me as well. Much better than that awful chemical smell we've all had to suffer through whenever we use a can of bug spray (which I was reluctant to use in the kitchen anyway).",
      "rating": 5.0,
      "verified": true,
      "author": "Eeyore",
      "helpful_votes": 0,
      "publication_date": 20160211
    },
    {
      "title": "Put these close to light andwatch them work",
      "text": "These things are the closest to a lifesaver you'll get when dealing with bugs. Any bugs. I've caught an unfortunate amount of spiders, more gnats than I thought I had, beetles, flies, moths I didn't know got in the house. Put these close to light and watch them work. It's seriously amazing. And they do so well. One fly leg trapped is demise for that sucker. I'm about to buy more because I finally ran out.",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy F",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "Wow..they really work great!",
      "text": "I like ease of use. Found out I had brown recluse in house...did not know that!! Called exterminator and able to identify type of spider which is important. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "P T Hampton",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "product performance",
      "text": "The best thing I ever bought when it comes to controlling those creepy crawly critters in the summer. Put it in a safe place where no pet can get at it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorna Mikkelson",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Best price I've found for sticky traps",
      "text": "Heavy paper, sturdy, thick glue, good price. Of course you have to fold the flat sheets into the open-ended box shape. Has a pronounced musty smell -- similar to peanut butter. Don't put too many fresh traps in one room unless you want it smelling like musty peanut butter. The odor does dissipate after awhile (a week?). I've caught a lot of bugs in the kitchen/pantry area with these.",
      "rating": 4.0,
      "verified": true,
      "author": "BF",
      "helpful_votes": 2,
      "publication_date": 20151106
    },
    {
      "title": "Mouse got away.",
      "text": "The little mouse got away, leaving a pile of mouse hair and dropping, !! We never had a mouse got away with other sticky pads. It didn’t work. I put my finger on it to test, not sticky at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Work great!  Do what they say!",
      "text": "Good quality, very sticky! I’m not sure what it is about the glue traps that is so gratifying when you see the results, but it is! 👊🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Christina Tendler",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Previously purchased this item and it worked great. However",
      "text": "Previously purchased this item and it worked great. However, the new sheets that I ordered for the second time were different than the first time I ordered. These new ones are very difficult to peel the top part off and are not as strong as the previous ones. They also look different than the previous onesVery disappointed. The first time I ordered this item it was wonderful.",
      "rating": 1.0,
      "verified": true,
      "author": "Vanessa",
      "helpful_votes": 0,
      "publication_date": 20171003
    },
    {
      "title": "It caught this. Enough said.",
      "text": "We live in a heavily wooded area with a lot of black snakes. Under normal circumstances, we don't bother them and they don't bother us. Unfortunately, we have had a few instances where they've come too close to our house. This sticky pad caught this guy with no effort.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Markert",
      "helpful_votes": 3,
      "publication_date": 20170819
    },
    {
      "title": "Great for catching the basement creepy crawlies",
      "text": "I've got a bunch of these set up in my basement to catch spider and other creepy crawlies and they do the job. These one, compared to a different brand I purchased recently- seem to have both a stronger adhesive and a stronger odor to them, which I don't find especially pleasant, hence the 4 stars instead of 5. However, I'll take the smell over spiders any day!!",
      "rating": 4.0,
      "verified": true,
      "author": "Siggygal",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "Large sticky area",
      "text": "I liked that these had a large sticky surface area. I found they were very effective just keeping them flat impressed against the baseboard. Extremely effective.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Once good now crap",
      "text": "I have ordered these Twice first time they work great the second time they seem to be a thinner layer of sticky on each trap and mice able to run right over the top of it without being caught. Looks like in an effort to save money and increase profits they are putting less sticky substance on each trap.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason T",
      "helpful_votes": 2,
      "publication_date": 20170511
    },
    {
      "title": "Work well -- but never used for mice -- just other creepy-crawlies",
      "text": "These work well but I have never used them for mice. I just wanted to know what insects/spiders are creeping around my house unbeknownst to me. I placed them under the sofa, behind fridge, bookcases, etc.. Be very sure you want to know what is creeping around your house before placing them about. (shudder) You may want to use tongs to retrieve them. lol",
      "rating": 5.0,
      "verified": true,
      "author": "KDSTTop Contributor: Calligraphy",
      "helpful_votes": 0,
      "publication_date": 20170208
    },
    {
      "title": "I have had these traps for a couple of weeks ...",
      "text": "I have had these traps for a couple of weeks now and have yet to catch anything. The ants and spiders simply climb over the top or around the boxes. They do not seem to do anything but collect dust and spiderwebs. I am not a big fan of chemical sprays, but I am even less a fan of bugs. These are going in the trash and the ant spray is coming back out.",
      "rating": 2.0,
      "verified": true,
      "author": "BaileyFamily704",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "LOVE!",
      "text": "Very easy to assemble and very good at catching little critters you have in your house! the smell brings them in and you don’t have to put a piece of food to draw them in! absolutely loved",
      "rating": 5.0,
      "verified": true,
      "author": "kimberly jennings",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Unbelievably worthless.",
      "text": "I don't normally write reviews but I put about 15 of these in my tack room to catch some mice. My son actually saw three mice run over them without getting caught! I got some of the black glue traps with no scent and the next morning all three were one trap. These \"traps\" had mouse droppings ON them with no mouse! Seriously the biggest waste of money I have found on Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170214
    },
    {
      "title": "NOT STICKY ENOUGH - seriously don’t buy",
      "text": "DO NOT BUY THESE. Seriously, don’t buy these. I read the reviews and didn’t heed some of the warnings, and wish I would have. They aren’t sticky enough. Mice can cruise right thru them. Our mice popped into them and took the tiny smear of peanut butter that we added, pooped inside the trap and then exited after moving the trap around. I thought this might be possible when I did the tiny peanut butter smear and the sticky part hardly adhered to the plastic knife I used for the smear.",
      "rating": 1.0,
      "verified": true,
      "author": "Sasha",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "These work great!",
      "text": "I didn't realize how many spiders I had wandering around in my home before I got these. They really work well! Very happy with this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Pyle",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "I have been extremely disappointed with his product",
      "text": "I have been extremely disappointed with his product. Last weekend I saw three different mice scurry away from me, only to swerve to avoid the glue traps set in their path. I have had great success with the exact same type of glue traps previously. I can only assume that it is the \"peanut butter smell\" that repels the mice that I am trying to capture and get rid of. I have tried multiple traps all over..... Not a single catch with these......",
      "rating": 1.0,
      "verified": true,
      "author": "KEAGAN",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Bait and wait, you will be impressed",
      "text": "These traps are amazing, and man they send you tons! you can set these up, place a food crumb in the middle and let the carnage begin. yea they smell like peanut better for a day, but it soon fades off, so go ahead and bait it anyways. When open the door in the evening and a couple of fliers make it inside, instead of swatting at them, grab one of these and swat the trap at em, or hold the trap near the light they are trying to assimilate with, you will catch em quick~",
      "rating": 5.0,
      "verified": true,
      "author": "Squid Vicious",
      "helpful_votes": 0,
      "publication_date": 20180620
    }
  ],
  "product_meta": {
    "title": "30 Catchmaster Mouse / Spider / Insect / Scorpion Glue Board Sticky Traps ~ Peanut Butter Scent",
    "rating": 4.4,
    "feature_bullets": [
      "30 mouse glue boards",
      "traps insects",
      "traps mice"
    ],
    "specifications": {
      "Package Dimensions": "8.4 x 5.3 x 2.2 inches",
      "Item Weight": "1.61 pounds",
      "Manufacturer": "Catchmaster",
      "ASIN": "B002Y6GAN4",
      "Item model number": "Catchmaster 72MB",
      "Customer Reviews": "4.4 out of 5 stars1,286 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#1,820 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Traps",
      "Pest Control",
      "Garden & Outdoor"
    ],
    "price": 15.7
  }
}