{
  "website_summaries": [
    {
      "verdict": "This lacquer-style clear coat is good for small jobs. It's thinner than other brands, though, and you'll need your own sprayer.",
      "pros": [
        "Lacquer is ready to spray",
        "No mixing required",
        "Easy to apply with no re-coat window",
        "Dries quickly for multiple coats",
        "Sprays very easily",
        "Good for small jobs"
      ],
      "cons": [
        "Clear coat is thin compared to other brands",
        "You will need to use your own sprayer"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Solid paint",
      "text": "Paint went on pretty good and was easy to work with. I was frustrated that I couldn’t find a picture of the midnight blue so I uploaded a picture of mine. I would use again and recommend. I used 5 quarts of paint and 3 quarts of clear coat. 4 quarts of paint would do it if you don’t have a lot to cover up.",
      "rating": 5.0,
      "verified": true,
      "author": "AH",
      "helpful_votes": 73,
      "publication_date": 20180811
    },
    {
      "title": "Pros + cons ... Great color",
      "text": "It is a lot thinner than any other car paint I've used. The good thing is you don't need to add lacquer thinner so you can spray it straight out of the can. The downside for me was I was unable to use it as a marble effect via hydro dip; it was just too thin. I ended up just using this as the base coat, and the color turned out great. The consistency is like thin chocolate milk.",
      "rating": 5.0,
      "verified": true,
      "author": "Tombox",
      "helpful_votes": 11,
      "publication_date": 20180727
    },
    {
      "title": "Great for Patina",
      "text": "Have a 1942 1.5 ton truck with original paint with lots of Patina that I wanted to seal and keep this way. This product went on really nice with a HVLP gun. Its very thin lacquer so multiple coats were needed but it went on perfectly. Dyes quickly and really made the patina stand out much more than it was. The orange from the rust really popped out which I wanted and the door logo colors jumped out perfectly. Great product. Very Pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregg E",
      "helpful_votes": 12,
      "publication_date": 20180601
    },
    {
      "title": "True yellow",
      "text": "Finally was able to get this awesome yellow from Amazon instead of somewhere else..it's beautiful and I get so many compliments on it. It goes on smoothly with my paint sprayer ,looks completely professional. It's also looks super paired with the Metallic Midnight Blue on my boat. This is the only brand I trust.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindi Rarick",
      "helpful_votes": 7,
      "publication_date": 20180512
    },
    {
      "title": "The better you prep the surface the better the results",
      "text": "I painted the cab, hood,doors and fenders of an old dodge pickup truck used 2 quarts of primer and 2quarts paint.If I knew it was going to turn out so well I would of prep it better.Fast and easy beats buying all those cans of spray paint.",
      "rating": 5.0,
      "verified": true,
      "author": "Trish O'Halloran",
      "helpful_votes": 6,
      "publication_date": 20180521
    },
    {
      "title": "brilliant silver along with gloss and matte clear coat",
      "text": "This will be my approx. my eighth purchase of this product. I've shot performance red, championship white, mineral grey, jet black, brilliant silver along with gloss and matte clear coat. I cant find any faults with the product other than limited color availability The paint isn't thin it's exactly the correct viscosity it should be. If you use 7 quarts to paint a small car you need to buy an hvlp gun. I shot all these with a Sico mp500 hvlp at 20 lbs and the results are great. If you don't have to match a factory color I highly recommend these paints for ease of use.",
      "rating": 5.0,
      "verified": true,
      "author": "brodie",
      "helpful_votes": 16,
      "publication_date": 20150424
    },
    {
      "title": "Championship White good for Crown Vic police cars",
      "text": "I got the \"Championship White\" color for a 2010 Ford Crown Victoria P7B with \"performance aka peelformance white\" paint. The Championship White is close enough that you can't really tell that it's not the \"factory\" color. One 32oz can was enough to put 2 good coats each on the roof and trunk. I then put clear over the top of it. It came out looking really nice. We will see how long it lasts. Video will be up on WJ Handy Dad Youtube channel if you want to watch a DIY amateur plug the holes left from the police department and paint their car.",
      "rating": 5.0,
      "verified": true,
      "author": "WJ Handy Dad",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Good for an amateur",
      "text": "I don't spray much auto paint. This is the first auto paint I've used in 30 years, which is why I went back to lacquer instead of one of the modern paints. It's nice that they send the paint pre-thinned, but if I was an actual knowledgeable person about such things, I'd probably laugh and call it a rip-off. The paint was as expected and came out very nice. You can see from the picture the results. Not the car, the hardtop, which I had just finished building. This is a no-polish, just sprayed look. Pretty smooth considering I have no idea what I am doing.",
      "rating": 4.0,
      "verified": true,
      "author": "EastMemphis",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Great product. Excessive damage.",
      "text": "Product is awesome but when you buy $450 worth of product and amazon throws 10 cans in a box with only 2 of them being wrapped and the rest dented and two of them leaking. Kinda make you angry that you decided to get a good deal instead of ordering it from a store for $10 more a can. Won’t be ordering anything of this sort from amazon again. Pictures are as pull from box how they shipped it.",
      "rating": 3.0,
      "verified": true,
      "author": "Nathan & Sam",
      "helpful_votes": 3,
      "publication_date": 20190712
    },
    {
      "title": "Just pour in and spray! W/a little prep of course.",
      "text": "Always loved the way Dupli-color laid on and it's rich color and the spray tip on the can so unique I save them for those other cheap cans when I have to use them to save in tight budget days which is another story of my life and too sad to mention so back to the paint it sprays out of my Binks HVLP gun so good right out of the can I can only say it's even better than their best in the business spray cans and I could hardly believe that I could paint that good on my first try with a spray gun on my first vehicle. Look out I might paint it.",
      "rating": 5.0,
      "verified": true,
      "author": "Redford G.",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "The matallic was perfect",
      "text": "By far the best priced paint for the results can’t complain but it needs a clear coat to get a glossy look you can use the rustolum lacquer clear and it worked perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 6,
      "publication_date": 20180729
    },
    {
      "title": "Wow looking sweet",
      "text": "Sprayed using $9.99 hvlp purple gun I call her the Purple People eater lol from Harbor Freight. First time ever spraying a gun in my life. Went with 2 coats primer then 2 coats silver metallic then 2 coats of the blue followed by what's in pics is only 1st coat of clear. Will be laying 2 possibly 3 more down on it. I know its not a car but its parts for Akai MPC'S that I'm customizing. So far I'm thrilled with results the paint is superb. Oh the red is Candy Ruby Red I also ordered off Amazon",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Moore",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Skip this",
      "text": "Don't waste your money on this. Can arrived dented and with a little bit of moisture around the lid. Looked good for a bit until I realized this isn't a \"real\" clear coat. It doesnt cure right and will have a soft texture a month after curing.",
      "rating": 1.0,
      "verified": true,
      "author": "Santiago Cazares",
      "helpful_votes": 2,
      "publication_date": 20190729
    },
    {
      "title": "What can I say, it’s so so...",
      "text": "Mixed reviews on this one. It’s great for a beginner because you can spray right out of the can but the clear doesn’t seem as good as a two part system.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael Mann",
      "helpful_votes": 2,
      "publication_date": 20190320
    },
    {
      "title": "Does Exactly What It Should (Just Thin It!)",
      "text": "Just as a warning when you go to use this stuff, make sure you do not spray it right on the panel. You must thin this paint. I never got an exact value, but I think I remember the best results coming from a 4:1 (1/5) mixture. In any case when you shoot with a lacquer make sure you’re using a 1.8mm or 1.7mm gun. The thinner the paint the smaller you’ll get away with but the less protection you’ll have. Thin using a little bit of paint thinner, but if all you have is a stronger solvent go ahead and toss it in the mixture, just be sure not store that newly mixed paint in plastic. Good luck.",
      "rating": 5.0,
      "verified": true,
      "author": "KMACK",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Great product, great price!",
      "text": "This can is half the price of the spraypaint version and much more effective. Using an electric sprayer, I applied it to my hood and it went on clean and smooth, plus a little went a long way. The color (which was an exact match) stayed uniform through multiple consecutive coats, which dried quickly and were easy to sand and polish. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Eerie.Brilliance",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "NO TOUCH UP FOR FUTURE",
      "text": "This product was amazing, it truly was. The color is exactly what I was looking for. However the part I didnt know about was they only sell this color in the quart size. So, for example something on the highway came up and hit and scratched the car. I have to go buy an entire quart of paint instead of a spray can or a touch up pen like they have of other peoples paint colors. Get it together! Why cant you make touch up paint of YOUR OWN PAINT?!?!?!",
      "rating": 1.0,
      "verified": true,
      "author": "Ramon Torres",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Arrived Damaged/Box was perfect",
      "text": "This arrived damaged with a leak. Nothing was wrong with the box so I have to believe it was shipped out this way. I tried to return it but was refused so I will get a different can and eat the cost. I have to much time in prep to risk that the product is ok. Very disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Not impressed.",
      "text": "The silver metallic is not great quality. I have used in on several project and it’s fine to use on table legs etc. Doing some bike frames and having used urethane car paint you can’t compare. I suggest a 2k clear coat instead of using duplicate color. Finally if you do a tank or helmet I think you should spend the extra money and go to a car paint shop.",
      "rating": 3.0,
      "verified": true,
      "author": "Per Kristiansson",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "pretty good for pre mix",
      "text": "Here's the colors I've used: emerald green, red, molten red, yellow, orange, and blue. Pretty vibrant colors emerald green was a little darker than what I would like. White i have also, nothing fancy just white. Caution for midnight blue (not pictured) it is more turquoise than blue. It takes a LOT of coats for it to get dark enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Worked great for my track bike, but use better paint for anything else.",
      "text": "In comparison to other paints. You're better off going with a higher quality paint. Especially if you're new and spraying through extremely cheap gear. (HF/Menards, etc) This stuff flows out in a weird way. Same with the clear. But overall, if your prep is good and your surface is smooth, with decent set up and technique you can get a passable result. Worked fine for my track bike, which only has to look good from 50ft at 50mph, but wouldnt want it anywhere near any of my other bikes.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrew Lanning",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Great paint for the price",
      "text": "Good paint. A little more orange than I thought. But still a steal for the price. Not ideal for a newer car, but for someone looking to make a beater look shnazzy, this is the stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Nielson",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Great color and goes on good with a little reducer",
      "text": "Great color and goes on good with a little reducer.Great results with dupli color products..just gotta know how to use them.",
      "rating": 5.0,
      "verified": true,
      "author": "G",
      "helpful_votes": 3,
      "publication_date": 20161128
    },
    {
      "title": "its paint !!",
      "text": "wasn't bad, it went on smooth. I used it for motorcycle smaller parts like battery box. I wouldn't use it on tank or anything to crazy but a good paint just to spray not so show kinda parts. price is great.",
      "rating": 4.0,
      "verified": true,
      "author": "JP Custom Switch Controls",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Its not Jet Black",
      "text": "Laid on three coats of Jet Black and three coats of clear. Went on fine but when it got in the sun it wasn't anything close to black but a dirty dark dark brown. How could such a big auto paint name let something like this get on the market.",
      "rating": 1.0,
      "verified": true,
      "author": "Denny",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Not bad! But not great!",
      "text": "I painted my Firebird with this stuff. I required roughly 8 cans to get the job done (including wheel flares and spoiler). It's very thin and you'll need to do several coats to make it look good. For the price, I'd recommend the this product. If you're looking for a show car finish, not so much. There are higher quality products that come along with a higher price tag!",
      "rating": 4.0,
      "verified": true,
      "author": "Chris M",
      "helpful_votes": 2,
      "publication_date": 20150713
    },
    {
      "title": "cheap paint",
      "text": "cheap paint but don't let that stop you from buying great to learn how to paint candy colors my 2 sons enjoyed painting their guitars with it you need a base color and a clear coat to go with it",
      "rating": 3.0,
      "verified": true,
      "author": "deadbob",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Nicely Sealed",
      "text": "The sealing was great on this product. I could have gotten a better local price and actually did for the remaining clear coat can's I purchased but this worked great and arrived in good condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Sco-Pi",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Horrible",
      "text": "Absolute waste of money. The primer right out of the can was separated no matter how much I shook or stirred it, it wood not mix. Was chucky and kept clogging gun. Maybe to old or expired. As I sprayed it on new metal ruffed up. It just dripped and ran away. Total waste of time and money. DO NOT BUY.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Great paint but learn how to ship it",
      "text": "This is awesome paint to use for someone that does not have a lot of experience painting. Goes on good with a beautiful finish. But they need to learn how to box it up when it’s shipped. All 6 of 6 cans are dented or smashed in!",
      "rating": 5.0,
      "verified": true,
      "author": "BY",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "NOT THE COLOR ON THE CAN",
      "text": "tHIS IS A DINGY DARKER GREEN COLOR; NO WHERE NEAR THE BRIGHT SAFETY GREEN IT LOOKS LIKE ON THE CAN. STUCK WITH 2 CANS; NO RETURNS. WHAT A WASTE OF MONEY AND TIME.",
      "rating": 2.0,
      "verified": true,
      "author": "stephen",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Very super white",
      "text": "I painted my wheels with this championship white! Turned out amazing! Get a lot of compliments",
      "rating": 5.0,
      "verified": true,
      "author": "D-block",
      "helpful_votes": 3,
      "publication_date": 20180320
    },
    {
      "title": "Take your time  do it right or don't do it at all",
      "text": "All these dupli-colors go on great. You need to know your timing between coats. All depends on temp and thickness of paint you lay on. If you stick to the right way of laying it down you will have a great finish .",
      "rating": 5.0,
      "verified": true,
      "author": "TIMOTHY W.",
      "helpful_votes": 3,
      "publication_date": 20170616
    },
    {
      "title": "not chemical resistant",
      "text": "applies nice and easy to polish. a lo ready thinned out so easy to prep. HOWEVER THIS IS NOT CHEMICAL RESISTANT. GAS WILL MAKE IT PEEL.",
      "rating": 3.0,
      "verified": true,
      "author": "Todd Udell",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Beautiful color but not for everyone.",
      "text": "Look up a video of how to use a paint gun. It will help you so much. Go slow and in my case learn how to wet sand properly. (picture is with clear coat unfinished)",
      "rating": 5.0,
      "verified": true,
      "author": "Jake Weber",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Horrible primer",
      "text": "Product sprays horrible. Both cans I ordered came with large clumps in the bottom of the can. Not sure if the paint was just really old or it’s just garbage paint but I will definitely never buy again",
      "rating": 1.0,
      "verified": true,
      "author": "paul",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "The Jet Black Paint is GRAY!!!",
      "text": "The Jet Black Paint and Clear looked OK before drying, but after a day of drying it is gray. What a waste of time and effort!!! And now Amazon won't even give me a credit??!! You get what you pay for; thought I could save a few bucks, but it will now end up costing me $100s.",
      "rating": 1.0,
      "verified": true,
      "author": "B Stine",
      "helpful_votes": 2,
      "publication_date": 20190327
    },
    {
      "title": "Good for beginners",
      "text": "If you are trying to make your old car looks better and want to paint it for less then $100 bucks... how ahead. I did it in less then 2 hours + preparation. I think the results depends of your experience (I don't have it, so the job looks just ok)",
      "rating": 5.0,
      "verified": true,
      "author": "Jaime d.",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "I would buy it again.",
      "text": "Great product really. I have dipped a few aftermarket Mercedes emblems in this to keep the paint nice, and it seems to be doing the job quite well",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon S",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "dupli-color does a very poor job explaining how to get the correct look they ...",
      "text": "dupli-color does a very poor job explaining how to get the correct look they advertise on there chrome yellow paint.In fact all of there paint shop line of paints i believe are falsely advertised.",
      "rating": 2.0,
      "verified": true,
      "author": "Dusty Roads",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Good lacquer paint.",
      "text": "Great paint. Please wrap it more for shipping. This can almost opened during shipping. Huge problem.",
      "rating": 4.0,
      "verified": true,
      "author": "J D L",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Clear is Better",
      "text": "Came well sealed with clips and double wrapped. Looking forward to using this on all my painting projects.",
      "rating": 5.0,
      "verified": true,
      "author": "V Utx",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Good but awful packaging",
      "text": "Would be nice if they came wrapped up like the clear coat did one can of paint leaked all over the box and my steps but other then that good product just need to pay attention to the packaging",
      "rating": 3.0,
      "verified": true,
      "author": "ted contois",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Green and gorgeous",
      "text": "Already mixed and ready to spray, I'm not a professional but I still had professional results.",
      "rating": 4.0,
      "verified": true,
      "author": "Donald Hodge",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Nice color",
      "text": "Don't hate me I don't use airbrush,to Use this is thin paint good for that.i liked it was easy to throw on canvas.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "A-OKAY!",
      "text": "I am quite pleased with this item! I would gladly recommend this seller & product to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Parlous1",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Safety to paint.",
      "text": "It was just what I wanted the jet black . I used it on the truck bumper. Thank you for my merchandise!🤠👍🏿🙏🏿",
      "rating": 5.0,
      "verified": true,
      "author": "Jay Dexter",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "shoots nice",
      "text": "came as advertised needs to come down on price a little but pretty happy with it",
      "rating": 4.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "No real shine",
      "text": "Must use a couple of clear coats afterwards. Average price everywhere",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Tammi Ramirez",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Pretty thin, but easy to spray.",
      "text": "I was used to single-stage paint and this is VERY thin: careful when you pour it out of the can because it will splash very easily. The coverage is all right, I’m not a pro, but I liked the result. I used an activated two-part clear coat and the finish looks pretty consistent. Will use again",
      "rating": 5.0,
      "verified": true,
      "author": "Designer & User",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Great product!",
      "text": "This paint is practically amazing. Easy to use, looks great, and shines even before the clear coat. For being an inexperienced painter, and not wanting to mess with the whole mixing process, this is perfect and looks professional. My 300zx is looking awesome",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Cargile",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Good cheap paint",
      "text": "Good paint, not really ready to spray...needs thinner. Good for base coat",
      "rating": 5.0,
      "verified": true,
      "author": "Mason",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Dupli-Color BSB303 Candy Apple Red Paint",
      "text": "It wasn't the Candy Apple Red I wanted. Was disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "Linda Yoshizawa",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Lighter shade of red",
      "text": "Awesome color but not for my truck. I want a deep red close to a burgundy this is a lite red close to Burt orange.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie Evans",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "sprayed nice",
      "text": "it probably would have been better if I had a better gun than a leaky harbor freight gun",
      "rating": 4.0,
      "verified": true,
      "author": "todd johnston",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Come on delivery people",
      "text": "Ok stuff to sell a car quick, all was good but the delivery was horrible, cans where bent and some clear cane out, good thing these were just extra",
      "rating": 3.0,
      "verified": true,
      "author": "Isaac",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Easy to use reasonable priced and nice color.",
      "text": "This paint system was easy to use and cost me a quarter of a paint supply chain price. This is my 1st paint job I needed something reasonable priced and easy to use. I used it to practice my paint technique. I really like the results. I think the color is really nice. Planning to paint my project car this color.",
      "rating": 4.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Easy to use",
      "text": "I’ve never painted before, went to Harbin freight bought a cheap 10.00 sprayer and I used the primer, metallic blue, and clear. It took a minute for me to get the hang of the sprayer but I liked how it came out. Easy to use and I’ll buy more.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 2,
      "publication_date": 20180925
    },
    {
      "title": "Looks good too.",
      "text": "can't get any easier to apply than this. Looks good too.",
      "rating": 5.0,
      "verified": true,
      "author": "John Clark",
      "helpful_votes": 2,
      "publication_date": 20170914
    },
    {
      "title": "car",
      "text": "Buy it and get my car. Not bad. Not broken",
      "rating": 5.0,
      "verified": true,
      "author": "dan dan zhang",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Primer",
      "text": "I guess that I didn't read all of the listing, that is quite a bit of money to pay for something that is already mixed and ready to go, I wanted to buy primer......I will mix it myself",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Bell",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Product quality",
      "text": "Not glossy. Even after wet sanding and rubbing compound. I've been doing paint work for over 50 years. Never had this problem .",
      "rating": 2.0,
      "verified": true,
      "author": "attilio presciutti",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "DONT BUY UNLESS YOU PLAN ON BUYING ALOT OF CANS TO PAINT ONE BUMPER",
      "text": "I have been painting cars for years. I hear about duplicator an tried it out on a couple of parts I needed to paint. The primer is just horrible it does not come out the gun well it sprays in little dots an not like most paints out their! The only great thing about it is that it dries quick",
      "rating": 1.0,
      "verified": true,
      "author": "Michael H.",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Used as clear over custom graffiti on my adventure trailer",
      "text": "Went on well, seems to like a little higher pressure than normal. Atomizes well. Shot using a HF paint gun, and a basic dryer/filter.",
      "rating": 5.0,
      "verified": true,
      "author": "MaksV",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Exactly what I was looking for.",
      "text": "Used it on a guitar refinish .... gave it three low pressure coats...PERFECT results. Came out exactly the way I wanted and imagined.",
      "rating": 5.0,
      "verified": true,
      "author": "Magoo",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Not show car paint but good for you daily or budget build.",
      "text": "I like this color. Paint looks to be good low priced alternative.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert S.",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Quality product for professionals",
      "text": "Not for beginners. Do not thin the product. Looks great on the car.",
      "rating": 2.0,
      "verified": true,
      "author": "D T S",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Proper prep and proper set up and you will be fine",
      "text": "Had no issues spraying this paint. Set your gun up correctly and don’t stand so close while spraying. Also make sure you do proper prep before hand",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler S.",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Managed to find this gem after the auto parts stores ...",
      "text": "Managed to find this gem after the auto parts stores stopped selling it. This paint seems to be newer than the the stuff the auto parts stores sell.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 2,
      "publication_date": 20171011
    },
    {
      "title": "Takes 6+ quarts to cover vehichle",
      "text": "I thought the color was off when I opened the can. The color appears green but the next day it looks like the Midnight Blue color. Product is VERY thin. I will be buying paint mixed at local parts store due to MUCH LOWER costs to cover vehicle.",
      "rating": 3.0,
      "verified": true,
      "author": "Soyews",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "The paint comes clumpy",
      "text": "This paint comes with clumps of what looks like cottage cheese at the bottom. Even after shaking and stirring the paint, it has a bunch of clumps at the bottom. You must use a strainer. The strainer picks up most of it, but it clogged up my paint gun numerous times anyway",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "comes pre-mixed ready to spray lacquer primer. i sprayed ...",
      "text": "comes pre-mixed ready to spray lacquer primer. i sprayed at 90 degrees and 90% humidity. It didnt get rocky on me. i did wet sand the slight orange peel..It could have been my 1.6mm tip doing it....",
      "rating": 5.0,
      "verified": true,
      "author": "JOHN",
      "helpful_votes": 0,
      "publication_date": 20150719
    },
    {
      "title": "U get what u pay for, next time I'm buying House of Color candy apple. Sounded to good to be true!",
      "text": "The candy color was not candy at all, as soon as I applied it to the base and metalic clear it covered everything underneath like regular red paint. Terible candy apple substitute. Did not work like tru candy! Don't waste ur money like I did.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Ok for smaller projects",
      "text": "Does not spray well leaves a grainy texture,drys quickly sprays better if thinned",
      "rating": 2.0,
      "verified": true,
      "author": "JEFF WILLIAMS",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Damaged!!!",
      "text": "I ordered one quart of the Duplicolor Blue metallic and one quart of clear coat.. Both cans were smashed to the point we're paint started to come out the sides... I should have gotten a discount but of course that's not how they work... Not happy that I payed full price for damaged goods...",
      "rating": 2.0,
      "verified": true,
      "author": "Motorcycle Dude",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Ok paint",
      "text": "Not easy to spray and it's true you must clear it if you don't the paint will come off in your hand",
      "rating": 3.0,
      "verified": true,
      "author": "adam",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "easy to have run",
      "text": "ti thin of paint. Hard to work with. Ran out twice and still didn't finish the car, easy to have run.",
      "rating": 1.0,
      "verified": true,
      "author": "Judy Melchor",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "2- 1 qt. cans come in the box. ...",
      "text": "2- 1 qt. cans come in the box. pre-mixed clear .The more coats I put on the deeper, and shinier it got. no problems if you know how to spray it. I could have wet sanded between coats for a deeper shine, but i was just spraying a Berger panel.",
      "rating": 5.0,
      "verified": true,
      "author": "JOHN",
      "helpful_votes": 0,
      "publication_date": 20150719
    },
    {
      "title": "Expensive for how much you need to use.",
      "text": "What can I say, its expensive primer, two cans was enough to cover my mustang. Expensive for how much you need to use.",
      "rating": 3.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 2,
      "publication_date": 20150630
    },
    {
      "title": "NOT FOR AUTOMOBILE USE",
      "text": "Avoid if you plan to use this clear for automobile painting. Do NOT use!",
      "rating": 1.0,
      "verified": true,
      "author": "James Miller",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Not good for big projects",
      "text": "Easy to use, takes a lot of product to cover vehicle. Ok for small projects, do not use to paint a whole vehicle",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Good Paint!",
      "text": "Good product!! Just what a needed as an alternative to rustoleum's discontinued color. Duplicolor saved the day!!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Poor quality auto paint",
      "text": "I am not a professional painter but I have painted multiple cars and done several body work projects. This was some of the hardest paint I’ve ever used. Runs like crazy (super thin) and covers way less than real auto paint. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Asa",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "seems to be good, lays down good",
      "text": "I bought this for clearing a guitar body, seems to be good, lays down good. have yet to wet sand and buff.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "works great",
      "text": "good on smooth with little or no mixing. requires a little sanding for smooth finish",
      "rating": 5.0,
      "verified": true,
      "author": "roy martin",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Was skeptical at first but this paint really pulled off ...",
      "text": "Was skeptical at first but this paint really pulled off. No need to mix with anything just load and spray. Even sprayed my headlights with some clear & they came out looking brand new",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 2,
      "publication_date": 20180316
    },
    {
      "title": "Would not Recommend or Buy Again - Cheap LAcquer",
      "text": "This is a Cheap Lacquer Clear Coat - The Finish Was Dull - Buy a Urethane Clear coat and save time and Hassle",
      "rating": 1.0,
      "verified": true,
      "author": "jason butler",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Read label need conventional gun!",
      "text": "The dont tell you that you need a conventional spray gun. Cant use your HVLP. Called customer service and they confirmed that. Spent $129 on new gun!",
      "rating": 1.0,
      "verified": true,
      "author": "ROBERT SOLOMON",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "sands easily, but as a thinner lacquer based system",
      "text": "See my other review on the Jet Black for this system. Quality paint, sands easily, but as a thinner lacquer based system, be prepared and order extra, especially if you know you're going to make mistakes. Buying in bulk is worth it as well. One star off on the price. It's a little steep for a quart of this but I'm sure more advanced systems cost far more.",
      "rating": 4.0,
      "verified": true,
      "author": "Jacob N. Smits",
      "helpful_votes": 0,
      "publication_date": 20150515
    },
    {
      "title": "Leaked in shipping",
      "text": "I ordered a single quart for a small job. They use clips to secure the lid, some of which were missing, so the paint leaked and only half a quart was left in the can. Otherwise, I think the product itself will work fine.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Stray away from buying from these guys",
      "text": "Recieved cans beat the heck out of them, looks as if they knew since they added closures to the tops to not have them open",
      "rating": 1.0,
      "verified": true,
      "author": "Tokyo_Hippie",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Not Midnight Blue",
      "text": "Order the BSP210 Midnight Blue and turned out to be emerald green not Midnight blue",
      "rating": 1.0,
      "verified": true,
      "author": "Chris Gautreaux",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "disappointed",
      "text": "instead of calling it jet black,you need to call it dark gray. Does not look like the black on my mustang.😕",
      "rating": 1.0,
      "verified": true,
      "author": "Lori Liff",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "you get what you pay for",
      "text": "im sorry but this stuff was garbage I paint cars motorcycles etc.and I was trying to save a lil money and use it for a mid coat for some candy pearl green and it messed up my paint job",
      "rating": 1.0,
      "verified": true,
      "author": "David mcgrew",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Great Paint",
      "text": "The first one I ordered came severely damaged so after contacting Amazon, they sent a replacement with no extra charge. This paint was admired by my co-workers and fortunately for my car, I only need 1 quart.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond E. Sears",
      "helpful_votes": 2,
      "publication_date": 20131028
    },
    {
      "title": "Just a dent in can",
      "text": "Can was dented up but not to bad....maybe they should have added more padding with it",
      "rating": 4.0,
      "verified": true,
      "author": "jaime kavanagh",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "... and the shine after the gloss clear application was awesome!! Yes it's old school technowledgy",
      "text": "If you know how to paint it's not a problem and the shine after the gloss clear application was awesome!! Yes it's old school technowledgy, however it worked and looks excellent. I received an award at an air-cooled event in Tucson just a couple of months after repainting!",
      "rating": 5.0,
      "verified": true,
      "author": "S. DAHL",
      "helpful_votes": 3,
      "publication_date": 20150114
    },
    {
      "title": "It's watery but it works perfect",
      "text": "This candy paint is awesome a lot of people say that the pain is not worth it but it is worth it is that a lot of people does not know how to use it but it does work amazing I recommended 100%",
      "rating": 5.0,
      "verified": true,
      "author": "Angie Perez",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Dupli-Color provides a good quality product for both the novice auto painter and ...",
      "text": "Dupli-Color provides a good quality product for both the novice auto painter and a cheap alternative for the advanced autobody mechanic as well.",
      "rating": 5.0,
      "verified": true,
      "author": "David Bruce",
      "helpful_votes": 0,
      "publication_date": 20160424
    },
    {
      "title": "Good Color",
      "text": "this paint is really good for the price. just make sure that you put some primer before adding the paint. if you don't, the paint will start peeling off once its been there for a while and the sun breaks it. also, make sure you put some kind of clear after cause when you wash your car the water spots stick to it. i used it on some car grills and rims and the color looks really good and gives it that customize look. i really liked the paint and for the price it was really good. i added thinner so a 32 oz can will last a while depending on what your painting.",
      "rating": 5.0,
      "verified": true,
      "author": "SKYWALKER",
      "helpful_votes": 8,
      "publication_date": 20131025
    }
  ],
  "product_meta": {
    "title": "Dupli-Color EBSP30000 Clear Coat Paint Shop Finish System - 32 oz., Clear Gloss",
    "description": "Color:Clear| Size:single| Style:Step 3 / Step 4 CandyDupliColor's Paint Shop Finish system allows you to create a high-quality finish when using the primer, color and clear. It's a high-quality lacquer system designed for automotive and motorcycle applications. Paint Shop is easy to apply, dries quickly and can be buffed to a brilliant smooth finish. It's a ready to spray system, so no mixing or reducing is required. With no re-coat window, additional coats can be applied at any time",
    "rating": 4.1,
    "feature_bullets": [
      "Pre-reduced, ready-to-spray lacquer",
      "No mixing or reducing required",
      "Easy to apply and dries quickly",
      "No recoat window, reapply at any time",
      "Must be clear coated",
      "Wet sands easily",
      "Ideal for automotive exterior body projects"
    ],
    "specifications": {
      "Manufacturer": "Dupli-Color",
      "Brand": "Dupli-Color",
      "Item Weight": "2.3 pounds",
      "Product Dimensions": "4.25 x 4.25 x 4.88 inches",
      "Item model number": "BSP300",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "BSP300",
      "OEM Part Number": "BSP300",
      "ASIN": "B002986OBU",
      "Customer Reviews": "4.1 out of 5 stars945 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#2,119 in Automotive",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "July 7, 2004"
    },
    "categories": [
      "Body Paint",
      "Automotive Parts & Accessories",
      "Paints & Primers",
      "Paint & Paint Supplies",
      "Automotive"
    ],
    "price": 22.99
  }
}