{
  "website_summaries": [
    {
      "verdict": "Six-inch, random orbit polisher that’s ideal for car enthusiasts.",
      "pros": [
        "Porter Cable offers a 3-year limited warranty and 1-year free service",
        "The unit has a removable, 2-position handle for extra comfort",
        "Users report it’s extremely easy to use for beginners"
      ],
      "cons": [
        "Only comes with a single polishing pad"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Game Changer for Amateur Car Guy",
      "text": "I wish I bought this thing years ago, I've been wasting my time with inferior results. As an amateur detailer, I watched a few chemical guys you tube videos, followed the instructions and I was off to the races. My 2010 Toyota with 275K miles looks brand new. It made quick work of everything, my boat, car, SUV. A word of caution is make sure you have the appropriate pads and compound. For my car with heavy swirl marks and oxidation I went claybar, med cut and then heavy cut for the tougher areas then polished and then waxed. If you're detailing your own boats and vehicles this is well worth the $.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff D",
      "helpful_votes": 38,
      "publication_date": 20180429
    },
    {
      "title": "Lite & Easy Mechine",
      "text": "I am 69 years old and for me to buff my motor home has been impossible, until I purchased the Porter-Cable 7424XP 6 inch Variable -Speed Buffer. I do not have the money to pay some one $450.00 plus to clean my motor home, so I took a chance and purchased my buffer and man I was glad I did. It is so easy and lite to use. I am now half way done polishing a 40' motor home and it looks great. I am using Chemical's from the Chemical Guys line of products as well as Meguiar's 105 & 205 compounds topping it with Meguiars Hi-Tech Wax #26. You should see it",
      "rating": 5.0,
      "verified": true,
      "author": "Lyn",
      "helpful_votes": 69,
      "publication_date": 20150707
    },
    {
      "title": "Can t be set to speed ranges only has numeracal speeds on control of 1-6",
      "text": "Description states Electronic variable-speed dial from 2,500-6,800 OPM; which is misleading due to all polishing and buffing compounds call for certain speed ranges ie 1200-1500; you can not dial this into any speed range all it has is numeral's 1-6 with no relation to speed. Do not buy this item if you are going to cut (buff out scratches) or polish your car; you will not be able to set speed ranges recommended by product for each step. It is completely useless as a car buffing or polish tool. Do not buy; I returned mine due to this problem",
      "rating": 1.0,
      "verified": true,
      "author": "Mac from Nevada",
      "helpful_votes": 15,
      "publication_date": 20181102
    },
    {
      "title": "Easy to use.",
      "text": "Used it for the first time this past weekend. After watching several youtube videos, I gave it a try. Do a lot of research on which color pads to use and you'll be fine. My Mustang came out perfect with no swirl or any other kind of marks. If I can do a perfect job with the Porter-Cable 7424XP anyone can.",
      "rating": 5.0,
      "verified": true,
      "author": "David Young",
      "helpful_votes": 24,
      "publication_date": 20170331
    },
    {
      "title": "I have always been afraid of myself burning the clear coat so instead would try my best efforts hand detailing",
      "text": "Hands down the safest machine polisher! As stated by several reviews here I too have heard many horror stories of machine detailing. I have always been afraid of myself burning the clear coat so instead would try my best efforts hand detailing. However I came across some YouTube videos by \"Junkman2000\" explaining in depth information about this exact machine. Found myself on amazon 20 minutes later placing my order for the Porter Cable 7424xp. I HIGHLY recommend watching the YouTube videos by Junkman2000 as he was first individual who gave the confidence I needed to begin machine detailing. Never again will I find myself detailing without my Porter Cable 7424xp!!",
      "rating": 5.0,
      "verified": true,
      "author": "Miguel Luna",
      "helpful_votes": 159,
      "publication_date": 20160522
    },
    {
      "title": "Great polisher. Awesome first polisher.",
      "text": "Great DA polisher. Planning on doing my car with meguiars 105/205 with lake country pads to take off bad swirls. Will update with photos when I do that. But I have removed a lot of micro windshield wiper scratches with lake country rayon pads and cerium oxide. Seems like a little vibration but this is my first polisher so I wouldn't know. Hanlde helped a lot on with windshield because reach far. I recommend this prodict as a first polisher.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle Candilasa",
      "helpful_votes": 5,
      "publication_date": 20180219
    },
    {
      "title": "Good tool",
      "text": "I was leery about buying this because of another review that said they weren't made well anymore. Went for it anyway because of price point and a good past history with porter cable. Not at all disappointed. So far only used it to buff one truck, but it worked flawlessly. I'm sure it's not nearly as nice as the higher end da's but for a weekend warrior is a very solid tool at a good price point.",
      "rating": 5.0,
      "verified": true,
      "author": "Coleman",
      "helpful_votes": 6,
      "publication_date": 20171103
    },
    {
      "title": "Don't buy generic. A thought out tool.",
      "text": "I used it and it did a great job. Weight is ok, noise level could be less as the motor sounds refurbished BUT the rpm was consistent so maybe the gears are the culprit. No case. Well balanced as I used 1 hand most of the time. Cord is a good length and of heavy caliber. Plastic shell on entire tool so no gauges in paint if you slip n bump vehicle or trim. Easy on/off switch to when adding wax to pads, dont have to reset rpm setting after every time you dab wax on pads.",
      "rating": 4.0,
      "verified": true,
      "author": "prbylaura",
      "helpful_votes": 3,
      "publication_date": 20190722
    },
    {
      "title": "Does an excellent job, feels very balanced at hand and the ...",
      "text": "I am writing this review after just one use but I am confident it deserves the 5 stars. Does an excellent job, feels very balanced at hand and the result is truly satisfying. I worked on my 2009 BMW and it looks amazing. I spent about an hour in total applying the polish and then polishing off with a lamb wool polishing brush fitted to this polisher. Super excited.",
      "rating": 5.0,
      "verified": true,
      "author": "Arindam Gupta",
      "helpful_votes": 8,
      "publication_date": 20170225
    },
    {
      "title": "Built not to last!!!",
      "text": "I bought this in January 2016 & it last exactly a 3 1/2 years. It worked great for the little time I used it, but the center shaft came apart & almost messed up my Harley's paint job (got lucky!). I did not use this alot, so I'm very disappointed in the product & recommend buying a better quality polisher like dewalt or something. Just be aware that this can come apart at anytime. I have used porter cable for other tools & have found they work well out the box, but just dont last long. Finally have decided to go with other tool brands & not buy porter cable anymore!",
      "rating": 2.0,
      "verified": true,
      "author": "Heather and Denton Burson",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Sturdy and user friendly",
      "text": "Great machine so far. Read the reviews and opted for this one. I've had no issues with it. Easy to handle; easy to control the speed; and it hasn't heated up on me. I used it on both a white vehicle and a black one and it gave me the confidence that I could control it and do what needed to be done without damaging the paint. The proper pads and products are very important as well, but my point is that it is not an unwieldy machine.",
      "rating": 5.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 5,
      "publication_date": 20170412
    },
    {
      "title": "I should have bought this a long time ago...",
      "text": "This makes waxing cars so easy I wish I would have bought one a long time ago. I use a slow speed and a soft pad to apply wax, doing a 2'x2' section at a time. This puts the wax down evenly and works it in well. I use a clean pad with a micro-fiber cover to remove the wax and it's effortless. There's no fighting to get the wax off, it just comes off so easy. I rub the car with a microfiber towel when I'm done to remove any dust or spots I missed.",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Polishing made easy, the design of this dual action polisher makes ...",
      "text": "Polishing made easy, the design of this dual action polisher makes sure you never burn your paint. If too much pressure is applied or an angle that isn't favorable for polishing, the head slows down and stops rotating, preventing you from burning up the paint. I marked my backing plate with a sharpie to let me know when I'm applying too much pressure. I never tried using the included white polishing pad but from what I read online its garbage.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny N",
      "helpful_votes": 4,
      "publication_date": 20170109
    },
    {
      "title": "I cant believe how great the paint looks now",
      "text": "My son used this to polish a very oxidized car that he had purchased. I cant believe how great the paint looks now. The car went from dull and dingy to bright and shiny and I was surprised at how amazing it turned out. This along with about 8 hrs of detailing really turned his 1992 MR2 into a very shiny car.",
      "rating": 5.0,
      "verified": true,
      "author": "Sonia R",
      "helpful_votes": 3,
      "publication_date": 20180104
    },
    {
      "title": "easy to handle and the weight is perfect for one ...",
      "text": "as a noob to detailing, i bit the bullet over the autozone products i have used before. easy to handle and the weight is perfect for one handed use for truck roofs, caps, hoods (though you should use two!) we will see how long it lasts but the reviews i have read say it should be around for a while!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew White",
      "helpful_votes": 4,
      "publication_date": 20170830
    },
    {
      "title": "I love this polisher",
      "text": "I love this polisher. I had purchased a polisher from sears a few years ago trying to save money and was so genuinely disappointed that I dropped more cash for this. Wish I'd just bought this in the first place. What a great way to make you car shine like never before. We purchased the Astro Backing Pad and the Hex-Logic Polishing Pads. Using this setup with Maguiars Polish just take our vehicles to a whole new level. We are a car family. This is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Good",
      "helpful_votes": 8,
      "publication_date": 20160227
    },
    {
      "title": "Love my Porter",
      "text": "I am a stickler at keeping my cars looking tight and right and so when I needed a new Polisher, I decided to give Porter a try and am glad I did. I had owned a Torq before and yes did love it, but just did not have the cash to replace it this time around. The Porter is comfortable and easy to manage. I do not use the handles as they can cause you to get lazy and mess up the paint. Have only had for a few months, but have used to perform a clay rub, compound, polish and wax on 4 vehicles including a rather big truck and has worked out perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "wrandy407",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "Perfect Results",
      "text": "I used this polisher in combination with Chemical Guy products to achieve this mirror like finish on a 12 year old, daily driver. This polisher is very easy to use and well worth the money! Perfect size and weight for car detailing (I am not a professional and have used it only for my own cars). Seems well made and durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Archibald D. Gaebel",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Buy it!",
      "text": "I'm a complete amateur when it comes to car maintenance and this polisher make me look like a professional. Ive attempted to hand wax my car for the first time several weeks ago, little did I know waxing my car took longer than I expected. Got online did some research and found this highly recommended polisher designed for amateur such as myself. I threw my hard earned cashed at it and it was well worth it. Waxing my car takes approximately an hour and results were amazing. Highly recommend this polisher to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 7,
      "publication_date": 20160619
    },
    {
      "title": "Best features for the money",
      "text": "I have buffed three cars now and I have to say this is pretty nice. The only complaint is the weight sometimes. I am pretty sure they could have made it lighter given today's technology. I researched and compared on-line reviews and ratings to the competition. This one has the best ratings and on-line reviews. You pay a little more, but it is worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe M",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "I had sanded a fender with 2000 grit and couldn't buff it by hand to look good. Upon advice from the internet I bought this ...",
      "text": "I knew nothing about buffing cars. I had sanded a fender with 2000 grit and couldn't buff it by hand to look good. Upon advice from the internet I bought this buffer and meguiar's polishing compounds. Man oh man, it looked like a new car. Now for yucks and grins when my neighbors' cars get a little scuffed I tell them \"hey that'll buff right out, let me get my buffer\". The look on their eyes is priceless. Every time.",
      "rating": 5.0,
      "verified": true,
      "author": "V&A M",
      "helpful_votes": 5,
      "publication_date": 20160207
    },
    {
      "title": "Very good product.",
      "text": "Well made product. It is not hook and loop ready. You have to glue on a hook and loop adapter which they don't tell you. After getting it set up I finished two vehicles with the polisher in a significant amount of time compared to hand polishing.",
      "rating": 4.0,
      "verified": true,
      "author": "c.j. stampfl",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Overall good DA machine",
      "text": "I have nothing to compare this to as I’ve never owned or used any other DA machine. I drew lines on my backing plate to monitor rotation and I was slightly disappointed that it seemed to not spin well in lower speeds. It’s own weight seemed enough to stop the spin at low speeds. Maybe that is normal but I felt it was a little odd. I ran it for several hours without issue; never got too hot and never acted up.",
      "rating": 4.0,
      "verified": true,
      "author": "MyTwoCents",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Look like a professional",
      "text": "I have used this product I believe for 6 months or better and now I have my neighbors asking me to polish their vehicles. I love the ease of use and the dependability of the unit. After doing much research on getting started with polishing vehicles, I feel like my choice was the correct one. A must have for the beginner in detailing.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason G.",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Stop looking...this is your polisher...it works great!",
      "text": "I really love this polisher. My boat was getting a little sun bleeched and I brought it back to new. This polisher is well made and very powerful...wow. Bought the astro pnuematic 5\" velcro backing pad and 5\" chemical guy hex pads to attach. It is amazing... very happy with this unit.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Tenison",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Gets great results when teamed with the right accessories and polish!",
      "text": "I used this to polish my cultured marble bathroom countertops and sinks with Turtle Wax rubbing compound and polishing compound. The motor seems powerful and I'm very pleased with the results. But, the motor is only part of the success. I teamed it up with a Chemical Guys BUFLC_BP_DA_6 Velcro backing plate and GP11010 felt polishing pads. I think my counters look better than new! Note: Before the polishing I had to wet-sand the surfaces with 400, 800, and 1000 grit disks using a 5\" orbital sander. This removed all but the deepest scratches and made the surface ready to polish.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan W.",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Worth Every Penny",
      "text": "This is my second purchase of this tool. First was bought about 6 years ago. It served double duty as a 6\" buffer for cars, and a 5\" sander for woodworking. Still going strong, but if it broke tomorrow I would still be happy with the purchase because this thing has been worked like a mule. Bought the new one to dedicate as a 6\" buffer only, and allow the old one to dedicate to 5\" sanding. New one is quieter than old model ever was, and the variable speed switch allows for more fine adjustment than the old one did. Buy this for a price between $100 and $130 and you won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "JD4537",
      "helpful_votes": 2,
      "publication_date": 20150712
    },
    {
      "title": "Proven durability and reliability. Safe for novices. Best bang for the buck.",
      "text": "I’ve purchased a second after the first went “missing.” Best bang for the buck - no need to spend $300 or more on Rupes or other brands, this does the job well and at 4.5 amps, is just as powerful as the others. I prefer the 8” throw for the sometimes tighter space and curves of modern cars. A no brainer to use and Porter Cable has decades of proven durability. Cuts fast, but won’t burn through paint if pushed to the limit.",
      "rating": 5.0,
      "verified": true,
      "author": "big_art",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Awesome little polisher",
      "text": "I'm no professional detailer by any means and I've never touched a polisher before. I made sure to look at as many tutorials as I could with this machine and it seemed easy enough. After getting through the nerve wracking process of actually using it on my car, it did the job perfectly. Unless you're in the detailing business, this is all you really need in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Lawrence",
      "helpful_votes": 3,
      "publication_date": 20180112
    },
    {
      "title": "Saves me lots of time",
      "text": "I did a lot of research on detailing and headlight restoration. This is a great beginner machine and use it every time I perform a headlight restoration. Definitely beats doing any kind of detailing with a cloth. Nobody got time for that, haha. Nice, sturdy, powerful polisher that doesn't feel like it will fall apart any time soon.",
      "rating": 5.0,
      "verified": true,
      "author": "J & R",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Great tool for Auto Paint",
      "text": "Orbital is a safe way to detail a car. Iv'e since went to rotary for heavy duty application. But if your detailing a new car and just want to lightly polish the paint this porter cable orbital is the way to go with a non aggressive polish say if you have a new Corvette etc . Porter Cable orbital is a tool in my shop lineup. The Porter is a work horse.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "This thing is amazing. I love the fact that is can be ...",
      "text": "This thing is amazing. I love the fact that is can be used from stripping gelcoat, sanding fiberglass, sanding and polishing gelcoat, and whatever else you want. I wish there was a cordless version but that would add to the already hefty weight. It's powerful so be careful when sanding. It can remove a lot more than you would expect.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Bentley",
      "helpful_votes": 3,
      "publication_date": 20161027
    },
    {
      "title": "I recently purchased the 7424XP and I couldn’t be happier with the results I have achieved while using this ...",
      "text": "I recently purchased the 7424XP and I couldn’t be happier with the results I have achieved while using this machine! I used it with Meguiar’s M105 & M205 combo, and the finish was impeccable! Such an easy machine to use, and very cost effective as well. For the price, I couldn’t ask for a better polisher!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon T",
      "helpful_votes": 5,
      "publication_date": 20180101
    },
    {
      "title": "this tool is your best friend! Look for YouTube videos by Mike Phillips ...",
      "text": "If you want to correct your automobile's paint, this tool is your best friend! Look for YouTube videos by Mike Phillips and Junkman2000 to learn all you need to know about restoring your vehicle's finish safely and effectively.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam S.",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Wont spin with slightest pressure",
      "text": "This thing barely spins and when I apply small pressure it stops spinning. Pure garbage! I want my money back!",
      "rating": 1.0,
      "verified": true,
      "author": "Robby",
      "helpful_votes": 2,
      "publication_date": 20190911
    },
    {
      "title": "Worth the price",
      "text": "My son has used this on his 4WD truck that sees a lot of off road use. It is easy to hold and handle. It can get in small places and will not \"burn\" the clear coat if used properly. It is powerful. There are many attachments that fit the polisher. After much reviewing, I feel I made the best choice.",
      "rating": 5.0,
      "verified": true,
      "author": "exkodaker",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Great for a detailers arsenal",
      "text": "I bought this to be a back up once my torq went out. So far I’ve used it to polish and with a brush attachment. It has handled everything pretty well, however it is slightly louder than the CG torq. Wear ear plugs or headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "FrankO",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "but I don't like the cheap buffing sponge they send with it",
      "text": "The unit itself seems really solid, but I don't like the cheap buffing sponge they send with it. Mine came unglued from the plastic part (looks like a little black disk between the sponge and the buffing unit in the picture) that goes into the chuck to hold it. No big deal, I just put it back on with better glue, but I would be happier if Porter Cable would find a better 3rd party for this accessory.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 9,
      "publication_date": 20150125
    },
    {
      "title": "This machine did a great job in tandem with those products in order to ...",
      "text": "I used this in combination with an Astro backing pad, chemical guys hex-logic pads, and some Meguiar's polishes. This machine did a great job in tandem with those products in order to remove some really harsh swirls from my 2011 Ford Focus. When I had first gotten the car and didn't care much about paint, I had dropped my drying towel on the ground and continued to use it... ugh! Now that I take pride in what I own, I can maintain the great paint that this polisher helped me to achieve.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20160409
    },
    {
      "title": "Nice polisher, little heavy",
      "text": "It does the job. A little on the heavy side but if you are waxing vehicles that's ok. I bought it to wax my RV. It's a little harder to use on vertical surfaces.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly Jo",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Great beginner product",
      "text": "I do all of my detailing using this product, it's not the best but a must have for someone who's looking to get into paint correction. I have tackle some pretty tough jobs with ease using this device and don't see any reason why I would need to upgrade anytime soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Melvin",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Broken out of box.",
      "text": "Fresh out of the box, didn’t work. Mexican garbage. Going to try a replacement and see if it works, but wouldn’t be surprised if that one doesn’t work either!",
      "rating": 1.0,
      "verified": true,
      "author": "Vince",
      "helpful_votes": 4,
      "publication_date": 20190331
    },
    {
      "title": "Excellent Polisher!",
      "text": "Purchased this polisher to replace a sixteen year old Porter-Cable 7424 that had seen a lot of use over the years and had lost a lot of power despite being relubricated and having brushes replaced. The first time I used the polisher my initial impressions are it is more powerful and has slightly less vibration. In my opinion, the ergonomics of the 7424XP are somewhat better than the previous model. This model is as well made as the previous model. Overall, I am very pleased with this polisher and it makes polishing and waxing a snap.",
      "rating": 5.0,
      "verified": true,
      "author": "RonT",
      "helpful_votes": 0,
      "publication_date": 20160424
    },
    {
      "title": "quality",
      "text": "Had the older models and they lasted about 10 years. Used over 300 hours per year. Dropped one in the salt water. Fresh water rinse and i don't ever know which of the 3 buffers it was. New random orbitals going strong and i hope they last as long as the last ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Novack",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "The REAL DEAL",
      "text": "I spent a whole lot of time researching DA polishers, and everything pointed me to the Porter Cable 7424xp. This machine is the real deal! It is durable and very easy to use, and best of all it really does wonders on your vehicles paint. The 12 speed settings (1-6 at 1/2 increments) make this polisher so dynamic and great for any project. With the right product & pad combination, almost any paint defect can be removed. I highly recommend the PC7424xp to anyone who is looking for a high quality dual-action polisher. It will make your detailing experience faster and a lot easier on your arms and back while achieving superior results!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul D. Terracina",
      "helpful_votes": 0,
      "publication_date": 20150415
    },
    {
      "title": "You like quality? Buy this!!!",
      "text": "This thing is a gorgeous tool. I bought some extra pads for it & it was me vs a black, rain spotted car. I WON!!! I never used one before so I first viewed YouTube. I was in no hurry & took breaks but this baby really did the job. Easy to hold & just the right amount of power. I was even able to remove deep scratches. I again have a beautiful black car!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian ",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "Perfect all around polisher",
      "text": "Great choice of a dual rotary buffer. Perfect for beginners who fear of burning the paint or who are learning and developing their technique. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Informed Buyer",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Solid and about the right feel.",
      "text": "The balance and feel on this is perfect for cars. The size is not too big, and the power is more than adequate, and can always be dialed back with the speed to almost a crawl. I already had another one, but like this one better, because it handles well in tight places, and is less likely to cause hanger rash in unintended ways. I've always liked P.C. products and this one did not disappoint. It came with washers that seemed to go on the handle screw. I recommend against using them, as you need all the screw depth you can get for a secure handle.",
      "rating": 5.0,
      "verified": true,
      "author": "Manwe1",
      "helpful_votes": 2,
      "publication_date": 20151027
    },
    {
      "title": "Great tool for weekend detailer",
      "text": "Bought this to remove buffer trails marks put in car by someone using a rotary buffer improperly. Bought the Astro 4607 5\" backing pad with 6\" Meguiar pads. Worked well and remove all swirls. Perfect paint correction. I am a complete novice and was able to bring paint back to factory shine first time using this machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "THE GOOD: I am not a professional car detailer",
      "text": "Over a year of use. THE GOOD: I am not a professional car detailer, so I don't have a high number of uses yet. I've used this about 20 times this past year between all my cars, and this thing is solid. Does whats it suppose to do, no headache. THE BAD: I just wish these tools have a smaller/lighter cable. You have to watch out and not hit your car with the cable. Or, they could have moved the cable up a little from the bottom, further away from the object you are trying to polish. One day Porter-Cable will read this review and come out with a wireless model and hook me up ( one can wish).",
      "rating": 5.0,
      "verified": true,
      "author": "Kayman",
      "helpful_votes": 0,
      "publication_date": 20141020
    },
    {
      "title": "Needs improvement",
      "text": "Has a lot of vibration. The front cover falls off easily. Bought it to use on my boat. Works fine just almost dropped it into the water as i was hilding on to the front as i was working a hard to reach area. The handle wants to unthred due to the torque if used on the left side.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Good to go",
      "text": "Great bang for the buck. If you are not a pro, and just want to detail your own cars, you should get this. If you detail for a living, definitely get a better one. For the money, this is good to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Acceptable, but go with the TORQ.",
      "text": "This DA works good for what it's supposed to do, however, the amount of vibration that is transferred to your hands and arms while using this machine is quite noticeable after about 15 minutes or more of use. I would recommend purchasing a TORQ DA machine as it causes very minimal vibration to the user at the same price point as this Porter-Cable. Unfortunately, I purchased this machine prior to discovering the TORQ.",
      "rating": 4.0,
      "verified": true,
      "author": "Purchaser",
      "helpful_votes": 3,
      "publication_date": 20150718
    },
    {
      "title": "Porter Cable Malaysia!",
      "text": "An excellent products for CarGuys or CarCrazy People! Safe, Efficient, Powerful enough for all levels of detailers and enthusiasts! Do not worry about the Difference in Voltage (*UK, AUS, Etc.) where our regions uses 220V-240V.. Just get a Transformer of at least 750watt and you are good to Go! I live in Malaysia where our current is running on 220-240V, 60Hz.. I get a step down transformer and it is really working well and efficient! Amazon efficiency and customer services must be praised for effective timeliness for delivery wise! Thumbs Up! Anyone is Asia and hesitate of getting a good Dual Action Polisher for your Loved Ones, rest assure Amazon serve you RIght!",
      "rating": 5.0,
      "verified": true,
      "author": "Ultrandyman",
      "helpful_votes": 0,
      "publication_date": 20140718
    },
    {
      "title": "Highly recommend for anyone getting into entry level car detailing",
      "text": "Highly recommend for anyone getting into entry level car detailing. Works well and almost impossible to ruin your paint using this. Be sure to buy the chemical guys backing plate (hook and loop- which just mean velcro) and chemical guys polishing pads. I recommend both the orange for cutting, and the white for polishing. Do not, and I repeat, do not use the polishing pad that comes with this product, as it is complete junk. Used this on my new Porsche, worked like charm.",
      "rating": 4.0,
      "verified": true,
      "author": "Czyzler",
      "helpful_votes": 2,
      "publication_date": 20141026
    },
    {
      "title": "Great Product",
      "text": "It may be a little too heavy for some, but, damn, it works as advertised!! I'll not soon become a dedicated 'body man', but this will help me sort out the smaller issues and I'm glad I made the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "TAT",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "ok machine",
      "text": "this is okay but it is noisy and lacks power if I would have known more I probably would not have bought this. I only it bought it based on other reviews and the buff pads do not even spin even with lubricant on them.",
      "rating": 3.0,
      "verified": true,
      "author": "Alex Bustamante",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Don't waste money on the cheapo models that lack the power ...",
      "text": "Powerful and lightweight. Makes waxing a car much easier. Don't waste money on the cheapo models that lack the power - you might as well hand polish. I just wish it came with a better system for quickly switching pads, then machine washing the dirty ones. I know you can buy them, but that's extra money for a top of the line machine.",
      "rating": 4.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 2,
      "publication_date": 20160708
    },
    {
      "title": "Car detailing is so much easier now",
      "text": "I bought this along with some Lake Country pads to do paint correction on my car. If I'm not doing paint correction, it works super well for apply sealants and waxes in half the time. Robust as I'd expect from a Porter Cable.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Calpito",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "40 foot RV done!",
      "text": "My first use was my 40 Ft motorhome. I was not sure I wanted to tackle a large project without some help such as this tool. The only problem I had was trying to reach 12 ft+ height on a 6 ft ladder. Anyway, the tool works like a dream. Any and all little marks on the RV are gone. Looks like it was professionally done. I will not wax the RV again since the height was too much and a bit dangerous on a windy day but for cars, boats, bikes,etc it really does the job. Nice piece of equipment to have tucked in your garage.",
      "rating": 5.0,
      "verified": true,
      "author": "hjt777",
      "helpful_votes": 2,
      "publication_date": 20140124
    },
    {
      "title": "Aluminum polishing",
      "text": "Great to buff and polish; however, if you are on the INITIAL cut and shine of aluminum i.e. Airstream trailer or aluminum boat, you will probably want to use a more aggressive tool like a variable speed angle grinder with a buffing wheel and whatever polish you choose. After you get it shined then this is the tool to keep it looking good along with some of \"Chemical Guys Hex Logic pads\" also sold at Amazon.",
      "rating": 4.0,
      "verified": true,
      "author": "Laketime",
      "helpful_votes": 3,
      "publication_date": 20150404
    },
    {
      "title": "Cuts Time to Wax a Vehicle in Half",
      "text": "Purchased to primarily help the huge task of waxing my RV but I've tried it on my car and I wonder how I've lived to so long without one. It applied the wax perfectly and cut the job practically in half. It does not come with a lot of instructions but youtube has many videos on using this to wax/detail vehicles. You'll want to purchase 6\" bonnets to use with this as they don't come with it. (The ones with elastic on the edges worked wonderfully.)",
      "rating": 5.0,
      "verified": true,
      "author": "Colorado Rick",
      "helpful_votes": 2,
      "publication_date": 20141106
    },
    {
      "title": "Quality",
      "text": "I researched buffers to buff scratches out of my new truck, read reviews on all of them and while this was more expensive than most, it was easy for me to learn on, being that I have never buffed or polished a car with a machine before. Used Chemical Guys (4) compound combo pack and could not be happier",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Mahon",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "This thing does a great job, but you will probably find that once ...",
      "text": "This thing does a great job, but you will probably find that once you have done a few cars and are very comfortable with the process of polishing, it will feel a bit under powered. No question it is the best beginner polisher on the market though. I find that it is far to easy to stop the rotation by getting the angles off and sometimes I wish I could just power through uneven surfaces or angles with a little more ease.",
      "rating": 4.0,
      "verified": true,
      "author": "BlueArcher",
      "helpful_votes": 3,
      "publication_date": 20150124
    },
    {
      "title": "Nice tool for a reasonable price.",
      "text": "I was able to use this with one hand which was important b/c I had to polish a freshly painted motorcycle tank. It worked well. I also used this to polish my 2007 Corolla. It took a lot of small surface scratches out of the clear coat and made the car look a lot better. Very happy with this item. it vibrates like crazy, but as i noted I could still manage it with one hand. Would like to see some type of vibration dampener in the handle, if such a thing exists.",
      "rating": 4.0,
      "verified": true,
      "author": "Vonzo",
      "helpful_votes": 0,
      "publication_date": 20150309
    },
    {
      "title": "Good product from a company that's been around.",
      "text": "Perfect for a weekend warrior/beginner doing paint correction. It has a long cord which is awesome. Most other cheap polishers have these short stiff cords. Light and easy to maneuver.",
      "rating": 5.0,
      "verified": true,
      "author": "GS",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "You need to order the foam backer pad separate.",
      "text": "Machine doesn't come with a hook and loop foam backer so you have to buy that when purchasing this machine. Not much money but I thought I would be buffing when I got it and when I ordered pads I didn't order them with a backer. Just a heads up.",
      "rating": 3.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Worth Every Penny!",
      "text": "Wow, this is a great product. I have used this on my 2013 Infiniti G37 that is in great condition. But what really amazed me is when I used it for a 1998 Ford Expedition that has never been garaged. And being well used in snow and off trail, I haven't really washed it more than 4-5 times a year. I spent a day washing and wax and polishing, and my 18 year old Ford Expedition now looks brand new! Wow! Remember you'll need a backing plate and pads.",
      "rating": 5.0,
      "verified": true,
      "author": "ASA",
      "helpful_votes": 0,
      "publication_date": 20151011
    },
    {
      "title": "Does a great job!",
      "text": "I really like this as it does a great job and not hard to use. Fairly light and the variable speed is great for the different jobs. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth Garrison",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Works well, just as expected.",
      "text": "No disappointments with this polisher. It appears to be of high quality and functions well. I have used it to wax and polish (2) vehicles plus a camper trailer. It certainly makes the job easier.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Excellent product. Wish that it came with the Velcro ...",
      "text": "Excellent product. Wish that it came with the Velcro adapter for the different pads. However, the variable speed met all expectations of my project with my car.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Forbes",
      "helpful_votes": 2,
      "publication_date": 20170121
    },
    {
      "title": "works great",
      "text": "didn't want to buy the best as it was a lot more expensive. At the time this was the second best.This is easy to use and the speed control works great. I just use the tool weight pressure to buff out the car.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Nunez",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Polishing pad vibrates but barely moves unless very little pressure is applied.",
      "text": "I returned it. The head vibrates but it doesn't move much unless you apply *very* little pressure. This IMHO makes it an ineffective polisher. I found myself getting much better results by doing it by hand.",
      "rating": 2.0,
      "verified": true,
      "author": "Gustavo A. Delfino",
      "helpful_votes": 2,
      "publication_date": 20171008
    },
    {
      "title": "Great machine",
      "text": "I have a mobile detailing business for over 12 years. I tried all kind of machines. I know there are many good ones, but this one do the job. It is also a safe machine for amateurs and professionals. It is small. It is easy to hold . I recommend !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrshine",
      "helpful_votes": 2,
      "publication_date": 20161030
    },
    {
      "title": "Efficient for fast polishing/buffing work.",
      "text": "This is nicely weighted; it makes buffing and polishing very easy. The variable speed is handy. My cotton cloth stuck easily to the velcro on the backing plate, eliminating the need for special buffing and polishing pads. Much faster than polishing by hand! Used for removing oxidation, polishing and waxing fiberglass RV roof.",
      "rating": 5.0,
      "verified": true,
      "author": "2millibros",
      "helpful_votes": 0,
      "publication_date": 20160612
    },
    {
      "title": "Thumbs up !",
      "text": "Speaking as a DIY'er, very pleased with this polisher. Definitely quality made.Should serve my needs for along time.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Steel Mill contaminated paint job looks brand new!",
      "text": "WOW - Having always been scared to use a power tool on my vehicle for fear of doing damage, I must say that at no point during the operation of this 7424XP did I have any fear. I work in a steel mill where all types of dusts (coal, iron, other) and water containing all kinds of contaminants can get on the surface of my vehicle during the course of the day. This machine makes my finish look brand new! Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe B.",
      "helpful_votes": 2,
      "publication_date": 20160415
    },
    {
      "title": "but the car I was working already had pretty bad paint",
      "text": "Before owning this tool, I had never done paint buffing, was concerned I might ruin the paint, but the car I was working already had pretty bad paint. I was very pleased with the end result. I love that with this tool I never had to worry about damaging the paint. Made a 1998 Oldsmobile Aurora that wasn't well taken care of shine shine shine, almost as good as new. Did a very good job at removing paint swirls, much better results than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Headlee",
      "helpful_votes": 0,
      "publication_date": 20141219
    },
    {
      "title": "Great buffer for new car paint",
      "text": "Used the buffer with Chemical guys 4 step polishing. I used 5\" pads and have since switched to the correct weight for the 5\" pads",
      "rating": 5.0,
      "verified": true,
      "author": "SachseBrewer",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Great DA Polisher!",
      "text": "I abuse the hell out of this DA Polisher. It keeps going no matter what I throw at it! If you need a polisher, this is the one for you!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristopher Brown",
      "helpful_votes": 0,
      "publication_date": 20171214
    },
    {
      "title": "Worth every penny!",
      "text": "I can't remember how long ago I bought my porter, but I'm still using it today. Very high quality product. I've used and abused this bad boy including dropping it 3-4' and it just keeps going. Took the handle off after 1st use and spend about half my time holding this one handed. With a 5.5\" foam pad it's about perfectly balanced. If this thing ever eventually dies on me....I'll be replacing it with the exact same model.",
      "rating": 5.0,
      "verified": true,
      "author": "MIFARMER",
      "helpful_votes": 0,
      "publication_date": 20150228
    },
    {
      "title": "Great Polisher",
      "text": "Ordered this to polish our boat after sanding it to remove oxidation. The boat looks fabulous and with this tool it took a lot less effort than we expected. We had been taking our boat to a body shop to have it polished. This polisher was less than one visit to the body shop.",
      "rating": 5.0,
      "verified": true,
      "author": "PYV",
      "helpful_votes": 2,
      "publication_date": 20150927
    },
    {
      "title": "Amazing Hand-Held Polisher",
      "text": "The PorterCable Random-Orbit Polisher is one great polisher. The variable speed is a plus. No fear of \"burning\" through the paint with this unit. You can hold your hand against the head of this unit with no danger to your skin, amazing. Easily held and manuvers over the ridges, grooves and other body lines with no problem and again with no fear of burning the paint. So nice for getting down low by the quarter panels and rocker panels and around the bumpers, chrome or plastic it doesn't matter. Whether you are just applying wax or using a swirl/haze remover or your favorite revival polish this should be your choice of polisher, honest.",
      "rating": 5.0,
      "verified": true,
      "author": "shug1",
      "helpful_votes": 3,
      "publication_date": 20061107
    },
    {
      "title": "Gets the job done right",
      "text": "This variable speed polisher is well made and it is powerful. The unit is a little heavy but durable. The handle is not always needed. It can get in the way in tight places. It's a good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Hubie",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Recommended by the PRO's, so I bought one, and wasn't disappointed",
      "text": "There's a reason the Pro's recommend this polisher. I've used it on several cars now, and it is WAY better than a rotary polisher I was using before. The random orbits it incorporates make it polish without swirls.",
      "rating": 5.0,
      "verified": true,
      "author": "Reviewer",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Huge time-saver. Great product and highly recommend.",
      "text": "This product has excellent heft to it and is easy to use with multiple settings. After many years of being on the fence, I finally pulled the plug on this. Really cuts down the detailing of my Nissan Titan and produces excellent results. It comes highly recommended and I am also a fan. Give it a try, and I bet you will be too.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Clark",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "Great DA Buffer",
      "text": "Great DA buffer. But does not come with a backing. Order Meguiars hook and loop backing plate and you are set for foam pads. Could be more ergonomic, but best one yet and will outlast me.",
      "rating": 5.0,
      "verified": true,
      "author": "Cjbat",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Much better than hand waxing.",
      "text": "This product makes wax application a breeze. I will never go back to hand waxing again.",
      "rating": 5.0,
      "verified": true,
      "author": "OsmannyM",
      "helpful_votes": 3,
      "publication_date": 20170107
    },
    {
      "title": "Great unit to start with. You will quickly step up.",
      "text": "Great value for a beginner. Gets the job done. Converted it to a 3\" polisher to handle tight areas.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil D. Childress",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Great polisher",
      "text": "Love, love, LOVE this polisher. So easy to use and I really like the thumb wheel speed adjuster on the handle.",
      "rating": 5.0,
      "verified": true,
      "author": "Soni C. Lee",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Used in a shop environment.  Takes a beating - Great product.",
      "text": "We use these in a shop environment for production work. They work great and people don't burn paint like they do with a rotary buffer. These don't come with a velcro backing plate - so budget that in if you're purchasing.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Easy to use great for beginners like myself",
      "text": "Easy to use solid well made easy to get comfortable with after color sanding my truck after getting painted and trying other buffers that didnt work for me I'm happy with my purchase and highly recommend this was my first time buffing I paired this up with a set of chemical guys hex pads and a 6 inch hook and loop backplate",
      "rating": 5.0,
      "verified": true,
      "author": "louie",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Lovely bunch of power",
      "text": "I have been using this polisher for the last year, and it works great as a polisher at speed 5 or 6. I prefer to use it for wax because it makes the job easier and faster, and I think I get a thinner coat of wax that is also far more even than I could achieve by hand. It does vibrate at higher speeds, and I need to change the white polish pad after a year of steady use. I cover it with bonnets that are foam or microfiber, but the pad has separated, in part, because I do try to wash it weekly to keep it clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Pan",
      "helpful_votes": 2,
      "publication_date": 20121022
    },
    {
      "title": "Quality",
      "text": "Quality Product however I already this same model, my initial purchase was targeting a Buffer and this arrived.",
      "rating": 5.0,
      "verified": true,
      "author": "anthony t vinson",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Great polisher",
      "text": "This polisher made waxing my boat a breeze. I am very pleased with the results.",
      "rating": 5.0,
      "verified": true,
      "author": "Andre L. shipp",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Annoying speed adjust dial.  Otherwise, works great.",
      "text": "Tool worked great. Got pretty darn hot after about 2 hours of buffing. Speed adjustment wheel is annoying. I really don't like that feature. Would make a lot more sense to put the dial where it can be reached by the thumb on top while buffing.",
      "rating": 3.0,
      "verified": true,
      "author": "Not a bot",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "Great for the price.",
      "text": "To keep it short and sweet, this product will do exactly what you need it to do, which is polish your car/boat/surf board/other toy and it is built to last a good long time. The only reason it doesn't get 5-stars from me is because there are better products out there (some of the more affluent of my friends have these units) but I could not justify the price difference for myself.",
      "rating": 4.0,
      "verified": true,
      "author": "T.G.",
      "helpful_votes": 0,
      "publication_date": 20141013
    },
    {
      "title": "Time saver",
      "text": "Exactly what I needed to detail my wife's car and my truck. Saves a lot of time and back breaking work . Used to take me 2 days to completely wash, clay bar, and wax 2 full size vehicles now can finish both vehicle in a single day with the use of this buffer.",
      "rating": 5.0,
      "verified": true,
      "author": "Nolaninc",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "All you need in a buffer.",
      "text": "This is the buffer that I'm using to remove the chaulking from my gelcoat on my motorhome. It does everything I need it to do and is the best buffer I've ever owned and I've owned many. The varible speed is what you need in oxidation removal, polishing, waxing and sealing of gelcoat on a boat or motorhome. For the consumer who is a good do it yourself this product will do the job if you use it correctly. You will have professional results and save yourself alot of money.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave L. Wake",
      "helpful_votes": 2,
      "publication_date": 20140128
    },
    {
      "title": "Pair with Meguire's and your car will look like day 1 again!",
      "text": "I have a 2005 Black Honda Element that had horrible swirl marks all over the paint. The brutal winters in Chicago really made the paint look dull too. I used all Meguire's products: M105 with cutting pad, M205 with polishing pad, M21 with finishing pad. The paint is completely swirl free now. Took a lot of work and many hours to do but it has made me feel much much better about my cars paint. The Porter Cable 7423XP is well worth the money and it is so safe to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20140526
    }
  ],
  "product_meta": {
    "title": "PORTER-CABLE Variable Speed Polisher, 6-Inch (7424XP)",
    "description": "Amazon.com Ideal for polishing and sanding automotive and marine projects, the Porter-Cable 7424XP 6-inch polisher features a 4.5 amp motor for high overload protection and random orbit. It comes with a 6-inch polishing pad. Random orbit, swirl-free sanding/polishing action (view larger). Nicely compact at just 5-1/2 pounds, the 7424XP offers swirl-free sanding/polishing action with an electronic variable-speed dial that operates at 2,500-6,800 orbits per minute (OPM). The 7424XP accepts 5/16 to 24 spindle thread accessories, and it offers a full ball and roller bearing construction for durability under industrial workloads. It features a proprietary counter balance for use with a 6-inch sanding/polishing pad, and it features a two-position (left or right) removable side handle for greater comfort and control. The polisher measures 11.5 x 10.5 x 6 inches (LxWxH). Warranty This Porter-Cable tool is backed by three-year limited warranty covering any defects due to faulty materials or workmanship (from the date of purchase). It's also covered by Porter-Cable's one-year free service contract, where Porter-Cable will maintain the tool and replace worn parts caused by normal use--for free. What's in the Box Porter-Cable 7424XP random orbit polisher; polishing pad; side handle; wrench; operating instructions Ideal for polishing and sanding automotive and marine projects (view larger). 7424XP 6-Inch Random Orbit Polisher At a Glance: Random orbit, swirl-free sanding/polishing action Electronic variable-speed dial 2,500-6,800 OPM Accepts 5/16 to 24 spindle thread accessories Removable two-position handle Includes 6-inch polishing pad Three-year limited warranty; one-year free service\n\nAMAZON.COM\n\n\nIdeal for polishing and sanding automotive and marine projects, the Porter-Cable 7424XP 6-inch polisher features a 4.5 amp motor for high overload protection and random orbit. It comes with a 6-inch polishing pad.\n\nRandom orbit, swirl-free sanding/polishing action (view larger). Nicely compact at just 5-1/2 pounds, the 7424XP offers swirl-free sanding/polishing action with an electronic variable-speed dial that operates at 2,500-6,800 orbits per minute (OPM). The 7424XP accepts 5/16 to 24 spindle thread accessories, and it offers a full ball and roller bearing construction for durability under industrial workloads. It features a proprietary counter balance for use with a 6-inch sanding/polishing pad, and it features a two-position (left or right) removable side handle for greater comfort and control. The polisher measures 11.5 x 10.5 x 6 inches (LxWxH).\n\nWARRANTY\nThis Porter-Cable tool is backed by three-year limited warranty covering any defects due to faulty materials or workmanship (from the date of purchase). It's also covered by Porter-Cable's one-year free service contract, where Porter-Cable will maintain the tool and replace worn parts caused by normal use--for free.\n\nWHAT'S IN THE BOX\nPorter-Cable 7424XP random orbit polisher; polishing pad; side handle; wrench; operating instructions\n\nIdeal for polishing and sanding automotive and marine projects (view larger). 7424XP 6-INCH RANDOM ORBIT POLISHER\nAT A GLANCE:\n * Random orbit, swirl-free sanding/polishing action\n   \n   \n * Electronic variable-speed dial 2,500-6,800 OPM\n   \n   \n * Accepts 5/16 to 24 spindle thread accessories\n   \n   \n * Removable two-position handle\n   \n   \n * Includes 6-inch polishing pad\n   \n   \n * Three-year limited warranty; one-year free service",
    "rating": 4.7,
    "feature_bullets": [
      "Random-orbit, swirl-free sanding/polishing action and 4.5 amp, AC only",
      "Electronic variable-speed dial from 2,500-6,800 OPM",
      "Features a proprietary counter balance for use with 6-inch sanding/polishing pad",
      "Accepts 5/16 - 24 spindle thread accessories",
      "Features a 2-position (left or right) removable side handle for greater comfort and control"
    ],
    "specifications": {
      "Manufacturer": "PORTER-CABLE",
      "Part Number": "7424",
      "Item Weight": "5.75 pounds",
      "Product Dimensions": "14 x 6.5 x 6 inches",
      "Item model number": "7424XP",
      "Is Discontinued By Manufacturer": "No",
      "Size": "full size",
      "Color": "Gray",
      "Style": "Polisher",
      "Power Source": "Corded-electric",
      "Voltage": "120 Volts",
      "Item Package Quantity": "1",
      "Special Features": "Variable-speed",
      "Included Components": "Bare-tool",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "One Year Warranty",
      "ASIN": "B002654I46",
      "Customer Reviews": "4.7 out of 5 stars1,575 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#100,542 in Tools & Home Improvement",
      "Date First Available": "May 15, 2000"
    },
    "categories": [
      "Power & Hand Tools",
      "Tools & Home Improvement",
      "Power Tools",
      "Polishers & Buffers"
    ],
    "price": ""
  }
}