{
  "website_summaries": [
    {
      "verdict": "Dog dental chews made from apples, oranges, and bananas are easy to digest and reduce plaque and tartar through mechanical chewing action.",
      "pros": [
        "Easy for dogs to digest",
        "Formula helps to reduce plaque and tartar through chewing and mechanical abrasion",
        "Helps freshen breath",
        "All-natural ingredients, good source of vitamin E, and tasty",
        "Available for dogs of different sizes",
        "Dingo also makes other types of dog treats and chews"
      ],
      "cons": [
        "No preservatives, so chews must be used promptly or they'll spoil"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Choking hazard!!!",
      "text": "I am completely horrified after my dog choked on these bones twice and almost died! I am a veterinarian and was able to remove the obstruction but seeing her in a state of panic, not able to breathe, furiously pawing at her mouth, and turning purple was absolutely traumatizing. I thought the first time was because she tried to eat the bone whole, but the second time I realized that the bone starts disintegrating and becoming gummy, which then got stuck of the back of her mouth and she couldn’t swallow it. I will never give these treats again and hope no one else does either!",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel Castillo",
      "helpful_votes": 36,
      "publication_date": 20180221
    },
    {
      "title": "1 of 2 likes them a lot, the other will eat it eventually",
      "text": "My girl really likes these. She's pretty happy with most Dingo products. I'm not sure about the consistency of these...Kind of a weird plastic-y brittle. I would normally only give half if I were unsure about a treat, but they're too hard to snap so she ends up getting the whole thing. There haven't been any tummy issues so I guess it's all good. The chihuahua is usually hesitant to go for it, but as soon as he sees my girl start in on hers, he'll start in on his. Again, no tummy issues from these so all seems well. They seem a little big for a 20lb chihuahua, but they're the perfect size for a 35lb terrier.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey",
      "helpful_votes": 2,
      "publication_date": 20170816
    },
    {
      "title": "Better breath",
      "text": "Not only do these dental chews help improve our dogs’ breath (with daily use), but our dogs enjoy these so much that we have to supervise them so that the smaller dog’s treat isn’t stolen. It’s also great that they don’t affect their digestion negatively, which other chews and treats have done.",
      "rating": 5.0,
      "verified": true,
      "author": "PS Forster",
      "helpful_votes": 3,
      "publication_date": 20190717
    },
    {
      "title": "My dogs favorite",
      "text": "Its like crack for dogs! He loves them over jerkey and all the other treats I buy him! Breath smells better too! I still buy the small dog Dingo bones and twists, but this is his favorite and he will only eat the others when I run out of these!",
      "rating": 5.0,
      "verified": true,
      "author": "IAM4LSU",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "2 Picky dogs like them, and a solid value for the money",
      "text": "For smaller to medium dogs these are good treats for the teeth. you get 2 dozen, they won't last too long depending on the dogs but great in between type snacks or before bed snacks to help the tartar from building up too much. Love them as add ons!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn M",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "My dogs we're kind of on and off with them",
      "text": "I only gave you three stars because they're made for small breed dogs but are really hard. My dogs didn't seem to care for them because they were so hard. Now if you have a dog that likes hard treats then they will work well they smell great but again are hard.",
      "rating": 3.0,
      "verified": true,
      "author": "Pamela Laskowski",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Good Product",
      "text": "Although our dogs are large, they don't like the large size Dingo Denta Treats. They like this mini size and get two each morning. Their teeth have stayed clean and their breath fresh. This is their favorite brand, other brands they just refused to eat.",
      "rating": 5.0,
      "verified": true,
      "author": "Leaf Hopper",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "BEWARE",
      "text": "I love original dingo for my dogs. However PLEASE BE AWARE , these are extremely dangerous especially for little dogs. They can , have and will choke ur dog if they aren’t monitored. And that being said these should be off the market.",
      "rating": 1.0,
      "verified": true,
      "author": "dana S",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Dog likes them",
      "text": "The smell of the treat is not minty or anything like i expected. It does have a chewy/thick rubber type feel to them. The dog really enjoys them and has no complaints. Hoping the continued use make an improvement on his teeth.",
      "rating": 4.0,
      "verified": true,
      "author": "Boba Fatale",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Don't feed other dogs,that don't belong to you.",
      "text": "Both my dogs refused to eat it,so I just passed it on to some neighbors dogs. I know 1 of my neighbors dog ate it,but I felt bad he threw up that same night. I wouldn't buy it again. Lesson learned",
      "rating": 2.0,
      "verified": true,
      "author": "Magda T.",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Great for doggy breath",
      "text": "My dogs enjoy eating these. The love a variety of products made by Dingo. And they do help freshen their breath.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Tasty treat to clean his teeth",
      "text": "I like them so did my dog but I thought they were smaller. I have bought the next size down didn't realize they were bigger. I have to break them in half for him. They are harder for him to eat otherwise their great.",
      "rating": 4.0,
      "verified": true,
      "author": "Laurena J Vande Weerd",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "A Treat dogs LOVE",
      "text": "Our little Chiweenie gets one bone that we hide for her to find at bedtime. It is something she loves more than any food or treat. We have to give her thyroid half a tab, twice a day. She actually begs for the pill so she can be praised as a good girl and get that bone before she sleeps.",
      "rating": 5.0,
      "verified": true,
      "author": "GabbyRob",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "24 pack Dingo Mini Denta-Treats",
      "text": "I normally order the Checkups Dental dog treats and divide them into thirds to give to my three bichons who really love them. This time I ordered the Dingo Mini Denta-treats because they saved me a little money versus the Checkups and as near as I could tell the ingredients seemed to be almost the same. I am not sure my three fluffs like them as well as the Checkups which they will chew right away. They seemed to leave them alone until they realized they weren't going to be offered anything else and later they would finally consume them. It was worth a try and perhaps other dogs won't be as picky as are my three.",
      "rating": 4.0,
      "verified": true,
      "author": "Diana A",
      "helpful_votes": 0,
      "publication_date": 20130321
    },
    {
      "title": "Great for their oral health!",
      "text": "Our two boys, Bichon Frise and a Poodle, love these! They've got the right amount of crunch, not too hard but not too crumbly. I know it works at keeping their teeth clean since our vet always comments on their good oral health, despite the fact that we're not the most consistent parents when it comes to brushing their teeth... *lays head down in shame * I give them each one Dingo after their home made dinner. Dingo has become the \"treat\" word around here :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara V. ",
      "helpful_votes": 2,
      "publication_date": 20140803
    },
    {
      "title": "Doesn't last long",
      "text": "I thought these were going to be minty based on the packaging shown but they are not. It arrived in blue packaging, original flavor. My dogs love these but even my 8 lb dog devours this in about 2 minutes, so it really doesn't serve any use as a teeth cleaning dental chew. Also, my other dog throws up if she has too much. Disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Sierra",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "Puppy crack",
      "text": "My dogs LOVE these bones. They don’t want the dingo twist sticks anymore. All they want are these dental bones",
      "rating": 5.0,
      "verified": true,
      "author": "Owright",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Tear into TARTAR for Tooth care on your little breed dogs!",
      "text": "Woof woof wooof wof.... CHIHUAHUA BARKING translated to “ Nice Bone for my little mouth & I don’t even know it helps clean away Tartar too!”",
      "rating": 5.0,
      "verified": true,
      "author": "DEBBS",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Good value",
      "text": "My little dog she loves them. for the taste Well I have never ate one I leave that to my Dog. she likes all the snacks that I get for her..",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Not American Made",
      "text": "Did not notice but product is made in Thailand, needless to say it went in the garbage. I only buy American Made for my precious pet.",
      "rating": 1.0,
      "verified": true,
      "author": "Jan Mata",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Clean my teeth!!",
      "text": "7 years of giving these to my Yorkies and yearly cleaning has kept their chompers in excellent condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Soo",
      "helpful_votes": 2,
      "publication_date": 20170805
    },
    {
      "title": "She loves them, I love the price!",
      "text": "My sweet pupperoni loves these! At almost 11 years old, her teeth are awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "nmckain",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Dingo dental treats whitening",
      "text": "The small dog bone shaped ones with whitening seem to clean fine but they smell terrible. The chicken liver smell is almost as bad as dog breath.",
      "rating": 2.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "My Pugs Luv Denta Treats!!!!!!!!",
      "text": "Our two pugs, ages 4 and 14, love Denta Treats! They get them as \"dessert\" at the end of each meal, and at special times (you know, when they go potty, at the end of play time, and just about any time they wag their tails)... Unfortunately, stores like Pet Smart have stopped carrying them, and even Target stores don't keep their stock supplied. Thank goodness for Amazon.com. I can always count on them to come thru for me/the pugs....",
      "rating": 5.0,
      "verified": true,
      "author": "George from Charlotte",
      "helpful_votes": 4,
      "publication_date": 20120918
    },
    {
      "title": "Good value",
      "text": "My dogs always love these treats. Especially great for dogs that dont like the green treats.",
      "rating": 5.0,
      "verified": true,
      "author": "Joan Ballinger",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Small treats that my dog loved!",
      "text": "My border collie loved these. They're small, but I wanted to keep his treats as small as possible so they were perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "DLZ",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Hard as a rock",
      "text": "Don’t bother purchasing these. They turned rock hard after my first time opening bag. My dogs had issues bitting into them. Not worth the price and health of the dog",
      "rating": 2.0,
      "verified": true,
      "author": "astrocreepergirl",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "picky dog likes them",
      "text": "Mr.Tobi likes these not his favorite but will eat them when thats all he got lol",
      "rating": 5.0,
      "verified": true,
      "author": "D+J",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Great teeth chews",
      "text": "Love these chews for my pup! She loves them, great flavor. Great ingredients.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Dog treats good for teeth",
      "text": "Our Yorkie needs to keep her teeth clean. These will help.",
      "rating": 5.0,
      "verified": true,
      "author": "Maureen K. Tyson",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Teething babies.....",
      "text": "The baby boy loves chewing on these as he is teething.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "White teeth good breath",
      "text": "Dog loved them. Normal treats take seconds and these Distract for minutes. Teeth look great and breath is better.",
      "rating": 4.0,
      "verified": true,
      "author": "Quan",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Good Buy",
      "text": "These are great for helping to keep pups teeth clean and white!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Loved by my small dogs.",
      "text": "Although when trying to through the little mini bone shaped mini chew, they can get a little sticky and messing. However, my 2 small dogs love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Nate",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "very good product I recommend this product.",
      "text": "I have noticed his teeth whiter. And it's removed stains from his teeth. Very good product definitely would recommend this product. And he is very picky. So it must taste good to him.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Camacho",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "They’re okay",
      "text": "My dog loves them but at the same time she’s a dog. She’ll eat anything. From what i gather of the smell, the flavor isn't all that and it doesn’t really freshen her breath. But there are quite a few treats in the bag and my doggie looks as happy as can be when she’s chewing on them :)",
      "rating": 3.0,
      "verified": true,
      "author": "Amazonerrrr",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Must have for breath!",
      "text": "Love this. My picky senior dachshund likes them. They have a weird \"in package\" smell, but work well on the breath. Definitely keep the bag closed when storing.",
      "rating": 5.0,
      "verified": true,
      "author": "pandaflake",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "she does a little happy dance. She LOVES these and I am happy ...",
      "text": "I give these to my dog on Wednesdays and Sundays. So when I ask her, \"What day is it? It's Wednesday bone day!\", she does a little happy dance. She LOVES these and I am happy that she does too. I had her teeth cleaned around February of 2012. I had a vet check her teeth this past October and he said her teeth looked great. I don't brush her teeth, all I do is give her one of these twice a week.",
      "rating": 5.0,
      "verified": true,
      "author": "Betsy",
      "helpful_votes": 0,
      "publication_date": 20150107
    },
    {
      "title": "Dog won’t chew it. Not a favorite treat.",
      "text": "I have to cut them in little pieces. Pup won’t just chew it.",
      "rating": 4.0,
      "verified": true,
      "author": "oma cox",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Fine product",
      "text": "I have two miniature doxies. They absolutely love these chews. The chews helps with cleaning their teeth but not all the way. They still need to have their teeth brushed from time to time. When I gave them the raw hide sticks I would have to stick my finger into Natasha's mouth to pull out the stub to prevent her from choking. Both animals chew these up without that problem. Good product.",
      "rating": 5.0,
      "verified": true,
      "author": "60Plus Something",
      "helpful_votes": 0,
      "publication_date": 20140620
    },
    {
      "title": "Not for older dogs",
      "text": "I don't recommend it for older dogs. I was so fearful she was going to break her teeth. If I can't snap it in half, no way is it safe. Luckily my mom's young dogs love them.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah H",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "My dogs love them!",
      "text": "Dogs love them! Great price. I like that I can save 15%on subscribe and save.",
      "rating": 5.0,
      "verified": true,
      "author": "KaylaJean",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Mickey loves his Dingos!",
      "text": "For the money you can’t beat these dental treats. My dogs teeth are going so he licks them for hours Lol",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Great",
      "text": "My dog likes to hide his treats. He didn’t hide these he ate them immediately",
      "rating": 4.0,
      "verified": true,
      "author": "L. Beard",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Makes me feel less guilty feeding treats to the dog ...",
      "text": "Makes me feel less guilty feeding treats to the dog...as it seems to help with tartar and the infamous dog breath!",
      "rating": 5.0,
      "verified": true,
      "author": "Joan Perry",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "I think these things have a real weird texture but ...",
      "text": "I think these things have a real weird texture but my dog likes them. I'll likely stick with an alternate brand for dental treats.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "My dog loves these treats",
      "text": "My dog absolutely loves these treats. I give him 1 every night before bed. He gets so excited.",
      "rating": 5.0,
      "verified": true,
      "author": "AprilLee",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Dogs QUIVER in antic....pation for this treat!",
      "text": "A rarely cheap treat and my dogs QUIVER for this treat when I get it out. They love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah Sanders",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "-",
      "text": "My dogs love​ these and it may help with their teeth; however, I can see them in their poop. Once gone, I will not buy again.",
      "rating": 2.0,
      "verified": true,
      "author": "Florida customer",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Belle's Favorite",
      "text": "Belle gets three treats each day and this is her favorite. This is her morning treat and she makes the most of it. First she licks it all over and then she begins the slow and methodic chewing. She often carries it from room to room and generally makes the treat last 30 minutes or so. We ran out a few weeks ago and she was lost. She wanted no other treat in the a.m.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry Barton",
      "helpful_votes": 0,
      "publication_date": 20130114
    },
    {
      "title": "Dingos mini treats",
      "text": "These are something my dog loves - I don't know why. They smell funny (kinda bad) and don't seem to be anything special (like cheese or meat). He gets one every day - and goodness help you if you don't have one! If I am not albe to get this kind, he will accept another treat, but he lets you know it's not \"his dingo.\"",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140404
    },
    {
      "title": "GREAT ITEM",
      "text": "My puppy absolutely LOVES these. When i leave the house my puppy starts to whine. I live in an apartment complex..so this becomes a problem for the neighbors. Now i just give her one of these before i leave and she is occupied for a good 20 min (She doesn't whine when i am gone...just when she sees me leaving). I just got one package to try them out..i will definitely be buying more!",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20111117
    },
    {
      "title": "Great treat - must have",
      "text": "My dog loves them! Perfect treat - my dog is happy and it’s good for her teeth 😊",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Evans",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "My dogs do not like breath chess I will keep searching.",
      "text": "I'm sorry but my dogs would not eat them, maybe something wrong with the dogs?",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "I enjoy being able to give her something that serves as ...",
      "text": "My pup loves these. I enjoy being able to give her something that serves as a \"treat\" while still also having benefits to her teeth. Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Watson",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "Yum",
      "text": "Our golden retriever Reggie loves these. They are a good little snack and I feel like they are healthier than other snacks.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy C. Bonzo",
      "helpful_votes": 0,
      "publication_date": 20170510
    },
    {
      "title": "Dog likes the twist sticks better, but these would be okay for most dogs",
      "text": "Our dog didn't prefer these over some of the other Dingo treats. She prefers the twist sticks.",
      "rating": 4.0,
      "verified": true,
      "author": "cctyger",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Price and quality is spot on!",
      "text": "My dogs love these treats. They come running when I open the treat container. They do a good job on their teeth too, they leave them minty fresh and clean. I don’t have to brush them every day.",
      "rating": 5.0,
      "verified": true,
      "author": "D J Web",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Dangerous treats",
      "text": "Never buying these again. They are hard as a rock and got stuck on the roof of my puppies mouth I had to pry it off. Dont trust these.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Maltese is addicted to these!",
      "text": "My little Maltese absolutely loves these treats!!! I don't even need to look at the time because he reminds me every night when it's time for one!! I've been giving these to him for years!",
      "rating": 5.0,
      "verified": true,
      "author": "AggieMom09",
      "helpful_votes": 0,
      "publication_date": 20160227
    },
    {
      "title": "Five Stars",
      "text": "My 10lb dog enjoys these BUT it does give her poop broad white stripes lol!",
      "rating": 5.0,
      "verified": true,
      "author": "Yowza",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "NOT LIKE HARTZ CHEW BONES THAT LOOK THE SAME AS ONE ANOTHER!!",
      "text": "Dog would not eat them for reasons in add a headline...",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "You have made her happy and life easier for the rest of us",
      "text": "Our Wal-Mart quit carrying these. Our Nola was not impressed. You have made her happy and life easier for the rest of us. The product arrived in a timely fashion and completely intact. Many thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "GAYLA SMITH",
      "helpful_votes": 0,
      "publication_date": 20150326
    },
    {
      "title": "Five Stars",
      "text": "Mini mutt loves these and this price beat any locally. She certainly hopes we will buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Cook",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Dog's favorite",
      "text": "My little dog goes crazy for these small dental chews. Absolutely his favorite treat.",
      "rating": 5.0,
      "verified": true,
      "author": "KBK",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "My dogs love them and their teeth look great",
      "text": "My Papillons love these. I took one to the vet recently - he is 10 1/2 years old. The vet said it looked like he just had his teeth cleaned. He has NEVER had a teeth cleaning! I am sold on these but they are becoming hard to find locally. Thanks Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "Dog Mom",
      "helpful_votes": 0,
      "publication_date": 20130918
    },
    {
      "title": "My little dog loves these treats",
      "text": "These are my dog's favorite treat. I cut them into 3 pieces as he gets one every time I leave the house.",
      "rating": 5.0,
      "verified": true,
      "author": "SSP",
      "helpful_votes": 0,
      "publication_date": 20161130
    },
    {
      "title": "ALL 4 OF MY DOGS LOVE THESE DENTA-TREATS",
      "text": "MY DOGS LOVED THESE. IT'S THE FIRST ONE THEY EVER REALLY LIKED. THANKS FOR SUCH A GREAT PRODUCT THAT ALL 4 OF MY DOGS JUST LOVE.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "Seems to work",
      "text": "I do notice less plaque in my dogs back teeth. Her poop also turns white after eating this product. It doesn't quite smell appealing at all, but my dog seems to enjoy it. Only last about 5 minutes max with my dog.",
      "rating": 4.0,
      "verified": true,
      "author": "ANG",
      "helpful_votes": 0,
      "publication_date": 20140425
    },
    {
      "title": "Rejected by My 5 Dogs",
      "text": "None of the 5 dogs in this home will eat these. They like the Dingo Dental Rawhide Chews, which is what I thought I ordered. I need to pay closer attention to what I order next time.",
      "rating": 2.0,
      "verified": true,
      "author": "Sandsong",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "Dental Treat",
      "text": "I used it for my dog. He didnt like it so I gave it away.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "My Lil Ladies Love These",
      "text": "An excellent way to keep your dog's teeth clean and healthy without messing with dangerous rawhide.",
      "rating": 5.0,
      "verified": true,
      "author": "Nelo Esteves",
      "helpful_votes": 0,
      "publication_date": 20161007
    },
    {
      "title": "Happy Dog",
      "text": "My dog is very picky about treats but he loves these.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer jojo",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "Dingo Mini Denta-Treats, 24 Pack",
      "text": "Dingo dental treats are the only ones our little Shi Tshu likes. She digests them well and they have helped to keep virtually all tartar away - plus she never has bad breath. They're great - very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori Lee",
      "helpful_votes": 6,
      "publication_date": 20140416
    },
    {
      "title": "Dingo Only",
      "text": "My pups will only eat Dingo Dental Chews! I purchased other brands for them and they wanted nothing to do with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne Sammut",
      "helpful_votes": 0,
      "publication_date": 20160726
    },
    {
      "title": "Only Treat our Dog will Eat!",
      "text": "Can't find these in the stores anymore...not around my area anyway. Our dog loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "My dog has eaten these as long as I've had ...",
      "text": "My dog has eaten these as long as I've had her (9years). She likes them and they seem to help",
      "rating": 5.0,
      "verified": true,
      "author": "Pam Hightower",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Best dental dog treats",
      "text": "My vet commented on how clean my dog's teeth were and she asked if I brushed them. No, I give her one of these Dingo Mini Denta-Treats a day and they keep her breath and teeth clean. But they're hard to find in stores so I buy them now through Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "S. E. JarvisTop Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20111106
    },
    {
      "title": "Love amazon",
      "text": "I love this product it cleans my dog's teeth beautifully and they like the chewies",
      "rating": 5.0,
      "verified": true,
      "author": "Celestia L.Messenger",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "The doggies like to chew on them and it works like a ...",
      "text": "These things work (for a short time anyway). The doggies like to chew on them and it works like a tic tac for a while. Hopefully it actually cleans the teeth. Sometime at the beginning of the year (Jan or Feb) is doggie dental month. My vet has a discount on veterinarian teeth cleaning, check it out, your's may also.",
      "rating": 5.0,
      "verified": true,
      "author": "TheManJR",
      "helpful_votes": 0,
      "publication_date": 20141120
    },
    {
      "title": "Bedtime treat !!!",
      "text": "Our dog gets one every night at bedtime and he loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "beachgal",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "but my little spaniels love them!",
      "text": "I don't know if these help with tartar, but my little spaniels love them!",
      "rating": 4.0,
      "verified": true,
      "author": "savannah",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Five Stars",
      "text": "My dog loves dingo products, not available around my area.",
      "rating": 5.0,
      "verified": true,
      "author": "karen filson",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "My dogs love it",
      "text": "These are the best dental chews... my dogs go absolutely crazy when I say \"Dingo\". Much better than the greenies and no stains left behind.",
      "rating": 5.0,
      "verified": true,
      "author": "kenia hurtado",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "Dogs Favorite Treat",
      "text": "Our dogs go crazy over these treats. It is their favorite one, probably because of the strong beefy smell.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Tone",
      "helpful_votes": 0,
      "publication_date": 20151227
    },
    {
      "title": "good",
      "text": "Small -- but all dogs like these. My little guy and the big guys. not huge, like a small/medium milkbone size.",
      "rating": 5.0,
      "verified": true,
      "author": "R BTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "K9 Loves It",
      "text": "Our 25 pounder goes through these regularly and I like the fact that there is no artificial coloring or other garbage compared to many other brands. Plus our guy's breath is acceptable and his teeth stay white.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazin' Rally",
      "helpful_votes": 0,
      "publication_date": 20140213
    },
    {
      "title": "They both have perfect set of teeth",
      "text": "This keeps my dogs' teeth clean without brushing. And they are 8 & 10 yrs old . They both have perfect set of teeth. They've been getting these since they're puppies.",
      "rating": 5.0,
      "verified": true,
      "author": "Roxy",
      "helpful_votes": 0,
      "publication_date": 20150413
    },
    {
      "title": "BUY THEM!!!!",
      "text": "My Henry loves these mini Dingo treat. I highly recommend them. Only thing, they are difficult to find in stores. So, stock up on Amazon. Thank you Amazon for carrying this product. You made me and my little boy very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry Rules",
      "helpful_votes": 0,
      "publication_date": 20130520
    },
    {
      "title": "They may be good, but my dogs got upset stomachs!",
      "text": "We tried these treats to help with plaque and tartar. I have two dogs, a Siberian Husky and a Mini Schnauzer. Their vet told us that they should both have treats for their teeth that will help with tartar. We can't really use big bones because the dogs get too aggressive with them. Treats work better. We bought these to try and they seemed okay, but the next day the dogs had very bad upset stomachs. This was the only new thing introduced to their diet so that is why I feel that it was the culprit. They may work, but for my dogs they did not work.",
      "rating": 2.0,
      "verified": true,
      "author": "LSMNC",
      "helpful_votes": 2,
      "publication_date": 20120707
    },
    {
      "title": "Five Stars",
      "text": "My dog loves these they are hard to find would definely order them again",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Jones",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "Our dogs love them. Thank you for having",
      "text": "Same order I have received for a while now. Our dogs love them. Thank you for having them",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Dingo Mini Denta Treats",
      "text": "5 stars! our doggie loves them and it keeps her teeth clean and breath fresh! even though it's a healthy snack, she thinks she's getting a special treat! thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "lori n.k. morikami",
      "helpful_votes": 0,
      "publication_date": 20140416
    },
    {
      "title": "Five Stars",
      "text": "My pupper LOVES this, only downside is they are very small.",
      "rating": 5.0,
      "verified": true,
      "author": "elleboogie",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Callie loves these!",
      "text": "My dog Callie loves these and better for her teeth.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Dental treats",
      "text": "My dogs love these and they are good for their teeth.",
      "rating": 5.0,
      "verified": true,
      "author": "barbara lavespere",
      "helpful_votes": 0,
      "publication_date": 20170627
    },
    {
      "title": "love it",
      "text": "My puppy and dog love to eat this treat. At times, they try to take each others. It's pretty funny. I know they are getting their teeth clean with this.",
      "rating": 5.0,
      "verified": true,
      "author": "ashley Baerga",
      "helpful_votes": 0,
      "publication_date": 20150915
    },
    {
      "title": "... has been using these for years they help her bad breathe and she likes the taste",
      "text": "My dog has been using these for years they help her bad breathe and she likes the taste.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Peterson",
      "helpful_votes": 0,
      "publication_date": 20151227
    },
    {
      "title": "Dog loves these!",
      "text": "Our dog is crazy about Dingo bones, only wish he could have more of them, but we are trying to keep is weight down.",
      "rating": 5.0,
      "verified": true,
      "author": "Edit maniac",
      "helpful_votes": 0,
      "publication_date": 20150816
    },
    {
      "title": "Dogs Love Them!!",
      "text": "We use these for all four dogs and they love them.....the upside is that these treats do a nice job of keeping tartar and plaque down so the dogs teeth look better and stay healthy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff D",
      "helpful_votes": 0,
      "publication_date": 20130730
    }
  ],
  "product_meta": {
    "title": "Dingo Denta Treats Teeth Whitening Mini Chews, 24 Pack",
    "description": "The Dingo brand combines powerful flavors and benefits to create bones, chews and treats that are sure to keep you and your dog wanting more. With a wide variety of shapes and flavors, there are options for any size companion. We all love puppy Kisses, but bad breath can ruin that pretty quick. Give your dog A chew that they will love, that also helps make their breath better. Tear into tartar care with this fun chew and keep freshness for the future with the resealable bag. Dingo dental chews are daily oral health chews that reduce tartar and plaque and freshen breath from the natural abrasive action of chewing. Dental chews are a good source of protein and give your pup an added source of vitamin E. These chews put a twist on the classic bone shape and are great for small or toy dogs. That's something you and your pup can smile about!",
    "rating": 4.5,
    "feature_bullets": [
      "Cleans And Strengthens Teeth To Support Overall Oral Health",
      "Chews Include Vitamin E To Help Support Healthy Gums",
      "Great Taste Your Dog Will Love, And Fully Digestible",
      "Packaging May Vary"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "9 x 6.25 x 2 inches; 7.68 Ounces",
      "Item model number": "P-28006",
      "Date First Available": "July 2, 2009",
      "Manufacturer": "Dingo",
      "ASIN": "B002FXOTOS",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Treats",
      "Dogs",
      "Pet Supplies",
      "Cookies, Biscuits & Snacks"
    ],
    "price": 3.47
  }
}