{
  "website_summaries": [
    {
      "verdict": "This thick commercial-grade pastry brush has durable nylon bristles that fit in crevices that silicone bristles can't.",
      "pros": [
        "Commercial grade",
        "Nylon bristles with plastic handle",
        "Comes in a variety of sizes",
        "Nylon bristles are more durable than natural bristles",
        "Thick, durable",
        "Applies liquid evenly"
      ],
      "cons": [
        "Cannot use to spread liquid on hot pans or bristles will melt"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Love the Nylon!",
      "text": "I LOVE this Nylon pastry brush!!! It was nearly impossible to find a pastry brush at the store that was not a crappy \"paint brush\". I don't like those kind because they fall apart & the bristles get in the food...Yuck. But this Nylon brush is perfect! No bristles in the food, and soooo easy to clean! Thanks amazon for offering NYLON brushes for cooking!",
      "rating": 5.0,
      "verified": true,
      "author": "yourmom",
      "helpful_votes": 6,
      "publication_date": 20190101
    },
    {
      "title": "Good quality, great to use",
      "text": "Great brush, seems very well made. No loose bristles. I use it mainly for oiling bread pans, and to brush my breads with oil or butter after they've baked. The brush is stiff enough to easily spread the oil or butter thinly and without making a mess as long as you don't load the brush too heavily with oil. The brush does hold a large amount so you can a get a lot of area coated with a heavy dip. It would work great for desserts like baklava that requires a large area of pastry to be buttered at one time.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 6,
      "publication_date": 20190403
    },
    {
      "title": "Not real boar hair!",
      "text": "Caution! Not real boar hair. Ours melted. The title says it’s real but in the Q&A they admit it’s not real.",
      "rating": 1.0,
      "verified": true,
      "author": "Olivia McGraw",
      "helpful_votes": 13,
      "publication_date": 20180421
    },
    {
      "title": "Just right for pastries/dough",
      "text": "I'm glad I got this, as my silicone brushes were not right for pastries since those bristles are few and thick. This brush has thin delicate bristles that work well on pastry dough.",
      "rating": 5.0,
      "verified": true,
      "author": "Saliandra",
      "helpful_votes": 5,
      "publication_date": 20181229
    },
    {
      "title": "Well made brushes",
      "text": "I ordered the 3'' and the 2'' brush. These are very nice and are well made. They are not cheap spindly made brushes. I use them to spread BBQ sauce, they did a great job. I rinsed the bristles with my sink sprayer just after spreading the sauce, they cleaned easy and still looked white. But how they would look if you let the sauce stay on for a while, who knows, they could take on the color of the sauce. No biggie, I bought them to use! Paid full price, and have no involvement with the company at all!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Shopper",
      "helpful_votes": 3,
      "publication_date": 20180423
    },
    {
      "title": "FALSE ADVERTISING - 100% synthetic",
      "text": "Forget buying 'natural boar bristle'. 100% genuine nylon polyester. But wait - maybe it came from a plastic pig!",
      "rating": 1.0,
      "verified": true,
      "author": "d mac",
      "helpful_votes": 4,
      "publication_date": 20190701
    },
    {
      "title": "It will do the job...",
      "text": "Very cheaply made, though the (plastic) bristles are soft enough to spread butter or egg over pastry....which is really all I needed. The plastic band securing the bristles to the handle isn't flush--I don't imagine it is going to stand up to many cleanings, no matter how careful I am. The handle is very pretty, and smooth--but overall I don't think it's quite worth what I paid for it.",
      "rating": 2.0,
      "verified": true,
      "author": "MLK",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Soaks a ton of sauce!",
      "text": "I didn’t think I’d love a regular brush for basting but wow, what a game changer. I used to use those silicon brushes but they don’t soak up sauce as much as these does so you end up going back and forth. The only caveat is that because it soaks up a lot, it can be hard to clean completely as it soaks a ton of sauce! This is the only think I’ll use. I wonder if they have something with a longer handle?",
      "rating": 5.0,
      "verified": true,
      "author": "Island Capture",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Not awesome",
      "text": "I read all the reviews before purchasing this and now am wondering if we are all reviewing the same brush. I am pleased that the bristles have not fallen out but I don't feel that this works very well for brushing. I've used it for brushing egg wash onto pie crust and melted butter and they don't brush on very well. Everything just clings to the bristles and doesn't release very well. I wouldn't purchase this brush again.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Nicely Made",
      "text": "There really isn't much to say about a brush, but this one is nice. It's well made and doesn't leave bristles on the food when I use it. It's been easy to clean and is easily stored. I'll be buying a second one soon to have an extra during holiday cooking and baking.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs McC",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "DO NOT BUY FOR CAKE DECORATING!",
      "text": "I bought this brush to apply gold highlighter dust on cakes, bad choice. It soaked up all of my highlighter (about $20 worth) and none of it came out when I used the brush. Where did it go? Apparently the bristles are very dense and stiff, so the gold just got caught up inside and wouldn’t come out. This is the only reason I bought this brush, so it’s dead to me. I gave it to my barbecuing husband instead. Also, ran it through the dishwasher and the bristles curled. Disappointed!",
      "rating": 2.0,
      "verified": true,
      "author": "Diane Skiff",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Good, well-made product...",
      "text": "So far so good. Looks to be well-made. I've had not bristle-loss. Bristles are soft enough to get into the crevices of pastry/meats... Also...for delicate pastry items...bristles are soft enough as to do no damage to the product...",
      "rating": 5.0,
      "verified": true,
      "author": "lordhavemercy",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Just ok. Gets the job done for now.",
      "text": "Not the best but also not the worst. I needed something that would work good on heavy bbq sauce and it does do the job but the plastic stains rather easy.",
      "rating": 3.0,
      "verified": true,
      "author": "Rachael",
      "helpful_votes": 2,
      "publication_date": 20170623
    },
    {
      "title": "Stains",
      "text": "Used it once to smear bbq sauce on ribs and now it's stained and won't come clean. Maybe that happens with all plastic brushes? It was my first one, so don't know. Super bummed.",
      "rating": 3.0,
      "verified": true,
      "author": "scubacat",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Smooth, light and easy to handle",
      "text": "I’m a restaurant’s baker and we bake 216-324 Jumbo muffins per day. The brush we had for 10 years broke and all we could find in local stores were the silicone types. This one is smooth and light, and perfect for brushing either condensed milk or key lime juice. Also, easy to wash.",
      "rating": 5.0,
      "verified": true,
      "author": "Suni Garcia",
      "helpful_votes": 2,
      "publication_date": 20190718
    },
    {
      "title": "Poor Purchase",
      "text": "Used it once to brush on brine/garnish for a smoked turkey and the charcoal never came off the brush bristles or the handle.",
      "rating": 1.0,
      "verified": true,
      "author": "Mack",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Works Well",
      "text": "Works exactly as expected. My old pastry brush died, and I replaced it with this one. It is easier to clean than my old one and works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorna Collins",
      "helpful_votes": 2,
      "publication_date": 20180318
    },
    {
      "title": "Nice brush",
      "text": "Difficult to get thoroughly clean but the bristles are nice.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Good purchase",
      "text": "Very nice for basting bread. Goes on top rack of dishwasher. Was exactly what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "wendy g",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Great little brush.",
      "text": "Great little brush for basting, spreading BBQ sauce and such. Easy to clean. Very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Nice Brush",
      "text": "It's soft, wide and brushes. Perfect for applying a soak to my cake layers.",
      "rating": 5.0,
      "verified": true,
      "author": "BabsnPA",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Great product",
      "text": "Use the brush to butter hamburger buns, it works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Kay P.",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "My favorite type of brush.",
      "text": "These are better than silicone rubber bristles, IMO. Holds more material, and is delicate enough to brush raw doughs. Great size.",
      "rating": 5.0,
      "verified": true,
      "author": "Tinkererguy",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Great",
      "text": "Just what i was looking for to spead melted butter over homemade dough.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Like the nylon bristles",
      "text": "It’s worked great for me when I’ve used it for egg washes!",
      "rating": 5.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "Five Stars",
      "text": "works great for making caramel and working with isomalt (making hard candy)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170615
    },
    {
      "title": "Much Better Than Silicone",
      "text": "I hate using and washing those goofy little silicone type basting brushes. The one that are like a paintbrush are worse; fibers come out all over and I am never quite sure the oil/grease cleans off of them. THIS one though is perfect. Washes clean, spreads oil/shortening/sauce just fine. Haven't found any stray fibers either. Finally found a good basting brush. I would tell a friend to buy this one.",
      "rating": 5.0,
      "verified": true,
      "author": "JAG",
      "helpful_votes": 4,
      "publication_date": 20180815
    },
    {
      "title": "No bristle loss after several uses. A very nice, quality brush",
      "text": "We waited until we used this a few times to review it. No bristle loss. The finish on the handle is very nice. The bristles are held into a plastic transition to the wooden handle...not a metal one. This seems to be very durable and holds the bristles in very well. It is a pleasure to use for basting and coats food evenly. I read a ton of of reviews for dozens of brushes before settling on this one. We are very pleased with it. It works so much better than any silicone brush we've tried and is by far the best natural basting/pastry brush I've ever had in my hands. My wife is just as pleased with this brush.",
      "rating": 5.0,
      "verified": true,
      "author": "DoubleA",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Natural Boar Bristle is Actually nylon filaments",
      "text": "The natural boar bristle brush is actually just nylon...might as well buy a nylon paint brush. How do I know? Natural boar bristles don't MELT. They may burn away but they won't melt. The bristles on my natural boar bristle brush MELTED under heat. Enough said.",
      "rating": 1.0,
      "verified": true,
      "author": "PJS",
      "helpful_votes": 3,
      "publication_date": 20181212
    },
    {
      "title": "Not what I expected at all",
      "text": "Bristles were coming off as soon as I received it before ever using it or washing it or anything. Also too stiff to use on pastry or for basting. Unfortunately this item isn’t eligible for return so I’m stuck with it. However I do not recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190404
    },
    {
      "title": "Works as expected!!",
      "text": "I am very happy with this purchase, the bristles do not fall out like the board hair bristles and it cleans perfectly (think olive oil) with rubbing dish soap through bristles with fingers and rinsing perfectly clean...I only hand wash mine so cant say if stays perfect if run through dishwasher",
      "rating": 5.0,
      "verified": true,
      "author": "bstn",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Great for putting butter on phyllo dough",
      "text": "I bought these to make Greek spanakopita since you need something gentle to put butter on the phyllo dough. These work great. I stick it right in the dishwasher and it cleans up great too.",
      "rating": 5.0,
      "verified": true,
      "author": "CA lady",
      "helpful_votes": 2,
      "publication_date": 20190109
    },
    {
      "title": "Great quality",
      "text": "Great value. These outlast the rest and the quality of the bristles is very important to us.",
      "rating": 5.0,
      "verified": true,
      "author": "S. D. High",
      "helpful_votes": 4,
      "publication_date": 20161219
    },
    {
      "title": "Must Test For Long Term",
      "text": "Not sure how long this one will last. Constant washing usually loosens the plastic part from the wood handle. Not this brand but had one made in China that did that. I believe this is made in Germany? Other then that it's excellent for basting anything.",
      "rating": 4.0,
      "verified": true,
      "author": "Nom De Plume",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Great!",
      "text": "These are just what I was looking for. I make a lot of rolls, pies and turnovers and these work perfect for spreading melted butter or whipped egg on to the dough.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah B.",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "This brush is perfect for use on pies and cakes",
      "text": "This brush is perfect for use on pies and cakes. I do a lot of baking and was always looking for a wider brush.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl Boll",
      "helpful_votes": 2,
      "publication_date": 20171009
    },
    {
      "title": "I cut the edges and it is fine. I will stick to using it with cool ...",
      "text": "Well made brush. I made the mistake of spreading coconut oil on a hot pan with it and this melted or singed the bristles. I cut the edges and it is fine. I will stick to using it with cool products.",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa S",
      "helpful_votes": 3,
      "publication_date": 20170726
    },
    {
      "title": "Very happy I took the chance with it",
      "text": "As a classically trained chef, I was apprehensive about using a silicone brush thinking it wouldn't work as well as a classic pastry brush, but it did just as well, and was significantly easier to clean, appears to be built to last too. Very happy I took the chance with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Zio",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Great Brush",
      "text": "I really like this pastry brush! It's the perfect size for my baking needs. It is a bit hard to clean after spreading melted butter. I just soak it well and wash it by hand with extra dish soap. I've not had any bristles fall out yet. Appears to be holding up well.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa Boyle",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Low Quality Item",
      "text": "Just received this, haven’t even taken it out of the packaging yet and I can see that the brush is not fully attached to the handle. Clearly this is of low quality and cheaply made. Sending back for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "nikahobbs",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Better than silicone",
      "text": "We use these for basting and love them. They are like the ones we use to use. They spread more evenly than the silicone ones used today. I bought 2 different sizes because we use them all of the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazoner",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "A Paintbrush",
      "text": "This 100% feels like a $2 paintbrush you bought at Walmart. The wood is not sealed and is all splintery and gets worse after each wash. Buy something else.",
      "rating": 1.0,
      "verified": true,
      "author": "KH",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Bristles tend to open up",
      "text": "After 6moths of use the bristles are already permanently deformed and will probably need to buy a new one. I will probably look at some other brands",
      "rating": 3.0,
      "verified": true,
      "author": "stefano",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Best pastry brush ever!",
      "text": "Best pastry brush ever in my opinion. Prefer to use plastic bristles when a king caramel. Haven't used any others I like nest as well. This one performs best for brushing sugar crystals down sides of pot.",
      "rating": 5.0,
      "verified": true,
      "author": "Isadora",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Purchased for my wife and it is the perfect size for her uses",
      "text": "Purchased for my wife and it is the perfect size for her uses. The bristles are sturdy and have had any fall off which is a big plus.",
      "rating": 5.0,
      "verified": true,
      "author": "RICHARD BRUMMETT",
      "helpful_votes": 3,
      "publication_date": 20170117
    },
    {
      "title": "Natural and durable",
      "text": "Good quality. Smooth handle. Mine has had minimal shedding and I use it a lot. Cleaning is what u would expect. It's never 'like new' clean but easy enough.",
      "rating": 5.0,
      "verified": true,
      "author": "ilearn",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Looking forward to using in the near future.",
      "text": "Next time I make barbeque chicken it will be so much easier with a brush.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward P. Owen",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Five Stars",
      "text": "Harder to clean than silicone but I prefer the even application of sauces/butter",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "Professional Quality Pastry Brush",
      "text": "Professional bakers quality pastry brush. The natural finished wooden handle is polished; the bristles are even and securely fastened. The exceptional quality is obvious.",
      "rating": 5.0,
      "verified": true,
      "author": "Atom Gardiner",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Wife Loves It",
      "text": "Wife bakes a lot and complained that she couldn't find a good one...this is strong, durable and she likes it.",
      "rating": 5.0,
      "verified": true,
      "author": "Stepdad12",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "This brush is perfect for applying somewhat cooled melted butter and anything that ...",
      "text": "This brush is perfect for applying somewhat cooled melted butter and anything that isn't very hot. The nylon bristles do not hold up well to hot liquids.",
      "rating": 5.0,
      "verified": true,
      "author": "C M",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Five Stars",
      "text": "Easy to hold and the bristles don't fray. Great for baking anything!",
      "rating": 5.0,
      "verified": true,
      "author": "Anne Moorer",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Feels like a quality product.",
      "text": "Feels well made, bristles don't fray like other brushes I've used.",
      "rating": 5.0,
      "verified": true,
      "author": "HoldUpWaitAMinute",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "NONE",
      "text": "I DON'T USE IT OFTEN, BUT I AM VERY SATISFIED.",
      "rating": 5.0,
      "verified": true,
      "author": "Yoshi Watanabe",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Fine product and nice price.",
      "text": "A nice little brush. I go through these with some regularity as I use them for basting meats. They seem to work a lot better than the silicone alternatives and my last one worked (before it started losing hair) was in my inventory for at least two years.",
      "rating": 4.0,
      "verified": true,
      "author": "bcrgus",
      "helpful_votes": 7,
      "publication_date": 20130221
    }
  ],
  "product_meta": {
    "title": "Royal Industries (ROY PST BR P 200) - 2\" Nylon Bristle Pastry Brush",
    "description": "Size:Nylon 2 InchesA pastry brush is a simple tool that can pay off big dividends. Just a quick brush of a butter glaze before baking will cause many pastries to bake with that golden-brown flaky crust that customers crave. To produce perfectly-glazed pastries Royal Industries recommends its 2\" nylon bristle pastry brush (ROY PST BR P 200). This pastry brush features nylon bristles which are more durable than their natural bristle counterparts. It has a plastic handle for an easy grip.",
    "rating": 4.4,
    "feature_bullets": [
      "Ship Weight: .16 lbs.",
      "Bristle Material: Nylon",
      "Handle Material: Plastic",
      "Width: 2\""
    ],
    "specifications": {
      "Product Dimensions": "8.1 x 0.6 x 2.9 inches",
      "Item Weight": "1.12 ounces",
      "Manufacturer": "food service warehouse",
      "ASIN": "B002X3KOZS",
      "Item model number": "ROY PST BR P 200",
      "Customer Reviews": "4.4 out of 5 stars171 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#34,509 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 19, 2009"
    },
    "categories": [
      "Home & Kitchen",
      "Pastry Brushes",
      "Baking Tools & Accessories",
      "Baking & Pastry Utensils",
      "Bakeware",
      "Kitchen & Dining"
    ],
    "price": 9.99
  }
}