{
  "website_summaries": [
    {
      "verdict": "A heavy-duty hand truck made of tubular steel that can carry appliances (and other loads) up to 800 pounds.",
      "pros": [
        "Raw materials are tough and made to last",
        "Includes a plastic guard to shield your appliances from scratches",
        "Great for moving belongings to a new home and other large hauls"
      ],
      "cons": [
        "It has one strap for securing purposes, which generally works well, but some would prefer a ratchet"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "like old school American made stuff",
      "text": "It's solid .like old school American made stuff. And it's still American made!! This came with a strap to secure your appliance ( or other large item). Bette than any bungee cord system. It comes with plastic/rubber bumpers, and also a dtair mechanism that look like fan belts made into tank treads. It's small lip makes it inadequate for small loads and it's really for large, heavy, and rigid items like fridges, stoves,water heaters, cast iron bath tubs. You want this for stairs!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Rick W",
      "helpful_votes": 10,
      "publication_date": 20180918
    },
    {
      "title": "Backsaver, but should be shipped with UPS, not USPS",
      "text": "This dolly is a dream come true if you're moving appliances! It came on time, was packaged fairly well, and is easy to use. My only complaint was that it was shipped through USPS! This thing is big, and the typical mail carrier is unable to deliver this into their vehicles. We had to go to the post office to pick this up. It would be more appropriate to ship with a parcel carrier, like UPS. But past that, this dolly is great and worth every penny! Buy it and save your back; and that of your friends and family, for your next move, or install of a large appliance. You won't regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean-Marie Hendricks",
      "helpful_votes": 3,
      "publication_date": 20200601
    },
    {
      "title": "It’s basic but does the job. We rarely have ...",
      "text": "It’s basic but does the job. We rarely have a call for a appliance dolly but when we did it was a huge problem. Well worth the money. Just watch where the buckle to strap is. It can position itself against your appliance and during tightening can scratch or dent your appliance.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20180321
    },
    {
      "title": "Very well made in USA and solid as a rock.",
      "text": "Have a regular Harper hand truck that is very well made and served me well for 20+ years and this new appliance dolly looks to be the same top quality and expect it will outlast me. Hard to go wrong with a Harper Trucks product and made in the USA is icing on the cake. I DO NOT work for Harper Trucks.",
      "rating": 5.0,
      "verified": true,
      "author": "Fernwood",
      "helpful_votes": 3,
      "publication_date": 20180417
    },
    {
      "title": "Rugged",
      "text": "I bought this hand truck for the sole purpose of moving a 400 pound plus entertainment cabinet to the basement., This cabinet was 4 feet wide, 2 feet deep and 6.5 feet tall. The Harper hand truck handled the job with ease. I am happy to recommend this hand truck to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl Clark",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Strong and durable",
      "text": "Was able to use it to move everything I needed it to including refrigerators, washers and dryers. I've been renting them in the past but now decided to get one of my own. After 5 moves (4 left) and I'll break even. Should be easy to do because I have friends asking for help once a year or two and this thing seems built to last.",
      "rating": 5.0,
      "verified": true,
      "author": "True2ThySelf",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Wish the bottom was bigger",
      "text": "I like that it is made in the USA. It's pretty heavy duty. I wish the bottom plate that slips under the appliance was deeper. While moving washers, driers, ovens and refrigerators it barely supports the appliance. I keep thinking the washer will fall off because it barely gets under the washers feet. Like not quite all the way on. Fortunately it has a strap to secure the load. I should have gone to Lowes and bought the Milwaukee hand truck.",
      "rating": 4.0,
      "verified": true,
      "author": "I K.",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Just ok",
      "text": "Not the quality of the U-Haul hand trucks I had read this would be. It’s solid and built to last but no place for the strap when not in use and the straps won’t stay in place on the arm when you are racheting down a load. Just ok. Almost returned it.",
      "rating": 3.0,
      "verified": true,
      "author": "Chireg",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Amazing",
      "text": "This was perfect! It was affordable, not too expensive for me. And it helped me with all of my moving needs. It made moving a breeze for me, and I could effortlessly move a bunch of boxes onto my truck that would’ve normally been way too heavy. This hand truck is a good idea, and I definitely think you should buy it. It’s sturdy just for my moving.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Tremendous tool and moving advantage.",
      "text": "Tremendous tool and moving advantage. At first my son made fun of me when he arrived to help me move to a new city. His tone changed about 20 minutes into the work when it came time to move a HEAVY piece of bedroom furniture!!! I had lots of volunteer help and I wanted the move to be as SAFE and easy as possible for them. I wanted to minimize any risk of injury to these strong, athletic (testosterone filled) young men. This is one great tool. It was cause for jokes and laughter at first, but now I'm getting requests to borrow it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 4,
      "publication_date": 20121217
    },
    {
      "title": "Well Constructed Moving Dolly",
      "text": "Purchased this Dolly to move several appliances. It is well constructed of heavy materials, with a securing strap and extra rollers that facilitate moving up and down stairs. These features allow one person to handle many appliances single handedly, although for large refrigerators or moving up and down stairs two people would be the best arrangement. Only caveats are the retaining strap has a steel buckle which could mar surfaces if not careful. And the wheels are a hard plastic type material. A softer dense wheel, or rubber tires would seem to make this roll better over concrete surfaces, but otherwise this dolly met all our expectaions.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric B. Meyer",
      "helpful_votes": 6,
      "publication_date": 20110611
    },
    {
      "title": "Good fo the Price",
      "text": "Heavy duty frame but also just heavy. Simple to use, very capable cart. Wheels are adequate but are nothing special. I bought it to have for occasional use as a home owner. Figured the cost of buying this would pay for itself in saved rental cost and convenience. I also figure this is something that once you own one you will find a use for.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Sturdy and well built.",
      "text": "This is a sturdy, well built product that functioned like expected. I purchased this for limited use. If I were to be using it on a continuous basis, I would probably want the ratchet on the strap, but for my use, the strap worked well even though it was slower than a ratchet would be. I think I made a good choice with this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Alan N",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Saves time and money",
      "text": "This truck works well. Able to go up or down steps well. The strap is heavy duty! It's a life saver. It turned my two-man job into a one-man job.",
      "rating": 5.0,
      "verified": true,
      "author": "James Greene",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "good",
      "text": "Good though maybe I don't know how to use it perfectly with one washing machine the strap seemed to actually bend the metal...",
      "rating": 5.0,
      "verified": true,
      "author": "roger",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "It works very well, worked help a lot.",
      "text": "Only thing I wish this item had were the back wheels that drop down once you have whatever your moving on the dolly, so you do not have to hold the weight, the back wheels would take the weight.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott W.",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Rock Solid Mover",
      "text": "I ordered this appliance dolly to remove my washer and dryer from the laundry room so I can lay tile. It's exactly what I needed, it's exactly what I ordered, it's perfect & it's mine for life.",
      "rating": 5.0,
      "verified": true,
      "author": "Venia",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Quality!",
      "text": "I move a lot of people through my Church and this unit holds up as same as any we could rent.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Hendricks",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "This is a nice heavy duty moving dollie and we're happy we got it.",
      "text": "We bought this dolly to move heavy items like furniture, appliances etc. It shipped to us really fast and it definitely is everything as described. We're happy with our purchase and the price was right.",
      "rating": 5.0,
      "verified": true,
      "author": "Interesting...",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Recommended",
      "text": "Worked great so far, it’s heavy duty, durable but also not the easiest to maneuver around. Only minor complaint is I wish there was some way to store or wrap up the straps better when not in use.",
      "rating": 5.0,
      "verified": true,
      "author": "Landon",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "U-HAUL",
      "text": "If U-Haul uses these, what better recommendation can you get?",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Works great go  USA!!",
      "text": "Never know when you have to move an appliance,and boy do these help!!Big thing made in USA!!",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Roberti",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Sturdy enough to move a safe.",
      "text": "Used to move a 750 lb safe and it did the job just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul C. Woods",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Five Stars",
      "text": "Saves your back and is well built. Looking forward to years of service from it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce A. Rahn",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Very durable",
      "text": "Have been getting lots of use out of this. I helped my friend move and now I am moving.",
      "rating": 5.0,
      "verified": true,
      "author": "James Sheffield",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Even though its an older version, IT STILL WORKS!",
      "text": "I ordered this for my father for Christmas (he asked for it, I did not come up with this rather weird Christmas gift on my own) and he loves it! Says it all works how it is supposed to even if its the \"older version\"",
      "rating": 5.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Safe and strong. Great down steps.",
      "text": "We moved a household with this and it made it so much easier.",
      "rating": 5.0,
      "verified": true,
      "author": "M. G. B.",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Used item sold as new",
      "text": "Did not expect t to be buying a used product at the regular price.",
      "rating": 1.0,
      "verified": true,
      "author": "Concerned",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Exactly as described",
      "text": "Exactly as described arrived exactly when they said it would",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Gerber",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Five Stars",
      "text": "It is what they say it is. Well built would buy again Joè",
      "rating": 5.0,
      "verified": true,
      "author": "JOSEPH S.",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Five Stars",
      "text": "I moved a few appliances with it’s been working great",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Ease of use.",
      "text": "This thing is made right here in the USA! Works great, easy to use. A+",
      "rating": 5.0,
      "verified": true,
      "author": "John M  Tanner",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "5 years later they are still working great.",
      "text": "Bought for a client in an emergency situation. 5 years later they are still working great.",
      "rating": 5.0,
      "verified": true,
      "author": "travelbug",
      "helpful_votes": 2,
      "publication_date": 20160211
    },
    {
      "title": "Heavy Duty Appliance Cart.",
      "text": "We were moving and bought this cart to move some very heavy furniture. We were not disappointed. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "I finally own one !!",
      "text": "I've had to rent these units in the past, and they work great. The rental company in my area uses the same style. I'm in a rural area, so for me to have to drive back and forth to rent one was getting expensive. It's a great, well made unit. You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan J. Wisthoff",
      "helpful_votes": 0,
      "publication_date": 20120415
    },
    {
      "title": "Great solid product.",
      "text": "This is the real deal at a crazy good price. My back and hands thank you!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jake Munsell",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Great dolly!",
      "text": "Makes quick work of moving appliances up and down stairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Great Dolly",
      "text": "Sturdy, well built and the stair climbers work well. I've used it to move three heavy steel cabinets down 14 steps and around a landing area. It made the work simpler, easier, and safer.",
      "rating": 5.0,
      "verified": true,
      "author": "VelocityTop Contributor: Camping",
      "helpful_votes": 3,
      "publication_date": 20130625
    },
    {
      "title": "Four Stars",
      "text": "works great but the strap is too short for modern fridges",
      "rating": 4.0,
      "verified": true,
      "author": "Dana Boelz",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "really good deal.",
      "text": "Best tool i have. It makes my job so much easier. I am an HVAC installer so i move a lot of differient equipment up and down stairs so this dolly makes my job so much easier. very easy to handle.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert l brody",
      "helpful_votes": 3,
      "publication_date": 20120210
    },
    {
      "title": "Moved furniture and an 800lb safe",
      "text": "I used this dolly to move an entire apartment full of furniture down a staircase. It was excellent for 2 large desks, 2 large dressers, and even an 800lb safe that was taller and wider than the dolly. I moved it down two sets of stairs with 5 guys. The dolly didn't have any problems handling the safe and I am about to use it on a washer and dryer. This thing is built tough! No bends or weld breaks. It was even left strapped to the safe in the back of a trailer while moving it. The safe rested on top of the dolly during the trip.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 5,
      "publication_date": 20120121
    },
    {
      "title": "Good",
      "text": "I have used this multiple times to move furniture and appliances that i have bought and sold. It made it a lot easier than it was when I moved the appliances the first time without it.",
      "rating": 5.0,
      "verified": true,
      "author": "nick m",
      "helpful_votes": 0,
      "publication_date": 20130927
    },
    {
      "title": "Harper hand trucks",
      "text": "This is an excellent product. It is also has a very good price which makes having it at my residence and not using all the time worthwhile.",
      "rating": 5.0,
      "verified": true,
      "author": "Virginia Squire",
      "helpful_votes": 0,
      "publication_date": 20130307
    },
    {
      "title": "well made great price",
      "text": "bought this for moving into my new house. this is just as advertised and a quality product. stair climbers work well and this handled a couple of things for me that were heavier than it's rating. MUCH higher quality than the harbor freight dolly i had originally planned to buy and made in the USA.",
      "rating": 5.0,
      "verified": true,
      "author": "M Harrell",
      "helpful_votes": 6,
      "publication_date": 20120225
    },
    {
      "title": "Appliance Dolly",
      "text": "Item arrived in a timely manner and in great condition. It needs to have bigger tires, and it would help if the tires were larger so it would roll over things easier. Good if you are looking for a cheap dolly for occasional moving, but if you are doing major moving, go for the larger inflatable tires...",
      "rating": 3.0,
      "verified": true,
      "author": "Barbra",
      "helpful_votes": 3,
      "publication_date": 20110316
    },
    {
      "title": "Durable, well made, no complaints!",
      "text": "I bought this dolly to move around a couple of water heaters (new and old as I was replacing my old unit). Worked great, and I've used it for several jobs since. This definitely makes it easy to move large heavy appliances and similar items that I would never be able to move by myself otherwise. Strapping mechanism is easy to use and effective.",
      "rating": 5.0,
      "verified": true,
      "author": "Luke Fowler",
      "helpful_votes": 2,
      "publication_date": 20110729
    },
    {
      "title": "Heavy duty hauler!",
      "text": "this dolly can haul it all! don't let the depth of the lip deceive you with the straps you can haul almost anything you can fit the strap around. has stair tracks or stair climbers so you can haul the heavy loads up or down stairs. great for an all purpose heavy duty as well as an appliance dolly!",
      "rating": 5.0,
      "verified": true,
      "author": "Marvin",
      "helpful_votes": 4,
      "publication_date": 20110703
    },
    {
      "title": "very useful dolly truck",
      "text": "This is basically the same as the the one I used to rent. Now I'm confident that I can move anything that I would have around the house without running out to the rental center.",
      "rating": 5.0,
      "verified": true,
      "author": "ricpaq",
      "helpful_votes": 0,
      "publication_date": 20140414
    },
    {
      "title": "GET IT!",
      "text": "Strong and easy to maneuver with heavy appliances, best of all MADE IN THE USA.....GET IT...you will be glad to have it around without waiting to borrow someones or going to pay a rental fee. (besides having to return them when done)",
      "rating": 5.0,
      "verified": true,
      "author": "AMD",
      "helpful_votes": 5,
      "publication_date": 20110829
    },
    {
      "title": "Made moving easy!",
      "text": "The Appliance Dolly worked perfectly for helping us to move heavy items such as our washer and dryer as well as our freezer. I was very pleased with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Lily",
      "helpful_votes": 0,
      "publication_date": 20110721
    },
    {
      "title": "love it!",
      "text": "love it! saves me time and money! no more fees when i move, and no more waiting for someone to help me move the heavy stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "eli",
      "helpful_votes": 0,
      "publication_date": 20130521
    },
    {
      "title": "Harper Appliance Truck",
      "text": "Not a top quality dolly that would hold up to everyday commercial use, but priced right and of sufficient quality for homeowner or occasional contractor use. Much better than struggling with a traditional hand truck.",
      "rating": 4.0,
      "verified": true,
      "author": "TomTop Contributor: Photography",
      "helpful_votes": 3,
      "publication_date": 20111206
    },
    {
      "title": "QUALITY PEICE OF HARDWARE!",
      "text": "LOVE IT. I've got a small moving company and since I bout this it has saved me a lot of time! I've had it for over a month and can tell this is a quality peice of hardware!",
      "rating": 5.0,
      "verified": true,
      "author": "steven rosas",
      "helpful_votes": 0,
      "publication_date": 20140605
    },
    {
      "title": "good job",
      "text": "Christmas gift......came on time...good price. Kids used it to move......I like getting the bonus points, too. They help on the price. Good job",
      "rating": 5.0,
      "verified": true,
      "author": "joyce",
      "helpful_votes": 0,
      "publication_date": 20130518
    },
    {
      "title": "a good appliance hand truck is invaluable",
      "text": "Does what is intended. I have used this twice, once to move a woodburning stove and once a fairly heavy and unwieldy box from an Amazon purchase. If you've ever had to move a heavy (withing weight limits) or difficult to move item (especially alone/without help), a good appliance hand truck is invaluable.",
      "rating": 5.0,
      "verified": true,
      "author": "Meat Brockwurst",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Made in the U.S.A.",
      "text": "Need I say more? A great product made in the United States Of America. Had a breakdown and new parts were sent out the next day at no cost to me. Thanks!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Pettit",
      "helpful_votes": 3,
      "publication_date": 20130211
    },
    {
      "title": "Fantastic appliance cart!",
      "text": "This arrived on time and super well wrapped!! I got a bonus two wheel truck as well, without any fanfare at all, they included it with my order! Great product, as advertised and a super value as far as price!",
      "rating": 5.0,
      "verified": true,
      "author": "boxer lover",
      "helpful_votes": 0,
      "publication_date": 20120709
    },
    {
      "title": "DHill1616",
      "text": "This was a great product and I would recommend it to a friend. It is of excellent quality and I would recommend it to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "DHill1616",
      "helpful_votes": 0,
      "publication_date": 20130216
    },
    {
      "title": "Not all that pain to return",
      "text": "I bought this thing to move pro audio speakers but going up the stairs is only a slight improvement",
      "rating": 1.0,
      "verified": true,
      "author": "DJ2BIG",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Did not come with directions for the strapping part I ...",
      "text": "Did not come with directions for the strapping part I am a senior and do not know how to use this",
      "rating": 3.0,
      "verified": true,
      "author": "Lin . Southern CA",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Very effective and easy to pull",
      "text": "This trolley is very easy to pull - I pulled a large dresser we'd ordered up the stairs by myself. The only issue I have is that the strap is not easy to put around objects that are less than 4ft high. The trolley is unusable without using the strap.",
      "rating": 4.0,
      "verified": true,
      "author": "Deepika Mahajan",
      "helpful_votes": 7,
      "publication_date": 20111111
    },
    {
      "title": "broke 1st time used",
      "text": "We bought a house and used this to move our refrigerator to the basement and it broke getting the refrigerator out of the uhaul. Very disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20130712
    }
  ],
  "product_meta": {
    "title": "Harper Trucks 6781 Harper Appliance Hand Truck, Dark Green",
    "description": "Harper has built a great steel appliance truck at an affordable price. 800 lb capacity with tough rubber wheels. Single strap holds the appliance or load to the frame for stability. Stair climbers help the ups and downs! 14 gauge tubular steel frame with robotic welds. 800 lb load capacity. Offset belt tightener with 2-piece polyester belt. Built-in stair climbers with high quality nylon belts. 6 x 2 inch rubber wheels. Non-marking vinyl facing to protect appliances. Wheel Type: Hard Core, Soft Tread, Base Plate: 4′ X 24′, Product Class: I65\n\nFROM THE MANUFACTURER\nHarper trucks, 6781, 800-Pound capacity appliance dolly designed to move large household appliances. Noted for quality, Harper hand trucks have become an industry accepted standard. Raw materials, design, manufacturing and finishing methods are carefully combined to provide units with maximum strength and service. all Harper hand trucks are completely manufactured and finished in Wichita, Kansas in the United States.",
    "rating": 4.6,
    "feature_bullets": [
      "800-Pound capacity",
      "Offset tightener with 2-Piece poly belt",
      "Glass filled belted stair climber for easy movement up and down stairs",
      "3/4-Inch axle for additional strength",
      "Made in the USA"
    ],
    "specifications": {
      "Manufacturer": "Harper Trucks",
      "Part Number": "6781",
      "Item Weight": "38.5 pounds",
      "Product Dimensions": "60 x 24 x 11 inches",
      "Item model number": "6781",
      "Is Discontinued By Manufacturer": "No",
      "Size": "Full Size",
      "Color": "Dark Green",
      "Style": "Solid Rubber Tire",
      "Material": "Steel",
      "Item Package Quantity": "1",
      "Included Components": "Wheels, Stair Crawlers and straps",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B0026WG51S",
      "Customer Reviews": "4.6 out of 5 stars197 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#11,720 in Industrial & Scientific",
      "Date First Available": "April 18, 2009"
    },
    "categories": [
      "Industrial & Scientific",
      "Material Transport Equipment",
      "Tools & Home Improvement",
      "Hand Trucks",
      "Material Handling Products"
    ],
    "price": 159.64
  }
}