{
  "website_summaries": [
    {
      "verdict": "Great as a trailer but a meh stroller, this Schwinn noses out the competition with easy assembly, solid construction and excellent overall value.",
      "pros": [
        "This Trailblazer bike trailer is rugged yet lightweight and maneuverable",
        "Tool-free assembly is a snap",
        "It's easy for kids to get in, strap in, and off you go",
        "Durable chassis = smooth ride"
      ],
      "cons": [
        "Wobbly front wheel in stroller mode",
        "Iffy ventilation",
        "Larger bike helmets force kids' heads forward awkwardly"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great product. We have currently only used only the ...",
      "text": "WOW is all I can say!!! Great product. We have currently only used only the stroller version to this and it has gone everywhere from our nightly walks through the neighborhood to a trip to Disneyworld. Build very well and our girls love it. They can't wait for us to hook it up to the bike.",
      "rating": 5.0,
      "verified": true,
      "author": "HPeluso",
      "helpful_votes": 46,
      "publication_date": 20160510
    },
    {
      "title": "Little one gets a collection of road debris.",
      "text": "I love the ease of assembly, hooking the tag a long to my bike and the safety features for my little one. The only complaint I have is the amount of road dirt that is collected on a short ride. I understand how this is possible with the carrier being so close to my bike tire. I am reinforcing the netting with a mosquito net that will be sewn over the existing net to help catch some of the road debris. Other than that we love the product!",
      "rating": 3.0,
      "verified": true,
      "author": "Zach",
      "helpful_votes": 9,
      "publication_date": 20180929
    },
    {
      "title": "Bicycle attach fitting designed for 1970s era bikes",
      "text": "The product itself appears fine, but it’s of no use unless you can attach it to your bike. That’s the problem. I will say categorically that the attachment fitting will not work with ANY bike that has hydraulic brakes and probably won’t work with many bikes made in the 21st century. It will not work on either of my bikes, one a hybrid Cannondale purchased in 2013 and the other a Cannondale street bike purchased last year. I have investigated alternative solutions to make it work including longer bolts and different washers - nothing doing. The fitting concept needs to be thoroughly re-thought and redesigned for modern bikes.",
      "rating": 1.0,
      "verified": true,
      "author": "Brien A.",
      "helpful_votes": 4,
      "publication_date": 20200403
    },
    {
      "title": "Just buy it!",
      "text": "I researched, read every review on every type of bicycle trailer, went to several bike shops in my area and finally bit the bullet and decided on this trailer. I didn’t want to shell out $400 on a trailer that would only get used from time to time then stored in the garage somewhere. This trailer Was perfect! I was actually able to very easily set this up myself in 20mins, it hooked on the bike very easily and very sturdy on the road! Great buy! I don’t regret this purchase at all! So my advise...JUST BUY IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Honest Sparrow",
      "helpful_votes": 8,
      "publication_date": 20180501
    },
    {
      "title": "I really like this as a jogger but not as a stroller",
      "text": "I really like this as a bike trailer but not as a stroller. I much prefer the schwinn turismo as a stroller. Its lighter and rolls over bumps easier. The front wheel that comes with the trailer is just so-so. Its a hard city stroller type wheel. Other than that we enjoy cruising around in it. The seats are much much better than the ones in the pacific cycle and current schwinn trailers made. This has a padded cushion and better construction. We also enjoy the water bottle holder and zippered compartment along the handles. Plenty of spots to put water for our long bike rides with my 5 kids! =)",
      "rating": 4.0,
      "verified": true,
      "author": "Betsy",
      "helpful_votes": 11,
      "publication_date": 20160718
    },
    {
      "title": "We love it! But toddlers are sneaky!! Watch closely!",
      "text": "We love this bike trailer. From our research this was definitely the safer option for bike riding with the little one so we went with it. My only complaint has nothing to do with the bike trailer itself, but my 22-month old can lean forward and easily get the Velcro to come undone, even when it's buttoned on the sides. She'll throw her shows out of it. Of course we've remedied this by just placing her shoes in the back. But ugh...it drove me nuts at first. I know she'll grow out it. Anyway, we love it and all the room it has. We put her beach toys and a blanket in the back and just go! It's awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "charlestontracy",
      "helpful_votes": 6,
      "publication_date": 20180806
    },
    {
      "title": "Fabulous!!!",
      "text": "I love this! I have used it as both a stroller and a bike trailer for my 40lb autistic girl and I can say it’s fabulous! My 8 year old even rides in it sometime although her head touches the top her feet have plenty of room! This is great for tall kids! My 3 year old is as tall as the average 5 year old and has plenty of room to grow into this! I highly recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Christina Epps",
      "helpful_votes": 5,
      "publication_date": 20190620
    },
    {
      "title": "Great trailer/stroller",
      "text": "Super happy with the purchase. I’ve used it for trips to market and to local hiking trails. The kids are happy (but a bit squished) and the big wheels means a smooth ride. I at first was worried by the weight but it is super smooth to pull (depending on the road). I have had no issues with the modest hills in my area. This really works well The kids love it so much they even make me take them in it for our evening jogs. It’s not the best jogging stroller but more then adequate for sidewalks.",
      "rating": 5.0,
      "verified": true,
      "author": "elizabeth deutsch",
      "helpful_votes": 5,
      "publication_date": 20180903
    },
    {
      "title": "Not a great bike trailer.",
      "text": "I wish I could give this a better review but sadly I cannot. I purchased this in March and started using it in May, and already one of the wheels is really wobbly, a snap has broken off, and the fabric is beginning to rip. I have taken care to be gentle with this but it’s just not holding up. $200 for 2 months of use is just not worth it. I wish I’d spent the money and gone with something of higher quality. I should specify that I use it as a bike trailer and not a stroller.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily Smith",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Holds up!",
      "text": "Great quality, easy assemble, kids love it. My 2 and 4 year olds fit together comfortably. You can switch seatbelts around so one child can sit in the middle. We haven’t needed to replace the wheels so far!",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey K",
      "helpful_votes": 4,
      "publication_date": 20181115
    },
    {
      "title": "Great stroller and bike trailer!!",
      "text": "My only complaint is how wide it is—I have to fold it up to get in and out the house. But it’s fairly simple to put together and folding and opening its much of a hassle either. Well made. Kids love it. It’s really a great stroller also and we’ve probably used it as a stroller now more than a trailer—and we have other strollers but this one is very easy to maneuver and great for walks through the neighborhood.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "This is a great product. I purchased it to take my 3 ...",
      "text": "This is a great product. I purchased it to take my 3 year old out on trips and latter include her brother when he is old enough. She is in th 99% for height and has a little trouble getting into the seat with her helmet but once she is in the seat has plenty of head room. It was easy to assemble is easy to connect/disconnect from by bike. Packs up quickly and the jogger portion works better than our current one person jogger. I have only been on four 30 min plus rides and will update this review if anything goes wrong. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Andrews",
      "helpful_votes": 2,
      "publication_date": 20180526
    },
    {
      "title": "Just buy it!!! This is the best one!!!",
      "text": "I cannot even explain how happy I am I purchased this! Originally I made a mistake because I bought the two seater and not the single. Let me tell you it was worth the extra. The extra space is perfect for packing a day out on the lake or a picnic. Endless possibilities. So easy to fold and unfold. Fits in the trunk of my Toyota Camry with enough room to pack for a week camp trip! We use this for the bike for walks, hikes, days out at the lake, picnic by the river.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Powers",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Stoller and Bike Trailer",
      "text": "We use this as both a jogging stroller and bike trailer. Love how quickly you can change between the two and how quickly it comes apart from the bike. The handle bar is a little shaky when using as a stroller, but love the lower center of gravity, it does not feel like it will tip as easily as my BOB. My tall 5 year old fits well in it with my average sized 2 year old. I don't love the drink holder, but you could easily switch that out with a different one. It folds down pretty easily and stores well, although a little heavy to lift into the trunk.",
      "rating": 4.0,
      "verified": true,
      "author": "Cynthia S",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Easy to put together. Kid's haven't grumped but look squished.",
      "text": "I love how easy it is to use and assemble. It has decent storage. Easy to take on and off my bike and doesn't hamper my maneuverability. I feel like the kids are squished though. I have a 18m and 3.5yr old and they look very much in each others space and butt shoulders. They haven't grumped but both my kids are big for their age and I'm concerned about them out growing it before my eldest learns to ride a proper bike. There is also straps for the middle so if there is only one child in the trailer you don't have to pick what side, they can sit in the middle.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Good trailer, one major flaw.",
      "text": "This is a great little trailer. It doesn't exactly fit on my Schwinn Discover Hybrid bike, but we made modifications to make it work anyway... 4 stars only because the floor of the trailer is cloth. It seems like it should have something hard for the kids to put their feet on. It rubs against the ground if we go over a bump, and I worry that it will wear a hole through the nylon cloth floor.",
      "rating": 4.0,
      "verified": true,
      "author": "Busy Mom",
      "helpful_votes": 10,
      "publication_date": 20150815
    },
    {
      "title": "Not worth the money",
      "text": "We are mainly using this as a stroller for my two kiddos. I am not as please with this product as I was expecting to be. It was cumbersome to put together, the handle bar is awkward and is attached weirdly, the whole bike trailer piece has to be attached for it to be a stroller which is crazy long and it doesn’t fit through standard doorways. It does push easily and is lightweight. However, it does not go up and down stairs easily at all. I have three porch steps as even without the kids the back piece gets stuck on each stair which is very frustrating. Wouldn’t buy again.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Great quality bike trailer",
      "text": "Really great quality, easy to put together and collapse. Love the bug shield protection and that it hooks up so it's easy to get kiddos in and out. Also the zip on and off rain protection will be fantastic this winter. Front stroller wheel easy to take on and off. Only things I wish it had were cup holders for the kids inside. And that the back pocket was bigger. Otherwise it rides smooth, comfy cushioned seat for kids quality 5 point connection harnesses. Also has harness setup so you can ride with one kid in the middle to keep weight even. Look forward to using this this summer",
      "rating": 5.0,
      "verified": true,
      "author": "eleah.k.howard",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Awesome bike trailer!",
      "text": "My kids love this and so do I. I can fit both kids in here and connect it to my bike or push them around the park or zoo. I would definitely recommend this. The only drawback is the price; however, when comparing to some of the others (especially the ones that do not have the braking system) it's kind of worth it for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexander Chimon",
      "helpful_votes": 5,
      "publication_date": 20170529
    },
    {
      "title": "Too hot",
      "text": "Not enough ventilation, there isn't an air pocket in the back and my boys heat up too fast in this. We still use it regularly because it was expensive, but if I could buy a similar product, I'd look for one with more ventilation. I think their older models used to vent. I was disappointed to find this one didn't. Pro--it keeps the kids really warm, so it's perfect for snow or rainy weather -- con is that I live in Texas It really is made with good quality material and it's easy to use and switch for running or pulling with a bike. It's not a terrible product, but it could use some improvement.",
      "rating": 3.0,
      "verified": true,
      "author": "J Caceres",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Lacking quality for price.",
      "text": "The bike trailer rides great when attached to the bike. We really liked the option to use it as a stroller but have found that the front wheel is getting loose and are fearful it will break soon. The rubber on the handle has also already split on the end. We are very careful with the stroller and it is always stored inside and transported carefully. Overall it is a good product but not as good of quality as I expected for the price. (We also had to send the first one we received back because the stitching was coming apart.)",
      "rating": 3.0,
      "verified": true,
      "author": "Zachary Smith",
      "helpful_votes": 2,
      "publication_date": 20180825
    },
    {
      "title": "Junk",
      "text": "The seat is very upright, making it hard for the child to sit with a helmet on. Instead the upright seat forces his head down when he wears a helmet. Within two weeks the seem broke that holds the flag in place. After 11 months of fair use with only one child the entire bottom is ripping away and the trunk area is now useless. The wheels were out of true from the box. I called Pacific Cycle, these items are not covered by their warranty.",
      "rating": 1.0,
      "verified": true,
      "author": "L. Rockafellow",
      "helpful_votes": 8,
      "publication_date": 20161111
    },
    {
      "title": "My sister has this same one and the wheel looks funny on hers after owning it for only a year",
      "text": "first one came to my door and the handle was ripped. Was a HUGE hassle to try and get them to take care of the problem. It's a part of the frame so they sent me another one. The wheel was bent on the new one. My sister has this same one and the wheel looks funny on hers after owning it for only a year. Very functional though. And I love the top that comes down. Wish the defects weren't an issue. Still waiting for a response for the damaged wheel (that i assumed happened during shipping?)",
      "rating": 3.0,
      "verified": true,
      "author": "Emily Long",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Great trailer",
      "text": "I needed a trailer that will easily and comfortably fit my 4yo and 18mo to go biking and I'm glad I chose this trailer. The seat is supported and cushioned, kids sit comfortably on their sides and not fall into the middle. Love how easily it switched between trailer and stroller. Fold the lever that attaches to the bike underneath the trailer and pup the front wheel into it's place and with a push of a button take the front wheel out. It is bulky but if need to transport in a car it fits easily in a mid size SUV, folded with all 3 wheels off,",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Good buy !",
      "text": "So far so good we have only used it a total of 3 times now but i dont see any issues with this product my little girl loved it and now we can all go on bike rides again. it did really well in the cold and on one really windy day as well assembly was simple we have no complaints hopefully it holds up wed love to have it for years to come !",
      "rating": 5.0,
      "verified": true,
      "author": "gabriela",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Good Purchase for Bike-Riding Family",
      "text": "We are glad that we purchased this bike trailer. Our little one loves it and now my husband and I are able to take bike rides and bring our little one along. It is probably big enough for two, but for us we have our 2 year old and her toy dog Rudy inside. It was easy to connect to my husband's bike and he claims that it is light weight and he doesn't really feel that weight of the trailer at all. We have used them at least weekly since we brought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tjones",
      "helpful_votes": 2,
      "publication_date": 20171021
    },
    {
      "title": "Love this trailer",
      "text": "Love this trailer! Easy to pull. Hooked right up to my Schwinn bicycle. The straps are so adjustable that my 8 month old sits secure. I do use a portable fan clipped to the front for additional airflow since it has been extremely hot this summer. My baby loves going for rides and stairs out the little windows while I get a workout in. The tires are large and the trailer is responsive to my movements.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Researched for days, happy this was my choice.",
      "text": "This is the perfect combination of features, quality, looks, and comfort for my toddler at this price point. Easy to assemble and pulls easily. Was going to get a used one to save money but most were black or dark blue and for the summer sun, I wanted something yellow or red for visibility and heat absorption. New it is. Totally happy with the purchase and with another on the way, having 2 seats and ability to use as stroller makes this perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "HD Hockey Guy",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Great, even for a novice and 2 kids.",
      "text": "I haven't ridden a bike in nearly 20 years. But I bought a nice Liv by Giant 8-speed bike and this trailer... Put my 2 little kids in the trailer and off we went! My 5 year old is 45\" tall and 37 pounds. My baby is 15 pounds. The kids didn't taco into each other whatsoever. And they both fit quite comfortably! The trailer is very easy to assemble, attach to the bike and tow! I am so excited about this purchase and def recommend this trailer.",
      "rating": 5.0,
      "verified": true,
      "author": "AC",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Nice Trailer",
      "text": "Marked down a star, because the cushion on the seat is not the greatest (thickest). I believe my daughter doesn't enjoy it passed a certain point because of the comfort of the seat. After about 20 minutes my daughter is ready to get out. Makes for a horrible day when you are 20-40 minutes, by bike, from the house. It wasn't until I started looking closer at why she wasn't enjoying it that I realized it might be the seat. I will probably make-shift a memory foam cushion to see if this helps out with her experience. Still love the trailer though.",
      "rating": 4.0,
      "verified": true,
      "author": "Haden",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Best Function for Your Money",
      "text": "My little nugget loves this thing and so do I. I like that it seats one centered or two side-by-side. I like that it comes with the jogging stroller parts. I like that the wheels are metal with rubber tires (not plastic/foam like some other models). It’s lightweight and very easy to attach/detach. For the money it can’t be beat.",
      "rating": 5.0,
      "verified": true,
      "author": "aubieangel",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Great trailer",
      "text": "Did a lot of research and picked up this one due to hitting the sweet spot of features, and price. My 2yo loves to ride in it and it has enough extra storage to accommodate all of his toddler paraphernalia as well whatever else we have needed to carry. We have even ridden to the grocery store and had enough room for groceries. It folds up for easy storage, and feels well made. We have taken it on everything from paved bike paths to pretty rough dirt trails and it handles well. Do yourself a favor and save some money by getting this instead of a Burley.",
      "rating": 5.0,
      "verified": true,
      "author": "Geoff H.",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Easy to use and very reliable.",
      "text": "We ordered it and got it just in time for a trip. I put it together following the pretty solid instructions and took it back down to make sure I was good to go for the trip. It was very simple and it packed up really nicely to fit our other luggage in with. We put it in first since it laid so slim and we set everything else on top. The D ring attachments are a bit stiff and take a little extra hand strength, but that’s absolutely needed to keep the little ones safe.",
      "rating": 5.0,
      "verified": true,
      "author": "GCarroll",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Best thing ever",
      "text": "Best thing ever! Love that I can use it for when we go to Disneyland, it packs easily in the trunk of my Honda Civic and is easy to pop on the wheels and go whenever I need to get going. Also, love the fact that you can use it as a bike trailer also! Great choice for use as a double stroller. We go out frequently with both our grandsons 4 & 2 and they both fit in it and they love it. Great purchase, would recommend to anyone that is looking for a multi function safe way to travel with little ones and comfortable for them to boot.",
      "rating": 5.0,
      "verified": true,
      "author": "Nury Rodriguez del Rey",
      "helpful_votes": 0,
      "publication_date": 20170321
    },
    {
      "title": "Will easily fit 2 kids",
      "text": "This is so awesome! We fit both of our kids in it and use it all the time! When we ride on dirt roads, we just zip up the mosquito net or plastic net so the kids don’t get sand in their eyes and they absolutely love it! It’s sturdy and it cleans so easily! And the colors are nice and keep it very visible without being tacky. Love this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Shopaholic",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Light & easy to assemble",
      "text": "Light & easy to assemble. My daughter loves it I just wish it side some type of shade panel. There’s very little shade front the hot sun. I had to use a lightweight blanket on top to shade from sun",
      "rating": 4.0,
      "verified": true,
      "author": "Alejandra",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Perfect!",
      "text": "This is a must have for any parent looking to take their toddlers along on bike rides. It's incredibly easy to assemble (there's actually minimal assembly), it's super easy to attach to the bike, and it collapses quite nicely for storage and transport. It's really well made. Worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Perfect for outdoor adventures",
      "text": "We love this my son and daughter 1 and 3 fit comfortably. I love the bug net. We used it camping and biking through national parks and it was perfect. Can't wait for the for the snow to melt so we can pull it out for the summer. It's a little wide for traveling on planes and Disneyland.",
      "rating": 5.0,
      "verified": true,
      "author": "Mariah",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Love it, affordable, dual usage ( stroller and trailer)",
      "text": "I love this trailer. I owned a Burley Bee before, although the material and the frame is of better quality, it does not have stroller option. This Schwinn one offers both; thus, I can use in more occasions ons. Kids love it, too. Just wish it is less steps to do when I want to collapse and store it. Burlee Bee one is easier in the storage aspect. Overall, Schwinn trailer offers better value given the fact that the price tag is much more affordable.",
      "rating": 5.0,
      "verified": true,
      "author": "HN",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Missing essential part. Good product. Bad service.",
      "text": "This item arrived without the essential parts to assemble it. I have been waiting two weeks and they finally shipped another frame out to me which I did not need and it still didn’t contain the 2 dollar part I need to assemble the brake. Also the foam handle has ripped within 5 uses. It rides great and the tires are nice but there are definitely flaws. The service of this company has been poor. They are unable to understand simple requests and I am still without a parking brake for this product.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephen",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Quality product",
      "text": "We Love this bike trailer!! My daughter is 3, about 31lbs and 36 inches tall andbshe fits just fine in the single rider trailer. The five point restraint keeps her locked in. And the ner in the front flips back easily and stays so she can get more air. Works good for blacktop or grassy trail. We are very pleased with Schwinns quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Only have used it as a stroller so far",
      "text": "Love how the top retracts like a stroller. It goes over sidewalk numbs and uneven grassy terrain very well. It’s also pretty easy to steer one handed. My main concern was how the “step in/foot area” was constructed, but was very surprised how strong/thick the material is... (it’s not just fabric but almost like there’s a plastic insert) it wasn’t just your typical tent-like material. Pictured is my 4yr old and almost 3yr old.",
      "rating": 5.0,
      "verified": true,
      "author": "K. M.",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Grandsons love it! 🥰",
      "text": "Cozy & safe for the kiddos to come along and enjoy the ride! Seatbelts accommodate two side by side, or one in the middle. Seating is made of canvas and mesh, for comfort. It’s not pictured, but there is a safety flag included that rises up to show you are pulling a bike trailer, which I like. My grandsons love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Tamms",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Quick and easy setup",
      "text": "Baby loves riding in it. It was a breeze to setup. Depending on your bike style you might have to remove your kickstand. I had to but found a universal one for $9 that works perfectly and does not get in the way. Would be great if manufacturers would design the tow bar to be switched to either side. You have to pay close attention to how you mount the tow attachment as it’s an angled type and you don’t want to put unnecessary stress on it. Trailer is lightweight and has a smooth ride.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Lightweight and well made trailer/stroller",
      "text": "We absolutely love this trailer/stroller. We often use it with the wheel attached to the front as a stroller too. Our son loves being able to see so much while he's in it. It's really lightweight too which makes it easy to push or pull. One thing we didn't realize is that we needed another piece to be able to attach it to my husband's mountain bike. Not a huge deal but it was an additional purchase we had to make",
      "rating": 5.0,
      "verified": true,
      "author": "SarahSweets",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "Great value, quality bike trailer",
      "text": "We’ve been using this with our 2.5 year old son. He’s about 30 pounds and fits in it with ease. Went on a 17 mile ride with him for his first trip and he did great. Loved the experience and he even had room for some extra toys, snacks and his drink. I wanted a trailer with sturdier wheels than some of the cheaper options out there and we only have one child so this is perfect. Would highly recommend. Only reason I took off one star is because one of the wheels has a bit of a squeak that I haven’t been able to figure out yet.",
      "rating": 4.0,
      "verified": true,
      "author": "jwEsquire",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Very good for a 3in1 trailer stroller.",
      "text": "Works perfectly on the bike, almost don't feel the weight. So easy to go from trailer to stroller, with storage of the hassle and the front wheel. Fold-in without unmounting, or any tools. Like other parents I'd say that the major cons is that is too large to fit any wheelchair door, so there is almost no way to go through building door, bus... without taking out the wheels. That said it works perfectly as a stroller for nice walk or run. And my 2 4yo fits fine in it with decent space.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy ",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Love it!",
      "text": "I love it. My 1st time buying a trailer. my daughter loves it she fits comfortable in it but by next year I think she might be too big for it and she is 3 she is a small 3. Maneuvers very well goes over humps greats. Good on turns and has great wheels.I wish I had bought on sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Wilson",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Easy to assemble and great storage space.",
      "text": "It came packed well. I opened it up. Pulled out the folded trailer. Unfolded the trailer. Buttoned and strapped a few spots. Poped on the wheels. Added air and was ready to go in about 20 minutes. Has good storage space. I just got it and am skeptical about the velcro holding it but we will see with time. I usually reinforce it with hardware cloth for the bottom and storage space for added support. Overall I am happy.",
      "rating": 4.0,
      "verified": true,
      "author": "dk",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Not as represented in pictures...",
      "text": "All of the pictures show a handle and front wheel to use as a walker as well as a trailer, but ours did not come with that. We did order the single-child version, and the photos show the double, but there is not any indication or description that tells you that the single-child version was not otherwise identical to the pictures, and I fully expected it to come with the handle and front wheel.",
      "rating": 3.0,
      "verified": true,
      "author": "Jerome Keith",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Best bike trailer",
      "text": "Easily changes from trailer to stroller. Love that I can be configured for one child in the center or two children side by side, the seats seem comfortable for small or larger children. Amazingly smooth ride, didn’t really feel like I was pulling a ton of extra weight. I feel like it is safer than others due to the ribbing in the canopy that pulls all the way over to enclose my child completely(like a roll cage). Nice product, worth the $.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Mueller",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Good choice for the price point.",
      "text": "Nice trailer. My wish list that would make it a 5 star product. 1. Should have the option to recline. 2. The tires could be better 3. Storage is not much useful. Still it is one of the best option out there for this price point",
      "rating": 4.0,
      "verified": true,
      "author": "Singp",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Excellent product design",
      "text": "i love this!! my children love this item i do wish the net on the front didn't have such large netting, so the debris the bike throws at the children was smaller, but this doesn't affect my love for our new trailer it seems to be smooth and makes biking seamless.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 5,
      "publication_date": 20160908
    },
    {
      "title": "Good product very happy with it",
      "text": "Very happy with it, I have the one seater. Easy to assemble, didn’t even need the instructions. The snaps and velcro work fine, no wrestling required like some people mentioned. If you gotta wrestle with this thing you have issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Out of box bad tube",
      "text": "This trailer rides smoothly and seems comfortable and roomy for toddler. I am happy with the trailer purchase and only writing this to inform customers that the supplier of this trailer does NOT test the components before shipping. We opened the box and found that one bike tube had holes in it. We tried repairing twice and was unsuccessful. We had to go to a bike store to get replacement tubes. I did call the company and they said they would ship new tubes but that doesn't help when you have plans to use the trailer. It was very disappointing that out of the box are tubes with holes especially at a $170 price.",
      "rating": 4.0,
      "verified": true,
      "author": "Lilly768",
      "helpful_votes": 2,
      "publication_date": 20150428
    },
    {
      "title": "So glad I bought this item. Excellent construction and quality.",
      "text": "Recently purchased to give my grandson a ride. He's 2 yrs. This is a very good quality bike trailer. Wheels and attachment mechanism are well made and secure. Provides a safe, secure ride. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "David Alan Tussey",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Great, solidly built trailer",
      "text": "The trailer is great for my two girls (2 and 4). They are a little close together and the bottom would benefit from a little sewn in stiffeners but the storage behind the seat and legroom are more than adequate. Storage when disassembled is the most difficult thing for me due to the various parts to store. When folded flat (like out of the box) you will have the main compartment, 2 rear wheels, 1 front wheel, 1 handle and 1 flag. My wife is making a canvas bag for storing all of the awkward shaped parts in an attempt to corral everything in the garage.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Taylor",
      "helpful_votes": 0,
      "publication_date": 20161115
    },
    {
      "title": "Great bike trailer",
      "text": "Bought this trailer based on previous reviews. Wanted a double seat for future use, but right now is perfect for 1.5 year old to sit comfortably in the middle. Plenty of trunk space to store diaper bag. Clear windows on side of trailer so my son can see when riding. Quick and easy to tear down for trunk of SUV storage. Considering buying second adapater to leave on husband's bike for convience to switch trailer back and forth. Overall, very pleased with purchase for quality/price and would recommend to others.",
      "rating": 5.0,
      "verified": true,
      "author": "ABruns",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Nice trailer!",
      "text": "This was a gift for my granddaughter and was put together by her dad. As far as I’ve heard they love it and had no issues assembling it. I’ve seen it and it looks great with my granddaughter looking very happy inside!",
      "rating": 5.0,
      "verified": true,
      "author": "shoppingbliss",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "... rated in the top 10 for comfort safety and best in price range 20 inch wheels instead of 16 ...",
      "text": "Did alot of research this trailer was highly rated in the top 10 for comfort safety and best in price range 20 inch wheels instead of 16 inch which makes a better ride, tracks perfect behind bicycle and seat harness is strong, kid loves it, you won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven S.",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Great way to spend family time!",
      "text": "Great value especially for the money. No complaints. Excellent quality. I use the trailer almost daily with my 15 month old daughter and she loves our bike rides. The included trailer connection works perfectly on my 29er MTB with quick disconnect hub. Purchased a second trailer bracket for my wife’s 26” MTB.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharik St George Thomas",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Great Buy",
      "text": "This is the bomb! We love it my kids love it, couldn’t ask for more! It comes apart so easy to store! Turns from stroller to bike trailer so quickly, we love that you can do both! Easy to travel with! And big enough for the kids and their things!",
      "rating": 5.0,
      "verified": true,
      "author": "Cody Weber",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Kid approved",
      "text": "My two-year-old and I go for bike rides in our development daily oh, he loves it. Even when I don't feel like it, he walks over and climbs into his stroller by himself to give me a little guilt trip to take him for a ride.",
      "rating": 5.0,
      "verified": true,
      "author": "Autumn Arms",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Child Trailer",
      "text": "We purchased this item for our grandson who is 11 months old. So far we are extremely pleased with the product and my grandson loves it. Assembly was quick and easy. I love the 20 inch spoked wheels and the stability the 2 seat configuration provides. Not sure how it will do in the long haul, but based on what appears to be great construction, I anticipate it will do the job for quite sometime. Stop searching and buy this trailer, you won't be disappointed!!",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Young",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Very NICE! Love it! HIGHLY recommend.",
      "text": "Love it, easy to install, great quality - definitely worth the extra money over other models. Very light weight and my two year old really enjoys riding in it. Only negative is my bike couldn't attach to the trailer because of the design of my rear axle, but that was more my bike's horrible design than an issue with the product. Used wife's bike instead and it works like a charm! HIGHLY recommend. It's a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "John Mercer",
      "helpful_votes": 2,
      "publication_date": 20160510
    },
    {
      "title": "Easy to setup and use bike trailer",
      "text": "Got this so I could take my son with on family bike rides. Was super easy to setup and takes a few minutes only. Had no issues other than the flag coming off during a ride.",
      "rating": 5.0,
      "verified": true,
      "author": "Austin Horstman",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Kinda dissapointed",
      "text": "I was under the impression from reading the reviews and product info that this converted from trailer to jogger. Ours did not come with any extra attachments wheel or bar for jogging. Dissappointing.",
      "rating": 5.0,
      "verified": true,
      "author": "DRHino",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Great quality",
      "text": "We use this Bike trailer at least 3 times a week. It has great features: Can sit one child in the middle seat, storage in the back, lots of airflow to keep little ones from getting too hot, easy to attach and detach, folds up easily if you don't have room to keep it open, easy to take apart and put back together.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Has leg room",
      "text": "Exactly as described. Best price and quality for a single rider. My 3 year old son fit perfectly with room and loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "May",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Best baby carrier after a lot of research...",
      "text": "Easy to build and put together. Very sturdy and safe on long rides. Works well with mountain and road bikes. Seat belt harnesses are top quality compared to other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "This is the best you can get!!!",
      "text": "My kids love this bike trailer. It is roomy for both my 1 year old and my 2 year old. I love that it is a bench seat and that it has a floor board. I spent over a year looking for the perfect bike trailer for my little ones and this is it. I would recommend that anyone who is looking for a bike trailer that can be converted to a double trailer look no more and purchase the Schwann Joyrider Double Trailer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170511
    },
    {
      "title": "Exactly what we wanted!",
      "text": "I researched trailers for over two months before making a purchase. My main concern was a comfortable ride for my 13 month old. I opted for this model because of the large bicycle-like tires. It is very well made and feels sturdy and secure when she is in it. I really like the extra storage behind the seat! It is very open which I like because I was afraid her field of view would be limited, but she can see well. Highly suggest you consider this model. Also, it was so easy to put together right out of the box!",
      "rating": 5.0,
      "verified": true,
      "author": "OnlineShoppa",
      "helpful_votes": 4,
      "publication_date": 20130620
    },
    {
      "title": "This is the bike trailer you've been looking for.",
      "text": "This bike trailer is awesome. VERY lightweight, easy to set up, very smooth. Once you \"assemble\" it the first time (not much to assemble), it just folds up when you are done. The kids love it, and the cargo area in the back holds a diaper bag and waters or whatever you need, very spacious. You'd be surprised how easy it is to tow 100lbs behind you with this smooth ride.",
      "rating": 5.0,
      "verified": true,
      "author": "Wolff Family",
      "helpful_votes": 4,
      "publication_date": 20150208
    },
    {
      "title": "Confusing title of trailer",
      "text": "Did not come with handle bar or third wheel. Not a jogger",
      "rating": 2.0,
      "verified": true,
      "author": "Kristy Thayer",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "For your little dog, too!",
      "text": "Don't try to put together if you are in a frustrated mood. That being said it wasn't that bad. I am still confused as to why there doesn't appear to be a door to this trailer, other than undoing and redoing velcro, and there isn't a great place to tie back the plastic cover that I have found. The instructions are just OK... other than that, it drives smoothly and I barely remember that I am pulling anything behind my bike. We got it for our smaller dog to ride in for when my husband and I ride our bikes to the brewery. :)",
      "rating": 4.0,
      "verified": true,
      "author": "JPRchitect",
      "helpful_votes": 0,
      "publication_date": 20141211
    },
    {
      "title": "Coupler Attachment",
      "text": "The trailer seems great but it would be nice to know in advance that you need 2mm on your rear axel outside of the nut in order to attach the trailer. I had to return mine due to that. Otherwise seemed nice for the price point.",
      "rating": 3.0,
      "verified": true,
      "author": "Beth J.",
      "helpful_votes": 3,
      "publication_date": 20181011
    },
    {
      "title": "Fun for kids!",
      "text": "We love our bike trailer!!! The only thing I wish we could do is make a darker sunscreen for it. The screen doesn't shade your children all too well. Breaks down quick for easy storage. Our son was about ten months when we started using it. He enjoys the little ride.",
      "rating": 5.0,
      "verified": true,
      "author": "RnIT",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "Came ripped",
      "text": "Came with a rip in the fabric. Schwinn includes a large note in the box not to return to vendor and to call them directly. No answer. Maybe covid related",
      "rating": 2.0,
      "verified": true,
      "author": "Kevin Krause",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "It’s a lot of fun for the kids",
      "text": "Very nice trailer for up to two children. I Don’t like that I have to unscrew my back wheel to be able to use it but it works very well.",
      "rating": 4.0,
      "verified": true,
      "author": "Moises",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Great purchase...would highly recommend",
      "text": "This is awesome! Easy to install, folds down for easy storage, and my baby loves it! Add a blanket and snack and your good to go! The only negative is the back doesn’t lay back so if they fall asleep they are stuck in the upright position leading to a kinked neck.",
      "rating": 5.0,
      "verified": true,
      "author": "hurleystar18241",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Great, but missing parts!",
      "text": "Love the product, but it did not come with the bike attachment as stated. Would love for someone to reach out to help resolve so I don't have to figure out how to ship this back.",
      "rating": 1.0,
      "verified": true,
      "author": "Carmen ",
      "helpful_votes": 2,
      "publication_date": 20190808
    },
    {
      "title": "Less than 1 month -3 rides and it’s falling apart",
      "text": "We have just bought it one month ago and it is already falling apart. Only used 3 times! We kept indoors and have only a 12 months baby.",
      "rating": 1.0,
      "verified": true,
      "author": "S. F.",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "easy enough to assemble and our boy loves riding it ...",
      "text": "Light weight, easy enough to assemble and our boy loves riding it in. It holds his water bottle in the side pockets and it has the optional plastic shield if it is a little to windy or if it starts to drizzle out. Love how we can hang it up in our garage as well! Great buy all around, will update once our second comes along.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason C.",
      "helpful_votes": 0,
      "publication_date": 20170121
    },
    {
      "title": "Great for everyone.",
      "text": "I have no idea why I hesitated to much to buy a bike trailer for the kids. And for me. The kids love it and it's a great workout at the same time.",
      "rating": 5.0,
      "verified": true,
      "author": "JMK",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Worth every penny",
      "text": "My son loves it and I can hardly notice the extra weight I'm pulling. Easy to maneuver. Fantastic way to stay active with kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Leo and Renee",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Functional, good quality, and easy to use.",
      "text": "The set up and folding down of this is pretty quick. This item has a much better quality than many others on the market. Seat belts are padded, there’s a protective plastic layer to keep kids dry and a mesh layer for dry weather.",
      "rating": 5.0,
      "verified": true,
      "author": "Vanessa",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "cute and practical but the seatbelt is not durable",
      "text": "the nice and practical but it was damaged in 6 months of use, the seat belt tapes broke",
      "rating": 1.0,
      "verified": true,
      "author": "Freddina Del valle",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Great quality and durability.",
      "text": "Great value. Cleans very easy. Fits both my toddlers well. Easy to put on and take off or switch between bikes. Has a storage agrea in the back. I like the mess to keep bugs out and keep it cool. Tires are rubber, not plastic. Handles bumps well.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Foley",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Great single rider bike cart!",
      "text": "This was exactly what we needed. It’s a great buy if you need a single rider like we did. Easy to assemble and connect/disconnect from my bike. Very easy to clean also and handles all kinds of surfaces. Worth the money for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas Lacey",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Just what we needed!",
      "text": "We love our bike trailer. My 4 year old and her dolls ride comfortably with plenty additional space for fishing rods, and picnic lunch in back. This has afforded us awesome outdoor bike adventure time!! I am no mechanic and was able to put together fairly easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Ali Smith",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "It works",
      "text": "Wish it was a little wider for the kiddo, it works... but she gets a little fussy sometimes on not having enough space inside.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Lyn Royce Bradshaw",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Eh, it’s cool but doesn’t hold up well",
      "text": "It works great and rides smooth but the bottom seems to drag and already has a hole it it. Seems like a pretty major design flaw. It’s nice and all but not durable. I Wouldn’t buy it again.",
      "rating": 3.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Trailer",
      "text": "This trailer has been good to us as we have used it multiple times for two toddlers and the storage in the back comes in handy as well. It's so easy to put in on the bike and take it off.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeannette Reyes",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Great Quality",
      "text": "Great trailer and great for walking. I didn’t experience a front wheel issue. My 3 year old and my 9 month (who’s quite long for her age) fits in perfectly. They are very comfortable. This stroller is built well. We take it out for family bike rides and I use it for daily walks. Easy set up.",
      "rating": 5.0,
      "verified": true,
      "author": "Gigi N",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Great to keep the toddlers in tow",
      "text": "This Schwinn bike trailer is just great for my grandkids and attaches easily to my Schwinn bicycle.",
      "rating": 5.0,
      "verified": true,
      "author": "Phred",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "It is pretty durable. Wish the seats would be adjustable so ...",
      "text": "Affordable compared to the other double trailers. I've used this plenty of times mainly going out for a walk in the neighborhood. It is pretty durable. Wish the seats would be adjustable so the kids could lean back a little when they fall asleep. Would recommend people to buy it. Update: it is now 2020 and the trailer is still in good condition. Definitely worth 5 stars at this point. I rated it 4 stars back in Jan 2018.",
      "rating": 5.0,
      "verified": true,
      "author": "Mememe",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "No reason to spend more.",
      "text": "I use it almost everyday! It turns and maneuvers very well. Extremely well build. I almost spent $300 on one a bike shop was offering. I am glad I didn’t because this thing works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Mariel Betances",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "GREAT Product",
      "text": "We actually purchased this for our dog. We added a thick mat to the bottom and take our dog with us on our long bike rides. It was actually cheaper than purchasing a dog carrier and has more room for our dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Just me",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Poor quality stitching and materials.",
      "text": "On my first ride the velcro holding the front screen down ripped off. The stitching holding the velcro in place ripped. The fabric is thin and cheap and the stitching is weak. I don't imagine this would last more than two seasons of riding. You are better off spending an extra 150 for a Burly.",
      "rating": 1.0,
      "verified": true,
      "author": "Carin Leonard-Gorrill",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Easy to assemble and use",
      "text": "Do you know what is more painful than having twins? Trying to take them biking. When you are unloading two wild animals from your van, you have about 5 seconds before a full meltdown ensues. Thankfully, that's about how long it takes to put this bike trailer together. You take it out, unfold it, pop the wheels in, unlatch the rocker arm, and go. There is slight bit of pain in attaching it to the bike, but in general, I appreciate the ease this is to carry and use.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven T.",
      "helpful_votes": 0,
      "publication_date": 20190320
    }
  ],
  "product_meta": {
    "title": "Schwinn Joyrider, Echo, and Trailblazer Bike Trailer for Toddlers, Kids, Single and Double Baby Carrier, 2-in-1 Canopy, Universal Coupler, 16-20-inch Wheels",
    "rating": 4.7,
    "feature_bullets": [
      "Handy stroller kit (handle and front wheel) conveniently turns trailer into a stroller for walks or jogs",
      "Unique folding frame and quick release wheels pack up neatly for compact storage and transport. Steel frame construction",
      "Universal coupler easily attaches to almost any bicycle for added versatility; one-time installation",
      "Two-in-one canopy has bug screen and weather shield for protection from the elements; 16 inch air-filled tires with molded rims provide a smooth ride",
      "Holds two kids up to 40 pounds Each and an additional 12 pounds of convenient storage for whatever else you need"
    ],
    "specifications": {
      "Date First Available": "March 2, 2020",
      "ASIN": "B085DTSK54",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Child Seats & Cargo Trailers",
      "Trailers",
      "Child Carrier Trailers",
      "Cycling"
    ],
    "price": ""
  }
}