{
  "website_summaries": [
    {
      "verdict": "It's hard to find another light with the same performance and reliability in this price range. Undoubtedly the best bang for your buck.",
      "pros": [
        "Customers rave about its durable construction, long cord and generous light output"
      ],
      "cons": [
        "No battery means it's less portable than more expensive spotlights"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Spotlight on the Brinkmann Spotlight",
      "text": "My husband uses this spotlight when making nightly rounds to patrol the grounds of a small ranch. The beam gives clear view of at least a quarter of a mile or more. It is easy to connect and turn off and on as needed. Caution: the housing can get very, very hot which used for prolonged periods of time. Do not put the hot light onto truck/car seats as they can burn a hole in those surfaces.",
      "rating": 5.0,
      "verified": true,
      "author": "Mfisher",
      "helpful_votes": 28,
      "publication_date": 20170322
    },
    {
      "title": "Bulky, but quite effective",
      "text": "I wasn't anticipating the size of this beast but its effectiveness is quite impressive. I do deliveries for DoorDash, Postmates, and InstaCart parttime so being able to see building numbers on apartment buildings after dark is critical. This spotlight absolutely does the trick, no doubt. For the price, you can't go wrong. Oh, I love the storage bag - nice touch. The light and cord fit just fine in the bag, keeping it all clean and together - easy storage (provided you have space for it).",
      "rating": 4.0,
      "verified": true,
      "author": "Andy L.",
      "helpful_votes": 10,
      "publication_date": 20190329
    },
    {
      "title": "Five Stars",
      "text": "Using this for checking cows....will come back and comment once it's used for a while. Edited: We have used this now for a whole calving season. It's a bright enough light to see a long distance without bothering the cow who is calving. It has also held up getting bounced around and dropped on the floor of the pickup. This so far is our favorite spotlight.",
      "rating": 5.0,
      "verified": true,
      "author": "Juls",
      "helpful_votes": 15,
      "publication_date": 20170401
    },
    {
      "title": "Cheesy to say the least",
      "text": "The box says 700,000 candlepower, it also says 1296 lumens. The spotlight says 3 million candlepower, which one is it?? 1296 lumens calculates to about 16590 candlepower,. I'd say that is actually close to realistic, not 700,000 or 3 million.",
      "rating": 2.0,
      "verified": true,
      "author": "AK",
      "helpful_votes": 14,
      "publication_date": 20170606
    },
    {
      "title": "Great Light",
      "text": "I needed an extremely bright light while out boating on the water. This light is perfect for what I wanted so I am extremely happy. Shipment arrived well packed and fast.",
      "rating": 5.0,
      "verified": true,
      "author": "sivmem",
      "helpful_votes": 10,
      "publication_date": 20170725
    },
    {
      "title": "Dim - my Ryobi worklight is brighter",
      "text": "Very disappointed - \"3 million maxpower\" apparently means some marketing person thought it sounded good, but has no relation to brightness. Now that I have the package, I can see it is 1200 lumens, not 12000 or so as it should be for a 12v plug-in spotlight. I expected this to be at least as bright as my (1700 lumen) Ryobi worklight, which runs off a battery. Returning. (If you need a dim spotlight, this should be great).",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "This item was not a concentrated beam.",
      "text": "This item was not a concentrated beam. Several years ago I had a 1 million candle power spot light that had a more concentrated and brighter beam that I could clearly see from one side to the other side of the Illinois river while moving down the middle of the river",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 17,
      "publication_date": 20160707
    },
    {
      "title": "Does not work !",
      "text": "Got to go out fishing last night so we brought our new light and it DID NOT WORK tried it when i got back to the truck to make sure and nothing, straight out of the box and didn't work very dissatisfied customer and I have had a few Brinkman spots with no complaints .",
      "rating": 1.0,
      "verified": true,
      "author": "Joseph M.",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Best spotlight ever",
      "text": "These are the BEST spot lights made. Everyone is switching to LED but these are way better. My last one lasted 10 years (frequent use) before I had to replace it. I hope this one lasts just as long",
      "rating": 5.0,
      "verified": true,
      "author": "Whit",
      "helpful_votes": 2,
      "publication_date": 20181106
    },
    {
      "title": "Did NOT receive what was pictured.",
      "text": "This listing has 4 options. I THOUGHT I was purchasing the $34 Brinkman QBeam Max Million III Spotlight with 3million candlepower, halogen bulb and 1200 lumens to replace the exact one pictured. The one I received says 1560 lumens, no where on the package is the candlepower listed and the coloring is all wrong. Is this an upgrade? A completely different one? Guess we will see how it performs tonight after dark...",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan Artman",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Turn the Night into Daylight,",
      "text": "I received this \"Max Million III\" on time, well packed. I got this for a relative working in the Police Dept. on the midnight shift. The illumination power & distance is incredible. An excellent tool for Police, Military, Security & civilians that work or hunt at night from a vehicle. I also purchased a smaller sized, rechargeable One Million Candle Power unit for searches on foot. Using good quality illumination tools aids in safety and success in pro-active activity. I was pleasantly surprised at the very reasonable price for this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimo",
      "helpful_votes": 2,
      "publication_date": 20141208
    },
    {
      "title": "Works as Advertised. Big and Bright!",
      "text": "We use this at night on our Ranch in the Texas Hill Country in the Polaris Ranger SXS when there is no moonlight to light the way through the pitch black darkness and the fixed vehicle light bar only illuminates the area directly in the forward path of the 4X4. Note that to use, it must be plugged into the DC receptacle at all times since it does not have an internal battery. You will need a much longer DC extension cord to use outside the vehicle. Good value for the money however, especially given the fact your life outdoors can be at considerable risk far from help or civilization.",
      "rating": 5.0,
      "verified": true,
      "author": "David Deleranko",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Not what it appears to be.",
      "text": "Don't be fooled, like I was, by the \"Max Million\" name - the light is a basic spotlight with a large case. It is not a super bright spotlight like they want you to think. Worth the price if you want a big cased spotlight.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert Murray",
      "helpful_votes": 5,
      "publication_date": 20160810
    },
    {
      "title": "It is great if it wasn't broken, I got a \"used one\" not good idea",
      "text": "The light came with a broken focusing feature, basically mechanism to change from flood to spot trigger. The light itself moves in and out for focusing and all the tabs were broken and it doesn't focus for spot light, other than that it's very powerful and useful when I need it. Just not as a deer spotlight like I intended.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Not what they used to be!!!!",
      "text": "I own both a brinkman max 2million and the max 3million. The 2million candlepower was purchased in the early 90's or late 80's and its beam is three to four times that of the maxmillion III which was purchased a year ago. The standard for rating these lights has obviously been changed in that time. I believe the lumen rating stated for maxIII is a fair rating of the beams brightness.",
      "rating": 3.0,
      "verified": true,
      "author": "Rene Brignone",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Brinkmann 800-2301-Q spotlight",
      "text": "The Brinkmann 800-2301-Q spotlight is very bright and illuminates objects up to 300 yards. It is well-made. It is a little large but that is not a major issue. I am more than satisfied with the price, quality, and utility.",
      "rating": 5.0,
      "verified": true,
      "author": "James A Wingert",
      "helpful_votes": 0,
      "publication_date": 20170521
    },
    {
      "title": "It worked for less then 1 min. now we ...",
      "text": "It worked for less then 1 min. now we have nothing for spotting Elk & Deer. The grandkids riding around on the Razor everyone is very up set. Don't buy it is very cheaply built......... ((( JUNK )))",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Thibodeau",
      "helpful_votes": 3,
      "publication_date": 20170821
    },
    {
      "title": "what a disappointment",
      "text": "After owning around 12 QBeams over the years I have to say this is the worst. The switch is almost impossible to operate with one hand, the cord is too short to reach from the middle of an F150 dash to the window and the plug wont stay plugged in. On the bright said, uhmm, the beam is powerful, dont see much difference in this compared to the 2000000 cp model but the current draw is enough to cause the metal contacts on the plug to get dangerously hot, watch out. The only reason I didnt rate 1 star is the price. Cheap is as cheap does.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Kelley",
      "helpful_votes": 2,
      "publication_date": 20121119
    },
    {
      "title": "Could be better.",
      "text": "You get what you pay for with this one. The bulb was not connected correctly when it arrived. I had to dismantle it and fix the connections to the bulb. The housing is light plastic and does not feel like it will stand up to any abuse. Not waterproof, maybe resistant. It would work well for a garage spot light. Not one I'd rely on in an emergency.",
      "rating": 1.0,
      "verified": true,
      "author": "Raczor",
      "helpful_votes": 2,
      "publication_date": 20170305
    },
    {
      "title": "So happy I found this light",
      "text": "I love this light. It always me to look across the field and see my horses and deers grazing at night. I could even see the precious little Bambi’s. Of course there is no hunting on my land. I want the animals to feel safe and secure",
      "rating": 5.0,
      "verified": true,
      "author": "m d davis",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "It's okay",
      "text": "I bought one years ago, I figured this would be made with at least the same kind of quality or better. The beam wasn't as focused or circular as the older one. This one is definitely a lesser quality than the older version.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark Adams",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Bright, but has drawbacks.",
      "text": "Bright... Gets hot very fast. Has a slide on-off switch that works, but doesn't give a lot of confidence. Also has a trigger, whos sole purpose is to adjust the beam-spread, and does not lock... Maybe for signalling?? Not rechargeable... no battery. You can only use it while it is plugged in.",
      "rating": 4.0,
      "verified": true,
      "author": "Dr.Sid",
      "helpful_votes": 0,
      "publication_date": 20160530
    },
    {
      "title": "Cheap.",
      "text": "Cheap. I guess this falls in the category of you get what you pay for. I’m the past Brinkmann was quality. But no longer. It arrived broken but repairable. Would have sent it back but not worth the effort.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeff Williams",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "LET THERE BE LIGHT",
      "text": "HELLO. THIS IS A GREAT SPOTLIGHT. MADE IN CHINA, SO THE COMPONENTS DONT FIT PERFECTLY, BUT AS A SPOTLIGHT GOES, IT ROCKS. THE CORD IS ABOUT 7 FOOT LONG AND THE CIGARETTE LIGHTER PLUG ARE HEAVY DUTY. IT HAS A LOOP TO HANG IT AND AN OFF / ON SWITCH THAT MAKES IT HANDY. THE LENS GETS REAL HOT, BUT THAT IS TO BE EXPECTED WITH 3 MILLION CANDLE POWER. IT REALLY,REALLY LIGHTS UP AN AREA BIGTIME. THIS PRODUCT IS WORTH THE PRICE. NO REGRETS. A GOOD CHOICE FOR A GOOD LIGHT !",
      "rating": 5.0,
      "verified": true,
      "author": "CRAIG ANDERSON",
      "helpful_votes": 0,
      "publication_date": 20130213
    },
    {
      "title": "light without a battery",
      "text": "Exactly as advertised. Decide if you want a light that works with the cigarette lighter only. Mine only works with the key on in my 98 ford ranger.",
      "rating": 4.0,
      "verified": true,
      "author": "G Wheels",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "Awful",
      "text": "Dose not work at all. Tried pugging it in to several different outlets",
      "rating": 1.0,
      "verified": true,
      "author": "Alison Long",
      "helpful_votes": 2,
      "publication_date": 20180627
    },
    {
      "title": "Would buy again",
      "text": "Just what I was looking for my son for Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Stopped working after 5 uses",
      "text": "Worked for about 5 uses and then stopped working i checked fuse and everything idk what happened but I really was hoping for better its a shame because I actually really liked it worked good until it didnt",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Great for fishing",
      "text": "Was bought as a gift for my dad to put in his boat. He says it's a great light and he seemed to be very pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "goodl light",
      "text": "good light unsure about the quality feels cheap made great beam at a low price.",
      "rating": 3.0,
      "verified": true,
      "author": "Tubkat 63",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Not what I wanted",
      "text": "Not rechargable. Does not work unless plugged into the cigarette lighter.",
      "rating": 2.0,
      "verified": true,
      "author": "Katfish",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "It’s an ok spot light",
      "text": "Works and looks as described. Plug is a little big and sometimes falls out and works it way out of 12v socket being that cord is short and coiled. All in all it’s an ok spotlight I guess.",
      "rating": 3.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Super bright to light up the waterways",
      "text": "This light works perfectly to light up the night while I'm headed to my favorite fishing spot!",
      "rating": 5.0,
      "verified": true,
      "author": "Craig",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Great beam. Much cheaper quality than the Q-Beam I ...",
      "text": "Great beam. Much cheaper quality than the Q-Beam I had years ago. But still does a great job.",
      "rating": 5.0,
      "verified": true,
      "author": "Big A",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Waste of money",
      "text": "The light didn't even work. I plugged it in to my 12v outlet and the power light was on. I turned the light on and it wouldn't power and the red power light would go away. When i turned it off it would come right back on. Waste of money. Don't waste your time with this cheap plastic.",
      "rating": 1.0,
      "verified": true,
      "author": "Shane Ingle",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Best Spotlight I have ever owned!",
      "text": "This light has TRUE night blaster qualities. Cast a true beam for great distances and helps me spot the channel markers when I am night fishing. It is easy to hold and operate and if you are looking for a great spotlight, YOUV'E FOUND IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Stephens",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Great Spotlight",
      "text": "Love the light, plugs into my boat power outlet and is bright! Good light for the money!",
      "rating": 4.0,
      "verified": true,
      "author": "Mickey",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Good light, works great!!!",
      "text": "Great light. Bought this because I don’t want a rechargeable one. Works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan Castle",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Great Product",
      "text": "Product arrived promptly, packaged well and works extremely well for checking the cows at night, much appreciated!",
      "rating": 5.0,
      "verified": true,
      "author": "Kay Woods",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Five Stars",
      "text": "love the high power wish I realized it is not a rechargeable",
      "rating": 5.0,
      "verified": true,
      "author": "mholland",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Very bright and light weight",
      "text": "Very reliable bright light feels kinda week due to all plastic design but overall love the light",
      "rating": 4.0,
      "verified": true,
      "author": "Blakebrandon624",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Spotlight",
      "text": "I am a hunter and so is my father. I bought this light for my father for christmas. We went through a lot of lights and so far this is the brightest light we ever had. It is also a light you plug into a cigaret lighter, that was one of the main options we wanted. the only complaint is the cord is a little short but not bad. Thanks again",
      "rating": 5.0,
      "verified": true,
      "author": "Randal",
      "helpful_votes": 0,
      "publication_date": 20140107
    },
    {
      "title": "Great spotlight",
      "text": "I use this for work to locate overhead power lines. Love that it works 100% of the time. I prefer lights that plug in, over lights with rechargeable batteries. These are much more reliable and very bright. I have two of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris J.",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "No go",
      "text": "For the hour total time it worked, it was great. I've used this brand before and the quality has seriously deteriorated. If you need a light to stay on for more than a few minutes and not get so hot the bulb explodes, get one in LED. As always, thanks to Amazon's great returns.",
      "rating": 1.0,
      "verified": true,
      "author": "BLaid",
      "helpful_votes": 5,
      "publication_date": 20140121
    },
    {
      "title": "Four Stars",
      "text": "Nice bright light! Feels cheaply made! Hope it stands up!",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Haycox",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "great light!",
      "text": "got this to use for neighborhood watch patrols and it works perfectly for that need plenty bright for shining up into dark alleys",
      "rating": 5.0,
      "verified": true,
      "author": "AmyCQ",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "NOT AS DESCRIBED",
      "text": "Listing describes light as being 2900 lumens, box says 1200 lumens, also I would prefer a trigger switch instead of the slide switch on the back of the light. The light is extremely bright and even though I have not been out in my boat at night with it, I am sure it will be more than bright enough for my needs",
      "rating": 4.0,
      "verified": true,
      "author": "Kir",
      "helpful_votes": 0,
      "publication_date": 20140427
    },
    {
      "title": "The spotlight worked the first time I tried it after ...",
      "text": "The spotlight worked the first time I tried it after taking it out of the shipping container a few days later I plugged it in it would not work the light on the plug-in was lit up so I’m presuming it was receiving power But doesn’t light up",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Works great! the trigger is used as a way to ...",
      "text": "Works great! the trigger is used as a way to widen the beam so going across the lake at night you can see more area.",
      "rating": 4.0,
      "verified": true,
      "author": "Phillip Drumm",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "cheap, but they work",
      "text": "We use these for spotlight surveys for deer. They are pretty cheap plastic and after one year (maybe 4 hours of total use), one of the 4 units blew a bulb out. The bulbs are 17 bucks. Basically, they work they just seem cheap. Then again, at 25 bucks a light, they ARE cheap, so you get what you pay for.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20140122
    },
    {
      "title": "Just a bad product!",
      "text": "I’ve bought 2 of these lights in the past 6 months. Both stopped working within the first hour. Do not waste your money on this light. Go ahead and pay a little more for a heavier version that you don’t have to worry about.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris Ferguson",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Five Stars",
      "text": "Excellent output. Can illuminate refelective material over one half mile away. Brighter than one car headlight.",
      "rating": 5.0,
      "verified": true,
      "author": "James M. McCain",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "so I am happy..",
      "text": "A pristine Amazon box arrived and inside was a box that looked as if it had been hit by a truck. The light works, so I am happy...but it was a gift and that made me a little miffed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "Great light",
      "text": "Most spotlights these days have batteries that die 15 minutes into your spotting adventure and then needs to be recharged and while recharging you cant use it. this spotlight plugs right into your cigarette lighter in your car or truck and is bright all the time. You don't have to worry about loosing power due to the battery going dead. Recommend to anymore who likes to cruise around the local fields looking for the monster buck of the season.",
      "rating": 5.0,
      "verified": true,
      "author": "Billy",
      "helpful_votes": 0,
      "publication_date": 20130903
    },
    {
      "title": "Mediocre",
      "text": "The spotlight does not have a very wide shine. It's more of a direct beam.",
      "rating": 3.0,
      "verified": true,
      "author": "tyler",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "This thing is a POS. The first time I ...",
      "text": "This thing is a POS. The first time I plugged it in, the bulb burned out in 5 seconds. They give you an extra bulb, but my gosh, how long will that one last? I'm going to buy an LED one.",
      "rating": 1.0,
      "verified": true,
      "author": "Sean Michael O'Brien",
      "helpful_votes": 2,
      "publication_date": 20170103
    },
    {
      "title": "Spotted!!!",
      "text": "We took this up to the North Woods in upper Wisconsin to spot deer during a vacation. It works fantastic and would recommend it to anybody. We got to see nature in nature thanks to this fantastic light!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Rob The Diver",
      "helpful_votes": 0,
      "publication_date": 20141025
    },
    {
      "title": "Bright",
      "text": "Very bright works very well for checking on my cattle. I would recommend this well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "Pretty darn good",
      "text": "Not the brightest light but works well with a 12v and unlike the battery models, wont go dead when you forget to charge it up every night. lightweight, easy to stow and a cord long enough to move around a little bit with. Great product and good price, recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Erik Zimmerman",
      "helpful_votes": 0,
      "publication_date": 20130806
    },
    {
      "title": "Three Stars",
      "text": "light was a little on the big side had trouble holding it beam not as bright as i expected",
      "rating": 3.0,
      "verified": true,
      "author": "michael walker",
      "helpful_votes": 0,
      "publication_date": 20160730
    },
    {
      "title": "Let there be light!!!",
      "text": "Wow! Fast shipping and exactly what I expected. I tried it out in my apartment parking lot and lit the whole place up! Also came with an extra bulb.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad Gibson",
      "helpful_votes": 0,
      "publication_date": 20170813
    },
    {
      "title": "Five Stars",
      "text": "shoot rabbits at night? the little suckers have hard time running off",
      "rating": 5.0,
      "verified": true,
      "author": "Frances L. Chapman",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Captured the Sun",
      "text": "I volunteer as a police auxiliary and purchased this light to use on night patrols. It has more than met all my expectations. It does get very hot very quickly though and if you have plastic car seats you may want to be extra careful about where you lay it down.",
      "rating": 4.0,
      "verified": true,
      "author": "Klaus M. Adam",
      "helpful_votes": 0,
      "publication_date": 20131128
    },
    {
      "title": "Let there be light.",
      "text": "I always have used Brinkmann lights. And there quality has never faulted.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Three Stars",
      "text": "Not that bright. Works though. That is a plus compared to others we have got in past!",
      "rating": 3.0,
      "verified": true,
      "author": "Robcobb",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "I have a number of flash lights. Some that ...",
      "text": "I have a number of flash lights. Some that cost 5 times the price as this one and those are not anywhere close to being as bright as this brinkman.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20160909
    },
    {
      "title": "Same part keeps breaking",
      "text": "This was our second one due to the first one breaking right after we got it on the plug in part. Used the second one twice and it did the same thing!",
      "rating": 1.0,
      "verified": true,
      "author": "Mandy Bennett",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "have had problems with the wiring inside, and the ...",
      "text": "have had problems with the wiring inside, and the wiring in the plug falling apart so you may need to do some minor wiring from time to time. Very bright though, and light too.",
      "rating": 4.0,
      "verified": true,
      "author": "Harry Harder",
      "helpful_votes": 0,
      "publication_date": 20141208
    },
    {
      "title": "like turning darkness into daylight and has a ridiculously long ...",
      "text": "This light is so powerful, like turning darkness into daylight and has a ridiculously long reach light wise. I would highly recommend this for a spot light from a vehicle type of application.",
      "rating": 5.0,
      "verified": true,
      "author": "Swami",
      "helpful_votes": 0,
      "publication_date": 20150221
    },
    {
      "title": "Great Product!",
      "text": "I got this as a gift for my boyfriend for Christmas and he absolutely loves it! Uses it all the time. It is a powerful light and works great for what he was wanting to use it for. He loves that the light gives off as much power as it does.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20140210
    },
    {
      "title": "Despues de 4 years de uso en mi bote sigue ...",
      "text": "Despues de 4 years de uso en mi bote sigue siendo una tremenda linterna!! After 4 years of use in my boat, still the best",
      "rating": 5.0,
      "verified": true,
      "author": "Simpson",
      "helpful_votes": 0,
      "publication_date": 20160614
    },
    {
      "title": "Amazon was great in assisting my return",
      "text": "The light did not work right out of the box. The phone number on the warranty by Brinkmann did not work. Amazon was great in assisting my return.",
      "rating": 1.0,
      "verified": true,
      "author": "Seacruiser",
      "helpful_votes": 2,
      "publication_date": 20170101
    },
    {
      "title": "Five Stars",
      "text": "Works very well, but it is a bit larger than I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "dalehan123",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "Not very bright",
      "text": "Would not buy again, the light is not very bright and is not good for any real distance.",
      "rating": 3.0,
      "verified": true,
      "author": "Jon William Matousek",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Works as it should",
      "text": "Very bright works very well. Good Switch to turn on/off is not the best, hope it last. I would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "douglas diekmann",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Good value",
      "text": "Exactly as expected, no surprises. A good value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "MacNut",
      "helpful_votes": 0,
      "publication_date": 20170211
    },
    {
      "title": "Nice light but the curled cord is very stiff and ...",
      "text": "Nice light but the curled cord is very stiff and not flexible enough for me. Would have preferred a long straight cord.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Works great.  Excellent value.",
      "text": "Has worked great for the first season. Seems to be a quality product and good value when buying on Amazon. Spot lights are great to have on boats. It may be far brighter than car headlights.",
      "rating": 5.0,
      "verified": true,
      "author": "paratodus",
      "helpful_votes": 0,
      "publication_date": 20131115
    },
    {
      "title": "very bright",
      "text": "nice light, use it for emergency search and rescue on ATVs. I packaged it in a plastic case and secured it in an ATV box to prevent damage....very bright search light",
      "rating": 4.0,
      "verified": true,
      "author": "kgso24",
      "helpful_votes": 0,
      "publication_date": 20131215
    },
    {
      "title": "REALLY BRIGHT SPOTLIGHT!!!",
      "text": "Purchased this light for when I go hunting. I was looking for something that can be plugged into the car charger, has a long enough cord to use out the window, and was bright enough to see in the bushes at night. Did the job extremely well, good quality construction and cord is long enough to do the job.",
      "rating": 5.0,
      "verified": true,
      "author": "ZakAttack",
      "helpful_votes": 17,
      "publication_date": 20120510
    },
    {
      "title": "Five Stars",
      "text": "So fae it is working fine. Came with a spare bulb also.",
      "rating": 5.0,
      "verified": true,
      "author": "Racin Ray D",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "Five Stars",
      "text": "the light is very bright, thanks for the speedy service",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck Liverman",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Two Stars",
      "text": "Plug in doesn’t fit good into cigarette lighter. To long.",
      "rating": 2.0,
      "verified": true,
      "author": "Bryant",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Brinkmann 800-2301-0 Q-Beam Max Million III Spotlight",
      "text": "Had to extend the cord for the application on the boat.",
      "rating": 5.0,
      "verified": true,
      "author": "bill",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Four Stars",
      "text": "Have not been out at night yet. I will update once I use it at night on the boat.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe Tinyes",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Three Stars",
      "text": "seams a little flimsy but pretty bright. good to have in the vehicle emergency kit.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20160920
    },
    {
      "title": "Nice and Bright",
      "text": "great light, nice and bright although my other Brinkmann was less cumbersome. on off switch a little awkward.",
      "rating": 4.0,
      "verified": true,
      "author": "Dwight K.",
      "helpful_votes": 0,
      "publication_date": 20160120
    },
    {
      "title": "Very good light",
      "text": "The trigger is a little out of reach for your thumb but other than that good reliable light",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Made in China",
      "text": "It seems to be a step down in quality over earlier lights I bought from Brinkman but it throws a very bright beam for a considerable distance. You get what you pay for...",
      "rating": 3.0,
      "verified": true,
      "author": "David G. Rathbun",
      "helpful_votes": 0,
      "publication_date": 20140213
    },
    {
      "title": "Five Stars",
      "text": "Just as good as my last Brinkmann I wore out.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Shed a Little Light on the Subject",
      "text": "Wow! Want to light up the woods or the neighborhood? This will do.",
      "rating": 5.0,
      "verified": true,
      "author": "D. T. Harker",
      "helpful_votes": 0,
      "publication_date": 20150726
    },
    {
      "title": "It’s great.",
      "text": "Light works great. Super bright. Just miss the old trigger switch.",
      "rating": 5.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Works great",
      "text": "I have used this numerous times for work and hunting and found it be very powerful. Good light. It uses alot of power so be sure to keep it plugged all the way in or the connection gets hot.",
      "rating": 5.0,
      "verified": true,
      "author": "wyoeng",
      "helpful_votes": 0,
      "publication_date": 20121230
    },
    {
      "title": "Doesn’t work",
      "text": "The light lasted to days and stopped working need email for company to get money back",
      "rating": 1.0,
      "verified": true,
      "author": "Alx220",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "Q-Beam Max",
      "text": "As Described works great bought for boat and tested it when received it but haven't had the need to use it other then that one test.",
      "rating": 5.0,
      "verified": true,
      "author": "Smitty",
      "helpful_votes": 0,
      "publication_date": 20140819
    },
    {
      "title": "Cant go wrong",
      "text": "It is super bright and perfect for frogs cant wait til spring to use it more",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Self employed.",
      "text": "Thought it would work without being plugged in. Completely useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Sidney Williams",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Great",
      "text": "Only thing is the 12v plug didn’t stay In very well wile plugged in",
      "rating": 5.0,
      "verified": true,
      "author": "Garrett",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Nice cord. Don't love the switch",
      "text": "VERY bright. Nice cord. Don't love the switch.(too easy to turn on...would leave unplugged.)",
      "rating": 4.0,
      "verified": true,
      "author": "Jackster",
      "helpful_votes": 0,
      "publication_date": 20140918
    },
    {
      "title": "Great spotlight to keep in the truck!",
      "text": "It is the perfect light to keep in the truck to check my heifers after dark. No charging needed, just plug it in. Very bright, long reaching beam.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn",
      "helpful_votes": 0,
      "publication_date": 20140223
    }
  ],
  "product_meta": {
    "title": "Brinkmann 800-2301-0 Q-Beam Max Million III 12V DC Spotlight",
    "description": "This powerful Million 3 candle power, 12 Volts spotlight produces a super high intensity beam. It features a powerful halogen bulb for maximum brightness and a rubber gasket lens seal for water and shock resistance. It has a tough ABS plastic construction, convenient metal bracket for hanging or storage and includes a handy nylon carrying case.\n\nFROM THE MANUFACTURER\nHalogen High Intensity Q-Beam Spotlight with 100 watt bulb that produces 1200 lumens. Aluminum parabolic reflector. LED indicator for battery charge. Balanced hand fitting handle. Weatherproof ABS plastic housing.",
    "rating": 4.2,
    "feature_bullets": [
      "Easy access on/off sliding switch",
      "Tempered glass lens",
      "Heavy gauge - 8 feet coiled cord",
      "Features a powerful halogen bulb for maximum brightness",
      "12 Volts DC plug with LED indicator light"
    ],
    "specifications": {
      "Manufacturer": "Brinkmann",
      "Part Number": "800-2301-0",
      "Item Weight": "2.2 pounds",
      "Item model number": "800-2301-0",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Black",
      "Style": "Contemporary Lighting",
      "Finish": "Black Lighting",
      "Power Source": "Battery-Powered",
      "Voltage": "12 Volts",
      "Wattage": "100 watts",
      "Item Package Quantity": "1",
      "Type of Bulb": "Halogen",
      "Certification": "Certified frustration-free",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "One year.",
      "National Stock Number": "6220-01-389-3303",
      "ASIN": "B00266EF5C",
      "Customer Reviews": "4.2 out of 5 stars492 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#30,778 in Tools & Home Improvement",
      "Date First Available": "July 20, 2005"
    },
    "categories": [
      "Flashlights",
      "Handheld Flashlights",
      "Tools & Home Improvement",
      "Safety & Security"
    ],
    "price": 32.99
  }
}