{
  "website_summaries": [
    {
      "verdict": "As long as you and your subject aren't in a hurry, the Casio Exilim is a respectable budget-priced ultracompact.",
      "pros": [
        "Good photo quality for the money",
        "one-button video capture"
      ],
      "cons": [
        "Slow shooting performance",
        "short battery life"
      ],
      "aspects": {},
      "publication_date": 20100204,
      "rating": 6.4,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Works well for the price",
      "text": "This is a cheap portable digital camera, and when you buy it expect it to perform as such. It takes great pictures in the sun, or bright indoors, but struggles like most cheaper models in lower light conditions. When you use the flash the colors always are off, and if you don't use the flash (when it is not naturally bright enough) things get blurry. All that being said. Its cheap, portable, high-quality (when conditions are right) camera. If you want to spend <100 on a camera this is a great choice. I am satisfied with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristopher J. Wise",
      "helpful_votes": 0,
      "publication_date": 20100209
    },
    {
      "title": "I like it",
      "text": "I like the size and user interface. Its easy to do simple things like turn flash on/off (note, obviously I'm not a pro photographer). The use of standard SD cards is far better imho than XD cards that some other brands use - they are more widely available I find and more computers have slots. Its light and compact. I would give this five stars except for the NON-STANDARD USB cable and charger. To charge you have to bring the charger and take the battery out and put it in the charger.",
      "rating": 3.0,
      "verified": true,
      "author": "slartibartfast",
      "helpful_votes": 0,
      "publication_date": 20100903
    },
    {
      "title": "This item is cute and small in size. However ...",
      "text": "This item is cute and small in size. However, it takes so long to snap pictures. And forget about in action shots. I bought is as a point and click, as I am a professional blogger, and it just doesn't work for that. I decided to give it to my 7 year old daughter.",
      "rating": 3.0,
      "verified": true,
      "author": "Heather Lopez",
      "helpful_votes": 0,
      "publication_date": 20150824
    },
    {
      "title": "Love this camera",
      "text": "Bought this Camera for my 9-year old daughter and she has thoroughly enjoyed it. It is easy to use - point and click. There is a button to take the pictures, view the pictures or take video. It has a nice display screen on the camera and when downloaded they are just as nice. It is small and compact and fits in her little purses. I would recommend it for anyone looking for a camera for a young one that is not too much of an investment or if you just want a 2nd camera that you can take anywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Maniacs Wife",
      "helpful_votes": 2,
      "publication_date": 20100201
    },
    {
      "title": "Casio EX-Z33BK review",
      "text": "This is the 2nd casio Slim camara that I have owned. The 12 Mega Pixal picture is very good. My only beef with this camara is that the shutter has too much lag time for action photos. If you are trying to capture a sports moment, for example, you will miss it.",
      "rating": 4.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20100918
    },
    {
      "title": "Good Camera for the Money",
      "text": "I bought this camera about a month ago. I recently took lots of pictures while on vacation. They all came out pretty good. My friend showed me how to change the settings to get rid of any red eye and to enhance the picture quality. I've never been able to use a digital camera that good, but this one seems to be very user friendly. The battery life is amazing. I charged it once and it's still going strong. Overall I am very happy with this purchase. This is just a basic camera though. If you are the average person that just takes pictures every now and then just for fun this is for you.",
      "rating": 4.0,
      "verified": true,
      "author": "Z. Cottrell",
      "helpful_votes": 0,
      "publication_date": 20100130
    },
    {
      "title": "Wonderful Find",
      "text": "I had a camera just like this one, but suddenly one day the screen stopped working. It was great to find the exact camera that works just as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Angela Martin",
      "helpful_votes": 0,
      "publication_date": 20140705
    },
    {
      "title": "Love the pink camera!!",
      "text": "My wife and I purchased this for my daughter for Christmas. She loves the color pink and Casio makes the best cameras. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Darren Renna",
      "helpful_votes": 0,
      "publication_date": 20121225
    },
    {
      "title": "Great item for the price",
      "text": "This is a good camera for the price. My dayghter loves it and she has turned out several great photos with it",
      "rating": 4.0,
      "verified": true,
      "author": "Melissia",
      "helpful_votes": 0,
      "publication_date": 20120507
    },
    {
      "title": "good enough entry level compact digital camera",
      "text": "This was a Christmas gift for my 14 year old son and he takes it anywhere he goes. I love that it is compact and user friendly, although picture quality is not as good as our compact canon camera (forgot the model number but had it for years), it's definitely a good buy for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Gman",
      "helpful_votes": 0,
      "publication_date": 20100117
    },
    {
      "title": "Easy to use Digital cameraJust",
      "text": "Just a very easy to use camera. Love the movie camera feature. Extremely easy to upload pics to computer. great picture quality. just overall very please with purchase and recommend to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Meagan Manzella",
      "helpful_votes": 0,
      "publication_date": 20100720
    },
    {
      "title": "Great camera",
      "text": "Simple to use, great litle point and shoot camera. Easy to use with a simple zoom. Takes great pictures indoors and outdoors.",
      "rating": 5.0,
      "verified": true,
      "author": "Monte",
      "helpful_votes": 0,
      "publication_date": 20130915
    },
    {
      "title": "Cool Camera",
      "text": "This is a great little camera! light easy to use. Great Pics! bought 3 of them; one for my 80 year old mother who is still on a film camera (remember those?). If she can use it, anyone can!",
      "rating": 5.0,
      "verified": true,
      "author": "GM NAVIGATION DVD P/N 15807780",
      "helpful_votes": 0,
      "publication_date": 20100127
    },
    {
      "title": "Casio review",
      "text": "This is a great camera for the price and is a great product and was delivered as promised by my daughter's birthday.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard R. Dalessandro",
      "helpful_votes": 0,
      "publication_date": 20100407
    },
    {
      "title": "Satisfied",
      "text": "This camera more than sitisfied my expectations. Now you can film video without having to enter the menu, and having to go back and forth between pictures and video. Besides it's lighter than it's predecesor. It's rechargeable lithium battery is great. I'm a very satisfied owner.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Johann Schwarz Gehrke",
      "helpful_votes": 0,
      "publication_date": 20100203
    },
    {
      "title": "good",
      "text": "so far, all I've bought cameras have gone pretty good, and as I love. and i bougth for my cousin",
      "rating": 4.0,
      "verified": true,
      "author": "fabiola arias baez",
      "helpful_votes": 0,
      "publication_date": 20130703
    },
    {
      "title": "I loved this camera and it is a very good one ...",
      "text": "I loved this camera and it is a very good one and i think some of you should but it",
      "rating": 5.0,
      "verified": true,
      "author": "CARRIE LYNNAE NORDELL",
      "helpful_votes": 0,
      "publication_date": 20150818
    },
    {
      "title": "Great camera",
      "text": "Small, lightweight, easy to use and understand. Outstanding picture quality. Videos turn out great also.",
      "rating": 4.0,
      "verified": true,
      "author": "Krissy",
      "helpful_votes": 0,
      "publication_date": 20100208
    },
    {
      "title": "Good election",
      "text": "I have used a lot of casio products, I think they are for long time. This camera has good price for excelent quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcel",
      "helpful_votes": 0,
      "publication_date": 20110719
    },
    {
      "title": "Great Product",
      "text": "I ordered the camera for my daughter. I was deployed when I ordered it, and she received it in good time. She has been happy with it so far. No complaints.",
      "rating": 4.0,
      "verified": true,
      "author": "Fabian_Flores",
      "helpful_votes": 0,
      "publication_date": 20120405
    },
    {
      "title": "Very good",
      "text": "Just as described. Received in good conditions. Since I am an amateur, it is worth the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Natalia Rutinel",
      "helpful_votes": 0,
      "publication_date": 20100514
    },
    {
      "title": "I love it !",
      "text": "I LOVE THIS CAMERA ! ITS HAS GREAT BATTERY LIFE AND IS LIGHT WEIGHT ! THE COLOR IS AWESOME ! THE QUALITY OF THE PICTURES IS VERY GOOD AS WELL.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi L. Butler",
      "helpful_votes": 0,
      "publication_date": 20100526
    },
    {
      "title": "Medium",
      "text": "The camera is good for daypictures, but in the night or inside the quality is poor (in this case not focus right), the videocamcorder is poor, and the soudrecorder is poor too",
      "rating": 3.0,
      "verified": true,
      "author": "Hernan Sanchez",
      "helpful_votes": 0,
      "publication_date": 20100621
    },
    {
      "title": "Don't waste your money on this piece of junk",
      "text": "I bought this camera for my son for Christmas. The camera is so cheap and flimsy, that after inspecting it, I decided to return it and get him something else (on Christmas Eve). I have another Casio camera that is excellent. I understand that for less money, you get less camera, but putting the 'Casio' brand on such a poor quality camera is really bad business.",
      "rating": 1.0,
      "verified": true,
      "author": "Guitarzan",
      "helpful_votes": 3,
      "publication_date": 20091226
    },
    {
      "title": "Great camera for the price and durable",
      "text": "I bought the camera for my second deployment to Iraq in 2007 and it's still going strong. Image quality is awesome for what you pay for. Battery life is long enough to not have to recharge for 2 weeks. I can't complain except for I won't use it much since i have an SLR but whenever I go out I throw it in my backpack and it always comes in handy.",
      "rating": 3.0,
      "verified": false,
      "author": "Edgardo Rivera",
      "helpful_votes": 0,
      "publication_date": 20100203
    },
    {
      "title": "Casio quality has gone downhill fast",
      "text": "I bought this camera for my girlfriend for Christmas, had it open for 10 min and the flash stopped working so I called customer support and they tell me that I have to send it in to their repair facility on my dime and patiently wait for it to get repaired. I cannot recommend this product for anyone out there, just keep on shopping and find anything better. Should have gone with Sony since everyone I know loves theirs but she wanted something bright pink, lesson learned and hope that others out there don't have to go through this like I did.",
      "rating": 1.0,
      "verified": false,
      "author": "Kevin Krueger",
      "helpful_votes": 0,
      "publication_date": 20100111
    },
    {
      "title": "Exactly what I wanted",
      "text": "A vast improvement on our previous dinosaur digital camera. Love the pictures. Love the fact that it's got lots of cool features and that I can ignore them until I want them; the basic things are right where I can find them at a glance.",
      "rating": 4.0,
      "verified": false,
      "author": "Golda Fast",
      "helpful_votes": 0,
      "publication_date": 20100805
    },
    {
      "title": "Warranty doesn't cover the body of the camera.",
      "text": "I purchased this camera from Circuit City before it went out of business. After a few months the door that holds the SD card broke. It is only held together with flimsy little pieces of plastic. We sent the camera and plastic parts back to Casio and they said \"Sorry, the warranty doesn't cover the case, only the inner working parts.\" So, be careful to look at warranty info. You can find it online. I have 2 Nikon Coolpix cameras, one of which I dropped and damaged the lens. Nikon fixed the camera under warranty and gave great customer service. I would recommend paying a little more and not buying a Casio. You get what you pay for.",
      "rating": 1.0,
      "verified": false,
      "author": "S. Marshall",
      "helpful_votes": 52,
      "publication_date": 20091201
    }
  ],
  "product_meta": {
    "title": "Casio EX-Z33BK 10.1MP Digital Camera with 3x Optical Zoom and 2.5 inch LCD (Black)",
    "description": "Color:BlackFROM THE MANUFACTURER\n\n\n The Exilim EX-Z33 is a 10.1-megapixel digital camera with a 3x optical zoom lens. The EX-Z33 features a dedicated movie button that allows users to record widescreen movies with a 16:9 aspect ratio. It combines a stylish, slim body with high-powered features that allow families or anyone on-the-go with the ability to capture a memorable moment wherever they are. \n\nExilim EX-Z33 Highlights \n\nEasy Mode helps newcomers become experts with common settings\nUsing Easy Mode, photo settings are restricted to just image size, flash on/off and self timer, and these are displayed on a simplified menu screen. \n\nConvenient Face Detection function\nThe camera automatically detects people’s faces, allowing users to take well focused and beautifully exposed pictures of the faces of their intended subjects. \n\nAppealing widescreen movies\nSimply by pressing the dedicated Movie button, users can record widescreen movies with a 16:9 aspect ratio. \n\nYouTube Movie Mode\nMovies can be recorded and saved using the ideal size and quality settings for the world's most popular video sharing site, YouTube. Recorded movies can be uploaded to YouTube using the included computer software.",
    "rating": 3.1,
    "feature_bullets": [
      "10.1-megapixel resolution",
      "3x optical zoom ; 2.5-inch LCD screen",
      "Face Detection function; Easy Mode for enhanced simplicity",
      "Record widescreen movies; capture and upload through YouTube Movie Mode",
      "Compatible with SD/SDHC memory cards (not included)"
    ],
    "specifications": {
      "Product Dimensions": "3.74 x 0.71 x 2.2 inches",
      "Item Weight": "3.68 ounces",
      "ASIN": "B002LB8422",
      "Item model number": "EX-Z33BKEBB",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "3.1 out of 5 stars47 ratings3.1 out of 5 stars",
      "Best Sellers Rank": "#490,446 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 12, 2009",
      "Manufacturer": "CASIO"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": 65.0
  }
}