{
  "website_summaries": [
    {
      "verdict": "Pet care professionals love this food for its high quality and Ziwi's strict nutritional standards. If you're concerned about dog food recalls, this is a solid choice.",
      "pros": [
        "Smaller quantities are more filling, so dogs aren't eating a bunch of bulky food and no fillers",
        "Ingredients are premium and ethically sourced proteins",
        "Air dried instead of baked, which locks in key nutrients",
        "This brand doesn't have a history of recalls",
        "Most dogs love the taste"
      ],
      "cons": [
        "Quite expensive and can turn stale quickly, so you should store it in an airtight container or bag"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Quality, ethically-sourced ingredients, tempting flavors, and wholesome nutrients - this dog food has it all, which is why many trainers and professionals trust feeding it to their dogs.",
      "pros": [
        "Made with high-quality animal protein that is ethically-sourced, which appeals to animal-lovers",
        "Nutrient-rich, thanks to the air-dried process that results in better retention of vitamins and minerals",
        "History of fewer recalls than competing brands means added peace of mind when it comes to feeding your best friend"
      ],
      "cons": [
        "Falls on the higher end of the price spectrum",
        "Careful storage in an airtight container is recommended, as it tends to go stale quicker than baked food"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "This is the food pet experts and trainers feed their own dogs – the highest quality meal you can serve your best canine pal, with superior ingredients that are ethically sourced and loaded with nutrients.",
      "pros": [
        "Dogs absorb more from less food, so the bag lasts longer—you can feed less volume",
        "Ethically sourced, pure animal proteins",
        "Air dried, not baked, so it retains all original nutrients",
        "Taste dogs love and owners feel good feeding them",
        "No history of recalls like other brands"
      ],
      "cons": [
        "A bit pricey",
        "May not keep as long as baked dry food, so we recommend storing it in an airtight container"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Dogs love the flavor of this unique air-dried dog food, and their owners love its exceptional nutritional value and superior ingredients.",
      "pros": [
        "Made with an air-dried process that locks in the nutrients of the quality ingredients",
        "Crafted with protein that is ethically-sourced",
        "Dog owners appreciate that this food doesn't have a history of recalls like some competitors",
        "Flavor and texture are tempting to most canines"
      ],
      "cons": [
        "For best results, you'll need an airtight container for storage, as this food is prone to getting stale sooner than classic kibble",
        "Expensive"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Want Fresh",
      "text": "I normally love Ziwi Peak, but this bag was not a fresh bag by any means. I have read other reviews that had the same experience.",
      "rating": 1.0,
      "verified": true,
      "author": "Mar63",
      "helpful_votes": 122,
      "publication_date": 20180611
    },
    {
      "title": "Excellent Dog Foot - Questionable Amazon storage conditions...",
      "text": "My 13-year-old 75 lb dog has cancer, and he loves this food! Right now it's the only thing we can get him to eat regularly and feel confident he's getting the nutrition he needs. Our first bag was perfect, but with this order, I'm very disappointed in Amazon. The bag looks like it was exposed to both heat & strong sunlight; the plastic is separating in spots and the bag actually \"crunches\" when handled. As I understand it, Ziwipeak calls for their food to be stored away from such conditions. It doesn't look like there's any perforations, but very disappointed at Amazon's quality control. That bag shouldn't have made it out of the warehouse.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 81,
      "publication_date": 20160714
    },
    {
      "title": "My Dog Loves...BUT",
      "text": "This food is too high in fat for my dog. Apparently his digestive system went \"tilt\" on this food, landing him in the vets office. Blood work led vet to suspect pancreatitis, but further testing did not support that...possibly IBD ... but to confirm that requires even more $$$ testing. By this time my dog also has PTSD from all the vet visits..shots or lab sticks...then anesthesia to administer ultrasound. Very bad experience for him. I said no... I now have him on bland diet and I'm making very healthy homemade broth for him to help heal his digestive system. Long story short ... tread carefully...and maybe do not feed this exclusively ... or maybe use for treats.",
      "rating": 4.0,
      "verified": true,
      "author": "Expressionality",
      "helpful_votes": 20,
      "publication_date": 20181101
    },
    {
      "title": "Don't buy from amazon",
      "text": "Don't buy from amazon, its dry and not at all the quality it should be. Last batch I got wasn't even a little moist and much harder for my dog to chew (to the point he won't even really mess with it, he'd rather not eat). Do yourself a favor and don't waste your money, this food is sitting in storage for too long before it ships. I highly recommend the brand in general but not from here.",
      "rating": 1.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 12,
      "publication_date": 20181109
    },
    {
      "title": "My Maltese LOVE LOVE LOVE this food!",
      "text": "My Maltese absolutely LOVE this food. It can be hard to get my little Maltese to eat food sometimes but not with Ziwi Peak. Both of my dogs go bonkers for this food. It's pricy but you don't need to feed as much because there isn't any filler. It is calorically dense. And of course my babies are worth it. The food is soft as opposed to crunchy, so I think it tastes more like meat to them. One of my dogs had a few teeth pulled, making crunchy kibble a challenge. Ziwi is easy to eat for dogs with missing teeth or sensitive gums.",
      "rating": 5.0,
      "verified": true,
      "author": "SeizeTheBay",
      "helpful_votes": 33,
      "publication_date": 20160620
    },
    {
      "title": "Excellent product in general but NOT when ordering from Amazon",
      "text": "I give Ziwi Peak air-dried chicken as training treats. My dog is quite motivated by them. When I have bought from elsewhere, there is generally a cup or so of crumbles/dust left in the bottom of the bag that I pour into a bowl to feed as a special meal or mix with water and freeze in a Kong, etc. With Amazon, however, the bag came at least half full of crumbles/dust rather than formed pieces. See photo. I will not be ordering from Amazon again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20191026
    },
    {
      "title": "The new formula is not so great...",
      "text": "I am very disappointed in the new formula. Prior to the formula change my 7 year old Yorkie loved the Ziwi Peak Lamb and Beef, I couldn't be more happier with the product. Since the new formula has been introduced and the pieces are more brittle (verses soft) she no longer likes it. After 1 week of attempting to feed her the new formula, I also noticed she had sever diarrhea and I stopped feeding her the Ziwi Peak Beef immediately. It's unfortunate I need to find another brand which would be best for her sensitive stomach.",
      "rating": 1.0,
      "verified": true,
      "author": "ADRIEL M.",
      "helpful_votes": 10,
      "publication_date": 20170411
    },
    {
      "title": "Great for my older dog",
      "text": "My doggy is now 17, but I started giving her this when she turned 16. The food is air dryed so it's not hard and crunchy thus making it easier for her to eat. It is pricey, but worth it since she eats it all and she makes solid tootsie rolls in the yard. When she stopped eating the food I had always given her since it was hard to chew, I had a hell of a time finding something she would eat consistantly. She wouldn't touch wet food and I really didn't want her to eat that crap, pluscleaning up her mess in the yard was painfully difficult. This is worth it imo.",
      "rating": 5.0,
      "verified": true,
      "author": "Evelyn Salt",
      "helpful_votes": 7,
      "publication_date": 20170815
    },
    {
      "title": "Both are under 15lbs so fortunately, it doesn't break the bank for me",
      "text": "Ziwi Peak is the ONLY food I will ever feed my dogs. Both are under 15lbs so fortunately, it doesn't break the bank for me. My dogs have never been healthier. Both are senior dogs, 11 and 13 years old and are always being mistaken for being only a couple of years old. Trips to the vet are almost nonexistent save for checkups and vacs. The dogs never refuse their food or leave any behind and sometimes I think they are going to lick the chrome off of the bottom of their food bowls trying to get every last crumb.",
      "rating": 5.0,
      "verified": true,
      "author": "Bookworm",
      "helpful_votes": 7,
      "publication_date": 20170802
    },
    {
      "title": "A very happy dog lives at my house",
      "text": "My dog is the happiest she has ever been at mealtime. I originally was adding this as a treat to her food because she was not eating enough. We have been feeding very high quality food for years but she picks at it. She DEVOURED this food; filtering it out of the other kibble. It is expensive but you can feed less volume. If you are like me and you adore your dog, then you may be willing to pay more for a quality food that makes your dog crazy happy. My dog is 11 and she acts like a puppy full of vim and vigor. She looks very healthy! I just put this on automatic order.",
      "rating": 5.0,
      "verified": true,
      "author": "EDH shopper",
      "helpful_votes": 6,
      "publication_date": 20170309
    },
    {
      "title": "Made my dogs very ill",
      "text": "I have used Ziwi for my three dogs for several years with no issues. In the last few months after ordering from Amazon my dogs have become violently ill with lethargy, panting, coughing and diarrhea. The food has been off on texture, smell and color. Especially the LAMB formula. I would not order Ziwi from Amazon again. I caution other dog owners to do the same.",
      "rating": 1.0,
      "verified": true,
      "author": "nic1976",
      "helpful_votes": 4,
      "publication_date": 20190806
    },
    {
      "title": "Not fresh off Amazon",
      "text": "I buy usually from Pet People or Chewy but was in a bind and bought a small bag from Amazon. Definitely NOT the quality you get from Chewy or Pet People, the bag from Amazon was really crumbly and it seemed very old. My dog didn’t complain though, she ate it and it didn’t upset her stomach. I probably won’t buy from Amazon again unless I have too.",
      "rating": 3.0,
      "verified": true,
      "author": "Timothy Gorman",
      "helpful_votes": 2,
      "publication_date": 20200101
    },
    {
      "title": "The best dog food (if you can afford it)",
      "text": "This is the first dog food in the 12 years that I’ve had my German Shepherd that my German Shepherd will eat readily. We’ve tried all possible dog foods under the sun (high protein, grain free, limited ingredient, multi protein, raw, etc) and this ziwi food is a winner by a long shot! At nearly US$15/lb it is however prohibitively expensive. By comparison, that same NZ lamb costs only about $8/lb in our local grocery store. Given the size of my dog (85lb), this Ziwi dog food comes out to $70/week, that’s $300/mo with is a BMW 3-Series monthly car payment!",
      "rating": 5.0,
      "verified": true,
      "author": "FitFashion",
      "helpful_votes": 2,
      "publication_date": 20181123
    },
    {
      "title": "Super food - just don't buy from Amazon!",
      "text": "My dog has been on ZiwiPeak for a while now, but all we can find in stores is the 16oz size (and the stores are all over an hour away). There were several reviews saying that their order from Amazon was stale/different, but they were older reviews so I decided to give it a try. WRONG! It was terrible. The usual stuff is tender, like small pieces of beef jerky. What was delivered from Amazon was brittle, dry, smelled funky and some pieces have light coloring at the edges. I can't tell if it's something growing on it or discoloration from heat. I'll continue to buy Ziwipeak, but not from Amazon.",
      "rating": 4.0,
      "verified": true,
      "author": "MAB",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "New formula makes the food too hard",
      "text": "I agree with some of the other post concerning their new formula. I have Pomeranians and now the food is too hard. I have been feeding your food for years now and I am going to have to go to another air dry dog food because it is too hard for the little dogs. They are not eating it says the new bag came.",
      "rating": 1.0,
      "verified": true,
      "author": "Daveena K. Michael",
      "helpful_votes": 8,
      "publication_date": 20170420
    },
    {
      "title": "Great for training, the dog loves it",
      "text": "Even though this is a dog food, my dog's trainer recommended this product for use as a training treats. The dog absolutely loved it and responded incredibly well in training. I like this so much netter than commercial dog treats because it is nutritionally much better for the dog. Yes, this is an expensive product, but for my use it will last a very long time. There are other flavors-- the dog's favorite is the Venison, however that flavor is considerably more expensive. This flavor, Lamb & Tripe, is cheaper and a very close second in flavor/ preference for the dog. The bag has a zip lock seal for freshness.",
      "rating": 5.0,
      "verified": true,
      "author": "CBS",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Excellent but not for my purpose",
      "text": "This is a n excellent product if you can afford to feed it as the main food source for your dog. However, I bought it to use for training treats/motivation. It worked well for motivation, but got crumbly/dusty as it dried a bit over time. I ended up using the remaining dust pieces as top dressing at mealtime, and as treats for my cats. I have switched to string cheese along with strips of meat I dry myself in the oven. Much more affordable for treats with my two large dogs.",
      "rating": 4.0,
      "verified": true,
      "author": "Domino72",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Smashed into tiny pieces and dust",
      "text": "I really like Zwiki Peak, but will get them directly from the store. Having it shipped the food gets smashed so the food pieces end up being really tiny or ground to dust pieces. Otherwise, Ziwi Peak is an excellent brand and product.",
      "rating": 4.0,
      "verified": true,
      "author": "bookwormTop Contributor: Pets",
      "helpful_votes": 2,
      "publication_date": 20200123
    },
    {
      "title": "Flavor",
      "text": "This is the only dog food that my dog will eat. Sometimes it takes a day or so or I add cheese but she will eat it. The beef flavor she wouldn't eat and all the other brands I tried (and expensive ones) she would not touch. I don't know if it is the Mackerel in this one that she likes but I am just happy I found a dog food that she will eat. She is the cutest and sweetest mutt but oh so picky! Even tried cooking for her. Its pricey but worth it.",
      "rating": 4.0,
      "verified": true,
      "author": "Phyllis C Seitz",
      "helpful_votes": 2,
      "publication_date": 20181128
    },
    {
      "title": "Buy from the company itself",
      "text": "I have always bought this product from ziwi peak itself, but I figured I would try buying it on amazon. Never again, the food itself is had an almost white coating on it like it’s been contaminated , even though the date on it was good. Will purchase from the actual company from now on. What a waste of 80.00 dollars.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20190312
    },
    {
      "title": "The next best thing to raw feeding.",
      "text": "This is absolutely the best dog food. Air dried so no nutrients are lost. My dogs love it . It is expensive but you feed less and it satisfies them. It is formulated with the balance of minerals, vitamins, probiotics needed so you don't have to add anything else. Tfhis is as near as you can get to a raw food for your pet. Read the label and you will see. I have also gotten the mackeral and lamb air dried from ZiwiPeak and it is their favorite--Amazon when are you going to carry this new product of ZiwiPeak? I keep looking for it on your website.",
      "rating": 5.0,
      "verified": true,
      "author": "mwb-Virginia",
      "helpful_votes": 3,
      "publication_date": 20170407
    },
    {
      "title": "Great food!",
      "text": "Very expensive so i will only be feeding to my small dog. No way can i afford this for my large dog. Arrived packaged well, not crumbled or dry. Its packaged in a box then inside another box so it didnt turn to powder. I read that some dogs get too much fat and get sick from this type of food so I am going to cut it with dr harveys miracle dehydrated food so he doest get too much fat in his diet.",
      "rating": 5.0,
      "verified": true,
      "author": "Jarbells",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "High quality dehydrated raw food diet dogs love",
      "text": "Ordered originally on a recommendation of a local pet store. My dog has an allergy which we have not been able to identify the trigger. Many allergies are food related. Pet store personnel recommended changing my dog to a raw food diet. Took about a month or so but Bella stopped chewing on her feet. We had friends over who brought their mini chihuahua over who is extremely picky. She LOVED the Ziwi Peak dog food. Gobbled it up.",
      "rating": 5.0,
      "verified": true,
      "author": "DD",
      "helpful_votes": 4,
      "publication_date": 20170314
    },
    {
      "title": "Our dogs LOVE Ziwi",
      "text": "Especially the chicken flavor, but they also dig the lamb and beef. One of our Ratties is a picky, bored eater and he devours this stuff. It has improved the look and feel of their coats by a lot. Both are very healthy...is this the breed or the food or both? It is quite expensive as dog food goes (1 star eliminated), but they are small and don't consume a lot.",
      "rating": 4.0,
      "verified": true,
      "author": "Liam Friedland",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "the only food he'll eat",
      "text": "My little rescue guy is about 8 lbs and HE LOVES THIS FOOD. He is a very healthy and active 4 year old terrier mix. We tried him on all kinds of less expensive brands and he just wouldn't eat and got disturbingly thin. Not sure what household he escaped, from but apparently they fed him well...He is a \"self feeder\" so we don't really monitor his food too closely, but he seems to go through a 2.2 lb bag of the beef variety about every 6 weeks to two months. Cannot recommend this food more highly. It is, of course, ridiculously expensive up front, but I think the lack of vet bills will cover the food bill.",
      "rating": 5.0,
      "verified": true,
      "author": "Bad Tabby",
      "helpful_votes": 3,
      "publication_date": 20160616
    },
    {
      "title": "Best Dog food with no carbs",
      "text": "This is the best dog food for dogs! My Boston Terrier had candida systematic yeast infection from eating bad dog food with carbs. Carbs turn to sugar and feed the yeast. This is the only dog food I could find that didn't have carbs in it! It is a little expensive, but it is cheaper than paying the vet bills! It is also so dense in nutrition, he doesn't eat as much as other dog foods and has less poop. You don't have to give them any vitamins either! Love this food!",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Jean Rutledge",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "After reading online I was comfortable feeding it to my dogs",
      "text": "I ordered this after researching the company. They are out of New Zealand and it seems to be very high quality. As far as I can find New Zealand is one of the few countries not allowing GMO crops. It does say on their site that some ingredients are imported but they are clear that nothing comes from China. After reading online I was comfortable feeding it to my dogs. It came fast and well packaged. My cat went nuts for it as I was feeding it to the dog so I have started letting her have some of it also. I have just started feeding this so I can't say what the affects on the dogs will be yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Latiolais",
      "helpful_votes": 2,
      "publication_date": 20161220
    },
    {
      "title": "Great as snacks, too",
      "text": "We have tried different flavors but the “Tripe & Lamb” is a hit for our GSD mix. We only give him one scope max as snacks between his homemade meals (he is raw-fed twice a day). This is also great as high-value treats for training so we don’t need to worry about he gets too much.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy JST",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Why the quality is so different?",
      "text": "I've been a long time client of Ziwi Peak brand from Chewy's, but I've never seen such a dry and tasteless bag before after I ordered in Amazon. My dog tried different kind of Ziwi Peak, and it is usually moist and flavorful unlike many other dog food brand also I confirm as I taste what my dog will eat. This one ordered from Amazon is dry like some kind of flake, more like a dried-up cracker that crumble and almost didn't smell anything but acidic jerky. Is this maybe old? I don't know, but the quality difference is quite apparent.",
      "rating": 2.0,
      "verified": true,
      "author": "Galaxy",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Best Raw Food in (air) dried form.",
      "text": "My 6 month old Italian Greyhound had diarrhea on this version, but cleared up to nice firm stools on the next bag I bought in BEEF flavor. I really like the company and their approach to healthy food. Most “grain free” dog food products are stuffed with cheap fillers like potatoes and legumes (beans and peas.",
      "rating": 5.0,
      "verified": true,
      "author": "AB",
      "helpful_votes": 2,
      "publication_date": 20180727
    },
    {
      "title": "My dogs love it!!!",
      "text": "I have 2 Mexican Hairless and a Chinese Crested dogs. They have had some skin issues so I have been researching ingredients in dog food. I was very impressed with what I read about ZIWI dog food so I decided to give it a try. I am staying with ZIWI. I have seen a difference in their skin PLUS they love it!!! My sister's dog is a super picky eater so I suggested she try it and he loves the food and gobbles it up!! What they put into it is nothing but the best, and that is what I want for my dogs!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Barrett",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Wonderful product!",
      "text": "This is a wonderful product. I use this instead of treats just because it's healthier. When we come upon a new dog, they aren't interested because it doesn't smell much, BUT once they eat the first one, most dogs LOVE it!! Recently the product must have changed because it's harder than it used to be. Probably so it doesn't break as easily as it used to, but it still a great product. I used to feed this product to my underweight foster dogs as their meals to help them get better faster. I can't say enough about how great ZiwiPeaks are.",
      "rating": 5.0,
      "verified": true,
      "author": "EM in WA",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "DO NOT PURCHASE! Food is old and crumbly",
      "text": "I purchased the tripe and lamb recipe and couldn't be more disappointed. The food was REALLY dried and crumbly and had an unusually stale smell. This food is pretty expensive, so I am extremely upset at the quality of this product. My 2 Shih Tzu's would not even touch this stuff. Save your money and buy something else.",
      "rating": 1.0,
      "verified": true,
      "author": "G. Luke",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Great food, bad shipping",
      "text": "The product is fantastic. I feel very comfortable feeding this to my dogs and the cats steals it too. I give AMAZON A ZERO FOR SHIPPING!! This is a delicate food that beaks easily. The food bag is placed in an UNPROTECTED PLAIN PLASTIC BAG. When I received the food much of it was reduced to powder! It needs to be. In at least a bubble wrap.",
      "rating": 5.0,
      "verified": true,
      "author": "Nana Betty",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Excellent Product, Useful as treats",
      "text": "I feed my dogs raw and I use this food as shelf stable treats. I put a scoop in 2\"x3\" resealable bags so I can take them on walks and reward them when training. They don't mess with their normal diet, are made from exceptional ingredients, and are a reputable company. If I needed to feed my dogs 'dry' food, I would definitely consider Ziwi Peak as a main contender. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "keyinherpocket",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Made my dogs sick",
      "text": "The first bag was fine and my dogs liked it. Was glad to find what I thought was a really high quality healthy food for them. I put it on auto ship and then the second bag was much darker in color and my dogs puked every day even when I cut it back to less than 1/4 of a cup twice a day. Don't know what the difference was other than the color was light brown in the first bag and dark brown almost black in the second bag. Unfortunately I had to return and am looking again to find a good high quality food to feed them.",
      "rating": 2.0,
      "verified": true,
      "author": "B. Flanagin",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Wonderful for high value treats",
      "text": "I don't use this as my primary dog food, but it's great as high value training treats. My dog values this as much as actual cubes of chicken breast, except this is much easier to prepare for me! I'll take pouring it into his treat pouch over cooking and chopping up chicken any day :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Mary E Kidd",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "My Dogs are Worth this Quality Food!!!  I highly recommend it.",
      "text": "Long Story ..... but my little 12 lb.. Bichon Mix had extreme surgery for a bad case of stones. The prescribed dogfood caused a lot of intestinal issues .... Since I'd used ZP with transitioning from a healthy raw diet for another dog .... I decided to try it as a last resort. End of Story: She's been on Ziwi Peak for 5 years now ..... No more stones! She's a happy, healthy, [& frisky] 14 year old. Now all my dogs enjoy this food.",
      "rating": 5.0,
      "verified": true,
      "author": "White dog",
      "helpful_votes": 2,
      "publication_date": 20170708
    },
    {
      "title": "Incredible value for my pet's quality of life",
      "text": "When I adopted my then 11 yo dog he had regular seizures. After switching to Ziwi Peak they went away. He's 17 now and going strong. He's got good vision, heals quickly, and is still spry. I'm very grateful to this product. I grind it up and add a touch of hot water to serve.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon K Shults",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Great Ingredients",
      "text": "At close to $15 a pound for the 2.2 lb bag, I don't feed this every day. I keep it for those times when I don't have any home made raw prepared, or when I want to rotate through a variety of foods (which I do on a regular basis, for my dog's health.) Makes a decent training treat, not greasy or sticky, but does tend to crumble a bit. The ingredients and manufacturing seem top notch, I would love it five stars worth if it was more affordable.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Seaton",
      "helpful_votes": 0,
      "publication_date": 20171224
    },
    {
      "title": "My finicky pup gobbles this up.",
      "text": "My dog went off her food and was having stomach problems. After a month of chicken and rice we tried Ziwi brand. She gobbles it up, which is surprisingly since she is a finicky 5lb Pomeranian who had to be encouraged to eat the chicken. She eats this happily. I am so glad Nzymes recommended this.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Sunnie's food has changed to bags of crumbs! 😒",
      "text": "I've been purchasing this dog food for my dog since I got her 2 and a half years ago. She loved it and still does. My problem is that most of the bags are half crumbs. Sunnie will not eat the crumbs. I'm paying for a full bag and ending up with half a bag. I don't understand why the food has started arriving with the bag full of crumbs. She love it but if things don't change I'm going to have to find another brand of air dried food.",
      "rating": 3.0,
      "verified": true,
      "author": "L Looslie",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Vet recommended for my picky eater",
      "text": "Loves this dog food. Finally eating and getting weight back up. Recommend by vet for my puppy. Ingredients speak for self. This food does not require a puppy formula as it is packed with everything they need. She’s finally getting to correct weight.",
      "rating": 5.0,
      "verified": true,
      "author": "DBAKER",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "made my dog sick",
      "text": "I have purchased this pricey dog food several times in the past and my dog loved it...- this newest bag smelled awful, my dog had one small serving and vomited later in the day.....I threw the whole bag away. I wont re-purchase this product.",
      "rating": 1.0,
      "verified": true,
      "author": "lavender",
      "helpful_votes": 2,
      "publication_date": 20190822
    },
    {
      "title": "Best food, but stale from Amazon",
      "text": "This is the best food ever, but I finally received the infamous stale bag from Amazon. The stale bag was the 8lb Beef flavor, which I've ordered before and it was fine. Luckily, Amazon refunded my order and I was able to order the Lamb and Tripe formula. It's very soft, like high grade jerky. My dog thinks she's getting human food. She loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "bb",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "exceptional food for my dogs",
      "text": "Both my cattle dog and german shepherd are doing very well with this food from Kiwi Peak. There are enough calories and NO fillers. My dogs eat some of this food in their bowls but they also work hard for the remaining amount of their portions in training. The Lamb Makeral tend to break up in my pocket but the venison is an excellent training food. Feed your dog while you train! Their bowls will stay very clean:)",
      "rating": 5.0,
      "verified": true,
      "author": "mid-century",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Dakota is addicted to Ziwi Peak",
      "text": "I wish I could feed this as our primary food, but with a 55 lb dog, I’d go broke. We use them for training treats, and as far as a bag goes, this is actually very reasonably priced compared to some of the other treats of this quality. My dog goes nuts for these, as do the dogs in my classes. I like that these are super healthy and all good ingredients, great for my boy who has food allergies.",
      "rating": 5.0,
      "verified": true,
      "author": "RachelTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Best Dogfood Ever!",
      "text": "I have two very spoiled dogs. They are sensitive to a number of things. They love this food. I think they think it's a treat. It looks like little pieces of beef jerky. They prefer the beef. There is something fishy in it as well. I'm not at home so I can';t remember but I think it's mussels. It is not cheap but my dogs will eat it and it has never caused them any discomfort.",
      "rating": 5.0,
      "verified": true,
      "author": "MsSKing",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Moldy green after one week of opening the bag",
      "text": "I’ve bought ziwi dog food for years now for my dogs. The last bag of ziwi dog food became moldy green after one week after opening it. I’m considering buying ziwipeak from another company.",
      "rating": 1.0,
      "verified": true,
      "author": "Susan Truong",
      "helpful_votes": 3,
      "publication_date": 20190725
    },
    {
      "title": "My dog got sick!",
      "text": "I originally bought the lamb and the dogs loved it. Decided to try the Mackrell and lamb and one of my dogs got pretty sick from it! Took him to the vet and the vet thinks it might be the fish in the food that doesnt agree with the dog. Maybe I should go back to the lamb, but spending another $90 doesn’t seem very practical.",
      "rating": 1.0,
      "verified": true,
      "author": "Maarty",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "They come smashed and crumbled up coming from Amazon.  NOT GOOD",
      "text": "The product is suppose to be little squares instead it comes grind up smashed. Must happen in the amazon warehouse. Not good.",
      "rating": 1.0,
      "verified": true,
      "author": "diane holt",
      "helpful_votes": 3,
      "publication_date": 20190612
    },
    {
      "title": "Not good for my dog",
      "text": "I thought this food sounded great and reviews good . I very slowly switch over after 2 weeks and at 1/2 & 1/2 my dog had stools like water . Been to the vets several times now and he is still not back to normal. The only thing the vet could come up with was maybe I got a bad bag. Watch your dogs stools if you switch to this .",
      "rating": 1.0,
      "verified": true,
      "author": "Douglas Wyatt",
      "helpful_votes": 4,
      "publication_date": 20171112
    },
    {
      "title": "Healthy Food",
      "text": "Great healthy food, good that our dogs are small - as this food is very expensive. One is a very picky eater and she eats it. I have noticed improvement in health in one of our dogs with this new diet. Hoping to avoid the Vet at all costs....",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "My dogs absolute favorite dry food",
      "text": "My small dog loves this dry food. I’ve been feeding it to her three times each week for over a year. Hard to find in many pet stores. There’s a small scoop inside each 1 or 2.2 pound package which is one serving. There are several flavors but the Mackerel and lamb is a favorite.",
      "rating": 5.0,
      "verified": true,
      "author": "David Gilchrist",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Good for fussy eaters.",
      "text": "This food is of the highest nutritional quality so is perfect for my two fussy Cotons. Even is they only eat a little of it they are getting the vitamins and minerals that they need. I like the price the least!",
      "rating": 5.0,
      "verified": true,
      "author": "Carol A. Marks",
      "helpful_votes": 2,
      "publication_date": 20180802
    },
    {
      "title": "Excellent",
      "text": "I searched a long time for the best grain free dog food. Ziwipeak was listed in many dog reviews as a five star food. I like that the meat comes from new Zealand. The animals are grass fed, so much healthier than the gmo soy grains. It's also air dried, so retains more nutrition. It arrived on time and I presented it to my dog after I opened the ziploc bag. She got really excited! I gave her the portion for her weight and she loved it. I feel really good about spending more money on a quality food.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee Brooks",
      "helpful_votes": 3,
      "publication_date": 20150723
    },
    {
      "title": "Dogs loved it.",
      "text": "I used this as a treat added to regular food and they liked it. I would buy more but a bit pricey. My one dog can only eat lamb, a husky/aussie mix , high allergy dog, I have to mix several lamb brands to give her the right nutrition.",
      "rating": 5.0,
      "verified": true,
      "author": "AussiegirlIngridTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "EXCELLENT PRODUCT!!!!",
      "text": "I have never found this in any local store. We have used this for our dogs as a topper on their kibble. Very high quality food. We chose to get this because it was the only place we could find this large size . Excellent food. Will definitely buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Dog loves it!",
      "text": "This is very expensive! I bought this as a training treat and sometimes use it as a topper for food. My dog loves it, and it’s healthy. So, I can’t think of anything negative, except I wish it was more affordable.",
      "rating": 5.0,
      "verified": true,
      "author": "Elsa A",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Dogs tummy and BM are back to being healthy",
      "text": "I have picky dogs with sensitive tummy’s or so I thought. They love this food. And although it’s quite pricey, I’m not serving as much and I no longer keep buying food they don’t like. Also the “ plump” dog is finally losing weight and has more energy! Also their tummies have finally settled down and they now have normal bowel movements.",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie T Wilganowski",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "No more ZiwiPeak for Stella, sniff",
      "text": "My little poodle girl loves this stuff. She'll even do tricks for one when I use it for treats. But, it's too expensive for everyday feeding. And, I'm not sure I trust the company anymore. I subscribe to Dogfood Advisor, and according to him, the people at this company were rude and uncooperative about some basic product questions. This is a red flag to me because D.A. is credible and I trust his reviews. I am now feeding Acana, which, surprisingly, the picky girl loves just as much. Well, almost. Grain-free, five stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Tin Ear",
      "helpful_votes": 0,
      "publication_date": 20160509
    },
    {
      "title": "Great ingredients",
      "text": "It’s such a great brand of food I use it to entice my dog to eat her food",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle M.",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Worth it!",
      "text": "Although it is expensive.. it is best. My 12 yr old german shepherd who longer enjoys normal style kibble absolutely LOVES this. It’s more of small jerky pieces so he thinks he is eating treats. :) Great for all dogs .. especially for picky eaters and/or older dogs",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "But my dog liked the soft ones I bought previously but has a ...",
      "text": "This package of treats wasn't as soft as ones I've bought in stores. I'm not sure if it's because it's stale/older or because maybe it gets too hot/cold in the warehouse? But my dog liked the soft ones I bought previously but has a hard time chewing these. So sad because they are expensive! This is the second time I've had treats be stale/hard when I get them on AMZ, cryyyy!",
      "rating": 2.0,
      "verified": true,
      "author": "beautymaven",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Great product",
      "text": "Dog loves it. Just as convenient as kibble yet all the quality of raw. If it was so expensive I’d give it 5 Stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Stacey",
      "helpful_votes": 2,
      "publication_date": 20190211
    },
    {
      "title": "Excellent high-quality all carnivore dog food!",
      "text": "My super picky dog loves this food. This is the first truly all carnivore food I have found that she enjoyed from the first sniff. The ingredients are very impressive. The size of the pieces is perfect for my small dog. Will definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "MNM",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Great product!",
      "text": "Both on my dogs love this product. I put a small sprinkle of these on top of their kibble, and it interests them enough to stay and eat. One of them is very picky and will only eat these Ziwi pieces and not his food. I know you can feed these as a meal, but I am trying to conserve because they are expensive. Worth the money too!",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria VanDoorn",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Good for training treats but...",
      "text": "I am a professional trainer and all the dogs really like these treats! Downside is price and since they are harder dogs have to chew them when training vs a softer treat which is easier to ingest and keeps the training cadence flowing! WOuld be agood meal topper or appetizer to get the picky eater to eat.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "WoW!  Delicious",
      "text": "Quick delivery. What an awesome food! The Pups LOVE it. I wish I could afford to feed as a food but we use them mostly as treats or toppers but out of all the many dog foods I've bought over the years this probably surpasses them all!",
      "rating": 5.0,
      "verified": true,
      "author": "LK Sund.",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Ziwi Peak Air Dried - Teacup Chihuahua Approved",
      "text": "Very high praise for Ziwi Peak air dried food. My teacup chihuahua is extremely picky and she just loves it.. grain free and next best to a raw diet(air dried).. easy to chew for the tiniest of teacups ✌️",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie Johns",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "ONLY dog food my dog will always eat",
      "text": "My dog does NOT like dry dog food. In 11 months I tried 11 brands, and this is the ONLY one he will eat EVERY time. (He may eat the other dry dog food for a week if I'm lucky but that's it.) This food is REALLY expensive so I don't buy it very often, but I also don't need to feed him a lot of it. Ziwipeak is like little jerky pieces, not really \"dry\". My dog always looks for more. Just wish it wasn't so expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "DVD Watcher",
      "helpful_votes": 4,
      "publication_date": 20150512
    },
    {
      "title": "but he's not anywhere near as happy about it as when I make him food",
      "text": "OK product, but so absurdly expensive for the quantity, that I will no longer buy this food. It's way cheaper to make my dog's food with organic, human grade ingredients, and not even that hard. He eats this, but he's not anywhere near as happy about it as when I make him food. Seriously- this price is outrageous, and takes advantage of people loving their pet.",
      "rating": 2.0,
      "verified": true,
      "author": "A. Dollner",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Our dogs love it!",
      "text": "So, I am able to rate \"flavor\" based only on how much our dogs seem to enjoy this food. Be aware though, that a high proportion of calories comes from fat (approximately 30% based on the specific formula). While this is not typically an issue, it can be if your dog is prone to pancreatitis, for example.",
      "rating": 5.0,
      "verified": true,
      "author": "GJRM",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "delicious dog food that will require me to rob banks at age 82",
      "text": "it is the only dog food the little ones will eat. they are fed people food recommended by the amer. kennel club and then give to scoops to gnaw on in the day time. they love it and I feel I am feeding them good food--not cancer ridden dog food.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean Coyle",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "This makes for the perfect sized training treat",
      "text": "This makes for the perfect sized training treat. It drove a couple dogs into almost too high of a drive when they smelled this food. While I can't afford to feed my large dogs this food, I can use it for training. I have found this to be a very high value food for training rewards. Use with caution and adjust accordingly so that your dog can still concentrate on the training. It might drive some dogs into distraction. I found some even preferred this food over some cooked pork loin I had left over and had cut into small training treats! That was a first. Must be the organ meats in this food that makes it smell so tempting.",
      "rating": 5.0,
      "verified": true,
      "author": "MalinoisLover",
      "helpful_votes": 0,
      "publication_date": 20140908
    },
    {
      "title": "Smelly and high value",
      "text": "My dogs will spin circles for this food. They smell strongly of lamb, but that makes them even more delicious and valuable to the dogs. I use them as high value rewards/treats, per the recommendation of my trainer. I like that they are healthy, and I dont feel bad heavily treating when we have a long work day.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily McArdle",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "It's a Keeper for Us",
      "text": "My dog eats it in a flash. She never did that with any other food before. She has been eating this food for about a month. REPORT: no bad breath,flaky skin-gone, coat shiny and soft, poop is 1/2 the amount,even her teeth look better. Although this food IS expensive, (I only feed her a cup a day-she's 11 lbs) for the benefits shown it is a 'keeper' for us. It is at the least worth a try for you.",
      "rating": 5.0,
      "verified": true,
      "author": "angela d",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Shocked at the price increase on venison",
      "text": "I do appreciate a high quality dog food for my dog; however, I do not understand the outrageous price increase on the venison for 2.2lb bag. At this price I cannot even afford it as a topper or a treat. Did there become a shortage in venison?",
      "rating": 1.0,
      "verified": true,
      "author": "amr",
      "helpful_votes": 2,
      "publication_date": 20180429
    },
    {
      "title": "Air dried raw food is a great alternative to real raw in a pinch. ZiwiPeak is the best.",
      "text": "I feed raw but when I'm not home and need someone else to feed the dogs, or when we're traveling, this is my go-to brand. It's expensive, but you don't need to feed a lot of it. I have small dogs, so a bag of this lasts for quite awhile at the rate I feed it. I always keep a bag of this on hand and find it to be very high quality food. I also use it for treating the dogs sometimes, and in their treat toys, and they all love it. I have literally never had a dog not clean his or her dish of this food.",
      "rating": 5.0,
      "verified": true,
      "author": "Fran Wickham",
      "helpful_votes": 0,
      "publication_date": 20151029
    },
    {
      "title": "Great for dog treats",
      "text": "I wish I could afford to feed this food to my dogs, but it would cost too much to feed it to larger dogs. I use it as dog treats for training, I think it is much more healthy than some of the other treats I have used, and the dogs love it. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Dog Lover",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Dogs show improved vitality.",
      "text": "Dogs absolutely gobble this food down. They will turn down fresh chicken and eggs for this food! I just wish it was not so very expensive. But I also do not want the quality to decline .",
      "rating": 5.0,
      "verified": true,
      "author": "Krista Marie",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "my dog LOVES ZIWIPEAK",
      "text": "My dog does NOT really care for dog food. We go through a different brand every month (most gets thrown out because he won't eat it). HOWEVER, he LOVES ZIWIPEAK. He cannot get enough of it! It's really expensive, however, so I cannot afford to get him this all the time - but am trying to mix it with his regular food to make this 2 lb bag stretch a little further. I wish I could afford to feed him this all the time since he REALLY LOVES IT, but have to do it more of as a \"special treat\". It is the only dog food he'll eat willingly with no problem. (Just wish it wasn't so expensive!!!)",
      "rating": 5.0,
      "verified": true,
      "author": "DVD Watcher",
      "helpful_votes": 0,
      "publication_date": 20141202
    },
    {
      "title": "Excellent dog food",
      "text": "High quality dog food. Been feeding my dog for years. She is very healthy",
      "rating": 5.0,
      "verified": true,
      "author": "easymoney",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Great product except for this time",
      "text": "This is the only brand my dog eats but this time all the pieces were crumbled. The bag didn’t seem to be fresh even though it was sealed. I tossed it",
      "rating": 3.0,
      "verified": true,
      "author": "2BHRH",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Pricey, but a great dog food.",
      "text": "My dog loves this brand and had no change over issues. The only reason she is still not eating it, is the price. Should the bags get bigger for the price charged she will be eating thus exclusively.",
      "rating": 4.0,
      "verified": true,
      "author": "MoBee",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "What Nature Intended",
      "text": "This brand is my dogs mainstay for breakfast. At least once a day he gets all the nutrients gleamed from liver, lung and tripe. These are the first things wild animals consume after a kill so I feel I should be giving them to my dog. This product makes it easy. I rotate the protein each time I buy a new bag. Panini loves this dog food and he's worth the extra money. He's only 19 pounds so he doesn't need a lot of food. Plus, once I got him off kibbles, he shed 4 pounds Which was 17% of his body weight! If my math is correct it would be like a 200 lb person loosing 34 lbs!",
      "rating": 5.0,
      "verified": true,
      "author": "SoxFox",
      "helpful_votes": 0,
      "publication_date": 20150220
    },
    {
      "title": "Great for high value treats on the go",
      "text": "I use this for high-value treats when I'm out and about and it's inconvenient to bring cheese or meat. My dogs love it! I've used it in high-distraction situations (Clicker Expo and other seminars) and they are thrilled to work for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelby",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "I like to intersperse her regular food",
      "text": "our little one loves this food! My friend would always have it our for her dog, and when we came over, my dog (9 lbs) would devour this food. this is my 4th bag. I like to intersperse her regular food, Blue Diamond with Ziwi every other month. She loves the taste and its somewhat of a treat for her. Our Daisy Mae has shiny hair and loads of energy.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal B. Coke",
      "helpful_votes": 2,
      "publication_date": 20161007
    },
    {
      "title": "Expensive",
      "text": "I find it crazy to think the prices of this is appropriate. Feeding amts seem so small but my large dog seems to enjoy and be satisfied. She would eat 24 hrs with any food.",
      "rating": 4.0,
      "verified": true,
      "author": "groovy girl",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Happy and healthy puppy",
      "text": "My little monster loves this!! She is a puppy so I mix it with puppy pellets. Doesn’t last as long as I wish, but it’s definitely is the best I found for her!! She grows like crazy and seems very happy and healthy",
      "rating": 5.0,
      "verified": true,
      "author": "Madeleine Barmark",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Best food for fussy eaters",
      "text": "We have a tiny Yorkie and Biewer who are very fussy eaters and would like chicken breast for every meal. Luckily they can not resist this food, they think it is a treat. I want them to be on dog food for the necessary nutrition. Even if I sprinkle this on regular dog food it makes everything edible. They are now putting on weight and I am not worried about their health anymore. This food is expensive but my dogs don't eat much so it lasts longer and Amazon has the best prices.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Ann Johnson",
      "helpful_votes": 0,
      "publication_date": 20150717
    },
    {
      "title": "The worst dog food I have ever bought.",
      "text": "My healthy maltese got a bad case of skin allergies that ever since despite all sorts of vet visits and expensive meds has not got better. The poor dog was in pain and hiding in corners and we didn’t know what was happening. The vet said it was the allergy to new food. Please do your dog a favor and don’t buy this poison.",
      "rating": 1.0,
      "verified": true,
      "author": "arash goli",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "old and dry treats",
      "text": "Treats are dry and my dog wont eat them. Amazon sent me a new package and the next one was worse than the first one. These are not the same quality of freshness that you would purchase from a local store. These should be removed from Amazon due to poor quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Not worth the money",
      "text": "Unfortunately my dog didn’t like this dog food topper. She wouldn’t eat it and she never told my why. I’m so Disappointed because it was expensive and I was unable to get a refund",
      "rating": 3.0,
      "verified": true,
      "author": "Susan D.",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Be aware if your dog is allergic to fish",
      "text": "My toy poodle is allergic to many protein and grains so I thought this would be good. However my dog had an allergy reaction when he ate this. I asked his vet and found out that as my dog is allergic to fish, I can't feed this because it contains MUSSELS. Plus he didn't like this food that much, I had to force him to eat...it seemed like the taste wasn't good to him. Each piece is pretty small, flat square shape and hard, he had a hard time to chew as well.",
      "rating": 2.0,
      "verified": true,
      "author": "TKN",
      "helpful_votes": 2,
      "publication_date": 20150306
    },
    {
      "title": "High quality protein",
      "text": "My pooch loves it. I make home prepared food and I feel good knowing that he eats this as well to supplement his diet. Despite being fed fresh cooked chicken and beef, sweet potato and pumpkin, he still goes crazy over this dry food. Not kibbles, it's more like air dried chips of venison. Great stuff. Maltese are prone to have those brown tear stains, a breed specific allergy/food reaction but feeding him this dog food has completely eliminated that problem. I used to give him Orijen, but this is a much higher quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "Shenna.Reilley",
      "helpful_votes": 2,
      "publication_date": 20140406
    },
    {
      "title": "Texture is tough",
      "text": "I had researched and researched and was very satisfied with the ingredients and how this food is processed. The texture is very tough and my dog wouldn't eat it. He would spit it out. He is normally a chow hound.",
      "rating": 2.0,
      "verified": true,
      "author": "LynnB",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Dogs love it",
      "text": "My dog loves this product. Too expensive to use as daily dog food. I use it as a treat or training reward!",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "ZiwiPeak brand was recommended by a dog breeder to me",
      "text": "ZiwiPeak brand was recommended by a dog breeder to me. ZiwiPeak comes from New Zealand. The ingredients says it all. It is made of real meat. None of that fake food. The more they eat of this, the healthier for them. There's not need to limit them from eating ZiwiPeak. My dogs love it and I love it too. Vet said the brand is fine and gave us some cheaper alternatives. If I wouldn't eat it, then I wouldn't feed it to my dogs either. Good product and you really get what you pay for.",
      "rating": 5.0,
      "verified": true,
      "author": "Sexy Sonya",
      "helpful_votes": 0,
      "publication_date": 20140827
    },
    {
      "title": "QUALITY dog food",
      "text": "New Zealand has better food practices for all food, including pet food. This food is air dried so high heat doesn’t destroy nutrients. My dog LOVES their kibble.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila Hillhouse",
      "helpful_votes": 0,
      "publication_date": 20191210
    }
  ],
  "product_meta": {
    "title": "ZIWI Peak Air-Dried Dog Food & Topper Recipe - Natural High Protein, Alternative to Raw, Limited Ingredient",
    "description": "Flavor Name:Lamb| Size:2.2 lb\n\nZIWI puts the best of New Zealand into our authentic farm-to-bowl products. Our gentle, twin-stage, air-drying process naturally preserves all ingredients. Our air-dried food is ready to scoop and serve. And with no preservatives, sugars or glycerides, our food is safe, clean to handle, and a nutritious alternative to a raw diet.\n\nFeeding Instructions\n\nWeight Daily Feeding (2 oz Scoops) 2.2 lbs 0.4 4.4 lbs 0.6 6.6 lbs 0.8 8.8 lbs 1.0 11 lbs 1.2 16.5 lbs 1.6 22 lbs 2.0 33 lbs 2.8 44 lbs 3.4 55 lbs 4.0 66 lbs 4.6 88 lbs 5.8 110 lbs 6.8 132 lbs 7.8 Feed Ziwi Peak to your dog on a daily basis using the ration guide above.\n\nPuppies and Pregnant or Nursing Females: Feed approximately double the amount indicated, in 2 - 3 feedings per day. For your pet's health and well - being they should always have access to fresh, clean water.\n\nTransition Instructions Sudden changes in diet, including overfeeding, can sometimes result in digestive issues. Always introduce any new food by slowly mixing with your current diet for the first 6-8 days, increasing the amount of Ziwi Peak while decreasing the amount of the other brand.",
    "rating": 4.6,
    "feature_bullets": [
      "ETHICAL AND SUSTAINABLE: 100% ethically and sustainably sourced meats and seafoods from New Zealand's free-range farms and pristine blue waters with no added hormones, antibiotics, or growth promotants",
      "NUTRIENT DENSE: 3 portions of raw ingredients make 1 portion of finished air-dried, meaning you will feed less and your dog will have reduced stool volume. Gives kibble a nutritional boost as a 1 oz. meal topper too!",
      "MAY HELP PROMOTE: Allergy relief, healthy skin and coat, improved digestion, joint health and mobility, weight maintenance. Provides higher Taurine levels than nutritionally required to promote heart health.",
      "AIR-DRIED NUTRITION: Centuries-old slow and gentle air drying method naturally preserves food without artificial fillers while retaining nutrients and maximizing flavor. A great choice for the pickiest of eaters!",
      "LIMITED INGREDIENTS: Recipes made up of 96% fresh meat, organs, and bones, as well as powerhouse superfoods including green mussels, organic kelp, and green tripe. No Peas, Legumes or Potatoes included."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1 x 3 x 2 inches; 2.28 Pounds",
      "Item model number": "ZCDL1000PUC",
      "Department": "Dog-dry-food",
      "Date First Available": "May 23, 2009",
      "Manufacturer": "ZIWI",
      "ASIN": "B002AYA6M6",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item is not eligible for international shipping.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Dogs",
      "Dry",
      "Pet Supplies",
      "Food"
    ],
    "price": 41.99
  }
}