{
  "website_summaries": [
    {
      "verdict": "A heavy duty concealer that is great for your skin and has a ton of shade options.",
      "pros": [
        "Full coverage concealer that contains hyaluronic acid to moisturize and improve the look of fine lines",
        "Goes on smoothly and lasts a long time",
        "Available in 48 different shades",
        "Doesn't cake or crease"
      ],
      "cons": [
        "Thick formula can be a bit difficult to apply"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "DO NOT BUY!!!  NOT THE REAL PRODUCT!!!",
      "text": "As a loyal user of this product, I can tell you with 100% certainty that this is NOT the real thing. The tip, which is normally black, has been cut off and replaced with a clear one. The product, which is normally thick and provides great coverage, had obviously been replaced with a cheap concealer that was runny and translucent. Total trash and waste of money. Save your money, go to Ulta, and buy the REAL thing.",
      "rating": 1.0,
      "verified": true,
      "author": "Roger Martinez",
      "helpful_votes": 68,
      "publication_date": 20180829
    },
    {
      "title": "Counterfeit?",
      "text": "I am a makeup artist and 'it' products are outstanding. I have been using this concealer on myself and clients 4 years and it is fantastic. However this time I purchased on Amazon for convenience and I'm very disappointed. Does not seem like the same product. Thinner consistency right out of the tube , and when you try to blend it, it comes off completely. Be on the safe side and purchase it from their actual website or from Naimes, even if it cost a few dollars more. It's not worth the aggravation and you're getting an inferior product.",
      "rating": 1.0,
      "verified": true,
      "author": "Diane Radice",
      "helpful_votes": 24,
      "publication_date": 20190123
    },
    {
      "title": "No no honey",
      "text": "There is no way I got a brand new tube. Just opened it with an already tinted tip and have to squeeze it all the way to the tip just to get any out. This isn't already used one. I need a new one or a refund that's not how you run a business. There should be more product then half a tube trying to force it out",
      "rating": 1.0,
      "verified": true,
      "author": "Demetria",
      "helpful_votes": 58,
      "publication_date": 20171208
    },
    {
      "title": "It was half full, I have bought it from ...",
      "text": "It was half full , I have bought it from it cosmetics n it last forever. I won't be getting it from amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Dolores Beatty",
      "helpful_votes": 21,
      "publication_date": 20180315
    },
    {
      "title": "Amazing results!",
      "text": "This is the best concealer & foundation I have ever used. That is a lot of experience because I'm 75 years old. I wish I had IT when I was younger. The Bye Bye under eye actually hides the puffiness & dark circles under my eyes with out looking \"caked-on\". I have been using MAC & Esre Lauder. Neither can compete with the coverage or dewy radiance IT products provide for my tired old face.",
      "rating": 5.0,
      "verified": true,
      "author": "JANICE",
      "helpful_votes": 15,
      "publication_date": 20160616
    },
    {
      "title": "It's very very thick - I find it best to use a small make-up brush to apply",
      "text": "unbelievable!!!! It's very very thick - I find it best to use a small make-up brush to apply, and I dampen the brush first. Only need the smallest amount. It's a little pricey, but will last forEVER!",
      "rating": 5.0,
      "verified": true,
      "author": "RKM",
      "helpful_votes": 16,
      "publication_date": 20161207
    },
    {
      "title": "Great product!",
      "text": "This product is the only one I use for a concealor. I'm 62 years young, sleep deprived, and count on this product to make me look awake and refreshed. I just bought another tube and will keep on buying it as long as it's available. Leslie",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie",
      "helpful_votes": 14,
      "publication_date": 20170417
    },
    {
      "title": "Knock off-don’t buy",
      "text": "Do not buy!!!! This is NOT the real product! Tube empty, product strange. Save yourself and just buy for same price off Sephora and get the real stuff. The real stuff is really great and last forever.",
      "rating": 1.0,
      "verified": true,
      "author": "Brandi Davis",
      "helpful_votes": 4,
      "publication_date": 20181110
    },
    {
      "title": "My new go to concealer",
      "text": "Awesome product. It's very thick coming out of the tube but melts on your fingers and gives great coverage without caking. Great for older skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 10,
      "publication_date": 20170405
    },
    {
      "title": "FAKE PRODUCT ALERT",
      "text": "This is NOT THE REAL THING. It's more liquid than the usual honey-like consistency and does not stay on skin or dry ... Like it was diluted with oil or something. Amazon should be ashamed to allow this crap to be peddled on it's site. The cap is also clear, which is not at all like the ones I've purchased at Ulta, which has a black cap. Save your money, I'm sure they won't refund mine!",
      "rating": 1.0,
      "verified": true,
      "author": "Molly",
      "helpful_votes": 3,
      "publication_date": 20190311
    },
    {
      "title": "It also leaves a very weird shine that made my under eyes look like I coated my skin with plastic",
      "text": "This product is very hard to apply and blend. It also leaves a very weird shine that made my under eyes look like I coated my skin with plastic. Yuk! It's also expensive. I returned it and was so happy they gave me a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Darlene",
      "helpful_votes": 2,
      "publication_date": 20180626
    },
    {
      "title": "I felt like I got ripped off with this one",
      "text": "I will never buy this again, the color is not as described and it is half empty. The tube is mostly air!!! I felt like I got ripped off with this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Mareena Miller",
      "helpful_votes": 16,
      "publication_date": 20161119
    },
    {
      "title": "AMAZING PRODUCT! I love this because I have an ...",
      "text": "AMAZING PRODUCT! I love this because I have an artificial eye which has a deep purple on my under and top eyelid. This concealer covers it up all day. I usually only re-apply when I need to clean my artificial eye multiple times. I can wear this product for a full 12 hours without re-application. I will never buy another concealer again. Trust me I have been searching for years.",
      "rating": 5.0,
      "verified": true,
      "author": "Tonya B",
      "helpful_votes": 2,
      "publication_date": 20180217
    },
    {
      "title": "Be weary",
      "text": "I've been using this product for at least 5 years. This is the first time I'm having to write a review and it's not good. Product almost seems outdated and should not be sold. It's consistency is almost like water. Doesn't help or hide any imperfections like all the others did. Extremely displeased!",
      "rating": 1.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "It is not thick like the actual it cosmetics products and is thin",
      "text": "This is a duped product. It is not thick like the actual it cosmetics products and is thin, watery, and un-pigmented. Do not buy from this seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Jaynee",
      "helpful_votes": 5,
      "publication_date": 20180331
    },
    {
      "title": "Counterfeit product!!!",
      "text": "This is NOT It BYE Bye under eye concealer!!! Do not purchase from this vendor I am shocked that this is still being sold by this vendor and at a higher price than when I purchased it. Unfortunately, I did not open mine until after the return window. The real product from It cosmetics has excellent coverage and longevity. This is thin, watery and doesn't cover-not the real thing. It's a total waste of money! Ulta sells the real thing.",
      "rating": 1.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Just a dab does it ALL",
      "text": "I've been using this concealer for three years...it is just the right amount of coverage for any skin type. Just the smallest amount Pat's on effortlessly...never sinks into even the finest lines...moisturizes and stays put all day until you remove it. It's NEVER cakey or gummy...it seems to just disappear and leaves you looking GORGEOUS!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Klyber",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "I love it but I ordered the color I normally wear ...",
      "text": "I love it but I ordered the color I normally wear in make up and this one came out too light.",
      "rating": 4.0,
      "verified": true,
      "author": "Maria C.",
      "helpful_votes": 4,
      "publication_date": 20170411
    },
    {
      "title": "Quality",
      "text": "Best concealer ever. I am 60 and Eastern European I suffer from dark circles. Very common according to my heritage. This will cover and conceal anything. I. Ave used and will continue to use IT cosmetics forever. I can depend on quality every time",
      "rating": 5.0,
      "verified": true,
      "author": "Linda massimino",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Best cover up product I've used in a long time.",
      "text": "Love this undereye cover up. I actually only use this and I don't need foundation. I just apply this to my age spots and undereye and that's all I need. And I only use a very small amount for covering these areas. Definitely would refer to friends and also buy again. Thanks for such a great product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Love this concealer!!!!!! Totally full coverage! I plan to buy again!",
      "text": "Love this concealer!!!!!! Totally full coverage! Not much inside but worth every penny. A little goes a long way. Does get creasy under the eye and you must set it with powder. It's a bit tacky and wet if you don't set it wit powder. Excellent choice for covering up blemishes, scars and discoloration. I plan to buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "cburkhardt5414",
      "helpful_votes": 0,
      "publication_date": 20160728
    },
    {
      "title": "Best Concealer",
      "text": "I have been using this concealer for years now and continue to love it! You do not need to use alot, very little goes along way. It is on the heavier side, but if you use a small amount, it works perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Deceptive packaging - a rip-off!",
      "text": "I tried this concealer at a friend's house and it has wonderful coverage. Otherwise, there's no way I would have shelled out nearly $30 for a tiny tube of makeup. HOWEVER, when it received my tube, the price seemed even worse - the tube was 3/4 filled with air! I basically paid for an almost empty tube. Not gonna fall for that! Returned it right away.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Can't live with out it!!!!",
      "text": "I have psoriasis patches on my face and this is the only waterproof cover up that I can sweat in, wipe my face with a paper towl and it doesn't come off. I now can't live without it. Peopke would ask me about my red spots and it was very depressing.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Christian",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "the medium is lighter than most mediums",
      "text": "this is the lightest medium I've ever seen. I'm a fair redhead and it was almost too light. it works well.",
      "rating": 4.0,
      "verified": true,
      "author": "Robin F.",
      "helpful_votes": 5,
      "publication_date": 20170609
    },
    {
      "title": "Conceals perfectly!",
      "text": "I'm a concealer junkie. I have every concealer that Sephora highly rates. I am skeptical about buying makeup online being I can't try it. This concealer is amazing. It's moist & leaves a dewy finish. It is heavy but great coverage! If your looking for high brightening this is a great product. It's thick, not watery. I like that but not everyone does.",
      "rating": 5.0,
      "verified": true,
      "author": "Claudine Drescher",
      "helpful_votes": 2,
      "publication_date": 20170324
    },
    {
      "title": "Not worth the price.",
      "text": "The concealer works fine but just after a couple of uses the container split near the cap so it goes to waste whenever I press it a big glob of it comes out wasting it.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Fantastic coverage!",
      "text": "This is my second tube; although the first tube is still working I didn't want to run out unexpectedly. The coverage is fantastic and I would be lost without it! Easy to apply and lasts all day.",
      "rating": 5.0,
      "verified": true,
      "author": "ally",
      "helpful_votes": 3,
      "publication_date": 20160808
    },
    {
      "title": "it gives amazing coverage and reflects the light well",
      "text": "Its a bit tricky figuring out how much to apply, a little goes a long way. it gives amazing coverage and reflects the light well. I wish my 24 hour foundation lasted as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Bucher",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "Satisfied Customer",
      "text": "The product was the proper shade/color, it was shipped in a timely manner, the cost was reasonsble, and it covers the majority of the dark circle area. Overall I am satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Sassy Darling",
      "helpful_votes": 2,
      "publication_date": 20160722
    },
    {
      "title": "Two Stars",
      "text": "A bit thick and heavy. Blend well mixed with moisturizer Does cover imperfections and last all day",
      "rating": 2.0,
      "verified": true,
      "author": "Jacquelyn",
      "helpful_votes": 3,
      "publication_date": 20170430
    },
    {
      "title": "Fake",
      "text": "This is not a real “It” product. The box package wasn’t obvious, the actual tube looked suspicious, but it’s obvious when you use the product. It’s consistency is thin, where the actual product is thick, I think the tube was filled with a cheap liquid foundation. I did go to Ulta just to be sure the actual product hadn’t changed since my last purchase & it had not. I bought the real deal there.",
      "rating": 1.0,
      "verified": true,
      "author": "theresa",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "The absolute best for coverage",
      "text": "Hands down the best concealer I have ever used. I have horrible bags under my eyes and using a little tiny drop not even a drop a dab of this will cover your entire under eye in full coverage. The bottle advertises your eight hours of sleep in a tube... Well they certainly hold try to that! I highly recommend this and even tho it's pricey, if used correctly this bottle will last you like a year or close to it",
      "rating": 5.0,
      "verified": true,
      "author": "jstudstrup",
      "helpful_votes": 0,
      "publication_date": 20150710
    },
    {
      "title": "Arrived Half Empty",
      "text": "While the product overall works well, the tube was half empty, which for the price is extremely disappointing. Kat Von D's Lock it concealer works just as well, and the tube arrives full. Will not purchase again.",
      "rating": 2.0,
      "verified": true,
      "author": "J. White",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "This was a fake",
      "text": "I've been using IT Cosmetics for years and the product inside the tube of concealer I purchased here was NOT the product that IT Cosmetics puts out. The tip of the tube was a first indicator, then the product was lacking the coverage that IT is famous for.",
      "rating": 1.0,
      "verified": true,
      "author": "jgray",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Didn’t work for me",
      "text": "I’ve gotten a trial size in my Ipsy bag and it worked great but then I bought this and it seems like it’s darker and doesn’t work as well.",
      "rating": 2.0,
      "verified": true,
      "author": "Destinyds23",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Works very well with dark circles",
      "text": "I have had dark circles under my eyes and have had to wear cover up since elementary school. This is the best I have found! You only need a tiny bit, because it is thick, so it lasts a long time. I follow up with some underpowder from Bare minerals and I’m good to go!",
      "rating": 5.0,
      "verified": true,
      "author": "kelley",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Doesn’t work for me",
      "text": "I bought this for very dark circles I have. For me it is a better foundation. It does not cover my circles.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Radney",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Love this!",
      "text": "I LOVE this product. I saw a review that said it was hard to spread on the face; but that is what I like about it.LOL. Once I pat it on the under eye, it does not go anywhere else, just what I want!!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Ferguson",
      "helpful_votes": 0,
      "publication_date": 20170604
    },
    {
      "title": "Favorite!",
      "text": "I have oily skin and I'm 33, and I love this stuff so much ! I have 2 kids so I always have bags under my eyes and this hides the truth of my exhaustion.",
      "rating": 5.0,
      "verified": true,
      "author": "Rootimer",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Tube was only half full",
      "text": "It took me squeezing up half the tube before any product came out. What a disappointment. It's like the disappointment that you have when you open a bag of chips only to find that half of the bag was filled with air!",
      "rating": 1.0,
      "verified": true,
      "author": "Kimberly Sackett",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Best concealer EVER (and I have tried a lot!)",
      "text": "This is the best concealer I have ever used...and I am 32 and have been using concealer since I was a teen. Honestly, the coverage is AMAZING without being too thick. I used to use a solid concealer because I could never get enough coverage from a cream, but this stuff does the job and does it well. A little bit goes a long way so it lasts forever. I will never use anything else!",
      "rating": 5.0,
      "verified": true,
      "author": "Marcie",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Great undereye coverage",
      "text": "I'm so impressed with this coverage. Gives you a bright, natural look and lasts all day. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Bird",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Maybe a knock-off??",
      "text": "Wonder if this is a knock-off?? Maybe the company changed the product....I simply don't know. This formula is watery, not moisturizing as it has been with my previous purchases on QVC. Will ~not~ purchase again.",
      "rating": 2.0,
      "verified": true,
      "author": "Reb ",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "I have bad dark circles",
      "text": "I have bad dark circles. I like this product, but I wish it wouldn't accentuate my lines at the cost of covering the circles!",
      "rating": 4.0,
      "verified": true,
      "author": "T Harvey",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Not the same as the true product",
      "text": "This turned out to be a cheap knock off.. the consistency and feel of the product was entirely different than when I've bought \"bye bye under eye\" cream in store. Very very disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin F",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Not the same",
      "text": "This isn't as thick as the product you get from the actual retail store. It still does the job, just not as well and you have to use more. Overall I wouldn't buy this on Amazon again.",
      "rating": 2.0,
      "verified": true,
      "author": "Susie",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Fake & No refund",
      "text": "I returned it because it did not feel or perform anything like my IT Bye Bye Undereye I got off the IT website & still haven't got a refund. Buy off the site & avoid the hassle. I just had a gift card.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Just like any other concealer",
      "text": "Feels more like a drug store product than anything else.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Do not buy from this distributor!",
      "text": "I bought this product and my tube was practically empty. I have bought this product before from another location. The product itself is great, this distributor is a scam. Do t buy from here.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Don’t waste your money.",
      "text": "Not the same as I had before. It is thin and watery.",
      "rating": 1.0,
      "verified": true,
      "author": "Wanda Johnson",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Bad consistency",
      "text": "I have used this product many times and always purchased it from Ulta. This is the first time purchasing it online and the product had a very different consistency then normal. It is runny and not at all thick enough to provide the coverage I am used to. I tried to contact the seller with no response.",
      "rating": 1.0,
      "verified": true,
      "author": "Kfolk",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Five Stars",
      "text": "Love this stuff, only thing I use on my face. Covers up dark circles really well.",
      "rating": 5.0,
      "verified": true,
      "author": "K.T.",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Eyebrow Gel Collects in the Undereye cream",
      "text": "I am disappointed in this product after all the positive hype i have heard. After a few hours my eye and eyebrow makeup starts collecting in the under eye and looks awful. for the price i was hoping for a premium product. back to a drug store brand that works better.",
      "rating": 1.0,
      "verified": true,
      "author": "R. Murphy",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Covers dark circles and redness!",
      "text": "Stays on all day long and works well to cover black circles and redness as well as other blemishes.",
      "rating": 5.0,
      "verified": true,
      "author": "KW",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Gets the job done!",
      "text": "A little pricey, but a little goes a long way! I put on after moisturizer & before foundation. Works great for dark circles under eyes!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Love this - great",
      "text": "Love this product, life long dark circles, this is A+++ (other than the price). It lasts a long time and takes VERY little to get full coverage that lasts all day - even at the beach!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Covers better than any concealer.",
      "text": "This is by far the best concealer. I suggest using a little powder to set as it is very moisturizing and can move into creases if you don't. It is the only one I have used that erased dark circles from my eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Wilson",
      "helpful_votes": 0,
      "publication_date": 20160903
    },
    {
      "title": "the medium natural was more like a light/ivory",
      "text": "It is definitely lighter than color stated it is, the medium natural was more like a light/ivory. Had high hopes for this, disappointed having to return product.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "Tube contains only 1/4 of product. Not worth cost",
      "text": "While the coverage is great, there was very little product in the tube. This may have been a factory defect but something that should have been caught. The tube is maybe 1/4 of the way filled. If this is typically how the tubes are filled, then it is definitely NOT worth the cost.",
      "rating": 2.0,
      "verified": true,
      "author": "Misty",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Concelear that works well",
      "text": "easy to apply, you need a small amount for a medium coverage, not cakey at all. I use mostly for undereye. the look is more dewy and as if you’re not wearing anything. I alternate this with bobbi brown or cinema secrets (65A). the shade is lighter for me so I would go back to a Tan. Its not super tan at all if applied lightly.",
      "rating": 4.0,
      "verified": true,
      "author": "Bianca Reyes",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Not like the product at cosmetic stores",
      "text": "I don’t know if this is a “knock off” product but this isn’t anything like the bye bye under eye that I get in cosmetic stores. It’s watery & thin and doesn’t come close to the thick full coverage of the standard “It” product that I normally get.",
      "rating": 1.0,
      "verified": true,
      "author": "BL1981",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "last concealer I will ever purchase, the search is over!",
      "text": "Buy this, in this color. It is amazing and tube last forever!! Plus it stays on all day and makes your skin so soft and smooth. It covers everything thing from dark circles to age spots to freckles. Love this product!! If in doubt, don't be, money well spent. Trust me, I have sensitive skin and this works miracles. 5 star product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Egnues",
      "helpful_votes": 2,
      "publication_date": 20141122
    },
    {
      "title": "WHEREVER \" IT\" GOES I WILL FOLLOW",
      "text": "I am a Bye Bye Under Eye Groupie. Where IT goes I will follow because the coverage is thorough and the price is economic for a product that lasts for months.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr Shirley Stallworth",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Coverage is excellent",
      "text": "If you are looking for full coverage this is the one!! A small amount really covers exactly what it says it's going to cover .. everything you put it on!! I 💜 this product line.",
      "rating": 5.0,
      "verified": true,
      "author": "Tami Brink",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Miracles happened",
      "text": "Better than newborn babies, puppies, laughter & chocolate. 10/10 heals ailments. Gets you the job. You'll probably find your soulmate wearing this. Erases debt. Solves all your problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Christine",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "I really like this underage cream brand",
      "text": "I really like this underage cream brand. It covers the shadows under the eyes and makes the skin look brighter.",
      "rating": 5.0,
      "verified": true,
      "author": "Esther",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "Stays on for hours under my IT Your Skin Only Better. I have to use a brush to blend",
      "text": "This product is very thick. I have to make sure I only apply a little or otherwise I have it all over my face. Stays on for hours under my IT Your Skin Only Better. I have to use a brush to blend. My only issue I have that it is light. That was my own fault for ordering to light. I do recommend this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Happy camper117",
      "helpful_votes": 9,
      "publication_date": 20160320
    },
    {
      "title": "AMAZING!!!!!",
      "text": "This stuff is absolutely AMAZING and definitely worth the money!! This is a new staple in my makeup bag and perfect for small touch-ups on no makeup or little makeup days!! LOVE IT!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ali",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Great Coverage for Sure “",
      "text": "I love this product cause it hides so many imperfections perfectly will definitely purchase again”.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Butterfly ",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "My most favorite!",
      "text": "I've been using this for years. It is the greatest concealer I've ever used.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi Phillips",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Beware!",
      "text": "I got this a month ago, just opened it and it's empty! I was able to squeeze enough out to do my makeup but that was it! Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Melinda Schrader",
      "helpful_votes": 2,
      "publication_date": 20181127
    },
    {
      "title": "Old or a Knock off.",
      "text": "Buyer beware. I use this product all the time but I’ve only bought from Macy’s or ultra. I bought online to save time. This is not a good quality product. I would never buy again online unless it’s from Macy’s or ultra. The concealer is watery and the tube was half full. Maybe a knockoff",
      "rating": 1.0,
      "verified": true,
      "author": "Christina ",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Only half full!",
      "text": "I have used this for a few years and it is a great concealer... I have never ordered a tube this size and although the product seems the same the tube is less than half full. I had to squeeze from the bottom to get any to come to the top... it’s going back!",
      "rating": 1.0,
      "verified": true,
      "author": "Cathryn M. Griffin",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "The only under eye makeup I use",
      "text": "The order arrived on time. I was already sold on the Its cosmetic products. Bye Bye Under Eye really covers my dark circles and does not settle into my crows feet. I believe. If has collagen in it. I love the product so much I'm just worried they'll stop selling the stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Kateyes",
      "helpful_votes": 0,
      "publication_date": 20150621
    },
    {
      "title": "Don’t buy it. It’s only a quarter filled.",
      "text": "This tube is horrible. The tube only has a quarter of makeup in it. I have to squeeze the tube as hard as a can to get the makeup to The top to get some out. I’ve never see. Anything like it. It gets zero stars from me. Don’t like getting ripped off!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Geraldine Olsen",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "The world's best concealer!",
      "text": "I love this concealer! You only have to use a tiny bit of it, but it spreads and covers like nothing else! I have rosacea, and my red nose is very hard to cover, but this product hides my secret. It is a very dense, color-rich product; I sometimes use it as foundation on my entire face. I would hate to be without this concealer, so I bought two!",
      "rating": 5.0,
      "verified": true,
      "author": "DebbieM",
      "helpful_votes": 2,
      "publication_date": 20130403
    },
    {
      "title": "They say it's like 8 hours of sleep in a tube",
      "text": "They say it's like 8 hours of sleep in a tube....believe it. Covers dark circles and even blemishes without causing breakouts. Lasts forever because you only use a tiny amount. Great stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "WVA RN",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "I like the It products",
      "text": "I like the It products, but I believe priced too high. The coverage was okay and I expected to be a little lighter for full coverage.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20170209
    },
    {
      "title": "Too heavy of a look not natural",
      "text": "Not sure why everyone loves this. Yes it covers but it's shiny and thick! Yuk. Sorry I'm already getting a little age on me don't like the old concealing look of the '70's raccoon eyes. And yes I blended but with that much shine it really stands out under your eyes. Sorry, I wanted to love it.",
      "rating": 2.0,
      "verified": true,
      "author": "abme",
      "helpful_votes": 0,
      "publication_date": 20140324
    },
    {
      "title": "IMPOSTER",
      "text": "Purchased this product and it is cheap quality. I believe it is an “IT” imposter product!! Even the consistency of the product is not the same. Do not buy!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Love this!",
      "text": "I'd highly recommend! It covers nicely, smooths out nicely and requires very little.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Nylund",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Perfect coverage. How did I ever live without it ...",
      "text": "Perfect coverage. How did I ever live without it before it went on the market.? I have no idea.",
      "rating": 5.0,
      "verified": true,
      "author": "LOVE USA",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Not much in there.",
      "text": "Hardly any product in the tube. Not a good value.",
      "rating": 1.0,
      "verified": true,
      "author": "C A R",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Love it but pricey.",
      "text": "Excellent coverage. A little too pricey, but the tube is a decent size.",
      "rating": 5.0,
      "verified": true,
      "author": "Blossom",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Much darker than needed",
      "text": "This product is fantastic! The coverage is amazing and would recommend it for anyone who has dark circles. But, the medium is too dark for me.",
      "rating": 3.0,
      "verified": true,
      "author": "southern belle",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "Thick. Waterproof. Magic.",
      "text": "This is by far the best concealer. It lasts all day even with sweating. All i have to use is a pea sized amount on my worst \"whole face\" acne days and it doesnt clog my pores!! Thanks for the supersize tube❤ now it lasts me months and months.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly Shaw",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Great coverage",
      "text": "It rubs in gently but really well and has great coverage for dark circles.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Passmore",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "I will purchase again when used, but it lasts so long that it won't be soon.",
      "text": "It seems expensive but it is not because only a tiny dab goes a long way. I am older with discolorations on face and this provides the best coverage of any product that I've ever used. Read the directions before using.",
      "rating": 5.0,
      "verified": true,
      "author": "Mariposa",
      "helpful_votes": 0,
      "publication_date": 20160424
    },
    {
      "title": "I would buy again",
      "text": "I miss quoted my last review. ( I thought it was a different product). The product definitely works. I would buy again",
      "rating": 4.0,
      "verified": true,
      "author": "Iris Hecker",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Great product, it does get a bit cakey as ...",
      "text": "Great product, it does get a bit cakey as it is a very thick product. However, it does an excellent job of concealing dark under eyes.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170519
    },
    {
      "title": "It's like magic",
      "text": "Just what I needed for days where I dont get much sleep. Dark circles are gone!",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Smoothes out evenly",
      "text": "I love this concealer. Even I can't tell what i am trying to cover up",
      "rating": 5.0,
      "verified": true,
      "author": "dearydew",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "LOVE THIS PRODUCT, but was sent a different one",
      "text": "Love it but actually ordered the Bye Bye Under Eye with Vitamins C & K and was sent the waterproof undereye concealer. I thought I would try it since I was out and couldn't wait and the product does wear well, but noticed it sits in lines - the one in this picture is amazing, but that was not sent to me",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161012
    },
    {
      "title": "Five Stars",
      "text": "Love this product and definitely makes a difference. I recommend this brand",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan mckinley",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "Terrible product.",
      "text": "This concealer cakes and creases and does not blend. It is terrible and I wish I could get my money back. If you're looking for a great concealer, this is not it. Sorry, I usually love iT products. This needs a formulation tweak.",
      "rating": 1.0,
      "verified": true,
      "author": "kspurgeon",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Definately a favorite!!!",
      "text": "This concealer is simply amazing! I tried many many concealers by many diff brands from low-high end, spent thousands of dollars! I'm a self proclamed make up junkie!!! nothing ever covered my undereye cincles like this. It stays on ALL DAY!!! usually concealers slip off somewhere by noon but not this one! I will never ever use anything else!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna NY",
      "helpful_votes": 0,
      "publication_date": 20130830
    },
    {
      "title": "Not a new tube",
      "text": "This is a reflection of the seller. This WAS NOT FACTORY SEALED AND CONTAINED LESS PRIDUCT THAN THE TUBE I WAS REPLACING. NO RETURNS EITHER. SHAME ON YOU!!",
      "rating": 1.0,
      "verified": true,
      "author": "Mrs Schu",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Covers the dark circles",
      "text": "Covers dark circles well. Good price. Is thick so just takes a dab.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Hopkins",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "FAKE",
      "text": "Do not buy this product. I usually don't leave reviews, but this product is 100% fake. Nothing like the real one. Bought two on amazon for convenience, but totally different from the real product. Very watery and does not cover any spots.",
      "rating": 1.0,
      "verified": true,
      "author": "Christine Kim",
      "helpful_votes": 0,
      "publication_date": 20200830
    }
  ],
  "product_meta": {
    "title": "It Cosmetics Bye Bye Under Eye Full Coverage Concealer, Medium, 0.28 fl oz.",
    "description": "Size:0.28 Ounce| Color:MediumDeveloped with plastic surgeons, this best-selling, award-winning, cult-favorite waterproof concealer delivers highly pigmented, long-lasting coverage that won’t crease or crack. Infused with high-performance pigments and anti-aging peptides, vitamins, hydrolyzed collagen, hyaluronic acid and antioxidants, the game-changing formula improves the appearance of wrinkles and effectively conceals the look of skin imperfections including dark circles, bags, redness, hyperpigmentation, broken capillaries, age spots and discoloration. Finally, a multitasking, full-coverage concealer that makes your skin look younger! *If you can’t decide between Light and Medium, definitely choose Medium—it’s the most popular shade!",
    "rating": 4.2,
    "feature_bullets": [
      "FULL SIZE: .28 OZ SEALED TUBE. IT’S YOUR 8 HOURS OF SLEEP IN A TUBE! Full Coverage Anti-Aging Waterproof Concealer. Packaging May Vary.",
      "Key Benefits: #1 best-selling, award-winning concealer!",
      "Full-coverage, anti-aging, never creases. Highly pigmented, covers everything.",
      "Anti-aging peptides, vitamins, antioxidants, hydrolyzed collagen and hyaluronic acid.",
      "Clinically shown to make your skin look younger!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "5.12 x 0.79 x 5.12 inches; 0.48 Ounces",
      "Item model number": "SG_B0028P5SDO_US",
      "UPC": "783327401322 893224002895 799457783061 885584292870 787734785303 787734119771 893224002581 885264610819 885182080664",
      "Manufacturer": "It Cosmetics",
      "ASIN": "B0028P5SDO",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Makeup",
      "Eyes",
      "Beauty & Personal Care",
      "Concealer"
    ],
    "price": 39.5
  }
}