{
  "website_summaries": [
    {
      "verdict": "A lot of space for a value price – if you are looking for a camera bag that can fit so much more, this is a great  option.",
      "pros": [
        "Offers space for SLR camera and 15.4-inch laptop plus accessories",
        "It's waterproof and is lined with memory foam for added protection"
      ],
      "cons": [
        "Has fewer accessory compartments than some others we considered, but it still offers ample space"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Listen!!! What a great choice!!",
      "text": "I was debating my self over the decision of buying a case from B&H ($230) that's look perfect but quite expensive. I Then happened to come across this incredible simple, functional, reliable, good looking, well manufacture camera case that work just perfect for my sony A6500, 3 lenses, weebill Lab Gimbal, Go Pro, Batteries, Cables, Chargers, Battery banks and 15\" MacBook Pro Laptop for $70 bucks. Can not be happier and its why Im writing this lines, because it really save me from expending $200 extra for the same results. I completely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Enrique Palacios",
      "helpful_votes": 5,
      "publication_date": 20190915
    },
    {
      "title": "Great camera bag for traveling / hiking",
      "text": "Totally engineered for the photographer on the move. Took mine to Maui a few months ago and it was perfect. It's design makes it comfortable to wear while hiking. It had no problems going thought the Xray machine at the airport, with my tripod still attached. I was able to keep it under the seat while on the airplane and still have a good amount of foot room. To top it all off, it's convenient when you need to pull the camera out quickly while still protecting the rest of your gear from the potential bad weather. I love this pack.",
      "rating": 5.0,
      "verified": true,
      "author": "Zoomzippy",
      "helpful_votes": 14,
      "publication_date": 20160227
    },
    {
      "title": "Well made, good protction",
      "text": "I bought this to protect my photographic equipment. I doubt I will ever hike with it or carry it far. I will use it in the back of my jeep. It is well padded and will withstand my large dogs stepping on it. The camera storage in the top section is large enough to hold my Pentax K-3 with attached lens and battery grip. I took out most of the separators and am able to carry multiple lenses flash gun charger etc. Things I did not like: The outside pockets could be bigger and the tripod straps are too short for a large tripod. Neither are a big deal, overall I am pleased with this bag",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Dickinson",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "YES!!!!  (And a little no)",
      "text": "For the most part, we like this bag... we were able to combine two separate smaller camera bags into this one, plus carry our computer and other random must haves. Lots of space! The one thing I do NOT like is the way the front unzips at the bottom. The case naturally wants to flop closed, so you have to use one hand to hold it open when you’re digging through it.... not a deal breaker, but it is annoying when you’re also trying to juggle camera gear.",
      "rating": 4.0,
      "verified": true,
      "author": "Cratecares",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Not authentic",
      "text": "This is NOT an authentic \"Case Logic SLRC -206\". I believe I was sent (DCB- 309) wrong model. Going to reorder and hope they send the correct product. This product does not have: -Patent pending hammock system suspends your SLR above the bottom of case, providing superior impact protection -Water-resistant EVA base withstands the elements and allows the backpack to stand up on its own -Memory foam on interior of backpack lid helps protect your delicate LCD screen. The interior should be all orange and not grey/orange.",
      "rating": 1.0,
      "verified": true,
      "author": "Justin Syder",
      "helpful_votes": 2,
      "publication_date": 20180430
    },
    {
      "title": "Decent equipment bag",
      "text": "Overall a nice camera bag, with a couple small hiccups that keep it from getting the 5 star treatment. Pros - Comfortable. - Easy to customise. - Build quality seems solid. - Thicker than normal dividers. - Nice styling. Cons - No rain sleeve - Top handle should be attached to the middle of the bag and not the very rear as it makes it VERY sketchy to lift if the laptop section is even slightly unzipped. - No waist buckle. - No water bottle/mesh pocket. Despite the cons I'm confident that the bag will do its most important job well, and that's protecting my equipment.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Watkins",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "The best camera bag I've ever had (reviewing after couple years)",
      "text": "I'm picky with backpacks but this one is perfect. There's room to fit my gh5 + gx85 + mavic pro + some lenses and a laptop. I travelled couple times with it and it's marvelous. I do a lot of trails and the rubber under the backpack makes it great to leave it anywhere without worrying about getting water or dirt. The protection overall is great. The suspension systen for the camera makes me relax and not worried about hurting the lens. I had it for couple years, the zippers and all still like new. I've tried others but this backpack is the best that I've ever had.",
      "rating": 5.0,
      "verified": true,
      "author": "Leo Telles",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Awesome backpack, perfect for airline personal item",
      "text": "Bought this backpack to store a laptop, camera, and lenses while traveling via airlines. Have plenty of room to store chargers and other electronics too. Really like the removable padding. It allows you to get a tight fit on your electronics so they don't move around. The backpack is just the right size for a carry-on personal item and fits under airline seats.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "A bag to check out",
      "text": "This is a great camera bag. The easy to reach top load camera is perfect. It makes it easy to get your camera out and use it instead of having to unzip the whole bag like most require. The padding is thick and protects your lens well. My only negative comment is that the straps that hold the tripod need to be longer. My carbon fiber tripod when collapsed, the center swings down between the legs , is slightly to big for the straps to wrap around all three legs.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Green",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Nice Bag",
      "text": "It is a really nice bag. Although I was thinking it would be bigger I am happy with the size. I was able to accommodate two DSLR cameras Canon SL2 and Canon 60D, Canon lenses 18-135mm, Canon 50mm and Canon 70-200mm also 2 flashes, power bank,batteries, cables, two hard drives, 15.6-inch laptop, Ipad and I still have a small space. I had to remove two of the spacers and that way I got more space. The quality looks good but hopefully it will last because I have had many backpacks and they all break in 3 or 4 months. Will update my review when I get to use the bag for some time.",
      "rating": 5.0,
      "verified": true,
      "author": "Walmos",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "The bag is really nice quality, the pockets are well padded",
      "text": "The bag is really nice quality, the pockets are well padded, the compartments are easy to access and it's a solid camera backpack all around. The ONLY reason I returned it is that it sat weird on my back with the laptop inside. I do travel a lot so I'm often hiking around airports with a laptop but I don't really fault the bag here. It may just be my shoulders but went with another. Case Logic's stuff is very solid though, if you're considering that in your purchase don't sweat it. I have another smaller bag from them that I've had for years and still no issues with the seams, fabric or anything else.",
      "rating": 5.0,
      "verified": true,
      "author": "TSVD",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Compact and tidy little camera backpack.",
      "text": "Really great customizable camera bag. The velcro foam partitions are quite easily adjustable and the camera is easily accessible and slots into a \"suspension\" system. The bag fits a camera with multiple lenses, accessories, a small tripod, and a 15\" laptop quite well. It's also comfortable to use all day. Lots of pockets and compartments make it easy to keep this pack organized. Case Logic quality is apparent and it's easy to see why this bag has so many good reviews.",
      "rating": 5.0,
      "verified": true,
      "author": "bigninja",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "... travel as a carry on) and it has been great. Fits my Cannon 5D III",
      "text": "I've used the case logic for several months (including for air travel as a carry on) and it has been great. Fits my Cannon 5D III, a 70-200 lens, 24-100 lens, a nifty fifty lens, and a few other pieces. I like the large zippers and quality materials that hold up well for the price. The only drawback is that the straps are not very comfortable, and lack any sort of cross strap that would make the pack suitable for hiking.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Great buy",
      "text": "Holds all my gear and some. I love the fact that it sits up with out falling over. I took this bag every where during my 14 days in Thailand and it took a beating and came out standing. Not a scratch or dent of any kind on my gear. I love the top entry. It's very easy to pull out my camera, even with the zoom lens on it and take a quick shot. This is a great bag for the on the go all the time traveler.",
      "rating": 5.0,
      "verified": true,
      "author": "Lionel Leake",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Great Travel Backpack",
      "text": "Great Bag. Velcro system is a little weak. Held up extremely well to 2 mos of travel and location work and is a perfect bag affording light weight, durability and excellent compartmentalized component storage. I have around a dozen different bags ranging in cost up to 500.00. I think this is now my \"go to\" location bag As camera systems have gotten smaller I was amazed at how great this worked to hold 2 DSLRs, 2 Go Pros and 4 lenses along with my 13 \" MBP, external drive and support gear. It fits under the seat on commercial aircraft and the top load feature is awesome for pulling out a camera mid flight.",
      "rating": 5.0,
      "verified": true,
      "author": "David Puu",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "Very well made bag that will accommodate most pro configurations. Comfortable, sturdy straps and weather proof bottom.",
      "text": "This bag is very well made and I love the fact that it has a hard bottom that is water proof and will stand up on it's own. It is a little small for some of my configurations, but I knew that going in. When I use my Canon 6D Mark II, with a grip and the 100-400 II lens it is a tight squeeze. Those who own \"monster\" white lenses should probably look elsewhere. My 7D with a grip seems to fit a little better and my 70-200 and 300 lens are both fine. Shoulder straps seem sturdy and are comfortable. I would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "SoCal CL",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Buckle broke after 6 months of use",
      "text": "For the laptop portion, it fits my works lenoxa 440p easily. I could see it holding an ipad and a thin ultra book. I wish the main compartments zippers extended a little more, difficult to use the botton three slots. You can move the orange dividers tho so it may not be an issue. I wish there was a little more padding in the shoulders, and i wish the fabric were a little thicker, but i really like it. For 60 bucks it has been way better than the sling bag",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "They Did it Again!",
      "text": "I've used a few Case Logic items over the years, and I've always been happy. This backpack has been to a lot of places with me, and I love it. It works great and is easy to organize. The only thing I could say is that it is missing a rain cover, but I rarely need to use the supplemental one I purchased separately anyway. The rubber bottom is stable and is great for putting the backpack down on wet surfaces, dirt and even in a small amount of standing water.",
      "rating": 5.0,
      "verified": true,
      "author": "fang27",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Perfect for DLSR camera for Traveling!",
      "text": "I bought this backpack back in 2013. I love this camera backpack because it is water-resistant and lightweight. You can carry safely and easily your DLSR camera, a laptop, and a few other camera products in this backpack. This backpack does not have enough storage capacity for other items while carrying a DLSR. Case Logic products are the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Nirajan Poudel",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Photographer’s Backpack",
      "text": "I tried a few different backpacks, but this was the best. Really like the rubber base which stands the backpack up. Lots of zippered places for small items like scan cards.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick S",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Excellent bag!",
      "text": "excellent bag! at first I did not like it the back protection, is a little strong, but after some hours I love it. I was able to put my camera Canon T6 body only, 3 extra lenses (18-55mm, 50mm, 55-250mm), extra battery for the camera, battery charger for camera, a 15.6\" laptop and the laptop battery charger. The laptop fit perfect and with some extra space, the challenge was to fit the laptop battery charger, because the extra pockets are a little small. And the most important part, IS REALLY LIGHT!! I love this bag!",
      "rating": 5.0,
      "verified": true,
      "author": "Lucas Coudures",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "A Very Good Camera Bag",
      "text": "I was concerned about “the hammock”, but I have found this backpack to be a very good design for what I do. It easily fits my 15.4” MacBook Pro and the hammock holds my D7100 with a 50mm f1.8 lens and a battery grip. The middle compartment is large enough to hold a speed light, both my 18-55 mm, 55-300 mm, and 85mm f1.4 lenses. It is solidly built and has been with me through a number of hikes. It still looks new.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Layne",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "I really love everything about this backpack",
      "text": "I really love everything about this backpack. It is on the small end for professional photographers, you certainly couldn't carry ALL of your gear, but it certainly fits a lot despite it's smaller appearance. It's a really attractive bag, but it's not super obvious that it's a bag containing thousands of dollars worth of equipment which is a highly desirable feature for those nervous about being stolen from. I would definitely recommend this bag to other photographers, and I feel really lucky that I was able to order during the time the bag was on sale. 10/10 would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Mortimer the Corgi",
      "helpful_votes": 4,
      "publication_date": 20151001
    },
    {
      "title": "Sturdy but has a couple issues",
      "text": "Love this bag just wish it had access through the side! the straps can be kind of uncomfortable if your wearing a tank top because the material the use for cushion just isn't soft against bare skin! My laptop can rub on against the material in it's pocket and makes a weird sound when you walk. It can be pretty irritating. It is very sturdy and I have worn in pouring rain without getting anything inside wet and I love the rubber on the bottom of the bag! I would recommend for normal use but if you will be using in hot weather with a tank top i would go with something i but more comfortable!",
      "rating": 4.0,
      "verified": true,
      "author": "DizzyFoto Product Reviews",
      "helpful_votes": 0,
      "publication_date": 20161009
    },
    {
      "title": "Great bag!",
      "text": "Bought this bag to take camera and laptop on a trip to New Zealand and Australia. The bag works very well. It sits upright and has a quick opening for grabbing the camera when you want to make a quick shot! It's a little heavy but I attribute that to the steadiness of the bottom. The only think I'd like to see added is a cross strap on the chest. It would help take the load off the back.",
      "rating": 5.0,
      "verified": true,
      "author": "Southern Girl",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Fit all your gear!",
      "text": "Awesome camera bag! This holds a deceptive amount of gear. I have a full-size Nikon FX camera, 6 lenses, a speedlight, extra batteries, a charger, filters, and more jammed in this thing. It holds everything securely and it all feels well-protected. Be warned, if you pack this thing full, it will be deceptively heavy, especially if you strap a large tripod on the side as I often do. My only real complaint is that the suspension mount for the camera catches my lens covers frequently, pulling them off. Normally this isn't a problem as I'm pulling it out to shoot, but in inclement conditions, it isn't ideal. Still, it's not a big enough problem to reduce my 5-star rating.",
      "rating": 5.0,
      "verified": true,
      "author": "JKru",
      "helpful_votes": 0,
      "publication_date": 20160527
    },
    {
      "title": "Nicely Padded Backpack",
      "text": "I was sent exactly what I ordered in a timely fashion. The Backpack is well made and at a competitive price. I could have used more space for additional items. That really is not the fault of the backpack. I bought one several years ago to give as a gift to someone just getting started and it works well for them.",
      "rating": 5.0,
      "verified": true,
      "author": "R.T. Reiman",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Great backpack with poor pocket storage.",
      "text": "I have a d7100, 2 prime lenses, a telephoto lens and a couple speedlights. This backpack holds my camera gear easily. The backpack seems to be well made with good zippers. My complaint is that pockets are almost useless. The side pocket will only accomodate flat objects like memory cards. Anything that has any thickness will prevent the pocket from closing. The pocket on the front is ok. This backpack also holds my 15in laptop nicely. However, I have to use camera gear space for the laptop's charger, mouse, external harddrive etc. So, in my opinion, it's a great backpack but there is a huge lack of pocket storage for all the odds-n-ends.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Everything fits",
      "text": "Arrived as promised. Appears to be very well built. I like the Velcro strips that keep the main compartment zipper from opening all the way accidentally. I have a Nikon D5500 and two lenses with a additional cleaning package, extra battery, and extra SD card. Everything fits with room to spare. The Velcro dividers seem to be a bit cumbersome to configure but they work and once in place they don't move. So far it has been a good choice and it works well for me and my equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "STGCSSW",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "Great bag, lots of thought put into it.",
      "text": "This is a great photographers bag. I like the hanging sling for my DSLR at the top, and the padded compartments for storage. They put a lot of thought into the bag, down to the velcro to hold the extra bit of unused strap in place is nice. This is my first photography forward backpack, but it fits all of my camera gear, and my laptop nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Dowske",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Nice bag but with drawbacks",
      "text": "This is a very nice backpack/camera bag. There's lots of padding and the Velcro contacts are firm and strong. It is comfortable. The computer compartment easily holds my 17.5\" laptop. Main drawbacks are that there are not many pockets for things like filter kits, cleaning kit, notebooks, pens and pencils, and miscellaneous gear like flashlights, extra batteries and memory cards; also the \"suspension system,\" while unique, is designed mainly (or only) for attached lenses that are narrow, like a prime 50mm or a EF-S (Canon) lens. Any lens that is wider or somewhat conical, like most Canon EF lenses, cannot be used with the suspension system.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20150817
    },
    {
      "title": "A great two-in-one bag",
      "text": "A great backpack. I usually stuff it with 3-4 lenses, camera charger, a Nikon D5100, chargers for my phone and Macbook, a 13.3\" Macbook, a mini tripod, memory cards, filters, and sometimes, would mount a full-size tripod on the outside. The bag does well to carry all of that. Perfect for trips where you want to take one bag for both your laptop and the camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Zeeshan",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "Great camera bag",
      "text": "Love this backpack camera bag... convenient to have a camera case in backpack style. Only complaint is the flimsy inner compartments. They are easy to adjust but after adjusting several times they have become less sturdy than when purchased. Multiple compartments which is a plus. Easy to Carry on plane fits under seat nicely.",
      "rating": 4.0,
      "verified": true,
      "author": "TheFahFamily",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "I should have believed my eyes",
      "text": "I read several reviews about how the flap does not stay open but snaps back. It makes it hard to place and remove items while holding the flap open all the time. This is not a great design. Other than that, it is a very high quality back pack. Due to the flap issue I feel this is a poor design and would not recommend that you buy it.",
      "rating": 3.0,
      "verified": true,
      "author": "Fabritzio Fineburg",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Great if you need a compact backpack.",
      "text": "Needed something to hold Nikon D7500 with 3 relatively heavy lenses, but was small enough to fit my small body size. This seems to be quite well made and proved to be comfortable on a hike up through Mt. Rainier last summer. Yes, it's a tight fit but managed to fit the body, a 16-24, 105, and trusty 18-200 along with a slew of filters and other supplies. I did need to permanently remove a few of the padded dividers (held by Velcro) but that was simple.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Eisenberg",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "Solid backpack with ample storage",
      "text": "This is my second camera backpack because I needed more space for a new zoom lens. The backpack is not bulky yet provides ample storage room for all my gear. The padding gives me an extra bit of comfort from hard knocks. The only drawback is that the slits for the hammock can only accommodate a regular sized lens as my zoom would not fit. It would be good to provide an extra hammock with larger slits. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "'Bunmi",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "I like the hard bottom and inside lenses' compartments but this ...",
      "text": "I had an older version of this bag and it is in general an improvement in terms of camera protection from previous models. However; it does not fit my Canon 6D with the power pack installed (something that did not happened with the previous version). I like the hard bottom and inside lenses' compartments but this bag needs to be a bit bigger to fit the essential items a photographer needs. I am seriously considering returning the bag as I do not want to have to take the power pack out every time I store the camera.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20170416
    },
    {
      "title": "Simply the best for protecting my Nikon and Macbook Pro of over ...",
      "text": "Simply the best for protecting my Nikon and Macbook Pro of over $5,000 total value. The case has gone all over the world and it still looks new. It has sailed on an unprotected bamboo boat riggers on trips to remote islands. I won't buy anything else but case logic. The pouches are perfect for my travel documents and charging cables. Padding is really more than sufficient. The shoulder straps are strong and I disagree with some posters that the straps are weak. In fact I find the straps a bit too bulky but it comes handy for the long airport transfers.",
      "rating": 5.0,
      "verified": true,
      "author": "Sugar Ray",
      "helpful_votes": 0,
      "publication_date": 20160220
    },
    {
      "title": "It's built sturdy, which is nice",
      "text": "It's built sturdy, which is nice. The straps aren't the most comfortable but they're okay. It's roomy, and easy to customize to get the most out of the space provided for lenses and accessories. What it lacks though is smaller storage space for the little things, like extra batteries, cards, cables, etc. The ones that it comes with quickly get filled up. I love the tough rubberized bottom part, perfect for setting it down on rough ground. The laptop storage space is adequate as long as your laptop is on the smaller side. Overall I'm pretty happy with it. I wish it would have come with a rain cover though, like my previous Case Logic bag did.",
      "rating": 4.0,
      "verified": true,
      "author": "HarloweThrombey",
      "helpful_votes": 0,
      "publication_date": 20150915
    },
    {
      "title": "Hammock may not fit your lens",
      "text": "I was excited about this backpack based on the reviews here on Amazon. The product description states that top opening hammock system will accommodate lenses up to 3 inches in diameter. My Nikon 300 mm with lens hood attached is exactly 3 inches in diameter but it will not fit through the hammock. I had to remove that to make it work. Once I did that it was just an ordinary top opening camera backpack. I sent an email to Case Logic asking whether they had a larger opening hammock but did not receive a reply. After a week, I returned it to Amazon.",
      "rating": 3.0,
      "verified": true,
      "author": "Waldo Emerson",
      "helpful_votes": 0,
      "publication_date": 20151010
    },
    {
      "title": "Great Bag, very pleased, highly recommended.",
      "text": "I have done a lot of research on backpacks and find they are all awkward or unattractive. I found this backpack and the style is great. Simple and Clean. Resembles any other backpack (not obviously camera gear). Has lots of adjustable compartments for me to take everything with me on the go. Very pleased with the backpack and highly recommended. Was nervous my Canon 6D w/ 24-105mm was too big for the suspended, easy access location at the top, but it is also adjustable and fit perfectly. I would highly recommend this bag to any camera enthusiast on-the-go.",
      "rating": 5.0,
      "verified": true,
      "author": "Mitch Service",
      "helpful_votes": 0,
      "publication_date": 20150401
    },
    {
      "title": "Compact but Roomy",
      "text": "Not that big to carry, but fits 3 cameras, 3 long lens, a telephoto converter and a huge lens hood: 1) Nikon D3300 with 18-200mm lens attached, 2) Nikon D7200 body, 3) Nikon 200-500mm lens with TC-14EII, lens hood and lens carry handle attached, 4) Nikon 70-300mm lens 5) Sony DSC RX100 camera Still have room for a small lens",
      "rating": 5.0,
      "verified": true,
      "author": "JohnNJ",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "Great Bag",
      "text": "I use this bag for my camera equipment only and found it to be made well, durable, and have enough room to carry my SLR camera several lens with outstanding protection. It also gives the the versatility to customizes the interior compartments. The zippers seem to be of good quality and the shoulder straps are comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Outlaw",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Could be great, but......",
      "text": "This would be an absolutely awesome case if two things were fixed on it...1) the velcro does not hold (very,very aggravating); 2) when you open the pack, the lid does not fold back and is you are constantly fighting with it to keep it out of your way. I just replaced this one with a Lowepro.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "Great camera case",
      "text": "Great camera case. Adequate size accommodating my Nikon DSLR camera with three lenses, lens hoods, caps, media, lens add ons, flash, batteries and charger, extra media and more. The space is efficient with minimal dead wasted space. It even has a tripod holder on the side. Very good camera bag and would recommend this bag for the camera enthusiast.",
      "rating": 5.0,
      "verified": true,
      "author": "PapaJi",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "One tough bag!",
      "text": "I have had this bag now for about 2 years and it has been through the jungle , waterfalls, mud, even fallen down on rocks. The bag is tough and keeps the camera gear safe. It holds my two Canon DSLRS , one wide angle lens, fisheye lens, telephoto lens and a Prime lens. It also holds my macbook pro in the back compartment. I use this when traveling all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean. D",
      "helpful_votes": 2,
      "publication_date": 20160416
    },
    {
      "title": "I love this backpack",
      "text": "I love this backpack. I have had numerous camera cases before, but this one holds all my gear firmly in place while making it very accessible. The adjustable pads inside let me organize the case in a way that makes sense to me. The padding is dense and gives great protection to delicate lenses. I love that I can slip a laptop or tablet in the back. That gives me the freedom to use it for work and play, to shoot photos, and adjust them on the fly. I have taken this case with me hiking and to Mexico and back. No signs of wear yet which says alot, considering it climbed a mountain with me.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Bailey",
      "helpful_votes": 0,
      "publication_date": 20160317
    },
    {
      "title": "Geared up!",
      "text": "Very happy with it, it's not overwhemingly big, but it fitted my: ipad, Canon 5D M III, Canon 28-300mm L lens, Canon 70-200mm f2.8 L lens, 50mm f1.4 prime, Canon Speedlite 270EX, and a 24-70mm f2.8. plus battery charger, cable, tripod, cleaning kit..... the list goes on. All and all, I put about 20lb of gears in this. It is still somewhat comfortable to carry. Also a big plus, it does not look like a Camera bag, so there is no \"please rob me\" sticker on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Wade Lee",
      "helpful_votes": 13,
      "publication_date": 20130213
    },
    {
      "title": "Perhaps the best part of this bag is it fits under the ...",
      "text": "This bag is INCREDIBLE. I have had it for four years, over that time spend two months total in Uganda carrying it every day, trips to the Bahamas and Haiti, as well as over 30 weddings as a photographer and videographer. The bag has held up PERFECTLY. Perhaps the best part of this bag is it fits under the seat in front of you on an airplane. It's close, and occasionally they have questioned it at the gate, but always let it through and that means it maxes out the space you are given while still allowing you to bring an additional carry on. HIGHLY recommend this backpack.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel Kuhn",
      "helpful_votes": 0,
      "publication_date": 20161023
    },
    {
      "title": "Top notch bag compared to ThinkTank, Tenba etc",
      "text": "No doubt why this bag sells as high as $100 but if you can buy it at the right time you can get it as low as $20. The bag is totally worth even at $100. The construction and material is top notch. Also provides some serious protection for youe expensibe gear. Only thing to remember this is a camera and laptop only bag. It cannot be used as a general or school backpack. This is meant for pro photographers carrying their grear.",
      "rating": 5.0,
      "verified": true,
      "author": "Avishek Das",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Camera Backpack",
      "text": "This has been great, I really love it, it keeps the camera in a position to grab and use quickly. It is great for hauling the camera and accessories to remote locations, leaves your hands free for carrying the tripod. I would only warn that it doesn't protect the camera from a heavy weight falling on it from above, but it is great for storing and taking all the camera accessories with you on the go. You can adjust the inner storage to fit and divide all your camera accessories, this is a great feature.",
      "rating": 5.0,
      "verified": true,
      "author": "Moody M",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "Loved it, but not for broad shoulders",
      "text": "I really wanted to keep this, but ended up returning it simply due to it fitting a bit too snug. I’m 6 foot 1 inch tall with about a 54 inch chest and broad shoulders. I could wear it, but only barely with a light jacket with the straps fully extended. It would have been way too tight with a heavier jacket on for winter. I do highly recommend this, just wish the shoulder straps were about 2 to 3 inches longer to allow for a bit more wiggle room.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Arbuckle",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Incredible Bag - Highly recommend.",
      "text": "Wow, I'm not sure where to begin with this case. It's beyond awesome! Held all my gear and laptop. Took it on a photo safari and it did great. One suggestion would be to add more external pockets and straps that would hold an entire tripod. Other than that it's an awesome case. Very glad I purchased it.",
      "rating": 5.0,
      "verified": true,
      "author": "YJ",
      "helpful_votes": 4,
      "publication_date": 20160625
    },
    {
      "title": "Won't protect as I expected.",
      "text": "Very high-quality backpack. However, it didn't protect my camera when the bag felled out of the chair and hit the ground, actually the zipper damaged my camera from the inside when the bag felled! Needs improvements I am very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Rayan",
      "helpful_votes": 2,
      "publication_date": 20180130
    },
    {
      "title": "Great backpack",
      "text": "I was initially hesitant to order this backpack as I was concerned the quality was not good. The construction of the backpack is very solid. The customizable features inside the pack are very secure. They are not flimsy and take some effort to remove. So no worry of equipment moving around inside. The only thing I don't care for is how the pack opens for the main compartment. It needs to have zippers that are longer so the pack can open easier.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "... now and I this Camera bag has gotten some pretty rough use",
      "text": "It has been a year now and I this Camera bag has gotten some pretty rough use. It's still holding up well. My only complaint is that I wish it had a chest strap as it can get kind of heavy and after about an hour of walking with it, my shoulders hurt and have to take if off for a break. I know it's not a hiking bag, but adding some hiking bag features for comfort would really make this a top seller I think.",
      "rating": 4.0,
      "verified": true,
      "author": "Javier O.",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Buy with confidence. I wish it opened completely",
      "text": "It is light weight but worked well with my Europe travel",
      "rating": 5.0,
      "verified": true,
      "author": "L. MODHA",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Light to travel could be more spacious.",
      "text": "I got this as a gift for my friend. He was visiting New York and he liked this. He has not complained so far so will take that as a good sign. He did say that after using the bag for his camera equipments, he doesn’t have enough space left for like, one extra jacket. But he was not that upset about it.",
      "rating": 4.0,
      "verified": true,
      "author": "My name is",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Holds EVERYTHING! yet doesn't scream \"Expensive Camera Inside!\"",
      "text": "Lot's of space for your gear. I have my Canon 70D w/ 18-135mm lens, 55-250mm telephoto lens, 40mm prime lens, 430EX II flash, HD video camera, multiple batteries, multiple battery chargers, cables, memory cards, cleaning kit, outboard mic, outboard stereo recorder, 'dead cat', and manuals/papers in this bag and there is still room for more. It's crazy how you can get everything you need in here. Really pleased with the quality and logical layout. Unlike other reviewers, I see no issues with the arm straps--they are solid and heavy duty. This is a great bag for a great price. Thank you, Case Logic!",
      "rating": 5.0,
      "verified": true,
      "author": "Bobby",
      "helpful_votes": 0,
      "publication_date": 20140323
    },
    {
      "title": "Fits Canon 5D and Lenses",
      "text": "Been using it 9 months now. Nice tough rubber bottom keeps it stable when I set it down in the outdoors and prevents damage (and deflects dust/tiny rocks, so I don't track them in when i put it back in my car). Fits a lot of stuff, including my Canon 5D with 70-200mm attached. Plus my 50mm prime lens, my 17-40mm lens and my 24-105mm lens, plus two speed lights. However, because of geometry, it have to store the camera with the 70-200mm attached so when I switch to another lens, I have to switch back when putting the camera away. Great backpack though.",
      "rating": 5.0,
      "verified": true,
      "author": "Unique Individual",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "Carry less with more space.",
      "text": "Before buying this backpack I used to carry 2 bags around when I traveled, one for my camera and one for my laptop. Needless to say, this solved my problem. Now I travel a lot more organized, everything in one single place. I do with we could have more space somehow. You never only carry your camera and laptop when you're traveling so sometimes I still have to take an extra carry on. But that's just sometimes. I've only used this baby 3 times so far and it is great. I am loving it. Makes me look like a pro too. ^^",
      "rating": 5.0,
      "verified": true,
      "author": "Serge",
      "helpful_votes": 0,
      "publication_date": 20160427
    },
    {
      "title": "Do not buy it if you need to strap a  ptripod.",
      "text": "I think I had it for couple of years, the main zipper separated from the fabric and the tripod straps do not hold any normal size legs. Terrible design for tripod attachments. Reason why I am writing this review is because l lost my tripod at remote location, since I had to put the tripod down... It would not have happened if the tripod was attached to the bag... I always hated the tripod straps on this bag",
      "rating": 3.0,
      "verified": true,
      "author": "lalfie",
      "helpful_votes": 0,
      "publication_date": 20170203
    },
    {
      "title": "Not enough space even if it were used to begin photography.",
      "text": "Not even close to a great camera bag. It just doesn’t make sense in terms of space and the Velcro is cheap. I expected a lot from case logic as I’ve seen it in other stores but not this time. Buy a different bag even if it’s expensive.",
      "rating": 2.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Needs More Storage Room",
      "text": "Not really enough storage space and difficult to store some needed accessories. Everything had to be basically jammed in to fit. Very sturdy and pretty well thought out. Just not enough usable space.",
      "rating": 4.0,
      "verified": true,
      "author": "Tim H.",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "love it.. 100% recommendation.",
      "text": "Awesome bag.. Everyone loves it.... fits it all : 1. One Canon %d mark iii, 2. 70-200mm Canon 3. 16-35mm Canon 4. Tamron 24-70mm 5. Canon 100 mm Macro 6. One flash Yongnuo YN600EX-RT with the wireless unit and it's cables. 8. Canon battery charger 9. Canon cables. 10. lens filters 8 in all. 11. lens pens. 12. mobile charger. 13. I sometimes carry my Macbook Pro 16 inches in the laptop compartment. 14. about 20 rechargeable batteries. 15. Miscellaneous items.. No wonder,, my friends call it an ulimate bag for photography equipment. And to top it all, I feel secure with so much protection for each lens and the camera. I am very satisfied with it..would reommend it..",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon_user",
      "helpful_votes": 0,
      "publication_date": 20160328
    },
    {
      "title": "Love this backpack",
      "text": "Love this backpack. It fits 17inch laptop asking as it's not one of those enormous gaming laptops. If you have a Sony a6000 you will love this case. You can take out middle portion and it will fit mostly any telephoto lens just right. Consider before buying... If have an enormous tripod over 7lbs. The backpack will strain your right shoulder and tilt to right more. But most tripods especially good ones are under 3 or 4lbs",
      "rating": 5.0,
      "verified": true,
      "author": "Secret Customer",
      "helpful_votes": 0,
      "publication_date": 20160318
    },
    {
      "title": "It fits great. In fact",
      "text": "I bought this bag because I out-grew my old bag. I went from Nikkor 18-200 to the 70-200 f2.8. I was worried that it wouldn't fit. It fits great. In fact, I keep my 50 f1.4 in the same slot. This bag holds two speedlights and 3 remote triggers with room to spare. The reviews are correct about the straps. You won't climb Everest with this suspension but you'll get from your vehicle to your onsite shoot with ease. I love the heavy-duty padded dividers. The waterproof bottom and price made the choice easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Tac medic",
      "helpful_votes": 0,
      "publication_date": 20151209
    },
    {
      "title": "Best backpack!!",
      "text": "I love this backpack, It is roomy enough for all my camera gear and also my keys, cell phone, and even a small wallet. I have used it hiking around our trails and I even forget that I have it on. Tri pod holder works great. The solid base keeps it standing up and also keeps the bottom of the bag dry, and easy to just wipe off the dirt from sitting on the ground. Zippers all work great, the camera holder is easy to grab your camera out, although if I'm hiking I don't keep the camera in there, it's around my neck!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150405
    },
    {
      "title": "nice backpack for camera",
      "text": "this is a nice backpack for camera with very good protection. After using it on our trip, I felt it would be better if there was a zippered space inside the backpack to hold valuable items like passport and/or wallet. I also preferred lighter weight backpack as well but so far I have not able to find one like that yet so will continue to use this one for now.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Rugged and spacious",
      "text": "Sturdy construction and lots of room. Seems to be something that will last. Makes it easy to use as a carry on when traveling. Only negative is the strap to hold the tripod. Could have been a little bigger and have a pocket at the bottom for more secure carrying.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Good for lenses and body... not much more.",
      "text": "While an excellent backpack, it's quite heavy and very inflexible as to purpose. It excels at carrying camera and lenses, but don't expect to do much more. The padding in the compartments is so thick and strong that you can't really do much more than carry lenses. I'd still probably buy it again but it definitely has its flaws. If all you want to do is carry a body and lenses, go for it. Just don't expect to carry much if anything more.",
      "rating": 3.0,
      "verified": true,
      "author": "JMS",
      "helpful_votes": 3,
      "publication_date": 20131125
    },
    {
      "title": "Super Backpack Case!",
      "text": "Very rugged high padded comfortable backpack case. Well thought out compartments and generous multiple storage areas. Lots of space everywhere including storage for a 15\" laptop. You can carry gobs of camera gear in this case but being a backpack with two straps it requires removal for camera access by opening the rear zipper. No problem because you will be planning for this but I will usually use my sling and go on shoots with very little gear. But when I need a lot of gear this is one heck of a case!",
      "rating": 5.0,
      "verified": true,
      "author": "Ran",
      "helpful_votes": 0,
      "publication_date": 20150518
    },
    {
      "title": "Not falling over backpack",
      "text": "I ordered this backpack for my husband’s new camera and he loves it. It has a very sturdy base, it would not fall over. It is so unique. He managed to pack all the items into this backpack.",
      "rating": 5.0,
      "verified": true,
      "author": "Lotus Path",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Awesome Camera Bag",
      "text": "Bought this for my wife because she outgrew her smaller Case logic bag. This one has enough room for all of her lenses and camera bodies. You can change the configuration on the inside with velcro attached dividers and it still has there fancy little camera sling. It also has the rubberized bottom so you won't ruin anything if it happens to get wet on the bottom. Side attachments for a tripod and like things on each side. Its a very good case, my wife is not a professional but she does a lot of outdoor photography, family photos, weddings thing of that nature and this bag is perfect for her.",
      "rating": 4.0,
      "verified": true,
      "author": "harold segars",
      "helpful_votes": 0,
      "publication_date": 20130707
    },
    {
      "title": "Doesn't feel like a quality bag",
      "text": "I replaced my Lowepro bag with this camera bag as my particular Lowepro bag didn't have a slot for a laptop and only had one strap. This bag has a laptop slot but overall the bag just doesn't have a quality feeling to it. I think that feeling is mainly because of the thin straps. I've used the bag for several months and so far the straps have held up, but the straps twist easy so the straps don't feel as rigid. Really hard to explain why they don't feel right. Also, my camera doesn't remove as easily as my LowePro did. One positive of this bag is the orange inside. That I do like.",
      "rating": 2.0,
      "verified": true,
      "author": "pexring",
      "helpful_votes": 0,
      "publication_date": 20140302
    },
    {
      "title": "Great backpack for the price.",
      "text": "Extremely functional! Loads all my gear with a little room to spare. I prefer this to my Tamrac Expedition bag as it's much lower profile and makes taking the camera in and out of the bag incredible easy. The orange accents on black look great. Only complaint is that it doesn't have a hip or shoulder strap. Would make hiking with the bag much easier. Side Note: I sprayed mine down with a few coating of waterproofing spray and was able to use it in a decent rain storm for hours. A tiny bit of moisture seeped through the zipper, but not enough to get anything inside wet.",
      "rating": 4.0,
      "verified": true,
      "author": "emike09",
      "helpful_votes": 0,
      "publication_date": 20131114
    },
    {
      "title": "GREAT Pick for a Nikon D3100",
      "text": "I took this on my recent trip to Yellowstone. It worked out great. It was the perfect size for the plane's carry-on compartment and everything was well protected during flight. Instead of bringing my lap top I used that pocket for magazines and light reading on the plane. I shoot with a Nikon D3100 and this pack worked out perfectly for the camera, extra lens and a few other accessories. At Yellowstone the exterior tri-pod holder was a huge plus and the ease of accessibility for just the camera was super handy. After adding my extra lens we still had additional space free for a few power bars and a nalgene bottle :) Would highly recommend this product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "CrankyWookie",
      "helpful_votes": 3,
      "publication_date": 20110822
    },
    {
      "title": "Be careful if you like to keep attachments on the camera body as this ...",
      "text": "The bag is quite roomy and holds everything I typically use - camera body with 18-140 lens, 70-200 zoom, filters, batteries, laptop, flash and tripod attached to the outside. I use a battery pack on the bottom of the camera and a GPS unit, which I don't want to remove as well as a hand strap that connects to the bottom of the camera. This makes the camera very tall and causes this bag to struggle a bit. Not the fault of the product, of course, but the photo of the bag illustrates an ideal setup. Be careful if you like to keep attachments on the camera body as this bag may not be ideal for you.",
      "rating": 4.0,
      "verified": true,
      "author": "David Bacon",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "Nice bag",
      "text": "I really like this bag. I could have done without the laptop compartment, but paperwork, wallet and chequebook fit in there nicely! I like the fact you can adjust the lens compartment to fit other bulky accessories such as flash, lens hoods, remote controls. However I think the external pockets are a bit limited. I would have liked to be able to access more of my accessories without having to open the main compartment. Apart from that, the bag is nicely built, with good materials. The hard plastic bottom is really nice, so you can place the bag down on any surface without worrying about the bag getting wet.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Auffret",
      "helpful_votes": 0,
      "publication_date": 20130711
    },
    {
      "title": "I have found this bag great to travel with",
      "text": "I have found this bag great to travel with, but hard to work out of. It holds everything I need and more. The laptop area is very protected and the camera gear is also very padded. I use it to take my gear on planes. It fits under the seat where you can keep an eye on it. Once I am at my location, I switch to my Domke shoulder bag when shooting. I do not like to sit it on the ground to access gear and it is easily unzipped when it is on your back without you knowing. It is also fairly deep so it sticks out off of your back.",
      "rating": 4.0,
      "verified": true,
      "author": "shutterspeed1000",
      "helpful_votes": 0,
      "publication_date": 20141227
    },
    {
      "title": "A Light Work Horse",
      "text": "A medium sized bag that packs like a large one. Fits my 17 inch mac, 13 inch mac air, and a tablet in back compartment. And plenty of room for a couple of cameras and lens in the main. I traveled internationally with it and took a lot of beating and I still use it as my goto \"beater\" bag. The only thing I would add is an option to a waist belt when carrying a heavy load, but it's quite rare I carry 25+ pounds of gear with this bag. To sum it up, this is very light work horse bag.",
      "rating": 5.0,
      "verified": true,
      "author": "John Kim",
      "helpful_votes": 0,
      "publication_date": 20141002
    },
    {
      "title": "Great for streets",
      "text": "It is a good street/urban camera bag: bigger enough for most of the lenses you need for street, and small enough to be comfortably carried around.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "Substantial backpack",
      "text": "I really like this backpack. it holds all my gear and i can put it on the ground without worrying if any moisture is going to soak into the bottom of it. That's big.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Henderson",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "perfect backpack",
      "text": "My boyfriend recently got into photography and hard the hardest time finding a way to manage all of his equipment. I got this one for him mainly because the backpack sits up/stands on its own and the versatile compartments. It truly is everything the description says it is! He carries around 3 different lenses, extra batteries, the battery charger, a strap for his backpack, cords and cables, etc. He even manages to fit his 16\" ThinkPad into the back, but we've yet to figure out how to get his brick of a charger packed into it. Overall, he loves it and is super happy with the color scheme, too!",
      "rating": 5.0,
      "verified": true,
      "author": "smyhelee",
      "helpful_votes": 0,
      "publication_date": 20130712
    },
    {
      "title": "This backpack is great, the size is perfect and the dividers in ...",
      "text": "This backpack is great, the size is perfect and the dividers in the middle are also awesome. It makes putting things in it possible because you adjust the dividers to fit what you need and where you need it instead of having preset sections. Its super padded and the hard bottom is great too because you can wipe it off if it gets dirty. The laptop spot fits different size laptops, ours is a 15in and fits nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina G",
      "helpful_votes": 2,
      "publication_date": 20161128
    },
    {
      "title": "Just what I needed",
      "text": "This bag is just what I was looking for. After upgrading to a full frame camera (Nikon D750) I needed a backpack that could hold my camera with battery grip attached. I did have to remove the added padding and the hammock that's included in order to fit the camera but it's easily accessible and still well protected. The backpack holds all my accessories and I love that I can also store my laptop. The tripod straps on the side hold very well and the bag seems very durable. I can't wait to start traveling with this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Felix",
      "helpful_votes": 3,
      "publication_date": 20161002
    },
    {
      "title": "Great pack for the price,",
      "text": "Only had it for a week, but seems like a well made pack. Fits everything. The side and front pocket could be a bit deeper (hence the 4 stars). Top pocket and sling for quick grab is great.",
      "rating": 4.0,
      "verified": true,
      "author": "js",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Well Built - Value Product",
      "text": "I like this camera bag because it is compact yet it has room for several pieces of equipment. The molded bottom helps the bag sit upright but it keeps the main zip cover from opening far enough to easily access the equipment stored in the bottom section of the bag. This will vary based on how the removal dividers are placed in the bag.",
      "rating": 4.0,
      "verified": true,
      "author": "Joey Herndon",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Protective!",
      "text": "This bag is very protective and holds quite a bit. I bought it so that it would hold my 70-200mm lens and it fits perfectly. It also stands on its own (although it does tend to tip over if you happen to run into it or a sharp gust of wind should blow) which is handy. It's comfortable to carry for extended periods of time, although it does get quite warm after a while. It's lightweight (even full of lenses and cameras and flashes, oddly enough) but very bulky. It sticks way out and you tend to feel like you're in the way all the time. Or I do anyway.",
      "rating": 4.0,
      "verified": true,
      "author": "Luke",
      "helpful_votes": 0,
      "publication_date": 20140603
    },
    {
      "title": "Not quite adequate",
      "text": "What really disappoints me is the camera suspension system which supposedly allows quick access to the camera. I found that it made it tough to get the camera free and required more yanking than seems appropriate for expensive gear. Also it lift the camera body up toward the top flap which will lead to scratches or damage. I will probably return it or use it for an older, smaller camera body.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Sabet",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "My wife loves this bag!",
      "text": "My wife loves this for her camera. Been traveling with it and also just local trips. Holds everything she needs, and quick and easy access to the camera itself.",
      "rating": 5.0,
      "verified": true,
      "author": "Sdudd",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Perfect backpack for a lot of gear!",
      "text": "Really needed this backpack to fit the canon 5d mark III and a bunch of different size lenses that are very large in size. It’s great it fits a laptop and/or tablet as well as some other things. It stands up on it’s own without leaning it against anything. Really great product, and really happy I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniella gagliardi",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Purchased this for a trip to California and I love it! It's made really well and has a ...",
      "text": "Purchased this for a trip to California and I love it! It's made really well and has a lot of organization and pockets. Well padded so your equipment is protected and also has a rubber bottom. I love that feature. It comes up a few inches all around the backpack and 1. Gives it stability and 2. Protects the bottom and your equipment from getting wet. Can easily be wiped off if it gets dirty. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristine",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "The partitions inside just don't look or feel sturdy. I have an Canon EF 70-200mm f/2",
      "text": "Returned the bag unused. My concern was the very \"cheap\" feel to both the outer shell and the insides of the bag and the gaudy orange color of the partitions and cushioning inside. The partitions inside just don't look or feel sturdy. I have an Canon EF 70-200mm f/2.8L IS II USM Telephoto lens and I don't trust this bag to hold it steady. Also, realized that the bag I had bought as new was not new at all - going by the camera manual I found in one of the inner pockets.",
      "rating": 2.0,
      "verified": true,
      "author": "OOO",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "Just had a few days but so far so good. The only two draw backs",
      "text": "Just had a few days but so far so good. The only two draw backs: The top loading portion where you can \"easily access\" your camera doesn't work for my D300 with larger battery compartment on the base. I had to do some maneuvering of inserts to get it to zip. It could be just a tad longer. When I unzip the case fully I still have to struggle a bit to get to items at the bottom. It does seem to be well constructed and made of solid material.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20160114
    },
    {
      "title": "Definitely a great purchase.",
      "text": "I was in need of a better way to transport and carry my equipment with me everywhere. This bag was the perfect choice. The quality is great. The padding inside is well made and the compartments for storage are so well thought out. I know my equipment is secure! I carry two camera body's, 3 lens, a speed light, tri-pod, business cards. extra straps and caps, and still have room for more. I do wish there was a strap across the chest for better security when I'm driving around on my scooter but other than that, This is totally worth purchasing for any photographer.",
      "rating": 5.0,
      "verified": true,
      "author": "afamilyofamazoners",
      "helpful_votes": 0,
      "publication_date": 20130827
    },
    {
      "title": "Love it overall!",
      "text": "This back is PERFECT in every way except one; I wish it had another compartment for storing some papers and other things. But other than that, the compact size is good. Camera sits in place and is safe from damages that could be caused by jerks or even dropping the backpack. The lens compartments are velcro'd, which facilitates the customization depending on the size of lens we have. The base makes it water resistant from wet surfaces and also balances the backpack to stand. Over all, I love this product! Definitely recommend this for someone who just started photography and wanna carry their camera set and laptop together.",
      "rating": 4.0,
      "verified": true,
      "author": "Gdua",
      "helpful_votes": 0,
      "publication_date": 20121028
    },
    {
      "title": "designed for cameras by camera guys",
      "text": "pros--nice clean style...unique hammock hold at top for main camera affords easy access...orange interior makes it easier to find things...plastic bottom keeps bag upright and is waterproof...good array of nooks and crannies cons--top loop handle is flimsy, I wrapped some foam around it to make it more secure...backstraps ditto, need more foam...no waist strap...tripod hold is 50-50, i.e., handy if you use it but bad because it sacrifices pouch space.",
      "rating": 4.0,
      "verified": true,
      "author": "King doey iii",
      "helpful_votes": 0,
      "publication_date": 20151204
    },
    {
      "title": "Great protection",
      "text": "I really like this backpack. The padding is really nice. It is stiff to get in and out of. I use for travel but once I get on location I keep my camera on me. Just because it is stiff and really more geared for traveling.",
      "rating": 4.0,
      "verified": true,
      "author": "HDoyle",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "The best amount of cushion and support for your equipment that ...",
      "text": "The best amount of cushion and support for your equipment that you can carry on your back. makes traveling easy and i wear it when i shoot events moving place to place outdoors where i may need to change lenses or filters. the bottom being plastic is great so i can feel comfortable putting it down in a variety of settings where there may be some bugs or condensation, i can just wipe off bits of dirt, small leaves, or wetness. Great for on the go shooters!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessi P",
      "helpful_votes": 0,
      "publication_date": 20150719
    }
  ],
  "product_meta": {
    "title": "Case Logic SLRC-206 SLR Camera and 15.4-Inch Laptop Backpack (Black)",
    "description": "Product Packaging:Standard PackagingA tough and ready photo back designed to keep pace with your approach to photography with rugged styling, professional grade interior and organization for a DSLR camera, drone and accessories. Adjustable dividers create a fully customizable interior. Air mesh on back panel provides breathability and comfort",
    "rating": 4.6,
    "feature_bullets": [
      "Backpack fits SLR camera body with attached lens, a DJI Mavic Pro (or drones up to 320mm x 270mm x 140mm) and a variety of accessories",
      "Patent pending hammock system suspends your SLR above the bottom of case, providing superior impact protection",
      "Water-proof EVA base withstands the elements and allows the case to stand up on its own",
      "Memory foam on interior of backpack lid helps protect your delicate LCD screen. Material: Nylon",
      "Computer compartment compatible with 16\" laptops and the 17\" MacBook Pro; Fits devices  10.4 x 4.7 x 15.4 inches"
    ],
    "specifications": {
      "Product Dimensions": "12.5 x 8 x 17 inches",
      "Item Weight": "2.68 pounds",
      "ASIN": "B002DW99H8",
      "Item model number": "SLRC-206BLACK",
      "Customer Reviews": "4.6 out of 5 stars2,714 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#1,514 in Laptop Backpacks",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 17, 2003",
      "Department": "Unisex-adult",
      "Manufacturer": "Caselogic"
    },
    "categories": [
      "Computers & Accessories",
      "Backpacks",
      "Bags, Cases & Sleeves",
      "Electronics",
      "Laptop Accessories"
    ],
    "price": 93.27
  }
}