{
  "website_summaries": [
    {
      "verdict": "Versatile nailer that has the best performance. Offers a nice collection of useful features.",
      "pros": [
        "Will accept nails between 2 and 3.5 inches in length",
        "Includes an anti-dry fire mechanism",
        "Offers a no-mar tip to prevent damage to the surface of the material",
        "Adjustable air exhaust direction",
        "Good value with a high performance level"
      ],
      "cons": [
        "Some problems with nails jamming inside the machine",
        "Setting nail depth can be a challenge"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Will Not Reliably Sink 3\", 3 1/4\" or 3 1/2\" Even At 120 PSI...",
      "text": "If the PFR2190 will not reliably sink 3\" or longer .131 nails then what's the point...I used a few drops of oil as recommended, but it didn'r help...I really wanted to like this nailer as I own a couple other Freeman products, but it just doesn't have enough power, even at 120 PSI...It's only rated at 120 PSI, so I'm not willing to risk serious injury just to make it work at a higher PSI...It works great at anything under 3\" so I gave it a 3 rating.. kd",
      "rating": 3.0,
      "verified": true,
      "author": "kandoro",
      "helpful_votes": 20,
      "publication_date": 20180715
    },
    {
      "title": "Good value but...",
      "text": "Warranty service is great. Wish I did not need it. After very little use it quit working. I sent it in and got one day service. They replaced dried out O-rings. My fault. You should lube it after use to keep the O-rings fresh. My main complaint is that it does not feed well. I used a Rigid and it worked flawlessly with the same nails. Maybe paper collated nails would work better but they are hard to fine. I guess for occasional home use it is ok but I would not recommend for the heavy user. I will say that I did like the Rigid from HomeDepot.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 10,
      "publication_date": 20160903
    },
    {
      "title": "Good nailer for the price",
      "text": "This nailer does a good job and was a fill in replacement for a my older Porter Cable FR350 which finally failed. The Freeman does a good job for the price. However, in toe-nailing studs, I had to set the nails since the nailer did not drive them deep enough (with 120 lbs of pressure). Also, the Feeman can not seem nail as fast as the Porter Cable without allowing the compressor to have some recovery. However, for the price and as an occasional homeowner user, it works well. (no complaints). The nailer seems to be built well and no ovious issues. Much quicker than hand nailing for a reasonable price.",
      "rating": 4.0,
      "verified": true,
      "author": "Kim A.",
      "helpful_votes": 3,
      "publication_date": 20180127
    },
    {
      "title": "Good Value",
      "text": "This is a solid product. It is, however, like all of the other framing nailers heavier than I would have liked and cumbersome. It does the job, however, as I've been framing out my garage for insulation. It has not jammed and it drives the 3-1/2\" nails at the correct depth and with no problem so I have no real complaints other than its weight and balance - but all of the other nailers are similarly weighty and unbalanced by necessity and design. I'd buy it again and would buy Freeman's other products as well. If the framing nailer is an example, their other products are an excellent value.",
      "rating": 5.0,
      "verified": true,
      "author": "Careful Buyer",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Good value",
      "text": "Great value for the money. Had no problems sinking 3 inch nails into treated lumber. The only thing that tripped me up is that it doesn’t seem to like when you get down to the final few nails. No problem after adding another strip of nails to the loader. Comes with a hard case to store when not in use and a small bottle of oil. Overall, a solid buy and happy with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Y.",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Not for a contractor. Maybe for the DIYer.",
      "text": "Returned the first one. Trigger seal sprung a leak after about 2,000 nails in 2 weeks. Second one jammed on the first clip of nails. Double feed. I missed the deadline to return it. I oiled each gun before initial use. I oiled the first one a few more times after as needed. They're just not made for contractor work. Maybe okay for light use. My Ridgid and Husky framing nailers that I have since purchased work much, much better. 3 stars because it's not absolutely terrible. Just not good enough for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171127
    },
    {
      "title": "For the price this nail gun did an excellent job. I did have a jam while framing ...",
      "text": "For the price this nail gun did an excellent job. I did have a jam while framing my basement, but that was my fault. The reason for the jam was because the head of the nail got caught on the rail while loading the gun so the spring didn't feed the nail in properly. It isn't a design flaw, just dumb user error... I don't know how well this gun would hold up using it for multiple jobs, but it did a great job on my entire basement.",
      "rating": 5.0,
      "verified": true,
      "author": "carl",
      "helpful_votes": 3,
      "publication_date": 20160525
    },
    {
      "title": "Fantastic - used on fence line for weeks!!",
      "text": "Used this for my fence project and it is amazing!! Could not be happier with it. High quality fit and nail driving was exactly what I needed and how i wanted it! Well worth the money, would buy again! Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Ama$onAlot!",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Meh",
      "text": "I wanted to like this so much more than I do. It's very finicky to calibrate nail depth. It's very bulky and needs to be in a larger space to function properly because of its size. I had a few jams and they weren't easy to fix. I mainly bought it because it works with 2\" nails. I haven't used it for the fence I'm about to build but I have used it with bracing floor joists (not functional and had to use screws). I'm hoping it can redeem itself with the fence, otherwise I'll need to buy a coil nailer.",
      "rating": 3.0,
      "verified": true,
      "author": "I. Arch",
      "helpful_votes": 0,
      "publication_date": 20150816
    },
    {
      "title": "Passable",
      "text": "Good value. Bought as replacement while my Hitachi was being repaired. No where close to the Hitachi framer. Biggest gripe is too narrow a slot where nails feed.",
      "rating": 4.0,
      "verified": true,
      "author": "Jknight",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "A satisfied customer.",
      "text": "I have found this nail gun to be very dependable and easy to use, though I've only used it to add a room to my home and to build a chicken house. I've had a little problem with the depth adjustment but, overall, I am very satisfied with the nail gun.",
      "rating": 4.0,
      "verified": true,
      "author": "sffone",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Built to Last; Reduced Construction Time by 50%",
      "text": "I'm a handyman-not a contractor. I have a smaller air finish nailer but I've never owned a full-size nailer. I ordered the Freeman PFR2190 and it arrived well packaged in three days and included a nice hard plastic carrying case and easy to understand directions. I purchased it to frame a new garage and I ordered a box of Freeman brand 21 degree framing nails with my purchase. I finished the garage over the weekend and the nailer performed beautifully. No misfires, no jams, well balanced and cut my construction time by a minimum of 50%. Toe nailing has never been easier. I give this product 5 stars. It is high quality, works smoothly and is built to last.",
      "rating": 5.0,
      "verified": true,
      "author": "Atlantajack",
      "helpful_votes": 0,
      "publication_date": 20140903
    },
    {
      "title": "Great for your money",
      "text": "Great nail gun! I didn’t like the loading first and if you want to put two full magazine in at the same time, the second one a little harder to put in compared to other guns. Other than that works great, and for the price was well worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Istvan Fodor",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Easy to Use",
      "text": "Great Value for the money. Not as lightweight as expected, but still feels good. Made building a deck, 2 ramps and a wood rack really easy.",
      "rating": 4.0,
      "verified": true,
      "author": "HICK FROM MAINE",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Great framing nailer for the money",
      "text": "Immediately put it to work framed ng out a room. Had a few double fires but ultimately got the job done even running off my little pancake compressor. The weight was a bit more than I would like only because I have some shoulder issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Crutchfield",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Awesome!",
      "text": "this thing rocks!!! used it to build barn and tack room, have run several thousand 3\" and 3 1/4\" nails through it and only had a couple minor jams that were easy to clear. well built design, solid feel to it.....only drawback for this is it is a little on the heavy side, my wrist would get a bit sore after a full day of using this.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151102
    },
    {
      "title": "Houston we may have a problem.",
      "text": "This nail gun came with all that I needed. It was easy to set up and I was up and running pretty quick. I have used many other framing nailers before (Porter Cable, Hitachi, Bosch, Dewalt), but never had one that shoots sparks with every nail. That has not happened with the other brands.",
      "rating": 2.0,
      "verified": true,
      "author": "Mustache_you_a_?",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Lots of nails, 0 issues.",
      "text": "We used this nail gun on a project we were working on that required doing some decking (attaching plywood to trusses.) The product when through several boxes of nails with out a single problem. We started out with the black trigger (non-bump trigger) and ended up changing to the orange trigger. Swapping triggers around was a snap and it was nice the alternate trigger was provided. The unit does use a lot of air so make sure you have a compressor that can handle the amount of air required. We drove 2 1/4\" 6d ring shank nails and 3\" 6d ring shank nails all day long.",
      "rating": 5.0,
      "verified": true,
      "author": "Rolaids0",
      "helpful_votes": 0,
      "publication_date": 20130215
    },
    {
      "title": "Economical Framing Gun",
      "text": "Works well with 0.0120, but the 3\" 0.0131 nails rarely make it all the way in. Pressure needs to be at the higher end of the gauge ~ 90-100. Shorter nails go in easy and it has not jammed or given me any problems.",
      "rating": 4.0,
      "verified": true,
      "author": "Gregory B",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "Fair Price, Good quality",
      "text": "The nailer does what it is supposed to do. It is fairly priced, and looks durable enough for pro work. I like it. About 5000 nails so far and it is working like a champ.",
      "rating": 5.0,
      "verified": true,
      "author": "Someonemysterious",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Item fell apart during the first usage!",
      "text": "The trigger on the device malfunction during the first usage allowing air to bypass the triggering device! Trying to get the device replaced is more difficult than it should be for purchasing a totally new item! Phone calls and emails amount to what seems like hours with the support staff and I have yet to have repair or replacement concerns addressed for this item.",
      "rating": 1.0,
      "verified": true,
      "author": "Kenneth Mitchell",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Great nail gun",
      "text": "Can’t beat this nail gun @ any price. Haven’t mistreated though so it’s possible it wouldn’t survive a fall from the scaffolding.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim M.",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Not enough power",
      "text": "Can't sink 3 1/4\" .131 nails. the only time it comes close to it, is against something completely solid and perpendicular to the surface but in a real framing world trying to sister studs or toe nailing... it leaves nails 1/4\" above the surface...it looks like not enough power even with the \"depth setting\" to the limit.",
      "rating": 3.0,
      "verified": true,
      "author": "Victor Bashensky",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Great product so far",
      "text": "Loved using this gun for my projects haven’t used it as much as my Senco but we ll see",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Bazzell",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Great nail gun!",
      "text": "Top quality and a very good value! Never had a problem and I nailed over 7000 nails!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Schulz",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Good Value - would buy again.",
      "text": "I have run about 500 nails through it with no jams on a basement project. It will drive 3\" nails and countersink them with no problem. A couple reviews mentioned about it being tough to toe nail with it. The plastic end of the safety can be removed a spring clip. That will reveal a serrated nose that makes toe nailing much easier. The instructions do not mention this any where I could find. This is a solid 4 and the only reason I did not give a 5 is that it IS a heavy beast.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 5,
      "publication_date": 20140330
    },
    {
      "title": "Great Gun",
      "text": "Really liked working with this to reside my garage. It works just fine. Shot about 1,000 long, shanked nails with no issues.",
      "rating": 4.0,
      "verified": true,
      "author": "w ripley",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Love this gun",
      "text": "Love this gun !! kicks ass and cost pennies compared to the local HD ones , that break just the same as any other gun these days . no reason to spend $ 300 on a dewalt or something when they are all made in china at the same place lol. I am a 15 year veteran carpenter and this is the best framing nailer ive owned .",
      "rating": 5.0,
      "verified": true,
      "author": "Kluntor Boogie",
      "helpful_votes": 2,
      "publication_date": 20151010
    },
    {
      "title": "Flawless",
      "text": "Drove 1,850 3 1/4\" 0.131\" dia. ring shank galvanized nails without a single jam or misfire while rebuilding my deck. Mechanism was a little stiff, initially, but quickly loosened up and worked smoothly after a little wearing in with use.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank James",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "Excellent for my needs",
      "text": "Great price for a moderate use tool. Have 2 smaller Freeman nailer's for my woodworking business and I am happy with them also. A nice upgrade from my 15 year old Harbor Freight framing nailer..... couldn't find nails for it anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry Beauchamp",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Awesome framing nailer",
      "text": "Awesome framing nailer. Great product warranty. I have not had this nail gun jam yet. I did have to get used to the gun not firing the last few nails in a strip. Just add a couple more strips and keep on nailing. I have shot ring shank and smooth shank nails with no problems. I don't see you going wrong purchasing this framing nailer.",
      "rating": 4.0,
      "verified": true,
      "author": "Electric Redneck",
      "helpful_votes": 0,
      "publication_date": 20140722
    },
    {
      "title": "It's great!",
      "text": "Just what I was looking for at a good price! We do a lot of work around the house, as in rehabbing our house and making a shed in the back yard. We've already gotten our money's worth!",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Patterson",
      "helpful_votes": 0,
      "publication_date": 20160114
    },
    {
      "title": "Great for putting up a fence",
      "text": "This was my first nail gun, easy to use and works great",
      "rating": 5.0,
      "verified": true,
      "author": "L. A. RYAN",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Hard on the tool, but it continues to perform.",
      "text": "I've built and office, guesthouse and completed a few other projects with this nail gun and haven't had any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Austin L Rucker",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Nice nail gun for the price.",
      "text": "I purchased this nailer to use in framing out a new garage. It met all my expectations for performance and reliability. I fired around 1500 3 in. nails and had no misfires or jams. It was a nice solid built nail gun that met all my needs",
      "rating": 5.0,
      "verified": true,
      "author": "Swo",
      "helpful_votes": 2,
      "publication_date": 20141218
    },
    {
      "title": "Awesome nailer!",
      "text": "The price is great for this nailer. I am a do it yourselfer and didn't know too much about nail guns. I read countless reviews and this one had a lot of great ones so i went for it. It was considerably cheaper than the ones at the big box stores and comes with a 7 year warranty! I framed out 5 rooms in my house and this thing didn't miss a beat. It comes in a nice plastic case with some oil and a pair of safety glasses. Couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20130422
    },
    {
      "title": "Love this Thing",
      "text": "Finished multiple projects with this, and no complaints. Just take care of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Day Johnson",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "... my 16 x 32 garage and couldnt be more pleased with its performance",
      "text": "I bought this to build my 16 x 32 garage and couldnt be more pleased with its performance ! Heavy built (not too heavy) and has performed as advertised thru completion . There is no need to spend more unless you are a full time builder . FYI , Freeman builds many other companies nailers. !",
      "rating": 5.0,
      "verified": true,
      "author": "Clyde",
      "helpful_votes": 0,
      "publication_date": 20150605
    },
    {
      "title": "Great Tool!",
      "text": "I bought this Freeman Nailer for my husband for Christmas, and he really loves it. He has already found a couple of projects around the house that he could use if for, and I am thankful, as they probably wouldn't have gotten finished if he didn't have this tool. I'm sure he will get a lot of use out of it!",
      "rating": 5.0,
      "verified": true,
      "author": "P. Matonis",
      "helpful_votes": 0,
      "publication_date": 20140407
    },
    {
      "title": "Must have for DIY",
      "text": "A must have when you have repair and maintenance jobs to do. It took my husband and I an hour to replace the plywood walls on our screened porch. (you do have to have a portable compressor) Several more jobs left to go but a wonderful time and energy saver.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20141215
    },
    {
      "title": "Excellent, works as advertised.",
      "text": "Packaging was durable. Exterior Amazon box. Internal product box. Tool is inside a hard plastic shell case. Remember to buy the appropriate nails while buying the nailer. Open the boxes, add some drops of oil, check your air pressure, and test a nail or two in some sample wood. Then have fun and build stuff. Worked great for framing some walls and building some new stairs in the garage.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Heinrich",
      "helpful_votes": 0,
      "publication_date": 20120122
    },
    {
      "title": "Stop researching and buy this already!!",
      "text": "So far, I love this product. It has exceeded my expectations and very easy to use.I highly recommend you buying this if you’re needing a very good framing gun.",
      "rating": 5.0,
      "verified": true,
      "author": "Rey Casapao",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Wonderful tool!",
      "text": "Love it -- built our 10x14 gambrel roofed shed from scratch with it -- it's a wonderful tool. Tiny house next major project!",
      "rating": 5.0,
      "verified": true,
      "author": "Maureen G.",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Worked great, right out of the box!",
      "text": "Outstanding piece of equipment... it arrived with a box of nails that I'd also ordered... I opened it up... loaded it with nails... plugged it into my small compressor and proceeded to nail up over 200 ft. of fencing... without a single hitch!",
      "rating": 5.0,
      "verified": true,
      "author": "Big Cal",
      "helpful_votes": 0,
      "publication_date": 20150526
    },
    {
      "title": "It is a great price for what I need",
      "text": "I've only used it for an hour or two, and it has performed well with no jams. Nails go all the way, and do not require hammering later. It is a great price for what I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis F.",
      "helpful_votes": 0,
      "publication_date": 20161124
    },
    {
      "title": "As good as any other brand..",
      "text": "Nice gun for the price , I've purchased several framing guns over my career and this is as good as any other I've owned . The case is a kinda cheaply made but the tool itself performs just as good as the $200 gun I bought 3 years ago .. I can't say how long it will last but it's well worth the price...",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170211
    },
    {
      "title": "Nice gun for the price",
      "text": "I framed about 2800 Sq Ft of basement in my home with this tool and it didn't fail once. Nice gun for the price. Only drawback is that it needs some type of hanger or hook for ladders; other than that, I'd buy it again. I'm not a professional carpenter but this tool made me feel like one and cut my time in half.",
      "rating": 4.0,
      "verified": true,
      "author": "Gregory F.",
      "helpful_votes": 3,
      "publication_date": 20141225
    },
    {
      "title": "Easy to use without setup",
      "text": "This was my first framing nailer. I have had a finish nailer for several years. Needed this for installing 1/2 inch plywood on outside wall studs in preparation for installing hardieplank siding. Also used for installing hardie soffit. Works great right out of the box. Reasonable cost as compared to major brands. Half way thru job and have had no problems. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "TxDIYer",
      "helpful_votes": 0,
      "publication_date": 20121112
    },
    {
      "title": "Great homeowners gun.",
      "text": "I didn't need anything too fancy, but I needed a real nail gun. After borrowing friends to frame out a room and built one shed, when it came time to build a second shed I bought this. It works well. It is pretty light. Seems well made. For the 3000 nails I've run through it, I've been very happy.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Bates",
      "helpful_votes": 3,
      "publication_date": 20121126
    },
    {
      "title": "Love it",
      "text": "great for the price. it is rather heavy compared to other models.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Harris",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Buy a metabo framing gun instead",
      "text": "Bought in in August of 2019 and broke down on November I oiled it every time I would use it. Would not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "Alex R.",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "but it does a good job at a pretty good price",
      "text": "I don't have a lot of experience in this type of tool, but it does a good job at a pretty good price. I'm happy with the purchase!",
      "rating": 4.0,
      "verified": true,
      "author": "Steven Adamczyk",
      "helpful_votes": 0,
      "publication_date": 20170518
    },
    {
      "title": "One Star",
      "text": "Literally used it once, by that i mean 1 nail and failed.",
      "rating": 1.0,
      "verified": true,
      "author": "tchc",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Would of gave it a 5 star but the last ...",
      "text": "Would of gave it a 5 star but the last 4 nails never fire so you have to reload early.",
      "rating": 4.0,
      "verified": true,
      "author": "AC",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Siding Contractor",
      "text": "i have to tell everyone i can about how good these guns are. i have been installing siding, triming houses, and framing for 20 years and have always been a hitachi and makita guy, but since i've started using these guns i have no reason to buy them again. i have been forced to branch off into other areas like roofing and interior trim. I've bought several of their guns and i have had zero problems with them. great service, quick shipments, and a very dependable product. Freeman deserves a bid kudo for bringing a great product to us at a price everyone can afford.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Mulkey",
      "helpful_votes": 79,
      "publication_date": 20091112
    },
    {
      "title": "Great nailer for the homeowner",
      "text": "This is my first peneumatic nailer, and it has been a great purchase. I use it for outside projects such as framing and fence work, shooting 2 to 3 1/2 inch galvanized nails. My small Craftsman comperssor runs this just fine. The gun has worked with no problems on several projects. Makes me wonder why I didn't get one sooner!",
      "rating": 5.0,
      "verified": true,
      "author": "C. Stone",
      "helpful_votes": 0,
      "publication_date": 20121029
    },
    {
      "title": "Pretty good gun for the price",
      "text": "Pretty good gun for the price. It's not efficient if you plan on doing any real framing, as it needs reloaded way too often, but is good for small projects. Worth spending the money for an upgrade if you plan on using it daily.",
      "rating": 4.0,
      "verified": true,
      "author": "BpM",
      "helpful_votes": 0,
      "publication_date": 20150726
    },
    {
      "title": "easy to use",
      "text": "very good quality for the money, i use a DeWalt at work and this one works just as good.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "No complaints",
      "text": "Husband loves his new guy he work on the roof all day. He said very easy to handle and price is great. No complaints so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Lira",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Good While It Lasted",
      "text": "This didn't last the building of one deck before the trigger valve started leaking air. Check the warranty carefully. Basically, anything that moves isn't covered. Hopefully I can fix the leak.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Oh I love this thing",
      "text": "Oh I love this thing. made every project I attempted a breeze! never jams (probably because I do follow directions haha) Owned it for almost a year now, and several projects later, this gun keeps on performing.",
      "rating": 5.0,
      "verified": true,
      "author": "Fernando Fonseca",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "Freeman offers great nailers at a great price!",
      "text": "This is my second Freeman product. Previously bough their roofing nailer and was impressed with the quality. As a home repair guy I bought this nailer as an inexpensive backup to my older framing nailer. So far this nailer far exceeded expectations (no miss-fires or jams)! Exceptional value!",
      "rating": 5.0,
      "verified": true,
      "author": "handymanmike",
      "helpful_votes": 0,
      "publication_date": 20131210
    },
    {
      "title": "Nailed it",
      "text": "I am framing my basement ceiling and am part way done. So far so good. No complaints with this nailer. The job would be a lot harder without this tool. Worth the money. Finished the job and the nailer functioned without any problems. Still recommend this nailer.",
      "rating": 4.0,
      "verified": true,
      "author": "Sicsempertyrranis",
      "helpful_votes": 2,
      "publication_date": 20120903
    },
    {
      "title": "Good Product",
      "text": "I've had another nailer an it wstarted jamming after about 20 nails shot. This one keeps on going even without oiling between use. It's not too heavy to use with one hand.",
      "rating": 5.0,
      "verified": true,
      "author": "GA_Shopper",
      "helpful_votes": 0,
      "publication_date": 20150730
    },
    {
      "title": "Good gun",
      "text": "Worked flawlessly. Only one misfire and it was easily cleared.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy L Blakeslee",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "This Nail gun has been more than well worth it ...",
      "text": "This Nail gun has been more than well worth it. It has lasted through many cases of nails and has never once given me any problems. I used it on the job for several years and now at home on the farm. I oil it every day i use it and the seals are still original in it.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Alamond",
      "helpful_votes": 0,
      "publication_date": 20170217
    },
    {
      "title": "Great nail gun.",
      "text": "This nail gun works great and the build quality seems very good, too. Has plenty of power for framing nails and the adjustment works well for smaller pieces.",
      "rating": 5.0,
      "verified": true,
      "author": "airtechmech6",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "Another fine product from a company known for quality products",
      "text": "One thing I have learned: If it's made by Freeman, it works. First time, every time. Simple construction, well balanced, easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "JessMoore",
      "helpful_votes": 0,
      "publication_date": 20161011
    },
    {
      "title": "Great tool!",
      "text": "My husband loves this nail gun. It is loud and scary, so I stay out of the way. But it works like a charm.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo-Ann",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Great gun for the money",
      "text": "I just replaced the siding on my house (Hardi lap siding using 2 inch galvanized ring shank nails)and the Freeman Nailer worked as advertised. The driving depth is easily adjustable and I did not have one jam. Great price and it shipped free from Amazon. Glad I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "W. D. Larson",
      "helpful_votes": 0,
      "publication_date": 20120726
    },
    {
      "title": "easy to use",
      "text": "had to change the connection to fit my air hose, but after that it worked flawlessly. very powerful for its size.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Miller",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Get it now",
      "text": "Everyone needs an air nail gun. The Freeman gun I have never misses a beat. Well almost never. I have run out of nails a couple of times and it want work well without nails in it. Now go figure... lol ... Get it guys",
      "rating": 5.0,
      "verified": true,
      "author": "Susan C",
      "helpful_votes": 0,
      "publication_date": 20140324
    },
    {
      "title": "Great product for the price",
      "text": "I bought this product to build a large deck. I'm very pleased with the performance. Weight/balance is good. Worked well with a variety of nail sizes (2 3/8, 3, 3 1/2, straight and ring shank). My only compliant is that the gun stops working when the gun gets low on nails (3-4 nails) due to the nails losing alignment. It's not a big deal since it works fine once you load more nail strips. However, it was frustrating diagnose the condition the first time. For the money, this is a strong product.",
      "rating": 5.0,
      "verified": true,
      "author": "Ncamish",
      "helpful_votes": 47,
      "publication_date": 20110321
    },
    {
      "title": "Five Stars",
      "text": "Worked excellent lite, smooth and fast!!!! Very Impressive gun for the price",
      "rating": 5.0,
      "verified": true,
      "author": "Becka",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "Love it!",
      "text": "Been shooting nails with this gun to build a 4'x4' \"outhouse\" garden shed out of saw mill lumber. Building is finished and haven't had a jam or missed nail yet. Starting on a real shed next. Love this gun, especially at 1/2 the price of the Big Box choices...",
      "rating": 5.0,
      "verified": true,
      "author": "Cornstalks",
      "helpful_votes": 0,
      "publication_date": 20130729
    },
    {
      "title": "Well built Nail Gun",
      "text": "The nail gun is well built and has worked pretty good. It could hammer the nails a little harder. I have to go back with a hand held hammer to finish some nails off. I am using the gun within the air pressure limits.",
      "rating": 4.0,
      "verified": true,
      "author": "Rider7767",
      "helpful_votes": 2,
      "publication_date": 20130404
    },
    {
      "title": "I love this nail gun",
      "text": "I love this nail gun. I'm not a professional so I just use it for projects. built some stuff out of 2x4s and palates for my backyard. I used their nails.",
      "rating": 5.0,
      "verified": true,
      "author": "Jdub",
      "helpful_votes": 0,
      "publication_date": 20150708
    },
    {
      "title": "Nice nailer",
      "text": "I found this to be a very nice nail gun. Great quality and worked very well. The only thing I can agree upon from other reviews is that this doens't toenail at all. Overall a great buy and I would recommend!",
      "rating": 4.0,
      "verified": true,
      "author": "J.Bourne",
      "helpful_votes": 2,
      "publication_date": 20130409
    },
    {
      "title": "Good deal for a nailer",
      "text": "works as expected when tested. I have not put it to normal use as of this writing. good deal for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "JoJo",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "awesome",
      "text": "Works great when you get it. Take off the black Trigger and use the orange one. Don't look back",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "Excellent air nailer for the price",
      "text": "I purchased this air nailer so that I could rebuild my fence. I used nearly 3000 nails on the project without a single jam. Toe nailing is a bit difficult with this, but since this is my first time using an air nailer, that may be the case with all brands. There were a few times when I pulled the trigger and no nail came out, but I think most of those were user error. I'm definitely glad I made this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "jrg635",
      "helpful_votes": 0,
      "publication_date": 20130729
    },
    {
      "title": "Good for homeowners",
      "text": "Ran about 4k nails through with no problem. One con you cant hold the trigger and bump.",
      "rating": 5.0,
      "verified": true,
      "author": "Valentin Draghici",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Perfect For A Homeowner ANd Quick Shipping from Amazon",
      "text": "I've had this nailer for about a month. I've been building a small (6x8 ft) garden shed. It's more than adequate for my needs and I've had no problems with it. Nails for it are a little difficult to find in local stores, but Lowes carries them. Also, the nailer is fairly heavy and not balanced well. It's very hard to use it over your head. But that may be true of all nailers. I also wish it could take 2\" nails. Overall, it's an extraordinary value -- probably $40 less expensive than equivalent products.",
      "rating": 4.0,
      "verified": true,
      "author": "gurumanjohn",
      "helpful_votes": 7,
      "publication_date": 20111117
    },
    {
      "title": "I don't know how any carpenter can do without a ...",
      "text": "I don't know how any carpenter can do without a nailer. It saves a lot of time compare to manual nailing. This is a definite must have.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160711
    },
    {
      "title": "Works like one costing twice as much",
      "text": "I use this frequently and it never has any issues. I use the Hitatchi brand nails in it and it has never had a jam yet. If I ever need different nailers or staplers I will probably stick with this Freeman Brand.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Konarski",
      "helpful_votes": 0,
      "publication_date": 20130622
    },
    {
      "title": "Five Stars",
      "text": "Best nailgun I own ! I have a couple of $400 models , and they can't compare !",
      "rating": 5.0,
      "verified": true,
      "author": "DVMIKE",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "Great Framing Gun.",
      "text": "Don't waste your time on expense nail gun's. This is a great gun for all of your home remodeling projects. I have shot three boxes of nails through mine and it hasn't acted up once.",
      "rating": 5.0,
      "verified": true,
      "author": "Mikenedge",
      "helpful_votes": 0,
      "publication_date": 20131117
    },
    {
      "title": "Awesome gun for the price.",
      "text": "I was surprise at how well it worked for the price. We framed an entire 2nd level at our gymnastics studio, roughly 1,000 sq ft. It performed flawlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "Gavilan Crawford Jr",
      "helpful_votes": 0,
      "publication_date": 20150818
    },
    {
      "title": "Works great! I have had no problems with this nail",
      "text": "Works great ! I have had no problems with this nail gun",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20150911
    },
    {
      "title": "Great nailer!",
      "text": "Bought this to replace a HB piece of crap. This was reasonably priced and had good reviews, so that's all I needed to know. Haven't used it a lot, but have tried it out and I like it a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Techie",
      "helpful_votes": 0,
      "publication_date": 20130106
    },
    {
      "title": "Not bad for the money...",
      "text": "Nice gun, works as it should except the anti-dry fire mechanism won t let the last couple nails be used. You have to open the slide and remove the nails then put in a new strip. Minor but annoying...",
      "rating": 4.0,
      "verified": true,
      "author": "Dean L",
      "helpful_votes": 0,
      "publication_date": 20151023
    },
    {
      "title": "Works awesome..",
      "text": "Works awesome...what more can i say. Drives nails effeortlessy through 3/12in of wood, adjusts easy, and ive ran over 500nails through w/o a jam yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150316
    },
    {
      "title": "Great gun for the price",
      "text": "Great gun for the price. The only down side so far is it stops shooting when there's still about 5 nails in strip. Drives everything I put through it.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "This is the real deal!",
      "text": "This is a wonderful framing nailer. We bought it and used it when we replaced all of our cedar siding on the house. I wouldn't hesitate to buy another one if this one ever has problems. It worked perfectly and made the job 100xs easier",
      "rating": 5.0,
      "verified": true,
      "author": "JAM",
      "helpful_votes": 0,
      "publication_date": 20140722
    },
    {
      "title": "works flawlessly",
      "text": "works well. built a pole barn without any jams. flawless.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Z",
      "helpful_votes": 0,
      "publication_date": 20151119
    },
    {
      "title": "Really happy with it....",
      "text": "I'm by no means a contractor or pro builder... but for the money this thing works great for my needs. Never double fired, jammed, nothing....",
      "rating": 5.0,
      "verified": true,
      "author": "Robert M.",
      "helpful_votes": 0,
      "publication_date": 20131209
    },
    {
      "title": "so far it worked great but only tested with a few nail to make ...",
      "text": "so far it worked great but only tested with a few nail to make sure its working. bought it was a job next month.",
      "rating": 5.0,
      "verified": true,
      "author": "leon sikes",
      "helpful_votes": 0,
      "publication_date": 20150404
    },
    {
      "title": "Would recommend to any handy man",
      "text": "Had the opportunity to use this product this past weekend and it performed flawlessly. Would recommend to any handy man.",
      "rating": 5.0,
      "verified": true,
      "author": "Don J.",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "Great nailer. Only thing I have noticed is that ...",
      "text": "Great nailer. Only thing I have noticed is that it won't fire last three nails in magazine, you have to add another sleeve of nails. Spring must not be strong enough. But for the price great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Fentron",
      "helpful_votes": 0,
      "publication_date": 20151029
    },
    {
      "title": "Five Stars",
      "text": "Powerful 3 1/2\" nails not a problem. rock solid construction quality.",
      "rating": 5.0,
      "verified": true,
      "author": "John Ross",
      "helpful_votes": 0,
      "publication_date": 20171115
    }
  ],
  "product_meta": {
    "title": "Freeman PFR2190 Pneumatic 21 Degree 3-1/2\" Full Round Head Framing Nailer with Case Ergonomic and Lightweight Nail Gun with Interchangeable Trigger, Tool-Free Depth Adjust, and No Mar Tip, Black",
    "description": "Style:21º Plastic Collated Full-HeadThe Freeman PFR2190 pneumatic 21 degree 3-1/2\" Full Round Head framing Nailer with case is ideal for projects such as framing, subfloors, roof decking, pallet and shipping crate assembly, and fencing. This versatile air powered tool is compatible with 10-12 gauge plastic collated 21 degree full Round Head framing nails from 2\" To 3-1/2\", and a dual mode trigger allows the option of either bump or sequential firing. This nail gun features a 360 degree adjustable exhaust to keep air out of your face, an anti-dry-fire design to extend the life of the tool, an anodized aluminum magazine and cylinder for increased durability, and a tool-free depth adjust for various applications. The body of this framing Nailer is constructed of magnesium to reduce weight, making it easier to use for long stretches of time. The removable no mar tip prevents damage to your working surface. A blow molded carrying case is included, along with safety Goggles, air tool oil, and adjustment tools. The pneumatic 21 degree 3-1/2\" Full Round Head framing Nailer with case will increase productivity For Dyers at home as well as professional contractors at the job site.",
    "rating": 4.6,
    "feature_bullets": [
      "Nailed it: This 21 degree Pneumatic framing nailer features a lightweight and durable magnesium body, ergonomic secure handle, and interchangeable trigger for quick fire or single shot function. It's ideal for professional contractors and home DIY projects.",
      "Versatile and powerful: the framing nailer features tool-free finger depth adjustment and a no mar tip, making it adaptable for different working surfaces. It's perfect for framing, wall sheathing, siding installation, subfloors, pallet building, wood box assembly, and fencing.",
      "The right tool for the job: We're committed to providing outstanding value, top tier customer service and long-lasting, high-quality products. We make nailers and staplers for every purpose, from roofing to siding to flooring and everything in between.",
      "Quality and durability: We manufacture tools with the most durable materials under strict quality control guidelines, suitable for professional contractors and do-it-yourselfers alike. Our tools are sold, distributed, serviced, and warrantied in the USA.Operating Pressure: 70 – 115 PSI",
      "Tough and dependable: we make an array of durable construction Tools and Accessories, including staplers and nailers For siding, flooring, framing, finish, and roofing. Compare our products to similar items by Makita, Hitachi, BOSTITCH, Senco, Paslode, and DEWALT."
    ],
    "specifications": {
      "Manufacturer": "Freeman Pneumatics",
      "Part Number": "PFR2190",
      "Item Weight": "8.5 pounds",
      "Product Dimensions": "18 x 2 x 12 inches",
      "Item model number": "PFR2190",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Black",
      "Style": "21º Plastic Collated Full-Head",
      "Material": "Magnesium, anodized aluminum, and heat treated steel parts",
      "Power Source": "Air-powered",
      "Item Package Quantity": "1",
      "Measurement System": "Imperial",
      "Included Components": "Pneumatic 21 Degree 3-1/2\" Full Round Head Framing Nailer; Blow Molded Case; Safety Goggles; Air Tool Oil; Adjustment Tools",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "7 Year Limited Warranty and 90 Day Wearable Parts Warranty",
      "ASIN": "B002EVPO5E",
      "Customer Reviews": "4.6 out of 5 stars369 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#36,847 in Tools & Home Improvement",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "July 8, 2009"
    },
    "categories": [
      "Framing Nailers",
      "Power Tools",
      "Tools & Home Improvement",
      "Nailers & Staplers",
      "Power & Hand Tools",
      "Nailers"
    ],
    "price": 109.99
  }
}