{
  "website_summaries": [
    {
      "verdict": "A good bet if keeping leaves out so that your filter won't clog or to keep debris off your main winter cover.",
      "pros": [
        "Can be placed on top of a winter cover for extra protection from debris and to help keep the main cover clean",
        "Durable mesh holds up for several years of use"
      ],
      "cons": [
        "Basically just a net, so if you need more protection this should be used as the top layer to a solid cover"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "EVER POOL OWNER NEEDS ONE!",
      "text": "Best purchase I have ever made! We keep our pool open year round and needed something to keep those pesky leaves out so i wasn't having to vacuum during the winter months. Let me just say this thing is AMAZING! It is a little tough to put on, but as long as you have some help you'll be fine! A+ purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa G",
      "helpful_votes": 22,
      "publication_date": 20181113
    },
    {
      "title": "Keeps leaves out",
      "text": "We use this during the summer in Georgia. We have a lot of big trees and if we aren't going to be in the pool for a bit or we know that a big storm is coming we can put this on and save ourselves from digging out a bunch of leaves. We plan to also put it over the winter cover. It's not that difficult with 2 people. We have a 24' pool and the 24' cover fits over the ladder. Update: with the winter cover on I was able to put the net on by myself. Wasn’t super easy but not too hard, I managed.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Krivensky",
      "helpful_votes": 15,
      "publication_date": 20170830
    },
    {
      "title": "Love this item.",
      "text": "this is great if you only use your pool on the weekends you can cover your pool during the week and it keeps all the leaves and debris out so it's easier to clean. This item really helps with my weekly pool cleaning I think I could even skip a week we have a lot of trees and this keeps them out of the swimming pool.",
      "rating": 5.0,
      "verified": true,
      "author": "Traves68",
      "helpful_votes": 9,
      "publication_date": 20190707
    },
    {
      "title": "Only one issue",
      "text": "So the net is great. I ordered a size bigger than my pool so I'd have enough room and that was a wise decision. I was able to use stakes in the holes to hold it down and that made it super easy to put up. My issue is it comes with a wire and a wench thing and no instructions on how to use it. I tried contacting the seller twice and they couldn't help. If they're selling it they should tell me how to use it. So that part was useless to me - though in the end I was still able to use the product, just by a different method.",
      "rating": 3.0,
      "verified": true,
      "author": "MistyHfromTx",
      "helpful_votes": 4,
      "publication_date": 20191122
    },
    {
      "title": "Great!  Work as advertised.....",
      "text": "I ordered this leaf net for my 24 foot round above ground pool. Worked as advertised. Easy to install and remove and blocked all leaves and debris from the cover of our pool during the fall season. Look forward to using it again this spring to block all the seed helicopters that fall from the oak trees. Net is high quality and the price is very reasonable, especially since we won't be cleaning sopping wet leaves out of our pool cover before we open it for the season.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Leo",
      "helpful_votes": 17,
      "publication_date": 20160315
    },
    {
      "title": "Excellent Cover!!",
      "text": "This is the best pool cover we have ever purchased! Was impressed with how heavy duty it was. Love the reinforced edges and grommets. The overlap made it easy to get the vinyl cable through the grommets and ratcheted down tight. No fading of the cover after the first year. Our other covers we have purchased in the past only last a couple of years. Expect to get at least 10 years use out of this one. Highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Johnboy",
      "helpful_votes": 2,
      "publication_date": 20200620
    },
    {
      "title": "Ease of Opening Your Pool",
      "text": "The leaf cover was easy to place over the pool cover. You can see as leaves fall they land on the leaf cover which is above the actual pool cover. It appears at this time that this additional cover will make it easier to open the pool because leaves will be removed by simply taking off the leaf removal cover. Will clearly see when I open up my pool next year.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Rubino",
      "helpful_votes": 3,
      "publication_date": 20181006
    },
    {
      "title": "Worth the money",
      "text": "The only problem with this is undoing the cable.... it turns into a mess. However just shake it and it starts to unwind. No directions on the winch.... but not that hard to find a way to use it either. Comes with plenty of cable and plenty of over hang. This is on our 24’",
      "rating": 5.0,
      "verified": true,
      "author": "Katelyn Mckerchie",
      "helpful_votes": 3,
      "publication_date": 20200830
    },
    {
      "title": "Cable is like untangling Xmas lights, UGH!!!",
      "text": "The cable needs to already be looped through the fasteners, or on some sort of spool. It comes a tangled up mess. Doesn't look that way, but it is very tangled. It took us about 45 minutes to just get it untangled. If it were not so tangled, you could easily put this on in about 10 minutes. Once you get the cord untangled, everything else is fine. These usually only last us one-two seasons at most before they will start getting large holes in them.",
      "rating": 4.0,
      "verified": true,
      "author": "Nellysierra",
      "helpful_votes": 2,
      "publication_date": 20191004
    },
    {
      "title": "Quality is great an easy to install.",
      "text": "We just installed a new pool and this leaf pool net was recommended by our installation team. We have alot of trees that boarder our property. It has already caught some leaves and was very easy to install. I would recommend it. Our pool is 24' round.",
      "rating": 5.0,
      "verified": true,
      "author": "jean lynner",
      "helpful_votes": 2,
      "publication_date": 20200818
    },
    {
      "title": "NOT disappointed.",
      "text": "I like it. If you don't use your pool every day or two it is easier to put a net on and off as needed than fishing leaves out of the pool routinely. I hold mine on with some plastic cover clips, available here from Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Often Disappointed!",
      "helpful_votes": 2,
      "publication_date": 20200722
    },
    {
      "title": "Works but leaves get stuck in it",
      "text": "I stretched it over my above ground pool, which I also put an air pillow in the center. I installed it so the net was completely out of the water. I had hoped I could simply blow off the leaves with leave blower. But Oak leave get caught in it. I removed net to remove leaves, bu had to hand pick a lot of them off; will not shake off. Other than that, it does keep them out, but smaller debris gets through the roughly 1/4\" size holes/mesh.",
      "rating": 4.0,
      "verified": true,
      "author": "Michelle B.",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Good",
      "text": "So far so good, just get home clamps to gold ot",
      "rating": 5.0,
      "verified": true,
      "author": "nester",
      "helpful_votes": 6,
      "publication_date": 20180701
    },
    {
      "title": "Great Service",
      "text": "We received our net and went to install and found an approximately 6 in area where it had not been stitched to the vinyl trim. I sent pictures to the seller/Amazon and they immediately sent out a replacement. While trying to install the first one it was easy to stretch and place over the winter cover. We haven't received the replacement yet but do not anticipate any issues. Looking forward to next May when we can (hopefully) get the leaves off the cover with no issue.",
      "rating": 5.0,
      "verified": true,
      "author": "SRK",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Don’t buy it.",
      "text": "This net was a nightmare to install. Should have taken -0 minutes but ended up over an hour. The holes are small and don’t fit bungee cord ends through them so I ended up breaking the netting to try to secure it with the solid cover. The holes also don’t line up with the holes o. The regular cover which is stupid. This will be a one year net because I’m not struggling with this piece of garbage again. I’ll be surprised if it stays on all winter. Not happy at all.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Just in time!",
      "text": "Received about 1 hour before tropical storm Isiasias hit and it saved me probably 6 hrs of pool cleaning. Easy to put on even in 40 mph winds. Fits my 24’ round pool with no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Long Island IcedT",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Works well.",
      "text": "It really helps keeping the leaves off. Near the end of summer and through the fall we get a lot of leaves. It is a lot easier to get them off the cover than having to clean them out of the pool. We use it on top of our solar cover when the leaves start falling. In the fall we put it over the winter cover and the pump. The only problem we have is that some, but thankfully not all, the pine needles get through it.",
      "rating": 4.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 2,
      "publication_date": 20161101
    },
    {
      "title": "Love the netting",
      "text": "Better than the full vinyl version. We get a lot of leaves and they are too hard to clean off the solid one. I got heavy and got holes. Switched to this kind and it's not damaged after 6 months. Takes minutes to take it off and get rid of the leaves. Very happy now.",
      "rating": 5.0,
      "verified": true,
      "author": "Janie Pennington",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "A must have",
      "text": "If you get leaves in your pool, get this! We've already gotten a ton of leaves off the cover of the pool. It will save us so much time in the spring. No stinky rotting leaves to clog up the hose when we're trying to get the water off the cover. We waited until all the leaves were off the trees and then we took it off for the winter. Didn't want the snow/ice to pull on it and possibly rip it.",
      "rating": 5.0,
      "verified": true,
      "author": "Zolu",
      "helpful_votes": 11,
      "publication_date": 20121207
    },
    {
      "title": "Keeps leaves out of Pool",
      "text": "I bought this to keep over the pool when not in use. This is easy to put on and keep leaves, bugs, and whatever else that tends to collect in the pool out. In the winter i put it on tight over the winter cover to keep fall leaves out of the water.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyrome Cole",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Love it.",
      "text": "So far so good. I haven’t used it through winner yet. It’s doing pretty good through the fall. Like the fact that it’s keeping all the leaves out of the pool when I have the tarp under it. Wish I would’ve bought this sooner. If I have any downfalls I will update my review after winner. Happy with my results so far. No leaves in my pool.",
      "rating": 5.0,
      "verified": true,
      "author": "sarah ",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "The rope that tightens it is not durable",
      "text": "This product does the function of retaining the large leafs from the trees but not the smalls , the rope that goes around as soon as you squeeze it a little out of the environment",
      "rating": 3.0,
      "verified": true,
      "author": "Ariel",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Awesome, must have pool net cover!",
      "text": "Love, love, love this net!! It has saved me soooo much time!! I put it on the pool as soon as the kids quit swimming and the pull it off when we swim again and there is no leaves in the pool!! Absolutely AWESOME!!",
      "rating": 5.0,
      "verified": true,
      "author": "Annette",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "So far, so good!",
      "text": "Very happy with this cover! Is already doing its job beautifully and I like how secure the cable system keeps the cover on. There is no way the wind would be able to pull the cover off.",
      "rating": 5.0,
      "verified": true,
      "author": "Boze Family",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Works great. No tears. Sturdy and easy",
      "text": "Works for 24' above ground coleman \"bestways\" pool. With a lot of net left over. Get some bungie cords for easy on and off",
      "rating": 5.0,
      "verified": true,
      "author": "Adrian Jeter",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Still holding up.",
      "text": "We put this on in place of a winter cover as ours catches the wind and rips within a month. So far this has held up and is still on. We have not taken it off yet. But it has outlasted our covers by months so far!",
      "rating": 4.0,
      "verified": true,
      "author": "CL Prine",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Just what I wanted it to do.",
      "text": "Arrived quickly. Exactly what I needed. Kept leaves out of pool and what landed on the net I could remove with the skimmer net.",
      "rating": 5.0,
      "verified": true,
      "author": "vinny thomas",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "No More Leaves!!!!",
      "text": "We haven't taken the cover off of our pool yet- but I can tell you right now I LOVE this!!! No more leaves in the pool after taking the cover off!! Right now all the leaves are pooled on the net. What a great invention. I wish I had thought of it!",
      "rating": 5.0,
      "verified": true,
      "author": "C. J. Hobes",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Was too small for our 24’ pool",
      "text": "It barely fits around my pool...had to stretch it quite a bit, which I’m sure isn’t good for its longevity. Perhaps it’s because we use an inflatable pillow under our winter cover, but I assumed it would be a bit oversized like the cover (which usually has at least 18” of play on either side, even when using a pillow). Construction seems “ok”, but I won’t know until this spring how it holds up.",
      "rating": 3.0,
      "verified": true,
      "author": "Stacie W.",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Works!",
      "text": "The net does what it's suppose to... stops leaves and other stuff from falling into pool so makes cleaning easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Larose",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "I love it",
      "text": "I use this everyday to avoid big leaves to fall in my pool. Sometimes they go through as well but overall it works great. Easy to pull and take of even only one person",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Needs better grommets",
      "text": "Said it was premium but 2 PLASTIC grommets snapped right off when putting it over pool. But it does keep the leafs out of pool.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael Levandoski",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "I would have given this 5 stars except that the ...",
      "text": "I would have given this 5 stars except that the wrong parts and instructions were included in it. Other than that, the leaf let seems to be working but I will update review after all the leaves have fallen...still waiting.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Javoroski",
      "helpful_votes": 3,
      "publication_date": 20161101
    },
    {
      "title": "Fast shipping",
      "text": "The leaf net cover arrived quickly after ordering. Fits our pool well. Easy to put on.",
      "rating": 5.0,
      "verified": true,
      "author": "Booniegirl",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Good so far.",
      "text": "Working well so far. Haven’t tried to take it off yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Will probably do the job but....",
      "text": "I can’t give this product any more than 1 star because during the installation of it, the winch broke which for $82 I would expect better quality.",
      "rating": 1.0,
      "verified": true,
      "author": "StacieK",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Bought this as we closed our pool last year,",
      "text": "Bought this as we closed our pool last year, just opened up our pool and this was a life saver",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Rice",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Leaf cover",
      "text": "This is the first year I am using a leaf cover. I bought it to make removal of the leaves easier. I was amazed that the leaf cover was more expensive than the winter cover. I will amend my review after I open my pool in spring.",
      "rating": 4.0,
      "verified": true,
      "author": "Bubba Denman",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "No more leaves on the bottom!",
      "text": "It works great! We bought it a little larger for our 22ft pool so it would go over the steps too. Well, it's on my deck and covers it all. No leaves on the pool bottom and no frogs in the pool. Works as I'd hoped",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia A Cothron",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "AWESOME",
      "text": "Loved that it fit perfect and kept leaves out of pool all winter",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Phillips",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "It works as advertised",
      "text": "This is the second one I bought, this one being for my daughter. She loves it. I removes large debris from the surface or bottom of pool. You just need a pole of the appropriate length.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph G. Clark",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Great Leaf Net!",
      "text": "Application was easy over the winter cover - nice to see the leaves collecting on the leaf net rather than rotting and making a mess on my winter cover. Don't know why I waited so many years to buy this!",
      "rating": 5.0,
      "verified": true,
      "author": "Mighty Morader",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "We got this cover 3 weeks ago and LOVE IT I wish we would have had this 3 ...",
      "text": "We got this cover 3 weeks ago and LOVE IT I wish we would have had this 3 years ago. Every time we would take the solar cover off we would still have to vacuum out the pool daily now with this we can go two weeks and take the cover off and we have a clean pool. Thank You for the great product I wish they would include something like this in your original pool package it would save you a lot of time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160620
    },
    {
      "title": "I'm happy with it so far.",
      "text": "I was pleased with the quality and the price of the cover. Due to nice stretch of it, it was easy to install. I have not yet removed it and don't know how that's going to work out, but from the looks of it, I think it will be just fine. Probably there will be leaves stuck in it, (how could there not be), but I think it's a workable solution considering our pool is surrounded now by trees. I'd buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161012
    },
    {
      "title": "Very good pool cover",
      "text": "Lasted the first year with no damage! Dont buy a cheap one it wont last.",
      "rating": 5.0,
      "verified": true,
      "author": "Warcon",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Good but",
      "text": "Like the way it covers. The tightening ratchet is complete junk though. Needs a better design for that but the cover itself is great",
      "rating": 4.0,
      "verified": true,
      "author": "Tim Sullivan",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Easy to use",
      "text": "The leaf net cover for the pool went on easily. Do not know how it will perform as it is too early for falling leaves.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Good but hard to clean",
      "text": "Exactly as described, using it for our 20 ft pool",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "I leave it on through the winter and my pool cleans up nice and easy",
      "text": "This net cover was the answer for my pool it solved my leaf problem. I leave it on through the winter and my pool cleans up nice and easy. it was worth the investment. I put the regular cover on first then the net over top . Works great !",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Arrived promptly.",
      "text": "Was easy to install and keeps those pesky leaves out of my pool.",
      "rating": 5.0,
      "verified": true,
      "author": "Kellie Devers",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Five Stars",
      "text": "Very pleased with this product and it was delivered quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenda G.",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Easy to install... durable.",
      "text": "We had a small hiccup with the delivery. It said it was delivered and wasn’t, however, it was found and delivered a week later and we had it installed within 30min.",
      "rating": 4.0,
      "verified": true,
      "author": "Frannie Cox Ferguson",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "GREAT...",
      "text": "SO FAR IT LOOKS LIKE IT'S WORKING FINE...DEFINITELY CATCHING THE LEAVES WITHOUT GOING ONTO ACTUAL POOL COVER.....",
      "rating": 5.0,
      "verified": true,
      "author": "HAL",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "A must buy!",
      "text": "I use to have a solid covering that said it would let water go through, but it didn't and it was such a pain to take off and all the leaves and dirty water would end up falling in the pool in the end. This is the 1st summer for me to uncover the pool using this leaf cover and I love it! It was so much easier and it caught all the leaves which were super easy to scrape off the netting and it was so easy to take off. I finally have a cover that I can easily take off and the leaves don't fall in so my pool is ready to go! I luv this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie S.",
      "helpful_votes": 15,
      "publication_date": 20150719
    },
    {
      "title": "Good Net",
      "text": "Just what I was needing for this fall and winter",
      "rating": 5.0,
      "verified": true,
      "author": "ArDeerHunter61",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Leaf cover",
      "text": "First year using this leaf cover. went on well and was easy to remove once the tree leaves dropped.",
      "rating": 4.0,
      "verified": true,
      "author": "Shirley Renna",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Keeps leaves out of pool.",
      "text": "Used it for catching fall leaves. As soon as trees were bare we dumped them off net. Should have a much easier time opening pool next summer!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Light weight netting. Hope it holds up.",
      "text": "This cover was a lot thinner than I expected. It was easy to put on. I will not know how it holds up until next summer when I take it off.",
      "rating": 4.0,
      "verified": true,
      "author": "minipiddler",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Great product",
      "text": "Product came fast and fit pool perfect. It keeps the leaves out of the pool. So glad I got this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Works great",
      "text": "Easy to install. It’s already collecting leaves after only been on the pool for 4 days. Very happy with my purchase",
      "rating": 5.0,
      "verified": true,
      "author": "regina middleton",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Wonderful",
      "text": "The leaf cover is very well made. The outer edge is really well enforced. Would definitely recommend it to everyone. Going to look and see if they sell pool covers next.",
      "rating": 5.0,
      "verified": true,
      "author": "robert hasselbach",
      "helpful_votes": 3,
      "publication_date": 20130918
    },
    {
      "title": "very happy",
      "text": "I have a lot of trees in my yard and this cover helps a ton. the most important thing is to get it off as soon as the leaves are all down.",
      "rating": 5.0,
      "verified": true,
      "author": "nick o",
      "helpful_votes": 4,
      "publication_date": 20131209
    },
    {
      "title": "install and removal",
      "text": "It was easy to install. I used pool cover clips instead of the cable for ease of removing it to clean off leaves.",
      "rating": 5.0,
      "verified": true,
      "author": "rick bethea",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "Easy install wire with tightner works as it should",
      "text": "Does what it is supposed to do. Easy install wire with tightner works as it should.",
      "rating": 5.0,
      "verified": true,
      "author": "Columbus",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "It was a good buy especially for price",
      "text": "It was a good buy especially for price. We have had no problems with it. FYI if your above ground pool has a deck around it, it's a little tricky but still works well.",
      "rating": 4.0,
      "verified": true,
      "author": "Johnnie Frith",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "First leaf cover we ever used",
      "text": "This leaf cover concept was new to us as first time pool owners. We were highly impressed by the quality of this cover and recommend for all South Texas above ground pool owners!",
      "rating": 5.0,
      "verified": true,
      "author": "JeepsySoul",
      "helpful_votes": 0,
      "publication_date": 20131217
    },
    {
      "title": "24' Leaf Net",
      "text": "It did just what i wanted it to do, keep the leaves out of my pool",
      "rating": 5.0,
      "verified": true,
      "author": "RLB T.",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Net",
      "text": "I have lots of acorns falling and leave. So far so good!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Seems strong, Working well",
      "text": "1st year but seems very strong, working well so far!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey Dodge",
      "helpful_votes": 0,
      "publication_date": 20161031
    },
    {
      "title": "Works great",
      "text": "Having a hard time getting a cover to stay on the pool for 5 years.This one traps leaves and small debris and no problems with the 40 mph gusts we had last week. By far the best cover we have used.",
      "rating": 5.0,
      "verified": true,
      "author": "audrey",
      "helpful_votes": 8,
      "publication_date": 20130106
    },
    {
      "title": "A must have for above ground pools!",
      "text": "Perfect addition to winter pool cover to catch the leaves!",
      "rating": 5.0,
      "verified": true,
      "author": "Toni Griffin",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "easy to install and appears good quality",
      "text": "easy to install and appears good quality so far this winter",
      "rating": 5.0,
      "verified": true,
      "author": "J.Anderson",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Perfect for the South...",
      "text": "i bought this as an only cover for our pool. We live in South Louisiana and don't need an \"winter cover\" but have a problem with the leaves falling. It has helped wonderfully and springtime will be great when we open the pool back up! The rain goes through so no worrying about it collecting in the middle but the leaves float on top instead of gathering at the bottom.",
      "rating": 5.0,
      "verified": true,
      "author": "Mindi Harris",
      "helpful_votes": 3,
      "publication_date": 20130102
    },
    {
      "title": "So Far So Good",
      "text": "I have had it on my pool for about a month now. It seems to be working just fine keeping out the leaves. I have no complaints. I have a 24' round intex pool.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Castaldo",
      "helpful_votes": 0,
      "publication_date": 20130930
    },
    {
      "title": "Perfect for leaf removal",
      "text": "Next spring this will make it simple to remove leaves.",
      "rating": 5.0,
      "verified": true,
      "author": "Tammie F.",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "One Star",
      "text": "It had a hole in it. Will see if it holds up to an Iowa winter",
      "rating": 1.0,
      "verified": true,
      "author": "teresa gonzalez",
      "helpful_votes": 0,
      "publication_date": 20161025
    },
    {
      "title": "if you don't remove the cover every so often the ...",
      "text": "if you don't remove the cover every so often the leaves work themselves through the net... too much trouble to take on and off so often..",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "Great product",
      "text": "Wish I had bought this 15 years ago. Really helps solve the leaf problem and the pool. Great Great Great",
      "rating": 5.0,
      "verified": true,
      "author": "countysheriff",
      "helpful_votes": 0,
      "publication_date": 20140118
    },
    {
      "title": "nothing",
      "text": "Would have liked to have a 20 foot cover not 24'",
      "rating": 4.0,
      "verified": true,
      "author": "Stephen Sass",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Netting is too big.",
      "text": "The netting was not as small as I was expecting.",
      "rating": 1.0,
      "verified": true,
      "author": "nita rolen",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Pool cover",
      "text": "So far it's working good. First year using this cover.",
      "rating": 5.0,
      "verified": true,
      "author": "Terri Butler",
      "helpful_votes": 0,
      "publication_date": 20151011
    },
    {
      "title": "Works to expectations",
      "text": "So far it has performed to expectations. The leaves are beginning to multiply on the cover. The installation was easy and works with the winter cover very well. The next step is to remove it just before the first freeze.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151019
    },
    {
      "title": "Great value",
      "text": "Once it's on it works very well. Getting it on, single handed as I did, is a bit of a chore but well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nidoba",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "Three Stars",
      "text": "so much easier to use!! can't wait to open the pool",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170504
    },
    {
      "title": "Great Service!",
      "text": "Great quality and came the very next day. Awesome service!",
      "rating": 5.0,
      "verified": true,
      "author": "geolin6",
      "helpful_votes": 0,
      "publication_date": 20141116
    },
    {
      "title": "rubberized cable is cheap. After three uses rubber began ...",
      "text": "rubberized cable is cheap. After three uses rubber began coming of cable. Net holes do not prevent small tree needles from passing thru.",
      "rating": 2.0,
      "verified": true,
      "author": "eva",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Four Stars",
      "text": "Found patched holes in netting...still works find for purpose intended.",
      "rating": 4.0,
      "verified": true,
      "author": "Lenore Wilke",
      "helpful_votes": 0,
      "publication_date": 20161013
    },
    {
      "title": "better than I expected got it on the pool now ...",
      "text": "better than I expected got it on the pool now to keep all the debrie from trees out of the pool and it works great best buy ever",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160520
    },
    {
      "title": "good product",
      "text": "Good product, seems sturdy, durable. Well worth the money that was spent. Will really be handy come time to open pool again.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Martin",
      "helpful_votes": 4,
      "publication_date": 20131030
    },
    {
      "title": "A snap to put on, Breezes won't knock it off",
      "text": "Apply to the top of your normal solid pool cover at the start of Fall and all the leaves sure enough don't make it to the bottom of the pool. The mesh net comes with the same tensioner and wire you use to clamp on your regular solid cover so you'll have 2x the protection. A word of advice, don't tie down your cover to milk jugs, instead just go with the tensioner and make sure its tucked snug under the pool pillars to avoid being blown off.",
      "rating": 5.0,
      "verified": true,
      "author": "samyouwell",
      "helpful_votes": 2,
      "publication_date": 20131027
    },
    {
      "title": "Five Stars",
      "text": "So far so good! It should be simple to shake the leaves off.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane R.",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "Five Stars",
      "text": "It is a bit thin, hope it can stay till next summer.",
      "rating": 5.0,
      "verified": true,
      "author": "Suki Adams",
      "helpful_votes": 0,
      "publication_date": 20161020
    },
    {
      "title": "Two Stars",
      "text": "It is cheaply made and doesn't hold very well... I would not order it again",
      "rating": 2.0,
      "verified": true,
      "author": "Priscilla Cabansag",
      "helpful_votes": 0,
      "publication_date": 20150901
    },
    {
      "title": "Four Stars",
      "text": "Very easily put on and the spring time and labor savings are priceless. Definitely recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "mspit69",
      "helpful_votes": 0,
      "publication_date": 20151024
    },
    {
      "title": "Saved my pool!",
      "text": "I purchased this because our pool is surrounded by pecan trees. Between the leaves and the pecans....it can be a nightmare come spring time to clean my pool out. I put this cover on in very early fall and just not removed it at the end of March. The cover held up perfectly and kept the gazillion pounds of debris from entering my pool. It is still in excellent shape and will work for the next fall as well. Very glad I purchased this!",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth A.",
      "helpful_votes": 0,
      "publication_date": 20160408
    },
    {
      "title": "Two Stars",
      "text": "It already came unsewed alittle,still got leaves in the pool.",
      "rating": 2.0,
      "verified": true,
      "author": "Jim Walker",
      "helpful_votes": 0,
      "publication_date": 20151029
    },
    {
      "title": "great product",
      "text": "This product preformed exactly as expected. We were able to get the leaves off our pool perfectly! I highly recommend this product.",
      "rating": 4.0,
      "verified": true,
      "author": "srock822",
      "helpful_votes": 6,
      "publication_date": 20111113
    },
    {
      "title": "What a great peoduct easy to put on.",
      "text": "This is a great idea it is going to save so much time after all the leaves fall. It was always a problem when the leaves were on the main cove they always fell in the pool when we tried to take it off.",
      "rating": 5.0,
      "verified": true,
      "author": "James H. Moore",
      "helpful_votes": 0,
      "publication_date": 20131025
    },
    {
      "title": "24' no overlap!",
      "text": "I have a 24' pool; cover was 24' no overlapping as shown in picture",
      "rating": 1.0,
      "verified": true,
      "author": "Lester Johnston",
      "helpful_votes": 0,
      "publication_date": 20161105
    },
    {
      "title": "Five Stars",
      "text": "Great product and works perfect for keeping things out of the pool!",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn B.",
      "helpful_votes": 0,
      "publication_date": 20150710
    }
  ],
  "product_meta": {
    "title": "In The Swim 24 Foot Round Leaf Net Cover for Above Ground Pools",
    "description": "The easy solution for winter cover clean-ups! If your pool is surrounded by heavy tree cover or collects a mass of rotting leaves and debris, our leaf catcher is the solution! Simply lay the Leaf Catcher on top of your winter cover before leaves begin to drop and lift off when the trees are bare, and your winter cover will be virtually free of leaves next spring! No more messy, decaying leaves submerged on your cover! Made from durable knitted polyethylene. Comes complete with fastening loops, wire cable and metal winch for securing leaf catcher to pool. Cover color is black. Order based on pool size.",
    "rating": 4.6,
    "feature_bullets": [
      "Prevents decaying leaves from collecting on your pool cover or in pool water",
      "Lay Leaf Catcher on top of winter cover before leaves begin to fall and lift off when trees are bare",
      "Made from durable knitted polyethylene",
      "Cover color is black"
    ],
    "specifications": {
      "Item Weight": "7.39 pounds",
      "Manufacturer": "In The Swim",
      "ASIN": "B002WKK70E",
      "Customer Reviews": "4.6 out of 5 stars305 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#2,171 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Pools, Hot Tubs & Supplies",
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Safety Products",
      "Parts & Accessories"
    ],
    "price": 64.89
  }
}