{
  "website_summaries": [
    {
      "verdict": "While the Sony Alpha DSLR-A380 is a solid inexpensive dSLR with a few nice features that will probably satisfy many shooters, it doesn't deliver quite enough on any front to outshine competitors.",
      "pros": [
        "Capable of shooting some very nice photos",
        "fast Live View AF and single-shot performance",
        "tiltable LCD",
        "dual card slots",
        "relatively simple, straightforward operation",
        "built-in wireless flash and image stabilization"
      ],
      "cons": [
        "Smallish grip",
        "middling viewfinder",
        "color shifts with default settings"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 7.0,
        "Performance": 7.0,
        "Image quality": 7.0
      },
      "publication_date": 20090812,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "WOW - This DSLR is amazing!!",
      "text": "With this DSLR camera I was able to over come some of the issues I was having with my point and shoot digital. I like Sony products, and this didn't dissapoint. This camera is truely easy to use and takes great pictures with minimal effort. I liked the price of this camera for what I got. I thought it was a good deal. The camera also arrived on the date as promised. I would highly recommend this camera and the seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike J",
      "helpful_votes": 0,
      "publication_date": 20101109
    },
    {
      "title": "Beginner DSLR user",
      "text": "I am very pleased so far with my Sony A330. It met one of my key requirements: it had to use my (pretty old) Minolta lenses, and they both fit and work perfectly. I was surprised, however, that I have to choose between the regular viewfinder and the video screen. I thought that even if I was looking through the viewfinder, the image would still appear on the screen. This hasn't affected my use of the camera, and my pictures are beautifully clear and sharp regardless of how I view them. I am delighted with my new purchase and looking forward to lots of great pictures, especially once I read the owner's manual!",
      "rating": 4.0,
      "verified": true,
      "author": "T. Rauschenbach",
      "helpful_votes": 4,
      "publication_date": 20100604
    },
    {
      "title": "Good dslr camera",
      "text": "Great camera. Didn't know it wouldn't come without batteries or charger but got a good price on them.Thanks to prime had that next day and was up and running",
      "rating": 4.0,
      "verified": true,
      "author": "Barry",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Sony Alpha 380",
      "text": "This is a very light-weight camera! I like that I can use two different types of memory. (SD cards are cheaper than CF.) The hand grip is a little awkward at first, but relatively easy to get used to. The kit lens is not the greatest, but I used to shoot with Minolta in the film days and when I first switched over to dSLR, so I have plenty of Minolta / Sony lenses and accessories.",
      "rating": 4.0,
      "verified": true,
      "author": "Jaimie Krause",
      "helpful_votes": 2,
      "publication_date": 20100505
    },
    {
      "title": "Easy, Quick and Foolproof!",
      "text": "Quick and foolproof in auto mode. Used for the first time and because my wife and I haven't had a SLR for decades we used auto mode for a visit. Great pics, the shots almost take themselves. Any begginer will love the ease of use and we can't wait to re-learn custom settings. Battery lasted for around 280 shots with frequent viewing. Well worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Yolander",
      "helpful_votes": 0,
      "publication_date": 20100909
    },
    {
      "title": "Sony Alpha A220L",
      "text": "We were very pleased with the camera. We needed it to replace one that tumbled down a rocky ravine on a hike--the lens was spared but the camera base was messed up. The one we bought works as well as our old one before it broke. We were very happy with the product and service.",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart",
      "helpful_votes": 0,
      "publication_date": 20111213
    },
    {
      "title": "100% pleased",
      "text": "Takes great pictures right out of the box. Auto everything works great. lots of extras with package from Willoughbys.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen K. Hopkins",
      "helpful_votes": 2,
      "publication_date": 20091007
    },
    {
      "title": "great camera for the price",
      "text": "great option for less than cutting edge technology at a great price ability to use a variety of lenses from a combination of manufactures is an added bonus",
      "rating": 4.0,
      "verified": true,
      "author": "Fishmonger",
      "helpful_votes": 0,
      "publication_date": 20130630
    },
    {
      "title": "Excellent product!",
      "text": "Purchased the Sony over similar Nikon and Canon DSLRs, am extremely happy with my decision...for one thing, the Sony has a live image screen on the back, which the other two did not have. Everything about this camera is great for the price. Fits easily with many brands of lenses and filters.",
      "rating": 5.0,
      "verified": true,
      "author": "VolcanoVixen",
      "helpful_votes": 0,
      "publication_date": 20100812
    },
    {
      "title": "Sony Alpha A330L",
      "text": "The camera was as they said it would be, looked brand new, in original box with all the standard parts.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee Devine",
      "helpful_votes": 0,
      "publication_date": 20140613
    },
    {
      "title": "Great camera.",
      "text": "Very good camera. I am not a professional photographer, but this camera was not recommeneded by photo enthusiasts and professionals, but after taking pictures with this camera, I am very happy I chose this instead of the expensive Canikons. The picture quality is very good, the live view is great, in-camera image stabilization and so many features that the professional grade cameras have. Absolutely love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ram G",
      "helpful_votes": 2,
      "publication_date": 20091005
    },
    {
      "title": "My first DSLR",
      "text": "I am still learning how to use this camera, but I am pleased with the pictures I have taken to date. As a \"first DSLR\" this is a great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Flossie",
      "helpful_votes": 0,
      "publication_date": 20100917
    },
    {
      "title": "The camera I received had dust on the sensor which resisted the tedious dust abatement procedure",
      "text": "Meh. Cheap camera that takes meh pictures. The camera I received had dust on the sensor which resisted the tedious dust abatement procedure. So I returned it.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim Ault",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "Blaine",
      "text": "Had and still have a Minolta Maxxim 7000 and 70-210 Minolta \"A\" mount lens and 2x teleconverter. Love photography, but not going to the store to get pictures developed, this is a great camera that gets me into the \"digital\" age and back into photography with relative ease. I'm lovin' it!",
      "rating": 5.0,
      "verified": true,
      "author": "bbaxb",
      "helpful_votes": 0,
      "publication_date": 20100211
    },
    {
      "title": "excellent first DLSR",
      "text": "This is an excellent DLSR for anyone just moving up from point-and-shoot. Priced well for the features. If you previously owned a Minolta Maxxum, your lenses will fit the Sony Alpha system.",
      "rating": 5.0,
      "verified": true,
      "author": "mgw56",
      "helpful_votes": 0,
      "publication_date": 20100725
    },
    {
      "title": "Sony A330 Money Saver Kit",
      "text": "Purchased Sony A330 from Amazon. A Money Saver Kit sold by a 3rd party seller. The complete package contains good set of accessories for good price. I would have been happier if the kit had single lens that can span from 18mm-300mm... Otherwise, the package was impressive.",
      "rating": 4.0,
      "verified": true,
      "author": "Ragan",
      "helpful_votes": 0,
      "publication_date": 20090922
    },
    {
      "title": "Great product! very efficient seller too!",
      "text": "This was a great purchase and the seller was very accurate as for shipping times and prices. I would certainly reccommend buying from him",
      "rating": 5.0,
      "verified": true,
      "author": "Guerrock",
      "helpful_votes": 0,
      "publication_date": 20100912
    },
    {
      "title": "Great for amateurs, professionals, and everyone in between.",
      "text": "I've owned this camera for around 6 years now, and it's done everything I've needed it to, when I need it to, and it's never once failed me. I'm no \"professional\", but I've had many 20x30's framed in model homes and in many other homes, and they look wonderful. Clear and crisp like you'd expect. Judge for yourself. My website is \"LJRossPhoto.com\". All photography was taken with a Sony a380.",
      "rating": 5.0,
      "verified": false,
      "author": "LJRossPhoto",
      "helpful_votes": 0,
      "publication_date": 20140805
    },
    {
      "title": "Love it!",
      "text": "I am a proud owner of this camera and a photography enthusiast. These are some of my favorite shots I have gotten with this camera. They have not been touched up by a computer. Once you learn how to use this camera and the best times to shoot, the camera does all the work and provides BEAUTIFUL photos. I highly recommend as a beginner DSLR camera! - Gracie",
      "rating": 5.0,
      "verified": false,
      "author": "Gracie Boehl",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Great Camera",
      "text": "Got this camera for Christmas for my Wife, we both like it very much, easy to use on Auto if you want to take quick easy shots but lots of modes that are easily understood if you want to take more artistic shots. Great replacement for higher end point and shoot cameras, takes great shots rapidly. Would buy again.",
      "rating": 5.0,
      "verified": false,
      "author": "GGodman",
      "helpful_votes": 0,
      "publication_date": 20110214
    },
    {
      "title": "all in one bundle",
      "text": "The main problem with this product is that, its digital screen is not visible in low light conditions. Other than that, it is really a good camera. Since they supply two lenses with low price I think this bundle is the best choice.",
      "rating": 5.0,
      "verified": false,
      "author": "barry",
      "helpful_votes": 0,
      "publication_date": 20100910
    },
    {
      "title": "Went looking for Nikon, left with Sony",
      "text": "This is a great camera. When I went shopping for a DSLR. I was looking for certian features. I wanted ease of use, a good range of additional lens, and a giant leap from a point and shoot. The Sony fit these needs. It takes great pictures. The live view was a nice touch.",
      "rating": 5.0,
      "verified": false,
      "author": "KenS",
      "helpful_votes": 0,
      "publication_date": 20100804
    },
    {
      "title": "Eh.",
      "text": "So I got this camera a couple months ago, and I have to say, I am never buying a Sony DSLR again. It seems like the lowest of the low entry level SLR's. I would much more recommend the Canon Rebel XSi, or the Nikon D60 as your entry level. The battery life sucks, and the image stabilization doesn't do much at all. Low light shots turn out GRAINY, and I am just overall not impressed.",
      "rating": 2.0,
      "verified": false,
      "author": "B. Short",
      "helpful_votes": 12,
      "publication_date": 20100107
    }
  ],
  "product_meta": {
    "title": "Sony Alpha A380L 14.2 MP Digital SLR Camera with Super SteadyShot INSIDE Image Stabilization and 18-55mm Lens",
    "description": "Configuration:14.2 MPFROM THE MANUFACTURER\n\n\nThe Sony a380 DSLR camera brings you the freedom of Live View, which lets you compose and shoot photos using a tiltable 2.7-inch (diag.) LCD screen. SteadyShot INSIDE in-camera image stabilization reduces blur in every shot, while 14.2-megapixel resolution preserves those special moments in spectacular clarity and detail. \n\nSony Alpha a380 Highlights \n\n\n\n2.7-inch (diag.) Clear Photo LCD Plus featuring Live View with Quick Auto Focus\nA large 2.7-inch (diag.) Clear Photo LCD Plus display features Live View with Quick Auto Focus, which lets you compose and shoot pictures in real-time using the LCD, just as you would with a point-and-shoot camera. In addition, the LCD display tilts up or down for low or high-angle shooting situations, such as capturing a child’s first steps or shooting over a crowd. \n\n14.2-megapixel resolution for ultra-fine detail\nA 14.2-megapixel APS-size CCD image sensor captures your images in spectacular, high-resolution detail, giving you the freedom to make large prints and tight crops without sacrificing quality. \n\nSteadyShot INSIDE in-camera image stabilization\nSteadyShot INSIDE in-camera image stabilization is built into each camera body, so every a-mount lens benefits from the ability to minimize blur due to camera shake. \n\nLightweightand stylish body\nThe DSLR-A380 features a stylish, modern design with an intuitive button layout for easier operation. In addition, the lightweight body and revised grip make the camera more comfortable to hold and carry. \n\nIntegrated on-screen Help Guide and Graphic Display\nAn integrated on-screen Help Guide and Graphic Display help take the complexity out of DSLR photography. The Help Guide offers clear, concise explanations of various modes and settings, while the Graphic Display helps you understand the relationship between aperture and shutter speed, as well as the effect each has on photographic results. \n\nHDMI terminal and BRAVIA Sync compatibility\nAn HDMI terminal gives you the option of connecting your camera to a compatible HDTV and playing back your images in stunning high definition quality(HDMI cable required, sold separately). In addition, BRAVIA Sync works with compatible Sony BRAVIA HDTVs to let you control camera playback using the television’s remote (HDMI cable and BRAVIA Sync capable HDTV required, sold separately). \n\nHigh sensitivity (ISO 3200) for superior noise reduction\nA broad sensitivity range from ISO 100 to ISO 3200 enables you to capture beautiful color images even in very dim light -- with High ISO Noise Reduction technology that reduces picture noise artifacts at high-sensitivity ISO 1600 and ISO 3200 settings by eliminating noise from RAW data after analog-to-digital conversion. \n\nEye-Start Autofocus\nEye-Start Autofocus System begins precision autofocus adjustments the moment you raise the camera to your eye, so the camera is ready to catch the perfect moment. \n\n9-Point AF Sensor\n9-Point Center Cross AF Sensor with improved focus control to help bring images into sharp definition more quickly, and predictive focus control automatically calculates the position of fast-moving subjects. \n\nUp to 2.5 fps continuous shooting\nContinuous Shooting lets you shoot at up to 2.5 fps (frames per second) while viewing your subject through the optical viewfinder so you never lose track of the action. \n\nCreative Style settings\nCreative Style settings give you control over how the camera processes your images. Choose from 8 finishing styles, including Standard, Vivid, Potrait, Landscape, Night View, Sunset, B&W, and Adobe RGB, and fine tune them to your personal taste with the ability to adjust contrast, saturation, and sharpness settings. \n\nDynamic Range Optimizer\nDynamic Range Optimizer provides two levels--Standard/Plus to improve results with backlit subjects and recover details hidden in shadows or lost in glare. Normal DRO improves detail using standard gamma curves for fast shot-to-shot response time, while Advanced DRO adjusts dynamic range area-by-area for greater accuracy. \n\nBuilt-in Pop-Up Flash\nThe Auto Pop-Up Flash automatically pops up and fires as needed when the camera is set to certain scene selection modes, helping first-time DSLR photographers shoot more effectively. In addition, the a380 features an integrated hot shoe, which lets you expand your lighting options with a range of accessory flashes (sold separately). \n\nAnti-Dust Technology\nAnti-Dust Technology helps keep the CCD imager clean, resulting in consistently better pictures, by utilizing a static-free anti-dust coating on the CCD filter, as well as an anti-dust vibration that automatically shakes the CCD to help dislodge dust each time the camera is shut off. \n\nStamina Battery power \nStamina Battery power allows you to take up to 500 shots on a fully charged NP-FM50 InfoLITHIUM battery when using the optical viewfinder mode, and you’ll be able to see how much power remains in percentage increments, so you can keep shooting in confidence. \n\nSmart Teleconverter 2x Digital Zoom\nSmart Teleconverter 2x Digital Zoom lets you zoom in electronically on your subject and reproduces pixels on a 1:1 basis so there’s no degradation in picture quality. One touch zooms in at 1.4X, while the second touch advances to 2x zoom -- creating the 35mm equivalent of a telephoto effect with the camera’s standard 18-55mm optical zoom lens. \n\nBIONZ image processor\nThe advanced BIONZ image processor uses hardware-based Large Scale Integrated (LSI) circuitry to enhance images with rich tonal reproduction, reduced noise, and improved white balance and exposure control, for clear, sharp photos even at high sensitivity settings. \n\nPhotoTV HD compatibility\nPhotoTV HD compatibility lets you automatically create high-resolution thumbnails optimized for viewing on a compatible Sony BRAVIA HDTV. \n\nScene Selection Modes\nScene Selection Modes optimize camera settings for different shooting situations. Just turn the Mode Dial to select from Portrait, Landscape, Macro, Sports, Sunset, and Night View modes. \n\nIndex and Slide Show Display\nIndex and Slide Show Display enable you to quickly review your photos using 4, 9 or 25-frame index views, or as an automatic slide show with fade-in/fade-out effect. \n\nFunction Guide Display\nFunction Guide Display provides intuitive and easy to use on-screen menus that can be activated and operated with one hand using the Fn (Function) button and controller button to adjust Flash mode, Autofocus mode, White Balance, Metering mode, AF area and D-Range Optimizer. \n\nDual slot Compatibility for Memory Stick and SD media\nCompatible with high-capacity Memory Stick PRO Duo, Memory Stick PRO-HG Duo and SD/SDHC media (sold separately) for convenient storage and sharing of your images.",
    "rating": 3.6,
    "feature_bullets": [
      "14.2-megapixel APS-size CCD image sensor for ultra-fine detail",
      "Included SAL1855 18-55mm standard zoom lens",
      "SteadyShot INSIDE in-camera image stabilization; Eye-Start Autofocus",
      "Tiltable, 2.7-inch Clear Photo LCD Plus display",
      "Compatible with high-capacity Memory Stick PRO Duo, Memory Stick PRO-HG Duo and SD/SDHC media (sold separately)"
    ],
    "specifications": {
      "Product Dimensions": "8.15 x 7.91 x 6.14 inches",
      "Item Weight": "1.08 pounds",
      "ASIN": "B0029U0WZM",
      "Item model number": "DSLRA380L",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "3.6 out of 5 stars52 ratings3.6 out of 5 stars",
      "Best Sellers Rank": "#477,212 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 17, 2009",
      "Manufacturer": "Sony"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "DSLR Cameras"
    ],
    "price": ""
  }
}