{
  "website_summaries": [
    {
      "verdict": "This is an extra-sturdy bar that can be mounted on a wall or ceiling.",
      "pros": [
        "Three size options for different ceiling heights and wall or ceiling mounting provide multiple ways to use this solid bar",
        "We love its high-quality powder-coated grip",
        "Includes mounting hardware",
        "48 inches wide",
        "Max weight of 600 pounds"
      ],
      "cons": [
        "Provided bolts are low-quality and may shear"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great product, now I have to stay motivated.",
      "text": "Very nice quality product. Installed in my garage and am very happy. I framed out the mounting 2x4's in the ceiling with additional lateral support for extra (probably unessary) stability and strength. Basically the letter E in the photo made out of 2x4's. If you have 24 inch studs, the small boards are 20 and 7/8 and really help to eliminate any creaking.",
      "rating": 5.0,
      "verified": true,
      "author": "Freddy Bastiat",
      "helpful_votes": 9,
      "publication_date": 20161227
    },
    {
      "title": "Impressive bar, crap bolts.",
      "text": "Man I wish I would have trusted the other reviewers comments about getting new bolts. I snapped two lag bolts with very little torque. It took me a good hour to precisly measure all of my drill spots and follow the installation procedure from their site and clean up the drywall mess. Now I get to start all over to shift the studbar. Even with two snapped bolts the bar is sturdy. Impressive bar, crap bolts.",
      "rating": 3.0,
      "verified": true,
      "author": "LockFlow",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Rock solid and tremendous value!",
      "text": "Initially I was set on buying a popular name brand pull up bar but when I saw what they wanted for shipping I started looking for alternatives. That's when I found the Stud Bar and I'm so glad I did. I have 8.5' ceiling in my garage so I bought the small. I'm 6' 250lbs and I can reach up and grab it without jumping with it on the low setting. Extremely well built and rock solid! I highly recommend this bar! They have good videos online to help with installation and such.",
      "rating": 5.0,
      "verified": true,
      "author": "Denny",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "2x4s needs to reinforced before mounting",
      "text": "They said it can be mounted vertical on the wall 2x4 studs. There was too much flex and I decided to mount 2x6 boards across and then the stud bar to distribute the weight more evenly. Instructions or the video didnt say that and after investigating further, all wall mounted rigs are mounted this way and I highly recommend it wether it be vertical for hanging from your ceiling.",
      "rating": 5.0,
      "verified": true,
      "author": "William L",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Best value out there",
      "text": "I wanted a simple, straightforward pull-up bar and this fits the bill. The easy install is not so easy. You have to have every measurement exact for everything to fit properly especially if you are dealing with drywall. I did also have one bolt snap and I did not use a torque wrench. So, minus one bolt for the ceiling and a partially installed bolt on the bar itself, the set-up is still very very sturdy. No flex at all.",
      "rating": 4.0,
      "verified": true,
      "author": "S.E.H.",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Solid bar at a reasonable price, easy to install",
      "text": "Only received 1 of 2 boxes to the studbar (shipped the mounts but no bar) and although Amazon wouldn’t help me out, Mark was happy to send the part out ASAP. Wall mounted and really pleased with have a legit bar in my garage/gym. I decided to install using cement screws directly into the wall, which cost an additional $20, but this bar isn’t going anywhere now. Thanks again Mark for addressing the issue. Great product/quality for a reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "E'sMom",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Awesome!",
      "text": "I found the Stud Bar very easy to install. The instruction video was very informative with every step. The bar is sturdy and high quality. I chose the Stud Bar hoping it would be higher quality and I was not disappointed. The grip on the bar is excellent so you won't need to necessarily tape it. The construction of the entire apparatus is very well made. Very pleased. I would highly recommend. Delivery was great. I live in California and delivery was very fast. Packaging was easy to deal with too.",
      "rating": 5.0,
      "verified": true,
      "author": "In LA",
      "helpful_votes": 14,
      "publication_date": 20150417
    },
    {
      "title": "Excellent Value Pull-up Bar",
      "text": "Great pull-up bar. It was pretty straightforward and easy to install with the proper tools. It is very sturdy and bar is a good diameter for gripping. The powder coat finish on the bar makes it pretty non-slip. I added some tennis racquet grip tape mainly because I had it already for a previous bar and didn’t want to throw it away. All around awesome bar for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Allen J Keller",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Awesome Pull Up Bar!",
      "text": "Nice looking, well built, phenomenal pull up bar. I got the small and mounted it on a ceiling 8.5 feet high. I’m 5’10” and the height is perfect. This guy did a nice job on this. I did replace all bolts with stainless steel. Because I’m a hard grader, I’d be tempted to give it 4.5 stars because the mounting has to be perfect and square for 8 bolts to line up. Take your time, do not just throw this up on the ceiling. Do it slow and right and you’ll be, well, a stud...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Great Bar!",
      "text": "So far so good with this stud bar. I purchased the standard because I have dreams of building a home gym in my storage room but if I was to keep it in the drive way I may have gone with the shorter bar. The 2 height setting is very handy. Very sturdy, lots of grip! Able to kip and do T2B with ease. Would purchase from this seller again!",
      "rating": 5.0,
      "verified": true,
      "author": "Nreekay",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Easy Install & Great Quality",
      "text": "I helped my handyman install it (I’m 5’4” and not skilled with power tools). It took less than an hour total. Nice to have an extra hand but one strong person could probably install it solo. It’s very solid and likely my house would collapse before the bar failed.",
      "rating": 5.0,
      "verified": true,
      "author": "Eve W.",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "and holding up great. Ceiling mounted",
      "text": "This thing is SOLID. Industrial strength. Grippy, powder coat finish. Finding the studs on center was a bear, but not a fault in the design. Had it a week, and holding up great. Ceiling mounted, makes me a little nervous, but with 8 long lag bolts buried in the studs, I don't think it's coming down. Power drill was not powerful enough to drive lag bolts as in the instruction video, but got job done.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Cooper",
      "helpful_votes": 2,
      "publication_date": 20180219
    },
    {
      "title": "Very sturdy and well-made",
      "text": "Very sturdy and well-made. My 15.5 volt cordless drill was insufficient to screw lags in all the way, finished with the wrench, no issues. Had to open the ceiling to check that no wires and pipes are passing through joists where i was planning to put lag bolts. However, this would have been the case with any ceiling-mounted pull-up bar.",
      "rating": 5.0,
      "verified": true,
      "author": "Yan",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Great addition to home gym!",
      "text": "Excellent! This was exactly what we were looking for. We couldn’t find a good spot on the ceiling, so we just mounted on the studs. Works great! Worth every penny! And the size it fantastic! We can both fit side-by-side on it... just to get an idea of how wide it is.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Kirkland",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "rock solid bar, but advanced skills needed for assembly",
      "text": "I bought the 9-foot version, then wall-mounted it at the height of my outstretched fingers. Know where your studs are when placing this on a finished wall. Drill pilot holes first and the included lag bolts will suffice without breaking off, which was what one buyer here suffered. I feel your pain, but everything worked for me this time. The biggest hassle is locating the studs. This bar requires two studs to be 48\" apart at some point, which is no problem if the carpenters put the studs at 16\" centers like they should have. Mine were a bit sloppy in a few locations, but I finally found a spot that worked. Now it's rock solid and looks okay, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Solid design, terrible lag bolts",
      "text": "Great, simple, solid design. Once installed, with proper lag bolts it's really solid. Listen to all the other reviews. Do yourself a favor and buy some real lags. I've installed hundreds of lag bolts. The included bolts are soft junk. They can barely handle enough torque to drive them, let alone snug up the bar (Yes I did pre-drill my holes). I'll spare the details but 3 snapped (You can't be gentle enough with these). Had to dig out the sheetrock and twist them out with vise grips. I would buy this again, but immediately chuck the included lags.",
      "rating": 4.0,
      "verified": true,
      "author": "Branden Mcdonald",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Good for kipping",
      "text": "Got the large size and wall mounted it. I’m over 200 lbs and kip a lot so I wanted a sturdy bar. Very pleased, followed the directions for installing and it doesn’t budge. I did opt to install it on the closer set of holes to the wall, still plenty of room to kip facing either direction.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "You won’t be sorry with this pull-up bar!",
      "text": "I purchased the large to put in my garage with 10 ft. ceilings. After reading reviews on Amazon I purchased lag bolts before starting installation. Unfortunately I twisted 2 off using a drill as recommended. I decided to try the bolts that came with the bar. This time I made sure I drilled the 3/16 pilot holes at least 3 inches deep. Also I didn’t have Vaseline so I used carmex lip balm on the threads and was very careful to not over tighten as the instructional video says. It worked and it’s solid as a rock! This bar is built like no other and I’m very pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Great pull-up bar",
      "text": "Very sturdy. Not complicated to assemble, but you may want an extra hand or some clamps available.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Trimble",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "The product was easy to install and was the perfect size",
      "text": "If I could give this product 10 Stars I would. The product was easy to install and was the perfect size. My husband is 6'4\" and a Marine so he knows how to do real pull ups and this bar allows him to hang completely from our 9 foot ceilings. A perfect, sturdy, well-designed piece.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 3,
      "publication_date": 20160502
    },
    {
      "title": "Solid bar, reasonable price 👍",
      "text": "Very solid, quick shipping, mounting hardware included. I found the powder coated bar a bit rough, so I hit it with a little 400 grit sandpaper. The powder coat is thick, so now I have a slightly smoother powder coat finish. If you're wavering between Rogue, Titan, and this one....you won't be disappointed with the stud bar👍 It's a bit cheaper than the Rogue, you are supporting a California based small business, and I am pretty sure that the quality of the finish and welding are better than Titan.",
      "rating": 5.0,
      "verified": true,
      "author": "MRoth",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Good for small space",
      "text": "Sturdy but subtle. In garage with weight bench but doesn’t take up any floor space.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Stud Bar Simple Sturdy and Effective",
      "text": "bar is heavy duty and has nice grip. I have Noya rings attached to it. Entire family is able to use the setup. Installation is very straight fwd just make sure you know the joist distance as you may have to follow an alternate install method. I installed the system to my garage roof by myself using alternate method requiring additional 2 x 4's in a couple of hours. Woulf have been 30-40 minutes if my joist were different distance and if I had help.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20150527
    },
    {
      "title": "OUTSTANDING!!!!",
      "text": "This pull up bar is extremely high quality and super easy to install. I have tried other pull up bars in the past but this one exceeded my expectations by far. I am extremely happy with this purchase! Excellent product, easy installation. THANK YOU STUD BAR!",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Excellent bar, large version should be installed by 2 people",
      "text": "Love it! Recommendation: For the large version I would suggest having a buddy around to help install it. The installation video (great and to the point) seems to be for the smaller version which is lighter because of the size of the equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "Kamonchanok Mohprasit",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Great Customer Service",
      "text": "I had been thinking of one of these for a while to upgrade from a tinpot door frame effort. It is firm, sturdy and easy to install. Well easy for any normal well rounded individual to install. I didn’t get it quite right, but Mark was super helpful and with his advice it was easy to put up.",
      "rating": 5.0,
      "verified": true,
      "author": "Bradders",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Rock solid, exactly what I needed",
      "text": "This bar is perfect for my purposes. It mounted securely with no play in the joints and at no time am I concerned about it coming loose or falling. I'm about 190lbs, for reference. I attached theseto it and I have a complete bodyweight workout gym. Mounting this bar pretty much requires a second set of hands. Make sure you have a good stud finder before installing. I spent a lot of time fixing a mistake my cheap stud finder lured me into The website for the company that makes these (the address will be on the box) actually has a fantastic set of instructions for installation. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Anderson",
      "helpful_votes": 0,
      "publication_date": 20130916
    },
    {
      "title": "Highly recommend this product.",
      "text": "Absolutely great product. I had 9.5’ ceiling so I went with the large. I’m happy with that decision. There’s about 6’ of clearance below lowest part of structure. Easy to install and made from quality parts. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "J Witherly",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Sturdy, built to last a lifetime.",
      "text": "I miss the gym so much since the tarump pandemic but at least I can do my pull ups. Well designed, built like a 60’s muscle car. Bolts are fine, pre drill and ran them in with my Mikita hammer gun. Awesome awesome product. End the tariffs, import N95 masks.",
      "rating": 5.0,
      "verified": true,
      "author": "harry h baburian",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Installation was easy and I was able to do it myself with ...",
      "text": "I have owned this pull up bar for a few years now and still use it regularly. Installation was easy and I was able to do it myself with basic tools and a power drill. I am 6'1\" and have the bar at the lower setting and I have plenty of room between my head and the ceiling when I am in the \"up\" position. The bar is textured so I wear gloves to save my hands. Very solid pull up bar. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "VTMIKE24 ",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Made in China, but still a good pull up bar!",
      "text": "Great product! Installed yesterday in my 10 1/2 foot garage ceiling. Disappointed to see “made in China” sticker on it as I thought this was a “made in America” product.",
      "rating": 5.0,
      "verified": true,
      "author": "KR1970",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "This is the perfect pull up bar! Rock Solid. Great Company!",
      "text": "This is a rock solid pull up bar! I'm so happy with my purchase. Unfortunately I thought I would be able to mount it on the ceiling of my garage but the rafters weren't standard. I contacted Mark the owner and he was amazing at helping me get a different bracket to mount on my wall. Couldn't be happier!!",
      "rating": 5.0,
      "verified": true,
      "author": "Molenpapi",
      "helpful_votes": 0,
      "publication_date": 20161124
    },
    {
      "title": "Sturdy and professional Feel",
      "text": "We installed in a tall garage with mismatched joists, but thats not the fault of the product - but still its a little involved. But these are terrific, I am 220 LBs and can hang freely, do toes to bar, muscle ups, etc in addition to pull ups, very sturdy..",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Great pull up bar",
      "text": "Straight forward to install and works as advertised! Able to hold at least 250lbs without feeling any wobble. All in all very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Southwick",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Don’t be me. Follow instructions.",
      "text": "Pull up bar is awesome. However. Use caution and have patience unlike me and don’t use a socket wrench to tighten lag bolts. Don’t do it. It will fatigue the hardware leaving you very sad and angry staring in disbelief wondering how you are going to get the broken bolts out. Follow instructions. But, it would not hurt to replace given hardware with higher quality hardware. See picture.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel G.",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Very Sturdy",
      "text": "Well built bar. Nice coating and very well built. Also it was pretty easy to put up. Don't use a drill to install because you may break the bolts with to much torque.",
      "rating": 5.0,
      "verified": true,
      "author": "mysticalrising",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Solid!",
      "text": "The bar was very easy to install. The pull-up bar is very sturdy. Also, you can select a few heights.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Winners",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Solid product. Fast shipping.",
      "text": "Great pull up bar. Super solid after installation. Took about an hr to install. Fast shipping also. Installation video was a little hard to find online on the mobile version of the website. Ended up having to google it to get to the video cause link is not clear on site. Solid product. If ur serious about taking pull-ups to the next level this is the real deal. I have mine mounted on the higher hole for the bar which is 10in below my 8ft ceiling. I am 6ft tall and at full extension it's perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnnyl",
      "helpful_votes": 5,
      "publication_date": 20160309
    },
    {
      "title": "Lag screws are lagging.",
      "text": "The product is great but why wouldnt they spen just a little more for good lag bolts? I had two snap using a 3/8 wrench. I did pre drill as well. It was like it was butter so I had to buy from home depot anf re drill. Such a shame..",
      "rating": 4.0,
      "verified": true,
      "author": "B1wyatt",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "The installation is pretty straightforward, but I appreciate the effort on the ...",
      "text": "Quality product - brackets are a solid single piece. The instruction video is well done. The installation is pretty straightforward, but I appreciate the effort on the video - this company is proud of their product. Once installed this bar is absolutely solid. Ceiling mounted directly into basement joists. I'm not very heavy, but I can imagine this bar to withstand a good bit of weight",
      "rating": 5.0,
      "verified": true,
      "author": "BW",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "the customer service is excellent. Mark got back to me immediately",
      "text": "First, the customer service is excellent. Mark got back to me immediately. I texted a question about the size of the Stud Bar’s foot print and got an answer immediately. The quality of the bar is top rate. It’s impressively strong steel (well made) and is super sturdy once mounted. I mounted the bar in about 15 minutes. I’m 215lbs and put 30lbs of chains on, went to town on pull ups, swung around like a monkey and it didn’t budge. I extensively researched and compared different pull up mounts and the Stud Bar came out on top every time. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Joanne Lim",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Love the bar",
      "text": "Love the bar!! It is super solid. I bought the small because my garage has an 8 1⁄2 foot ceiling. On the lower rung it hangs great I have a little jump to get on it and don’t have to worry about banging my head on ceiling. It is super solid did a WOD with T2Bs and Butterfly pull-ups and no give at all. Powder coat is a little rough on the hands but other than that a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "LUCIEN",
      "helpful_votes": 0,
      "publication_date": 20150211
    },
    {
      "title": "Does not come with THE BAR, which is a fairly important part",
      "text": "This product came with the two side pieces. No bar. There is no one to ask for help. No response from questions. Apparently SOME people get the whole thing, but you might not. Don't gamble on this.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim Hodgson",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Great well built bar",
      "text": "Awesome bar. Built like a tank. If you’re used to doorway pull up bars this will change your life...and physique. Can not recommend enough.",
      "rating": 5.0,
      "verified": true,
      "author": "TX Dad",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Great build quality, great grip, elegant design and very strong.",
      "text": "Stud bar is well worth the money. It build it high quality materials and is the type of gear you expect for a high quality Gym. In my opinion is x100 better to purchase a stud bar than a door frame pull bar. If you are serious about pull up bar and doesn't have the skill to make your own then get a stud bar is easier and would probably last you a lifetime.",
      "rating": 5.0,
      "verified": true,
      "author": "Christian L.",
      "helpful_votes": 0,
      "publication_date": 20160527
    },
    {
      "title": "The best pull-up bar I've ever used.",
      "text": "This is an essential piece of exercise equipment and I love that it doesn't take up as much space as a floor standing pull-up bar. As soon as you unbox this bar, it screams out high quality. Nothing about this bad boy is weak and the same will be said about you after using it for awhile. I recommend also purchasing the assist bands from them to keep you up on the bar longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe C. ",
      "helpful_votes": 0,
      "publication_date": 20140118
    },
    {
      "title": "Sturdy, safe & easy to install",
      "text": "We LOVE our StudBar. When we first purchased we installed in our garage but with a new move, our StudBar is now in our home exercise room. The bar was super easy to install and is sturdy and safe for the whole family. With 3 growing athletes, our family gets great use of the StudBar on the daily! Unlike the \"over the door\" pull up options I don't have to worry about anything coming loose or falling off when my girls are using it. Highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "boo",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Excellent bar",
      "text": "I purchased this to hang in my garage and it has not disappointed. This bar is built extremely well and mounts securely so there is never any concern of this thing coming down. I have been very hard on this thing, and it honestly feels like it is part of the ceiling with how secure it is. The installation is a breeze with the proper tools, and I'd highly recommend going to the website of this company (there is a sticker on the bar with the web address) which provide videos on the installation.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Hanley",
      "helpful_votes": 0,
      "publication_date": 20121206
    },
    {
      "title": "but I would recommend swapping out the cheap zinc lag bolts with stainless ...",
      "text": "Install was a cinch, but I would recommend swapping out the cheap zinc lag bolts with stainless as it requires a fair amount of torque to drive these into your pre-drilled joists. I didn't want to risk snapping one off.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark A. Vogt",
      "helpful_votes": 2,
      "publication_date": 20170316
    },
    {
      "title": "Beware of cheap lag bolts ...",
      "text": "Instructions state \"Drive lag bolts into studs using an electric drill. Do not drive or over torque lag bolts by hand using a ratchet. This can overtorque and break lag bolts.\" I followed instructions and tried to get bolts tight without overdoing it ... unfortunately 2 bolts twisted and snapped ... other than that seems to be well designed ... looking forward to getting years of use out of it ... fyi - there is ok clearance with 8' ceilings and using the top holes to mount the bar ...",
      "rating": 4.0,
      "verified": true,
      "author": "PG",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "sturdy....but poor quality",
      "text": "Bar and brackets feel sturdy, but at this price point, I expect the finish to be better. The coating on the bar is peeling off and I can see some rust forming. Very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Everything is of superior quality, except for the bolts",
      "text": "after reading other reviews, I just took it upon myself to go ahead and buy more bolts prior installation. I would hope by now though, the manufacturer would go ahead and Supply better bolts now they heard all the reviews.",
      "rating": 5.0,
      "verified": true,
      "author": "ken ",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Nice fella.",
      "text": "Product is straightforward and sturdy. Cross bar was damaged in transit. The owner supplies his email in the package and responded immediately, telling me he had sent a new crossbar to me directly. He covered shipping and didn't need to involve Amazon, which would have taken more effort than 1 email. Great customer service, great bar.",
      "rating": 5.0,
      "verified": true,
      "author": "joe sutton",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Nice pull up bar",
      "text": "Not too difficult to mount, solid construction, two bar mounting points is very helpful",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Broke a lag bolt also. Made sure you pre-drill ...",
      "text": "Broke a lag bolt also. Made sure you pre-drill the holes at least 3 in.. otherwise get Barr thanks",
      "rating": 5.0,
      "verified": true,
      "author": "David Burroughs",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Very sturdy, easy to mount",
      "text": "The bar was easy to mount and is extremely sturdy; I use it for P90X and there is no movement at all. I would have rated it 5 stars but the product did arrive with some minor cosmetic damage on the labels and the bar itself was rusted on the end. I will try and post my pictures showing the rust. Overall a very good product, wish it was made in the USA.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Simpson",
      "helpful_votes": 0,
      "publication_date": 20131114
    },
    {
      "title": "everyone should do pullups",
      "text": "if you have the space in your house someplace with high enough ceilings this works well. if you have 8 foot ceilings I would hesitate buying it but it could work. the next step of course is to not just let it hang there, use it and only you can make your self. 6 stars if it could.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 4,
      "publication_date": 20140127
    },
    {
      "title": "excellent pullup bar",
      "text": "I to all that is looking at purchasing stud bar. I installed it my self in the garage and let me tell you it is BIG and WIDE. After, I installed it you can feel that it is solid and able to do kipping pull-ups and all kinds of pull-ups. The only down fall is that make sure you accurately measure from roof to floor. The bar is a solid bar and does slip, but you can tape it up or use chalk. Overall it is excellent!! and would recommended it to anyone. vince, parrish, fl.",
      "rating": 5.0,
      "verified": true,
      "author": "VINCENT SMITH",
      "helpful_votes": 0,
      "publication_date": 20120103
    },
    {
      "title": "StudBar - Outstanding Product!",
      "text": "Received my \"Stud Bar\" quickly and in EXCELLENT condition. I had a minor problem on my end concerning installation so I contacted the company. They immediately responded, worked out the problem and all is GOOD! I like everyone else not only expect but appreciate OUTSTANDING customer service, these guys delivered. The product itself... OUTSTANDING! Nothing wimpy about this product...high grade steel. Love the product, so very glad I made this purchase. Thanks again \"M.\"!",
      "rating": 5.0,
      "verified": true,
      "author": "Airkahuna",
      "helpful_votes": 0,
      "publication_date": 20120526
    },
    {
      "title": "Missing Bar",
      "text": "The mounting bars seem sturdy enough, can't tell for sure because I haven't received the crossbar. Will update if I receive it in the replacement order from Amazon. Edit: After ~2 weeks of waiting, I finally got the bar. Frustration aside, it is very sturdy and I am pleased.",
      "rating": 3.0,
      "verified": true,
      "author": "Deren ",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Missing the bar",
      "text": "Doesn’t come with a literal bar. The only three parts in the box were the two parts that mount to the studs and the bolts. No actual pull up bar.",
      "rating": 1.0,
      "verified": true,
      "author": "Colin G.",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "all mounting hardware is included and installation was pretty straightforward. I was missing a plastic end cap ...",
      "text": "The brackets and bar are all made of heavy duty material, all mounting hardware is included and installation was pretty straightforward. I was missing a plastic end cap on one of the brackets and contacted the company by e-mail, within about an hour I was contacted back and the missing piece was sent out to me. On top of a very well made product, the customer service is also excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160210
    },
    {
      "title": "Pullup Bar",
      "text": "The Bar is excellent, definitely a 5 star but the screws are a 1 star. Some broke during installation and I had to go buy better quality. For safety reasons, I highly recommend you get better screws!!!",
      "rating": 4.0,
      "verified": true,
      "author": "DH",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "Lag bolts lag quality.",
      "text": "Watch out for the cheap lag bolts! I pre-drilled the lag bolt holes and the lag bolts still snapped. I hope the bolts holding the Stud Bar to the Stud Bar frame are not as cheap as the lag bolts, or I'm in trouble. Had to run to the store to purchase higher quality lags.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul H.",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "Best pull up bar available",
      "text": "I am 100% satisfied with this purchase. AWSOME pull up bar!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Perfect for your home gym",
      "text": "This was much heavier duty than I was expecting. It was mounted onto 2 2x4's then those were mounted to my garage ceiling. That way there is no worry of having to line up the predrilled holes. We then added Pro tape so no hand slippage and 2 years later this thing is solid as a rock. Great choice!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny C",
      "helpful_votes": 2,
      "publication_date": 20140413
    },
    {
      "title": "Can confirm: mounting hardware sucks",
      "text": "Should’ve listened to the reviewer about the soft hardware. Now I have to redo the whole damn job because there’s no way I’m getting this bolt out. 🖕",
      "rating": 2.0,
      "verified": true,
      "author": "Jacob Straszynski",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Solid feel",
      "text": "I'm 5'10\" and mounted cross bar to the upper (14\" from ceiling) mount. I'm 155 lbs and wear a 25 lb weighted vest. I have to jump onto the bar from 10\" below and the solid feel makes me confident the whole contraption won't fall on my face!",
      "rating": 5.0,
      "verified": true,
      "author": "John Mow",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Sud Bar Pull Up Bar - excellent product",
      "text": "I've made many different pull up bars, trying to save money. Yet this product is worth every penny. It is easy to install and bomber solid. I'm an avid \"CrossFitter\" - the bar doesn't budge, even with my most violent kipping pull ups. At first, the bar was a bit too smooth for my taste. A bit of fine grain sand paper gave it a more secure feel for me. I highly recommend it to anyone in search of a rock solid pull up bar.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Mitchell",
      "helpful_votes": 29,
      "publication_date": 20100706
    },
    {
      "title": "Chin Up Machine",
      "text": "Installed in the garage and it was easy and works great. I'm 200 pounds and knock them out quick or just hang from this and do my crunches. Highly recommend. Probably would go with the bigger one if you are hanging it from the wall instead of the ceiling but it still works if you are tight for space.",
      "rating": 5.0,
      "verified": true,
      "author": "Tad",
      "helpful_votes": 0,
      "publication_date": 20150202
    },
    {
      "title": "Great customer service and solid product",
      "text": "I think this is my first Amazon review, but I wanted to share what great customer service Stud Bar has. I emailed with a question about the bar before I purchased it, and got a quick response from Mark. After the purchase, I had a question come up during the installation, and Mark emailed me back within a few minutes. I was able to complete the installation, and the bar is rock solid! Great product and GREAT customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "H N",
      "helpful_votes": 0,
      "publication_date": 20161029
    },
    {
      "title": "but it's actually not bad at all",
      "text": "I thought this would look hideous in our family room hanging from the ceiling, but it's actually not bad at all. And is of course, incredibly secure. A bit tricky to install; read all directions and proceed carefully. Great bar.",
      "rating": 5.0,
      "verified": true,
      "author": "Raele Ohana",
      "helpful_votes": 2,
      "publication_date": 20150613
    },
    {
      "title": "This thing looks like a tank part",
      "text": "This thing looks like a tank part. A shame it was packaged poorly and arrived with cardboard in tatters. There was a 1 inch scratch where the powder coating was chipped off. I will paint it to avoid corrosion and then install. About 20 cents of extra cardboard around the ends could have prevented this. Get it together!",
      "rating": 3.0,
      "verified": true,
      "author": "Robert B",
      "helpful_votes": 2,
      "publication_date": 20140910
    },
    {
      "title": "Good stud bar",
      "text": "Solid, strong, and when install properly will support your weight with no problem. adjustable for taller folks as well. Keep in mind that the bar comes separate from the stud attachments, this was something that wasn't aware of and thought it came incomplete. For some reason this is not mentioned when buying this device.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian E Smith",
      "helpful_votes": 0,
      "publication_date": 20130330
    },
    {
      "title": "Glad I spent the extra money on this",
      "text": "Glad I spent the extra money on this. Very heavy duty and the bar appears powder coated, so it has a good grip.",
      "rating": 5.0,
      "verified": true,
      "author": "kristopher Otto",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Missing parts , not help from Amazon",
      "text": "Our cross bar is 1 1/4′′ diameter for a comfortable grip and no slip hammertoe powder coat texture that won't tear your hands like knurled bars. I NEVER GOT THE CROSS BAR.",
      "rating": 1.0,
      "verified": true,
      "author": "ag",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "This simply rocks",
      "text": "This is worth every penny. I mounted to garage ceiling and it works like champ. It takes some time, patience and measuring. I am not that \"do it yourself\" kind of guy and I figured it out, so anyone can. I am not sure how to attach photo or I would show the finished result.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Beecher",
      "helpful_votes": 2,
      "publication_date": 20140220
    },
    {
      "title": "Great communication",
      "text": "The pull up bar works perfectly. It is exactly what we needed and it is super sturdy. The bar was delayed in being delivered and the seller responded immediately and helped the bar reach my home quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Julia N Means",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "great pull up bar!",
      "text": "I love my stud bar! mounted in the garage! its great for strict or kipping pull ups! solid as a rock! We have 2 large size bars mounted in the garage I work out in with my buddies and we do bar muscle ups with no worries! if your thinking about buying one, Just do it because you will love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dean alderman",
      "helpful_votes": 0,
      "publication_date": 20140103
    },
    {
      "title": "Strong and affordable",
      "text": "I've used doorway pull-up bars in the past but would have to worry about the flimsy construction. This product is solid and easy to install. Make sure to follow the installation instructions (online video) particularly the part about not using a socket wrench to install the lag bolts; it's difficult to keep the bolts straight and you may snap them. Good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Fenton",
      "helpful_votes": 0,
      "publication_date": 20160124
    },
    {
      "title": "Excellent",
      "text": "Super solid and well built. Mounting on my finished basement ceiling was a challenge, because the house is build with an engineered floor with I joists on 19\" centers. I put up 2x4's perpendicular to the joists, so spacing was not an issue. I then attached the pull up bar to those 2x4's and it was ready to go. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Rocky",
      "helpful_votes": 0,
      "publication_date": 20150618
    },
    {
      "title": "Easy to install!",
      "text": "Easy to install and very sturdy. Just like the ones at the gym!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Reitter",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Thumbs Up to Stud Bar",
      "text": "Love my Stud Bar!! Easy to install (I’m pretty good at DIY) and solid as a rock! 👍👍",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Great chin up bar and can be used for ab ...",
      "text": "Great chin up bar and can be used for ab exercises as well. Very well constructed and designed. Bar is perfect diameter for my hands and I have average size hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20141126
    },
    {
      "title": "This is a great product. Installation may be tricky if your house ...",
      "text": "This is a great product. Installation may be tricky if your house is not built to specs because it MUST be perfectly parallel to install.",
      "rating": 5.0,
      "verified": true,
      "author": "adugas",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "Perfect Solid Pull-up Bar",
      "text": "I love the powder coating on the bar. Enough to hold you in place without hurting your hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Jorge",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Very solid",
      "text": "Watched the installation video to install and it worked out really well. I had to buy a longer (3\") 3/16 drill bit but other than that didn't have any problems mounting it.",
      "rating": 5.0,
      "verified": true,
      "author": "Crossfitter ",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Great pull-up bar",
      "text": "Great pull-up bar. The only note I have is that the lag screws that come with it can snap if over tightened. I recommend purchasing ledger lock screws and using them instead as the heads will not break off.",
      "rating": 4.0,
      "verified": true,
      "author": "michael rizzo",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "Marine Aviator approved!",
      "text": "This was precisely what my husband was looking for in a pull up bar. He is a Marine pilot and needed a bar that met his high standards. We wanted it mounted in our garage and liked the option of wall or ceiling mount. It was very easy to install, taking only 20 minutes. We appreciated the width of the pull up bar allowed for any standard stud spacing. The diameter of the bar is comfortable for both his grin and my small one. My husband is most impressed with the sturdiness of the bar and says he would buy it again and has recommended to all of his marines.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Taulbee",
      "helpful_votes": 8,
      "publication_date": 20150817
    },
    {
      "title": "I'm in love!",
      "text": "I find myself sneaking out to the garage to play! We purchased the pull up bar, rings and straps. These pieces transformed our gym! The pull up bar is sturdy. After using our make shift pull up station in our squat rack that moved a ton while performing just about every exercise, this is a dream. I'm just sorry we didn't do it sooner. Installation instructions on studbarpullup.com were spot on. We were missing some of the hardware from a torn box during shipping. Although we ordered through Amazon, Mark from Stud Bar responded within minutes and dropped a new set in the mail. Amazing service! This bar is highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle M. Rodier",
      "helpful_votes": 0,
      "publication_date": 20121229
    },
    {
      "title": "Solid Solid Solid",
      "text": "This is a rock solid pull-up bar that will not budge. I had zero problems with the mounting hardware as the lag screws that came with mine were grade 8.",
      "rating": 5.0,
      "verified": true,
      "author": "johnathon elliot",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Well made and sturdy!",
      "text": "Super well made! Heavy duty! ( best if you have 2 people to install)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Great product, bad hardware",
      "text": "Product is definitely sturdy and should last a long time. Lag bolts are trash and snapped 3 out of 8 during a very careful install following recommended steps from the website.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin C.",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "The sturdiest pull-up bar for your home!",
      "text": "Sturdy!!!!! Love the pullbar and the design. Simple, easy to install. Get yourself a stud finder, I used the magnetic one for 7 bucksz",
      "rating": 5.0,
      "verified": true,
      "author": "704's Reviews",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Small size is perfect for 8 foot ceilings",
      "text": "Small size is perfect for 8 foot ceilings. I have the bar at the 10\" level and it provides plenty of room to get my chin over. Really solid. My new favorite exercise is hanging leg raises.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris G",
      "helpful_votes": 0,
      "publication_date": 20141014
    },
    {
      "title": "Great Product",
      "text": "I wouldnt recommend purchasing from Amazon warehouse deals because too many parts are left out. I would actually recommend purchasing directly from the company. Their customer service is outstanding and they are a small company. Amazon can't issue missing parts so it's a pain. Highly recommend the Stud Bar Pull up Bar. The bar is perfect diameter and it has a good rough grip.",
      "rating": 5.0,
      "verified": true,
      "author": "Allan R. Miller",
      "helpful_votes": 3,
      "publication_date": 20140318
    },
    {
      "title": "High Quality Bar",
      "text": "Nicely engineered quality bar. Lightweight. Not an unnecessarily heavy bar stock. Very nice finish. Installed on 10' finished garage ceiling.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "amazing bar",
      "text": "Great pull up bar. I have 10 ft ceilings and the large was too big(6ft tall), but the small is the perfect height. Pull up bar is rock solid and works great for \"kipping Crossfit pull ups\" and \"toes to bars\". Solid bar and worth the money over cheap door bars.",
      "rating": 5.0,
      "verified": true,
      "author": "PA",
      "helpful_votes": 0,
      "publication_date": 20130122
    },
    {
      "title": "Affordable and sturdy gear.",
      "text": "This is super sturdy. I have it in my home gum for pullup training as well as for hanging a suspension trainer from. The price point is fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie Duran",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Everything I hoped for...",
      "text": "This is everything I hoped it would be. Took me a few hours to install. I think that's fair based on how much weight it can carry and it's small footprint. I absolutely love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Christian Glisson",
      "helpful_votes": 0,
      "publication_date": 20161207
    }
  ],
  "product_meta": {
    "title": "Stud Bar: Ceiling or Wall Mountable Pull Up Bar",
    "description": "Style Name:Standard (9-foot ceilings)The stud bar is the most durable, steadiest, Anchored and safest pull up bar on the market. Easily install as a ceiling mount or wall mount Pull-up bar. Great for traditional pull ups, chin ups or Kipping pull ups. Stud Bar is the original fixed mount ceiling or wall mountable pull up bar. Originally designed with cross fit Kipping pull ups in mind we have a reputation for product sturdiness, and ease of installation into your existing ceiling or wall studs. Stud Bar pull up bars come in three sizes to accommodate different ceiling heights and wall mounting applications. Our mounting holes center on your existing ceiling or wall studs at 48 inches for easy mounting. (Grade 8 wood mounting hardware included). Stud Bar is the original fixed mount ceiling or wall mountable pull up bar. Originally designed with cross fit Kipping pull ups in mind we have a reputation for product sturdiness, and ease of installation into your existing ceiling or wall studs. Our mounting holes center on your existing studs at 48 inches for easy mounting. (Grade 8 wood mounting hardware included). Stud Bar is a commercial grade pull up bar built using welded 14 gauge steel with triangular gussets for added strength.600 lb. Weight capacity. Our cross bar is 1 1/4″ diameter for a comfortable grip and no slip hammertoe powder coat texture that won't tear your hands like knurled bars. We patented our bar to bracket mounting system which is where other bars fall short. Once installed Stud Bar connects to your studs creating a \"square\" which actually increases the strength of your studs by connecting them through the brackets and bar. You will notice how solid your bar feels with no flex or unwanted movement while under load. Stud Bar's 48″ width allows for wide grip pull ups. Accessorize your bar with gymnastic rings and pull up assist bands turning your ceiling into an all in one piece of gym equipment which doesn't occupy valuable floor space when not in use. Lifetime warranty.",
    "rating": 4.7,
    "feature_bullets": [
      "HOME WORK OUT: Great for when you can't make it to the gym. Drill to your wall or ceiling",
      "WIDTH: 48\" width lines up with your existing studs allowing for easy mounting to your existing ceiling or wall studs",
      "HAMMERTONE POWDER: Gym quality welded hammertone powder coated steel 600 lb weight capacity lifetime warranty",
      "ADJUSTABLE: Optional settings allow bar height to be set for optimal reach. 1/14\" bar diameter for comfortable grip",
      "QUALITY BUILT: Sturdiest gym quality pull up bar available all mounting hardware included"
    ],
    "specifications": {
      "Product Dimensions": "4 x 48 x 19 inches",
      "Item Weight": "27.8 pounds",
      "ASIN": "B002X5UNZC",
      "Item model number": "StudBar-standard",
      "Best Sellers Rank": "#21,876 in Sports & Outdoors",
      "Customer Reviews": "4.7 out of 5 stars349 ratings4.7 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer": "Stud Bar"
    },
    "categories": [
      "Strength Training Equipment",
      "Exercise & Fitness",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Pull-Up Bars"
    ],
    "price": 137.56
  }
}