{
  "website_summaries": [
    {
      "verdict": "An affordable option for a beginning lifter.",
      "pros": [
        "Back pad can adjust to five different positions",
        "Leg developer comes with adjustable, padded foam rollers for added comfort and safety",
        "Entire bench is lined with extra padding to keep you comfortable",
        "Bench holds up to 600 pounds"
      ],
      "cons": [
        "The base is made with plastic pieces, so this bench is best for lighter lifters"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Terrifying! Almost decapitated by this pile of junk!",
      "text": "If you bench press more than 100lbs DO NOT BUY THIS WEIGHT BENCH! Its wobbly and badly made. I put 200 lbs on the bench bars and when I put the bar back on after my set it wobbled back and forth and I thought it was going to break off and decapitate me. Seriously! I immediatly boxed it back up and sent it back. Don’t bother with the warranty either because you have to pay for the shipping and it’s more than the machine costs!!",
      "rating": 1.0,
      "verified": true,
      "author": "Seth",
      "helpful_votes": 20,
      "publication_date": 20180610
    },
    {
      "title": "It's a good weight set but I regret purchasing it because you ...",
      "text": "I've had this for 7 months. It's a good weight set but I regret purchasing it because you are limited in exercises you can do with it. You can't really do incline bench because the bar is so close to your head and so far back that it's very awkward to do and not very safe when you get to heavier weights.The assembly was pretty easy to do, but would be best with 2 people. The bench can get a bit wobbly and the height of it is a problem because I can't set my feet down while doing a bench press and I'm 6ft tall.",
      "rating": 3.0,
      "verified": true,
      "author": "Christina mcCutcheon",
      "helpful_votes": 2,
      "publication_date": 20180712
    },
    {
      "title": "Great until it almost killed me...",
      "text": "Great bench and would be 5 stars for the price, with one exception: the bar that connects the bench to the various incline positions has plastic ends. These plastic pieces broke off mid lift on me, causing the bench to go into a slight decline very quickly. I almost dropped 200 pounds on my neck in about half a second. Happened faster than my spotter could react. Very scary moment. If you do buy this, inspect these plastic caps regularly or weld a piece of metal to each position stop so it will catch the bar and not have to rely on the plastic caps.",
      "rating": 2.0,
      "verified": true,
      "author": "Herman9591",
      "helpful_votes": 138,
      "publication_date": 20140430
    },
    {
      "title": "Disappointed",
      "text": "He loved his old weight bench, but needed a new one. This brand had the best reviews. When he first got on it, the seat slipped. Turns out it doesn’t lock well. He keeps it on the flat position just in case and barely uses it because he doesn’t fully trust it.",
      "rating": 3.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 2,
      "publication_date": 20190619
    },
    {
      "title": "My advice- spend a few more bucks on a better designed bench set",
      "text": "Even if you make sure the bolts are re-tightened after the first use- and you should make absolutely sure to do this- you'll find the spotting supports too high even at their lowest level for prone bench presses, too far apart for some barbells, and the seatback is shaky on any point on the adjustable angled rest. The leg attachment is flimsy and floppy as well, but at the price you get what you pay for. As long as you're more careful than normal, you can still get some use out of it. My advice- spend a few more bucks on a better designed bench set, as this became a clothesline really fast because of the safety concerns.",
      "rating": 2.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 3,
      "publication_date": 20150209
    },
    {
      "title": "This is how every assembly guide should be written",
      "text": "I can't (yet) speak to the long-term sturdiness of this unit, but my initial impressions are very favorable. Assembly was a breeze, thanks to the clearly-written and well-illustrated instruction guide. All the various nuts and bolts were clearly labeled and easy to access on a shrink-wrapped board. And the parts had a quality and heft I wasn't expecting at this price point. After assembly, there is zero flex, no gaps in joints - the bench is as solid as a rock. My first impression might change after I use the bench regularly for a few months, but for now I'm happier than I thought I'd be. Well done, Marcy!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Phillips",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Sturdy Yet Affordable",
      "text": "Received bench within expected delivery timetable. Assembly time cut to about one hour with young helper (two adults may do it faster). This unit is reasonably sturdy for average adult (I wouldn't test this out on a pro power lifter) and young adults beginning a lifting program. The uprights are placed wide enough to accommodate a my mildly wider than average grip, but I HIGHLY RECOMMEND buying a 6-foot bar as the inside collars (or the weights themselves) of a 5-foot bar may fall directly on the supports. Those who don't abuse it should receive years of use from this bench .",
      "rating": 5.0,
      "verified": true,
      "author": "chunkycheez",
      "helpful_votes": 0,
      "publication_date": 20141110
    },
    {
      "title": "Sturdy, easy, stable",
      "text": "Actually easy to put together, everything fit correctly and is stable - I'm a BIG guy and it felt stable and strong. Only missing 1 washer, was a standard sized small washer and I had a few in the tool chest so no bih deal. Recommend a 7' bar. Leg bar is for 1\" weights, does have olympic sleeve for 2\" weights if you have that type.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Thompson",
      "helpful_votes": 0,
      "publication_date": 20170304
    },
    {
      "title": "Works for me",
      "text": "Great product. No problems with assembly. Perfect for the space I have. No complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip Campbell",
      "helpful_votes": 3,
      "publication_date": 20180728
    },
    {
      "title": "Junk",
      "text": "When you adjust the seat to do any type if incline the seat shakes like crazy. Its a poor design. I tried putting different things to stabilize it but it is just junk. I would not recommend this.",
      "rating": 1.0,
      "verified": true,
      "author": "T. McFadden",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Bare minimum. Children's bench.",
      "text": "This bench is adequate for about 100 pounds on your bar. It's really kinda scary using it upwards of 200 pounds. An 'Olympic\" bench should handle 300 pounds. I have used this bench to do reps of 210, but there's no way I could max with it. Everything is thin wall tubing. The frame has no real strength. I,m afraid it's going to fail. Definite garage sale item. The leg extension is only usable if you are a child. It's too short for anyone much taller than 5 foot.",
      "rating": 2.0,
      "verified": true,
      "author": "DerekNS74",
      "helpful_votes": 3,
      "publication_date": 20140613
    },
    {
      "title": "Beginner bench",
      "text": "Decent beginner bench for a home gym. It was pretty easy to assemble however I did have to buy an additional bolt for the seat. The pads for the leg extension should be a little bigger as there is a gap between the end and the caps. Also I have tried used a barbell yet but the extension holders don't seem very deep to keep a bar there. Again I haven't tried so I can't say for sure but other reviewers seem to like it. The bench itself isn't very long so I don't really see how people over 6ft would be able to use this",
      "rating": 4.0,
      "verified": true,
      "author": "TechZilla",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Not properly constructed. Couldn't even put it together because ...",
      "text": "Not properly constructed. Couldn't even put it together because on the seat they didn't have the holes properly drilled for the screws. Had to request to return it, get a new one, just to get the part that actually was built wrong. Now have to find a place to mail it back from or pay an extra fee. Ridiculous. The amount of things coming from Amazon now seem to have issues.",
      "rating": 2.0,
      "verified": true,
      "author": "Stephanie McCoy",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "An OK product.",
      "text": "Certainly not the best bench out there, but for the price (got it for $95 over a year ago), It's an OK bench for home use. A bit tall but OK. Assembly was straight forward, I assembled in a little over an hour. All screws and fasteners were included. It's really an OK bench, considering the price too. I will recommend for home use.",
      "rating": 4.0,
      "verified": true,
      "author": "One Customer",
      "helpful_votes": 0,
      "publication_date": 20170419
    },
    {
      "title": "Good for smaller pounds of weight",
      "text": "Good for smaller pounds of weight. I state this because of the adjustable back. The \"prop\" rod for adjusting does not fit deeply enough in the slots. Initially when I used bench when I laid back the rod slipped out of it's groove.Luckily I had not picked up the weight yet. For my confidence I have formulated a c-clamp type clamp for it. Also I feel the backrest should have a wider base to widen the backs support.",
      "rating": 4.0,
      "verified": true,
      "author": "Kenneth B.",
      "helpful_votes": 0,
      "publication_date": 20170219
    },
    {
      "title": "A good bench for the money.",
      "text": "This bench arrived quickly and in good condition. It was the easiest bench to assemble that I've ever owned with hardware all labeled and sealed on a sheet of cardboard. This bench is a perfect fit for my 6 foot olympic bar. I've not encountered any problems yet, but the uprights seem a bit flimsy and the cradle for the bar is made of pretty thin metal. I'm done with any super heavy power lifting and not about to push it to the limit. It's held up fine and I'm happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "aperature",
      "helpful_votes": 0,
      "publication_date": 20140405
    },
    {
      "title": "Good value for modest weight",
      "text": "Solid for the money. Certainly not the best, but hard to beat at the price. Just replaced it after 5 years. Raising and lowering the bar can be a bit challenging if you're in a hurry. If you're using > 135 lbs in the incline position, it can be a bit unstable at the top. Overall, I think that this is a great value, but might not be for you if you are lifting lots of weight.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Bubb",
      "helpful_votes": 0,
      "publication_date": 20160828
    },
    {
      "title": "Not too stable",
      "text": "I gave this 2 stars because the barbell stand isn’t that stable, even tho it’s attached to the bench. It wasn’t hard at all to assemble.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Great for the price, though it's not the most height-friendly",
      "text": "I've been using it for a little under a year, a couple observations: 1) The backrest isn't the most confidence-inspiring, you can feel it wobble a little bit 2) It could stand an extra couple inches here and there - I'm 6'2\", and I can't do leg extensions unless the backrest is down and I have the whole bench raised. Similarly, when doing presses, my crotch is right on the hinge for the leg stuff. Still, it's a great bench for anyone looking for a home gym on a limited budget. Give yourself about an hour to assemble.",
      "rating": 4.0,
      "verified": true,
      "author": "Little John",
      "helpful_votes": 0,
      "publication_date": 20131120
    },
    {
      "title": "Terrible for any incline.",
      "text": "If you are looking to buy a bench for simply flat press, then you may be ok as long as you're on the taller side. This bench sits pretty high due to the leg curl function. Additionally, the bar stand sits VERY far back and makes it IMPOSSIBLE to lift the bar with any weight off of the rack. I literally just spent an additional 60$ to buy a separate squat stand set so that I can do incline press. Save your money and buy a different bench.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "Great workout bench",
      "text": "Great workout bench! It was the best deal I could find. The seat and the back support came in damaged but when I called the company they sent me the replacement right away. Apparently, the back support was interchangeable with Marcy product (That's what they sent me). Also it was quite easy to assemble it.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Richard Lee",
      "helpful_votes": 6,
      "publication_date": 20150612
    },
    {
      "title": "Used Bench Sent As New",
      "text": "I can't recommend purchasing this product. I bought new and when it arrived, I found used and scratched parts mixed with new parts. The seat was dirty and the back stiching was coming undone. Also animprint was across the back of the seat in a straight line which looked like it had been assembled used then repackaged as new. I can't comment on the actual assembled product since I have requested a return on this item.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170608
    },
    {
      "title": "Great bench, Great price...",
      "text": "Easy setup, easy guide to follow , bench was exactly like the picture and and exactly as it was was detailed. If you put it together the right way and use the proper ranch which is the only thing not included with this kit, the bench is super sturdy. If have to say for the price of a 100 dollar bill this would be the best bench you can buy off amazon. And I recommended it to anyone reading this..",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "Like a bench at the gym.",
      "text": "Nice and solid. The legs that hold the bar are a little wobbly, but only when moving the bench around the room. Other than that its great",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Great buy",
      "text": "I just set this up today and am really excited about it after doing a few sets. I was worried about 2 things: 1. Some reviewers posted it didn't lay flat. Maybe it's 1 degree inclined, but it felt flat to me. 2. My last bench press' supports were too close together for my wide grip, so it would pinch my hands. This one is comfortably sized almost as wide as a regular gym press. Overall, very happy. It was 98 dollars!",
      "rating": 5.0,
      "verified": true,
      "author": "REVIEW JUSTICE",
      "helpful_votes": 0,
      "publication_date": 20140821
    },
    {
      "title": "Seams like any other bench below $100",
      "text": "So far I have only set it up and used it once. My initial opinion is that it is very flimsy considering the weight it claims to hold. But I also understand you get what you pay for. So if it lasts a couple years without serious bodily harm to anyone I would consider I got my moneys worth.",
      "rating": 3.0,
      "verified": true,
      "author": "Rebecca Lockhart",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "Everything went together fine for me",
      "text": "Everything went together fine for me. Just make sure everything is lined up correctly and you tighten the nuts as far as they will go. No wobble anywhere on mine. I weigh 270 and I have almost 300lbs on the bar. Everything works as advertised for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Harris",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Five Stars",
      "text": "great for personal use, like it not for heavy weights.",
      "rating": 5.0,
      "verified": true,
      "author": "Russ & Dana Snow",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Pretty good product.",
      "text": "Not bad at all. Just surprised how much the frame moves when when weights are on. Was hoping for just a little more sturdiness but overall it is a good product and should serve my purposes just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Max Hazen",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Not a well built product, maybe good if u only lift 100 pounds.",
      "text": "Very cheap bendy weight bench. Didn't hold much weight and I thought I would die if I put more than 100 pounds on it. It was so cheap in cost however I already donated it to goodwill and bought a better one. Probably would of been better if the bar that goes between the two pillars was thicker, or if there was a second support. Steel was very thin.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20150505
    },
    {
      "title": "Great!",
      "text": "Love the product. It wasn't difficult to assemble, and it seems very sturdy. Iwould have given it 5 stars, but there are 2 issues that should be recognized. First, I would definitely recommend a spotter because the ledge where the bar rests is not secure, and the bar could easily slip forward. It doesn't have a high 'lip' on the front of it, so if you quickly drop the bar back into place, it is possible for it to slip off. Secondly, I wish the seat tilted, especially when doing incline. I notice that I slide a little when lifting on an incline, but sitting on a pillow has proven to resolve this issue. Overall, I am definitely very satisfied!!",
      "rating": 4.0,
      "verified": true,
      "author": "Debbie P",
      "helpful_votes": 0,
      "publication_date": 20130809
    },
    {
      "title": "Competitor CB 729 Olympic Weight Bench",
      "text": "I got this bench back in 2012 and I still use it today 2018. If put together right this is a great bench for someone who wants to pack on some muscle.",
      "rating": 5.0,
      "verified": true,
      "author": "PushSaharaX",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Great bench for the beginner and intermediant Strength Trainer",
      "text": "But it doesn't hold a regular 6 foot BBell unless you insert 1\" PVC on both ends (I did that cutting off about 2 inches of PVC pipe.) But if you have a 7' bar, you'll be fine! I bought this on sale forabout $90. I wish I would have bought 3 of them at that price and sold the other 2 for more. Great bench. Compare to what people are selling on Craigslist!",
      "rating": 4.0,
      "verified": true,
      "author": "ITCHY EGO",
      "helpful_votes": 0,
      "publication_date": 20131231
    },
    {
      "title": "good quality material",
      "text": "This unit is built solid and has a wide stance, good quality material, easy to put together. The only reason I didn't give it 5 stars was that it's a little to high off the floor. I'm six foot and while laying flat I can barely touch my feet to the floor. No big deal, too bad the height of the whole unit couldn't be adjustable.",
      "rating": 4.0,
      "verified": true,
      "author": "Ted",
      "helpful_votes": 0,
      "publication_date": 20150222
    },
    {
      "title": "GREAT BUY!!",
      "text": "I was able to get this bench for $ 84 used from the Amazon Warehouse where it was returned for some reason- it looks like new. I have Amazon Prime so the shipping was free. Unlike most benches in the price range it has a capacity of 600lbs minus the weight of the user and that is plenty for most all lifters. It does not creak and wreak when using 250-300 pounds.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen R. Herndon",
      "helpful_votes": 0,
      "publication_date": 20131227
    },
    {
      "title": "Sturdy bench",
      "text": "I have had this bench for about a year and it is still holding up without a problem. It holds up to 300+ lbs without a problem. I haven't pushed the limits beyond 350 yet, but I believe it should hold up nicely. Considering I weigh about 210 and then bench 300, not bad for this bench. I would highly recommend this bench.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Dependability",
      "helpful_votes": 0,
      "publication_date": 20140107
    },
    {
      "title": "Great for price but I should of invested a few ...",
      "text": "Great for price but I should of invested a few more dollars and got a better bench back piece broken within a year so holding it up with a piece of wood not the safest until we get some $ to buy new one",
      "rating": 3.0,
      "verified": true,
      "author": "Rina",
      "helpful_votes": 0,
      "publication_date": 20170422
    },
    {
      "title": "Perfect bench",
      "text": "This bench has an amazing price tag for what you get. Assembly was less than an hour by myself, and it is extremely sturdy and in no way wobbly. The bench does rest completely flat and doesn't have a slight incline as others have stated. I'm very happy with my purchase :)",
      "rating": 5.0,
      "verified": true,
      "author": "Paulina",
      "helpful_votes": 0,
      "publication_date": 20141009
    },
    {
      "title": "we give this a 5 for excellent quality at a super low price",
      "text": "Despite having one bolt the wrong size, we give this a 5 for excellent quality at a super low price. Use it daily.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Snook",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "It's a bench. It works. And it's cheap.",
      "text": "This is just a straight forward solid reliable functional bench for a really cheap price. Sure you'll have to figure out how to best situate your body when laying on it (I'm 5'6\" and feel no discomfort) and it may not be delivered in perfect condition (the underneath of my seat was a bit torn upon opening the box), but it works. Even the leg section works just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Kolius",
      "helpful_votes": 0,
      "publication_date": 20140504
    },
    {
      "title": "Great bench and great price",
      "text": "Great bench and great price! My husband and I have been using this everyday since we got it with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "marlena smith",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "use caution when purchasing this",
      "text": "finally putting it together. has been unopened in box since purchasing due to lack of space to set it up.. discovered upon opening it the seat is ripped and had to have been packaged that way. upon reading side of box it says phase 2 complaint for formaldehyde. lovely huh?",
      "rating": 3.0,
      "verified": true,
      "author": "mamabearx5",
      "helpful_votes": 0,
      "publication_date": 20150124
    },
    {
      "title": "Well built, reasonably priced...",
      "text": "Just had to put up a review here. I normally don't bother. But this is a great starter bench. It's well built. It won't work for really heavy lifting. But for the vast majority of people, it's more than adequate. Also, don't let the lower star ratings fool you. Most of those seem to be for damage while shipping. While that is inconvenient, it doesn't undermine the quality of the product. Maybe I was lucky, but I only had some minor damage to the packaging. I also did standard 3-5 shipping and it arrived in two days. Yet again, Amazon rocks!",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Scott",
      "helpful_votes": 0,
      "publication_date": 20140411
    },
    {
      "title": "Perfect Choice",
      "text": "Had this bench for just over two months now. I use it every other day, and its just as sturdy as the day I put it together. Keep in mind however I've never used the leg exercise portion of the bench. I'm 6 foot tall and it fits me just fine, def not a junior bench which you can see in this price range. Easy to put together, did it alone in about two hours. Quality of the steel is high, absolutely no complaints. Oh, and my rep weight is up 50 lbs =)",
      "rating": 5.0,
      "verified": true,
      "author": "S. Lissow",
      "helpful_votes": 0,
      "publication_date": 20130725
    },
    {
      "title": "recommended",
      "text": "well built item and reasonably priced, as long as you opt to pot it together yourself....",
      "rating": 4.0,
      "verified": true,
      "author": "Fredric F. Myers",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "Poor quality",
      "text": "One of the lock knobs was broken. (A really bad design with a nut that is loose inside a molded plastic knob with no way to re-thread it if it comes apart - without cutting the knob in half???) The paint is flaking off. It's not that sturdy either. The price is really the only thing that gives it 3 versus 2 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike in Downingtown",
      "helpful_votes": 0,
      "publication_date": 20130828
    },
    {
      "title": "Arrived in quick fashion!",
      "text": "Nice product! You get what you pay for. It's inexpensive and it's made that way although I would say it has a good design. The barbell stand is hard to raise and lower. And the bench doesn't recline flat. It has a slight incline with your head being higher than your waist. No big deal but when you go to work out your hamstring you better not have as big of a belly as I, because the bench has that slight incline.",
      "rating": 4.0,
      "verified": true,
      "author": "Julie Hendricks",
      "helpful_votes": 0,
      "publication_date": 20131015
    },
    {
      "title": "happy but def not satisfied",
      "text": "when i received the product i didnt open it till 3months after purchas to find out the bolts didnt match with the holes, i gave it 2 stars b/c they were willing to refund me back my money after such a long period of time",
      "rating": 2.0,
      "verified": true,
      "author": "Mr F",
      "helpful_votes": 0,
      "publication_date": 20150224
    },
    {
      "title": "You get what you pay for",
      "text": "I purchased this for my little brother and it works well for him. I would not put more than a couple hundred pounds on this since it will get wobbly. If its under 200, it is wobbly but it seems to be strong enough for that weight. If you bench more than 200+ lbs, i would try and find a sturdier bench.",
      "rating": 3.0,
      "verified": true,
      "author": "Cal",
      "helpful_votes": 0,
      "publication_date": 20131006
    },
    {
      "title": "nice for less then 100 bucks!!",
      "text": "This thing is pretty sturdy!!! if you put this together correctly, you will use every single part! and it goes together nice and tight.for less than 100 bucks, this was a Really good buy! i did however, glue two nice, soft square pieces of fabric were you lay the bar across so i doesnt scratch up anything!",
      "rating": 5.0,
      "verified": true,
      "author": "Republican",
      "helpful_votes": 2,
      "publication_date": 20120319
    },
    {
      "title": "Could be a lot better designed",
      "text": "The seat is way too high for proper benching. Your legs will be nowhere near the ground. I suggest getting cement blocks or books or anything your can stack up to set your feet on. Also, the connection of the bottom (under the seat) to the crossbar that goes to the uprights is never super tight. So my machine wiggles a lot- making me nervous when I bench. At the same connection- the connection is not center. Every time I go to bench the seat is off center of the uprights which messes with my head and balance. So honestly, it works, but I would much rather have a better bench.",
      "rating": 3.0,
      "verified": true,
      "author": "Laredo Williams",
      "helpful_votes": 0,
      "publication_date": 20150304
    },
    {
      "title": "Satisfied af",
      "text": "Extremely happy with this one. Bought a cheap one a few months ago and got what I paid for when it fell apart under pressure. Sturdy and wide grip Olympic bench. Pretty easy assembly.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20160911
    },
    {
      "title": "Quality product.",
      "text": "This is the first weight bench that I have personally owned. I was looking for a cheaper one and this had everything I wanted. The parts seem to be well-made and I enjoyed putting it together. However, as this is an oympic bench, I would advise people with non-olympic bars considering this bench to make sure the distance between collars on their bar is longer than the distance between the outside edges of the bench's posts (I had to buy a new bar that had shorter ends because of this).",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20140314
    },
    {
      "title": "Great For the Price",
      "text": "Perfect for the price. I use it for bench pressing in my home gym. I read reviews that the bench isn't completely flat but mine does. If it is inclined it is such a fraction of a difference that I can't tell. It's great for a starter or even intermediate bench press. The leg attachment is a little cheap but it works. Like I said...Great for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "deliveryguy317",
      "helpful_votes": 0,
      "publication_date": 20140906
    },
    {
      "title": "Standard bench",
      "text": "This is a nice bench. It arrived on time. However, the part that holds up the bottom part of where you lay down, was bent horribly. My husband was able to bend it back to the right spot so we didn't need to return it. Also, the little plastic black plug that is supposed to go into the leg part was broken so we aren't able to use it. One other thing we didn't like about it is that rest doesn't slide back and forth so when you have the chair inclined, the actual bar is quite a bit behind your shoulders. This makes you prone to injury when there is alot of weight on the bar.",
      "rating": 3.0,
      "verified": true,
      "author": "jmcreynolds",
      "helpful_votes": 0,
      "publication_date": 20130415
    },
    {
      "title": "it worked good so far",
      "text": "Bought this 3 months ago. it worked good so far. However, the back pad gets broken WHILE I'M DOING BENCHPRESS today!!! IT ALMOST KILLED ME!!! Don't buy this terrible made in China.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170328
    },
    {
      "title": "not bad for the price",
      "text": "not bad for the price. but I would not call this a competitor bench. made with thin metal and the bar hooks are too shallow with heavy weight I fear they will bend and come down on me",
      "rating": 4.0,
      "verified": true,
      "author": "tim triggs",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "Needs better quality control",
      "text": "The bench portion you lay on has two threaded areas to screw it to the frame, my bench was missing threaded insert where you rest your head so it is unstable which is dangerous if you put heavy weight and try to bench press. Item is too big to ship back so ill have to try and rig this together somehow",
      "rating": 3.0,
      "verified": true,
      "author": "miguel roman",
      "helpful_votes": 0,
      "publication_date": 20140516
    },
    {
      "title": "He trains heavily with is buddy and they say it does the job great.",
      "text": "I bought this for my husband after our boxer dog ate his seat on his other one. He absolutely loves it. He trains heavily with is buddy and they say it does the job great.",
      "rating": 5.0,
      "verified": true,
      "author": "amoss42268",
      "helpful_votes": 0,
      "publication_date": 20160225
    },
    {
      "title": "Decent for outdoors",
      "text": "I really like this. I put this outside and got lazy and stopped putting a cover on it, and it's held up pretty well in the rain, although some of the screws did rust a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "freeradical",
      "helpful_votes": 0,
      "publication_date": 20160121
    },
    {
      "title": "Its a nice bench, I use it 2x a week",
      "text": "Its a nice bench, I use it 2x a week. Its pretty solid but I do wish I would have saved up for a nicer one",
      "rating": 4.0,
      "verified": true,
      "author": "Mr Jonathan",
      "helpful_votes": 0,
      "publication_date": 20160417
    },
    {
      "title": "Good bench",
      "text": "This weight bench is easy to put together and works like it is supposed to. Very sturdy, although it does wobble a little due to the amount of weight I put on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. O",
      "helpful_votes": 0,
      "publication_date": 20160223
    },
    {
      "title": "Decent Bench",
      "text": "I wanted something that wasn't the cheapest, yet wasn't going to cost a fortune. I'm only 5'1 (and female) and this has done the job for me. The box was quite a mess upon delivery, but it was fairly easy for hubby & I to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle R. Vickers",
      "helpful_votes": 0,
      "publication_date": 20140127
    },
    {
      "title": "Not good",
      "text": "Two points: 1. The seat quality is lacking. It even arrived with a tiny tear that is barely noticeable but you know that tears can easily extend. 2. Most important: The bench is not wide enough to hold a bar with multiple weight disks. It is okay when the bar has only one weight disk (each side), but if I try to put more weights then you notice that the bench holder is not wide enough to accommodate for the disks. Too bad!",
      "rating": 2.0,
      "verified": true,
      "author": "Mohammad",
      "helpful_votes": 0,
      "publication_date": 20150308
    },
    {
      "title": "Not exactly what I expected",
      "text": "This works for what I need. However, I have 2 teenage sons and I worry a little bit because it's not nearly as sturdy as it could or should be for the weight they lift. It does the job though and I've been happy with it.",
      "rating": 3.0,
      "verified": true,
      "author": "ssymms",
      "helpful_votes": 3,
      "publication_date": 20121123
    },
    {
      "title": "Excellent Quality",
      "text": "I received the Marcy Conpetitor weight bench via UPS. The package was undamaged and all the parts and pieces were included. The instructions are easy to follow. I am impressed by its sturdiness. I will be researching other Marcy products for future purchases.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Harrison",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "This is a great benchpress that doesn't cost a fortune",
      "text": "This is a great benchpress that doesn't cost a fortune. The only problem is that you may have to buy a separate bar, however, it is comfortable and easy to set up.",
      "rating": 5.0,
      "verified": true,
      "author": "Jojothemoose",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "Great workout bench",
      "text": "I just recently started working out about 3 months ago. I am a hard core runner so I am skinny and have turned my workouts to more upper body arms,shoulders, back, chest etc. This bench is sturdy and was very simple to put together. My roommate has more time in his day and loves it as well. The only downfall was I purchased the golds weights and bar wasn't long enough but thankfully I had a friend who gave me his so make sure you purchase a long enough bar.",
      "rating": 5.0,
      "verified": true,
      "author": "Budster",
      "helpful_votes": 0,
      "publication_date": 20140226
    },
    {
      "title": "One Star",
      "text": "Would not buy again. The leg press area is uncomfortable.",
      "rating": 1.0,
      "verified": true,
      "author": "mpm",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "good",
      "text": "I weigh 130 and the most i bench is 110 or so and it all feels pretty solid, more forward and backward movement than id like but that probably is true to most benches this price",
      "rating": 5.0,
      "verified": true,
      "author": "el jeffe",
      "helpful_votes": 0,
      "publication_date": 20150812
    },
    {
      "title": "Nice Weight Bench easy to put together",
      "text": "Nice Weight Bench easy to put together. Seems solid enough. Unfortunately the bar in the weight set we purchased is just a bit too short - oh well, still able to use it.",
      "rating": 4.0,
      "verified": true,
      "author": "Wauchula",
      "helpful_votes": 0,
      "publication_date": 20150711
    },
    {
      "title": "Weight Bench",
      "text": "If your looking for a good quality Olympic Bench, this is the one, well built, using nice big bolts, Square and tube steal construction, this bench will not buckle, It will hold what you can lift and then some. Get lifting. RAM.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick M.",
      "helpful_votes": 0,
      "publication_date": 20140509
    },
    {
      "title": "Great Bench!",
      "text": "For some reason the shipping was crazy fast, I got it the day after I placed the order. The bench is really easy to set up, took me under an hour to do it and start using it. Had no issues using it for incline sets or leg sets. would recommend to anyone looking for an awesome bench!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Magana",
      "helpful_votes": 0,
      "publication_date": 20140520
    },
    {
      "title": "Bought this as a christmas present",
      "text": "And my dad is blown away with it. Loves it. He says it is completely changing up his work out. He lifts 350 off the bar. The seat is comfortable and it really steady and handles the weight well. Great buy for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisanator",
      "helpful_votes": 0,
      "publication_date": 20131230
    },
    {
      "title": "very flimsy",
      "text": "The bench will tip backwards very easily with weight on the bench. Very dangerous for anyone working out alone. The lip to catch the weight bar is very mild and it seems like the bar will slip right off onto whoever is working out. I wouldn't trust this bench with much more than 225lbs on it (and you need a spotter right there to watch the weight on this bench). I would not recommend this at all. Very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20130619
    },
    {
      "title": "The bench is great. It doesn't lay 100% flat",
      "text": "The bench is great. It doesn't lay 100% flat, but not an issue for me, it lays almost completely flat. I bought a 6 ft bar at Dick's Sporting Goods to go with the bench. I highly recommend buying a 7ft bar. The 6ft bar leaves no wiggle room for placing the weights back on the uprights. It must go on perfectly, and the weights will kiss the uprights. BUY a 7ft bar!!",
      "rating": 4.0,
      "verified": true,
      "author": "James C. Burns",
      "helpful_votes": 0,
      "publication_date": 20160430
    },
    {
      "title": "Five Stars",
      "text": "For the price it's great, the build materials are pretty mild but whatever. Beats paying for a gym membership.",
      "rating": 5.0,
      "verified": true,
      "author": "William D.",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "Solid Bench, exactly what I was looking for!",
      "text": "This is a solid bench for beginners, I wouldn't go lifting obnoxious amounts of weight, but with a couple hundred it seems very stable. Took about an hour or so to put together. You can't beat the quality for the price",
      "rating": 5.0,
      "verified": true,
      "author": "NJW",
      "helpful_votes": 0,
      "publication_date": 20130720
    },
    {
      "title": "good and sturdy",
      "text": "this is a good value bench for a beginnner but I wish they had made the bench adjustment a little better its to easy slip out of the retaining slot exspecially on the lowest setting which makes me a little uneasy at times",
      "rating": 3.0,
      "verified": true,
      "author": "Ali",
      "helpful_votes": 0,
      "publication_date": 20130427
    },
    {
      "title": "Good",
      "text": "We received the weight bench, and I absolutely love it! It is easy to assemble, and it does not take a lot of space. I am happy with my purchase! Will be buying from Competitor again!",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20140910
    },
    {
      "title": "Nice bench",
      "text": "Easy to set up, all parts were there. The vertical arms and cradle that hold the bar in place could be a little beefier. But for me, and the money, it's a good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark in VT",
      "helpful_votes": 0,
      "publication_date": 20150301
    },
    {
      "title": "Like the other review say it's great for the money",
      "text": "Like the other review say it's great for the money. I also took the advice of one of the other reviews and cranked down the screws with my own tools and it's feels nice and solid. Good enough for my needs. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "John Allen",
      "helpful_votes": 0,
      "publication_date": 20140929
    },
    {
      "title": "Skip it, invest in something better.",
      "text": "I got it cause it was cheap and I wasn't sure of my commitments now I wish I would of spent more money. The construction is shoddy, the arms move, and the back of the seat wobbles.",
      "rating": 2.0,
      "verified": true,
      "author": "jason",
      "helpful_votes": 3,
      "publication_date": 20140301
    },
    {
      "title": "Can't beat it for the price",
      "text": "Got this for my dad as a gift. Put it together quickly, but would have been 10x if I could find my ratchet set! In any case, this bench is super solid and for the price it has everything you need.",
      "rating": 5.0,
      "verified": true,
      "author": "MD",
      "helpful_votes": 0,
      "publication_date": 20140111
    },
    {
      "title": "Weak Back Board",
      "text": "This is a really good bench, but some of the parts seem to be made of plastic on the backboard seat that adjusts up and down. The 1st day of use mine broke. I found a metal piece here at home and wedged it in where the plastic piece broke to hold the backboard up and now it stays up fine for me. So not perfect but a good product.",
      "rating": 3.0,
      "verified": true,
      "author": "Sharra K. Kliebenstein",
      "helpful_votes": 0,
      "publication_date": 20140121
    },
    {
      "title": "Did not receive the right product",
      "text": "I received a huge roll of landscape cloth NOT a weight bench:(",
      "rating": 1.0,
      "verified": true,
      "author": "Rizza McWhorter",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Leg developer seems to work good. The bench is sturdy though but it's just ...",
      "text": "Bench isn't as advertised. You can't do decline. Flat bench press it's perfrct. Doing incline is a struggle due to after you raise the arms up and set up for incline the bar is behind your head. To much weight during incline the front of bench lifts up. Leg developer seems to work good. The bench is sturdy though but it's just a basic bench. I wouldn't have bought it if I knew I couldn't decline or comfortably incline.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeremiah Samela",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "Seems very sturdy, was really simple to put together",
      "text": "Seems very sturdy, was really simple to put together. Do need a right sized wrench/ratchet however, so be aware of that. Other than that, very good bench with nice wide uprights, unlike many others",
      "rating": 5.0,
      "verified": true,
      "author": "BK117",
      "helpful_votes": 0,
      "publication_date": 20150510
    },
    {
      "title": "Great for the price point and for beginner lifters but ...",
      "text": "For a beginner lifter this has exceeded my expectations for the price point. My main concern is the construction of the adjustable lever. Make sure it is fully seated in the desired position before each lift. I will eventually buy another bench but not this one. Great for the price point and for beginner lifters but I will spend extra money for a more solid bench.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason C.",
      "helpful_votes": 0,
      "publication_date": 20150720
    },
    {
      "title": "Need to be better",
      "text": "One problem i found is that adjusting the height of the weight holder bar seems difficult. the holder's screw is not good that can't stand in its position.",
      "rating": 3.0,
      "verified": true,
      "author": "amudhan",
      "helpful_votes": 0,
      "publication_date": 20150307
    },
    {
      "title": "Great for the price.",
      "text": "We are really happy with this item. Was pretty easy to put together and nothing was damaged when it arrived. My boy is 250 and lifts quite a bit of weight and have had no problems with it so far. We've had this bench for almost a month and are very pleased with it. Was not expensive and does the job it was made for. I would suggest it to anyone who is starting out to get this. Even those who have been lifting for a while. It takes up to 300 pounds. Great piece of equipment!",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine A. Coddington",
      "helpful_votes": 0,
      "publication_date": 20130921
    },
    {
      "title": "I would definitely buy this again",
      "text": "I bought this for my husband he uses it every day and loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Devin Russo",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Great Bench!",
      "text": "This bench is amazing! For the price, there is no other bench to consider. This bench is durable. I have been using this bench for over two months with at least 200 lbs, and it has not failed at all. I would definitely by this item again.",
      "rating": 5.0,
      "verified": true,
      "author": "DG",
      "helpful_votes": 0,
      "publication_date": 20121223
    },
    {
      "title": "Great",
      "text": "Very sturdy product easy assembly doesn't tip. Very wide for bars. The bars advertised that customers also bought does not fit. Too short. Very happy with purchase. Just bought longer bar",
      "rating": 5.0,
      "verified": true,
      "author": "Sherri1728",
      "helpful_votes": 2,
      "publication_date": 20120314
    },
    {
      "title": "Good product at a fair price.",
      "text": "Good value for the money. I lift a few times a week and this does the job. Back support wobbles a little when in use, but nothing that affects my workout.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff of Richland",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "I feel the alignment of the back rest & the bar bell holder should be adjusted better",
      "text": "Works OK. I feel the alignment of the back rest & the bar bell holder should be adjusted better",
      "rating": 3.0,
      "verified": true,
      "author": "David R. Jacques",
      "helpful_votes": 0,
      "publication_date": 20160219
    },
    {
      "title": "0 Degrees from Horizontal",
      "text": "Took 30 minutes to setup with socket wrenches. Sturdy enough for me. Bench lays perfectly straight (0 degrees from horizontal). Took 2 days to deliver with prime.",
      "rating": 5.0,
      "verified": true,
      "author": "sRobot",
      "helpful_votes": 0,
      "publication_date": 20140704
    },
    {
      "title": "Great metal! Doesn't move at all except the seat ...",
      "text": "Great metal! Doesn't move at all except the seat a little. Very sturdy and a good bench to do multiple things with!",
      "rating": 5.0,
      "verified": true,
      "author": "Herr Woss",
      "helpful_votes": 0,
      "publication_date": 20150917
    },
    {
      "title": "NOT what I expected",
      "text": "This weight set seemed like a good one and with a alright price I thought Id give it a shot. Put it together put some weights on and that s*** wobbles it does not look sturdy at all I barely have 113 LBS. I don't know they say it can handle 300 LBS when it wobbles like crazy. 300 LBS??? it'll probably shred it to pieces!!! Buyer beware DON'T BUY!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "RAUL.C",
      "helpful_votes": 0,
      "publication_date": 20140617
    },
    {
      "title": "Decent Bench",
      "text": "I am 6\"3'. 200LBS. The legs Quad lifts are tricky to maneuver, along with hamstring curls but, I adjust and focus on the muscle, not where the cushions are placed on my calves. The bench fits in a small room. Easy to assemble. Need a wrench. Took me about half and hour to assemble after unpacking. On a tight budget, this is a good buy. Sturdy when I press heavy bench presses.",
      "rating": 4.0,
      "verified": true,
      "author": "The Hoppe",
      "helpful_votes": 0,
      "publication_date": 20140215
    }
  ],
  "product_meta": {
    "title": "Marcy Competitor Adjustable Olympic Weight Bench with Leg Developer for Weight Lifting and Strength Training",
    "description": "Tone your body as if it’s summer every day and get the total home-gym workout with this exceptional all in one Olympic weight bench by Marcy. The Competitor Olympic Bench has a multi-position back pad that can be altered to suit your workout routine. It has independent, adjustable-height crutches with quick-release pop-pin knobs to match ideal training position while providing maximum comfort and safety. The multiple seatback positions let you perform many different training exercises. Work out in chest, decline, military, and incline lifting positions with this weight bench. Train not only your upper body, but your lower limbs too. The bench has a dual-action leg developer to help you strengthen the lower parts of your body. It also comes with padded foam rollers for all-out comfort on the ankles and knees. Build up your lower-limb muscles with leg extensions and flat-leg curls using this ergonomic exercise equipment. This weight bench has 2-inch thick pads made with high-density foam padding to help you exercise comfortably. It supports the body in reducing muscle fatigue during workouts. The foam padding boasts outstanding stability, endures a lot of pressure, and is guaranteed to resist heavy lifting. The Marcy Competitor Weight Bench’s heavy-duty steel-tube frame and durable powder-coated finish provide great resiliency. You can perform a wide range of exercises routine on this bench. Its foam-roller pads are specially contoured to support your knees and ankles so you can do leg crunches, curl-ups, and other leg and ab exercises. Develop your major lower body muscle group as well as your upper body. The Competitor bench requires minimal floor space compared to other benches on the market. Build a healthier body and firmer muscles without hitting the gym!",
    "rating": 4.3,
    "feature_bullets": [
      "5-POSITION ADJUSTABLE BACK PAD – The Competitor Olympic Bench has a multi-position back pad that can be altered to suit your workout routine. It features independent, adjustable-height crutches with quick-release pop-pin knobs to help you find your ideal position. Perform many different training exercises with the bench’s various configurations, such as chest, decline, military, and incline lifting positions.",
      "DUAL-FUNCTION LEG DEVELOPER – This bench has a dual-action leg developer to boost your lower body. It also comes with padded foam rollers for maximum comfort on your ankles and knees.",
      "HIGH-DENSITY FOAM PADDING – Marcy’s Competitor Bench is made with thick 2-inch pads to let you exercise comfortably. It also supports the body to reduce muscle fatigue during workouts. The foam padding boasts outstanding stability, endures a lot of pressure, and is guaranteed to resist heavy lifting.",
      "OLYMPIC-WEIGHT PLATE POST – This bench has high-density upholstery and can hold up to 600 pounds. Olympic-sized weight plates can be used with it as well.",
      "COMFORTABLE FOAM ROLLERS – The foam roller pads are specially contoured to support your knees and ankles. Develop your major lower-limb muscle groups while you tone your upper-body muscles. You can perform a wide range of exercise routines on this weight bench."
    ],
    "specifications": {
      "Date First Available": "January 14, 2020",
      "Manufacturer": "Marcy",
      "ASIN": "B083V8LK2M",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Strength Training Equipment",
      "Exercise & Fitness",
      "Benches",
      "Sports & Outdoors",
      "Olympic Weight Benches",
      "Sports & Fitness"
    ],
    "price": ""
  }
}