{
  "website_summaries": [
    {
      "verdict": "The Canon PowerShot SX20 IS is a solid, but not standout, megazoom option for the money.",
      "pros": [
        "Solid battery life",
        "articulating LCD",
        "comfortable shooting design",
        "can zoom during movie capture",
        "hot shoe",
        "exceptionally close macro focus"
      ],
      "cons": [
        "Slower than its predecessor overall",
        "no raw support",
        "images soft and noisy as low as ISO 80"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 8.0,
        "Performance": 7.0,
        "Image quality": 7.0
      },
      "publication_date": 20091215,
      "rating": 7.4,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Last of its kind",
      "text": "I bought this to replace my other one after I dropped it on a stone floor and damaged the viewfinder. I love this camera; it's one of the last models that has a viewfinder as well as an LCD screen. The LCD screen is nice, but impossible for me to see outdoors. I bought my original PowerShot in 2010 and took thousands of photos with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Briddie",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "A great vintage camera that is still a winner today",
      "text": "A great bridge camera with pleanty of reach. I've used a ton of Canon Powershot machines,and can say that this one has been fantastic. It has everything you need to create great results. The EVF is great when you're in the sun and can't see anything on the screen. For the money, it's a great machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Eddie Risbergs",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "good older digital camera-- reminds me of the old 35mm film cameras -- but",
      "text": "heavy older camera that takes great photos, yes I like it only thing it is not as the photo-- it did not have the extra guard around the lense type that I bought-- it OK, just wish the camera matched the photo",
      "rating": 4.0,
      "verified": true,
      "author": "Tracey D.",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Fantastic features and photos for the money- killer video capability",
      "text": "Did a lot of research before buying, wanting a feature rich camera close to $300. A fairly large well-built camera packed with features and excellent photo quality usually reserved for much more expensive cameras. Easy to use point and shoot, but has a lot of really advanced features, if you know how to use them all. The hi powered zoom really brings in distant scenes, beautiful photos and outstanding video capabilities. The image stabilization really works well too. Bought it for my daughter, but nearly bought another for me. Should be able to find it around $300-$329. Definitely recommend for the low price and it's a Canon.",
      "rating": 5.0,
      "verified": true,
      "author": "Veloosh",
      "helpful_votes": 3,
      "publication_date": 20101130
    },
    {
      "title": "Love it, but wish the sports function response was quicker",
      "text": "I have had this camera for about a year now. I love it, but purchased it specifically to capture my boys playing soccer. Unfortunately, the shutter opens and closes too slowly for me to keep the focus on my kids as they run up and down the field. I have now purchased the Canon rebel and the reaction time is much quicker for this purpose. However, I still love this camera since it takes great/clear pictures and has an amazing zoom. With this camera, I can use it for other, slower-moving sports (like baseball), and for everyday uses without the need to replace the lense. I highly recommend the camera -- just not for the sports feature.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Weber",
      "helpful_votes": 2,
      "publication_date": 20110905
    },
    {
      "title": "Looking for an alternative to the big expensive cameras?",
      "text": "I've used this camera for several years and bought a used one to replace my old one when the flip out display died. This camera has many features which I love - 20X optical zoom, Image Stabilization, etc. But the flip out display is the top thing I love! The LCD display on the back flips out and rotates around. You can shoot over crowds, ceilings, selfies, etc. Plus, this is the last Canon that runs off 4 AA batteries. I get 4-6 hours out of a single set of rechargeable batteries. Looking for an alternative to the big expensive cameras?",
      "rating": 4.0,
      "verified": true,
      "author": "Bob Siefker",
      "helpful_votes": 0,
      "publication_date": 20131205
    },
    {
      "title": "Great camera for what it is.",
      "text": "The Canon PowerShot SX20 IS is definitely a step up from a point-and-shot and a step down from an SLR with changable lenses. Its size is convenient for the image control you get. Its image control (exposure, focus, close-ups) is excellent. It even takes movies. I strongly recommend purchasing a User's Guide to get the most out of all of its features. I got \"A Short Course In Canon PowerShot SX20 IS Photography\" manual that I really like. The documentation that comes with the camera is limited and mostly online. Note that this camera does not come with a memory card. I got some SanDisk Ultra II SDHC 4GB memory cards for it that work great.",
      "rating": 5.0,
      "verified": true,
      "author": "Lenny Lieberman",
      "helpful_votes": 2,
      "publication_date": 20100921
    },
    {
      "title": "I Love This Camera!",
      "text": "I am an amateur photographer, and I love this camera because it makes me look like a professional. I carry this thing with me everywhere. It is well constructed, easy to use and just flat-out performs. I've taken it to scenic areas, sporting events and concerts, and it does a fantastic job everywhere. If you Google my name and visit my blog and/or my Picasa web album, you can see just how well this thing takes photos... if you visit my YouTube channel you can see just how well it shoots HD video. I can't recommend this camera enough. I can't afford a Canon DSLR, but this camera makes me okay with that.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad Groux",
      "helpful_votes": 3,
      "publication_date": 20101214
    },
    {
      "title": "Review by amateur",
      "text": "I bought this camera because I wanted the terrific zoom lens, a variable angle LCD, jpeg photos, and a viewfinder. I previously had a Canon so I figured the learning curve would not be too steep. The camera is more than I expected, actually, and now I'm interested in learning about it. It's a shame that Canon is too cheap to include a Users' Manual. Someone has written a book for the Canon Powershot SX20 with good ratings on amazon (but for $30), so I'm going to buy that, although it irritates me to have to do so. I do wish the lens cap was attached. I've already lost mine and will have to get another.",
      "rating": 5.0,
      "verified": true,
      "author": "W. L. Walter",
      "helpful_votes": 0,
      "publication_date": 20100802
    },
    {
      "title": "Very impressed",
      "text": "Let me make this clear from the outset. I am not an enthusiast photographer. I don't know much about cameras, I am not an advanced user. I was looking for a good camera that could record high definition video, and this camera is perfect for me. Its not very portable, but it does the job very well. The zoom is fantastic. If you are looking for a very powerful camera that also works as a simple point and shoot camera, then this is fantastic. The only con is the lack of printed manual. i wish I had it, so that I could actually learn while I am outdoors. Great product for $369.",
      "rating": 5.0,
      "verified": true,
      "author": "R C",
      "helpful_votes": 0,
      "publication_date": 20100615
    },
    {
      "title": "The Best",
      "text": "Absolutely the very best camera I have ever owned! Take fantastic photos -- & videos too! It's easy to carry & hold while using. The batteries last a long time. I like the fact that the SD storage card is not tucked away in the battery compartment where it is inconvenient to get to as in some cameras. I also like the fact that it uses AA batteries -- not an expensive, built-in, proprietary type. The lens is great, the macro works very well. I would recommend this camera to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Uncle",
      "helpful_votes": 0,
      "publication_date": 20140615
    },
    {
      "title": "Our go-to camera for nearly everything.",
      "text": "We have had this camera for a few years now and use it constantly for nature photography, children's events, photographing items for the internet, etc. We use the video feature regularly. It is the most reliable and easily operated digital camera we have ever owned. We bought this camera to replace another brand DSLR that was rendered inoperable after getting a small amount of rain on it. This camera has survived use in inclement weather with little extra protection.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Smith",
      "helpful_votes": 0,
      "publication_date": 20140615
    },
    {
      "title": "Ok for the price it is",
      "text": "Cameras is okay it tends to be a little bit too grainy in recordings but the price is not bad and the quality is good for it being as cheap as it was",
      "rating": 4.0,
      "verified": true,
      "author": "Ric",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Ignore the negative reviews, this is a very nice camera",
      "text": "I'm glad I ignored the negative reviews on the SX20-IS. I also have the S5 IS for my wife, and this is just as good or better. The colors are bright, the images sharp, the zoom range is incredible and the camera itself is a pleasure to hold and use. Like I've said before, have never met a Canon camera I didn't like, except one other model I can't recall (SX120?) that was a little slow in focusing and using for kids photos. If you are planning on getting one of these go for it. I have no regrets and I'm glad I picked one up before they disappear.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Santiago Jr.",
      "helpful_votes": 3,
      "publication_date": 20101021
    },
    {
      "title": "Amazing for it's size...",
      "text": "I am a serious hobby photographer who normally uses a Canon 50D DSLR; however, sometimes I want something a little smaller yet something I can still \"get creative\" with type of camera. This camera is it. Not to mention the video is incredible, especially the telephoto...I was amazed. I even love the low light ability. Now, of course I probably can't enlarge my photos to the size I would on my \"big gear\"; however I may be surprised and you will be pleasantly surprised at the quality of this camera. I love shooting manual and it simply works well for it's size.",
      "rating": 5.0,
      "verified": true,
      "author": "SherryS",
      "helpful_votes": 0,
      "publication_date": 20100314
    },
    {
      "title": "Dr Z. review of Canon SX20is",
      "text": "Very easy to use. My only complaint is that the instruction manual is on a disc which can be downloaded to a computer, but with no printed manual, looking up something on the fly is impossible. I was able to print the manual (4 pages on an 8 1/2 x 11 sheet) and that can fit into my camera bag (folded). It is a chore to do, however. The small wheel on the back of the camera can sometimes be accidentally turned while searching for buttons, but not a big problem. Picture quality is VG for an entry camera and the 20x zoom is great. All in all, well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr.Z",
      "helpful_votes": 2,
      "publication_date": 20100303
    },
    {
      "title": "A very nice camera for the money",
      "text": "This camera will do everything without carrying a big bag of extra parts. The video is 720p resolution and when played back on a good TV it is as good as it gets. The video focus works great and being able to zoom while shooting makes all the difference. The stills are prefect--great lighting, color and focus. I would like a higher resolution view finder--the one on this camera is a bit fuzzy to my eye. I guess I could learn to use the lcd display, but I still like the view finder for composing my pictures. I really like my new camera.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Seelye",
      "helpful_votes": 2,
      "publication_date": 20091003
    },
    {
      "title": "Canon PowerShot SX20IS 12.1 MP Digital Camera",
      "text": "I would highly recommend this camera. I love the way you can zoom in on subjects far away. This is my fourth digital camera and I think I am content now with the one I have. The main reason I changed at this time is the last one I was using does not have a view finder and when you were taking pictures in the sunlight you could not tell just what you were getting in your shots. This one has the viewfinder and with the tilt screen you can also see with that. I haven't used all the features yet but the ones I have used I would give a five star to all of them. Linda",
      "rating": 5.0,
      "verified": true,
      "author": "L. Sweigart",
      "helpful_votes": 0,
      "publication_date": 20100615
    },
    {
      "title": "Excellent gift. Great quality and ease of function and ...",
      "text": "Excellent gift. Great quality and ease of function and is a must for a younger photography enthusiast. Small enough to \"take along\" and the pictures are clear and composed with a minimum of basic instruction.",
      "rating": 5.0,
      "verified": true,
      "author": "Cobra489",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Great camera",
      "text": "Great little camera, exactly what I wanted. Not a DSLR but still takes great pictures. I am still getting used to the camera so haven't used all of its features yet. I am still experimenting with it, but I think this will meet my camera needs well. I can't believe that Canon don't provide an owners manual, I have printed the manual but to carry it would be like taking a thick book around. Come on Canon don't be so mean! All in all I am enjoying using this camera and am pleased with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "G. Whittle",
      "helpful_votes": 0,
      "publication_date": 20100429
    },
    {
      "title": "Awesome camera!",
      "text": "This camera is perfect for the person who loves to take pictures. I researched many cameras before I bought this one and I fell in love with this. I can take close ups from a great distance and although I am not a professional photographer, I sure feel like one! The pictures come out clear and crisp. Has many different choices to choose from and when recording the sound quality is great. The camera arrived beautifully packaged and I would buy this again in a heartbeat.",
      "rating": 5.0,
      "verified": true,
      "author": "MJ Shopper",
      "helpful_votes": 0,
      "publication_date": 20120428
    },
    {
      "title": "Chyea!!",
      "text": "This camera is friggin amazing! Its defiantly my favorite out of all the cameras iv ever had! The only thing i didn't like, was of course the lens \"CAP\". The cap isn't attached or tied to the actual camera. Iv lost the cap a bunch of times, then one day I accidentally dropped it off a dock & into the water & ain't gettin it back anytime soon. Now i have to buy another cap before my lens scratches.. Other than that one flaw, the camera is fantastical & completely worth buying! -Hails.",
      "rating": 5.0,
      "verified": true,
      "author": "AlaskanMom",
      "helpful_votes": 0,
      "publication_date": 20100802
    },
    {
      "title": "Great Camera for the price",
      "text": "I purchased this camera for my husband, the family photographer, to replace an older digital camera that he still managed to take great pictures with. Based on other reviews and the price point I hoped it would be a hit. His take is that the feature set, ease of use and conventional battery usage made this just about the perfect mix. He was able to easily take advantage of all of the features because of the intuitive controls and after spending very little time with the manual has produced video and stills of exceptional quality. He's delighted and so am I.",
      "rating": 5.0,
      "verified": true,
      "author": "CaseyT",
      "helpful_votes": 2,
      "publication_date": 20091021
    },
    {
      "title": "Canon SX20 IS",
      "text": "I am very pleased with its features and my results thus far. Two things to be aware of however. There are no actual filter threads (Canon says the lens construction doesn't permit them) and the owner's manual is on a disc. I'd like to see a printed manual offered at least as an added purchase item. There's a lot to know to take full advantage of its potential. I have found that a 52mm filter thread will work, but it does not thread on smoothly nor all the way in. It is a secure fit however.",
      "rating": 5.0,
      "verified": true,
      "author": "Rex E. Dolby",
      "helpful_votes": 2,
      "publication_date": 20100828
    },
    {
      "title": "Nice Camera, easy to use",
      "text": "the camera is very user friendly which I like, had trouble with the view finder, had to call canon to get help, there is a little wheel by the view finder that has to be adjusted, good pictures, tried to get a plate number of a car a over a hundred yards away, couldnt see it with the naked eye but with the 20 times zoom it was perfect. the LCD viewer could be a little bigger but its okay, mainly bought for sports advents to get better pictures, good value for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Norman C. Schoenborn",
      "helpful_votes": 0,
      "publication_date": 20091127
    },
    {
      "title": "Pretty good Super Zoom Camera",
      "text": "This camera replaces my Panasonic FZ30 which replaced my FZ10. I really liked both of those cameras but they both failed to turn on one day. So far, feature for feature, for a super zoom camera, I like it except for one feature that I am really going to miss and that is burst mode. I don't understand why that feature could have not been added, I use it often but that is just me. If this feature isn't important to you then I highly recommend this camera.",
      "rating": 4.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20091031
    },
    {
      "title": "Great Replacement for my S1",
      "text": "I miss the button layout of the SX1, I looked at similar cameras from other manufacturers and the lens is a little slower than contemporary cameras I tried, but Canon's Image Stabilization I find is superior and outweighs some of the highlights of those other cameras. The full manual feature and speed or apature controls are a necessity to me. It has done everything I want it to do and so much more. I am very satisfied with this Amazon purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Rene P",
      "helpful_votes": 0,
      "publication_date": 20100410
    },
    {
      "title": "Great Camera!",
      "text": "I am very pleased with the Canon powershot SX20IS. The pictures are great but you need a tripod of some type when you zoom in on a subject. Unless you are very steady. The camera is easy to use although the guide tells you very little. The buttons on the back right side could be situated in a better spot so that you don't keep hitting them when you go to hold the camera to take pictures. Over all I like the camera and will use a tripod when needed.",
      "rating": 4.0,
      "verified": true,
      "author": "E. Sweet",
      "helpful_votes": 2,
      "publication_date": 20091028
    },
    {
      "title": "Love the superzoom!",
      "text": "I've owned this camera for a couple months now and am very happy with it. The 20x zoom is fantastic; I find myself using it more often than not, mostly for action shots at sports games. The low light performance isn't bad for a non-SLR. I've been taking many night shots of cities and lights and have been pleased with the results. I bought this before the SX30 was announced; I might have waited if I'd known about the newer model.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric in Vegas",
      "helpful_votes": 2,
      "publication_date": 20101106
    },
    {
      "title": "Love this camera",
      "text": "This is a really good camera. The quality of the pictures is good. I haven't used it very long, but from the pictures taken so far, the zoom, is wonderful. The pictures are very clear. It is not your really small camera, which I was not wanting a tiny camera anyway. It is the closest thing to an SLR camera, without the higher cost that SLR cameras are. I am still learning about it, but I am glad I purchased it. Would recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Dilbeck",
      "helpful_votes": 0,
      "publication_date": 20100808
    },
    {
      "title": "ok",
      "text": "it's an ok camera- takes ok photos- but smallish sensor, so photos seem to lack detail of larger sensor photos, and look a bit mushy- but for this type of camera it's pretty good. The zoom is good, but when you zoom in using the digitsal zoom (the extended zoom) you l ose a lot of detail. Easy to use camera- good controls",
      "rating": 3.0,
      "verified": true,
      "author": "Naz",
      "helpful_votes": 0,
      "publication_date": 20141127
    },
    {
      "title": "Not bad for a point & shoot.",
      "text": "This camera is probably one of the best point & shoot cameras I have ever tried. It takes great pics in daylight. However, I was a little disappointed when I tried it at a ceremony in a semi-dark large room. The pics were not that clear. On a positive note, if you learn to use the many features it has you can create some wonderful shots. Overall, I would recommend this camera to anyone who does not want to purchase a dslr.",
      "rating": 4.0,
      "verified": true,
      "author": "Tony Cruz",
      "helpful_votes": 0,
      "publication_date": 20100321
    },
    {
      "title": "Great zoom",
      "text": "I took this camera on a trip to Alaska and caught some outstanding shots using the excellent zoom. It is a bit bulky (so 4 stars not 5) but that is partly due to the fact that it uses 4 AA batteries, so you can get emergency power anywhere. It's really easy to use, and has good auto as well as manual controls. In spite of its size, it has become my grab-and-go camera.",
      "rating": 4.0,
      "verified": true,
      "author": "G. Brooks",
      "helpful_votes": 0,
      "publication_date": 20130809
    },
    {
      "title": "Everything I had hoped for and more",
      "text": "I have used the Sony H9, and then H50 for 4 years and love the flexibility of the super-zoom with articulated LCD and super-macro design. I was looking for a camera with the same features, but slightly higher image quality. The Canon is exactly that, with the bonus that it has a much more solid build than the Sonys. I have a more detailed review/first thoughts/impressions piece on my blog, Point & Shoot Landscape: [...]",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Ingraham",
      "helpful_votes": 0,
      "publication_date": 20100223
    },
    {
      "title": "I bought the camera as an alternative to carrying around ...",
      "text": "I bought the camera as an alternative to carrying around a larger and heavier DSLR on certain occasions. The Canon SX2012 produces acceptable quality stills and videos.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse Huddleston",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "THIS CAMERA IS A WORK HORSE",
      "text": "Extremely user friendly and I can do real photography stuff with the sx20. Even edit photos right on the camera. Love this camera and bought it 3 years ago and am just now giving the review. It's a Work horse and has created photos for my family since my 3 year old was born. It lasts unlike so many others.",
      "rating": 5.0,
      "verified": true,
      "author": "Popeye",
      "helpful_votes": 0,
      "publication_date": 20140212
    },
    {
      "title": "Best digital camera for top amateurs.",
      "text": "I ordered this camera in 2009 with the Digital Concepts 952AF (discontinued) and later another slave flash plus a tripod, and really I belive that if you will not made largest pictures than 12 x 20\" this is the camera for you. Even I let pass the models 30, 40 and 50, because I find this one work yet fine for my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "V. CARDONE",
      "helpful_votes": 0,
      "publication_date": 20140416
    },
    {
      "title": "My sister loves it",
      "text": "Its a perfect gift works great and really captures any and every image perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Gema",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Nice camera",
      "text": "Good condition was under rated by warehouse deals. This camera looks great and works great",
      "rating": 5.0,
      "verified": true,
      "author": "PairofNoids",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Great for tourists!",
      "text": "I take this camera all over the world with me on business and pleasure. It is fairly compact for its impressive optical zoom (I never turn on digital zoom). It takes pretty clear pictures. It is only 12MP so newer cameras do a bit better these days but all-in-all I love this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150314
    },
    {
      "title": "Sure shot indeed!",
      "text": "For me this was the right choice of camera. It is easy to use in the auto mode or you can make your own adjustments if your more experienced. I am extemely pleased with the zooms sharpness and the stability feature. The more I use it the more I learn of its many many features. I would definately recommend this to anyone who wants quality pictures with a click of the button.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20100219
    },
    {
      "title": "Great camera for the money.",
      "text": "Great camera with wonderful picture taking features. This camera makes it very easy to take awesome shots. There is ease of use in this camera. Takes beautiful close up pictures and movies. The only downsides are the cheap lens and strap. Although the camera came with a disk with information I would have preferred the booklet on camera features and instructions. I had to order the book separately from amazon.com.",
      "rating": 4.0,
      "verified": true,
      "author": "Brandee J. Beavers",
      "helpful_votes": 0,
      "publication_date": 20110204
    },
    {
      "title": "Seller sells faulty merchandise l!",
      "text": "Item would not work at all!! Did not power on at all. My daughter opened this on Christmas Day-literally just now and the camera does not work. I’m livid!",
      "rating": 1.0,
      "verified": true,
      "author": "RWalk",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Wanting to record high-def video?",
      "text": "If you want to record high-def video you MUST have an SD with a Speed Class of 4 or higher. Canon does not tell you this anywhere, I had to find out by contacting technical support after looking at the troubleshooting guide because I could only get about 15 seconds of video before it would stop. I don't know about regular video, but to be safe I'd still get the higher speed SD card. It will take still pictures just fine with a lower speed class.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 4,
      "publication_date": 20100204
    },
    {
      "title": "Its a Canon!",
      "text": "So I was replacing my old and loyal S3IS... this new camera is just awesome! I took many pics, at high speed, portraits, landscapes and even fireworks... all of them were just great. For me its obvious for this camera to be great as its a Canon. If you are thinking about a great camera at a great price, then go for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny Castillo",
      "helpful_votes": 3,
      "publication_date": 20100104
    },
    {
      "title": "Great purchase",
      "text": "I was either going to buy this camera or the Sony Cybershot DSC-HX1. However, I have always had good luck with Canon cameras. The cameras are very similar with a few trade-offs. The decision came down to the external flash option with this camera. I bought the Canon Speedlite 270 EX as well. It makes an unbelievable difference with indoor photos.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Reynolds",
      "helpful_votes": 0,
      "publication_date": 20100224
    },
    {
      "title": "Cannon SX20IS camera",
      "text": "I have a Canon SX2IS camera which was very good. The SX20IS is a big improvement. It is easy to set the enlarged group of shooting modes and the zoom is terrific. I am getting excellent pictures. The camera is very easy on batteries. The only thing I don't like is the lens cap, it is difficult to install and remove. I would buy this camera again.",
      "rating": 5.0,
      "verified": true,
      "author": "Sepp",
      "helpful_votes": 2,
      "publication_date": 20091201
    },
    {
      "title": "Amazing zoom for a \"point and shoot\" camera",
      "text": "Amazing zoom for a \"point and shoot\" camera. Great quality pics and vids. Tons of features, settings and modes to take the perfect photo. Not too big or heavy to carry around either.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "The best camera I have ever had.",
      "text": "This is the best camera yet. I always use canon products. The video is better than camcorders. Took back a sony POS camcorder. This one smokes it in video. Pictures are awesome. Features are more than enough for anyone. Even professional use this camera will out perform your needs and expectation.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. S. Moss",
      "helpful_votes": 2,
      "publication_date": 20101023
    },
    {
      "title": "Nice camera for the price",
      "text": "The SX20IS does an excellent job for stationary subjects. The view finder is too small for following birds in flight. Optical zoom matches my spouse's S2IS performance. The digital zoom shots are all blurry, even with tripod. The camera is a huge step above the Sony Cybershot and Olympus models I have had.",
      "rating": 4.0,
      "verified": true,
      "author": "William D. Funk",
      "helpful_votes": 0,
      "publication_date": 20100607
    },
    {
      "title": "New Camera",
      "text": "So far this camera has lived up to my expectations. I love the zoom and photos are crisp and clear. The camera is a bit bulky. Certainly isn't one I can throw into my purse or pocket, but it seems to be sturdy and well built. It is exactly what I was looking for to take photos on my next vacation.",
      "rating": 5.0,
      "verified": true,
      "author": "sully",
      "helpful_votes": 0,
      "publication_date": 20100515
    },
    {
      "title": "Gosh this is  good",
      "text": "This is the first Canon I have purchased. Now I see why people say they are the best. I have purchased a lot of cameras in the last five years and they are all bad compared to this one. It is heavier than my others but worth it for picture quality and the fantastic zoom. I recommend it highly.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Hetu",
      "helpful_votes": 0,
      "publication_date": 20101002
    },
    {
      "title": "Learning",
      "text": "So far, this camera has lived up to my expectations. It will take a little time to learn all the features it has, but , that in itself , is the beauty of digital..experiment, experiment, experiment!!!! Don't just set to \"auto\" or you will miss out on some great chances to really enhance your photos.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 2,
      "publication_date": 20100205
    },
    {
      "title": "Great Camera for the Price!",
      "text": "I bought this camera in December, 2009. It has been a great experience to take photos with this camera. I like the rich feature set available in this camera along with its long battery life. Moreover the HD Movie recording is absolutely wonderful for a camera of this nature. If you are really picky about the picture quality, however, you may find a noise, which is usually the case in all Mega Zoom cameras. Anyway, this won't affect much unless you view the images in 1:1 scale. Also if the light condition is good this effect is less visible. The bottom line is this is well worth the price!",
      "rating": 4.0,
      "verified": true,
      "author": "Saliya Ekanayake",
      "helpful_votes": 0,
      "publication_date": 20100403
    },
    {
      "title": "Love this camera",
      "text": "I bought this camera on a friend's recommendation and I love it. The photo quality is excellent, especially in macro mode which I use a lot. The instruction booklet is a joke, so I just ordered a 3rd party manual. Overall, I recommend this camera without hesitation!",
      "rating": 5.0,
      "verified": true,
      "author": "Kris E.",
      "helpful_votes": 0,
      "publication_date": 20110813
    },
    {
      "title": "loved it so much I bought another one",
      "text": "I've had this camera before for 5 years, and after 5 blissful years together, he died a peaceful death. So I purchased his brother and haven't looked back. I love the rotation on the screen, and the picture quality is incredible for being an older camera. Great camera for those wanting to be able to take great pictures, but don't have the money to invest in a DSLR yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Steph",
      "helpful_votes": 0,
      "publication_date": 20151125
    },
    {
      "title": "Works Great",
      "text": "Purchased for my Daughter to take pictures of our new grand daughter. The pictures are great she loves the lcd display and ease of use. Might not be a camera for a pro, but for great and easy pictures it does a great job. Would be nice if it had a molded case. Free shipping and scary fast delivery",
      "rating": 5.0,
      "verified": true,
      "author": "D. Adair",
      "helpful_votes": 0,
      "publication_date": 20100101
    },
    {
      "title": "Great camera",
      "text": "I bought this as a successor to the PowerShot S3 IS, and the improvements were worthwhile. The upgrade to 12.1MP over the 6MP of the S3, combined with the additional range on the zoom make a huge difference at the long end. The lens is fast enough in low light to capture some long-range zoomed images of birds in the relatively darkness of the tropical rainforest. While substantially larger and heavier than a point-and-shot camera, the SX20IS is smaller and lighter than a DSLR. While the photo quality is compromised compared to a DSLR, if you are not a professional, or a dedicated photography hobbyist, you will be happy with this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "GadgetFreak",
      "helpful_votes": 0,
      "publication_date": 20120229
    },
    {
      "title": "Handy point and shoot great lens",
      "text": "I have really enjoyed the canon sx20. It is so much easier to carry than my slr and no lens to carry or change. The set of features is all I will need as a family snap shot photographer. The lens allows close up candid shots that are difficult to get with larger SLR's that make people nervous. I have not used the video but plan to over Christmas. Overall for me it is an excellent buy for the money and meets all of my needs. Easy to transfer photo's to my mac.",
      "rating": 5.0,
      "verified": true,
      "author": "Sooupie",
      "helpful_votes": 4,
      "publication_date": 20091216
    },
    {
      "title": "Best Overall, every where",
      "text": "I was looking for a video camera and got a great still camera for free. I've never shot video before. This weekend I took a video of a friend's wedding without looking at the instructions and it came out great. The mic's picked everything up and the shots in fading sunlight came out better than expected. The still camera is a joy to use. This is my 7th digital camera (2 slrs, 3 prosumer, 2 compacts) and this is the one I will probably use the most. Buy it you will be happy",
      "rating": 5.0,
      "verified": true,
      "author": "Pj",
      "helpful_votes": 8,
      "publication_date": 20091118
    },
    {
      "title": "Worth the $$$",
      "text": "This is a great camera. Totally flexible and easy to use. The photos are soooo sharp and the HD video is very nice. I haven't really done any night shooting yet so I couldn't comment on that, but over all this is a camera that you'll be glad you spent your money on. The Auto setting is very good. If you switch to manual settings you will have tons of f/stops and ISO and aperture settings to adjust making this a near professional camera. I am very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Ira W.",
      "helpful_votes": 0,
      "publication_date": 20100520
    },
    {
      "title": "Good features. Great camera.",
      "text": "This camera has all the features an amatuer could need or want. Sometimes it can be difficult to find the right setting or effect because of all the different options. It takes great photos when I take pictures. My wife has difficulties sometimes; I can't figure out why. It's not huge, but is obviously more cumbersome than pocket cameras. I have not had to replace the batteries yet (8 weeks). In summary: Great pictures, Good value.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Festavan",
      "helpful_votes": 8,
      "publication_date": 20091203
    },
    {
      "title": "Fits the bill!",
      "text": "This camera is a great camera all around! I have used SLR's and have found myself limited in ways that this camera enriches! This is a one stop shop! You can take snapshots, and you can all take detailed photos of the moon (for example) it's portable and ready to go when you are! A+",
      "rating": 5.0,
      "verified": true,
      "author": "Karrie",
      "helpful_votes": 0,
      "publication_date": 20100502
    },
    {
      "title": "For the casual user",
      "text": "I am a casual user of a camera...I wanted a camera that was not as complicated and costly as a SLR yet with greater capabilities than a compact..This camera fills the bill...The zoom mode is acceptable and the movie mode is ok for my needs...If the manual's directions are followed, the photos are clear and crisp...Initially, I thought that the the movie audio was poor, but I was only experiencing it in the playback mode thru the camera; my mistake, should view and hear thru the TV or the computer where the sound is perfect...All in all I enjoy picking it up.",
      "rating": 4.0,
      "verified": true,
      "author": "John Iacuzzo",
      "helpful_votes": 0,
      "publication_date": 20100323
    },
    {
      "title": "An excellent camera",
      "text": "This is an excellent all-around camera that will not break the bank. I considered the EOS, D models, etc., but in the past I tired of lugging and changing all the extra lenses. Canon has fixed the main complaints that I had with the 5IS (which stopped working after about 5 years and probably 7-10,000 pictures): the cap now stays on and the megapixils have increased enough to allow photo shopping the pictures taken in low light conditions without excessive graininess.",
      "rating": 5.0,
      "verified": true,
      "author": "V. B.",
      "helpful_votes": 5,
      "publication_date": 20091210
    },
    {
      "title": "TomSIU",
      "text": "I am an arson investigator for a major insurance company, and this camera really meets the requirements of my job. The camera is compact, easy to use, and takes great photos. The adjustable LCD viewer comes in very handy. Good camera for under $500.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Strawther",
      "helpful_votes": 0,
      "publication_date": 20100323
    },
    {
      "title": "Legacy continues",
      "text": "Canon has been steadily progressing the generation of the point and shoot cameras. I've bought all the cameras in this line - 10IS, 20IS, 30IS, 40IS and now 50IS either for myself or as a gift. Every time, it has increased my confidence on the Canon product line.",
      "rating": 4.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 0,
      "publication_date": 20130204
    },
    {
      "title": "Horrible",
      "text": "I bought this in 2009 and it took me (don't laugh) four years to figure out that it's a dud. I only realized this after we got an EOS 6d and what a difference! Blurry, off-color shots no matter what settings you use, unless you are in very specific shooting circumstances (outdoor, low glare). I should have returned this the day we got it.",
      "rating": 1.0,
      "verified": true,
      "author": "SF Investor",
      "helpful_votes": 0,
      "publication_date": 20140517
    },
    {
      "title": "Excellent Camera",
      "text": "I bought this camera as an upgrade from an older model Powershot. It is a great camera. It is very easy to use and makes wonderful, sharp photos. Even on fully automatic setting the pictures turn out great. The 20X zoom is great.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Barnhill",
      "helpful_votes": 2,
      "publication_date": 20091024
    },
    {
      "title": "Great Gift.",
      "text": "I received this as a Christmas gift (my hubby purchased it via my prime account). From what he told me, it was delivered quickly and in good condition. He had me open it Christmas eve so that I could use it in the morning for our daughters first Christmas. Thus far I really like it. It takes grateful pictures and is easy to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20151225
    },
    {
      "title": "Cannon SX20IS",
      "text": "I have only had the SX20IS for a few weeks, but I am very pleased with it so far. This is a great camera. I read a bunch of reviews before buying and so far it is living up to the other reviews. Great picture quality and I love the 20X zoom. If it works as well as my other Cannon cameras, I will be very satisfied. On top of that I paid less money on Amazon than the local price.",
      "rating": 5.0,
      "verified": true,
      "author": "John E. Sullivan",
      "helpful_votes": 0,
      "publication_date": 20100402
    },
    {
      "title": "Bought for my father",
      "text": "I bought this for my digital camera challenge father. The camera takes great pictures and videos. It just needs to be a little easier for the older generation. I did not like the way you could turn off the LCD on the back or the view finder. Other than that it's a great camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Felix Foret",
      "helpful_votes": 0,
      "publication_date": 20110828
    },
    {
      "title": "Nice camera with one glaring issue",
      "text": "The camera is very easy to use, has lots of controls and is loaded with great features. I am pretty disappointed in the chomatic abberation issue this camera exibits however. Lots of purple and green fringing under certain conditions, this even with a UV filter in place. Other times the photos are impressive.",
      "rating": 3.0,
      "verified": true,
      "author": "W. Jeff Bertrand",
      "helpful_votes": 2,
      "publication_date": 20100210
    },
    {
      "title": "Top Noch",
      "text": "I bought this camera about two years ago. I'm not a professional photographer but I hope to be someday. I cannot recommend this camera enough. The zoom on it is fantastic. And the quality is great. I love this camera and couldn't ask for a better one. I've had no problems with it whatsoever. If you're looking for a camera this is the one.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Lillis",
      "helpful_votes": 2,
      "publication_date": 20101014
    },
    {
      "title": "Worth the money",
      "text": "Worth the money for an excellent mid range camera. I was a little concerened with some of the other reviews about the camera but if you read the instructions you can take excellent photos. I only tried the video once and it worked very well on our 60 LCD tv.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Hoag",
      "helpful_votes": 3,
      "publication_date": 20100312
    },
    {
      "title": "Great for filming your own exercises",
      "text": "I picked the camera for its quality and for its articulated screen that allows me to set it to video graph myself doing exercises. A minor complaint is that it does not have a cable release.",
      "rating": 5.0,
      "verified": true,
      "author": "Tropical Bill",
      "helpful_votes": 0,
      "publication_date": 20120119
    },
    {
      "title": "rodder",
      "text": "Good camera for the price.Pretty easy to use for a beginner or anyone who has some experience taking photos.Quality of photos are pretty good,haveen't tried to use the video much,it's a little more difficult to use. All in all,pretty good piece of equipment,would reccomend this product.",
      "rating": 4.0,
      "verified": true,
      "author": "streetrodder",
      "helpful_votes": 2,
      "publication_date": 20091201
    },
    {
      "title": "canon sx20is",
      "text": "Briefly, if you ever used a DSLR you more or less see the picture your taking and can expect good results, but with the Canon (SX20 IS) what you see through the viewfinder is not always what you get, You just have to trust that the picture will look good and typically they do. The LCD Monitor is a real plus for low and high angle shots. The video is really good quality. Myself, I think it's more complicated than a DSLR. Plan on spending a lot of time reading the manual, if you want quick pictures, buy a point and shoot. This is not a DSLR. Dave",
      "rating": 4.0,
      "verified": true,
      "author": "DJM",
      "helpful_votes": 0,
      "publication_date": 20101023
    },
    {
      "title": "Outstanding",
      "text": "This camera is outstanding. We had the earlier version also and it was outstanding (SX10). I can't believe they improved it but they did. The only thing missing is something to attach the camera lens to the body so you don't misplace it. We ordered one online and it does the trick. We used it for a trip to Alaska. The zoom was perfect and zoom was probably the most important feature we were looking at. Super easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "KM",
      "helpful_votes": 4,
      "publication_date": 20100711
    },
    {
      "title": "Great Buy!!",
      "text": "Buy this camera you want regret it. It's a fair price but looks great. I used it to shoot music videos and green screen projects. It's worth the investment. 5 star product for price and quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Roosevelt ",
      "helpful_votes": 0,
      "publication_date": 20140314
    },
    {
      "title": "A good camera",
      "text": "A good camera that has many of the functions of a DSLR, but without all of the price. We don't use it as much as we'd like to, but it's a good camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Happy in DBQ",
      "helpful_votes": 0,
      "publication_date": 20130312
    },
    {
      "title": "Great blending of point and shoot and SLR",
      "text": "I wanted a camera with better zoom and more options than my basic one. I especially like the viewfinder, which with my nearsightedness is so much better to use. Also like the choice of using it as an automatic point and shoot or allowing me to make changes as I learn more.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat Viamonte",
      "helpful_votes": 0,
      "publication_date": 20131115
    },
    {
      "title": "Great price, does the job.",
      "text": "My husband loves this camera. He takes it outdoors to film his rock climbing videos for YouTube. He loves the HD quality and especially the flip screen.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Katherine Bush",
      "helpful_votes": 0,
      "publication_date": 20130729
    },
    {
      "title": "Great priced camera that does video well",
      "text": "I use this camera mostly to shoot HD video. The powerful zoom is great, you need a tripod or other device to hold it steady though. Not the cameras fault.",
      "rating": 5.0,
      "verified": true,
      "author": "billm FD3",
      "helpful_votes": 0,
      "publication_date": 20130625
    },
    {
      "title": "Cannon SR20",
      "text": "Great camera with a lot of features and a great zoom. It goes up to 80x digitally and you can enlarge from there on the display. I drilled two 1/16\" holes in the cap an 1/8\" apart to put a small string in to attach to the camera. I could imagine losing the cap in a week otherwise. I don't see a reason to get an SLR with all the things this camera will do. It is a good thing I got an optional 8gig card for the camera since it didn't come with one.",
      "rating": 4.0,
      "verified": true,
      "author": "CaminoCappy",
      "helpful_votes": 0,
      "publication_date": 20100628
    },
    {
      "title": "Pleased over all",
      "text": "I am enjoying my new 'toy'. The price range was within my budget. Easy to operate and will more than suit me till time to upgrade. I am still learning to operate the manuel settings, but have a couple moonlight photos that please me. I like being able to change the color settings on the camera so I don't have to wait to put them on the computer. I do a lot of work I want in BW. I wish it would have come with a more extensive operators paper manuel so I could take it with me. Kind of hard to hike with the computerized one.",
      "rating": 4.0,
      "verified": true,
      "author": "Ol' Crone Shutterbug",
      "helpful_votes": 2,
      "publication_date": 20101102
    },
    {
      "title": "Almost a great camera",
      "text": "I've had to purchase an adapter ring in order to use a UV and other filters. Camera does not always switch automatically from viewfinder to view screen. Colors under certain desert conditions are not true, regardless of sun angle. Have owned three Fuji cameras and would have purchased a fourth, save for poor construction.",
      "rating": 4.0,
      "verified": true,
      "author": "Gordon D. Gillespie",
      "helpful_votes": 3,
      "publication_date": 20100109
    },
    {
      "title": "Great Camera, great value",
      "text": "Fantastic camera. I was up and running immediately taking great pictures. This is the ideal choice for someone who wants the ease of a point and shoot camera with the features of an SLR. The Optical Zoom delivers outstanding shots and clarity. The only drawback I have seen with the camera has already been posted by others. I thought that the reviewers were nitpicking about issues with the lens cap falling off, but it is frustrating that the cheapest part of the camera can put your lens at risk. Canon really should make good on this piece, then we will have nothing to complain about!",
      "rating": 4.0,
      "verified": true,
      "author": "KenS",
      "helpful_votes": 0,
      "publication_date": 20091121
    },
    {
      "title": "Great camera, makes picture taking enjoyable again",
      "text": "Great camera, makes picture taking enjoyable again; I have had a number of other digital cameras, which had some good aspects about each one. However, when taking pictures indoors or out doors there is no measurable difference in the resolution and picture quality with the SX20IS. I am so happy with it when I show my co-workers the quality; they can't believe it. Their comment, \"it must be a really expensive camera;\" when I tell them what I paid for it they're floored. Thanks Canon, for a great camera, you got this one right.",
      "rating": 5.0,
      "verified": true,
      "author": "Visa",
      "helpful_votes": 0,
      "publication_date": 20100407
    },
    {
      "title": "A TOP NOTCH CAMERA",
      "text": "THIS CAMERA WAS PURCHASED ON A RECCOMENDATION FROM MANY WEBSITES. I WANTED IT FOR THE GREAT OPTICAL ZOOM. IT TURNED OUT THAT IT WAS LARGER AND HEAVIER THAN I HAD EXPECTED. IT IS MORE COMPLICATED THAN I EXPECTED BUT I AM GETTING FAMILIAR WITH THE OPTIONS AND FEATURES. WOW, A 180 PAGE MANUAL TO USE !! THE MORE I USE IT, THE MORE I LIKE IT. I JUST HAVE TO GET OVER THE \"OLD GUY\" MENTALITY.",
      "rating": 4.0,
      "verified": true,
      "author": "James E. Templin",
      "helpful_votes": 0,
      "publication_date": 20100217
    },
    {
      "title": "Great Camera",
      "text": "I bought this camera for my son who was having a new baby for Christmas due to Consumers Report and they loved it. I then bought it again for my daughter who just had a baby. They both love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cristie Boulware",
      "helpful_votes": 0,
      "publication_date": 20100720
    },
    {
      "title": "My son LOVES it!",
      "text": "I have the same camera. My son was always taking mine so I decided to buy him one of his own. He absolutely loves it. It arrived in great condition, and earlier than I expected. Thank you for being so prompt. I very much appreciate it!",
      "rating": 5.0,
      "verified": true,
      "author": "Audrey Furst",
      "helpful_votes": 0,
      "publication_date": 20140104
    },
    {
      "title": "Worth every penny",
      "text": "I just purchased this camera and have been toying around with it in the house and so far the picture quality has been great! The auto is a little to vivid for my liking, so I just change to custom and turn the color to natural. The zoom is great and easy to focus when you zoom fast. The real test will be when I attend concerts, how well the low lighting shots will turn out! Can't wait to test it out some more",
      "rating": 5.0,
      "verified": true,
      "author": "Cass8302",
      "helpful_votes": 0,
      "publication_date": 20100310
    },
    {
      "title": "Great camera for the price, but...",
      "text": "...to get the most out of your new camera, I strongly recommend Dennis Curtin's \"A Short Course in Canon PowerShot SX20 IS Photography.\" The camera is so much more flexible than I imagined, & Canon's User Guide only seems to skim the surface.",
      "rating": 5.0,
      "verified": true,
      "author": "M. R. Martin",
      "helpful_votes": 0,
      "publication_date": 20100627
    },
    {
      "title": "Good Camera, Great Value",
      "text": "I really like this camera for the price... I love Canon, and my old 7 mp Canon PowerShot was pretty much dead so I needed a new one. I like the DSLRs, but I don't have the time to mess with lenses, so I wanted a camera with similar quality in a more convenient format. This is a great camera for someone like me who wants good quality pictures, and loves taking pictures!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Marie Zhao",
      "helpful_votes": 2,
      "publication_date": 20100929
    },
    {
      "title": "best camera ever",
      "text": "Wonderful camera nothing but good to say about it. This camera does everything you would want in photography!! Can't take my hands off this camera goes everywhere does everything!! Photo and Video quality excellent.... Danny",
      "rating": 5.0,
      "verified": true,
      "author": "Danny Brown Thomaston Ga.",
      "helpful_votes": 0,
      "publication_date": 20100423
    },
    {
      "title": "More than I could ask for",
      "text": "This camera is seriously the most dank (in a great way) piece of equipment I own. I have had little point and shoot cameras in the past which surprisingly took decent quality photos, but this camera is great for any explorer. The zoom is incredible and so sharp once you have the subject focused. I have not yet taken this puppy out in the real world yet, so I am super excited to really give it a try. This camera is definitly for any photo-taking lover, and seems like it is a level lower than an SLR. BUY IT!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Coughlin",
      "helpful_votes": 0,
      "publication_date": 20100421
    },
    {
      "title": "Great Camera",
      "text": "I love this camera!! I thought about buying the Cannon Rebel, but it was too expensive. I am so glad that I bought this one. It is so easy to use, and takes fabulous pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy M. Miller",
      "helpful_votes": 2,
      "publication_date": 20101011
    },
    {
      "title": "Big aquisition",
      "text": "Surprised because of the improvement they have had since Powershot S5. The night shot is better, the zoom amazing, the play displaying the faces wonderful, and no more difficulties to take shot in little distances because of the wide angle. I didn't like the lens cover, difficult to put it on. I recommend it for everyone...",
      "rating": 5.0,
      "verified": true,
      "author": "Edson K.",
      "helpful_votes": 3,
      "publication_date": 20091225
    },
    {
      "title": "Canon Powershot SX20IS",
      "text": "Great camera! I bought the S3IS a number of years back and loved it, so I decided to give this one a try. Its almost exactly the same, except better in every way.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Sutherlin",
      "helpful_votes": 0,
      "publication_date": 20100912
    }
  ],
  "product_meta": {
    "title": "Canon PowerShot SX20IS 12.1MP Digital Camera with 20x Wide Angle Optical Image Stabilized Zoom and 2.5-Inch Articulating LCD (Discontinued by Manufacturer)",
    "description": "Discover the HD difference. With the classically stylish PowerShot SX20 IS, you can produce magnificent HD movies and dazzling photos. Loaded with features, it’s got a high-powered 20x wide-angle optical zoom with Optical Image Stabilizer, 12.1 megapixels, a big 2.5-inch Vari-Angle LCD, Blink Detection and more.The PowerShot SX20 IS is equipped with many of the same features as a higher-end camera: an ultra-powerful zoom, eye-popping resolution and advanced picture-improving technology. 12.1 megapixels of resolution gives your photography incomparable depth and ensures that any section of any shot can be enlarged and cropped with no loss in quality when you edit the image even if you choose to print the image. It can create crisp, clear 13 x 19-inch posters.\n\nFROM THE MANUFACTURER\n\n\n Discover the HD difference. With the classically stylish PowerShot SX20 IS, you can produce magnificent HD movies and dazzling photos. Loaded with features, it’s got a high-powered 20x wide-angle optical zoom with Optical Image Stabilizer, 12.1 megapixels, a big 2.5-inch Vari-Angle LCD, Blink Detection and more. \n\nThe PowerShot SX20 IS is equipped with many of the same features as a higher-end camera: an ultra-powerful zoom, eye-popping resolution and advanced picture-improving technology. 12.1 megapixels of resolution gives your photography incomparable depth and ensures that any section of any shot can be enlarged and cropped with no loss in quality when you edit the image even if you choose to print the image. It can create crisp, clear 13 x 19-inch posters. \n\nPowerShot SX20 IS Highlights \n\n\n\n20x optical zoom in action 20x wide-angle optical zoom with Optical Image Stabilizer\nThe PowerShot SX20 IS is equipped with a 20x Optical Zoom lens with a focal length of 5.0-100mm (35mm equivalent: 28-560mm) that allows you to shoot any scene from wide-angle to telephoto. The camera uses a VCM (Voice Coil Motor) for high-speed, quiet, energy-efficient lens movement with precise control. Focal length is conveniently indicated on the lens barrel. \n\nThe lens is optimized to fully exploit its zoom length and wide shooting angle in concert with the camera’s high 12.1 Megapixel resolution. UD glass effectively suppresses chromatic aberration, while enhanced negative refractive power ensures that distortion at the wide-angle is also corrected. Further aberration is controlled with the inclusion of a double-sided aspherical glass-molded lens and ultra-high refraction index lens. \n\nThe SX20 IS is equipped with Canon’s acclaimed Optical Image Stabilizer Technology that automatically detects and corrects camera shake--one of the leading causes of fuzzy or blurred shots. Even when zoomed in, you can get the steady, crisp, brilliant images you’ll be proud to shoot and share. And Canon’s Optical Image Stabilizer Technology is convenient to use. It functions perfectly with or without a flash. \n\nUse the optical zoom while shooting superb 720p HD movies with stereo sound\nIf you long for the convenience of an advanced still camera that also creates superb movies, the new PowerShot SX20 IS lets you record video in beautiful high definition (1280 x 720 pixels). The camera also makes it easy to enjoy HD movies (and still photos) on your HDTV with a mini-HDMI connector for direct connection to a high-definition monitor. You'll enjoy the HD experience with no degradation of image or audio in the signal, plus the ability to display up to 130 thumbnails at once. \n\nImproved Smart AUTO intelligently selects the proper settings\nJust set the Canon PowerShot SX20 IS to Smart AUTO and you're ready for maximum enjoyment from your picture taking every time. It's a relaxing and satisfying way to shoot because you can completely concentrate on your subject knowing that the camera has the technical details covered. Advanced Canon technology intelligently analyzes your situation and shooting conditions. Then it automatically selects an appropriate setting from 22 specially defined settings. So whether you're photographing flowers, a captivating sunset, or your friends at the park, you can be confident that you're getting dramatic, memorable images. \n\nShooting Modes\nAdvanced presets for the best possible photos under certain conditions. With 24 Shooting Modes, you're ready for whatever shot comes your way. \n\nDIGIC 4 Image Processor \nCanon’s proprietary DIGIC Image Processors have long set its cameras apart from the competition, and the new DIGIC 4 sets the bar even higher. Faster, more accurate noise reduction delivers better image quality, even at high ISO speeds. \n\niSAPS Technology is an entirely original scene-recognition technology developed for digital cameras by Canon. Using an internal database of thousands of different photos, iSAPS works with the advanced DIGIC 4 Image Processor to improve focus speed and accuracy, as well as exposure and white balance. \n\nLarge 2.5-inch Vari-Angle LCD enables easy viewing\nThe camera’s 2.5-inch LCD screen gives you the big picture, whether you’re shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear picture to make shooting, playback and using the camera’s menu functions especially convenient. Clear and bright, it also features Night Display for easy viewing in low light. It also has an electronic viewfinder that provides sharp images when you shoot close-up with Super Macro shooting mode. \n\nThis AA battery powered camera enables you to easily power up\nConveniently, you don’t need to worry about running out of batteries or having to recharging them. Since AA-size batteries can be purchased at any store, simply get new ones locally wherever you go--no special power adapters or chargers are needed. \n\nWhat's in the Box  * PowerShot SX20 IS Body \n * AA-size Alkaline Battery (x4) \n * Neck Strap NS-DC4 \n * Lens Hood LH-DC50 \n * Lens Cap \n * Digital Camera Solution CD-ROM \n * USB Interface Cable IFC-400PCU \n * Stereo Video Cable STV-250N",
    "rating": 4.4,
    "feature_bullets": [
      "High-powered 20x wide-angle optical zoom with Optical Image Stabilizer",
      "Capture 720p HD movies with stereo sound; HDMI output connector for easy playback on your HDTV",
      "2.5-inch Vari-Angle System LCD; improved Smart AUTO intelligently selects from 22 predefined shooting situations",
      "DIGIC 4 Image Processor; 12.1-megapixel resolution for poster-size, photo-quality prints",
      "Powered by AA batteries (included); capture images to SD/SDHC memory cards (not included)"
    ],
    "specifications": {
      "Product Dimensions": "5.04 x 3.43 x 3.46 inches",
      "Item Weight": "1.32 pounds",
      "ASIN": "B002LITT3I",
      "Item model number": "SX20IS",
      "Batteries": "4 AA batteries required.",
      "Customer Reviews": "4.4 out of 5 stars561 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#76,248 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 19, 2009",
      "Manufacturer": "Canon",
      "Language:": "English"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": ""
  }
}