{
  "website_summaries": [
    {
      "verdict": "One of the best budget-friendly upright exercise bikes that still provides a realistic ride.",
      "pros": [
        "Ergonomic pedaling thanks to adjustable foot strap, regardless of foot size",
        "Foam handles have a built-in monitoring sensor to keep track of heart rate and other biometrics",
        "Seat is comfortable and adjustable",
        "Fits in a small space without folding"
      ],
      "cons": [
        "Some experience an annoying clicking noise when bike is in use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It's also a nice compact size for our small home",
      "text": "I was unsure about buying this bike because it was so inexpensive, but my husband wanted an inexpensive bike in case he didn't use it. Well, he was right, he didn't use it, but I use it all the time. I don't know why anyone would want one of those expensive bikes when this one has everything you need--tracks time, distance, speed, etc. and has a resistance knob. It's also a nice compact size for our small home. I've used it almost everyday since we bought it and have had no problems with it.",
      "rating": 5.0,
      "verified": true,
      "author": "suem",
      "helpful_votes": 99,
      "publication_date": 20180119
    },
    {
      "title": "Easy to assemble, nice work out.",
      "text": "I was able to assemble it by myself in 45 minutes. Tensions are good and you don't even need the highest tension to get a nice sweaty work out. It's not very heavy and doesn't occupy too much space in my small apartment. The white padding in the photo is something extra that I bought but the original seat is not very hard material either.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Shopper",
      "helpful_votes": 27,
      "publication_date": 20160807
    },
    {
      "title": "Piece of Garbage",
      "text": "Computer system did not work on bike. Also noticed the sound others described of the belt grinding against its own insides. This is a cheaper model that the one Marcy had around 2010 for the same price. Bike is too wobbly and shakes when you try to pedal standing up in it, making that type of riding very hard. Look guys, I'm as cheap as they come, and I really didn't want this bike to be Garbage but it is. Thankfully Amazon refunded me.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20171018
    },
    {
      "title": "Not for daily use! literally falls apart after weeks of use!",
      "text": "The Marcy Upright Upright Exercise Bike ME 708 is Not made for daily/extensive use. I’ve had at least 4 of this exact bike, I just keep burning through them. The current one I purchased last September 2019, and I’ve had to have it fixed after the ball bearings inside the bike fell apart, and I’ve had to replace the right pedal after only a few months of use. I use it almost every day, often for several hours at a time, and this bike isn’t apparently made for daily use. Every time I repurchase this bike it lasts for less time. This is definitely the last Marcy ME-708 I will ever purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "heath-tastic!",
      "helpful_votes": 2,
      "publication_date": 20200307
    },
    {
      "title": "Do not purchase!",
      "text": "Horrible bike! It came dented and bruised on plastic body. They sent the wrong bolts for the seat so it doesn't screw on securely to the seat post. I would recommend spending a bit more on a better quality bike.",
      "rating": 1.0,
      "verified": true,
      "author": "AmyRick",
      "helpful_votes": 9,
      "publication_date": 20171214
    },
    {
      "title": "Exactly what I was looking for",
      "text": "This bike is exactly what I was looking for. It is pretty lightweight (about 50lbs) but is still very sturdy. It runs with magnetic resistance so there are no cords or plugs. The screen is run using batteries. I found it easy to put together own my own and the instructions are easy to follow. The seat adjusts to be comfortable for me (I'm 5'2\") and my boyfriend who is 5'10\". It doesn't wobble or flex when being used with upwards of 200lbs of weight. Definitely a great buy for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay G.",
      "helpful_votes": 11,
      "publication_date": 20170130
    },
    {
      "title": "Not as good as I'd hoped",
      "text": "I wanted a simple, easy-to-ride, upright exercise bike. This one had many good reviews, so I chose it. One design flaw that could be easily fixed is the way the seat is adjusted up or down. The screw-in bolt is ridiculous. It would be better to have a spring-loaded plunger as I had on a former bike. The bike is not quiet because it makes a thump every time the pedal goes around. I can't see any cause for this. The bike is level and on a mat. A simple, old-fashioned exercise bike would be better than this. Disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "cduboise",
      "helpful_votes": 2,
      "publication_date": 20190324
    },
    {
      "title": "Broken upon arrival twice!",
      "text": "Broken upon arrival not once but twice! Completely packaged both times. There is obvious quality control issues in the production of this product. I would not recommend buying this bike. Again, would never recommend buying this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Catherine",
      "helpful_votes": 17,
      "publication_date": 20160218
    },
    {
      "title": "It works weell.",
      "text": "This is my third Marcy Exercise bike the Hold up rather well. As with all exercise bikes they wear out over several years of daily use. Just purchased my latest one. 1st off I like the new handle bar mount. I ended up reversing it for my liking. It does not sit as stable as the last to. The feet are a little to close to gather and that is the reason for 4 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Old Timer",
      "helpful_votes": 2,
      "publication_date": 20191231
    },
    {
      "title": "Defective af",
      "text": "Item arrived janky af. The right crank pedal was not threaded at all. Making my time spent assembling the whole thing a massive waste. Everything else was fine. Bike is kinda flimsy but would have served purpose. My mistake. I was being cheap. Gonna get a better bike. Smh dissapointed",
      "rating": 1.0,
      "verified": true,
      "author": "MyDogIsMyLife",
      "helpful_votes": 2,
      "publication_date": 20200814
    },
    {
      "title": "Great value. I like it!",
      "text": "I like the bike. I was able to put it together myself. Directions very easy to follow. I am 5'6 and weight 250. I was able to adjust the seat and fit rather well. I agree the seat is hard. The handles are also a bit hard. But other than that I like it. Very quiet and easy to move around! Smooth ride.",
      "rating": 4.0,
      "verified": true,
      "author": "krista",
      "helpful_votes": 4,
      "publication_date": 20200314
    },
    {
      "title": "Basic starter stationary bike for those on a budget",
      "text": "This is a simple and basic starter stationary bike. It performs well and I get a fairly good workout riding it. I'm a hiker-swimmer-runner, so biking really isn't my thing, but this machine allows me to do a straightforward bike workout if I choose. Tension levels are acceptable for my level of biking interest. Only two complaints: First, the seat can be a little uncomfortable. Second, while I assembled the machine, the left peddle did not screw in completely due to some manufacturers defect (yes, I followed instructions very carefully). This wasn't a big problem, as I was able to tighten the peddle enough that it felt secure (for now).",
      "rating": 4.0,
      "verified": true,
      "author": "Chad",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Horrible. Way too much tension. Wobbly. Cheap.",
      "text": "This is a horrible product for people who need/want to do long intervals or low intensity cycling. There is entirely too much tension in this bike. I’m shocked at all the positive reviews. Furthermore it’s wobbly and cheap.",
      "rating": 1.0,
      "verified": true,
      "author": "SB",
      "helpful_votes": 4,
      "publication_date": 20190217
    },
    {
      "title": "Will do for the quarantine but has flaws...",
      "text": "Decent for price range and small footprint to get me by during the Corona quarantine. Key points: 1. Motion/Rotation feels odd especially at high resistance. Almost like the path is not ideal for cycling. I can deal with it once I get used to it. 2. Dents and pits in the plastic casing. Just like in other reviews. For the price I didn’t care too much. 3. One pedal plastic hook for strap is cracked off. 4. Small footprint (what I wanted) is slightly unstable if you’re pedaling like a manic. Not for spin enthusiasts.",
      "rating": 3.0,
      "verified": true,
      "author": "Mr Black",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Decent but booty hurts so it’s difficult sitting long timr",
      "text": "Got a pretty good workout. It was pretty challenging. I thought it was going to peddle easily, but you need to use strength. I don’t have a lot of strength. I was hoping it would feel more light peddling but I guess I can build up strength for this. Didn’t realize how weak I am until peddling this today.",
      "rating": 4.0,
      "verified": true,
      "author": "Keela",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Perfect Bike!",
      "text": "I really am enjoying this bike. It is totally quiet, absolutely no noise. It was VERY EASY to assemble. Over the years I have owned several exercise bikes, but this is by far the best. The packaging was perfect and the directions for assembly were easily understood. It is comfortable, quiet and very easy to use. I have owned other Marcy equipment, but this is my first Marcy bike. Anyone should be able to assemble this with no problems. It is simple step by step with everything perfectly identified. Great packaging and directions....and a great bike.",
      "rating": 5.0,
      "verified": true,
      "author": "amazon fan",
      "helpful_votes": 3,
      "publication_date": 20161129
    },
    {
      "title": "Eh.",
      "text": "The size of this bike made it ideal for my living space but it is annoyingly squeaky and now that I’ve hit the 1,000 mile marker the pedals are making a clunky, crunchy noise every rotation. It’s ok for a cheap bike and you get what you pay for. I wish I had invested into a better quality bike. This will be in the dumpster before I hit 1,500 miles, I fear.",
      "rating": 3.0,
      "verified": true,
      "author": "C. McDonald",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "This bike is it!",
      "text": "I was a little nervous when buying this bike because the reviews were 50/50 . I am SO HAPPY I bought it now and I've only had it for 2 days. I bike about 90 minutes per day and this bike makes me want to go even longer. It was extremely easy and fast to assemble. It took about 40 minutes tops! I rode it the very second I had it built. The resistance knob on there is good and easy to switch while riding. The bike is very stable and comfortable at the same time. I'd buy this again or as a gift for someone who wants an at home bike. This is by far WORTH it.",
      "rating": 5.0,
      "verified": true,
      "author": "Evie Kafri",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "It does the job and no issues with the seat!",
      "text": "I bought this bike after the gyms closed because of the virus. It was pretty easy to put it together and it’s light so I can easily move it around if needed. You can not expect mind blowing quality for the price but it’s pretty decent. I use it every morning for fasted cardio and it does the job. The seat is SOFT!",
      "rating": 5.0,
      "verified": true,
      "author": "AnnaBanana",
      "helpful_votes": 2,
      "publication_date": 20200419
    },
    {
      "title": "Very simple, but gets the job done",
      "text": "This is a very nice basic bike. No bells and whistles, just a resistance dial and monitor with speed, mileage, and calories. The seat only adjusts and it only goes up and down. However, I’m 5’7” and I have the seat at the highest level. If you’re any taller, this bike may not work for you because the handle bars don’t adjust.",
      "rating": 4.0,
      "verified": true,
      "author": "Kathleen O'hara",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Five star basic bike.",
      "text": "This is a basic bike to keep this basic b**ch moving while binge watching my shows. I would like to have more resistance, more bells and whistles, greater stability and more color options- However, I also dont want to spend that money. This is a super bike for super cheap!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Merlino",
      "helpful_votes": 2,
      "publication_date": 20180803
    },
    {
      "title": "Decent bike",
      "text": "Actually the bike did not work out well for me. The angle of he seat made it very uncomfortable and the bike itself is not very stable. It wobbles back and forth. I would have returned it, but I threw out the box and it's easier just to keep it in the basement.",
      "rating": 2.0,
      "verified": true,
      "author": "Gsromeo",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Wow this bike killed my tailbone. I am by ...",
      "text": "Wow this bike killed my tailbone. I am by no means a cyclist I just use stationary bike in the morning for exercise. I bought this because my other bike fell apart and I needed something quick and cheap. I used this two days in a row and the second day I had to cut my time short as I was having pain in my tailbone. I sent it back. Took a few days for my backside to recover.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Munsey",
      "helpful_votes": 4,
      "publication_date": 20171021
    },
    {
      "title": "Works fine",
      "text": "Came in good condition. It was a little dented, but that didn't affect any of its function. I returned it because you CANNOT STAND on the bike to do a standing workout. I initially saw it for $149 and purchased it when it was on sale for $129, but I saw it for $119 shortly after I purchased it. Everything works fine if you're only looking to do a sitting workout. It's very quiet and fits in small places which is one thing I loved about it.",
      "rating": 5.0,
      "verified": true,
      "author": "Gold Chang",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Small but effective",
      "text": "I'm 6-3 and use this with ease. Wouldn't recommend for any taller though. The magnetic tension is relatively smooth. Adjustable tension. Nothing really fancy but for the price very effective. The speedo/ timer feels kinda cheap. Need to reset it every time you start back up or it will just continue where you left off from the last workout. But it works and for the price I'm very happy. It's also small and light enough to move out of the way when not in use.",
      "rating": 4.0,
      "verified": true,
      "author": "keith cook",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "I use the two higher resistance levels and it's a good workout. I'm 6'1\"/180lbs and while it does feel ...",
      "text": "I've had this bike for about 4 months, using it every other day or so, and it's held up. Display is simple but displays what you want to know (distance, cals, time, etc); wish it was backlit but the batteries last longer without so, it's a trade-off. I use the two higher resistance levels and it's a good workout. I'm 6'1\"/180lbs and while it does feel a tad top-heavy/wobbly, as long as you're mindful of that and are on an even surface, you're good to go.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason G.",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Horribleee",
      "text": "This is sooo awkward to sit in. It felt like my back was going to snap, I had to reach so far down with my arms to reach the handles. I really felt like I was at a horrible incline. The legs were so stiff, I could not imagine spending more then 3 minutes on this machine. You could not move the pedals fast, or easily. It really hurt my back, and the seat was beyond uncomfortable.",
      "rating": 2.0,
      "verified": true,
      "author": "Tessa",
      "helpful_votes": 2,
      "publication_date": 20170309
    },
    {
      "title": "Perfect for what it is",
      "text": "Silent. It's actually silent. I get on there in the middle of tv show marathons and movies to heal my restless leg syndrome. Cannot hear a thing...doesn't bother the husband. So small. Cant compare to a big exercise machine. Have to say i dont think id do a Real workout on it, although it'll make you sweat for sure. It is what you make it but this is a really inexpensive simple way to get something rather than nothing...while you're doing nothing but sitting on your butt.",
      "rating": 5.0,
      "verified": true,
      "author": "S. B",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Its not awful but its not good for me.",
      "text": "I'm giving it 2 stars because I was led to believe anyone of any height can fit this bike, even after doing a ton of research. I'm 5'0\" and though I can reach the pedals it isn't comfortably, I wish there was just one more hole to put the seat down. I also don't like the feel of the pedals/wheel, it isn't smooth, it almost feels off track? I threw out the box, I don't know if they'll let me return it without the box but I'm thinking about it.",
      "rating": 2.0,
      "verified": true,
      "author": "Caitlin Bottoms",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "A good purchase",
      "text": "I just purchased this product. It was packed well, all the necessary tools were provided and it was really easy to assemble it together. I started using it and honestly it is a very good cardiovascular machine. It has basic features such as time, calories burned and speed which is enough for the bike it is. I think if you want a small compact home bike, this one is recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "FatimaKhanam",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Works great!",
      "text": "Love this bike. My husband and I have a small house and no room for big exercise equipment so we purchased this bike to use inside while I watch the kids or while we're watching tv. It has worked great, and been surprisingly sturdy (which I worried about with it being so small). The only issue is that sometimes it squeaks and the seat can get uncomfortable after biking for a long time.",
      "rating": 4.0,
      "verified": true,
      "author": "Hayley Baker",
      "helpful_votes": 3,
      "publication_date": 20160429
    },
    {
      "title": "lasted less than a month",
      "text": "I purchased this bike on 04/23 and by 05/17 it had stopped working and there was 0 tension. I only used this maybe 8 times during that time period and road it at a very moderate pace. While the price was right the quality was not.",
      "rating": 1.0,
      "verified": true,
      "author": "SoonerMom1",
      "helpful_votes": 4,
      "publication_date": 20180518
    },
    {
      "title": "Awesome quiet bike",
      "text": "my 14 year old put it together. not hard. I love it. it makes you sweat. So quiet i can ride it while watching tv. you can barely hear it. ive have other indoor bikes they were so loud. its takes up very little space. the seat could be a little softer. i order a seat cover with padding. also i ordered a phone holder(6.00). so i can watch shows with headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzette P.",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Great! Especially for the price!",
      "text": "This is a great bike for the price!! We've used it almost daily for the last two months since purchasingt. The seat is slightly uncomfortable but not a deal breaker. It makes a little noise while riding but again, not enough to make it miserable or distracting. I usually have the TV or music on while riding so after a while I don't notice. If you're looking for a bike to just ride casually and get a good workout in your home, this is the bike for you!",
      "rating": 5.0,
      "verified": true,
      "author": "linds",
      "helpful_votes": 0,
      "publication_date": 20170317
    },
    {
      "title": "Really Impressed!",
      "text": "I've only had it a week, but have been giving it quite a workout - and vice-versa... My 13-year-old son put it together for me, and only needed adult help for the same single element everyone has noted in other reviews about the assembly. I'm 5'9\" and 170 lbs, and am super comfortable using the bike in terms of stability, seat-adjustment, etc. I've been a runner for six years, but now I have messed up knees and a messed up foot - so my doctors have forbidden me from running. So - this bike is my new cardio - and it works beautifully! I think the resistance is challenging enough. Still amazed it's so inexpensive. And super quiet too....",
      "rating": 5.0,
      "verified": true,
      "author": "MAG",
      "helpful_votes": 5,
      "publication_date": 20140813
    },
    {
      "title": "Good bike",
      "text": "- occupies little space - easily moved around - used it for about 3 yrs now, no problems - no extra gimmicks, does what it is made for",
      "rating": 4.0,
      "verified": true,
      "author": "Kapil Vashisht",
      "helpful_votes": 2,
      "publication_date": 20200820
    },
    {
      "title": "1) Excellent price and well-built",
      "text": "Pros: 1) Excellent price and well-built. 2) Compact: the upright is easy to stow even is a fairly busy room between uses. 3) Quiet operation. Cons: 1) Not very strong resistance even at max setting. This does have some adjustment in the handle neck. The assembly procedure might leave the resistance at lowest range and can be adjusted internally with some disassembly required. 2) Another Marcy tradition: The seat is very uncomfortable. 3) Can be unstable as the support base is narrow gauge. This is a \"meat and potatoes\" upright bike, carrying on the Marcy tradition of sturdy and cost-effective equipment. The handles are stationary.",
      "rating": 4.0,
      "verified": true,
      "author": "James A. Oconnor",
      "helpful_votes": 2,
      "publication_date": 20160229
    },
    {
      "title": "Sturdy equipment with no electricity needed!",
      "text": "This fits behind my couch and doesn't need any electricity. It was easy to assemble and works great for what I bought it for. I needed something to use on days I can't get to the gym. Only thing I would change is the seat levels. I have long legs and on the tallest setting my legs are still pretty bent, more than I'd like for this type of equipment. Other than that its pretty easy to move and seems pretty sturdy.",
      "rating": 4.0,
      "verified": true,
      "author": "Ken's Birthday ideas",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Blah",
      "text": "Rubber belt drive . Price needs to be lower than listed.",
      "rating": 3.0,
      "verified": true,
      "author": "The Man",
      "helpful_votes": 2,
      "publication_date": 20200530
    },
    {
      "title": "Don't buy the like new product. Things are missing.",
      "text": "I made the mistake in ordering a like new bike. It came with out any of the bolts & screws or wrenches needed to put it together. Am still trying to find the screws needed to connect the handle bars to the bike. I can't use it till I find them. I would send it back but because I am slightly handicapped it too much to rebox.",
      "rating": 3.0,
      "verified": true,
      "author": "Bekki Booth",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Nice bike, LCD casing was cracked upon opening.",
      "text": "Got this bike an hour ago, put it together in 25 mins. Seems solid, nice ride, but the LCD screen came cracked (the plastic casing around the lcd was cracked significantly out of the box). Not sure how to go about replacing it, I don’t want to send it back. It works, but the LCD is the second to last step and I didn’t look at it until I was finished. Check the screen before building it!",
      "rating": 4.0,
      "verified": true,
      "author": "Joshua Goldberg",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Nice bike for the money.",
      "text": "I bought this bike because I recently had knee replacement and needed it for at home therapy. It works well, is quiet and has numerous levels of intensity so I can get a better workout as I recover from surgery. My daughter is a runner and uses it on rainy days in place of running. The seat is not as comfortable as we would like but that could be fixed with a seat cushion. In all, we are happy with the bike and feel it was a good buy for the cost.",
      "rating": 4.0,
      "verified": true,
      "author": "Djvan",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Didn't feel very much like my outdoor bike.",
      "text": "Cons: 1. The pedal crank length was shorter than my normal bike so I didn't have the same range of motion when pedaling. 2. The stance isn't very wide so it would wobble on my carpet while pedaling. Pros: 1. Lightweight 2. Quiet 3. Easy to assemble I ended up getting a cycle bike to replace this as this didn't do a very good job at feeling like I was riding my outdoor bike.",
      "rating": 3.0,
      "verified": true,
      "author": "Danny Davis",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "This is a fantastic bargain!",
      "text": "I got this today. The quality of this machine exceeds my expectations. All the parts were there as well as a couple of tools to help put it together. The machine went together well, no parts left over or parts that didn't fit. The machine is light but sturdy. the bike works well. amazing how quiet this machine is. It makes little to no noise, perfect for apartments! If you are thinking of getting a stationary bike this is the one!",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Huge Dent On Bike",
      "text": "I know this product is on the cheaper side so I can’t expect it to be that great but I did expect it to come in good condition. Upon opening the box, there was a huge dent in the main piece that is extremely noticeably. The dent is causing the piece to not be completely connected to the piece on the other side. Like I said, I know what I’m getting paying for a bike on the cheap end but I was extremely disappointed that it showed up like this...Will not buy from this manufacturer again.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Great purchase!",
      "text": "So far so good! The seat is a little hard but not unbearable. I read reviews before buying it and the most common issue was installation. I'm here to tell you I've put together futons from Walmart that were much harder to put together. Really clear instructions, everything isn't just labeled but numbered. Also, I live on the second floor of an apartment building and my downstairs neighbor couldn't hear a thing, even if I was peddling really hard. Honestly, completely silent and easy to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "TheCareFreeDude",
      "helpful_votes": 2,
      "publication_date": 20170927
    },
    {
      "title": "Sturdy Little Bike",
      "text": "I only had a corner of my living room to fit something and this ended up being the perfect choice. Nice and sturdy with lots of information on the digital read out - you can even keep it ongoing so next time you get on it will continue to add up your time, distance, calories etc until you clear it. The dial gives you the work out you need with easy adjusting as you ride. The seat could be softer I have to say.",
      "rating": 5.0,
      "verified": true,
      "author": "SRobertson",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Happy with purchase",
      "text": "Excellent and compact design, great to have at home, is not gym quality but keeps you moving and it doesn’t take a lot of room. Great starter if you are on budget and just need something that does the job",
      "rating": 5.0,
      "verified": true,
      "author": "ceci B ",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Came scratched & computer doesn’t work. Not good!",
      "text": "Save your money up & get a better quality product. It does the job, but hardly. First off it was delivered with scratches all over it. The computer function does not work on it at all, set it up & followed the directions to a T & it doesn’t turn on. The tension is good for a cheaper product. I honestly wish I could return it but I’m not going to take the bike apart when it took 2 hours to put together lol. Do not recommend!!",
      "rating": 2.0,
      "verified": true,
      "author": "Kenzi",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Great purchase!",
      "text": "I have been using this with my Peleton app and it works great! I am able to up and down on the resistance when the instructor says lol so I’m good! I sweat my ass off and I get up my heart heart and the weight has been dropping! It’s not too big so it’s perfect for my condo!",
      "rating": 4.0,
      "verified": true,
      "author": "Jen 🖤",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "9/10",
      "text": "Very nice little bike for a good price. However the seat is very very uncomfortable - I even have a cover for it & it still is as hard as a rock. So I would recommend not spending the money on a $20 seat cover & just putting a piece of foam or something over the seat. Other than that yeah it’s a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Christina Andrews",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "The colors are great and we haven't had to change the batteries in ...",
      "text": "We have had this bike for a year. All 5 of us use it and vary in weight and size from my 10 year old to my 6'1'' 180 lb husband. I will say that one day a crack appeared in the plastic near one of the pedals which has not taken away from the function, but may be a cause of concern in the future which saddens me since it is used only for its intended purpose. The colors are great and we haven't had to change the batteries in the display yet. I love the adjustable seat height.",
      "rating": 5.0,
      "verified": true,
      "author": "MB",
      "helpful_votes": 0,
      "publication_date": 20160518
    },
    {
      "title": "Surprised how much I love it!",
      "text": "I was worried this bike would be cheap with the low price but I like it better than an expensive one I used to have! It’s great for using in small spaces and really easy to slide out of the way. The resistance is easy to change and the calorie count is really similar to what my Apple Watch reads.",
      "rating": 4.0,
      "verified": true,
      "author": "Elizabeth Reynolds",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Excellent value",
      "text": "Excellent value for the money. This is a heavy duty, well built exercise bike with silent operation and a good range of resistance. It took an old lady like me a little over an hour to assemble, carefully following well written (fool proof) step by step directions. All the required tools and hardware were included. I'm very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "A lovely coat rack!",
      "text": "I've had this bike for a while and have hardly used it. The seat is extremely uncomfortable and I have tried every modification I can think of to make it better. I wanted my own bike for convenience but I still regularly use the ones at the gym over this. It's really great for hanging laundry on though!",
      "rating": 1.0,
      "verified": true,
      "author": "Cassiday",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Decent purchase for the price",
      "text": "I have had this bike for almost a year and a half. It was pretty easy to assemble if you follow directions. The only issue that I have is that it started making a grinding noise about 4 months ago. I have about 950 miles on it and have used it on tension settings 3, 4. and 5. I found my booklet which states it under a two-year warranty. I will see what the manufacturer has to say about.",
      "rating": 4.0,
      "verified": true,
      "author": "Becca B",
      "helpful_votes": 3,
      "publication_date": 20170308
    },
    {
      "title": "You get what you paid for",
      "text": "When I first got the product I was overly joyed and ready to put it together and go to work but after a month it broke nothing I assembled broke or anything like that it’s just as I was really getting to it the resistance gave out or something . The wheel stopped spinning and you can tell it was like a chain or something slipped. Unfortunately the screws for the main compartment ideally the chain and wheel you are unable to access as easy as the bolts and screws. I loved it when I first got it but now I’m just disappointed. Amazon has been great but contacting the manufacturer for a warranty has been a pain.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "I'm very pleased with this bike",
      "text": "I'm very pleased with this bike. It has a small footprint and is very quiet; I can watch tv while I ride without having to turn up the sound. It's right by my husband's recliner and he even falls asleep. The seat is a tad uncomfortable but it helps quite a bit if you sit farther back. Not a heavy duty bike but I'm a short female and I couldn't find anything that could beat it at this price.",
      "rating": 4.0,
      "verified": true,
      "author": "Indynana",
      "helpful_votes": 2,
      "publication_date": 20170207
    },
    {
      "title": "The bottom line is that this a good, basic bike",
      "text": "The bottom line is that this a good, basic bike. It's not that heavy, and it's not terribly difficult to put together. I use this for exercise, and can do a half-hour at a time while the top is a decent rest for my ipad. Granted, I have a rubberized case, otherwise tablets and phones will certainly slide off. It's a simple machine without any real bells and whistles. If you really want to see a constant computer update with your calories, distance, pace, etc., then this isn't for you. If you absolutely do not care about any of that, then this is for you.",
      "rating": 4.0,
      "verified": true,
      "author": "BrimmChar",
      "helpful_votes": 2,
      "publication_date": 20160927
    },
    {
      "title": "Great for casual every day use",
      "text": "Great for casual every day use! I wouldn't go crazy cycling class on it though. I think that's where others started breaking problems with it. I use it for an hour or so every day and it's holding up great! As for the seat reviews, it's really not that bad once you get use to it. It's slightly better than the normal average run of the mill bike seat. With that said, if you're not use to ridding a bike, yes your but will hurt at first! Lol",
      "rating": 5.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Great exercise bike!",
      "text": "This is a great exercise bike. I've owned it for over 3 years now but sadly the wheel that the belt sits on finally broke. I bought the same bike again but am trying to order a replacement wheel as well. That way we'll have 2 exercise bikes for our home-gym. Would definitely buy again(did!).",
      "rating": 4.0,
      "verified": true,
      "author": "AW",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Seat is a deal breaker",
      "text": "The bike is ok - wiggles a bit when riding. Peddling is not super smooth, but it could be worse. The seat is HORRIBLE, though. And it cannot be adjusted or replaced at all. I would buy a different bike had I known how awful the seat is. Makes for a very uncomfortable exercise session .",
      "rating": 2.0,
      "verified": true,
      "author": "L. Payton",
      "helpful_votes": 2,
      "publication_date": 20170909
    },
    {
      "title": "Love it!",
      "text": "I managed to get it upstairs and assemble it by myself in less than an hour. When attaching the screen bits, it would have been much easier with a second set of hands. It gives me a good workout! I’m very impressed with the quality, price, and noise level. It’s a very quiet bike.",
      "rating": 5.0,
      "verified": true,
      "author": "dothemacarena",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Quiet and comfortable.",
      "text": "Quiet and sturdy. I have it for 3 months now and its holding up very well. I can watch TV and dont have to turn up the volume at all. It able to put it together in about 30 minutes. Display/computer is basic and but gives you the data that matters. I was able to find a seat height and sitting position that was comfortable for me. i'm 5'8 160lb. I would recommend this without reservations.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Yeung",
      "helpful_votes": 2,
      "publication_date": 20170203
    },
    {
      "title": "Space saver",
      "text": "No noise . It works great . It’s pretty good for the price . If your trying to save money and space this one is the one !",
      "rating": 5.0,
      "verified": true,
      "author": "Erica",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "wrongly advertised",
      "text": "This bike is super small and it should be labeled and advertised for short people only. I am 5'10\" and the saddle has to be at the highest point which makes it super awkward to grab the handle bars. My seat is virtually higher than the knob that sets the resistance, which leaves me with only one choice to ride sitting upright. And speaking of resistance, you can choose from 1-8 and let me tell you there is almost no difference between them, it's a joke, really. The material is lots of plastic, the bike is not very sturdy when you work the pedals, but it stays flat on a mat. On a tile or wood surface it moves around.",
      "rating": 2.0,
      "verified": true,
      "author": "Watership Down",
      "helpful_votes": 0,
      "publication_date": 20151101
    },
    {
      "title": "My favorite piece of exercise equipment",
      "text": "I have arthritis in my knees and my doctor told me to use an exercise bike or an elliptical. The bike takes up much less room and is much easier to spend more time using. It takes up very little room in my living room and is very comfortable to ride. Had a little help with assembly but all is good.",
      "rating": 4.0,
      "verified": true,
      "author": "Karen Darling",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Awesome You have to buy this",
      "text": "You got to buy this bike super quiet lightweight but sturdy easy to put together brings the tools with it has a clock on it it is the best bike I've ever owned stationary it's worth working out the extra 40 bucks compared to the one next to it and it's awfully pretty it looks better in person than it does on the picture very small I thought my last bike was small this is perfect",
      "rating": 5.0,
      "verified": true,
      "author": "MayBHelpfull",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Bike can broken",
      "text": "I was very disappointed in this bike. The wires that are supposed to connect the screen to the pedals are broken. I will be sending the bike back, but and very disappointed in the vendor that they don't have better quality control.",
      "rating": 1.0,
      "verified": true,
      "author": "Suzanne",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Very Good Winter Conditioning",
      "text": "The bio-mechanics are very close to that of my road bike--providing very good conditioning during the 2-3 months that sand and ice preclude normal bike riding. Assembly was easy; directions very clear. A good idea to read the directions first, and to dissemble, carefully, bolts, washers, etc. The resistance could be a little higher (reason for the 4-Stars), but it takes up very little space in my basement office and is easily moved. Excellent for off-season winter conditioning. Great buy too!",
      "rating": 4.0,
      "verified": true,
      "author": "Burke Liburt",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Good little Machine",
      "text": "This is a good little machine for the price of it however, it is very wobbly so you cannot go fast it has to be a slow steady bike",
      "rating": 4.0,
      "verified": true,
      "author": "Charlene Galatian",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Great buy...great stationary bike",
      "text": "Easy to assembly. Doesn’t take up much space. For the price (a lot less than the current price) a great piece of equipment. Zero noise level. Comfortable seat (I do wear biking short). Strap on pedal fit well. Display easy to read. Have it in front of window no problem with sunlight shining in. Very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "JSB",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Excessive noise",
      "text": "Excessive noise is coming from mainframe. Pads are wobbling and slipping. Had similar problems with another marcy unit before it fell apart. This one is just 6 month old. Look like the company has serious quality issue. Beware.",
      "rating": 1.0,
      "verified": true,
      "author": "Sergei Tukanov",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "So Quiet",
      "text": "This just arrived today, so I have only done a few miles on it, but I love it already. Putting it together was a breeze and even though it is small and fairly light weight it still sits very securely on my padded carpet. As mentioned, it is extremely quiet and the action is very smooth. There were a few reviews I saw before I bought it, who mentioned the seat being uncomfortable. I found the same thing, until I lowered my seat by 2 notches and then it suddenly did not bother me any more. If you have problems, try playing with the seat height. Over all for the price this is an amazing product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 2,
      "publication_date": 20140224
    },
    {
      "title": "Great for small spaces",
      "text": "Great for small spaces and but some of the parts are cheaply made",
      "rating": 4.0,
      "verified": true,
      "author": "CHarp",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Decent bike",
      "text": "This is a great bike for the price. It gives a good workout for the gluteals and thighs. It is very quiet and doesn’t shake when riding it. The only downfalls are that the seat is very firm and uncomfortable, and the handle bars force me to ride the bike hunched over, which hurts my back after a while. Would be nice if there was a cup holder on the bike.",
      "rating": 4.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "LOVE LOVE LOVE",
      "text": "Seriously the PERFECT bike. My parents had this bike and when I moved out I really did miss it so I ended up purchasing my own. This is a great light weight bike that I can carry/move if I need too. It really does the trick and is greatly made. This is not a cheap bike and it does not reflect on the price. I love this bike!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "A lot more than cosmetic flaws...",
      "text": "I’m quite upset. My bike came REAL beat up... I bought a used one (for like $25 less because, you know, trying to be more sustainable and create less trash) fully Expecting some cosmetic flaws - but let me tell you my bike has way more than cosmetic flaws. To boot, the computer system Doesn’t work... so I couldn’t tell you if it was a good buy or not. Would return, but I know Amazon is on strike so idk if that’s even a possibility. Very unhappy with my purchase.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Love it!",
      "text": "This is perfect! Due to pandemic I can’t go to the gym this has been great! This has been a lifesaver! It’s light so I can move it and I can even carry it! Takes up small space. Love it! And this is the best price.",
      "rating": 5.0,
      "verified": true,
      "author": "Monica SIlva",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "Great exercise bike for price",
      "text": "This is my first exercise bike and it took about 1hr to put together. I am 6 feet tall about 260lb it has taken some time to figure out seat height and I need a bigger seat. Today I rode for 20 minutes and I feel good about it. It gave me a workout plan to up my time next week.",
      "rating": 5.0,
      "verified": true,
      "author": "br20042003",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Nice bike",
      "text": "This bike has been great. Some may find the lower resistances too easy, but a big part of using a bike like this is being able to control you peddling. The covering on the seat started to tear where it folds under, but the company was great about sending a replacement after registering the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Bungert",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Buy a seat cover",
      "text": "So far, I like the bike. Like anything else, assembly is based on skill level. I put mine together, by myself, in about ten minutes. The review that made me chose this bike was written by a young lady. She says you probably don't need a seat cover cause your not on it that long. Well, believe me, unless you have her \"young\" butt, you need a cover. Mine was killing me. I bought the simulated sheepskin cover and it helps alot. I'm still having a lot of muscle and joint pain after but wait to recover then try again. I don't see how it cannot improve anyones health.",
      "rating": 4.0,
      "verified": true,
      "author": "CLIFF C",
      "helpful_votes": 0,
      "publication_date": 20150911
    },
    {
      "title": "Very Good Buy",
      "text": "I'm glad I picked this bike....very smooth pedaling...practically no noise....plenty of resistance....and once you get used to it, the seat isn't bad either...a bit firm but your butt will get used to it....I'm 6'2\" and there's plenty seat height",
      "rating": 5.0,
      "verified": true,
      "author": "Mark E",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Pass on it",
      "text": "This is really a cheap crappy exercise bike. Don’t waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Charlene",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Worth it!",
      "text": "I purchased this bike in 2011 and for the price, I absolutely got what I paid for! It has only just recently started slipping gears when I pedal (regardless of tension) but I’ve been using it consistently for 8 years now. The computer crapped out last year and honestly I don’t really rely on it to track my workouts anyways, so I never bothered to fix it. It can be a little unstable on rugs, I find it works best on my hardwood floor. Overall, it’s a great investment for a small home gym or someone looking to fill the void on days they can’t make it to the gym. I am currently looking into another Marcy machine.",
      "rating": 4.0,
      "verified": true,
      "author": "kenzie",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Loud clanking noise",
      "text": "Perhaps I have the bad luck. So many reviewers said this bike was virtually silent, but mine makes a clanking noise while exercising. The clanking noise is pretty loud. I can't use it at night because I am afraid of waking up the kids. So this bike is just sitting there without being used... Also I agree with some of the reviews that the tension is very weak.",
      "rating": 1.0,
      "verified": true,
      "author": "XJ",
      "helpful_votes": 5,
      "publication_date": 20160618
    },
    {
      "title": "Very easy to assemble with a small footprint.",
      "text": "Very easy to assemble and doesn't take up a lot of space. Does creek sometimes but not bad. I'd give it 5 stars if I could turn the dial for harder resistance. I don't have superhuman legs honestly. Update 12/1/2018: I've had this for 13 months and finally reached 1,000 miles. It still works with nothing broken. You may noticed I installed the bars vertically. This was intentional and just preference. Still happy with the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "MSantos17",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Happy with purchase",
      "text": "This bike has a very small footprint. It will fit in every room of the house. I keep ours in the living room which isn't a large room, and point it toward the TV. It's small enough that it doesn't obstruct the view of the rv for anyone sitting behind me. It's very quiet, almost totally silent. It uses magnetic resistance with eight resistance selections. Because of the magnetic resistance, there isn't much that can wear out. I expect it to last a very long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Dale S.",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Love it!",
      "text": "Nice bike doesn’t take too much space do the job as the bigger ones!",
      "rating": 5.0,
      "verified": true,
      "author": "JCLproject",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Great machine",
      "text": "2nd day with it and so far I'm loving it. I assembled on my own which was pretty straight forward. The seat could have a bit more cushion though. So convenient since we are locked in. Burning calories, getting miles in.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Best value and features and very economical",
      "text": "Smooth, stable and operates as bike costing 3 times the price. Mounted a bracket to the handlebars for computer youtube, now I watch biking video's free while pedaling.",
      "rating": 5.0,
      "verified": true,
      "author": "Vincent F Rakstis",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Real Piece of Junk",
      "text": "The resistance knob doesn't change resistance. Seat is incredibly uncomfortable. I don't know if this is typical of a Marcy product, but this one is just awful. Use the money to buy a decent exercise bike, as this one is junk. Definitely, by far, the very worst magnetic resistance exercise bike I ever owned.",
      "rating": 1.0,
      "verified": true,
      "author": "Disappointed Customer",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "easy to assemble",
      "text": "I was able to assemble this on my own in under an hour. It is extremely quiet and lightweight for moving around - I am very happy with this purchase and would recommend it to anyone looking for a simple piece of home exercise equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "Cat",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Smooth ride like the gym!",
      "text": "It's been many years I've own an exercise bike and don't have a big budget so I found this to be the perfect pick for me. Is not too big and has a smooth ride. The seat is comfortable but not too hard or soft. Height adjustable seat fits both me (6') and wife (5'2\") no problem. I would actually compare the quality to going to the gym. Have a good workout!",
      "rating": 5.0,
      "verified": true,
      "author": "KAU",
      "helpful_votes": 4,
      "publication_date": 20160720
    },
    {
      "title": "This bike did not disappoint with its space saving but that was the only ...",
      "text": "I purchased this Marcy Upright Mag Bike because I wanted an exercise bike that took up a small amount of space. This bike did not disappoint with its space saving but that was the only good quality it had. It was not very stable while trying to get on or pedal. The biggest problem was that the pedals did not rotate smoothly. They would catch at the same place on every rotation. For that reason I had to return the bike.",
      "rating": 1.0,
      "verified": true,
      "author": "Trickster",
      "helpful_votes": 0,
      "publication_date": 20150621
    },
    {
      "title": "Love it!",
      "text": "I ordered this because the price was a steal. It's jsut a basic bike so nothing fancy but it getrs the job done. It's quiet and has a good amount of resistance. I wouldn't say the resistance will strengthen the legs very well but it does get the heart rate up quickly with the added force. When I got mine the LCD computer wasn't turning on so I used it without it for the first while. I emailed the manufacturer about it and they mailed me a replacement free of charge even though I hadn't purchased it from their website. Overall I'm happy with this purchase and the manufacturer's communication.",
      "rating": 5.0,
      "verified": true,
      "author": "vixen2188",
      "helpful_votes": 0,
      "publication_date": 20140101
    },
    {
      "title": "Excellent bike for the price!",
      "text": "The bike works quite well and we love that it doesn't take up a lot of room and that it can be easily moved with the sturdy wheels. It arrived and the monitor was not functioning but I called the company and was immediately sent a replacement! Excellent customer service. Very happy with our purchase. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Jeannie Soto-Valencia",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Great bike.  Best one on the market.",
      "text": "I am a personal trainer and I just wanted a small thing for a little exercise. This does it plus some. Light weight so I can move it from room to room. Tough on the resistance after a while. Almost 100% silent. It is so stealthy which makes watching TV and riding perfect. It has an odometer even when it shuts off and turns on later when pedeled. So amazing. Speed, distance, time and calorie settings too, plus a scan. Great bike. I bought it for just under a $100. I train people on $600+ bikes and this is even better.",
      "rating": 5.0,
      "verified": true,
      "author": "thetroz",
      "helpful_votes": 2,
      "publication_date": 20140322
    },
    {
      "title": "Nice bike",
      "text": "I prefer upright ex bikes - better core exercise - and was worried this inexpensive ex bike would be too wobbly. But no problem. It's lightweight, sturdy, and silent, so I can watch TV or listen to a book. I'm not a large person so don't know if vigorous pedaling by a heftier individual might be more precarious. Husband put it together without too much frustration.",
      "rating": 5.0,
      "verified": true,
      "author": "long walker",
      "helpful_votes": 0,
      "publication_date": 20161029
    },
    {
      "title": "Good bike for a small space",
      "text": "This bike is okay. It's nice to have in a small apartment. It is in no way near as powerful as any exercise bikes I've used in a gym, but it still allows you to move and I think that's what's important. If you want a powerful bike for muscle building, then you'd probably need to get a more high end bike.",
      "rating": 4.0,
      "verified": true,
      "author": "Savannah Goodin",
      "helpful_votes": 0,
      "publication_date": 20190322
    }
  ],
  "product_meta": {
    "title": "Marcy Upright Exercise Bike with Resistance ME-708",
    "description": "Build a fitter and healthier body right in the comfort of your home with the ME-708 Upright Exercise Bike from Marcy! Forget about gym memberships and save some cash by making your abode your new workout place. This exercise bike is designed to help you shed those extra pounds and build muscle by engaging in a full-body workout at home!\n\nMade from PVC, rubber, and premium 14-gauge steel tubing finished with a powder coating, the ME-708 Upright Exercise Bike has a high-quality structure that combines design and performance. This exercise bike machine has a sturdy structure that resists scratches, chips, and damages from the environment that guarantees your exercise equipment to withstand heavy daily use. The adjustable seat can accommodate users of different body types and the engineered structure promotes proper form during workouts and allows your body to conform precisely to the equipment so that your workout has maximum effect on your targeted areas.\n\nThis Marcy ME-708 Stationary Upright Cycle also comes with a magnetic resistance system with eight preset levels making it ideal for fitness enthusiasts of any skill. The resistance is adjusted with a tension knob to customize your cardio training according to your fitness level. The large console acts as an odometer and tracks time, speed, distance travelled, and calories burned in extra-large numbers for easy reading.\n\nThis bike is equipped with wheels for maximum mobility letting you easily transport it anywhere in the gym or your home and can be stored conveniently in a designated area. This upright exercise bike measures 31.5 x 48.75 x 18 inches.\n\nInvest in this premium gym equipment now, and experience safe and convenient cardio training without having to leave your house!",
    "rating": 4,
    "feature_bullets": [
      "PREMIUM STEEL CONSTRUCTION – This stationary upright bike features a premium frame of 14-gauge steel tubing, finished with powder coating that combines design and performance. It boasts both functionality and durability.",
      "SMOOTH MAGNETIC RESISTANCE SYSTEM –Designed for fitness enthusiasts of all skill-levels and comes with a magnetic resistance mechanism with 8 levels of difficulty. Tension knob simulates different terrains to customize routines according to fitness level.",
      "ULTRA-FUNCTIONAL CONSOLE – The ME-708 Upright Exercise Bike has a state-of-the-art LCD screen that acts as an odometer and displays time, speed, distance, and calories burned in extra-large numbers for great readability.",
      "ADJUSTABLE SEAT – The seat can be adjusted to accommodate users of different body sizes, improving form during exercise and allowing your body to conform precisely to the equipment, giving your workouts the maximum effect on your targeted areas.",
      "COUNTERBALANCED PEDALS – Pedals are designed to provide maximal foot support while giving you ultimate control. The ergonomic designs facilitate efficient workouts and are equipped with adjustable foot straps to create the perfect fit for your own feet."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "35 x 17.5 x 47.5 inches; 41 Pounds",
      "Item model number": "ME708",
      "Department": "Unisex-adult",
      "Batteries": "2 AAA batteries required. (included)",
      "Date First Available": "September 15, 2009",
      "Manufacturer": "Marcy",
      "ASIN": "B002KV383S",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Exercise & Fitness",
      "Exercise Bikes",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Cardio Training"
    ],
    "price": 124.99
  }
}