{
  "website_summaries": [
    {
      "verdict": "The pocket megazoom Kodak EasyShare Z915 is a good camera for those looking to step up from a fully automatic compact camera to something with more manual controls and a longer lens.",
      "pros": [
        "Very good feature-to-price ratio",
        "comfortable, sturdy design",
        "fast performance for its class"
      ],
      "cons": [
        "Photos can look overprocessed and noisy viewed at 100 percent",
        "small LCD"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 8.0,
        "Performance": 8.0,
        "Image quality": 6.0
      },
      "publication_date": 20090821,
      "rating": 7.6,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Kodak Easyshare Z915",
      "text": "I have had this camera before and know it is a great camera. Pictures are clear and the zoom is fantastic. This particular camera had a a couple of issues. It was manufactured in 2009 and might have been sitting for a while with the previous owner. The LCD screen has some small spots and light areas. I am able to use it but wanted to use it as a gift, which I can not do now. The pictures come out great but if this were a first camera for someone, they might have an issue.",
      "rating": 3.0,
      "verified": true,
      "author": "The Crew Dawg",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Love it!",
      "text": "I love this camera! So much so that after my first Z915 bit the dust from being exposed to the sandy beach and sea, that I ordered another one! The picture quality rivals those of a much more expensive camera. When people see the pictures, they always assume they are done by professional. Nope, just an amateur photographer with a great camera!",
      "rating": 5.0,
      "verified": true,
      "author": "Star A.",
      "helpful_votes": 0,
      "publication_date": 20150803
    },
    {
      "title": "How the spare camera becaim the main camera",
      "text": "For a camera that can be bought for under $100 - it's simply amazing! Excellent pictures on full auto, plenty of scope if you need to add some manual options, good videos even with decent sound. Some cool unexpected features like exposure bracketing for HDR (High Dynamic Range)picture construction sequences. Fast startup, fast focus, lots of options relatively light on the batteries. I got this as a spare camera to my Fuji SLR and my wife's Lumix, after a vacation using all 3 cameras, the Kodak ones were turning out consistently superior so it quickly became our main camera!",
      "rating": 5.0,
      "verified": true,
      "author": "Martin Waterhouse",
      "helpful_votes": 0,
      "publication_date": 20100912
    },
    {
      "title": "Spectacular camera for a beginner!",
      "text": "The Kodak Easy Share Z915 is an excellent camera, especially for those amateurs out there with a desire to start taking better photos. The focus on the camera is really good for objects close up, and the camera takes remarkable motion shots outside in natural light. However indoors, under unnatural light, motion produces undesirable blur. Also, another negative is that the camera eats up batteries. A little bonus, however, is that the camera can take videos with sound. The sound of the videos is of good quality; it does not have a tinny or bottle sound. All in all, the Easy Share Z915 is a splendid camera for a beginner who hopes to improve his/her photographic skills!",
      "rating": 4.0,
      "verified": true,
      "author": "Cook Family",
      "helpful_votes": 0,
      "publication_date": 20110804
    },
    {
      "title": "Great price on so-so product",
      "text": "I was excited when I came across this camera for under $80! However, as my mom used to say \"The cheap always turns out most expensive\". Although I've owned a Kodak Easy Share camera before, this one seems to have a win or lose outcome with the pictures it produces. Some pictures come out supersharp while others are washed out, blurry and all out too dark to see. Also seems to produce red eye in just about every picture. Some are correctable while a lot of others simply turn the red into bright yellow. Totally unacceptable! Next time, I'll spend the extra $ and purchase a Nikon or Canon.",
      "rating": 3.0,
      "verified": true,
      "author": " Chris Godoy",
      "helpful_votes": 0,
      "publication_date": 20110428
    },
    {
      "title": "best gift she ever got.",
      "text": "I purchased this camera for my wife for mother's day. She tells me it's the best present I ever got her. She loves it. It's very easy to use, well built, and it takes awesome pictures. The only knock against it is the battery life. You have to step up to some quality batteries because regular batteries will drain quickly. We use Energizer lithium batteries and they last at least six times longer then regular alkaline batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Pugh",
      "helpful_votes": 6,
      "publication_date": 20100608
    },
    {
      "title": "Great Utilitarian Camera",
      "text": "Bought this camera on Amazon for the amazingly low price of $88 delivered. I use a higher end Panasonic digital for my online store photos as most are shot using macro so this camera was strictly purchased as a pocket camera for travel. It fits that usage perfectly. If there is any complaint it would be that it is a little too large for most pockets, otherwise it is a sturdy workhorse and highly recommended.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Piltzer",
      "helpful_votes": 0,
      "publication_date": 20100920
    },
    {
      "title": "loved it!",
      "text": "I wore this camera out... I take a lot of pictures... loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen W.",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Bought for my 14 year old daughter",
      "text": "This camera was purchased for my 14 year old daughter to replace an older easy share camera. She loves the camera and I have had an opportunity to play with it (including the panoramic mode). The picture quality is very good. Settings/controls are user friendly. I would recommend this camera as a cost effective alternative to some of the higher end camera's of the same zoom range and megapixels.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas",
      "helpful_votes": 0,
      "publication_date": 20100812
    },
    {
      "title": "Kodak has always been my favorite",
      "text": "I got the Kodak Easyshare Z915 for Christmas and I'm so pleased. The quality of the pictures is great. It has so many features and in no time I was using most of them. Kodak quality is the best. I gave my husband my older Kodak camera and it's still going and it's 6 years old. I wanted to update for myself with the latest features on this new one. You won't be disappointed. And as always, Amazon had the best price with all their bells and whistles.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Ewers",
      "helpful_votes": 2,
      "publication_date": 20100201
    },
    {
      "title": "disappointment",
      "text": "Bought this camera prior to a trip to the UK...tried it out at home and had no problems...took tons of pics on my trip...got home, downloaded them and found 50% of the point-n-shoot pics were out of focus...the zoom shots turned out great...huge disappointment to see so many pics ruined by a faulty camera...plus, there was problems with the easyshare software, had to take a 4G card to Wal-Mart to get picture discs made due to inability to download straight to my laptop..have used Olympus and Canon cameras & software with no problems at all....these brands have fantastic point-n-shoot cameras...Kodak will never see my business again...buy this camera if you want to be disappointed with your vacation pics.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicholas L. Prince",
      "helpful_votes": 5,
      "publication_date": 20100911
    },
    {
      "title": "So glad to get exact replacement.",
      "text": "In the summer of 2014 I dropped this very same camera in a boat and it was ruined. This is what is wonderful about Amazon. I was able to get the exact same one, used, on Amazon. So, am very pleased I could replace with what was familiar to me.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary M. Jacobs",
      "helpful_votes": 0,
      "publication_date": 20140912
    },
    {
      "title": "Kodak Easyshare Z915 Digital Camera",
      "text": "I used to use an Canon AE-1 SLR film camera for work and hobby photography. Then everything went digital and I had a few digital cameras, but upgraded to this Kodak Easyshare Z915 Digital Camera, which has fantastic features and is almost as good as the digital SLR cameras at one-fifth the cost. I love this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard V.",
      "helpful_votes": 0,
      "publication_date": 20130116
    },
    {
      "title": "Finally, a user friendly camera",
      "text": "After numerous attempts, I have finally found a user friendly digital camera in the Kodak EasyShare Z915. Menus are easy to read and instructions easy to follow. I have picture quality excellent and controls are also user friendly. Of the four digital cameras I have owned, it is by far my favorite and I look forward to having it for a long time.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Skaggs",
      "helpful_votes": 0,
      "publication_date": 20101222
    },
    {
      "title": "Was a nice camera...right up to the point where it decided to stop working.",
      "text": "Bought this for my wife. We liked it, and it took good pictures for the price-point. We used it for about 6 months to a year, and it was never abused. Then one day it just stopped working. The lens would not extend. I will not be purchasing another Kodak camera.",
      "rating": 2.0,
      "verified": true,
      "author": "92FSTech",
      "helpful_votes": 0,
      "publication_date": 20140423
    },
    {
      "title": "take great pic's and easy on the wallet",
      "text": "I have owned 4 of these cameras.. They are tough, take great pic's and easy on the wallet. They don't make them anymore. I'm happy",
      "rating": 5.0,
      "verified": true,
      "author": "Lance Jettie",
      "helpful_votes": 0,
      "publication_date": 20161109
    },
    {
      "title": "Decent camera for the price",
      "text": "I've had this camera for a couple months now and have taken some fantastic photos with it. In automatic mode the camera is about 95% right on settings for simple shots. Complex shots need a little tweak but with a little photographic knowledge this camera is capable. My only complaint is battery life is poor; I don't think I've gotten more than 4-5 hours of mostly continual shooting. What is lacks in battery life it makes up in picture quality and general usability.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott Pribil",
      "helpful_votes": 0,
      "publication_date": 20110715
    },
    {
      "title": "One Star",
      "text": "Failed item never worked properly and to hard to return.",
      "rating": 1.0,
      "verified": true,
      "author": "rayray",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Z915 CAMERA",
      "text": "THIS IS THE 2ND EASYSHARE DIGITAL I HAVE OWNED AND IHAVE BEEN MOST SATISFIED WITH IT. I DO WISH IT HAD A VIEW FINDER TO GO ALONG WITH THE BACK DISPLAY AS IN BRIGHT SUN IT GETS WASHED OUT NAD YOU CAN'T TELL WHAT YOU ARE DOING. OTHER WISE A GOOD SIMPLE CAMERA TO USE.",
      "rating": 4.0,
      "verified": true,
      "author": "TED G STONE",
      "helpful_votes": 0,
      "publication_date": 20130501
    },
    {
      "title": "My \"go to\" camera",
      "text": "I have a 26X zoom digital camera, but never use it. This 10X zoom Kodak is the one I always grab. I've taken some great shots with this camera. It's not as small as some, but small enough for me and you cannot beat Kodak for making everything simple to navigate and use. Too bad they're no longer in the business of making cameras. SOOOO glad I got this when they were!",
      "rating": 5.0,
      "verified": true,
      "author": "9ah",
      "helpful_votes": 0,
      "publication_date": 20130619
    },
    {
      "title": "Quality and simplicity",
      "text": "I have purchased cameras in the past that were not user friendly or rather,because I was camera illiterate. I went to Vegas with my wife for the first time and wanted a camera that was inexpensive,easy to use, and took great pictures.The Kodak Z915 is that camera!Take it from me! My Las Vegas pictures came out so clear that they were mistaken for post cards!So easy to use and focus and the video footage was also crisp and clear. The Z915 looks handsome and is well made. I love this camera.After viewing the pictures, many of my friends and family members now want one of their own.Buy the Kodak Z915, you'll be happy you did!",
      "rating": 5.0,
      "verified": true,
      "author": "ArtWork",
      "helpful_votes": 4,
      "publication_date": 20100322
    },
    {
      "title": "Very Good Camera",
      "text": "This camera works great in automatic and also provides lots of setup options when you like to go manually. I really liked this camera because it works great almost with every condition of light and that's impresive for a non-professional camera. The only thing i would change is the battery, it should be a litium one instead of the AA.",
      "rating": 4.0,
      "verified": true,
      "author": "Mariano Andres Sanin",
      "helpful_votes": 14,
      "publication_date": 20091026
    },
    {
      "title": "I would recommend it at the price I purchased it",
      "text": "It's an OK camera that takes decent pictures, I would recommend it at the price I purchased it!! Delivered on time and as advertised.",
      "rating": 3.0,
      "verified": true,
      "author": "George Demeter",
      "helpful_votes": 0,
      "publication_date": 20170325
    },
    {
      "title": "not happy about that",
      "text": "Ican not get the pictures on my computer.No software.not happy about that.",
      "rating": 4.0,
      "verified": true,
      "author": "Monita Fields",
      "helpful_votes": 0,
      "publication_date": 20160817
    },
    {
      "title": "Kodal Z915 camera",
      "text": "I have used this camera for a number of years,and It always produces sharp, clear. crisp photo's.The only downfall to this camera is not enough zoom to reach out and capture distance shots.I have used it extensively for waterfall scenes and in manual mode, it performs like a champ.This has been one of my most favorite cameras over the years.It has never failed me.",
      "rating": 5.0,
      "verified": true,
      "author": "whitehawk",
      "helpful_votes": 0,
      "publication_date": 20131207
    },
    {
      "title": "kodak z915",
      "text": "Bought this camera after doing some research. First digital camera ever owned besides my cell phone. Love all the features, although don't know how to use some because just not that camera savvy. Have used it to do some pics & videos around the house, but the big event is at end of March. Love how clear the pics have come out, video is slightly choppy but not bad for not being a video camera. Price was awesome!! Speed of delivery was great, had within a week of order!",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn Widner",
      "helpful_votes": 0,
      "publication_date": 20100307
    },
    {
      "title": "Great camera.",
      "text": "Very pleased with it to date. Probably the clearest pictures you can get. Make sure you know how to use a camera before buying, otherwise you might have difficulty in taking good pictures (take a class).",
      "rating": 5.0,
      "verified": true,
      "author": "A Medzi",
      "helpful_votes": 0,
      "publication_date": 20121217
    },
    {
      "title": "The detail is terrible as well as distance shooting",
      "text": "Don't buy this camera --- if it is even still for sale. The detail is terrible as well as distance shooting. Everything comes out blurry especially in low light even with flash. Yuck!",
      "rating": 2.0,
      "verified": true,
      "author": "Logdog",
      "helpful_votes": 0,
      "publication_date": 20140827
    },
    {
      "title": "Looks cool, works cool",
      "text": "Color saturation is very good, especially in P or M mode with exposure control set to negative values. Easy to see how your picture will look using viewfinder.Takes great pictures in low light, especially using tripod. See review at YouTube.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Rock",
      "helpful_votes": 0,
      "publication_date": 20100303
    },
    {
      "title": "Very Fine Camera",
      "text": "This camera was ready to go as soon as I put the batteries in it. It is for the most part self explanatory. I agree with the guy who said that people are just too nit picky. The pictures are beautiful and the camera is simple to use.... What more do you need for that price!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey Chandler",
      "helpful_votes": 0,
      "publication_date": 20101224
    },
    {
      "title": "Great camera",
      "text": "I bought it for my husband. He wanted a simple, but good camera. He is very happy with it and thinks it fits real well with his needs. we are having Vacation Bible School and he is taking the pictures. Very happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Gwen Hill",
      "helpful_votes": 0,
      "publication_date": 20100606
    },
    {
      "title": "got a lemon",
      "text": "In less than 6 months after purchasing this item, the lens got stuck and wouldn't zoom. I mailed it out, under warranty for repair (had to pay shipping) through Kodak. Then, less than 2 months later, it would be focused until I pressed to take a picture and then it would go blurry and all my pictures are either dark or blurry. I really was not happy with the quality of this camera.",
      "rating": 2.0,
      "verified": true,
      "author": "Jule",
      "helpful_votes": 3,
      "publication_date": 20110606
    },
    {
      "title": "Takes great pictures",
      "text": "This camera takes great pickier for the size. Love how small and light it is. Also it is strong built, have dropped ANC has not broken or chipped.",
      "rating": 5.0,
      "verified": true,
      "author": "Yvonne",
      "helpful_votes": 0,
      "publication_date": 20140329
    },
    {
      "title": "Excellent design, good bargain.",
      "text": "The 10MP with 10x optical zoom camera is fantastic. Takes excellent photos, easy to use, reliable, and long battery life. Costs less, slimmer profile, and same features as other major brands we looked at.",
      "rating": 5.0,
      "verified": true,
      "author": "PhxCoronado",
      "helpful_votes": 14,
      "publication_date": 20091101
    },
    {
      "title": "hard to press shutter",
      "text": "It is not working condition at all. It definitely requires repair.",
      "rating": 1.0,
      "verified": true,
      "author": "Yang, Hyunjung",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "excellent camera with good price",
      "text": "This camera is awesome. I actually selected it from a cnet review. The pictures are crisp and clear, the camera is easy to use. I am an amature so if I can use it, anyone can. Great buy at a great price.",
      "rating": 4.0,
      "verified": true,
      "author": "com2015",
      "helpful_votes": 2,
      "publication_date": 20100513
    },
    {
      "title": "Kodak Easy Share",
      "text": "I purchased this refurbished camera for my 10 year old son and he LOVES it! It's easy to use and takes good photos. The only negative thing is that the small boxy shape is difficult to hold onto.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20101230
    },
    {
      "title": "Kodak Easyshare",
      "text": "I got hooked on Kodak Cameras years ago. I am not a professional photographer. Sad to say Kodak went bankrupt. I bought this camera because I liked it for many years... but I dropped it and it broke. I bound this as a replacement.",
      "rating": 4.0,
      "verified": true,
      "author": "Sloughhouse Jack",
      "helpful_votes": 0,
      "publication_date": 20130718
    },
    {
      "title": "A Kodak Moment",
      "text": "Just received the KODAK Z915 (black) today. I have to say, after owning Sony, Canon, and Another Kodak that this was a real surprise. The photos are crystal clear (I have uploaded a photo in the images gallery). The 10x Optical Zoom has exceeded My expectations . Colors are true and bright. The Smart Capture mode works like a dream and it's so easy to take a perfect shot. The VGA Video Quality is also great and almost looks HD . It's safe to say, that I will be sticking with KODAK from now on. I'm a 100% Satisfied Customer :)",
      "rating": 5.0,
      "verified": true,
      "author": "Pookie",
      "helpful_votes": 2,
      "publication_date": 20100731
    },
    {
      "title": "Do Not Buy",
      "text": "Bought this camera for my daughter, it didn't work, sent it back for a refund. Definitely Would Not Recommend this camera!",
      "rating": 1.0,
      "verified": true,
      "author": "mamaheel5",
      "helpful_votes": 0,
      "publication_date": 20140109
    },
    {
      "title": "Excellent Camera",
      "text": "I bought this camera after much research. I wanted a camera for my wife and I to use which would be simple to operate and produce godd pictures. We both are completely satisfied with our purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Edward H. Konetchy",
      "helpful_votes": 2,
      "publication_date": 20100609
    },
    {
      "title": "Did Not Work",
      "text": "Did not work. Very disappointed. Many facets of the camera did not work. Very poor quality control. Returned and bought a Nikon.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Adams",
      "helpful_votes": 0,
      "publication_date": 20131127
    },
    {
      "title": "Great camera for the price",
      "text": "As my title says, this is a great camera for the price. It has many options for photo taking and takes great pics. Everybody who sees my photos raves about how crisp and clear they are, even when zoomed way in, using the optical zoom. However, I don't care for the additional digital zoom - it makes the pics look very grainy - so I use it as little as possible. I bought my first one a few months ago for less than $120, a real bargain at the time, and just bought my second for less than $90. An amazing bargain.",
      "rating": 5.0,
      "verified": true,
      "author": "The Bibliophile",
      "helpful_votes": 0,
      "publication_date": 20100811
    },
    {
      "title": "Quite pleased....",
      "text": "At the price point I purchased it, this is an excellent little camera. If I could change one thing it would be the size. I'd actually like it to be a little larger and easier to hold. My first long use session was outdoors and it was cold; any small frame device with close set buttons is more difficult in that setting. But otherwise a great little camera...now that Kodak \"easyshare\" software is another story. I uninstalled that 2 days after loading it. Derek",
      "rating": 5.0,
      "verified": true,
      "author": "Derek R. Burton",
      "helpful_votes": 2,
      "publication_date": 20100201
    },
    {
      "title": "Bang for the buck!",
      "text": "Kodak is back! A lot of bang for the buck. Higher end, Kodak has that too in more pricey models. Point and shoot, it does that too, very well. Custom semi pro settings, they are there. For less than a hundred bucks it's hard to beat. Details: Glass optics, mechanical image stabilization and zoom, aspect ratio selections (important) as megapixels aren't always everything. Just a good overall camera and the user interface is about the best out there.",
      "rating": 5.0,
      "verified": true,
      "author": "Picture Taker",
      "helpful_votes": 4,
      "publication_date": 20100925
    },
    {
      "title": "Digital Camer",
      "text": "The vendor provided these prompley and the cost was just what I was Looking for. Good Vendor and products Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Maurice J. Fox",
      "helpful_votes": 0,
      "publication_date": 20130228
    },
    {
      "title": "compact camera for beginners",
      "text": "Easy to shoot, compact and very good camera for less than $100. Wood recommend for beginners before you spend your money on the big SLRs.",
      "rating": 5.0,
      "verified": true,
      "author": "Daffodil",
      "helpful_votes": 0,
      "publication_date": 20130107
    },
    {
      "title": "Kodak Easyshare Digital Camera",
      "text": "I loved my first Kodak Easyshare so when my grandbaby broke my camera, I looked on Amazon to get a replacement.. I found one at a very good price. I did not have to re-learn how to use it since I had previously owned one. The seller was prompt about sending it and I really like it.",
      "rating": 4.0,
      "verified": true,
      "author": "J Love",
      "helpful_votes": 0,
      "publication_date": 20131022
    },
    {
      "title": "Great camera",
      "text": "This Kodak camera seems to take as good of pictures as our Canon PowerShot SX100 10XZoom camera. Great price on Amazon, much cheaper than what we paid for our Canon and has many of the same features. We loved our Canon, but dropped it one too many times and it doesn't work well now. We wanted a camera for a lesser price that had many of the smae features and found that in this Kodak model.",
      "rating": 4.0,
      "verified": true,
      "author": "Bret Winters",
      "helpful_votes": 0,
      "publication_date": 20100624
    },
    {
      "title": "I upgraded from my old EasyShare to this one and I LOVE IT!",
      "text": "The zoom is great and very detailed. It is so easy to use and takes very sharp, clear pictures. I wish I had bought it a month ago before I went on a mission trip to Nicaragua. I had my old EasyShare which took great pics but this one is much better!",
      "rating": 5.0,
      "verified": true,
      "author": "cm",
      "helpful_votes": 0,
      "publication_date": 20100914
    },
    {
      "title": "KODAK Z915 CAMERA",
      "text": "THE CAMERA CAME IN RECORD TIME. IT COULD HAVE BEEN CLEANER, [A LITTLE FOOD FOR A SNACK, I GUESS], BUT GOOD WORKING CONDITION. WOULD BUY AGAIN",
      "rating": 5.0,
      "verified": true,
      "author": "Karla B.",
      "helpful_votes": 0,
      "publication_date": 20130106
    },
    {
      "title": "FROM A SO--SO PICTURE TAKER",
      "text": "OVERALL I LIKE THE CAMERA. PIC QUALITY IS GREAT AND THE ZOOM IS VERY GOOD. HAVE TO LEARN WHAT THE SMALL ICONS MEAN. A BIG NEG IS THE VIEWING SCREEN WHEN YOU ARE IN SUNLIGHT. YOU CANNOT VIEW YOUR SUBJECT AND CAN ONLY GUESS. DOES ANYONE HAVE AN ANSWERE TO THE PROB?",
      "rating": 4.0,
      "verified": true,
      "author": "M-K",
      "helpful_votes": 0,
      "publication_date": 20110311
    },
    {
      "title": "Affordable but not great",
      "text": "The Kodak EasyShare Z915 Digital camera is not top of the line, but neither is it's price. I bought one for my grand-daughter to try out. She's had a good time with it, but the picture quality isn't the greatest. I tried it out myself last weekend to see if she was moving when she took pictures, but the quality was the same. I prefer my single-lens reflex camera, but I have to admit that this is a lot lighter. For the price of the camera, it's ok.",
      "rating": 3.0,
      "verified": true,
      "author": "Andi55",
      "helpful_votes": 0,
      "publication_date": 20100522
    },
    {
      "title": "new camera",
      "text": "I have owned a camera just like this one and loved it. I am really excited about getting this camera",
      "rating": 5.0,
      "verified": true,
      "author": "Paula J. Thomas",
      "helpful_votes": 0,
      "publication_date": 20110613
    },
    {
      "title": "Gift For Wife",
      "text": "My wife absolutely loves this camera. Very easy to operate and maintain. Best price by far was from Amazon..many thanks!!",
      "rating": 5.0,
      "verified": true,
      "author": "Morty",
      "helpful_votes": 0,
      "publication_date": 20131227
    },
    {
      "title": "Decent Camera when it worked",
      "text": "This camera is fairly easy to use, just aim and snap. You have to use the LCD screen and all of our pictures looked grainy on the lcd, but came out great. After about 500 pics in the span of 7 months, the camera shutter would not open, it just clicks. Changed the batteries, blew some air in it just in case something was lodged in the grooves and nothing. I can not recommend this to anyone due to the lack of durability.",
      "rating": 2.0,
      "verified": true,
      "author": "JMJ",
      "helpful_votes": 0,
      "publication_date": 20101129
    },
    {
      "title": "Great camera!",
      "text": "Arrived just as promised and packaged very securely. Camera is easy to use and the pictures are great!",
      "rating": 5.0,
      "verified": true,
      "author": "Donna F",
      "helpful_votes": 0,
      "publication_date": 20100317
    },
    {
      "title": "kodak easyshare",
      "text": "camera worked less than 1 year,then picture threw lines in image so couldn't get focus on what i was trying to take picture of. TOTAL waste of $$$$$$!!!!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "plmr",
      "helpful_votes": 0,
      "publication_date": 20131209
    },
    {
      "title": "easy to use",
      "text": "we have no clue what we are doing...but this product was easy to use and the guide was also easy to read...it was short and to the point..i am glad we spend out money on it....cant wait to make tons of memories...",
      "rating": 5.0,
      "verified": true,
      "author": "Eraleta Colson",
      "helpful_votes": 0,
      "publication_date": 20100823
    },
    {
      "title": "kodak camera Z915",
      "text": "All is pretty well with this camera. My only disappointment is the lack of a view-finder. I thought I could do without it but I keep trying to use it and find it uncomfortable without one.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Stuver",
      "helpful_votes": 4,
      "publication_date": 20101126
    },
    {
      "title": "Best buy for the buck. A***** buy.",
      "text": "I have Agfa, Fuji, Nikon, Samsong cameras before. But This Kodak Z915 camera beats them all in picture quality.good zoom, excellent picture in low light, you can easily compare Z915 with highend cameras. Price at $75.00 you can not beat this. A***** buy.",
      "rating": 5.0,
      "verified": true,
      "author": "brana",
      "helpful_votes": 0,
      "publication_date": 20101115
    },
    {
      "title": "Simple to use",
      "text": "Bought a refurbished model, and they sent the small (5 3/8 in square)user guide with it. The \"how to\" info was succinct, helpful. The viewer is small but quite clear. The Panorama feature was simple to do. Has a load of features for a compact camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20100928
    },
    {
      "title": "Luv It",
      "text": "This camera is more than I expected. Much smaller than my older X4 optical digital Kodak camera. I love that I can zoom in and out while in video mode (maybe this is more common now but wasn't an option on my 6 year old kodak). I took video/stills at my daughter's swim meet last evening. I am very impressed with the quality and the zoom. I was able to capture her diving in the water (not even in sports mode). Only used this so far for this one occasion but this is exactly why I purchased it in the first place so I am very satisified.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 53,
      "publication_date": 20091002
    },
    {
      "title": "Five Stars!",
      "text": "I just love this camera. The pictures are great, the movies are just as great. There are many settings to use to get just what you want. It is easy to use. If a person doesn't want to use the various settings and choices, the Smart Capture feature works very well. I have been taking digital pictures for many years and this is my 4th digital camera. The camera has not let me down on any of the many pictures and movies I have shot with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20100827
    },
    {
      "title": "A++++++++++++",
      "text": "This was just what i needed. I had one before and dropped it (: but i decided to purchase another one i had a great seller!",
      "rating": 5.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 0,
      "publication_date": 20140423
    },
    {
      "title": "Wasn't too happy with this one",
      "text": "This was a great camera for the time that it lasted. It took great pictures but started to distort colors before it was even a year old. I wasn't too happy with this one.",
      "rating": 2.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20130109
    },
    {
      "title": "Five Stars",
      "text": "Me 8 years Kodak user, never change. see the Kodak Z981 i have only cam",
      "rating": 5.0,
      "verified": true,
      "author": "Tianyou Jiang",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "Good Buy!",
      "text": "Used and I got it just as the description. Works great. Good buy! Couple of scratches but for the price ok.",
      "rating": 4.0,
      "verified": true,
      "author": "Harry",
      "helpful_votes": 0,
      "publication_date": 20131116
    },
    {
      "title": "Worth The Money",
      "text": "I like the camera because of the construction quality, the ease of use, the clarity of most of the pictures, a few tends to be blurry for reason I don't know. And it has a fast shutter speed especially when you turn off the view pics everytime you take a picture, really fast. Overall I gave it a 4.5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Pascual",
      "helpful_votes": 0,
      "publication_date": 20100827
    },
    {
      "title": "Great Camera",
      "text": "just started using it, but it does everything I want it to. The 3 picture panorama is unbelievable. Great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 2,
      "publication_date": 20100806
    },
    {
      "title": "The best camera for your money!",
      "text": "This camera takes fantastic photos and is extremely user friendly. The best in it's class for under $200.",
      "rating": 5.0,
      "verified": true,
      "author": "Northeast Consumer",
      "helpful_votes": 0,
      "publication_date": 20100201
    },
    {
      "title": "Failed after just taking a few photos",
      "text": "After taking just a few photos, and turning the camera off then back on it requires me to reset the time and date. Really gets to be a pain in the A_ _",
      "rating": 1.0,
      "verified": true,
      "author": "TLW",
      "helpful_votes": 0,
      "publication_date": 20130311
    },
    {
      "title": "Kodak",
      "text": "Could not get the green out of eyes with the flash on. Even tho the camera has several settings to get the red out of eyes which didn't seem to do much the eyes were green.. I took it to a hocky game and when I used the full zoom most of the pictures were blurry. Then before the night was over after taking about 20 pictures through out the night the battery went dead and turned it off. Really!?! I am working on now trying to send it back. We will see how that goes.",
      "rating": 2.0,
      "verified": true,
      "author": "Kadi",
      "helpful_votes": 0,
      "publication_date": 20110101
    },
    {
      "title": "Pleased with product.",
      "text": "Camera works fine, nice size. Issue: Having problems with compatability of Kodak Easy Share with Windows 7 Home Premium. Still working on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20100716
    },
    {
      "title": "kodak, mi mejor eleccion en cuanto a camara",
      "text": "QUERIA UNA BUENA CAMARA Y LA ENCONTRE CUANDO COMPRE LA KODAK Z915. ESTA CAMARA COMBINA UN EXELENTE ZOOM CON UNA BUENA IMAGEN, PARA UNA PERSONA QUE LE GUSTE LA FOTOGRAFIA. TIENE UN EXELENTE PRECIO(COMPRE LA MIA EN UN PRECIO ESPECIAL DE $95), ME ENCANTA ESTA CAMARA, SI PENSABAS COMPRARLA HAZLO ES UNA BUENA OPCION. QUIERO CAMBIAR LA MIA POR UNA DE MAYOR ZOOM, PERO ESTOY ENCANTADO CON ELLA Y POSIBLEMENTE NO LA VENDA Y ME QUEDE CON ELLA, AUN COMPRANDO LA Z981, PUES A MI ESPOSA LE GUSTA ESTA CAMARA.",
      "rating": 5.0,
      "verified": true,
      "author": "M.M",
      "helpful_votes": 0,
      "publication_date": 20110501
    },
    {
      "title": "Great camera",
      "text": "Very nice camera for the price. Love having the video capability. Easy to use and download. Takes great pictures. I'm sure I haven't discovered all it can do!",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Kinkade",
      "helpful_votes": 4,
      "publication_date": 20100713
    },
    {
      "title": "Great camera for the price",
      "text": "Great camera for the price. Easy to use features. Ease of moving pictures and video to computer or picture frames. Recommended to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Suiter",
      "helpful_votes": 0,
      "publication_date": 20100213
    },
    {
      "title": "Very disappointed",
      "text": "Produces well focused photos about 50% of the time. I can't get it to focus at full zoom. When the photos are focused, the colors are very crisp.",
      "rating": 2.0,
      "verified": true,
      "author": "Gabino E. Matus Jr.",
      "helpful_votes": 2,
      "publication_date": 20111126
    },
    {
      "title": "Great Product",
      "text": "We bought this product for Christmas and we have been using the camera since that day all the time. Easy to use, great pictures, easy to handle. It is a great product at a very good price",
      "rating": 5.0,
      "verified": true,
      "author": "Rocio Cabrera-salazar",
      "helpful_votes": 0,
      "publication_date": 20100131
    },
    {
      "title": "Great camera - Great price",
      "text": "Not a DSLR, but capable of capturing very good pictures. I believe that photography is 1/3 knowledge of your equipment (working within its limitations), 1/3 lighting and 1/3 composition. I am still working on the first and this camera makes it easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Weibel",
      "helpful_votes": 0,
      "publication_date": 20100810
    },
    {
      "title": "Great Camera",
      "text": "This is an amazing camera, awesome options for the amateur photographer or more advanced options for those who would like a little more control. The zoom is crystal clear. I would recommend this camera to anyone, and a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Another satisfied customer",
      "helpful_votes": 10,
      "publication_date": 20091105
    },
    {
      "title": "Camera",
      "text": "Easy to use, several settings. Like that it uses rechargable batteries or regular AA batteries. Good zoom features.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Fangmeyer",
      "helpful_votes": 0,
      "publication_date": 20100314
    },
    {
      "title": "Returned it as soon as I could",
      "text": "This camera was nothing like I was expecting. The first thing I noticed was how \"cheap\" it seemed. It is extremely light weight, like there is nothing in it. It has just basic functions for a digital camera. Taking pictures is horrible, by the time it does it's series of light flashes and focuses, my subjects (my children) had moved on and I would often get the backs of their heads, etc, and lose the shot. The time between pictures seems like forever. There was nothing I liked about this camera, I returned it and bought a Nikon and am in heaven!",
      "rating": 2.0,
      "verified": true,
      "author": "L. Young",
      "helpful_votes": 5,
      "publication_date": 20100418
    },
    {
      "title": "Pour point and shoot camera.",
      "text": "I bought this after reading the reviews and return it. The 10 MP didn't work. Indoors it had a delay between pushing the shot button and actual shutter opening. I have a 6 yr. old grandaughter and lost a lot of good shots. I have a 5 MP Konica Minolta that takes much better pictures. The flash is okay. I bought the camera in hopes that it would be a good and point camera. I like the fact that you can use 2 ea. AA batteries. We have 2 Kodak cameras at work that are 2-3 years old 3MP & 4MP and they take better pics that the Z915. This is the worst camera that I have every had.",
      "rating": 1.0,
      "verified": true,
      "author": "Ydoc",
      "helpful_votes": 0,
      "publication_date": 20100823
    },
    {
      "title": "Great Buy!",
      "text": "I bought this camera for my mother for her 50th birthday, and then had her first grandchild four days later! She has been non-stop taking pictures of the baby, experimenting with all the cool features on the camera to get the best shot! This camera is great for someone who just wants to point and shoot, or someone who wants to try artistic things with their photography!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica D. Wamback",
      "helpful_votes": 2,
      "publication_date": 20091119
    },
    {
      "title": "easy to use",
      "text": "Easy to yse; intuitive functions; fast; works well in low light. Problem: software is a joke. Still can't figure how to get video software to work.",
      "rating": 4.0,
      "verified": true,
      "author": "SK Fluck",
      "helpful_votes": 2,
      "publication_date": 20091210
    },
    {
      "title": "DO NOT PURCHASE!",
      "text": "This seems like a great deal: 10x zoom 10 megapixel camera for under $100; however the picture quality is awful. All pictures (not just those where zoom was used) were very fuzzy. Returning after reviewing pictures.",
      "rating": 1.0,
      "verified": true,
      "author": "CB",
      "helpful_votes": 0,
      "publication_date": 20100912
    },
    {
      "title": "Easy share Z915",
      "text": "I have the oppotunity to use several cameras in this class and this was the best of the bunch. Very easy to use and learn.",
      "rating": 4.0,
      "verified": true,
      "author": "Donald J. Schmidt",
      "helpful_votes": 0,
      "publication_date": 20100202
    },
    {
      "title": "Lens cover",
      "text": "Nice camera except after the first month the lens cover already hangs up when closing.",
      "rating": 3.0,
      "verified": true,
      "author": "kbs",
      "helpful_votes": 0,
      "publication_date": 20100316
    },
    {
      "title": "Love it",
      "text": "Received this camera and I love it! It takes great pictures the zoom is amazing for a point and click. This is the 3rd Kodak Digital Camera I have owned and you can't go wrong with Kodak!",
      "rating": 5.0,
      "verified": true,
      "author": "AF Mom",
      "helpful_votes": 7,
      "publication_date": 20091007
    },
    {
      "title": "z915",
      "text": "quality camera, but don't forget to buy tons of batteries, if you planning to use flash.",
      "rating": 4.0,
      "verified": true,
      "author": "benkmat",
      "helpful_votes": 0,
      "publication_date": 20100629
    },
    {
      "title": "Kodak Easyshare Z915 10MP Digital Camera",
      "text": "The Kodak Easyshare Z915 10MP Digital Camera is great but if you buy one make sure you check out the Batteries because the ones I got were bad. If like me if the camera does not work take it to Wal-Mart and have them check it. They found out the batteries were no good. After I got new batteries the camera worked fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Wayne Cole",
      "helpful_votes": 0,
      "publication_date": 20091205
    },
    {
      "title": "Bad Camera Purchase",
      "text": "This camera worked for 1 week then quit. Stupidly I threw away the packaging and was unable to return it. I will never buy a Kodak camera again nor will I ever purchase a camea from this vendor.",
      "rating": 1.0,
      "verified": true,
      "author": "tutuofmany",
      "helpful_votes": 0,
      "publication_date": 20100922
    },
    {
      "title": "Camera needs viewfinder",
      "text": "Very nice camera. Have had three Kodak cameras and loved the all. This one had all the features I wanted except for a viewfinder. Tried to use it in bright sunlight and found I could not frame effectively with only the view screen. Returned the camera.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael Ziaslas",
      "helpful_votes": 8,
      "publication_date": 20091024
    },
    {
      "title": "My easy share",
      "text": "This is a decent camera I think the construction is on the cheap side though. I havent learned all the functions as of yet but the price was right on this product",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Swain",
      "helpful_votes": 0,
      "publication_date": 20091127
    },
    {
      "title": "poor quality pictures",
      "text": "Overall I'm very desapointed with KODAK Z915 photo actually worse than my 4 year old Sansung Digimax 5MP. the video totally useless...I decided to return this camera(-20%) and try the Canon SD970. The ~$$$$ is absurd for the poor quality that you get.",
      "rating": 2.0,
      "verified": true,
      "author": "MVVAC",
      "helpful_votes": 3,
      "publication_date": 20100207
    },
    {
      "title": "Regular",
      "text": "It is good for the price, but the image on the screen is not very good, menus are half complicated. The belt breaks easily. Está buena por el precio, pero la imagen en la pantalla no es muy buena, los menúes son medio complicados. La correita de agarrarla se le parte fácil.",
      "rating": 3.0,
      "verified": true,
      "author": "A. Reyes",
      "helpful_votes": 0,
      "publication_date": 20110218
    },
    {
      "title": "Piece of *&&@##*(#@&*(",
      "text": "Buy a different camera. It takes great pics. Unfortunately it is difficult to get them onto your computer after that. The onboard memory is not easily accessible and it has corrupted two memory cards. I can't stand this thing and ended up getting a Nikon to replace it.",
      "rating": 1.0,
      "verified": true,
      "author": "Debbie S. Davis",
      "helpful_votes": 0,
      "publication_date": 20110316
    },
    {
      "title": "POOR QUALITY",
      "text": "Bought the Z915 for vacation in Mexico. It lasted 5 days and then the screen turned white and I couldn't review or take any photos. Normal use of the camera, no banging it around or dropping it. Just don't think the Quality is there.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Combs",
      "helpful_votes": 8,
      "publication_date": 20100303
    }
  ],
  "product_meta": {
    "title": "Kodak Easyshare Z915 Digital Camera (Black)",
    "description": "Kodak EasyShare Z915 Digital Camera Black\n\nFROM THE MANUFACTURER\nBecome a better photographer with a smarter camera. The KODAK EASYSHARE Z915 Digital Camera has an extended zoom so you can get closer to those far away shots. And, with Kodak’s innovative Smart Capture feature, camera settings are adjusted to deliver beautiful pictures, automatically. The Z915 is compact, not complex, so you can take incredible pictures at an incredible price. \n\n\n\nPowerful zoom, remarkable speed and clarity\nTake photography to the next level. Whether you’re zooming in on fast action shots or taking a picture of your grand surroundings, the Z915 is the camera that can handle it. And it’s surprisingly simple to use. \n\n10X optical zoom with image stabilization  * The all glass 10X optical zoom lens (35–350 mm) zooms in fast to deliver extraordinary creative performance\n * Fast f/3.5–f/4.8\n\nOptical image stabilization  * Capture sharp, steady shots when shooting at long zoom ranges\n * Optical image stabilization automatically minimizes camera shake to deliver sharper pictures\n\nAmazing quality prints with 10 MP  * 10 MP means you can make stunning prints up to 30 × 40 in.\n * More megapixels means you can crop and enlarge and still have great picture quality\n * However you choose to print—at home, at retail, or online—trust KODAK for picture quality that’s truly exceptional and for memories that will last\n\nBest-in-class[1]click to capture speed\n0.3 second click-to-capture speed means you can capture that challenging action shot without delay \n\nBeautiful pictures, more often—automatically\n\nBecome a better photographer with a smarter camera. The KODAK EASYSHARE Z915 Digital Camera blends the latest picture-taking technology with the ultimate in style—and with Kodak’s innovative Smart Capture feature, it’s the take-anywhere camera that does it all—automatically. \n\nKodak's Smart Capture feature\nTake better pictures than ever before. Kodak's innovative Smart Capture feature adjusts camera settings for great pictures in just about any environment—automatically.  * Intelligent scene detection—detects and analyzes scene conditions\n * Intelligent capture control—automatically sets camera settings including exposure, focus and ISO for clear, sharp pictures even in low light and challenging situations\n * Intelligent image processing—reduces noise and clears up dark shadows for vibrant, crisp details and true-to-life colors\n * Experience Smart Capture\n\nTrue HD quality: capture stunning pictures \n\n\nHD picture capture  * Capture beautiful HD pictures in 16:9 format\n * View your pictures in high definition on an HDTV or other HD devices\n\nKODAK Theatre HD Player (optional device)\nGive your pictures the life they deserve. With the KODAK Theatre HD Player, you can relive your memories on your big screen HDTV in stunning high-definition.  * Relive your HD pictures and videos on your HDTV\n * Access pictures from your PC, camera, and online photo sharing sites\n * Wirelessly send and receive pictures with Kodak’s Picture Mail feature\n * Create slideshows to your favorite songs\n * Access Internet Radio, podcasts and other web content on your HDTV\n\nCompact, not complex\nCapture consistently great shots by utilizing features such as face detection, on-camera editing features, KODAK PERFECT TOUCH Technology and much more. And after you take the shot, do even more. Turn your pictures into a multimedia slideshow, complete with music and effects. \n\nHigh ISO mode  * Capture the details in low light conditions and fast action situations with a powerful, high ISO (up to 1600)\n * Faster shutter speeds mean you can capture scenes in low light and fast action\n * The camera automatically selects from ISO 64 to ISO 1600 based on lighting conditions\n\n\nFace detection\nFor great shots of friends and family, face detection locates faces and automatically adjusts camera settings \n\nMultimedia slideshow\nTell your story your way using the multimedia slideshow feature.  * Turn your pictures into a creative multimedia slideshow right from your camera\n * Set the mood when you choose from pre-loaded sound themes to accompany your slideshow\n * Insert creative transitions and bring your pictures to life\n\nText and sound tags \nAdd text or sound tags to your pictures, on-camera, so you can easily find and organize them later using KODAK EASYSHARE Software.  * Never forget the details of your pictures with text tags\n * Let your pictures have their say with sound tags\n\nOn-camera picture-enhancing features  * Easily capture and create great shots with features such as on-camera cropping, blurry picture alert, undo delete and picture rotation\n * Panorama stitch mode combines up to three shots into one large picture on-camera\n * Verify the exposure of your picture using the histogram feature on live view, quick view and review\n\nKODAK PERFECT TOUCH Technology\nMake your pictures as vivid as the moment you took them. Print better, brighter pictures using KODAK PERFECT TOUCH Technology in PASM modes.  * Make better, brighter pictures\n * Relive your memories in richer detail\n * Clear up dark shadows to reveal more smiles\n\nShoot video with ease  * Record continuous VGA video (640 × 480) at 30 fps with sound and on-camera editing\n * Video print options include 1, 4, 9, and 16-up prints\n * Save single frames and e-mail to family and friends\n\nInternal memory plus  * Don’t miss a shot if your memory card becomes full—switch to in-camera memory quickly, thanks to the internal memory plus feature\n * 32 MB internal memory[2]and SD/SDHC card compatibility lets you start shooting right out of the box\n\nConvenient battery options\nThe Z915 is always powered and ready to go. \n\nNever miss a shot because of a dead battery—with convenient power options, including rechargeable batteries, you’ll be able to capture even more moments \n\nPASM, scene and color modes for advanced creativity\n\nProgram, aperture and shutter priority, as well as full manual mode (PASM)  * Program mode (P)—camera sets optimal shutter speed and aperture combination\n * Aperture priority mode (A)—you choose aperture, the camera sets shutter speed\n * Shutter priority mode (S)—you choose shutter speed, the camera sets aperture\n * Manual mode (M)—you choose both the aperture and shutter speed\n\nManual controls  * Exposure compensation—± 2.0 EV in ± 1/3 EV step increments\n * Aperture— f/3.5–f/4.8\n * Shutter speed—16–1/1250 sec. (auto), 16–1/1000 sec. (S/M mode)\n * ISO equivalents—(automatic) 64, 100, 200, 400, 800, 1600\n * Auto focus—TTL imager AF system\n * Exposure metering—multi-pattern, center-weighted, center-spot\n * White balance—auto, daylight, tungsten, fluorescent, open shade\n * Flash mode—auto, off, fill\n\nMultiple scene modes  * Portrait modes—portrait, night portrait, backlight, self\n * Landscape modes—landscape, night landscape, fireworks, sunset\n * Bright scene modes—sport, beach, snow\n * Action modes—sport, children, stage\n * Text mode—ensures sharp text when photographing documents\n\n5 color modes  * High color\n * Low color\n * Natural color\n * Black and white\n * Sepia\n\nThe simple way to share\nThe Z915 is part of the KODAK EASYSHARE System, so sharing your pictures is amazingly simple. Just press Share.\n\nOne button upload via Share button  * Sharing starts right on the back of the camera\n * Upload and share your favorite pictures and videos to YouTube™ and KODAK Gallery via the Share button and KODAK EASYSHARE Software\n\nKODAK EASYSHARE Software (included)\nThe simplest way to organize, edit, create, and share.  * Organize your pictures with your own tags and star ratings then use the search feature to quickly find any picture in your collection\n * Edit your pictures with ease—select from a variety of simple tools that reduce red-eye, improve lighting, remove wrinkles and blemishes, and add text\n * Create photo projects online or at home—choose from hundreds of templates and designs to create album pages, cards, invitations and much more\n * Share your photos and videos with family and friends at the KODAK Gallery or YouTube™\n\nReady to go—right out of the box  * KODAK EASYSHARE Z915 Digital Camera\n * (2) KODAK Alkaline AA Batteries or equivalent\n * USB cable\n * Wrist strap\n * User's Guide with KODAK EASYSHARE Software\n\n# 1Among 10X optical zoom, image stabilized digital cameras as of November 2008.\n# 232 MB internal memory / 13.5 MB available for picture storage (1 MB equals 1 million bytes).",
    "rating": 3.9,
    "feature_bullets": [
      "10-megapixel effective recording",
      "10X optical zoom (5X digital/50X total zoom)",
      "Optical image stabilization",
      "2-1/2\" LCD",
      "35mm equivalent lens focal length: 35-350mm"
    ],
    "specifications": {
      "Product Dimensions": "4.2 x 1.4 x 2.9 inches",
      "Item Weight": "1.1 pounds",
      "ASIN": "B0021XW3YU",
      "Item model number": "8112708",
      "Batteries": "2 AA batteries required.",
      "Customer Reviews": "3.9 out of 5 stars211 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#238,686 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 17, 2003",
      "Manufacturer": "Kodak",
      "Language:": "English"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": 30.0
  }
}