{
  "website_summaries": [
    {
      "verdict": "One of the most highly rated Beanie Boos on the market, this ultra-soft pup is sure to impress.",
      "pros": [
        "Slush the husky is silky soft",
        "Covered with exterior polyester fibers, this Beanie Boo favorite showcases remarkable comfort and quality",
        "Many buyers were impressed with the product's sparkly eyes"
      ],
      "cons": [
        "Many customers were surprised by how small the product seemed upon arrival"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Very cute",
      "text": "Our boys loved this Husky Beanie. His eyes sparkle and he is adorable. Quick delivery w Amazon prime. The uploaded pic shows the old and well loved version on the left and the NEW version on the right.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 22,
      "publication_date": 20160326
    },
    {
      "title": "Slush Beanie Boo",
      "text": "The eyes are very sparkly like the picture and my son loves it. Some of the other pictures from reviewers look like they aren't sparkly. It's a bit smaller than expected but it's so soft and cute that it doesn't matter.",
      "rating": 5.0,
      "verified": true,
      "author": "Jarrod",
      "helpful_votes": 25,
      "publication_date": 20140807
    },
    {
      "title": "Cat Toy, loved to death in 10 days",
      "text": "My cat loved his Beanie Boo. He had a smaller alligator for Christmas and it lasted over 2 weeks. Boo Dog was fetched, because my cat is a fetcher, chewed on, drooled on (ew), shared heater vent and was put in the food room (big sign of favor). Too bad Boo was loved so much he lost stuffing and beads and had to be tossed. If he were less expensive my cat would have 2 new Boos a month.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Hall",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Kids can't resist their sparkly eyes",
      "text": "Adorable, love the large, sparkly eyes. Bought a different Ty Beanie plushy for younger daughter. It was such a hit my older daughter wanted one of her own really bad. She got this for her 9th birthday and instantly fell in love. She wants to be a big kid, but still loves the cuteness of these stuffed animals with their sparkly eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 6,
      "publication_date": 20150508
    },
    {
      "title": "Cute and Good Quality",
      "text": "I keep adding five star reviews for these Beanie Boos. We buy them for our 5 year old Granddaughter who is crazy about them. Worst thing is that every time I now order something from Amazon I tend to add one or two new ones to the order. We now have four of them ready to hand out one by one when she comes to visit. They are cute, good quality and reasonably priced.",
      "rating": 5.0,
      "verified": true,
      "author": "RRHeerens",
      "helpful_votes": 2,
      "publication_date": 20160804
    },
    {
      "title": "Looks better than in photo",
      "text": "Very Cute little Husky dog. He has a real adorable smile and not the freaky eyes like in the picture. The color in the picture is also distorted. He is not that blue. The inside of his ears are blue and he has sparkling blue eyes. The darker fur is grey and the lighter fur is white. While not a cuddly dog, he is incredibly soft.",
      "rating": 5.0,
      "verified": true,
      "author": "Maya K.",
      "helpful_votes": 6,
      "publication_date": 20150310
    },
    {
      "title": "Cute. One of my daughter's favorite beanie boo. The most prized one she owns.",
      "text": "Must be a good product. My daughter is 3 of them. Why? Because people like to buy your kid the same gift that you did for Christmas. Good enough to own 1. Three is excessive and not recommended. The huskey is by far her favorite beanie boo.he is cute.",
      "rating": 5.0,
      "verified": true,
      "author": "S. F. Ryder",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "It's soft and cute",
      "text": "Super soft stuffie in the shape of a husky. What's not to love. My daughter's school team is the Huskies, so that made it an extra big hit for her.",
      "rating": 5.0,
      "verified": true,
      "author": "Genna H",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "As pictured - CUTE",
      "text": "Adorable stuffed animal. Niece loved it. about 6 \" with sparkly blue eyes just like the main photo. Came wrapped in clear packaging so was nice and clean upon arrival. Received quickly. Great buy for 5-10 year old girls. Who doesn't love Huskies?",
      "rating": 5.0,
      "verified": true,
      "author": "Mama K",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Attractive Beanie Boo",
      "text": "Cute beanie boo with a pair of attractive eyes,quality fur and figure on him. The husky also has a set, rigid pose on him that allows the owner to place him anywhere in the house without it falling over. My only complaint is his size- I wish he was a bit larger. Overall, great beanie toy that has the potential to be enjoyed by anyone, regardless of age.",
      "rating": 4.0,
      "verified": true,
      "author": "Lovesbooks",
      "helpful_votes": 0,
      "publication_date": 20160519
    },
    {
      "title": "Product was amazing till the tail came off.",
      "text": "This stuffed animal was amazing and everything we were looking for until the tail came off. It wasn't played with hard. my son usually just slept with it, occasionally played with his little sister with it but never too rough yet less then a week the tail was off. Hopefully the quality goes up.",
      "rating": 2.0,
      "verified": true,
      "author": "Melissa Burkey",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Great!",
      "text": "Great product. My daughter loves beanie boos and this is no exception. She sleeps with it every night and takes it to school in her backpack. Cute, great size.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Adorable Animal",
      "text": "I purchased one of these for my son from a local store over a year ago. It quickly became his favorite and we could not pry it from his hands. As to be expected, it started to wear a bit, and we could not find another like it nearby. I was thrilled when I located this one online, and quickly replaced the 'well loved' one at home during the night. My little man loves his 'slushy' (his name for the dog) and the 'newly washed' one hasn't left his side either. We will clearly be purchasing more.",
      "rating": 5.0,
      "verified": true,
      "author": "Lady Di",
      "helpful_votes": 0,
      "publication_date": 20140616
    },
    {
      "title": "Just thrown in a box",
      "text": "Slush is cute and looks like the picture. I realize this is not a breakable item but I was disappointed that is was just thrown loosely in a box. No protective plastic around it or any type of packing.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "So soft and cute!",
      "text": "My 9 yr old bought this and loves it. It's really soft and so cute! It's a great value and a great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Adorable",
      "text": "This was the first Beanie Boos I had bought so was unsure what to expect. When he arrived, the eyes drew me to him. I thought he was adorable without taking up a lot of space. I had him sitting on the table next to my lap top, my Lhasa jumped up to play, then froze as she spotted Slush. She stared and had a low growl...she believed he was real. It took a little bit of letting her sniff him to realize she was safe. He has been joined by 2 others and I plan to buy more.",
      "rating": 5.0,
      "verified": true,
      "author": "Candygal",
      "helpful_votes": 0,
      "publication_date": 20131224
    },
    {
      "title": "Adorable",
      "text": "My daughter bought this adorable puppy as a gift for her friend. She loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Slush the Husky Beanie Boo",
      "text": "\"Slush\" the husky is adorable with his big blue eyes! The little boy I sent this to received it today and loves it! I received a picture of him smiling from ear to ear and posing for the camera holding his new toy as a thank you. :) The colors are nice and the fur is so soft on these beanie boos, they are also the perfect size.",
      "rating": 5.0,
      "verified": true,
      "author": "KG",
      "helpful_votes": 3,
      "publication_date": 20141018
    },
    {
      "title": "Big hit as a birthday gift.",
      "text": "Was a gift for grandson, he LOVED its soft cuddly fur, and big eyes. Well made! Worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Bj4466",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Love it",
      "text": "Great i really love this dog and my girlfriend will love it to, its soft y those eyes are very great i can have this dog on my hand all the day great style and colors .",
      "rating": 5.0,
      "verified": true,
      "author": "Angel Encarnacion",
      "helpful_votes": 0,
      "publication_date": 20160909
    },
    {
      "title": "The collectors love it",
      "text": "My niece collects these and she is very happy with this one",
      "rating": 5.0,
      "verified": true,
      "author": "Ama-zon Kustomer",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Sparkly eyed baby!",
      "text": "So cute and so soft! You can't really tell from the photo, but the eyes on this husky are a very sparkly and shiny blue color that matches the ears. They aren't big, but they aren't tiny, either. I would say they are about as tall as the typical bag of fancy coffee you get from the supermarket, give or take a few centimeters. Great purchase. Very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Sonya Maree",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "Great gift!",
      "text": "Bought for my granddaughter, she was so excited. She put him in the pool and bath 🤦‍♀️. Dried nice still fluffy and soft.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol L. Ross",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "I needed stuff animals to create candy bouquets and this was the perfect touch. Love it and would purchase again",
      "text": "Oh my goodness, this is so cute. I needed stuff animals to create candy bouquets and this was the perfect touch. Love it and would purchase again. By the way, the quality is outstanding, it is soft and cuddly and the eyes are sooo cute!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20151022
    },
    {
      "title": "Soft",
      "text": "Grand son loves this stuffy. Its really soft and cute.",
      "rating": 4.0,
      "verified": true,
      "author": "Cecilia W",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Cute but small",
      "text": "These Beanie Boos are so super cute and soft, but they are not as big as they are supposed to be. They are on the smaller side. If you don't mind them being smaller they are super cute.",
      "rating": 4.0,
      "verified": true,
      "author": "Eliza120",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "WE <3 BEANIE BOOS... and have a ...",
      "text": "WE <3 BEANIE BOOS. . . and have a MASSIVE collection at this point! With two daughters, we tend to get overwhelmed by stuffed animals that do nothing but sit around being cute and collecting dust. It's different with the Beanie Boos - I don't know why, but THESE they play with day, and can't get enough! We've started a stuffy exchange program - one old non-TY stuffy out for each new Beanie Boo brought in - this is working well for us so far!",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 6,
      "publication_date": 20160114
    },
    {
      "title": "\" as my 4yo says it) is pretty damn cute",
      "text": "I am so tired of these little stuffies all over the place. But it must be said: Slush (or \"Swush,\" as my 4yo says it) is pretty damn cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Alinna Satake",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "Purrrrrrfect!",
      "text": "Love it! I purchased it for my daughter because she had the same one except it was a mini one. She wants to create a family and she's getting the medium sized wolf too.",
      "rating": 5.0,
      "verified": true,
      "author": "cloth diapering momma",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Quality, Adorable",
      "text": "These little guys become collectibles really quickly. Get the ones you think are cute right when you spot them. They might not be there tomorrow! Sheesh!",
      "rating": 5.0,
      "verified": true,
      "author": "Muddy",
      "helpful_votes": 0,
      "publication_date": 20170605
    },
    {
      "title": "Good gift",
      "text": "Very cute, gave as a gift and she loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Neesy",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "As described...but...",
      "text": "It was new in bag, but was ripped on one side. Easy to fix with a little needle and thread but my daughter was kinda bummed and I was a little frustrated. All good now that he is all sewn up.",
      "rating": 2.0,
      "verified": true,
      "author": "Crystal H",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Supet cute",
      "text": "My daughter collects Beanie Boos. They're small and cute. I love them too!",
      "rating": 5.0,
      "verified": true,
      "author": "Amber B.",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "Perfect size!",
      "text": "I bought this for my grandson two months ago when he was 10 months old and it's the perfect size - he can hold onto it easily and it goes everywhere with him. It has held up well to teething, twisting and everything else a small child can do to a cuddly stuffed animal. We've washed it by hand and it's dried to it's original shape and softness. Have even ordered a back-up just in case this one gets lost (as has almost happened several times).",
      "rating": 4.0,
      "verified": true,
      "author": "Avid reader",
      "helpful_votes": 0,
      "publication_date": 20110418
    },
    {
      "title": "The big eyes make is so adorable and the blue outline of the eyes is sparkly ...",
      "text": "This is a very cute small Beanie Baby. The big eyes make is so adorable and the blue outline of the eyes is sparkly making it extra adorable. I purchased this for my granddaughter and she squealed with joy when she saw it.",
      "rating": 5.0,
      "verified": true,
      "author": "Janetta Jewell",
      "helpful_votes": 0,
      "publication_date": 20170126
    },
    {
      "title": "They both love it!",
      "text": "This was a gift. Sent to a friend for her Son. They both love it! :)",
      "rating": 5.0,
      "verified": true,
      "author": "TammyToo",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "Adorbs",
      "text": "My girlfriend loved it. We had to resow along its back after 6 months but it's still adorable",
      "rating": 5.0,
      "verified": true,
      "author": "javi",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Great color combination",
      "text": "A sweet plush Slush Dog. It's not very big so it can go along anywhere. The eyes appear oval but are actually round.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay Thornton",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "Whats not to love !",
      "text": "Whats not to love, it's a Beanie Boo. Slush is super cute and like all the other Beanie Boos, has those sparkly eyes. My daughter just can't get enough of these toys. Ty always make a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "gghadden",
      "helpful_votes": 0,
      "publication_date": 20170121
    },
    {
      "title": "Perfect",
      "text": "I've been looking for this beanie boo forever & i finally found him. He's perfect & soft & cute. I recommend to anyone that collects beanie boos. It also came 2 days before estimated delivery date ^.^",
      "rating": 5.0,
      "verified": true,
      "author": "marshy",
      "helpful_votes": 3,
      "publication_date": 20140121
    },
    {
      "title": "Cute little husky",
      "text": "I just love beanie boos! Got this for my new baby nephew, found the name fitting since he was born on the first night of snow we had. All the kids in the family have a beanie boo now!",
      "rating": 5.0,
      "verified": true,
      "author": "jlfriddle2012",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "its little like the size of a dollar",
      "text": "cute and soft... its little like the size of a dollar tall",
      "rating": 5.0,
      "verified": true,
      "author": "steph",
      "helpful_votes": 4,
      "publication_date": 20150811
    },
    {
      "title": "She loved it. Good quality materials and workmanship",
      "text": "This was a gift for my niece. She loved it. Good quality materials and workmanship. Sparkly eyes and soft fur made it a big hit!",
      "rating": 4.0,
      "verified": true,
      "author": "dreamweaver",
      "helpful_votes": 0,
      "publication_date": 20161022
    },
    {
      "title": "He's cute",
      "text": "He's probably my fav out of my daughter's collection. She really likes him too.",
      "rating": 5.0,
      "verified": true,
      "author": "Summer L",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Five Stars",
      "text": "My grandson was really happy when he received this for Christmas. He kept it with him all day.",
      "rating": 5.0,
      "verified": true,
      "author": "tomato lover",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "Kind of useless, but cute",
      "text": "Kind of useless, but cute. Got it as a gift for my dad, and it's pretty cute being displayed on a shelf. His cat hasn't destroyed it...yet.",
      "rating": 5.0,
      "verified": true,
      "author": "MingTop Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Beautiful",
      "text": "Beautiful TY toy I love it. Also arrived fast and in fantastic new condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandrea Phelps",
      "helpful_votes": 0,
      "publication_date": 20180203
    },
    {
      "title": "Perfect gift",
      "text": "A Beanie Baby Husky was the only thing my daughter wanted for Christmas, and this one is adorable with it's huge eyes! I was thrilled to find it at a reasonable price. It is perfect! She misses her dog terribly.",
      "rating": 5.0,
      "verified": true,
      "author": "Jrzygrandma",
      "helpful_votes": 0,
      "publication_date": 20161222
    },
    {
      "title": "Too small",
      "text": "They are much smaller than that description. The 8 inch pipe is actually 6 inches tall including the ears. The 13 inch pipe is actually 9 inches tall.",
      "rating": 2.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Perfectly as described",
      "text": "Too cute! My son loves puppy dogs and he was super excited about this one. No flaws and super soft!",
      "rating": 5.0,
      "verified": true,
      "author": "squishy",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "Five Stars",
      "text": "Super cute and perfect for my nephew who wanted an animal with big eyes. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Allen",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "Love the puppy",
      "text": "Love the puppy. Big colorful eyes, super soft fur and doesn't feel like one of those cheap ones. Cost half of my local store and came in perfect condition with the ear tag and all. Very happy. I hope to get some of the other animals too.",
      "rating": 5.0,
      "verified": true,
      "author": "KD",
      "helpful_votes": 0,
      "publication_date": 20141218
    },
    {
      "title": "Defective. Real item does not look like what's in the picture.",
      "text": "Eyes and nose are slanted. Head tilted. Nothing on the product page is mentioned about not able to return the item. Only found about it when trying to initiate the return. Will not buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "Jia Y.",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Cute Beanie Boo Sled Dog Husky Pup",
      "text": "My kids love Beanie Boos. We got Slush the Husky to go with some of his other Arctic plush animals. Super cute and soft toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole B",
      "helpful_votes": 0,
      "publication_date": 20160315
    },
    {
      "title": "My 8 year old loves these",
      "text": "Just like the rest of the beanie boos. very cute and looks just like the picture. My 8 year old daughter is obsessed with these. This was just another one to add to her collection!",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "Cutest things ever!!",
      "text": "I got this for my granddaughter for her birthday and she absolutely loves it!! She's now asking for the bigger one!",
      "rating": 5.0,
      "verified": true,
      "author": "B. Bertini",
      "helpful_votes": 2,
      "publication_date": 20150710
    },
    {
      "title": "Cute soft cuudly",
      "text": "I loved it its so soft and cute and cudlly",
      "rating": 5.0,
      "verified": true,
      "author": "Ahmet S Ates",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Very cute and a smashing success with my toddler",
      "text": "A favorite of my toddler on a daily basis, now part of her bedtime routine - first the husky goes to bed then her....",
      "rating": 5.0,
      "verified": true,
      "author": "C. Gafton",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "Cute husky!",
      "text": "This beanie boo came in perfect shape, and size, just like the description says. It is really cute, my daughter loves it. I recommend this to anyone who is a beanie boo collector, or to anyone who loves animals.",
      "rating": 5.0,
      "verified": true,
      "author": "koala",
      "helpful_votes": 2,
      "publication_date": 20140120
    },
    {
      "title": "It was a gift for a 1 year old and she loved",
      "text": "It’s veru cute. It was a gift for a 1 year old and she loved it",
      "rating": 5.0,
      "verified": true,
      "author": "St Paul Lutheran Church",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Its so cute",
      "text": "My daughter has a big version of this and she wanted a small one. She absolutely loves it...",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Kampschmidt",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "TY tags cut off. Appeared used",
      "text": "There was no TY tags which was the only reason I bought these two, because this doll has the same birthday as my friends. It was a gift, but now I will have to buy another one.",
      "rating": 1.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Amazing!",
      "text": "If you are a collector, this is the one to get! Package delivered much quicker than the projected arrival dates. This Beanie Boo is the first edition / from 2012 and is the real deal. He has the purple tag and also the tush tag. This is an amazing product with amazing service.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Carlson",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Five Stars",
      "text": "We love it. My little peanut is collecting these. So he loves them. Definitely buying more.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170611
    },
    {
      "title": "... have one where we live so this one is perfect for her she takes it everywhere with her it ...",
      "text": "Our daughter wants a real Husky but we can't have one where we live so this one is perfect for her she takes it everywhere with her it even sits at the dining room table for meals...Flush, soft and very durable",
      "rating": 5.0,
      "verified": true,
      "author": "RebelRedsOnFire",
      "helpful_votes": 0,
      "publication_date": 20160117
    },
    {
      "title": "Cute, but smaller than I pictured!",
      "text": "The husky arrived with the dementions as described, but smaller than I pictured. My granddaughter select the husky for her gift and loves it.",
      "rating": 4.0,
      "verified": true,
      "author": "Polka Dot",
      "helpful_votes": 0,
      "publication_date": 20160810
    },
    {
      "title": "VERY CUTE!",
      "text": "I bought this for a basket-stuffer for Easter for my 3 year old son. He is obsessed with these Beanie Boos! He already has a couple of them. I know he'll be excited to know the Easter Bunny brought him another since he BEGGED me to get him this one. What a sweetie. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Loving Wife & Mommy of Two",
      "helpful_votes": 0,
      "publication_date": 20130313
    },
    {
      "title": "Cute, but smaller than I thought.",
      "text": "Cute little doll. My buddy ended up stealing it from me, so I guess he liked it too. Smaller than I thought, but looks cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Cali",
      "helpful_votes": 0,
      "publication_date": 20151125
    },
    {
      "title": "Excellent Product!",
      "text": "My kids LOVE this beanie boo!! It's so cute and cuddly. The small size (approx. 6\") makes is very portable too! I have already bought 10+ of these beanie boos to give as gifts!",
      "rating": 5.0,
      "verified": true,
      "author": "Kari G.",
      "helpful_votes": 0,
      "publication_date": 20160801
    },
    {
      "title": "Beautiful baby husky",
      "text": "Cute, cuddly, well made, and beautiful. This little fellow can melt a child's heart, even an old child like myself. Buy two, they're small.",
      "rating": 5.0,
      "verified": true,
      "author": "T.C.",
      "helpful_votes": 0,
      "publication_date": 20160723
    },
    {
      "title": "... thought it was going to be but i still loved it 10 out of 10 would recommend",
      "text": "a little too small that i thought it was going to be but i still loved it 10 out of 10 would recommend!",
      "rating": 4.0,
      "verified": true,
      "author": "Dr.Sand",
      "helpful_votes": 0,
      "publication_date": 20160321
    },
    {
      "title": "Makes my daughter very happy.",
      "text": "My daughter has 6 of these things now. She carries them with her wrapped up in her blanket. She absolutely loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "Waxi",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "My kids love these ty beanie babies with the big sparkly eyes",
      "text": "My kids love these ty beanie babies with the big sparkly eyes! This husky was a hit and will be well loved.",
      "rating": 5.0,
      "verified": true,
      "author": "Janica2008",
      "helpful_votes": 0,
      "publication_date": 20160817
    },
    {
      "title": "Cute!",
      "text": "Perfect gift for my 3yr old niece. Super cute, and just the right amount of fluffy. She loves it so much she won't put it down.",
      "rating": 5.0,
      "verified": true,
      "author": "Abbie Potter",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Five Stars",
      "text": "This is a Christmas gift for my Granddaughter! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Dianne Lazar",
      "helpful_votes": 0,
      "publication_date": 20161107
    },
    {
      "title": "So cute I got 2 one for me and one ...",
      "text": "So cute I got 2 one for me and one for my 5 month old nephew he loves to cuddle and hug the beenie boos because they're just the right size for him and so soft he also start laughing because those big eyes lol",
      "rating": 5.0,
      "verified": true,
      "author": "Bun",
      "helpful_votes": 0,
      "publication_date": 20151209
    },
    {
      "title": "Adorable!!",
      "text": "Bought this for my nephew as a present, my neighbor's 6 year old daughter saw it and wanted me to give it to her. She cried when I said no. So needless to say, even spoiled children who have everything, still want this adorable little husky. :)",
      "rating": 5.0,
      "verified": true,
      "author": "AbsoluteBestValue",
      "helpful_votes": 0,
      "publication_date": 20131121
    },
    {
      "title": "Five Stars",
      "text": "As expected and very cute, daughter and girlfriend loves them",
      "rating": 5.0,
      "verified": true,
      "author": "World Traveller",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Great Boos Husky",
      "text": "Got to go along with Boos Leona Leopard. It is so soft and cuddly. My Sister will love it,because she loves Husky puppies. I know she'll be surprised when she opens it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tonita Abney",
      "helpful_votes": 0,
      "publication_date": 20150118
    },
    {
      "title": "Five Stars",
      "text": "Got this for my girlfriend and she absolutely loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Darian",
      "helpful_votes": 0,
      "publication_date": 20161004
    },
    {
      "title": "The eyes have it !",
      "text": "Bought for my grand-daughter, this Beanie Baby went over big. It is colorful. plush, and with large adorable eyes that captures your heart the first time you hold it. Great for a young lady !",
      "rating": 4.0,
      "verified": true,
      "author": "Rick Z.",
      "helpful_votes": 0,
      "publication_date": 20141211
    },
    {
      "title": "cute and fluffy!",
      "text": "Cute and fluffy. My daughter's love these Beanie Boos! They collect them! :) I think they are cute too!- great prices and one stop shop here!",
      "rating": 5.0,
      "verified": true,
      "author": "Cisnes",
      "helpful_votes": 0,
      "publication_date": 20150413
    },
    {
      "title": "Five Stars",
      "text": "I bought this for my friends daughter and she loved it! The are so cute and soft!",
      "rating": 5.0,
      "verified": true,
      "author": "M.Halsted",
      "helpful_votes": 2,
      "publication_date": 20140729
    },
    {
      "title": "It's another stuffed animal. Hopefully my dog doesn't chew ...",
      "text": "It's another stuffed animal. Hopefully my dog doesn't chew the eyeball out of this one. My kid loves it, and that's what matters.",
      "rating": 4.0,
      "verified": true,
      "author": "Quacktor",
      "helpful_votes": 2,
      "publication_date": 20150805
    },
    {
      "title": "Like it... But...",
      "text": "I very much like this! But the face looks alittle weird, like it's squashed together not by a lot but if you stare, it's noticeably. Other then that, I love husky's and I've been wanting this plush for a while! I adore the eyes and this collection!",
      "rating": 4.0,
      "verified": true,
      "author": "DarkRabbit",
      "helpful_votes": 0,
      "publication_date": 20140102
    },
    {
      "title": "Great",
      "text": "Adorable and comes wrapped in plastic to protect it from the factory to your home.",
      "rating": 5.0,
      "verified": true,
      "author": "TMH",
      "helpful_votes": 0,
      "publication_date": 20161031
    },
    {
      "title": "Looks Good",
      "text": "Looks and feels soft. Got it for my 10 year old sister and I bet she'll love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Neithan Millan",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Cutieee",
      "text": "This toy is super cute and adorable, just like most other reviewers said. Everyone in my family love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonian",
      "helpful_votes": 0,
      "publication_date": 20160520
    },
    {
      "title": "VERY CUTE",
      "text": "I bought this for my Grandson, he will love it. IT'S SO CUTE!!!",
      "rating": 5.0,
      "verified": true,
      "author": "blondie",
      "helpful_votes": 0,
      "publication_date": 20161113
    },
    {
      "title": "Very good and just what my son wanted, but it is small (it is a puppy)",
      "text": "My son got himself this with money from doing chores. He was a little disappointed to find that it's small - smaller than the other Beanie Boos. However, when we pointed out that it is a puppy, then he was OK with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Lewis W.",
      "helpful_votes": 0,
      "publication_date": 20130815
    },
    {
      "title": "Cute cute cute",
      "text": "Omg he’s so cute! I love the beanies! This made.a great gift for my daughter she was so happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Dinah Shane",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "the office decided to surprise our dog loving boss with a box of all kinds of stuffed puppies and this was perfect.: ) Came quickly and just as picture ...",
      "text": "For Boss' Day, the office decided to surprise our dog loving boss with a box of all kinds of stuffed puppies and this was perfect. :) Came quickly and just as picture appears.",
      "rating": 5.0,
      "verified": true,
      "author": "Jani",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "Cute",
      "text": "My wolf obsessed child loved it, so it’s a win.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Nye ",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Soft cuddly toy that kids love. My grandchildren have an assortment of these toys ...",
      "text": "Soft cuddly toy that kids love. My grandchildren have an assortment of these toys and this is a favorite. Well made and reasonably priced.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet Shipp",
      "helpful_votes": 0,
      "publication_date": 20150610
    },
    {
      "title": "My little boys favorite toy, his original was badly damaged by family ...",
      "text": "My little boys favorite toy, his original was badly damaged by family dog... New Wolfie, was here in days to save our little boy missing his favorite stuffed animal and being upset any further.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomrein",
      "helpful_votes": 0,
      "publication_date": 20170326
    },
    {
      "title": "Five Stars",
      "text": "adorable and just as expected, perfect gift for my 6 year old",
      "rating": 5.0,
      "verified": true,
      "author": "David Devanney",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Slush Husky Beanie Boo",
      "text": "Cute as can be, looks exactly like photo. Arrived in about a week.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20151218
    },
    {
      "title": "Came in ripped.",
      "text": "Just came in and it has a huge hole in the back of the neck.",
      "rating": 1.0,
      "verified": true,
      "author": "Kayla Mullins",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Fur is extremely soft and easy to wipe clean if it gets dirty",
      "text": "Fur is extremely soft and easy to wipe clean if it gets dirty. The husky itself is cute and I recommend it for any child who loves stuffed animals with big eyes",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin Kehlenbeck",
      "helpful_votes": 0,
      "publication_date": 20151120
    },
    {
      "title": "Adorable eyes, got it for my little one",
      "text": "Adorable eyes, got it for my little one. His go to, number one is A husky and he needed a baby",
      "rating": 4.0,
      "verified": true,
      "author": "✿ Brandy Alexandria ✿",
      "helpful_votes": 0,
      "publication_date": 20160622
    }
  ],
  "product_meta": {
    "title": "TY Beanie Boos Slush Dog",
    "description": "Slush - Dog rag\n\nFROM THE MANUFACTURER\nSlush the husky is silky soft & smiling your way. He's wagging his tail & asking you to come play.",
    "rating": 4.8,
    "feature_bullets": [
      "Polyester fibers",
      "Imported",
      "Official product from Ty’s NEW Beanie Boos Collection",
      "Look for the familiar heart-shaped tag that means you’ve purchased an authentic Ty product",
      "Handmade with the finest quality standards in the industry",
      "Requires no additional gift tag; inside allows you to insert “TO” and “FROM” information",
      "Collect them all"
    ],
    "specifications": {
      "Product Dimensions": "3 x 4 x 8 inches",
      "Item Weight": "0.01 ounces",
      "ASIN": "B002Q4M5PQ",
      "Item model number": "36006",
      "Manufacturer recommended age": "3 years and up",
      "Batteries": "1 AA batteries required.",
      "Best Sellers Rank": "#15,530 in Toys & Games",
      "Customer Reviews": "4.8 out of 5 stars1,624 ratings4.8 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "November 16, 2009",
      "Mfg Recommended age": "36 months - 50 years",
      "Department": "Toys",
      "Manufacturer": "Ty"
    },
    "categories": [
      "Toys & Games",
      "Stuffed Animals & Plush Toys",
      "Stuffed Animals & Teddy Bears"
    ],
    "price": 11.49
  }
}