{
  "website_summaries": [
    {
      "verdict": "Keep cool with an air conditioner that also works as a fan or dehumidifier and operates via remote control.",
      "pros": [
        "3 modes of operation: air conditioner, fan, dehumidifier",
        "Coverage for an area up to 500 square feet",
        "Digital thermostatic control for temperatures between 61°F - 89°F",
        "Programmable timer",
        "Comes with remote control, carbon air filter, washable pre-filter, exhaust hose",
        "Dehumidifier can remove up to 101 pints per day",
        "3 fan speeds",
        "Window kit included",
        "Fan continues to run when room reaches set temperature and cooling unit shuts down"
      ],
      "cons": [
        "Very noisy and not very efficient",
        "Does not have heater",
        "Air is not directional"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It sucks",
      "text": "This thing sucks! I specifically ordered a 14,000 btu unit because I need the extra cooling power. My last unit was only 12,000 btu and it worked pretty good, but I wanted to take it to the next level from pretty good. Did I mention that this thing sucks? IT SUCKS! IN A 550 Sq. Ft. Condo on a 75 degree day, it couldn't keep the temp below 75 degrees!?!? It never actually blows cold air, just cool air,and yes I let it sit for a day after receiving it to let the freon settle. This thing sucks! It sucks, it sucks, it sucks! $452 worth of suckiness. Don't buy it! I wish I hadn't.",
      "rating": 1.0,
      "verified": true,
      "author": "bill wiesenbach",
      "helpful_votes": 390,
      "publication_date": 20180624
    },
    {
      "title": "Cools quickly.",
      "text": "Really good. It cools my living room. I live on the third floor of an 650 sq. Ft. Apartment facing south. Today the temperature only reached about 70 and was the first time we turned on the a/c. We will see how it works when temps. Reach the 90's. The a/c is attractive though. Only thing that I wished it had longer extension or add ons because my window measures 57\" and the unit's extension only measure around 43\"",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 65,
      "publication_date": 20170519
    },
    {
      "title": "This was in a relatively dry climate like Northern California",
      "text": "To summarize, awful product stay away. 1-Cheaply made. Mine leaked from underneath the unit after a dew uses. This was in a relatively dry climate like Northern California. I would hate to think how this performs in the South East. or other humid parts of US. You need to connect a drain line. Who has time for that? A return is not easy. This thing weighs 90 lbs. 2- Does not cool even a small room even though the installation is according to their instructions and claims 500sf or 700 sf of cooling. 3- non-intuitive controls and remote control 4- very bulky and hard to move and store away.",
      "rating": 1.0,
      "verified": true,
      "author": "RT",
      "helpful_votes": 23,
      "publication_date": 20180623
    },
    {
      "title": "I live in AZ, and it works perfectly!",
      "text": "I had an issues where the house I am in has difficulties heating and cooling the master bedroom. While living in AZ, I scrambled to find a way to cool my room better this year and came across this. First off its cheaper than going to Lowes or Home Depot. Second, it cooled my room in a matter of minutes. Lastly, I didnt see that large of a spike in my electric bill. Even tho I ran it all day everyday. Honestly the ONLY reason I wanted this particular one was that it allowed sliding window access. When all other ones I kept finding would only work for traditional up/down windows. 100% happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Emilio Cariman",
      "helpful_votes": 7,
      "publication_date": 20200620
    },
    {
      "title": "When replacement came in seemed to work fine for the last 6 months so I bought another ...",
      "text": "Second unit I bought that has electrical problems. First one I was able to exchange because it was within the thirty days. When replacement came in seemed to work fine for the last 6 months so I bought another one. I woke up to electrical smoke throughout my house and was able to determine that it came from unit. It is just past the thirty days, so how am I able to return unit? Do not recommend unit based on severe electrical issues, not being safe.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 24,
      "publication_date": 20170724
    },
    {
      "title": "I use this to cool my finished, dormered attic",
      "text": "I use this to cool my finished, dormered attic. The central A/C on my old bungalow can cool the rest of the house ok, but it's not quite large enough to cool the attic too. So I shut-off all the ducts to the attic, and installed this up there. My attic is probably 25'x50', and this unit handles it just fine. I also didn't need to install it in the window, on a support bracket, as the in-window units require. Pretty easy. And way, way cheaper than installing a second central A/C unit, or replacing the existing central A/C unit with a bigger one.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Tucker",
      "helpful_votes": 16,
      "publication_date": 20170621
    },
    {
      "title": "I was not happy with this product what so ever",
      "text": "I was not happy with this product what so ever. Its huge, The outside cover is made from cheap crappy plastic. NO SMART FEATURES AT ALL!!!!!!! ITS already 3/4ths 2018 and we still have companies who still implement stone age technology from the 90's. Draining this thing is a nightmare, just forget it. I do not recommend this unit what so ever for residential use. In a commercial environment such as Telecom closets and such, i would recommend this thing, but even then if space is an issue then this thing is totally the wrong pick. Cooling was Okay, not really impressive, but did a decent job for a 115v plug",
      "rating": 1.0,
      "verified": true,
      "author": "Hidden In the Jungle",
      "helpful_votes": 9,
      "publication_date": 20180918
    },
    {
      "title": "For the money if this seems like a fantastic solution.",
      "text": "Looking for an external air conditioner it was a difficult process. trying to find one that honestly cools a large space as a difficult process. This seemed to be the best for the money. Also the largest. I took a risk buying it however I ended up using it for far longer during the season than I ever thought I would. The cooling quality seems to be pretty good. I have a 1,000 ft2 loft two-story open to the bottom floor and it cools my entire unit relatively well. Definitely warmer on one end than the other but I'm practically never turned it off the entire summer.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael S. Clingerman",
      "helpful_votes": 4,
      "publication_date": 20200420
    },
    {
      "title": "Does what I need it to do. It is ...",
      "text": "Does what I need it to do. It is a back up to my central AC unit when power outages cause the power to be switched over to a portable generator. This unit has kept a portion of my home at a reasonable temperature on hot Florida summer days.",
      "rating": 5.0,
      "verified": true,
      "author": "Hal G",
      "helpful_votes": 10,
      "publication_date": 20180223
    },
    {
      "title": "Too expensive for the effectiveness",
      "text": "Product doesn't work well.i insulated everything and still wont cool past 78-80 degrees. I'm also a ac technician. Cool air vents are in a horrible position they dont hit u at all and exhaust and intake hoses are too close together which creates short cycling.. it's also very noisy. I eventually had to put a fan in front of the ac cool vents to push cool air downwards on me instead of facing up. Poor design. It could be better but needs work",
      "rating": 2.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 6,
      "publication_date": 20200425
    },
    {
      "title": "That’s why I gave 3 stars",
      "text": "It’s a great machine with terrible accessories and even worse, no options to buy the accessories. You get the accessories it comes with and good luck figuring out a solution at the Home Depot if the accessories don’t quite fit your windows. That’s why I gave 3 stars. It’s a great machine (we bought 2). We live in a 2 bed/ 2 bath 900 sq ft condominium w/out central air. We bought 1 larger AC unit for the living room and the smaller one (same brand) for the master. They are good machines that could be better given proper accessories.",
      "rating": 3.0,
      "verified": true,
      "author": "Maura",
      "helpful_votes": 5,
      "publication_date": 20200424
    },
    {
      "title": "Just what I needed",
      "text": "There is a 600 square foot area of our home that is secluded from the rest of the house. Without this unit, the temperature in this area can get to 10-15 degrees F hotter than the rest of the home on hot days. We use this unit to get the temperature of the area back in line with the rest of the home. It works like a charm, making the 600 square foot area very inhabitable on hot days. With this unit, the temperature throughout our home is the same everywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Earl Whitney",
      "helpful_votes": 5,
      "publication_date": 20190712
    },
    {
      "title": "Does not work",
      "text": "Can't even cool a 10 by 10 room, it just doesn't work, DO NOT BUY",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20200425
    },
    {
      "title": "Quit cooling two weeks before one year warranty was up ...",
      "text": "Added two more stars as they were very good about sending me parts that I could use to fix it my self. They sent me a fan for the unit at no charge for part or shipping. That turned out to be the problem and now the unit works fine. Quit cooling two weeks before one year warranty was up. How lucky, right? No --warranty is worthless as you have to ship it back to them for service. That was over 300$. So, do I spend the money to send it to a company who is really sketchy and will probably figure out a way to deny the warranty once they get it? No - Is junk now.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 9,
      "publication_date": 20170726
    },
    {
      "title": "I can't fit a window unit and these are life savers",
      "text": "I have tried different brands including Haier and LG. They are nothing compare to this Whynter. The Haiers both self destructed with in a few months when the squirrel cage fans failed. Haier refused to repair either unit. We then had 2 LG units. These leaked water and just didnt cool very well either. The Whynter is a different experience entirely. They work great. We have used them all season long and we love a cool house. Usually 70 or under when possible, so they got a lot of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 5,
      "publication_date": 20180928
    },
    {
      "title": "Very disappointed",
      "text": "The product came and had been dropped by a carrier. It was dented on the right shoulder of the device and the compressor would not turn on. When my husband went to plug it in and it died. So then we had to box it up and send it back to the shipper. We are both very disappointed. Also it was a week and a half late and we have Amazon prime which should’ve come in two days.",
      "rating": 1.0,
      "verified": true,
      "author": "Elisabeth Henderson",
      "helpful_votes": 4,
      "publication_date": 20200723
    },
    {
      "title": "Everyone needs this",
      "text": "Life saver, have been using it all summer with no problems. I have it in a 800 sq ft apartment and it chills the whole place. Its pretty loud but my GF and I can definitely sleep well through the night and it’s basically at the foot of my bed. Also my electric bill only went up by about $10 dollars a month with use for about 15 hours a day (when I’m home including throughout the night)",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Scott McWilliams",
      "helpful_votes": 4,
      "publication_date": 20191006
    },
    {
      "title": "Easy installation",
      "text": "Our Whynter portable A/C was expertly packaged, easy to install, works very well, and will be easy to clean and roll away for winter storage. We have small windows, and this was the best option to air condition our room. No need to empty the water, as it exhausts out the window hose. We only needed to turn up the TV a couple of clicks to compensate for the fan noise. Great purchase for older people.",
      "rating": 5.0,
      "verified": true,
      "author": "Lanette",
      "helpful_votes": 4,
      "publication_date": 20190824
    },
    {
      "title": "Replacement unit for damage  Unit during shipping, works perfect now.",
      "text": "The first unit arrived damaged during shipping and factory was Not helpful whatsoever but AMAZON made it right. They replaced the unit at no charge and it works great, much quieter than the damaged one and keeps our large living room nice and cool. Could not have done without it during the heat, fires and smoke of the West. Thank you AMAZON.",
      "rating": 5.0,
      "verified": true,
      "author": "K.run",
      "helpful_votes": 3,
      "publication_date": 20200817
    },
    {
      "title": "I do not advise buying this unit. Very disappointed",
      "text": "Definitely not equivalent to a 14,000 BTU. I had to put it in a smaller room which only required a 10,000 BTU. Still struggled to keep room cool. Definitely very disappointed and regret not sending back. And this bad boy is soooooo loud!!!!! I no longer even use it. It’s put up in the shed",
      "rating": 1.0,
      "verified": true,
      "author": "Angieh Crouch",
      "helpful_votes": 4,
      "publication_date": 20200518
    },
    {
      "title": "What a waste!",
      "text": "This package came all banged up right out of the UPS van. I opened the box and noticed it had a large dent in the bottom and 2 broken plastic pieces. I could barely unbox it so when Amazon told me to take it to UPS, I had to laugh. We had no choice but to keep it and run it because it was summer and hot in our upstairs bedroom. We used it a total of 10 times and the compressor quit, fan but no cold air. This stuff should not be sold on Amazon because every large thing we have purchased comes with some damage from shipping. What a waste of money! Never again.",
      "rating": 2.0,
      "verified": true,
      "author": "David C.",
      "helpful_votes": 2,
      "publication_date": 20191028
    },
    {
      "title": "Highly recommend it, great unit!",
      "text": "This was very easy to hook up and our room is at the end of the central AC run do it's always been an issue well, issue solved! This keeps our 12x24 bedroom nice and cool and during the day we open our bedroom door and send the air into the family room to cool it as well and by doing so the central AC run alot less and keeps our whole home cooler, saving up money on our utility bill! We only wish we had gotten it sooner! We'd highly recommend it*****",
      "rating": 5.0,
      "verified": true,
      "author": "Penny",
      "helpful_votes": 3,
      "publication_date": 20200822
    },
    {
      "title": "Look elsewhere",
      "text": "We purchased the unit to use in the bedroom, but the fan turns off within a few minutes of the compressor we were looking for something that had the fan on all the time for background noise. its just loud enough to keep waking us up at night when it kicks on and off. Customer service told me it should stay on all the time and they would have support get back to me, after a week of waiting Amazon agreed to replace the unit. So now with unit 2 its doing the same thing, customer service just want to know if the hoses are connected correctly, i still cant get anyone from support to get back with me.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 3,
      "publication_date": 20200625
    },
    {
      "title": "Love it.",
      "text": "I like going to sleep with noise so I like it. It works great at keeping the room cold. Loving the low electric bill. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Sabonis",
      "helpful_votes": 4,
      "publication_date": 20200620
    },
    {
      "title": "does the job",
      "text": "this unit does an excellent job of cooling our bedroom which faces the west and heats up in the afternoon. Cools down the room in 15 minutes and we do not find it noisy...no more than a window a/c",
      "rating": 5.0,
      "verified": true,
      "author": "Bernard M.",
      "helpful_votes": 4,
      "publication_date": 20191102
    },
    {
      "title": "Fantastic Portable AC",
      "text": "This product is so much better than the usual portable AC you find. I had an LG previously, who I would not recommend to anyone because it flooded my floors leaking out condensation. I had a DeLonghi penguino which was ok but didn't crank out the power this one does even though the btus were almost identical. This AC cools our 850 sq foot house and we live in an area that gets to 108 degrees in august. Just a great portable AC!",
      "rating": 5.0,
      "verified": true,
      "author": "C and E F.",
      "helpful_votes": 2,
      "publication_date": 20200817
    },
    {
      "title": "Works well and pretty quiet",
      "text": "We have been really pleased with this AC. We purchased 3 of them and they are all working great. Easy set up. Easy to use. We esp like the timer feature so they can turn off a few hours after bedtime- that way we don't wake up too cold! We really have not used the remotes, primarily because since we have 3 in the house we are concerned that the remotes might not control just one but all 3 at once. We just use the manual buttons and that's been just fine for our purposes.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Bossard",
      "helpful_votes": 2,
      "publication_date": 20200611
    },
    {
      "title": "Loving it!",
      "text": "I’ve only had this product for about a month: 1. The lowest fan setting has been more than enough for a 12’3” x 10’11” room in 85-90 F weather. 2. The unit is very big. It’s not a cute, space-saving unit. I can sacrifice looks for efficiency. 3. Noise level is medium to loud, but surprisingly I don’t find it annoying. Other units do a lot of “weird” sounds, not this one. 4. I love that it comes with a cover, but I haven’t tried it yet, hoping it’s actually good. I’m very satisfied with this purchase, but time will tell about the longevity of this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Cris",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Warranty only covers 2 months of shipping",
      "text": "Have a few of these, and one failed after a few years out of warranty, another at 10 months. After making a warranty claim (1 year warranty), I found out Whynter only covers return shipping for 2 months after purchase. I don't have the original box and now I've to figure out how to get a box large enough to ship this across the country and pay for it. Not sure how much this will cost but will be looking at other options moving forward",
      "rating": 3.0,
      "verified": true,
      "author": "G. Chaprnka",
      "helpful_votes": 2,
      "publication_date": 20191219
    },
    {
      "title": "Kept my cool",
      "text": "Loved it. Fall now so not using it. But I loved it for the whole summer. Kept my large 18 x 16 upstairs bedroom cool. High ceilings to boot! Used a ceiling fan to circulate the air but the Whynter did the job of keeping me cool on 100 degree days outside.",
      "rating": 5.0,
      "verified": true,
      "author": "pww",
      "helpful_votes": 4,
      "publication_date": 20191030
    },
    {
      "title": "Awesome unit, a really quiet workhorse",
      "text": "My apartment is about 900 sq feet, with several nooks, and is located in the Pacific Northwest region. We only get hot a few weeks out of the year, but this unit has been a lifesaver during those days. It is extremely easy to set up. The hose diameter that comes with the unit is 6 inches though.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 3,
      "publication_date": 20200613
    },
    {
      "title": "A  Winner",
      "text": "Cools down my 425 sq foot room to 65° and drops the humidity. Acceptably quiet. The window mounting bracket should be A LOT more thoughtfully designed, The bracket is why I did not give the unit 5 stars. I wish it worked with a smartphone app instead of a !@#!@? hand held remote. I mean it is 2020, not 1970.",
      "rating": 4.0,
      "verified": true,
      "author": "Glen Miranker",
      "helpful_votes": 2,
      "publication_date": 20200731
    },
    {
      "title": "A great value!",
      "text": "I've had it for a couple of months now just started getting real hot and it's working wonderfully.😁 Wasn't to sure of the Whynter brand till now. Great product, the quality is excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "christopher",
      "helpful_votes": 12,
      "publication_date": 20170517
    },
    {
      "title": "Awful warranty and support",
      "text": "The product outright failed 6 months after purchasing it. I woke up to a loud bang that came from inside the machine, which lead to it violently shaking anytime it was turned on. I contacted support over the phone and a ticket was opened and I was told they’d email me with more info. Well, it took about a week to come to some sort of resolution because their support team is incredibly slow to respond. You’d be lucky if you got an email back within 24 hours. They finally determined that the machine needs to be repaired but they do not cover shipping the unit to their repair center (which is in California).",
      "rating": 1.0,
      "verified": true,
      "author": "mike knafo",
      "helpful_votes": 4,
      "publication_date": 20190409
    },
    {
      "title": "easily installed and it works",
      "text": "We received this air conditioner just 3 days after ordering it. It took me under 1 hour to install it in our living room after having to cut a little plastic in order to fit it to our window. We switched it on and oh it was nice to feel that cold air! It keeps our somewhat open living room which is about 600 square feet at 77 degrees when it is over 100 degrees outside. It isn't a whole house air conditioner, but it does the job it was made for. I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Clanon",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Amazing! Better than any window unit I",
      "text": "Awesome! Being a renter I have had a few portable ACs over the years. This was a little fiddly to set up but instructions were pretty clear and I'm sure there are online tutorials if you needed them. The only tools needed are a couple of Philip's head screwdrivers. It is over 100 deg outside and within 20 min the bedroom that had been hot for days was comfortable and cool. The room I'm cooking is about 200sqft. Only niggle is that the seal around where the hose meets the window plate and around the window plate have gaps but nothing a little tape or foam cant fix. Overall best AC ever and would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia March",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "I took a gamble and won this time",
      "text": "This unit replaces a 15 year old Danby that was ready for retirement. I was pleasantly surprised at the performance of this unit, and would highly recommend it to anyone. Keep in mind that it's only been up and running for a week so we'll see, but it seems like a solid product... UPDATE......This summer has been brutal with extended heatwaves and oppressive humidity, my Whynter ARC-14S has provided a wonderful bit of relief, I,m extremely pleased with this product .",
      "rating": 5.0,
      "verified": true,
      "author": "Eric ",
      "helpful_votes": 2,
      "publication_date": 20200613
    },
    {
      "title": "Great product -",
      "text": "I live in SC. The dual hose system works beatifully. I have not revicieved my power bill yet so I have to wait to see what it is costing me. However it functions well. The installation into the window was awkward but manageable. I need to rig it up better and more secure. Whynter did not disclose fully the effort for window installation. It is more than I thought it would be and I now need to develop a more secure solution. It cools very well.",
      "rating": 5.0,
      "verified": true,
      "author": "anonymous content",
      "helpful_votes": 2,
      "publication_date": 20190629
    },
    {
      "title": "An Excellent Unit",
      "text": "I love this air conditioning unit. It's somewhat loud, but spoils me by keeping my room nice and cool. Couldn't live without this work horse.",
      "rating": 5.0,
      "verified": true,
      "author": "linph",
      "helpful_votes": 3,
      "publication_date": 20200304
    },
    {
      "title": "Dependable and reasonable",
      "text": "I have owned my share of portable A/C units; this one does not have a bright always-on light, the dehumidifying portion is better than previous (while still evaporating, not requiring drain hose) and the hose fits snugly (previous hose's would fall out). Cons: I prefer a constant-on fan; this unit will turn completely off when the room has cooled below desired temp and then turn completely on again (only a problem for light sleepers). Also, the remote has no lighted screen or numbers, which is only a middle of the night problem as well. All-in-all it is a quality, durable, efficient product which cools a very large area quickly and was not too expensive or difficult to install / move.",
      "rating": 4.0,
      "verified": true,
      "author": "Veach G.",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Cool!",
      "text": "A good portable air-conditioner. It cools our 20 x 20 garage here in Florida. We work on our art in the garage and need it to be cool in the Florida summer heat and this unit does the trick. haven't noticed much increase in our daily electric usage. Vented out a door window it is attractive and because it's on wheels we can adjust its location as needed. Would most certainly buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Melida Sottong",
      "helpful_votes": 3,
      "publication_date": 20190708
    },
    {
      "title": "Great ac unit",
      "text": "Good AC unit, I've had it for a few years now and run it for maybe 7 or 8 months out of the year 24/7 at the lowest temp. No issues with it leaking or needing a drain pipe attached which I'm really thankful for.",
      "rating": 5.0,
      "verified": true,
      "author": "Hoyt",
      "helpful_votes": 3,
      "publication_date": 20190821
    },
    {
      "title": "Broke after 3 months of use it literally grenaded now ...",
      "text": "Broke after 3 months of use it literally grenaded now I have to call and pay for return shipping to have them fix it. Reliability is clearly not that good. Customer support is horrible as far as warranty repair goes you are responsible to fix it they will send you the part and that it no instructions or anything",
      "rating": 1.0,
      "verified": true,
      "author": "joshua",
      "helpful_votes": 16,
      "publication_date": 20171226
    },
    {
      "title": "A huge quality of life upgrade",
      "text": "Really a life saver in the summers. I have had my whynter portable a/c for two years and have enjoyed using it during those host summer nights. It keeps my small bedroom cool. I have been replacing the carbon air filters with higher quality once from amazon and have not had any trouble with the unit. Its been really helpful and helps me get around my home owner association rules against window units. I have recommended this exact model to other friends and they have been pleased with the purchase. The a/c is very heavy and difficult to get upstairs but is very well built and has not had any problems with constant daily use for the last two years.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 3,
      "publication_date": 20180824
    },
    {
      "title": "Much improved over earlier versions",
      "text": "We had a Whytner portable air conditioner for my son's room for a couple years. It was loud, not that efficient and eventually completely stopped working. I had the extended warranty on it and was quickly reimbursed for the old unit. I bumped up to this 12000 BTU model and it's head and shoulder better than the old one. So quiet that sometimes I don't even realize it's running. Very efficient and easy to use. We have a window unit in another upstairs bedroom. If it were to go out, I would buy another one of these in a heartbeat.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott L. Page",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Very good buy does what was advertised to do",
      "text": "The unit easily kept the temperature and humidity at a comfortable level. Could be quieter for sleeping, but it did not keep me awake. Installation was easy, and with some imagination could be adapted to unusual situations .",
      "rating": 5.0,
      "verified": true,
      "author": "Dan P",
      "helpful_votes": 4,
      "publication_date": 20191206
    },
    {
      "title": "The room is only like 200 sq sf",
      "text": "Me and the wife are really unhappy with this A\\C. We use it in the bedroom at night and it does not really work. The room is only like 200 sq sf. Some nights we were still sweating and the a.c. was set on its lowest setting (64°f) . I regret this so much. For the price it is terrible.",
      "rating": 2.0,
      "verified": true,
      "author": "David B R.",
      "helpful_votes": 4,
      "publication_date": 20171231
    },
    {
      "title": "Great",
      "text": "We were in the midst of a hot and humid week and I had to be home self-isolating in an older home without AC. Our older windows were small and the adapter was too large by about an inch, but once I got it trimmed to fit the window the setup was a snap. It kept our two rooms downstairs cool and bearable with low humidity. I am very glad I made this purchase. I have not had to drain it at all despite some days being very very very humid!!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda A. Meier",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Definitely recommend!",
      "text": "I love this AC. This is the second I have purchased. Purchased my first in Jan of 2020 and a second Aug 2020. If I close my two room doors, this ac cools the remaining of my entire 500sqft apt, and I have a really long hallway. Even recently in Los Angeles when temperatures reached 107 degrees, the apt was cool. I didn't even recognize it was so hot out until the temp popped up on my phone. I was amazed. AC is ice cold. Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Haze",
      "helpful_votes": 3,
      "publication_date": 20200403
    },
    {
      "title": "great air conditioner for my small cabin",
      "text": "I wish I had known about dual hose air conditioners like this one when I bought my first one. The dual hose cools faster and is more efficient than the single hose style. This model was super easy to install and the quality seems to be excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Wheelin' Willy",
      "helpful_votes": 2,
      "publication_date": 20200529
    },
    {
      "title": "Would buy again",
      "text": "Works great. We have one small AC unit in the living room of our two bedroom apt. This thing picked up the slack and then some to cool the rest of the apartment. It would be too loud to sleep in the same room with but we keept it in the second bedroom all summer and we where comfortable in the master bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew K",
      "helpful_votes": 3,
      "publication_date": 20181209
    },
    {
      "title": "Really does the job",
      "text": "i was hesitant on buying this. i had bought similar portables and did not work as i thought. after moving into a new residence, my windows cannot accommodate a window unit. we have central air. but bedroom is 27' x27 ' and takes the brunt of Pennsylvania's hot and humid days. it keeps my bedroom a comfortable temp of 62 degrees which we prefer to sleep. noise level is expected. electric bill did go up. but, not as high as i expected. i would definitely recommend this unit to cool a large room. i had it running since day 1. i shut it off occasionally to get it a break.",
      "rating": 5.0,
      "verified": true,
      "author": "boilomaker",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Great air conditioner but programmable timer is not adequate",
      "text": "Took about 2 hours to setup. Live in Florida and bought to keep garage cool. Have had it running for 3 days and is running well. The instructions are poor as previous reviewers have pointed out. I found the programmable instructions need to have examples to help with setup. It really is lacking in options. Al. You can do is set how many hours to run before turning off and how long to stay off. Their is no date/!time setting and no battery backup for when power is lost. This means you have to continuously monitor it and reset after losing power. They dont recommend using plug timers so your options are zero.",
      "rating": 4.0,
      "verified": true,
      "author": "Edward Gaudette",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Decent Portable AC",
      "text": "I've had this unit for 3 years with no reliability issues. My biggest gripes are that it is pretty loud and that you probably won't get the same cooling you could get from a similar BTU window unit (at least that's been my experience). Otherwise, the build quality is just okay. I have to tape the filter cover on now. Also, crazy they are still selling this model. Like I say, no reliability issues, but I'm sure there have been some improvements across the industry, but this is priced higher than when I purchased it. Then again, could be from tariffs that are driving up the cost of goods for Americans.",
      "rating": 2.0,
      "verified": true,
      "author": "Neal Swagner",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Great cooling",
      "text": "Bought for my large garage. Only using the air out vent. So far it is working very well. Low noise, great cooling and good remote. Not sure about how this will affect my electric bill - but appears very energy efficient!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200601
    },
    {
      "title": "Wish I would have pulled the trigger on this purchase sooner!!!",
      "text": "I did a lot of research about portable AC units before purchasing this one. I have to say I’m extremely happy I did! Keeps my room cold and you can feel it in my living room! I will say connecting the hoses was the most difficult part of the set up for me. They kept fall off the connector pieces. Once I got everything connected it’s been a dream. I have it running while I’m at work and all night. Just set the temp and it will shut off once at that temp. My monthly energy bill had a very minimal effect. I was pleasantly surprised and very pleased when I got my bill. A must buy in my book",
      "rating": 5.0,
      "verified": true,
      "author": "sydnie",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Its just not very powerful and I'm sad",
      "text": "I'm sorry but this unit is not very powerful and I'm really disappointed. It took me awhile to get it because it is so popular because it's supposed to be one of the best. I would return it but I waited to long to make decision with all thats going on right now. I took extreme care in connecting it correctly and even wrapped the heat exhaust hose in an insulated tape. Its still weak in its cooling power. The air is not frigid its just cool even when you put your hand inches away.Its so sad because a three year old one that I paid $320.00 for is a much better unit.",
      "rating": 2.0,
      "verified": true,
      "author": "Avid Book Lover",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Using 2 in my shop",
      "text": "I'm using two of these on my shop. The building is a bit over 1100 sq.ft. with 12 ft ceiling. In July it gets well over 100 degrees here. This is a very demanding environment for these units but they hold the temp in my shop around 80 when it's 100 outside. Bottom line, these units make lots of cold air. Also very important: this design does not draw air from the room, so it doesn't pull hot outside air into the room like the single hose units do. This is a good design and seems fairly well built.",
      "rating": 5.0,
      "verified": true,
      "author": "John Munley",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Nope",
      "text": "I was excited to get this and set it up. I'm very disappointed. This is the first portable AC unit I've had as the others were window units. This model is so LOUD. I bought it for my bedroom and I can't hear the TV when the unit is on, have a conversation or SLEEP. This purchase was a complete waste of money.",
      "rating": 2.0,
      "verified": true,
      "author": "Eve",
      "helpful_votes": 2,
      "publication_date": 20190423
    },
    {
      "title": "It works!",
      "text": "Our house is an old loft style home. Very open concept. We have one unit upstairs and another downstairs. We just lived through a month of 95 degree days and our house was definitely cooler and drier. We haven’t use the exhaust pipe. The water really does evaporate from the unit itself. Amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 2,
      "publication_date": 20190818
    },
    {
      "title": "Whynter 14,000- The best A/C for us !",
      "text": "Folks- We just set-up our Whynter 14,000 A/C. Wow!! So very simple to assemble. It Purrs like a kitten. More importantly, the cool air feels fabulous- It is almost October in Northern California and it is 95 degrees today. We don't \"do heat\" up here so we had to splurge and buy an a/c to make things bearable up here. We send a big shout-out and kudos to Whynter and its superb employees for making a product that is simply perfect ! We may be purchasing another one for the upstairs next season. Thank you so much for getting us thru this hot season. CB Gonzalez",
      "rating": 5.0,
      "verified": true,
      "author": "Budola",
      "helpful_votes": 2,
      "publication_date": 20170927
    },
    {
      "title": "Not 14k BTU, more like 10k btu. If it last I'll be happy. Time will tell.",
      "text": "I have a 14k, 12k and 10k btu window ac units. This cools the same as my 10k. It cools, but no where close to what my 14k puts out. It is very cheaply made and has me concerned, but it is working. Noise level is about the same as my old unit. I had a delonghi 12k btu that lasted 7 years prior to this but it was a single tube and I wanted dual tube this time as the old unit definitely pulled hot air out of the attic. I'd love to get half that out of this but I have my doubts.",
      "rating": 3.0,
      "verified": true,
      "author": "GNX",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Noise level is high",
      "text": "Product description says Noise level (dBA): <56 But as soon I turned on, I felt the noise level was too high. So, I measured the noise level and it is close to 60 dB. Pretty loud.",
      "rating": 3.0,
      "verified": true,
      "author": "Abu Hafiz",
      "helpful_votes": 3,
      "publication_date": 20200422
    },
    {
      "title": "Definitely worth the money!",
      "text": "This is one of the best investments I've ever made! I'm going on my fourth summer now and have had no negative issues, it's been a life saver! I have a 1300 sq. ft. house and it's always kept it comfortable. On the real hot days (95+) you have to turn it on around 10:00 in the morning so it has a chance to keep it somewhat cool. I would definitely recommend this product and will definitely buy another one if it would ever go kaput.",
      "rating": 5.0,
      "verified": true,
      "author": "robert baker",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "A huge disappointment",
      "text": "I could not have been more disappointed in this unit. I ordered the first one based the reviews but after using it for about a week in the dead of summer in a less than 500 square foot apartment I was floored at how little cooling it provided even with the fan at maximum and the tempature at 61 degrees. How can a machine of that size be so ineffective?? I was sure the machine was defective and ordered a replacement to find the same issue. Long story short. I was unimpressed by this AC. It didn't cool the space and in fact barely made it comfortable. For all it's size there's no real power. I can't recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 42,
      "publication_date": 20170830
    },
    {
      "title": "Wait 3 weeks before you think you should return it.",
      "text": "The other reviews were right. I didn't notice the air conditioner working until after 3 weeks. I was using it on a big room witch has to cool off both my living room and the kitchen. Overall it can cool the living room, but not the kitchen. Which is what the product describes to over the BTU limit. I have another air conditioner installed in the kitchen and together they cool the home quite well.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Lomeli",
      "helpful_votes": 2,
      "publication_date": 20180821
    },
    {
      "title": "Ac did not worked and had parts missing and customer service was not good!",
      "text": "Item was broken. Intake fixture was missing it the package and the filter cover was loose. When i finished installing the ac I turned it on and waited for the compressor to start but it wasn't cooling at all. I contacted the company and after 2 days they got back tome with a long instruction to check everything fining out tje tempurture of the air for 30 minutes and bunch of other things instead of fixing the issue. I started the refund fent the item 5 days ago and still haven't got my money back",
      "rating": 1.0,
      "verified": true,
      "author": "mozhan",
      "helpful_votes": 2,
      "publication_date": 20200510
    },
    {
      "title": "puts out a lot of cold air",
      "text": "We bought this as a 2nd backup unit for hurricane season. We do not find it especially loud in comparison to our older Amcor, and it sends out quite a bit of cold air. We ran the tube through our cat door, which we obviously would not be able to do during a hurricane. If you point it toward the center of the room, it should cool more than one area. A circulating fan in front of it might be the best idea for a really big room like ours, which is about 20 by 30 for the open living room and kitchen space.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 2,
      "publication_date": 20180624
    },
    {
      "title": "Powerful portable AC unit that cools like a champ.",
      "text": "Was somewhat nervous buying given mixed reviews but I did and I am happy with my purchase. This cools my living room and surrounding first floor rooms (over 1000sq ft) pretty well. I have not had to empty the water tank at all even in the summer months. It is a little loud, competing with the TV but tolerable. Easy to install. Overall, I’m very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Rank",
      "helpful_votes": 3,
      "publication_date": 20181006
    },
    {
      "title": "Great a/c unit. Get what you pay for",
      "text": "Works well I havent had any issues with it after several months of use. Easy to install",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory J. Michaels",
      "helpful_votes": 3,
      "publication_date": 20190908
    },
    {
      "title": "It somehow cools my room but not as good as the other reviews i read",
      "text": "bought this around February/March with my income tax money, didn't actually get to use it until 4 moths later in July so I'm not able to return it anymore. I have so much regret spending my money on this product. The remote stopped working within a few days, at first i thought it was just the batteries but no! It somehow cools my room but not as good as the other reviews i read. The worst part..my energy bill went up 3X!! not energy efficient If you need a portable AC unit, i suggest just go to Home Depot or Lowes or even walmart!",
      "rating": 1.0,
      "verified": true,
      "author": "Marlo Hernandez",
      "helpful_votes": 3,
      "publication_date": 20180907
    },
    {
      "title": "Great Air Conditioner!",
      "text": "This air conditioner works great! We put it in our living room which is about 700 sq feet and the cool air was able to go into the dining room and kitchen as well, with the fans we used to direct the air. We ordered the Antimicrobial filter which last 3 months and then cleaned just the screen filter every 2 weeks. As far as the water build up we had to drain it every week as it got pretty humid in Santa Barbara last summer. I cannot believe we went this long without one.",
      "rating": 5.0,
      "verified": true,
      "author": "Meg E",
      "helpful_votes": 2,
      "publication_date": 20180324
    },
    {
      "title": "Best thing to make me cumfy here on the outer banks NC",
      "text": "This thing keeps my \"beach box\" dry and cool even in the upper 90's! It replaced 2 noisy window ACs and is AWESOME!",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie ",
      "helpful_votes": 2,
      "publication_date": 20200817
    },
    {
      "title": "Working great for 3 years now.",
      "text": "It's relatively quiet, well - built, and does a good job cooling. I put a homemade pre-filter over the outside air intake and seem to have avoided getting the internal condenser fins dusty and dirty. Just remember to rinse and dry the pre filter every few months. Otherwise, no maintenance.",
      "rating": 5.0,
      "verified": true,
      "author": "Mondoman",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Not quiet",
      "text": "The compressor is inside with you so you will hear it. It is a little quieter than others. The two hose system works very well in any double hung window not a casement window. You will need to make a spacer to take up the space in the casement window to make up the space taken up by the screen. I do suggest adding an external directional vent or elbow on the exhaust port. Having said all that I will be buying another one next year.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "quiet and effecient",
      "text": "Living in New England we do have some hot humid summer months - I bought this for the upper floor (2 small bedrooms) of my Cape. But it is a large unit, so I moved it to the main floor and it easily cools the whole first floor of my house! Love the dual exhaust for efficiency. I did wrap flexible insulation around the exhaust hose, as it does get hot and didn't want the excess heat coming back in the room! It is a large unit, but very quiet and efficient. I've had it less that a week and have already recommended this model to friends!",
      "rating": 5.0,
      "verified": true,
      "author": "LMHeft",
      "helpful_votes": 4,
      "publication_date": 20160801
    },
    {
      "title": "Does not effectively cool my space, and uses a lot of energy so trips the circuit frequently",
      "text": "I got this to cool a large living room space which should have been within the 500 sq ft, but it doesn't effectively cool this space at all. My house also has old wiring, and if I use much else on the same circuit (like toaster oven), the circuit trips. I'd return it if I could, but I threw out the box. I'm trying to sell it online...",
      "rating": 1.0,
      "verified": true,
      "author": "J. Noah",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Disappointing.",
      "text": "I tried this for several weeks on a 425 sq ft 2nd story room and it wouldn't lower the room temperature below 72F when it was 85-90F outside. The air coming out of unit is cold, but it doesn't provide enough airflow for a room this size. Not only did I have to run the unit continuously to get it to 72F, It took several hours to reach this temp from 80F room temp. Not very efficient. It might be good for a smaller room like 250 sq ft, but definitely not for up to 500 sq ft room.",
      "rating": 3.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Cool in the desert.",
      "text": "We live in a fairly remote part of Arizona. Our power has gone out for as long as 2 days this past summer and 4 other times for just over 12 hours when temperatures were over 110. We bought this to keep us comfortable when the power goes out again. We have tested it in a 400 square foot room when it was 118 outside and it managed to keep that room at 82 degrees which is the temperature we keep our house during the summer months. This is going to keep us from having to stay at a hotel next year with our 2 dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 5,
      "publication_date": 20161031
    },
    {
      "title": "i got 2 years out of it",
      "text": "I got 2 years out of this unit. It cooled excellent and wasn't very loud. I'm coming to find out that all of portable air conditioners do not last long. Also keep in mind that My wife and I use this full time for our bedroom. We like to sleep cold. After awhile these units start to trip the breakers because as these units age, they have the tendency to draw a higher amperage. That's it in a nut shell. Other than that its a good overall unit.",
      "rating": 3.0,
      "verified": true,
      "author": "4HIM",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Not energy efficient and moist",
      "text": "This machine is more about having bronze then brains. It's big in size to appear like a good deal but it's not good enough for a small apartment and it doesn't pull water from the air so your space will be humid. My blankets I. The bedroom felt wet. I replaced my 12 year old unit and my light bill was $164 vs. my normal $49. That's $100+ difference for less of a machine then my old one.",
      "rating": 1.0,
      "verified": true,
      "author": "Susan Werner",
      "helpful_votes": 2,
      "publication_date": 20200808
    },
    {
      "title": "No plumbing needed for the condensate!",
      "text": "I needed an AC for my garage shop and this one is working great. All you need is a window and 10 minutes and it is up and cooling. I have had it for 2 weeks now and it is keeping my 2 car garage at 74 deg F without any problems. The dual port condenser makes it able to use outside air as input to the condenser and exhaust the hot air out the other duct. It does take up some floor space so you got to plan on loosing it. I had a window unit but it never seemed to be able to cool the space as well, time will tell.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Badger",
      "helpful_votes": 2,
      "publication_date": 20170829
    },
    {
      "title": "Fantastic unit. I'd say the room is about 350 ...",
      "text": "Fantastic unit. I'd say the room is about 350 sf, and it's necessary to turn up the temp a bit as it's so deliciously cold! With any of these units, it's a bit unwieldy to install the hoses out the window. However, this one is superior to a one-hose unit, which collects liquid in the unit. This one vents it out the window. It's also sleek and attractive.",
      "rating": 5.0,
      "verified": true,
      "author": "BeachyWave",
      "helpful_votes": 3,
      "publication_date": 20171124
    },
    {
      "title": "Don’t try to remove the hose, it breaks :(",
      "text": "The hose... removing it ... oh difficult! And of course I broke it taking it off. Poor design. The instructions do seem to acknowledge it is not easy. Well it isn’t, and you’ll probably snap the plastic if/when you try to remove it too!",
      "rating": 3.0,
      "verified": true,
      "author": "Hanks",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Easy set up, low noise level, fast cooling of large double room with high ceilings.",
      "text": "This is a 1st day review. Our central AC died smack in the middle of one of the worse heat waves we've ever had. Heat index today is 103° with 52% humidity. Our new Whynter portable AC arrived just in time. Set up was VERY easy! Only needed 1 person. Once I turned it on, it only took 5 minutes to see a change on our thermostat. Room temp was down to 72° within a half hour. So far, I am very impressed with this unit. One word of advice: make sure you attach the connectors evenly when turning counter clockwise. I got lazy with one, and it popped off when I was hooking the hoses up to the window.",
      "rating": 5.0,
      "verified": true,
      "author": "KD",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Can’t handle the space that it claims.",
      "text": "This product looks nice and is pretty quiet but it absolutely can not keep a 500 sq ft room cool on a 90 degree day. I put it in a fully insulated garage. It can’t even come close to handling it. It won’t even keep it under 80 degrees. I wish I hadn’t bought it.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeffrey Junker",
      "helpful_votes": 2,
      "publication_date": 20200810
    },
    {
      "title": "Nice in room air conditioner",
      "text": "The air conditioner comes in a double wall shipping box. It weighs 70 lbs. so it is a little awkward to handle crate. It arrived in good condition will be a great benefit during the hot and humid months here in Maine.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill N.",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Arrived Damaged Twice. Still a quality product.",
      "text": "Let’s face it. Transporting heavy objects stinks. I received one that was heavily damaged by the carrier ( wheel smashed down, side cracked). Amazon made it easy to get a replacement but repackaging it was not fun. Second came with cosmetic damage but has otherwise been solid. Don’t settle. Hold the carriers accountable by contacting Amazon if it arrives damaged. Solid AC unit.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "I've had other units similar to this one and the noise has been annoying especially at night",
      "text": "I paid extra for this unit because the reviews said it was QUIET....NOT! Quiet relative to what? a mac truck? I've had other units similar to this one and the noise has been annoying especially at night. This unit is as about as \"quiet\" as other cheaper units I could have purchased. However, It does a nice job cooling, and not a drop of water coming out of the drain in the back so it's evaporating from the water collection like was promised. Over all it's ok but I haven't been able to find a unit that is 'QUIET\" these units are relatively loud from the blower but if you like cold when it's hot...we'll have to deal with it.",
      "rating": 3.0,
      "verified": true,
      "author": "deus x machina",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Work excellent for 500 square feet can push more",
      "text": "This machine rocks. We had it in a 800 square foot group office for 5 years and it cools nicely with never doing any maintenance. I had installed it through the wall due to no open windows. I brought it home and cleaned it up and then bought a second exact model as I knew it worked well. So now we have one in each bedroom for a couple months of summer and could not be happier. A small energy jump but nothing like a full blown system that I don't need near the beach in SoCal. I can say works well for 5 + years and hope to get same and more out of 2 units.",
      "rating": 5.0,
      "verified": true,
      "author": "Elena",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "A life saver",
      "text": "I bought it for a summer home with no other A/C or cooling. It works OK if I close off other areas of house and concentrate on a couple hundred square feet. I don't have double hung windows so had to be a bit creative with the venting. It generally doesn't make the area cold but it does a nice job on removing humidity. I found it bulky, noisy and felt closed in but when heat index was triple digit it was a life saver.",
      "rating": 4.0,
      "verified": true,
      "author": "Raphael",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "The Best Portable A/C out there, for the price.",
      "text": "Has dual hoses to vent the condensor heat outside. Single hose units extract cooled air from inside the home or building to cool the condensor, not efficient at all. I have 3 of these units and they do very well.",
      "rating": 5.0,
      "verified": true,
      "author": "BLDG Images",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Expected better performance. Not as good as my 12000 BTU ...",
      "text": "Expected better performance. Not as good as my 12000 BTU Edge star I use upstairs. Also needed a 20 amp breaker and most in house are 15 amp. My Edge star supply air is about 10 degrees colder and cooled the same space I installed this one quicker. Nice machine but expected more. If I had choice again I would have just got another 12000 BTU Edgestar and not had to add a 20 amp breaker and limit to where I could plug this machine in.",
      "rating": 3.0,
      "verified": true,
      "author": "Eric Acevedo",
      "helpful_votes": 5,
      "publication_date": 20160804
    },
    {
      "title": "Great Buy",
      "text": "This AC is simply amazing! I did a lot of research that brought me to this portable AC, which ranked #1 on many sites. I have had it for about a year and it's still going strong. When I first bought it I had it in my living room which was about 400 square feet and it cooled it really well. I would open my windows at night, close them first thing in the morning and turn on the AC, by noon it would be nice temperature in the house. I feel this AC will last a long time, so it is definitely worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 5,
      "publication_date": 20151215
    },
    {
      "title": "A Great Little Portable A/C",
      "text": "This machine does a great job of cooling the main areas of our house. (We use a floor fan to move the air into the kitchen--which is not the room where it is located.) It has been a lifesaver during this hot summer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Tubing is a pain in the ass",
      "text": "It's an ok unit, the tubing is a pain in the ass, had to figure out how to put something in the window because the hardware wasn't long enough. I regret buying it, it's a decent unit but not powerful enough for my needs",
      "rating": 4.0,
      "verified": true,
      "author": "Christine Diaz",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Great Product",
      "text": "This product works so well! We put this in our family room and it cools the room plus can feel it cool more than just our family room. We have the same product in our bedroom and have enjoyed the air conditioning for many years. Great product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick and Christina",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Powerhouse portable AC",
      "text": "Love it! It's a littlebigger than we need but it really works. Well worth it. Make sure you have the AMPERAGE capacity necessary and a dedicated circuit for it as it draws a lot of power. We had some power issues initially in our studio due to this and the building being old. We had to find a dedicated circuit where we didn't use anything else to avoid popping breakers as it is 9AMPS.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180715
    },
    {
      "title": "Installation issues",
      "text": "The installation manual was of no help. It was clearly written by an engineer who did not have the perspective of a customer. In addition, there are small metal screws that are used to attach the plastic cuff that goes around the intake and exhaust hoses to the plastic panel that goes under/next to the window frame. These screws are worthless and do not hold the plastic pieces together. I had to find a substitute solution. The unit itself, seems to work adequately. Based on the cost, I would not recommend this product..",
      "rating": 3.0,
      "verified": true,
      "author": "Josephine A Hogin",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "It works super good!",
      "text": "Will cool my big and high ceiling bedroom in a snap but the noise it produces is big, I have to turn the volume up on my TV to be able to hear and have to turn it off during the night, I love how fast it cools my room down super fast so I can deal with the noise!",
      "rating": 5.0,
      "verified": true,
      "author": "Tony G.",
      "helpful_votes": 2,
      "publication_date": 20190829
    }
  ],
  "product_meta": {
    "title": "Whynter ARC-14S 14,000 BTU Dual Hose Portable Air Conditioner, Dehumidifier, Fan with Activated Carbon Filter plus Storage bag for Rooms up to 500 sq ft, Platinum And Black",
    "description": "Color:Platinum and Black| Style Name:Air Conditioner14,000 BTU cooling capacity Cools up to 500 square feet Dual hose operation Patented auto drain function auto exhausts condensate Air conditioner, fan, or dehumidifier modes 3 adjustable fan speeds Carbon air filter and washable pre-filter 61 to 89 degree F full thermostatic control Casters for easy mobility 24 hour programmable timer",
    "rating": 4.1,
    "feature_bullets": [
      "Award Winning: 1. Good Housekeeping's \"2020 Best Overall\" and \"can cool down a room faster than other portable units\" 2. Consumer Report's 2020 Highest Score; UL listed",
      "Dual hose operation; Cools up to a 500 square feet space(ambient temperature and humidity may influence optimum performance); Dehumidifying capacity: 71 pints per day; Air Flow (at high speed): 430 m3/h / 253 CFM; 3 fan speeds",
      "Three operational modes: Air conditioner, dehumidifier or fan; Cooling capacity 14000 BTU (ASHRAE-128 Standard) / 9500 BTU (DOE+ 2017 Standard); Maximum power consumption: 1300 W / 11.6 A.Never use harsh chemicals, oil-based products, detergents, chemically treated cloths orother cleaning solutions. These could possibly damage the body of the air conditioner",
      "Full thermostatic control (61°F - 89°F) with digital readout, 24 hour programmable timer; Eco-friendly CFC free green R-32 refrigerant; Patented auto drain function fully exhausts all condensate automatically in most environments",
      "Includes complete set window kit, remote control, activated carbon air filter, washable pre-filter, user manual and storage bag; Casters for easy mobility",
      "Extendable exhaust hose (up to 60″); Window kit dimension: 6.5″ W x 20″ L (minimum), 46″ (maximum); Unit dimensions: 19″ W x 16″ D x 35.5″ H"
    ],
    "specifications": {
      "Manufacturer": "Whynter",
      "Part Number": "ARC-14S",
      "Item Weight": "80 pounds",
      "Product Dimensions": "16 x 19 x 35.5 inches",
      "Item model number": "ARC-14S",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Platinum and Black",
      "Style": "Air Conditioner",
      "Voltage": "115 Volts",
      "Wattage": "1300 watts",
      "Installation Method": "Window",
      "Item Package Quantity": "1",
      "Air Flow Capacity": "222 Cubic Feet Per Minute",
      "Sound Level": "56 dB",
      "Included Components": "ACCESSORIES KIT",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Battery Cell Type": "Alkaline",
      "Warranty Description": "One year warranty on unit. Three year warranty on compressor.",
      "ASIN": "B0028AYQDC",
      "Customer Reviews": "4.1 out of 5 stars3,375 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#6,693 in Home & Kitchen",
      "Date First Available": "November 1, 2000"
    },
    "categories": [
      "Home & Kitchen",
      "Tools & Home Improvement",
      "Air Conditioners",
      "Portable",
      "Heating, Cooling & Air Quality"
    ],
    "price": 499.99
  }
}