{
  "website_summaries": [
    {
      "verdict": "The GoPro HD Hero captures crisp HD video and offers users a great deal of flexibility of resolution and mounting options. However, some users may find it to be too complex for its two-button interface and tiny screen.",
      "pros": [
        "The GoPro HD Hero Motorsports captures video in a variety of resolutions and frame rates up to and including 1080i full HD, as well as still photos",
        "The Hero has a large selection of mounting options and replacement parts",
        "The polycarbonate shell is submersible, shockproof, and--if it takes too bad of a beating--replaceable"
      ],
      "cons": [
        "The lack of a viewfinder makes precise aiming difficult",
        "The tiny LCD display and a cryptic menu is difficult to navigate without first consulting the manual",
        "Low-light performance still leaves much to be desired"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 6.0,
        "Performance": 8.0,
        "Image quality": 7.0
      },
      "publication_date": 20091124,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Never worked",
      "text": "Camera worked out of the box, but then stopped working a week or so later. Went back and forth with GoPro many (at least 6) times via phone and email. They offered many fixes, but ultimately nothing worked. It is not the battery, camera itself is dead. Ultimately requested my money back. Unfortunate, because it seems like a great product. Just not for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 3,
      "publication_date": 20150214
    },
    {
      "title": "great little camera",
      "text": "First of all the camera takes really good video, especially considering it's size. The camera was much smaller than I was expecting it to be (when outside it's case) and light weight. I have a contourHD as well and the color's on this are a bit more vivid. The mounting brackets can be a little bulky with all of the locking thumb screws but that's the only real downside I see. I'm not a professional videographer by any means, but the camera was a good buy when it was on sale. My first few videos don't look quite as good as most of the promo vids, but that could be from any number of reasons.",
      "rating": 5.0,
      "verified": true,
      "author": "Skywalker",
      "helpful_votes": 0,
      "publication_date": 20120413
    },
    {
      "title": "incredible action cam",
      "text": "Anyone familiar with the GoPro brand already knows this a very high quality product. It's the toughest camera on the market that I'm aware of and probably the most versatile as well. Aside from the superb (daytime) video and photo quality, the wide variety of mounts and accessories for this thing is what makes it such a good purchase for someone seeking an HD actioncam. It is also very easy to use (2-button operation) and is encased in an extremely tough housing. One thing to note is that video/photo quality is not great in bad lighting, at night or indoors...but that's sort of a given as with any camera.",
      "rating": 5.0,
      "verified": true,
      "author": "lex",
      "helpful_votes": 0,
      "publication_date": 20110216
    },
    {
      "title": "GoPro HD motosports hero camera",
      "text": "Great video quality, poor to okay sound, we have used the camera on a chest harness and helmet mount for skiing, snowboarding and dirtbiking. I have also used the suction cup mount on my streetbike and it held with no problems at all on a fairly bumpy road. One of my friends bought a different brand that is pretty close in price, has a more positive on and off switch, lasers that tell you where the camera is aimed (very handy) and can download gps info with speeds and altitudes. However the GoPro is waterproof which was a definite positive for me as we plan on using it for snorkel, scuba, and wakeboarding.",
      "rating": 4.0,
      "verified": true,
      "author": "Yardslave",
      "helpful_votes": 0,
      "publication_date": 20110513
    },
    {
      "title": "Great cam",
      "text": "I've used this off an on over the past few years and it still works perfectly. The \"motorsports mount\" works great but I can't help but worry about it flying off while driving. I've only used that mount a dozen or so times. I've more frequently used the GoPro for mountain biking and recording wildlife. I'm not sure if the new models have motion activation but it would be a great feature. Place this on your bird feeder for some great up close footage of those beautiful birds. :)",
      "rating": 5.0,
      "verified": true,
      "author": "TheW83",
      "helpful_votes": 0,
      "publication_date": 20140529
    },
    {
      "title": "GoProHd Hero..Great little camera",
      "text": "The GoProHd Hero is a perfect camera for racing or just about any sport, the picture quality is great, the unit is small and the operation is quite simple. The case is rugged and waterproof and it has replacable lens protectors(optional). It comes with a variety of mounting options, however, i would like to see a ball head type mount for more versatility, it could easily be done using a rubber ball and metal clamp/set screw much like the omnimount speaker mounts. Other than that, this is a great little camera and i highly reccomend it to anyone who wants to video their racing/sports activities.",
      "rating": 5.0,
      "verified": true,
      "author": "John Fitzgerald",
      "helpful_votes": 0,
      "publication_date": 20100416
    },
    {
      "title": "Good Camera, Clunky Interface",
      "text": "This is an amazingly small and portable sports camera that takes great action photos. I've done a couple of timelapse series with it that turned out great. But be warned that it uses a clunky interface that will frustrate those who have come to expect touch screens and iPhone elegance. The camera's menu system is accessed through arbitary patterns of pressing the camera's two buttons while reading cryptic messages on a tiny LCD screen. If you ever had an old Casio digital wristwatch, you'll know exactly how frustrating such an interface can be.",
      "rating": 4.0,
      "verified": true,
      "author": "William Carpenter",
      "helpful_votes": 0,
      "publication_date": 20120203
    },
    {
      "title": "GoPro is Pro",
      "text": "I've taken this camera with me to the desert, to the snow, on jarring trails, and on the highway in the rain. Not once has it failed me. It captures such stunning image quality and can do 60 frames per second, making everything seem so smooth. The housing is durable and is easily cleanable after a good mud splash- just use your thumb and some good ol spit grease. My friends love it; we use it for our Toyota trailing. I could just go on and on. Trust me- you don't wanna miss out on this camera. I haven't ran it in 1080P yet (using 960 for wide angle) but I'm more than sure it'll look amazing. Get this camera!",
      "rating": 5.0,
      "verified": true,
      "author": "Gregero",
      "helpful_votes": 0,
      "publication_date": 20110321
    },
    {
      "title": "Absolutely love it",
      "text": "I've used several other types of recorders and have been most satisfied with this one. I love the wide angel view which allows capture of so much more action. I love the impact and waterproof case which allows for recording in so many different types of environments. The methods of wearing the device are secure. Use is simple. The photographs wonderful. The software for trimming the video is easy to use. The accessories are vast. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendi",
      "helpful_votes": 0,
      "publication_date": 20131230
    },
    {
      "title": "Battery life could be better",
      "text": "GoPros are fun. And this one is probably really cheap now that it's two generations behind. Pick it up if it fits your needs, otherwise grab the Hero 3 White edition (the cheapest one) and get more bang for your buck. Hopefully they improved the battery life. It barely lasts 2 hours, which I think is ridiculous given that it's supposed to be for adventures and I'm not normally near a charge station when I'm adventuring.",
      "rating": 3.0,
      "verified": true,
      "author": "E. Raslich",
      "helpful_votes": 0,
      "publication_date": 20121118
    },
    {
      "title": "Used for ATV Riding and Mountain bike",
      "text": "WOW!! I am almost totally happy with my unit. I got it used and was very concerned bout if everything would be there once received. I am happy to say it was, and it works perfect like new, and awesome condition. The Bad: :( ONLY thing I had issues with was it came with two sets of intructions , both in Spanish or a language I had no idea what it stated so left me hunting online for the ENGLISH instructions to wit was not hard to find. Other then that everything was fine and awesome. :)",
      "rating": 5.0,
      "verified": true,
      "author": "2Bthe1",
      "helpful_votes": 0,
      "publication_date": 20120218
    },
    {
      "title": "Incredible",
      "text": "I love the go Pro. The videos are clear. The audio is clear and it records for a long time I use it on my bicycle and I get a lot of compliments. If a car runs into me again. I will have it on film. That way I can get the driver arrested and I can sue his insurance company, so he can't afford to drive anymore. You know how that goes when you recording it. They don't do anything wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "RR",
      "helpful_votes": 0,
      "publication_date": 20140217
    },
    {
      "title": "totally awesome, wroth every dollar.",
      "text": "0the best fun things I've bought, I've used it for riding quads, playing volleyball, SCUBA diving, a dash cam, and tons of random stuff... makes taking the kids to the park look like it was a lot of fun... and with 1080p it looks great to watch, I even bought a second one... wroth every dollar. I edit it with Power Director. love the whole processes, it makes it eazy and fun, and like i actually know what i'm doing, even thought I'm just a dumb ass with a nice camera. thanks my videos can be seen [...]",
      "rating": 5.0,
      "verified": true,
      "author": "J. Schmitt",
      "helpful_votes": 0,
      "publication_date": 20110627
    },
    {
      "title": "Poor quality",
      "text": "Bought this from Amazon, The unit died the first time I used it. I still have it in the box many years later",
      "rating": 1.0,
      "verified": true,
      "author": "Mo kim",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "I am a hero!",
      "text": "Awesome kit with everything you need to get started in recording your motorsports adventures. I use it for when I track my car and when I go gokarting. The included attachments work great on everything from helmets to other parts of the cars. The suction cup mount is awesome too and surprisingly solid! I would recommend for everyone who wants to record their racing action!",
      "rating": 5.0,
      "verified": true,
      "author": "Raul C",
      "helpful_votes": 0,
      "publication_date": 20140129
    },
    {
      "title": "I take this thing everywhere!",
      "text": "What can I say about this product? It's incredible! 1080p at 30 and 720p at 60? Plus timelapses you can set at 2, 5, 10, 30, and 60 second intervals? This is a great camera to have in your bag. Plus it goes underwater! Possibilities are endless. Underwater timelapse anyone? Why yes please! The menu is a little tricky to navigate since all you have is a tiny lcd on the front, but once you learn what means what, it's pretty simple... just a lot of button clicking! I find myself buying more and more accessories for it to mount it to different things. Like the chest strap and bike mount. Pure genius in a tiny little box!",
      "rating": 5.0,
      "verified": true,
      "author": "jeremyejackson",
      "helpful_votes": 0,
      "publication_date": 20100826
    },
    {
      "title": "I like it!",
      "text": "Have used it a number of times in the past month or so. Very nice quality. It has been under water many times. I'm totally satisified. Yes, sound is minimal when in the waterproof case but it will pick up underwater sounds fine. I have a number of videos on my vimeo page under conofconfusion. One glitch- the tripod mount has no threads! GoPro said they would send replacement so be sure to check your tripod mount if you order one.",
      "rating": 5.0,
      "verified": true,
      "author": "cosmicdust",
      "helpful_votes": 0,
      "publication_date": 20110729
    },
    {
      "title": "960 A Better Poorman's GoPro",
      "text": "This thing seems to work better than the Hero 3 that three of my friends have. They have battery issues and application issues and know this, the remote app will not work if the camera is even a couple inches under water. I never have operational problems like my buddies do and I use it everywhere dirt, water, snow, etc! and mine costs less than half of what the New Hero's cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Kato",
      "helpful_votes": 0,
      "publication_date": 20141003
    },
    {
      "title": "GoPro camera really works",
      "text": "I got this to capture my motorcycle rides and it is absolutely perfect for that task. The wide angle view works well here, but not if you want to see things the way your eye sees them. The human eye has a built in digital zoom effect which the camera cannot match. Not much at low light either, but if daytime road shots, or self shots are in order, you cannot beat this camera. Oh, did I say it can handle rain? I don't worry about this camera getting wet. Very very cool.",
      "rating": 5.0,
      "verified": true,
      "author": "J Russ",
      "helpful_votes": 0,
      "publication_date": 20110927
    },
    {
      "title": "Bought 2, had problems w/one, but GoPro fixed it!",
      "text": "Bought 2 of these bad boys, and one of them was bricked by an update. Wouldn't turn on, not even with a battery swap. GoPro fixed it and shipped it to me quickly. I've now switched out the lenses with wider aperture, longer length lenses, and removed the IR cut filter so they are nightvision-ready. There's a reason GoPro is considered the very best. My experience tells me this reputation is totally deserved.",
      "rating": 5.0,
      "verified": true,
      "author": "mineyourbiz",
      "helpful_votes": 0,
      "publication_date": 20130812
    },
    {
      "title": "go pro hero",
      "text": "I felt the directions, while lengthy, did not really give me the direction I needed to know what the individual mounting parts were for. That was left to \"trial and error\". Also, I don't feel that the camera is easy to use. Other than those comments, the camera worked as advertised and I was able to mount it to my helmet where it stayed firmly attached. The wide angle lense takes some getting used to but overall, I am satisfied with the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Keating",
      "helpful_votes": 0,
      "publication_date": 20120617
    },
    {
      "title": "Incredible for what it does, could use some tweaks",
      "text": "A bit high priced, but incredibly crisp HD video. Final Cut Express doesn't like its format, but that's probably as much to do with FCE being old than anything else, but if you own/use FCE, be prepared to get another program or two to convert, then get high qual slo-mo. Knob to tighten unit to headstraps is clumsy and slow, and it has no telephoto.... so if you're moving and close, as in on a river or bike or whatever, its incredible, but don't expect any shots of that deer or bird. Great product, a little overpriced.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeffe Aronson",
      "helpful_votes": 0,
      "publication_date": 20110608
    },
    {
      "title": "Great buy!",
      "text": "Great gadget! After reading the instructions, the camera is easy to operate. I bought a 16 GB card with it (extra). It takes only wide angle stills and video, but for filming in motion which is what it was designed for, it is great. Pushing the outer case control buttons was a little stiff at first, apparently the waterproofing o-rings come a little dry from the factory. I used a couple of drops of mineral oil, and became easy to push, and it will probably help the life of the o-rings. Other than that it takes great videos, sound is great, and can't wait to take underwater.",
      "rating": 5.0,
      "verified": true,
      "author": "mecano",
      "helpful_votes": 2,
      "publication_date": 20110709
    },
    {
      "title": "GoPro HD Camera Naked Motorsports Waterproof  Video Camera",
      "text": "Excellent camera for the video man looking for action shots. Many accessories are available for purchase that allows amazing shots. No viewfinder and getting to the right setting can be a pain but it's great for the price. Very wide angle, waterproof, and HD make it great. Not so great is the audio. Very small allows you to get great HD video in places a normal camera could never fit. I'm buying a second one...it's that great!",
      "rating": 5.0,
      "verified": true,
      "author": "IBoughtIt",
      "helpful_votes": 0,
      "publication_date": 20101005
    },
    {
      "title": "Just okay",
      "text": "Confusing to use. Too many codes to know for functions",
      "rating": 3.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Great POV Camera",
      "text": "Great POV camera for under 300 dollars, pictures a nice a crisp and videos are amazing. Great for action shots! The menu can be a little troublesome the first few times you use it but once you get the hang of it it's amazing what you can do. I highly recommend getting some video editing software when you buy this though, you can download free trial from the manufactures website to test drive a few before you spend 80+ on one though!",
      "rating": 5.0,
      "verified": true,
      "author": "Yokota",
      "helpful_votes": 0,
      "publication_date": 20110607
    },
    {
      "title": "i don't understand the poor reviews!",
      "text": "I have a couple of these cameras as does a friend of mine. The only problem I have ever had has been due to me forgetting my memory card. The camera does a great job on both stills and video. I will say that when recording if the mode button is clicked at the end of recording instead of the shutter button, then the file will trash automatically. I would guess that is what lead other reviewers to think they had junk cameras. This is also the case for the non-hd gopro.",
      "rating": 5.0,
      "verified": true,
      "author": "Shane M. Maberry",
      "helpful_votes": 2,
      "publication_date": 20110620
    },
    {
      "title": "I don't do extreme sports!",
      "text": "I got in a wreck with a car a few years back on my bicycle. The lady tried to claim she didn't back into a major one way street. It took 3 years of court battles to get her insurance to pay up. So now I use this to record my bike rides to and from work. It keeps people honest. I have also recorded some very funny moments I would have missed otherwise.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Carras",
      "helpful_votes": 0,
      "publication_date": 20130721
    },
    {
      "title": "Neat fun!",
      "text": "So excited about this! Mounted it to the dog and made some videos. Neat fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenee PS",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Good value, great videos",
      "text": "I bought this for my husband before he went on a trip to Africa. He found it easy enough to use, although the housing is a bit of a bother and it's too bad it doesn't have an LCD screen. It did hold up well under some difficult conditions and the video is excellent quality. We researched a good bit before we bought it and are satisfied with it so far. Have owned it for about 3 months.",
      "rating": 5.0,
      "verified": true,
      "author": "LenN",
      "helpful_votes": 0,
      "publication_date": 20110607
    },
    {
      "title": "My Husband loves his new GoProHD",
      "text": "Purchased for my husband for Christmas and he can't stop playing with it. He has taken videos, skiing, biking, swimming. Loves it!! Wishes it had a remote and came with it's own video editing software. He had to purchase QuickTime pro to edit the videos but they look awesome! Takes some practice to get the right tilt on the camera but that's all part of the fun! Look for videos on youtube from skifam1. He loves his GoProHD!!!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Olson",
      "helpful_votes": 2,
      "publication_date": 20100130
    },
    {
      "title": "Great present for avid snowboarder!",
      "text": "I purchased this item for my boyfriend for Christmas. After researching and reading many reviews, I chose the Hero HD instead of the newest HD2, which is geared more for professional film recording. He has used it on several occasions, and the ease of which we can review the video and stills, is great. The camera itself is durable and tiny. If you are looking for a gift for someone who loves outdoor sports, this item is great. The item arrived perfectly packaged, and as described.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirah Brown",
      "helpful_votes": 0,
      "publication_date": 20111231
    },
    {
      "title": "Even if it's just the first generation it rocks.",
      "text": "This camera is fantastic. Bought it used but wouldn't know it from looking at it, not a scratch and had all the manuals, cases, cables. I got it to record my daily commute but we ended up using also to record our vacations and just for fun. Not just for extreme sports, this makes any video an interesting one, plus the image quality is great, records in full 1080 HD. During low light conditions however the footage because too grainy. Nevertheless 5 stars from me.",
      "rating": 5.0,
      "verified": true,
      "author": "Juan E. Duque",
      "helpful_votes": 0,
      "publication_date": 20130116
    },
    {
      "title": "GoPro Camera",
      "text": "Great little camera. Works pretty well. Has some trouble with the sun or bright / dark areas. We took it inner tubing and took nearly 2000 pictures plus hours of videos in a week of fun. I can't seem to get the highest resolution video to play smoothly on anything I have PC wise. Hate to think I'll have to purchase a MAC just to see them correctly. In all, it's a fun new toy!",
      "rating": 4.0,
      "verified": true,
      "author": "J. McCann",
      "helpful_votes": 0,
      "publication_date": 20110805
    },
    {
      "title": "This camera is the business.",
      "text": "This is the best camera I have ever purchased. What it does it does incredibly well. I would have paid 5x the amount to get the same results, and because of that I will probably get 5 more. You really have to see this camera in action to believe it. The time lapses I get from vehicles, or stationary, are just incredible. Get the camera. You won't be sorry.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Overbeck",
      "helpful_votes": 0,
      "publication_date": 20110113
    },
    {
      "title": "Great toy",
      "text": "This camera keeps all its promises. Love it. The only criticism is that they should have better product descriptions for some of their related products. For example there is a mounting clip that comes with it and I have no idea what it is for or how to use it (the white little clippy thing which I think is called \"easy release clip)). There is no description with the product or online what it is for.",
      "rating": 5.0,
      "verified": true,
      "author": "Eisbaer",
      "helpful_votes": 2,
      "publication_date": 20110728
    },
    {
      "title": "Awesome",
      "text": "I bought the very first gopro version and it was pretty bad. Video wasn't too bad but they had a terrible audio problem. That problem was fixed with the HD version and the video is much much better as well. Now the have the 2 and 3 versions out already - can't keep up. I use this outdoors and am plenty happy with this one.",
      "rating": 5.0,
      "verified": true,
      "author": "campaholic",
      "helpful_votes": 0,
      "publication_date": 20121223
    },
    {
      "title": "Great camera",
      "text": "I bought this camera for my husband. He loves to ride bikes and being outdoors. The first thing he did was put the camera in the water! The video is very sporty. The picture is great. It works for biking riding, walking, with the kids and in the water. This camera is awesome. The only problem I have is that now he wants all the accessories!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Latham",
      "helpful_votes": 2,
      "publication_date": 20110418
    },
    {
      "title": "Great HD on a budget",
      "text": "There are only a few HD POV cameras on the market (Contour, V.I.O., GoPro and Drift), and the GoPro is probably the best all-around. It's the only one that's waterproof to 180' so if you ever plan on taking it in the water it's the only one to consider. The field ov vision is superb at 170 degrees wide-angle for 720p, and 60fps gives you great flexibility for slow-motino applications. The camera really is worthy of 5 stars but I gave it 4 stars because GoPro has yet to introduce the LCD backpack. Lack of LCD screen on this camera is kind of a bummer.",
      "rating": 4.0,
      "verified": true,
      "author": "David J. Zemens",
      "helpful_votes": 5,
      "publication_date": 20101121
    },
    {
      "title": "Perfect for Sky Diving",
      "text": "I have ordered this camera for a friend of mine who is doing sky diving and needs a small but efficient camera for the job. It takes 1080p videos and can run for a good time before running out of battery. As far as he said, all skydivers are considering this camera as the perfect option because of its tiny size and weight and high performance.",
      "rating": 5.0,
      "verified": true,
      "author": "Henri Savin",
      "helpful_votes": 0,
      "publication_date": 20110506
    },
    {
      "title": "GoPro is the best",
      "text": "I gave this 4 stars because it's the standard GoPro 3 black, not the 3+. I really think GoPro should have fixed the issues with battery and wireless before releasing. When I bought it I thought I got a good deal but did not realize that the 3+ was out, which solved those issues.",
      "rating": 4.0,
      "verified": true,
      "author": "kenc",
      "helpful_votes": 0,
      "publication_date": 20140226
    },
    {
      "title": "200 mph and LOVE  it!",
      "text": "Awesome resolution and stability (can't believe we didn't have this 100-passes ago). Great gadget for adrenaline-junkies. Comments (not necessarily complaints): 1) \"Adequate\" instructions are potentially (likely?) IN-adequate for some; 2) Brace yourself to drop another $50 for roll bar and handlebar mounts; 2) Disappointed that GoPro says they've no plans for a metal mount (NHRA prohibits plastic mounts); apparently GP recommends combining their tri-pod mount with a metal mount from someone else; 3) In noise and bright sun it's hard to tell if recording w/o putting your face smack in front of the cam.",
      "rating": 5.0,
      "verified": true,
      "author": "KManz",
      "helpful_votes": 0,
      "publication_date": 20120516
    },
    {
      "title": "Go Pro HD",
      "text": "This product is awesome, the image quality exceeded my expectations, it is a little heavy but nothing to worry about, because it is HD the image is a little more shaky than its predecessor, I would buy it again but i think it is really expensive compared the other cameras that have better features, it is practical and indestructible, this is the main reason i bought this although I Knew other cameras like the contour had Blutooth and GPS on them , GoPro needs to step it up and be more reasonable with price, they know they have an awesome product but need to step it up for the price and technology they offer.",
      "rating": 4.0,
      "verified": true,
      "author": "MexMX",
      "helpful_votes": 0,
      "publication_date": 20110318
    },
    {
      "title": "GoPro is just a solid product!",
      "text": "GoPro is just a solid company with a solid product! I bought one for my brother... and another for myself. My church youth group just purchased two more!",
      "rating": 5.0,
      "verified": true,
      "author": "Henry Lee",
      "helpful_votes": 0,
      "publication_date": 20151125
    },
    {
      "title": "Great product and service!",
      "text": "I bought this camera for my Fiance as a Christmas present. He was absolutely thrilled to get it! Unfortunately the camera was not working right so we had to get it replaced. We exchanged it through the actual go pro company and they had excellent customer service! We got a new camera with a few extra adhesive mounts to go along with it. I would recommend the LCD backpack as well. It makes recording things a lot easier if you are not mounting it to something.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Selby",
      "helpful_votes": 0,
      "publication_date": 20120111
    },
    {
      "title": "Best Price on Internet- Unbelievable product",
      "text": "After months of research, we bought a GoPro. We are now thinking of buying a second. This little camera is great. No bells and whistles, just what you need. We use it mountain biking and it takes great pics and video. I would recommend buying the LCD screen so you can see exactly where you are placing the lens. Otherwise, you may get the shot too high or get part of your helmet in the video :-)",
      "rating": 5.0,
      "verified": true,
      "author": "TreyNicole Schilling",
      "helpful_votes": 0,
      "publication_date": 20110901
    },
    {
      "title": "GoPro Hero 960",
      "text": "Good...battery life, well constructed housing and mounting hardwear, video is good. Bad....too many mounts included (that you pay for) but may never use. should provide other options for user to know when the camera is on and when camera is recording. Mic picks up clanking from camera inside case when mounted on handlebars or seat post.",
      "rating": 4.0,
      "verified": true,
      "author": "SCO",
      "helpful_votes": 0,
      "publication_date": 20111202
    },
    {
      "title": "Good camera",
      "text": "I am using this in an airplane and the actual video quality is great. The only two issues: Since it is digital, it has a problem with the turning propeller. The other issue is the suction cup mount, that has to be mounted on a side window. It would be nice for the mount to work on a surface that faces any direction. Even with these two items, I really like this camera.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Cotter",
      "helpful_votes": 0,
      "publication_date": 20110430
    },
    {
      "title": "Rockin",
      "text": "I wasn't expecting this to be brand new as it was listed as \"used\", but wow, I love this camera and it got here in a very fast time span! Although this is not the \"newer\" model of the camera, it is still very clear and crisp and records excellent video!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20120718
    },
    {
      "title": "HD camera",
      "text": "The GoPro camera is a very versatile camera that for the price gives you the capability of shooting extreme footage of situations that larger cameras would be at odds. The price allows you to be a bit more adventures without making a hole in your pocket if something goes wrong. Will be purchasing 2 new cameras for future projects on sailboat.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse Martin",
      "helpful_votes": 0,
      "publication_date": 20111108
    },
    {
      "title": "great camera",
      "text": "the camera works awsome! 40 years of surfing and I finally get to film myself without someones help. The quality is superb. The only down point for me was the camera came with NO CHARGER!!! Highly dissapointed, but was able to use the one from my phone. Still very satisfied. thanks go-pro",
      "rating": 5.0,
      "verified": true,
      "author": "mksurfmaui",
      "helpful_votes": 0,
      "publication_date": 20110624
    },
    {
      "title": "GREAT Camera!!!",
      "text": "For the money this is a WONDERFUL camera...Haven't gotten too much hardcore use out of it yet, but I have used it in the mountains on my dual sport and strapped it to my helmet on my mountain bike. If you are considering buying a helmet cam, look no further...no need to even think twice just buy it. Only dislike I have is the packaging, it was somewhat technical getting the box open.",
      "rating": 5.0,
      "verified": true,
      "author": "T. W.",
      "helpful_votes": 0,
      "publication_date": 20111016
    },
    {
      "title": "Incredible piece of equipment!",
      "text": "If you're into sports, extreme activities, flying, racing, running, or whatever involves action you must have this little camera. It's little and light but yet it records amazing quality video, with great sound. You can place it almost anywhere you want and it will for sure record thrilling videos. I use it in my flight trainning for recording my flying experience.",
      "rating": 5.0,
      "verified": true,
      "author": "Pablo Ortega",
      "helpful_votes": 0,
      "publication_date": 20100822
    },
    {
      "title": "Great camera for the money.",
      "text": "I like this platform, but it';s a bit difficult to learn how to use it (maybe I am just being lazy and I need to read the instructions more thoroughly) I will buy a 4 when I have some extra dough!",
      "rating": 4.0,
      "verified": true,
      "author": "SB",
      "helpful_votes": 0,
      "publication_date": 20141211
    },
    {
      "title": "GoPro HD",
      "text": "Nice little camera, I like the versatility of all the mounting options. This is my 2nd GoPro. My first one died. (Won't turn on.and yes I've tried to reset / new batteries / cables.)",
      "rating": 4.0,
      "verified": true,
      "author": "Sticky",
      "helpful_votes": 0,
      "publication_date": 20140528
    },
    {
      "title": "definitely worth the money",
      "text": "I got this for $270ish and it's the best camera for the money ever. I rigged up a pvc pipe pole mount. I put a sticky mount on my sea-doo going 60+mph. It looks awesome. Later I'll use the bar mount and go on some mtb rides. The sound quality is decent just use the rubber \"thingy\". The only downside is that sdhc cards are too expensive for plastic but that's not gopro's fault. Overall solid product and good luck breaking it. p.s. I wish they had an optional bright colored case that floated in the event it fell in the water",
      "rating": 4.0,
      "verified": true,
      "author": "rayt95",
      "helpful_votes": 2,
      "publication_date": 20110711
    },
    {
      "title": "protrailriding",
      "text": "My son and I ride our rzr's at windrock mountain located in Tennessee so we attach the camera to one of our razors and video the whole trip. Then we cut out what we don't need and make a memory we will always have. Thanks GoPro. R.Miles Seymour Tennessee",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon CustomerR Miles",
      "helpful_votes": 0,
      "publication_date": 20111127
    },
    {
      "title": "Great product",
      "text": "This was awesome and I got it at a great price. Only regret is not getting a pole to hold up the gopro but ended up making one which saved money. This was a good product and very good customer service from seller",
      "rating": 5.0,
      "verified": true,
      "author": "Ali",
      "helpful_votes": 0,
      "publication_date": 20140725
    },
    {
      "title": "Outdated product",
      "text": "I gave this to my Son for Christmas. It appears that this is a nearly obsolete product. Support for this model has been all but removed from the company's website and he is finding it difficult to find supporting software.",
      "rating": 2.0,
      "verified": true,
      "author": "Ponytail John",
      "helpful_votes": 3,
      "publication_date": 20130108
    },
    {
      "title": "sit-pro no go",
      "text": "good go-pro i don't want to bash it to much bc its old but in dark and light area's its grainy and with the case off of it the sound input is a bit much sand 10ft away it's loud so holding it close the sound is umm bad but with the case on and let it sit the focus it works.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20140729
    },
    {
      "title": "Just like everyone said",
      "text": "The shipping was on time and it came with everything it said on the website. However as every review on the website says, the sound quality is awful, really bad. I used it on my Yamaha R6 for recording some freeway footage and you can barely hear the engine. Now I have to modify this right into the settings camera,which is not something I would really like nor have time to do.",
      "rating": 3.0,
      "verified": true,
      "author": "Carlos P.G.",
      "helpful_votes": 0,
      "publication_date": 20120522
    },
    {
      "title": "Great camera for motor sports",
      "text": "The HD quality is amazing. The suction cup mount is ridiculously sturdy @ 100+Mph. The sound quality is lacking. I've been trying to think of a way to cover the optional open back with some sort of foam to prevent sound, but haven' had any luck. Definitely a great camera if you're into tracking your car. I edit my video's with music anyway, so it's not THAT important to me, but others might see where it would be important. I'm going to have aftermarket exhaust eventually which should make the sound penetrate through the complete closed case better. [...]",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Hill",
      "helpful_votes": 0,
      "publication_date": 20100821
    },
    {
      "title": "fantastic product",
      "text": "i couldn't be happier with this product! it's incredibly durable and waterproof. i've used it rock climbing, swimming, jumping off a 20' cliff, and water skiing. be sure to youtube it - there are a lot of awesome videos taken with this camera. i got mine in the spring and can't wait to take it downhill skiing this winter",
      "rating": 5.0,
      "verified": true,
      "author": "ross",
      "helpful_votes": 0,
      "publication_date": 20110923
    },
    {
      "title": "Tiny, Simple, HD Camera - Back to Basics!  Awesome Camera!",
      "text": "It's small, it's lightweight, it can be attached to just about anywhere...long battery life, long HD record time. Addon battery, addon LCD screen (highly recommended)...this thing rocks! ...Except...AUDIO QUALITY SUCKS. Go Pro Claims they spend more on Audio R&D than anyone else...well guys, your audio sucks!! An external mic is highly recommended. Would I buy this again? I don't know..maybe the next camera will be the competition...",
      "rating": 3.0,
      "verified": true,
      "author": "AiT",
      "helpful_votes": 0,
      "publication_date": 20110925
    },
    {
      "title": "GoPro HD Motorsports Hero",
      "text": "I have two of these camera's they are great a little hard to get used to the menu's. Both of my camera's have worked without a problem. Be sure to check out GoPro web site and YouTube for helpful video's on setup and uses. Buy the anti fog inserts you will need them.",
      "rating": 4.0,
      "verified": true,
      "author": "Donald E. Banka",
      "helpful_votes": 0,
      "publication_date": 20120508
    },
    {
      "title": "Terrible product",
      "text": "Unit kept failing. Didn't hold a charge and overall. Would freeze. Removed battery. Upgraded firmware to no avail. Sent unit back. Buyer beware. Go Pro makes great ads and promo videos, but their quality is poor.",
      "rating": 1.0,
      "verified": true,
      "author": "dig48109",
      "helpful_votes": 4,
      "publication_date": 20130707
    },
    {
      "title": "Best sporting HD cam out there!",
      "text": "We use this thing for snow, desert, beach.. you name it. The gopro takes all the abuse and more and you can't beat the quality this thing puts out. The only con is low light recording isn't that great.",
      "rating": 5.0,
      "verified": true,
      "author": "Tr3bLE",
      "helpful_votes": 9,
      "publication_date": 20110209
    },
    {
      "title": "Love it.  :-)",
      "text": "This has so far been the most wonderful gift I have given. My boyfriend is quite the outdoorsy type, and has filmed on land, air, and sea in the short span since he has received the GoPro, and loves to get footage for out of town family. Great product!!! I definitely would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "ff83",
      "helpful_votes": 0,
      "publication_date": 20140911
    },
    {
      "title": "GoPro HD HERO",
      "text": "Great sport/action camera not a snapshot or general purpose video. Only wide angle. Camera also does not float but other then that, I love it. It can handle a lot of shaking and still keep a stable video. Because of the very wide angle you want to be closer to action then you might think.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Harrison",
      "helpful_votes": 0,
      "publication_date": 20110429
    },
    {
      "title": "GpPro camera as described",
      "text": "Quick delivery. Everything OK. The original Go Pro has a great still camera feature, better than the second version. But newer second version works better in low light conditions. And third version works better than either of the earlier versions.",
      "rating": 5.0,
      "verified": true,
      "author": "goldenhoof",
      "helpful_votes": 0,
      "publication_date": 20121118
    },
    {
      "title": "gopro",
      "text": "Great product thought it would come with the helmet attachment but works well was easy to figure out.Like the clearness of the pic even under harsh conditions. Wide angle lens is great. Sound is hard to hear have to turn up the sound on my computer to max.",
      "rating": 5.0,
      "verified": true,
      "author": "tim",
      "helpful_votes": 0,
      "publication_date": 20110917
    },
    {
      "title": "GoPro Hero Rocks the User Friendly category for me!",
      "text": "I am amazed at how versatile and easy to use this GoPro camera is for me. Once I operated it a few times I had the settings figured out and now I am experimenting with all kinds of video recording opportunities. Thanks GoPro Team for all your hard work designing this wonderful video capture tool.",
      "rating": 4.0,
      "verified": true,
      "author": "Beeyohbee",
      "helpful_votes": 0,
      "publication_date": 20121118
    },
    {
      "title": "DOA",
      "text": "Did not work. Would not charge, turn on or anything. Ended up sending it back and buying a newer model.",
      "rating": 1.0,
      "verified": true,
      "author": "Desert Sun",
      "helpful_votes": 2,
      "publication_date": 20141022
    },
    {
      "title": "Fabulous Product!",
      "text": "My husband and I Team Rope so this is great for seeing the run during the actual roping. Really Cool! No problems with the Hero Naked, after some of the reviews, I was skeptical but am glad I made the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Raquel L Taylor",
      "helpful_votes": 0,
      "publication_date": 20130620
    },
    {
      "title": "Five Stars",
      "text": "PRICE WAS FAIR AND QUALITY IS EXCELLENT..NO LEAK'S AND SIMPLE TO USE...",
      "rating": 5.0,
      "verified": true,
      "author": "Huey P. Galatas",
      "helpful_votes": 0,
      "publication_date": 20150813
    },
    {
      "title": "GoPro 960 HD camera",
      "text": "This is an awesome product! I had an older GoPro that was standard definition but this one blows it away! The video is outstanding and even has good sound quality. GoPro has gotten on the ball with firmware updates that resolved problems that i encountered with my old one. I would absolutely recommend this for anyone who is into action sports or motorcycle riding as it will allow you to have incredible video of your adventures!",
      "rating": 5.0,
      "verified": true,
      "author": "ahagen73",
      "helpful_votes": 11,
      "publication_date": 20110124
    },
    {
      "title": "Dont have it anymore (lost it) but I loved it. Of course this is the very first ...",
      "text": "Dont have it anymore (lost it) but I loved it. Of course this is the very first model so not as fancy as the new ones but I loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Morris",
      "helpful_votes": 0,
      "publication_date": 20150227
    },
    {
      "title": "fabulous camera.",
      "text": "the quality of the images and video is fabulous. the product and the case and mounting accessories are superior quality. the variety of setting for shooting is more than adequate for documenting action/travel. highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20110820
    },
    {
      "title": "quality problem out of the box",
      "text": "So far the camera is great, but I've not yet tried it for its main purpose of in-cockpit auto racing. It solved the problems of the original such as being difficult to start when mounted in out of the way places. Unfortunately the usb connection was faulty and I'm returning it for another.",
      "rating": 3.0,
      "verified": true,
      "author": "Pilot and homeowner",
      "helpful_votes": 0,
      "publication_date": 20110704
    },
    {
      "title": "Best money I've ever spent.",
      "text": "I mounted this to my surfboard every time I go out. The video quality is phenomenal. The waterproof case works great. You can playback the videos you take on your HDTV and the pictures it takes are the same quality. The difference between the Hero2 and 3 is that the 1st one does not come with wifi (not that big of a deal) so you have to actually plug it into a computer or tv (again, whoopdy doo). And the 3 has slightly better quality, but no one but professionals can tell.",
      "rating": 5.0,
      "verified": true,
      "author": "daniel johnson",
      "helpful_votes": 0,
      "publication_date": 20130118
    },
    {
      "title": "Great Camera",
      "text": "This camera is great, It has great resolution and it is so versatile you can use it almost everywhere. I also bought the bike mount and the chest strap so my kids and I can film from different views. It would be great if there would be a steadicam for this camera, that would make it impressing.",
      "rating": 4.0,
      "verified": true,
      "author": "Jaime Fonte",
      "helpful_votes": 0,
      "publication_date": 20110909
    },
    {
      "title": "Best camera so far for its use but bought it right before the new model",
      "text": "So far I love the GoPro. It has to be the best bang for the buck for filming HD movies and social activities. My only gripe is I purchase the GoPro and they released the GoPro HD 2 a few weeks later.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Shopshear",
      "helpful_votes": 0,
      "publication_date": 20111114
    },
    {
      "title": "Five Stars",
      "text": "Love it!!! I've had it forever now and i still use it a ton. Works perfect!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Evan",
      "helpful_votes": 0,
      "publication_date": 20150507
    },
    {
      "title": "Just Awesome",
      "text": "The quality of this camera is astounding -- it's actually quite a bit smaller and lighter than it seems and it takes amazing videos/pictures. The housing is really tough and the mounts work very well. The suction cup mount is a lot more solid than I expected it to be: managed to stay on the exterior of a car while driving in the rain/snow without any problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Shadowborg",
      "helpful_votes": 0,
      "publication_date": 20120226
    },
    {
      "title": "Awesome!",
      "text": "Wow this is light enough to mount on a kite or an RC airplane and capture great video. I also got the LCD back which is well worth it!. This is a sports cam with a wide view. The video is crisp! Lots of ways to attach this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Easter",
      "helpful_votes": 0,
      "publication_date": 20110629
    },
    {
      "title": "Love this camera!",
      "text": "I have had a Vholdr and this is a much more reliable setup. -1 star for the complexity of using two buttons for all controls. The quality can't be beat though. THis is by far the most popular camera on the slopes.",
      "rating": 4.0,
      "verified": true,
      "author": "C Arellano",
      "helpful_votes": 2,
      "publication_date": 20110228
    },
    {
      "title": "love it",
      "text": "yes, this is an excellent product and it arrived perfectly well good wrapping and on time a great buying we are happy to have it kind of stuff that takes you very far",
      "rating": 5.0,
      "verified": true,
      "author": "CIPLC",
      "helpful_votes": 0,
      "publication_date": 20131021
    },
    {
      "title": "A helluva lot better than expected",
      "text": "Breathtaking HD videos for the money. GoPro's main pitch involves extreme sports, but that's not why I bought it. Anyone with more than a casual interest in digital photography should recognize this thing for being much more than a \"rad\" camera. Think about it....you get ultra-wide-angle (170 degrees) when set for taking 720p video. Yer looking at $1500 or more going the DSLR route. Granted, you get less flexibility. Not a DSLR substitute - just a d@mn good hold-you-over.....and a rad camera for the crazy stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 2,
      "publication_date": 20110410
    },
    {
      "title": "Worth it",
      "text": "If you have been trying to decide if you want one of these cameras, DO IT! The camera is amazingly easy to use, records amazing videos, and is extremely affordable. I've been using this camera to record my mountain biking trips so far and its already taken a beating, and the footage looks incredible. The new GoPro's come with a lithium battery which after recording a 50 minute video at 960p (not the highest 1080p), the battery was still nearly full. If you want to check out what the recordings look like/how it handles, search for cstauffe29 on youtube.",
      "rating": 5.0,
      "verified": true,
      "author": "Corey Stauffer",
      "helpful_votes": 0,
      "publication_date": 20110822
    },
    {
      "title": "Parameters",
      "text": "well.. yes, there is newer model of gopro by now, however if you have chance to buy this model, you will not regret. i own this camera for over year now, but had chance to work with it just recently. Without any settings, video quality provided by this camera is absolutely amazing ! strongly recommend gopro ones",
      "rating": 4.0,
      "verified": true,
      "author": "KbNk",
      "helpful_votes": 0,
      "publication_date": 20130210
    },
    {
      "title": "It's a GoPro...Come on!",
      "text": "I mean it's a GoPro...I love finding new things to try with it. I've taken it wake boarding, wake surfing, golfing, scuba diving to 80 feet, etc. Don't have any experience with the newer ones - sure they are better but for what I got it for this works perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20140804
    },
    {
      "title": "Way too cool!",
      "text": "I bought this as a birthday present and I want to steal it! So cool and fun to use. Great image quality, so many way to use it. Water proof case for kayaking and lots of mounts for different uses. We are totally enjoying it.",
      "rating": 5.0,
      "verified": true,
      "author": "swirt",
      "helpful_votes": 0,
      "publication_date": 20110612
    },
    {
      "title": "GoPro Rocks!",
      "text": "This video camera is awesome, unbeleivable video quality. Easy to program and use. If I had to say something negitive it would be that the camera lens is not centered on the unit. Beside that this product ROCKS!",
      "rating": 5.0,
      "verified": true,
      "author": "Gregg",
      "helpful_votes": 0,
      "publication_date": 20111003
    },
    {
      "title": "Love this camera",
      "text": "Love this camera. It is my first Gopro and was a way to get into recording my motorcycle rides without a huge investment. Excellent product",
      "rating": 5.0,
      "verified": true,
      "author": "Buckeye HD Rider",
      "helpful_votes": 0,
      "publication_date": 20140917
    },
    {
      "title": "tons of fun worth every penny!",
      "text": "I had a blast with this thing over the summer! went jetsking, motorcycle, cars. This thing does it all and i have had no problems with it. The videos are crystal clear and the camera is very easy to use and learn how to use!",
      "rating": 5.0,
      "verified": true,
      "author": "the carter",
      "helpful_votes": 0,
      "publication_date": 20120204
    },
    {
      "title": "This camera RULES!!!!!",
      "text": "Too bad I bought it not long ago, so the new version (actually its THIRD!!!) is already out, and there's just no explanation on everything that one can do... So I wanna buy one! ... If there's anyone interested in buying this one from me, I also have a great case specially made for it (which I'd give for free)",
      "rating": 5.0,
      "verified": true,
      "author": "D. VILLAGOMEZ",
      "helpful_votes": 0,
      "publication_date": 20121219
    },
    {
      "title": "A legend",
      "text": "The very first one of a serie, it's historical, and it still makes success!",
      "rating": 5.0,
      "verified": true,
      "author": "CID Monteiro",
      "helpful_votes": 0,
      "publication_date": 20150504
    },
    {
      "title": "Problems with software.",
      "text": "Continued software problems. However good service from the company. I had to have my camera replaced twice.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20141217
    },
    {
      "title": "great adventure camera",
      "text": "This camera is small enough to tuck in the waistband of my swimsuit or wetsuit. I have recorded wonderful videos of interactions with dolphins and the occasional shark here in Kona waters! Great video in a wonderfully small and tough package! Easy to use too!",
      "rating": 5.0,
      "verified": true,
      "author": "Andy Norlander",
      "helpful_votes": 0,
      "publication_date": 20101018
    },
    {
      "title": "Best sports cam",
      "text": "Out of all the cameras I had this has to be the one yet. I already tested the water poof in an indoor swimming pool place and it worked great! Of course if your looking for a point and shoot camera for everyday use then this is not the best camera you should choose. But if you do lots of sports extreme events and you just want to capture those moments then this is the right camera that you should buy. I recommend this camera than any other sports cam. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Chasescannell",
      "helpful_votes": 0,
      "publication_date": 20111228
    }
  ],
  "product_meta": {
    "title": "GoPro HD Motorsports Hero",
    "description": "Style:Motorsports HEROFROM THE MANUFACTURER\nDeveloped for the consumer and proven by professionals, GoPro's all-new HD HERO cameras are the world's most advanced line of on-board, full HD 1080p cameras designed to be used during sports. With amazing clarity, stability, and slow-motion capabilities, these cameras record your sport's most exciting moments in professional quality HD video and automatically-captured 5 megapixel still photos. HD HERO products can shoot video or photos from your point-of-view, mounted on your helmet, body, car, motorcycle, surfboard, or other equipment. And GoPro's 170° wide-angle lens (the industry's widest) even lets you take shots of yourself during your activity. All captured hands-free, while you stay focused on your activity.\n\nThe HD Motorsports HERO is the HD HERO model developed for motorcyclists, autosports enthusiasts, and other powersports athletes. This product incorporates not only the HD HERO camera itself, but also the mounting hardware you need to mount the camera securely to virtually any helmet, motorcycle, car, ATV, jet ski, snowmobile, boat, or virtually any other vehicle. Included are mounts for two helmets and three vehicles, as well as a suction cup for maximum versatility and convenience. The camera's quick-release mounting design makes it easy to re-position the camera around your vehicle for professional quality HD video from several angles. \n\nOriginally designed for the consumer market, GoPro's wearable cameras have garnered praise from professional athletes as well as film and TV producers who demand convenience and performance from their filming equipment. The HD HERO line produces higher quality HD video than action sports cameras costing ten times as much, and as a result many video segments you see in action sports film and TV today are shot on GoPro cameras. As the #1 maker of wearable sports cameras in the world, GoPro has years of experience in developing cameras and mounting accessories for the most hardcore of sports. As a result, GoPro has won many coveted awards, including Motorcyclist magazine's prestigious \"2009 Product of the Year\" award and the \"Editors' Choice Award\" from both Popular Mechanics and Backpacker Magazine.\n\nIn the end, GoPro's HD Motorsports HERO adds so much to your enjoyment of your favorite activities that arriving home to watch your footage is almost as much fun as the activity itself. Here are some of the highlights:\n\nProfessional 1080p HD Video that Looks Great Even on a 52\" TV\nTruly professional quality video that delivers the clarity and excitement you see on TV or in films. HD quality so good, GoPro's cameras are used regularly by both professional athletes and film and TV production companies around the world. See the quality for yourself in these sample videos: click here. \n\nEasy to Use\nTurn the camera on and press the shutter button. Shooting your own HD action sports video is that simple thanks to the HD Motorsports HERO's user-friendly default settings. Upgraded controls such as brighter LED icons and louder status beeps make the camera easier-to-use than ever.\n\nWidest Range of Video & Photo Capabilities\nFor the more technically-inclined user looking for the latest in technology and options, the HD Motorsports HERO offers a remarkable range of video and photo modes, giving you more creative control: \n\n\n * 1080p – \"True HD\" video at 30 frames per second produces maximum clarity and realism. To put it in perspective, 1080p video at 30 frames per second is the equivalent of shooting thirty 2-megapixel photos per second. Incredible realism you're used to seeing only in the movies. The viewing area becomes a slightly less-wide (127º) at this resolution, wide angle view, making 1080p a slightly less wide-angle view than the other resolutions. Perfect for in-car filming, for example, where you might want to focus more on objects in the distance than up close. It's like having two lenses in one camera.\n * 960p – \"Maximum Wide Angle\" video at 30 frames per second. Certain sports like motocross, mountain biking, and skiing require maximum viewing area to capture your speed and technique. This 960p mode offers 25% more vertical viewing area at the top and bottom of the screen than other resolutions, so you can see more of your bike and handlebars beneath you, your knees and skis while you hammer the moguls, or a more of the trail and horizon ahead. Document more of you and your surroundings with 960p for the most immersive video possible. \n * 720p – \"Slow-motion Cinema\" is possible thanks to the HD Motorsports HERO's incredibly smooth 60 frames per second 720p video. 720p (1280 x 720p) can record in either standard 30 frames per second or 60 frames per second. While 30 frames per second pleases the eye, 60 frames per second straight blows the mind when played back in liquid smooth slow motion. Everything looks good in slow motion...including you.\n\nRich, Realistic Color with Fast Automatic Exposure Adjustment \nThe HD Motorsports HERO combines the industry's leading DSP technology (digital signal processor) with cutting edge sensor technology to bring you the richest, most natural color available in a wearable sports camera. This powerful combination also results in the fastest automatic exposure adjustment of any wearable camera. This means you can move back and forth quickly between bright and dark settings (like sunshine and shadows on a trail) and still achieve smooth exposure adjustments that give your videos a professional look.\n\nProfessional Sound that Automatically Adjusts to your Environment\nThe best sound quality of any wearable camera, period. Professional quality sound with AGC (automatic gain control) tuned for action sports and motorsports. With the ability to reduce the sound of wind noise at high speeds, the HD HERO line of cameras are simply the best sounding wearable sports cameras available. Fully automatic with no manual settings or adjustments needed, the camera will adjust the sound level automatically to maintain and optimum sound recording.\n\nAlso includes an optional non-waterproof back door that can be used in activities where waterproofness is not needed. This feature allows more sound into the protective housing, resulting in fuller, more immersive soundtracks. That said, the AGC (automatic gain control) does an excellent job of automatically increasing the microphone's sensitivity to provide impressive sound even when the camera is sealed in the waterproof housing with the waterproof back door.\n\nTrademark Video Stability, only from GoPro\nGoPro is famous for producing cameras that record extremely stable video. Video that is smooth even at highest speeds and during the most intense sports. The HD Motorsports HERO takes GoPro's obsession with stable video to the next level, keeping the action amazingly stable with no wobble or \"jello-cam\" shakiness that plagues other wearable HD cameras. See for yourself in these sample videos: click here. \n\nShoot 5 megapixel Photos Automatically, a Feature Available only from GoPro\nGoPro's HD HERO products are the only wearable sports cameras to offer automatic photo-taking modes, making hands-free photo capture a reality. You'll be amazed at the in-action photos you'll capture thanks to an ability to shoots a photo every 2, 5, 10, 30 or 60 seconds, automatically. Other photo modes include traditional single shot, triple shot and self-timer modes, making the HD Motorsports HERO the only camera you need to document not only the most active moments of your life, but also the more relaxed moments where a traditional photo is what you want. You'll also appreciate the edge to edge sharpness of the 170º wide angle lens as well as the HD Motorsports HERO's terrific low light performance (1.4 lux). \n\nRechargeable Lithium-Ion battery lasts 2.5 Hours, Heater Included\nThe included 1100mAh Lithium-Ion battery lasts 2.5 hours and is rechargeable through any USB port. You can charge it with your computer or with any USB compatible wall or car charger. You can even use the camera while the battery is charging, convenient for filming road trips where you might leave the camera running for long periods of time. A second battery can be added to the back of the camera, doubling the battery life to 5 hours (see Battery Bakpac under Optional Accessories, below). AC/DC wall outlet and car cigarette lighter-based chargers are also available from GoPro.\nFor colder temperatures, an integrated battery heater helps keep the battery warm during winter sports, extending recording times beyond what's possible with other camera systems. \n\nLargest Storage Capacity of Any Wearable Camera: 32GB Capacity for 9+ Hours\nUsing up to a 32 GB SD card (not included) allows for 9+ hours of HD video or thousands of still photos when using the automatic photo mode. Also works with smaller 2, 4, 8, and 16GB SD cards. Write speed does not affect the performance of the camera, though GoPro does recommend using only well known, name-brand SD cards for maximum reliability.\n\nIndustry's Widest Angle Lens (170º) Now Shoots 127º Wide Angle, Too\nA sharp wide angle lens is critical to capturing the raw excitement of action sports – not only to capture the scenery flying by, but also to get your ski tips, handlebars, and the horizon in the frame to give you a sense of speed and adrenaline. GoPro's cameras are famous for their wide angle lenses, the widest, sharpest, and highest performance lenses available in any wearable sports camera. Plus, when mounted on equipment, the 170º lens is wide enough to capture yourself in the scene, to really record your exploits. But this is no \"fisheye\"…you'll see remarkably little distortion, despite the wide angle.\n\nUnique to the HD HERO line of cameras is the ability to shoot in both 170º and 127º wide angle modes. The 960p and 720p video modes utilize the full170º wide angle, while a lesser wide angle view of 127º is possible in the 1080p video resolution. This gives you more creative control and the opportunity to capture the action with different \"lenses\"...making for a more professional looking video. In reality, the lens is the same but the processing power of the HD HERO camera makes this convenient feature a reality.\n\nProfessional image quality, edge to edge sharpness, and the industry's best distance focus makes for exceptionally clear HD videos and photos.\n\nShockproof / Waterproof (180' / 60m) Housing Protects Camera from the Environment\nPolycarbonate shockproof, waterproof housing protects the camera from rocks, rain, snow, and on dives down as deep as 180' (60m). Proven in the giant surf around the world from Hawaii to Tahiti, Mexico to Northern California, you can be sure the housing will protect your HD HERO camera in even the most powerful surf.\n\nOptional Accessories Available in Early 2010, Compatible with all HD HERO Cameras\nA HERO BUS expansion port on the back of the camera allows you to click in expansion \"Bakpac\" modules allowing for add-on features, including:\n * LCD Bakpac, a click-on LCD screen attaches to the back of the camera, allowing for instant preview / review of your footage as you capture it.\n * Battery Bakpac, a click-in secondary battery allows for 2.5 hours more recording time, for a total of 5 hours recording time between charging batteries. Can also be used as a wall charger for additional HD HERO Lithium-Ion batteries.\n\nMajor Upgrades from Earlier Models\nThe HD HERO line's many upgrades from the earlier standard-definition WIDE HERO include:\n * Three HD video resolution modes: 1080p, 960p, and 720p.\n * WVGA wide screen standard definition video at 60 frames per second \n * Shoots up to 60 frames/second for slow motion playback in WVGA and 720p resolutions\n * Rechargeable Lithium-Ion battery with 2.5 hours of record time\n * Camera can be powered by car or wall charger, battery will charge while recording \n * Support for up to 32GB SD cards, 9+ hours of HD video recording\n * Professional sound system with for great sound in high wind environments.\n * Improved low light performance for both video and photo modes\n * Dual wide angle views now available: 127º in 1080p, 170º in 960p and 720p.\n * Brighter status LED and louder status beep for easier controlling of camera\n * HERO BUS expansion port for adding LCD screen, extra battery, etc. \n * Waterproof depth rating is increased from 100' / 30m to 180' / 60m\n\n\nHD Motorsports HERO Includes Mounting Hardware for Motorcycles, Cars, Etc.\nThe HD Motorsports HERO's camera mounting hardware has been proven at the highest levels of sport. It's been worn by more world record setting athletes than any other wearable camera, including by two time \"Highest Jump on a Motorcycle\" world record holder Ronnie Renner, and the \"Highest Jump on a BMX Bicycle\" world record holder. GoPro's camera mounts have been proven in the heaviest waves in Hawaii, Tahiti, Mexico, and Northern California...used by professional surfers looking to document their most heroic moments in giant surf. Industrial-grade 3M brand adhesive tape used on the flat and curved mounts can be removed if desired. This all means you can mount your HD Motorsports HERO camera with confidence. The HD Motorsports HERO comes with:\n * 5 Megapixel HD Motorsports HERO Camera \n * 1 Rechargeable 1100 mAh Lithium-Ion Battery \n * 1 Waterproof Quick-Release Housing (180'/60 m) \n * 3 Flat, 3M Adhesive Mounts for attaching camera to flat surfaces\n * 2 Curved, 3M Adhesive Mounts for attaching camera to helmets and curved surfaces\n * 2 Quick-Release Buckles \n * 1 Vertical Surface \"J-Hook\" Buckle \n * 1 Suction Cup Mount, ideal for attaching camera to windows or other smooth surfaces\n * 1 Three-Way Pivoting Side Arm Assembly lets you mount camera on side of helmet\n * 1 USB Cable \n * 1 Component Video (HDTV) Cable \n * 1 Composite Video + Audio Out Cable \n\nReplacement lens kits are also available for $20, so there's little worry of scratching the tempered glass lens while going for glory. Trash the housing in a massive crash? Replacements are available for $40. It's a GoPro...go for it.\n\nWarranty: One Year",
    "rating": 4.2,
    "feature_bullets": [
      "Professional-grade full HD video up to 1080p",
      "60 frames per second option in 720p and WVGA resolutions provides liquid smooth slow motion playback",
      "Videos can be easily edited with iMovie or Windows Movie Maker",
      "Industry's widest angle (170º) and sharpest lens captures more of the scene, including you",
      "Includes easy-to-apply mounts for attaching camera to any helmet, motorcycle, car, ATV, jet ski, snowmobile, boat, or virtually any vehicle.",
      "Impact-resistant housing is waterproof to 180 ft (60 meters)"
    ],
    "specifications": {
      "Item Weight": "5.3 ounces",
      "ASIN": "B002VA57XC",
      "Item model number": "CHDMH-001",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.2 out of 5 stars748 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#200,605 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 2, 2009",
      "Manufacturer": "GoPro Camera"
    },
    "categories": [
      "Electronics",
      "Camera & Photo",
      "Video"
    ],
    "price": ""
  }
}