{
  "website_summaries": [
    {
      "verdict": "The Microsoft Wireless Mouse 2000 won't change your life, but it's comfortable and offers impressive performance. At around £22, it's reasonably priced, so, if you're looking for a new mouse for everyday use, it certainly deserves a look-in",
      "pros": [
        "Impressive wireless range",
        "comfortable",
        "works on most surfaces"
      ],
      "cons": [
        "Slippery scroll wheel"
      ],
      "aspects": {},
      "publication_date": 20100415,
      "rating": 8.3,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "I have a miniature oriental carpet for it's home which it seem to be very happy with. Operation",
      "text": "The battery life is incredible! I have a miniature oriental carpet for it's home which it seem to be very happy with. Operation? It has to be the most neglected item on my computing desk and the most used. I have tons of stuff hanging off every place you can plug something into and each one can make me pull my remaining hair out! But the mouse? It just takes care of itself with aplomb! Wish it were that way with all my other devices that they would behaved as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Pat Park",
      "helpful_votes": 0,
      "publication_date": 20150110
    },
    {
      "title": "pretty good mouse",
      "text": "This mouse works very well. It feels a little too heavy if you need to lift it a lot like I do with a small space to operate it, probably because of the batteries required. It is very accurate at pointing. But it seems a little tail heavy when manuvering it since the sensor is in the rear part of the mouse. It worked right away on my window xp pc and ok after downloading the software on my Mac. The dongle is nice and small. All in all, I'm satisfied with it. It also helped that it was on sale.",
      "rating": 4.0,
      "verified": true,
      "author": "John B",
      "helpful_votes": 0,
      "publication_date": 20110326
    },
    {
      "title": "i just don't know what is wrong with this",
      "text": "it makes the internet page i am on go up and down. it does it slowly, but it is so annoying, especially if you are trying to play a game with someone and the page keeps moving. it also makes it difficult to make a page go up and down quickly. i had IE9 installed at the same time, so i don't know if that had anything to do with it, but i can't afford to buy another mouse just to try it out, so i am stuck.",
      "rating": 2.0,
      "verified": true,
      "author": "Broken Treasures",
      "helpful_votes": 0,
      "publication_date": 20130602
    },
    {
      "title": "Great wireless mouse",
      "text": "Incredible wireless mouse! Most are way too small & feel uncomfortable in your hands, but this is the perfect fit & perfect sensitivity. The only slight issue is the USB receiver that plugs in is a little long in length but not too ong to be a nuisance. The on-off switch is very convenient as well! I will be buyin a second USB mouse for my travel use!!!",
      "rating": 5.0,
      "verified": true,
      "author": "TB",
      "helpful_votes": 0,
      "publication_date": 20111014
    },
    {
      "title": "I like it",
      "text": "I first bought it at the Lightning deal for 9 dollars. It was a superb deal. The product is great- the mouse feels sturdy and well-built in the hand and the tracking is very good.It almost feels even more agile and responsive to my corded mouse. Overall, I really like, the grip is great, the software works well. No issues. I think I'd buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "DragonboatGirl",
      "helpful_votes": 0,
      "publication_date": 20110303
    },
    {
      "title": "Functional and Dependable",
      "text": "The mouse is great. I've had it for a couple weeks now and it has been nothing short of satisfactory. The sensor is very responsive and the mouse is comfortable to use. It's obviously ultra-portable and even has a slot-type thing on the bottom to put the usb connector when you're on the go. I couldn't have asked for a better mouse for the price. Battery-powered (2 AA), and yet still very good life per set of batteries. The on/off switch also makes it very easy to control when you want to conserve battery power. Less than $20 and utterly functional. A great purchase, no regrets/letdowns.",
      "rating": 5.0,
      "verified": true,
      "author": "Profi",
      "helpful_votes": 0,
      "publication_date": 20110317
    },
    {
      "title": "A decent Mouse",
      "text": "I only got this mouse because of a limited Amazon offer, so I wasn't expecting much to begin with. The mouse itself is confortable for people with big hands and it works on any surface I tried it on. You don't need drivers if your OS is Windows 7. It may not be the best option for a gamer, netbook or laptop user, but it's ok for typical desktop users (Your parents or your office) so it makes a great gift for a loved one who may have an outdated mouse.",
      "rating": 3.0,
      "verified": true,
      "author": "Dalmiro Couto",
      "helpful_votes": 0,
      "publication_date": 20110307
    },
    {
      "title": "Does what it's supposed to.",
      "text": "It feels solid and has a good weight to it. Also, the way it's balanced is very nice. the weight of it seems to sit around your thumb, making it feel accurate when it's really just your hand feeling comfortable with it's shape and weight. Small detail but makes it great.",
      "rating": 5.0,
      "verified": true,
      "author": "G.J.Y.",
      "helpful_votes": 0,
      "publication_date": 20110221
    },
    {
      "title": "Great mouse",
      "text": "I hate Microsoft, but they make the best mice. Windows sucks and so do most of their products. Mice for some reason they know how to make. Go figure.",
      "rating": 5.0,
      "verified": true,
      "author": "Godzilla",
      "helpful_votes": 0,
      "publication_date": 20140204
    },
    {
      "title": "deal of deals",
      "text": "this was one of those-it's too cheap, what's wrong with it-deals. i had misgivings and regrets until i actually used it, and it works very well. still can't believe the value.",
      "rating": 5.0,
      "verified": true,
      "author": "LuckyD",
      "helpful_votes": 0,
      "publication_date": 20120209
    },
    {
      "title": "Great mouse for the cost",
      "text": "Got this for a backup laptop and it works just great. I've used it on a bed of all places and it had no issues at all. Highly recommend for someone needing a basic mouse.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Dubberly",
      "helpful_votes": 0,
      "publication_date": 20110822
    },
    {
      "title": "Great Mouse!",
      "text": "Awesome feel and weight. Very responsive. The mouse is better than any Logitech mouse I tried. I have been through 2. This one will last!",
      "rating": 5.0,
      "verified": true,
      "author": "Ivan Lobato",
      "helpful_votes": 0,
      "publication_date": 20140325
    },
    {
      "title": "I Love It!",
      "text": "I love the size of this mouse. I love the feeling. It is very sensitive and working extremely well!! I love Microsoft mice!!!!!! :)",
      "rating": 5.0,
      "verified": true,
      "author": "StudPanda",
      "helpful_votes": 0,
      "publication_date": 20111107
    },
    {
      "title": "nice mouse",
      "text": "this mouse is a perfect size - not too big or small for an average size hand. It is responsive and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Claire C.",
      "helpful_votes": 0,
      "publication_date": 20130608
    },
    {
      "title": "Comfortable & easy to use Mouse",
      "text": "Being a slightly bigger mouse, I find it very comfortable for either hand and also ergonomical. Being wireless makes it easier to use, not having to drag the wire around. I've used it for about 1 1/2mths now and would recommend it to anyone unless you have a very small hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Janice Barton",
      "helpful_votes": 0,
      "publication_date": 20130209
    },
    {
      "title": "so battery life has been very good.",
      "text": "I run this on a linux box and it has worked flawlessly. As of this review, I am still using the same battery that came with it, so battery life has been very good.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim C.",
      "helpful_votes": 0,
      "publication_date": 20140907
    },
    {
      "title": "Great Mouse",
      "text": "This is the best wireless mouse I have used and I have tried a lot of them! Good price for a quality product. Mouse moves smoothly all the time unlike other wireless devices.",
      "rating": 5.0,
      "verified": true,
      "author": "C Isaminger",
      "helpful_votes": 0,
      "publication_date": 20110711
    },
    {
      "title": "Shipped with broken transciever",
      "text": "The transceiver just randomly stops working. It also stops working if you accidentally breathe on it or bump it. It is AWFUL. But when it works, it is a good mouse.",
      "rating": 2.0,
      "verified": true,
      "author": "Pam Labinski",
      "helpful_votes": 0,
      "publication_date": 20130321
    },
    {
      "title": "Good mouse doesn't really work on any surface as promised",
      "text": "Good mouse doesn't really work on any surface as promised Sofa for example...otherwise it a great mouse works smoothly, installed fast on every pc. Has a long range as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Nietzsche",
      "helpful_votes": 0,
      "publication_date": 20111109
    },
    {
      "title": "It is good",
      "text": "I can just say, basically it works. but some parts of it is not that comfortable for me to use.",
      "rating": 4.0,
      "verified": true,
      "author": "Pengcheng",
      "helpful_votes": 0,
      "publication_date": 20130901
    },
    {
      "title": "Microsoft Wireless Mouse 2000",
      "text": "I was happy with the quality of the mouse but when I tried to set it up for my room mate they wanted you to buy the download to put it on your computer. I used the disc that I had bought with my mouse and everything was OK. The quality of this mouse is much better than mine that I bought from hewlett packard.",
      "rating": 4.0,
      "verified": true,
      "author": "Linda Higgins-cawvey",
      "helpful_votes": 0,
      "publication_date": 20110923
    },
    {
      "title": "Works perfectly!",
      "text": "I had been suffering through the use of a very expensive wireless mouse that simply did not ever work....it was sluggish and sometimes did not move at my touch at all. I really was ready to go back to a wired mouse, when I saw the price of this and decided it was worth the try. Was it ever!!! It works perfectly. I wish I had ordered this a year ago!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Neena",
      "helpful_votes": 12,
      "publication_date": 20101113
    },
    {
      "title": "I'd like to take a big hammer to this mouse",
      "text": "I'd like to take a big hammer to this mouse! The cursor keeps freezing using it. Have spent hours online searching for a solution with no luck at all.Wjhile I do have the latest drivers, when it freezes up, all you can do to fix it is to do a hard reboot of your pc. God how I HATE this product!!! BEST OF LUCK TO ONE AND ALL IF YOU PURCHASE IT- BETTER YET, JUST SEND ME AN EMAIL AND iILL GLADLY SEND YOU MINE FREE AND POST-PAID.PLEASE!",
      "rating": 1.0,
      "verified": false,
      "author": "MaineSteve",
      "helpful_votes": 0,
      "publication_date": 20140925
    },
    {
      "title": "Great optical mouse for the price",
      "text": "I bought this optical mouse in Amazon's Deals for only $9.99 (free shipping as I have Prime). It works great. It also includes the batteries. Windows 7 detected it right away. It uses the traditional USB port unlike the newer versions which has a small port, but it's not a real deal-breaker especially when I got it for the price of less than $10. Wonderful :)",
      "rating": 5.0,
      "verified": false,
      "author": "Da di di do du",
      "helpful_votes": 0,
      "publication_date": 20110215
    },
    {
      "title": "The lousiest mouse I have ever owend",
      "text": "I dont get it how people can say good things about this mouse and give 4-5 stars to it. I have one and It is morphing to be a paperweight. The transmitter needs to be unplugged and then plugged back on every individual windows start-up(windows 7, 64 bit). This is so damn heavy for a mouse and the stupid design makes me mad. I didnt buy it from Amazon but now I got so annoyed suddenly in the middle of some design work that I had to log in here and share my frustration with you folks. it uses up the battery so quickly too. In one word I can define it as \"rubbish\".",
      "rating": 1.0,
      "verified": false,
      "author": "Saman",
      "helpful_votes": 0,
      "publication_date": 20121203
    },
    {
      "title": "Not impressed with functionality",
      "text": "This mouse is a constant source of frustration. The scroll doesn't work as expected; it scrolls 1/4 of the down a page and then stops scrolling, I have to go over to the side bar and scroll with that; worthless. I have to keep the mouse on a piece of cardboard so that it tracks fast enough. And finally, it drains batteries, quickly. A well designed mouse purchase is in my near future. Microsoft, you have convinced me that usability and durability are not your goals. There is much to be said about quality over quantity. I will not purchase this brand again.",
      "rating": 1.0,
      "verified": false,
      "author": "Serena Boettcher",
      "helpful_votes": 0,
      "publication_date": 20140211
    },
    {
      "title": "What a colossal piece of crap",
      "text": "It won't last you two months. Every time I use it, I have to fiddle with the transceiver, it scrolls however fast it wants to (Some days its 3 pages at a time, other days its a third of a line at a time). It eats battery like nobody's business. DO NOT BUY.",
      "rating": 1.0,
      "verified": false,
      "author": "Anonymous User",
      "helpful_votes": 0,
      "publication_date": 20131004
    },
    {
      "title": "Fine Print: Excludes 64bit XP",
      "text": "If you are still using Win XP, by force or by choice, please note that this mouse excludes users who have XP in the 64bit mode. Unfortunately that rules out some of us from this good deal. So check which version of XP you are running before you order.",
      "rating": 2.0,
      "verified": false,
      "author": "MountainMojo",
      "helpful_votes": 13,
      "publication_date": 20110203
    }
  ],
  "product_meta": {
    "title": "Microsoft Wireless Mouse 2000",
    "description": "FROM THE MANUFACTURER\n\n\nMICROSOFT WIRELESS MOUSE 2000\nGo anywhere with reliable wireless. Works wherever you do. Work anywhere worry-free, with the performance you'd expect from a higher-priced mouse: reliable wireless, enhanced battery life, and Microsoft® BlueTrack Technology. \n\n\nBlueTrack Technology  \n\nMICROSOFT 2.4 GHZ WIRELESS\nDelivers a reliable connection, even in a busy office.  \n\nMICROSOFT BLUETRACK TECHNOLOGY\nWork anywhere with the world's most advanced tracking.  \n\nCOMFORT AND CONTROL FOR EITHER HAND\nExperience full-sized comfort, with rubber side grips for control and cushioning and a shape that fits either hand. \n\nTILT WHEEL\nEasy horizontal and vertical scrolling.  \n\n\n\n\n\n\n\nWHAT IS BLUETRACK?\n Microsoft's proprietary BlueTrack™ Technology works on more surfaces than both optical and laser mice. It uses high-angle imaging optics to generate an accurate picture of the surface.\n\n\n\nNOW TRACK MORE ACCURATELY ON:\n\nGranite \nCarpet \nWood 3-YEAR LIMITED HARDWARE WARRANTY\n \n\nSYSTEM REQUIREMENTS\n- Windows® 7, Windows Vista®, Windows XP excluding Windows XP 64-bit)  - 2 AA alkaline battery (included)",
    "rating": 3.9,
    "feature_bullets": [
      "Note : In case of Wireless mouse, the USB receiver will be provided inside or along with the mouse"
    ],
    "specifications": {
      "Product Dimensions": "7.1 x 6.4 x 1.1 inches",
      "Item Weight": "4.9 ounces",
      "ASIN": "B002ZV6S7Q",
      "Item model number": "36D-00001",
      "Customer Reviews": "3.9 out of 5 stars40 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#8,454 in Computer Mice",
      "Date First Available": "October 22, 2009",
      "Manufacturer": "Microsoft"
    },
    "categories": [
      "Computers & Accessories",
      "Computer Accessories & Peripherals",
      "Keyboards, Mice & Accessories",
      "Electronics",
      "Mice"
    ],
    "price": ""
  }
}