{
  "website_summaries": [
    {
      "verdict": "This beautiful cradle features  cherry wood arched headboard and foot boards, and will rock your baby to sleep with a gentle swing. Select from three different colors to complement your nursery decor, and feel at ease knowing your baby is comfortable and safe in this cradle.",
      "pros": [
        "A great price point compared to other cradles",
        "It can be made stationary using the included support pin",
        "Easy to assemble",
        "Bigger than other cradles, which will give your baby plenty of room to grow"
      ],
      "cons": [
        "The included mattress pad is a bit thin"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Loved it!",
      "text": "We bought two of these adorable cradles for our twins which will arrive in the next 4 weeks! They are beautifully made, great finishes and the color is perfect. They are exactly what we wanted for them to sleep in our room for the first few months before sleeping in their nursery. So many people complain and say negative things about these and I honestly don't know why, this is the first review I have ever written and trust me, it's because this product is worth it! PS: we did buy another mattress because the one that it comes with is too thin.",
      "rating": 5.0,
      "verified": true,
      "author": "Cardenal Vilchez ",
      "helpful_votes": 37,
      "publication_date": 20160703
    },
    {
      "title": "Easy to assemble",
      "text": "Mom of, soon to be, 8 here. Very easy to assemble. Seems sturdy, but I might have my husband replace the manufactured wood mattress support board with real wood in the future. The mattress that comes with it is super thin, so I purchased an 18x36 replacement mattress here on Amazon that is about 1.75\" thick. The replacement mattress is much better and firmer. For the price, I think it should come with the nicer mattress or else it would be 5 stars. I got the cherry finish. It is beautiful and traditional style and looks good in my home.",
      "rating": 4.0,
      "verified": true,
      "author": "Mommy",
      "helpful_votes": 4,
      "publication_date": 20200110
    },
    {
      "title": "Modified for durability",
      "text": "Ok, so this cradle comes with a super thin, firm cardboard-like bottom piece. If you have any kids that might try to sit on it, it won’t last. However, we cut some plywood to the same shape and screwed it in and it’s now very durable.",
      "rating": 4.0,
      "verified": true,
      "author": ".nicole.",
      "helpful_votes": 5,
      "publication_date": 20181216
    },
    {
      "title": "Cheap & Over priced product",
      "text": "The cardboard which supports the baby had a hole in it, It doesn't fit the cradle \"perfectly.\" Also cardboard is supported by just one bar at the center of the board which I believe has a thin safety margin. Biggest flaw was, when I tightened the bolts on the wooden cradle, it cracked the wood in two places. Overall cheap materials compared to the price paid. I wouldn't recommend this product.",
      "rating": 2.0,
      "verified": true,
      "author": "kna",
      "helpful_votes": 12,
      "publication_date": 20160325
    },
    {
      "title": "Love this for a small cradle/crib",
      "text": "Loved this product! My daughter slept in it until 6 months. Compact, rocks easily, and lightweight!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Sargent",
      "helpful_votes": 4,
      "publication_date": 20190310
    },
    {
      "title": "Used until baby was about 8 months old",
      "text": "This little bed is pretty and sturdy enough for a baby up to about 8 months old. I let my granddaughter sleep in it until she showed signs of being able to pull up then I put her in a crib. This rocks or you can use the fixtures included to stabilize it so it doesn’t rock.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Bunch",
      "helpful_votes": 2,
      "publication_date": 20181224
    },
    {
      "title": "Go ahead and add to your cart you won’t be disappointed",
      "text": "So cute and sturdier than expected. My two year old is very large for his age and decided he wanted to test it out before baby brother got here and it definitely holds up. You cannot beat the price for the quality you are getting",
      "rating": 5.0,
      "verified": true,
      "author": "Ashleynicole",
      "helpful_votes": 3,
      "publication_date": 20190824
    },
    {
      "title": "Highly recommend",
      "text": "Love this, it was a great buy. Our daughter is 3 months and 14pounds, and we're still using it. Very sturdy, and durable wood.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 2,
      "publication_date": 20200120
    },
    {
      "title": "Great cradle; terrible pad.",
      "text": "Awesome bassinet, terrible mattress pad. We purchased the Colgate Cradle/bassinet mattress and it fit perfectly and is way thicker and more comfy than the terribly thin pad that comes with this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittanie",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "I love it! Very nice and a great price",
      "text": "I love it! Very nice and a great price! My daughter is due in 3 months but my nephew is 4 months old and tried it out and loved it. Highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20160826
    },
    {
      "title": "Its okay.",
      "text": "Okay so this cradle is very nice but one of the pins on the bottom has already gotten loose and we cannot seem to get it to tighten. We have only used this for 1 month and if it is moved the pin will get loose and cause the cradle to be unbalanced causing my baby to gravitate to one side.",
      "rating": 3.0,
      "verified": true,
      "author": "THe C Family",
      "helpful_votes": 4,
      "publication_date": 20151016
    },
    {
      "title": "Hard to believe real wood could be more inexpensive than ugly plastic",
      "text": "Unbelievably good looking for the price. The rocking was extremely helpful. Much better than all those plastic rocking crib options.",
      "rating": 5.0,
      "verified": true,
      "author": "Micha v A",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Sturdy & pretty",
      "text": "Such a great purchase. I was expecting this to be much smaller and thought I would only be able to use it for 3 months. It’s big and sturdy enough that I’ll be able to use it until the baby is able to sit up alone. So pretty!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Bly",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Stylish",
      "text": "Looks stylish , bought it for a gift. Easy to assemble. Perfect size for small area",
      "rating": 5.0,
      "verified": true,
      "author": "Noah's Mom",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Adorable",
      "text": "I got this to put some of my dolls in. Very good looking cradle and sturdy. Thank you for a wonderful product. I would put my real baby in it too.",
      "rating": 5.0,
      "verified": true,
      "author": "CCNRCC",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Cradle",
      "text": "The cradle was really cute, at first I thought it wasn’t safe but I tested it on my two-year old son and it is safe totally. I really liked this buy💗",
      "rating": 5.0,
      "verified": true,
      "author": "Sergia Suarez",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "lightweight, easy to assemble, sturdy",
      "text": "Super cute cradle. I love how simple it was to set up! It is very lightweight. The color is great! My son is 3 weeks and he sleeps in it everynight.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Solid B+ purchase, beat expectations, safe, but doesn’t go the extra mile",
      "text": "I’m happy with how this turned out. Natural wood is a good hue, not too orangey. My feedback for the makers would be to make the little kickstands better. They don’t click into place which they easily could be designed to do, so they wobble a bit. Not a make or break issue.",
      "rating": 4.0,
      "verified": true,
      "author": "jenny m",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Satisfied",
      "text": "Cradle is super beautiful! Seems to be very comfortable, sturdy and grow with the child for 6 monthes at least! Mattress needs to be replaced!",
      "rating": 5.0,
      "verified": true,
      "author": "Sadi",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Good, except feet",
      "text": "The construction of this rocking cradle is fine, but the metal feet that stop it from rocking stay very loose. Any significant amount of weight or leaning will cause them to slip and it will no longer be stationary.",
      "rating": 3.0,
      "verified": true,
      "author": "Dezarae D.",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Perfect!",
      "text": "This is exactly what I was wanting! I love that you have the option of having it rock or stay solid. I’m very happy I ordered this!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea S.",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Excellent product",
      "text": "The perfect size for next to the bed, and comfy and breathable for baby. Best baby bed I've owned.",
      "rating": 5.0,
      "verified": true,
      "author": "CandaceR",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Very sturdy!",
      "text": "Came on time and it was very easy to put together. It is sturdy and came with no scratches. I can't wait to put my baby in this beautiful cradle.",
      "rating": 5.0,
      "verified": true,
      "author": "Mia",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Unsafe",
      "text": "It’s look very nice but its not safe for baby to sleep on it, because the bottom that hold the mattress is not strong enough. It’s like a cardboard unsafe!!!!",
      "rating": 2.0,
      "verified": true,
      "author": "sun foo wong",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Like it",
      "text": "We really like this cradle. It is attractive and does the job. The only complaint I have is that the stoppers for the rocking motion don't stay put and I often find that as I put baby into the cradle it moves and I have to rock it again to get the stopper in place. If I wasn't so tired, I would probably be able to remember to check before putting baby into cradle (user error).",
      "rating": 4.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 2,
      "publication_date": 20140805
    },
    {
      "title": "6mos preggo and I did it !",
      "text": "My little one is due in July. I was able to assemble by myself in about 20 mins with limited tools. I purchased another mattress to get the thickness I want and will use the mattress that came with the cradle as a changing pad for my car. All in all, great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Dani",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "A lovely cradle",
      "text": "Quite a lovely cradle nice size not the best craftsmanship or heirloom quality but is very nice the stain Job is not perfect but still looks good The pad that comes with it is terrible must buy another mattress if you want baby to be comfy cozy all in all just what I wanted",
      "rating": 4.0,
      "verified": true,
      "author": "Mitch and Nora",
      "helpful_votes": 0,
      "publication_date": 20150811
    },
    {
      "title": "Great product",
      "text": "Had it for over 5 months (the bottom board is missing the hole to screw the bar to the other side) so havent placed my daughter in it but I have put something heavy in it and it's held. It's a perfect product just think mine was \"defective\". It's adorable and really good size. They won't out grow it until I would say them standing up. It's enough leg room and space for them!",
      "rating": 4.0,
      "verified": true,
      "author": "D. Irlmeier",
      "helpful_votes": 2,
      "publication_date": 20150427
    },
    {
      "title": "Perfect bed for a new baby",
      "text": "This is the perfect cradle. Very easy to put together and very sturdy. We borrowed one for our last baby and loved it so much that we decided to buy it this time around.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20161102
    },
    {
      "title": "Love!!",
      "text": "Absolutely in love! Super easy to put together and shipping was fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny and Geoff Bragg",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Beautiful 😍",
      "text": "Can't wait to use this when my second daughter gets here in October. There is a couple places that has to much stain on it but you really can't tell unless your close. If I could give 10 stars I would",
      "rating": 5.0,
      "verified": true,
      "author": "KimBoggs",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Want my refund......",
      "text": "On April 11/12 is states that my refund was place back on my gift card. Calling my gift card to get the amount it does not show that it was put back. IWANT TO KNOW WHO TO CONTACT. I LIKE TO KNOW IF A MONEY ORDER CAN BE ISSUED.",
      "rating": 5.0,
      "verified": true,
      "author": "Gloria Ortiz",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Missing screws",
      "text": "Product came but missing 2 screws wouldn’t feel safe to use it",
      "rating": 1.0,
      "verified": true,
      "author": "Hindy",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "I am very annoyed with this",
      "text": "I ordered white and got espresso. There are also no instruction so I'll have to attempt it on my own. I cannot send it back as I am from Canada and it took too long to ship. I am very annoyed with this.",
      "rating": 3.0,
      "verified": true,
      "author": "Heather Davis",
      "helpful_votes": 0,
      "publication_date": 20150517
    },
    {
      "title": "Perfect Love it so much Why I have not bought ...",
      "text": "Perfect Love it so much Why I have not bought it for my daughter",
      "rating": 5.0,
      "verified": true,
      "author": "Mahsa",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "The product looks exactly like it is advertised.",
      "text": "I purchased this product as a Baby Shower gift. I didn't assembly but the mom who did had it assembled in less than an hour and was very pleased with the result.",
      "rating": 4.0,
      "verified": true,
      "author": "Ber1pete",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Looks good and it is very roomy",
      "text": "Bought it as a gift for my niece's first baby and she loved it. It is also very roomy so she would be able to use it longer than a regular Bassinet.",
      "rating": 5.0,
      "verified": true,
      "author": "Mafrago",
      "helpful_votes": 0,
      "publication_date": 20151031
    },
    {
      "title": "So cute!",
      "text": "Love the way this looks! It is a very solid cradle, a little larger than I imagined but still fits nicely by the bed. The only disappointment is that the mattress is very thin and flimsy.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelsey",
      "helpful_votes": 0,
      "publication_date": 20150914
    },
    {
      "title": "Grandaughter loved it for her baby she used it almost exclusively ...",
      "text": "Grandaughter loved it for her baby she used it almost exclusively until he could no longer fit into it anymore. Highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela D. Mcmann",
      "helpful_votes": 0,
      "publication_date": 20150308
    },
    {
      "title": "I’d go for something else",
      "text": "The locks fall off and the wood is soft. Other than that it’s just “ok” I would not buy this again.",
      "rating": 2.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "... thought it is taller but it is not overall nice",
      "text": "I thought it is taller but it is not overall nice",
      "rating": 4.0,
      "verified": true,
      "author": "Markaida ",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Four Stars",
      "text": "Beautiful cradle but the legs that holds the cradle in a non rocking position have fallen off twice.",
      "rating": 4.0,
      "verified": true,
      "author": "S D",
      "helpful_votes": 0,
      "publication_date": 20150923
    },
    {
      "title": "very good",
      "text": "very good cradle. easy to assemble. nice surface finish. rocks well. just one issue, stopper doesn't work as expected.",
      "rating": 5.0,
      "verified": true,
      "author": "khirey",
      "helpful_votes": 0,
      "publication_date": 20170311
    },
    {
      "title": "STUNNING PRODUCT!",
      "text": "This item is really sturdy and classy. Just what I imagined!",
      "rating": 5.0,
      "verified": true,
      "author": "Staicy Fan",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Easy to assemble!",
      "text": "Its very cute and light weight. Easy to assemble, took me about 10 minutes @ 36 weeks pregnant! The woods quality is great! The only negative is the thin mattress it comes with. I'll have to purchase a thicker one!",
      "rating": 4.0,
      "verified": true,
      "author": "Cc",
      "helpful_votes": 0,
      "publication_date": 20150310
    },
    {
      "title": "Dreamy",
      "text": "Perfect. Absolutely beautiful. Well made. I love and and the baby will too!",
      "rating": 5.0,
      "verified": true,
      "author": "denise johnsen",
      "helpful_votes": 0,
      "publication_date": 20170218
    },
    {
      "title": "good height next to our bed",
      "text": "Works as expected, good height next to our bed. Easy to put together.",
      "rating": 4.0,
      "verified": true,
      "author": "Micah",
      "helpful_votes": 0,
      "publication_date": 20150517
    },
    {
      "title": "We love the looks of this cradle",
      "text": "We love the looks of this cradle. The only thing I would recommend is a stronger board to rest the pad on so you feel more secure having the baby in the cradle. Other than that we are very happy.",
      "rating": 4.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20150521
    },
    {
      "title": "easy to assable",
      "text": "Very solid wood, easy to assable. My daughter loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Christian O.",
      "helpful_votes": 0,
      "publication_date": 20161208
    },
    {
      "title": "Like everyone else says",
      "text": "Like everyone else says, the mattress is worthless so plan to replace it. The rocker is nice, but my husband added a support bar underneath the mattress, as many people did. It's perfect for safe sleep guidelines and the mattress size is standard. The cradle is larger than I expected. It looks great.",
      "rating": 4.0,
      "verified": true,
      "author": "KatieL",
      "helpful_votes": 2,
      "publication_date": 20160315
    },
    {
      "title": "Perfect -- sturdy, great size and beautiful",
      "text": "In love with this bassinet! So glad we got it. Easy to put together too.",
      "rating": 5.0,
      "verified": true,
      "author": "WorldTraveler",
      "helpful_votes": 7,
      "publication_date": 20161014
    },
    {
      "title": "Adorable cradle! Easy to assemble and seems quite sturdy",
      "text": "Adorable cradle! Easy to assemble and seems quite sturdy, I did purchase a thicker pad for it as the one sent is very thin. Can't wait to see my granddaughter in it :)",
      "rating": 4.0,
      "verified": true,
      "author": "Sunny Bailey",
      "helpful_votes": 0,
      "publication_date": 20150417
    },
    {
      "title": "Very satisfied",
      "text": "Easy to assemble, seems to be good quality and the baby sleeps well. I don't think the matress needs to be any thicker.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20131109
    },
    {
      "title": "Beautiful and great value for money",
      "text": "This cradle is very well made and looks fantastic in my nursery.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynsey Pinfield",
      "helpful_votes": 0,
      "publication_date": 20150225
    },
    {
      "title": "DO NOT ORDER THIS CRADLE. YOU WILL BE DISAPPOINTED!",
      "text": "DO NOT BUY THIS CRADLE! They stuck the warning stickers on both outside ends of the cradle and they are so stuck on there that you can’t peel them off! The glue is so heavy on the sticker that you can’t get it off. The cradle had dents & scratches all over it. The mattress is so flimsy and thin. Nothing like described! The stain is darker I’m some areas and not even. I’m so disappointed. This was a shower gift for my daughter. I only gave it one star because you have to otherwise it would get no stars at all!",
      "rating": 1.0,
      "verified": true,
      "author": "Jena",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "it is beautiful and it is larger then we though",
      "text": "it is beautiful and it is larger then we though.",
      "rating": 5.0,
      "verified": true,
      "author": "gail wofford",
      "helpful_votes": 0,
      "publication_date": 20150331
    },
    {
      "title": "Love this cradle",
      "text": "We looked at moses baskets and bassinets and finally decided on this cradle. It assembled very easily and is just beautiful! Nice quality, too. The standard cradle mattress fits perfectly. No complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "sophicwife",
      "helpful_votes": 0,
      "publication_date": 20150311
    },
    {
      "title": "Well made baby cradle",
      "text": "Ordered this cradle in white for my new grandson and love it❤️ easy to assemble, Very well constructed, great size my grandsons will have many months of usage. Well worth cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele R",
      "helpful_votes": 0,
      "publication_date": 20151120
    },
    {
      "title": "Easy to put together and it's super quality",
      "text": "Easy to put together and it's super quality. We're selling it so let me know if you want it. :)",
      "rating": 5.0,
      "verified": true,
      "author": "brandon",
      "helpful_votes": 0,
      "publication_date": 20141030
    },
    {
      "title": "its ok",
      "text": "I bought this for my newborn because buying a crib just wasn't affordable at the time. It's good for a newborn because you don't want them in a big crib yet but the metal stoppers for the crib kept loosing up. Maybe it's because I have carpets in stead of hardwood floors. It's kind of cheap for something so expensive. I'd look for another one and not this one. I give it 3 stars because it was my baby's first bed.",
      "rating": 3.0,
      "verified": true,
      "author": "BronxBombshell",
      "helpful_votes": 2,
      "publication_date": 20150308
    },
    {
      "title": "Great, for the money.",
      "text": "It went together easily, though, four hands are better than two. It came with everything it was suppose to, and, without overtighting, I didn't destroy it in the process.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen F",
      "helpful_votes": 0,
      "publication_date": 20120123
    },
    {
      "title": "We're pleased",
      "text": "Simple assembly, finished it before coffee got cold. We did not want plastic so this cradle seemed right for us. Seems strong enough and looks great. The only complaint is the factory mattress is paper thin. We ordered a separate mattress. We are happy with the purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "David Jung",
      "helpful_votes": 5,
      "publication_date": 20130706
    },
    {
      "title": "Five Stars",
      "text": "Great Quality. Most of all Safe. Easy to assemble, did it myself 9 months pregnant.",
      "rating": 5.0,
      "verified": true,
      "author": "Echo",
      "helpful_votes": 0,
      "publication_date": 20141111
    },
    {
      "title": "Beautiful cradle",
      "text": "This cradle is beautiful and very easy to assemble. The finish is very nice and the color is perfect. The locking feature on the rockers is very easy to use and stabilizes the cradle well. We liked this so much, we bought two -- one for downstairs and one for upstairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosalyn Sutton",
      "helpful_votes": 7,
      "publication_date": 20110908
    },
    {
      "title": "Love love love!!!",
      "text": "So much nicer and sturdier than a bassinet! My baby will be able to stay in it for a few months in my room!wood is beautifully finished and matched my room furniture well! Rocks, but I keep the locks on while he sleeps. Was easy to put together, I did it without my husbands help! It is bigger than I realized, but it still fit where I wanted, just more snug. The mattress is a weird size, but I bought king sized pillowcases at Walmart in the color I wanted and they fit PERFECTLY!! If you want a nice, expensive looking cradle GET THIS!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dree_click",
      "helpful_votes": 8,
      "publication_date": 20140114
    },
    {
      "title": "Not the quality I expected.",
      "text": "First, the product didn't have the tool required to put it together. It even said on the invoice that the tool was \"missing\". The cradle wasn't the dark espresso color that we expected. It was also lighterweight than a previous cradle that we had purchased. The mattress provided was also too thin and we purchased another one. For the money spent, we were very disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "KE",
      "helpful_votes": 0,
      "publication_date": 20130405
    },
    {
      "title": "Arrived damaged",
      "text": "When assembling this cradle, I noticed that a corner of the Bottom board (that the mattress lies on) was damaged. Subsequently that corner fell off altogether. We ended up keeping the cradle because the mattress is still secure and it would be too much hassle to get a new one.",
      "rating": 2.0,
      "verified": true,
      "author": "Woodzyhore",
      "helpful_votes": 4,
      "publication_date": 20111227
    },
    {
      "title": "this is the best crib you could buy ever",
      "text": "this is the best crib you could buy ever! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Davis-Bedrick",
      "helpful_votes": 0,
      "publication_date": 20140823
    }
  ],
  "product_meta": {
    "title": "Dream On Me Rocking Cradle, Espresso",
    "description": "Color:Espresso| Style:Dream on Me Rocking CradleDream On Me, Rocking Cradle 645 in Espresso, is attractively designed with arched head and footboards. Features include slumber pad and gentle swinging motion rocks baby to sleep. The cradle can also be made stationary using the simple support pin on one side of the cradle. Recommended for use with newborns to 20 lbs or until your baby can roll from side to side or push up.\n\nFROM THE MANUFACTURER\nThe Dream on Me Rocking Cradle features an attractive design, with arched head and footboards, comes complete with slumber pad and has a non-toxic finish. The smooth, gentle swinging motion rocks baby to sleep. The cradle can also be made stationary using the simple support pin on one side of the cradle. Recommended for use with newborns to 20 pounds or until your baby can roll from side to side or push up. JPMA Certified",
    "rating": 4.6,
    "feature_bullets": [
      "Wood",
      "The product is supposed to rock smoothly and unlike swing, it rocks to a steady pace",
      "Arched head and footboards, comes complete with slumber pad",
      "Non-toxic finish",
      "The cradle can also be made stationary using the simple support pin on one side of the cradle",
      "Recommended for use with newborns to 20 pounds or until baby can roll from side to side or push up"
    ],
    "specifications": {
      "Product Dimensions": "38 x 22 x 32.5 inches",
      "Item model number": "645-E",
      "Is Discontinued By Manufacturer": "No",
      "Target gender": "Unisex",
      "Minimum weight recommendation": "3 Pounds",
      "Maximum weight recommendation": "25 Pounds",
      "Material Type": "Cherry",
      "material_composition": "100% Wood",
      "Number Of Items": "1",
      "Style": "Dream on Me Rocking Cradle",
      "Finish": "Espresso",
      "Batteries required": "No",
      "Item Weight": "17.5 pounds",
      "ASIN": "B002NTOB7Y",
      "Customer Reviews": "4.6 out of 5 stars204 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#11,700 in Baby",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More"
    },
    "categories": [
      "Cradles",
      "Nursery",
      "Furniture",
      "Infant & Toddler Beds",
      "Baby Products",
      "Baby"
    ],
    "price": 96.99
  }
}