{
  "website_summaries": [
    {
      "verdict": "A solid product that works well relieving dry eyes.",
      "pros": [
        "You only need to re-lubricate a few times a day if you have a chronic problem",
        "Effectively relieve burning and itching",
        "Can be applied without making eye makeup run",
        "Drops are easy to dispense"
      ],
      "cons": [
        "Cause some initial blurriness",
        "Don't reduce eye redness"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I placed an order on October 2017, but when ...",
      "text": "I placed an order on October 2017, but when I got this eye drops and notice the expiration date is 2017/09. Everyone need to check this after you get it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 158,
      "publication_date": 20171121
    },
    {
      "title": "No better drops out there for dry eye than Systane Ultra",
      "text": "I have tried every brand of dry eye drops out there and this is the only brand that worked for me. It really soothes your eyes. I have to use it throughout the day. A tip is if you refrigerate it first it really feels the best ever. I always have this on hand no matter what the cost. At least on Amazon I can get 2 or 3 pack for a better price than the store and it all comes to my house so fast with prime!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 166,
      "publication_date": 20170710
    },
    {
      "title": "Not perfect, but haven't found better.",
      "text": "As a LASIK patient who lives in the desert and stares in a microscope or at a computer screen all day, eyedrops are important. I've tried long lasting ones, to avoid having to reapply during the workday, but they were goopy and sticky. My optometrist recommended Systane Ultra by name, and suggested I put it in at night. I usually end up reapplying in the morning but these do seem to be longer lasting than most, minus the goop. Haven't found anything better, that's for sure.",
      "rating": 4.0,
      "verified": true,
      "author": "Duff",
      "helpful_votes": 115,
      "publication_date": 20170730
    },
    {
      "title": "Does the job without blurring my vision!",
      "text": "These are the best lubricant drops I have yet to use. I have severe eye issues due to corneal transplant surgeries. I have tried many different \"tear replacement\" drops. All of them make my vision blurry. That is, all of them except for this one! I can use this fluid enough to keep my eyes feeling normal without blurring my vision! I wish this was offered in a bottle that maintained sterility without requiring the inclusion of preservatives. Whatever the case, this is the drop formula I will use for the time being. It is great to have clear vision and moist eyeballs at the same time!",
      "rating": 5.0,
      "verified": true,
      "author": "RevBill60",
      "helpful_votes": 76,
      "publication_date": 20171104
    },
    {
      "title": "like a breath of fresh air",
      "text": "Lately, I've been having problems with my contacts drying up and making things out of focus and giving me headaches. A drop in each eye clears things up for a few hours and is a great relief. Great for when sweat gets in my eyes from sports or when my eyes dry out from the AC in my car while driving. (just pull over before applying the drops) Please click the helpful button if you found this helpful.",
      "rating": 5.0,
      "verified": true,
      "author": "Revelation",
      "helpful_votes": 30,
      "publication_date": 20190510
    },
    {
      "title": "Pretty good. Super thick. Better than the usual stuff.",
      "text": "Pretty good. Very thick, almost a gel. I wasn't really used to a gel-like substance in my eyes but my eyes are so dry in the morning that I thought this would help. It's better than the usual stuff which basically does nothing. The only thing about this is it feels super strange and also it makes things kinda blurry for a bit because it's hard to see through the gel. But overall it does work better than saline and I would use it again.",
      "rating": 4.0,
      "verified": true,
      "author": "D McC",
      "helpful_votes": 40,
      "publication_date": 20170824
    },
    {
      "title": "GREAT for Contacts!!!",
      "text": "Don't let the other reviews fool you, these are perfect for contacts which I wear daily. Add two drops inside the contact then apply for all day comfort. They are not as sticky/lubricate-y as the small vials but this bottle will last longer. I apply 2-3 times daily and it's enough. Perfect size for carrying on my pocket. My eyes get EXTREMELY dry.",
      "rating": 5.0,
      "verified": true,
      "author": "Erwin Hero",
      "helpful_votes": 11,
      "publication_date": 20181216
    },
    {
      "title": "Horrible",
      "text": "For some reason the drops don't pour out. They're good for a few days and then it's useless. I don't want to contaminate it by poking a hole so I just have to trash it altogether. Terrible.",
      "rating": 1.0,
      "verified": true,
      "author": "Tanima",
      "helpful_votes": 21,
      "publication_date": 20170419
    },
    {
      "title": "I fell for this scam by not paying attention to the fine print (volume",
      "text": "This is a rip off by both manufacturer and seller. Tiny containers in a large box. unlike those made by others, this is 1/3 fl oz in each tiny container. You can get similar product in larger container (larger volume) for much less at many stores. I fell for this scam by not paying attention to the fine print (volume, etc.)",
      "rating": 1.0,
      "verified": true,
      "author": "California Man",
      "helpful_votes": 25,
      "publication_date": 20171222
    },
    {
      "title": "Burning Eyes",
      "text": "I\"m 60 years old and wanted to cleans my eyes with something better than visine, so I found this product to have many good reviews. The first time I used it it burned my eyes, I thought maybe it'll pass, but the next day my eyes were still burning and did not want to use this product for relief, though it mat work for others it doesn't work for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 3,
      "publication_date": 20200416
    },
    {
      "title": "Made my eyes drier",
      "text": "Actually made my eyes feel much drier. I don't doubt that it works for a lot of people, just not for me. Searching now for something less chemical, perhaps straight isotonic saline.",
      "rating": 1.0,
      "verified": true,
      "author": "Leslie",
      "helpful_votes": 8,
      "publication_date": 20180628
    },
    {
      "title": "Better than the regular brand!",
      "text": "This is a new systane brand I’m trying. I’ve tried the regular eye drops but since I have dry eyes because of LASIK I figured these ultra lubricant eye drops would be better. I’ve been using them for a few days now and I have to say they work great! They are super moisturizing compared with the regular brand and whereas I had to use drops throughout the day with the regular brand, I only need to use these drops twice a day. The drops in this one have a bit more viscosity but that’s not a problem for me. I would recommend these for anyone who has dry eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "VegasBuyer",
      "helpful_votes": 2,
      "publication_date": 20200409
    },
    {
      "title": "TERRIBLE DELIVERY",
      "text": "Just got my 3 orders of eye drops after coming home from work and checked my mail box, I do not know how affective they are going to be after the package (size 15 X 11) was shoved in a small standard metal mail box all day in just outside 80 degree temperature under the hot sun, they should have been left by my front door under overhead cover as expected, very unhappy after spending $43 on products that most likely will not work at all or not as well due to being cooked in an oven literally.",
      "rating": 1.0,
      "verified": true,
      "author": "simon D",
      "helpful_votes": 3,
      "publication_date": 20190508
    },
    {
      "title": "Great drops",
      "text": "I had Lasik surgery a few years back and my doc gave me these drops. I use them every morning and they give your eyes a \"refresh\" great for dry eyes. The only reason I didn't give it 5 stars is the cost. They are more expensive then Visine, but I like that they coat my eye better and I don't have to reapply throughout the day. One drop in the morning and one at night is all I need to keep my eyes happy.",
      "rating": 4.0,
      "verified": true,
      "author": "TNTITAN",
      "helpful_votes": 8,
      "publication_date": 20170505
    },
    {
      "title": "helps dry eyes",
      "text": "my wife's eye doctor explicitly told her not to use visine for her dry eyes (not sure of the exact name of the condition) he recommended something else but she forgot the name so we ended up trying this knowing going in that it was a dice roll as to whether it would work for her or not. well it worked great. it helped to alleviate her dry eye pain and lubricate her eyes. check with your eye doctor before using something like this for your condition. for her needs it worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "joe doughnut",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Great for contact lense wearers",
      "text": "These drops work well for me in keeping my contacts moist. The Systane drops that specifically state lubricant for contacts blur my vision. I would not be without these. Use with or without my contacts. Price may seem a bit high but the bottle lasts a long time and for me the price for comfort is worth it.",
      "rating": 4.0,
      "verified": true,
      "author": "Claude",
      "helpful_votes": 6,
      "publication_date": 20180909
    },
    {
      "title": "BETTER THAN PRESCRIPTION EYE DROPS.",
      "text": "I have been diagnosed with chronic dry eye. Having this type of condition is not just being uncomfortable but it interferes with your vision. My ophthalmologist suggested this product instead of a prescription eye drop because this works just as well if not better. Try it. You will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Debra",
      "helpful_votes": 2,
      "publication_date": 20200217
    },
    {
      "title": "Best Eye Drops OTC",
      "text": "My optometrist recommended this stuff, and I'm glad she did. Helps a lot with red, itch and dry eyes which in turn improves my vision. Happy to add it to my morning routine, despite it being pricey.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebootin' Rubin",
      "helpful_votes": 5,
      "publication_date": 20181019
    },
    {
      "title": "Bye-buh dry eye!",
      "text": "I was diagnosed wth dry eyes and my eyes steadily watered, messing up my eye make up and walking around with tissue to dab my eye. Not a good look! I was becoming worried that my eye would continually become worse, so started reseaching best eye drop for dry eyes and this it it! My eyes haven't watered at all, I use in morning & before going to bed. Wish I found this sooner!",
      "rating": 5.0,
      "verified": true,
      "author": "Mona Lisa",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "MIRACLE WORKER!",
      "text": "I have been trying different eye drops and nothing does the job like this. I have very sensitive eyes whenever i go outside, where i'm practically crying every time, which always ruin my makeup. immediately using this that problem has completely gone away. HIGHLY RECOMMEND, don't wait any longer!!",
      "rating": 5.0,
      "verified": true,
      "author": "Melody",
      "helpful_votes": 2,
      "publication_date": 20200225
    },
    {
      "title": "That you’re paying for a whole bottle and only getting half the drops.",
      "text": "These are terrible...they do a great job on dry eyes for about half the bottle and then the bottle stops working. Since this has happened with 3 bottles, I’m going to assume it’s a product defect. Not ever purchasing these again.",
      "rating": 1.0,
      "verified": true,
      "author": "Debra  Ross",
      "helpful_votes": 6,
      "publication_date": 20190128
    },
    {
      "title": "Great for allergies!",
      "text": "My eyes burn every spring during tree pollen season. I'm miserable and want to stay in bed all day. I've tried other eye drops with very limited improvement. I ordered these because of the reviews and once they were delivered, put the drops in my eyes right away and hoped for the best. I went outside and sat on the deck for quite a while, when I went inside there was no dryness. The next morning I put them in my eyes before I went out to do gardening and never had a problem at all. They are expensive but, in my humble opinion, you can't put a price on comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "Tana",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Causes eye pain and redness",
      "text": "NOT preservative free. I have bad eye pain and redness - slowly getting better after 2 days on preservative free drops ( vials )",
      "rating": 1.0,
      "verified": true,
      "author": "SarasotaGuy",
      "helpful_votes": 5,
      "publication_date": 20181010
    },
    {
      "title": "Not a good substitute for more $ lumify",
      "text": "I had bought lumify last time but they're real expensive so I wanted to give budget friendly ultra a shot. I had double cataract surgery just after 52 years old and need constant lubrication. Well, to my chagrin, these drops leave a milky, sticky after effect as well as never entirely removing any present red that I may see/feel. Very disappointed!",
      "rating": 2.0,
      "verified": true,
      "author": "Michael DeSarlo",
      "helpful_votes": 3,
      "publication_date": 20181228
    },
    {
      "title": "The only eyedrop that works for me",
      "text": "I have extreme dry eyes due to Sjogren's Syndrome. This is the only eyedrop that lasts more than a minute. Because my eyes have NO tear layer, they don't last a long time, so I put them in several times a day. They are way too expensive at $18.00 for two bottles, but I have no choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "It helps make my eyes feel more comfortable.",
      "text": "I am very satisfied with these Systane eye drops. I use them once a day, typically in the evening, just after removing my contact lenses. The lubrication helps to moisturize my eyes and contributes to reducing eye redness the next day, after I reinsert the contacts. To also reduce redness, and increase contact lens wearing time, in the morning I use another kind of over the counter eye drop called Alaway. I use these drops approx. 15 minutes before putting in my contact lenses.",
      "rating": 5.0,
      "verified": true,
      "author": "H.D. Haslinger",
      "helpful_votes": 2,
      "publication_date": 20190204
    },
    {
      "title": "Made a Change",
      "text": "Had been using another eye lubricant and was somewhat satisfied, but thought it was time to try something else. This eye lubricant had been highly recommended and I would have to say that I agree. I have mild dry eye and this seems to do the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Reints",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Use it in your blue eye, and your spouse’s brown eye",
      "text": "Man, 5 stars. When it comes to lube for all Colors of eyes (including brown) this thing does the job. It’s quite viscous and allows for deep strokes of my eyelid against the actual ball. It helps in the AM when I’m all messed up from the night before...this and little “medicine” and I face the day like a eye lubed champ. I say lube it up. Better than WD-40 in your eyeball.",
      "rating": 5.0,
      "verified": true,
      "author": "AcesInThePocket",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "I have thr driest eyes ever",
      "text": "The older I get, the drier my eyes are getting - and I know spending hours in front of this computer doesn't help. I've tried several other products and these seem to be the best I've run across. They feel \"creamier\" when you apply them so they last a little longer. I end up using these about 3 - 4 times a day - especially now that our forced air furnace is running.",
      "rating": 5.0,
      "verified": true,
      "author": "Gmom",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Safe way to keep eyes lubricated and clean.",
      "text": "I love this twin pack. I buy this to keep my eyes nice and gently lubricated (all year allergy suffered) and then I use the other bottle for my Exotic Shorthair cat. These kitties have pushed in faces so their eyes need to stay nice and lubricated. Their eves always run and weep which is part of the breed, but this helps keeps the eyes clean and clear during the process. Works amazing and doesn’t burn me so I know it doesn’t burn my kitty!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Heaps",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Best Eyes Lubricant on the Market",
      "text": "After both my parents and one of my siblings had eye laser surgery , their Ophthalmologist recommended Systane Ultra Lubricant Eye Drops that was years ago , and it works very well for all of us . Myself included as my Allergist Immunologist recommended to my as I suffer from year long allergies. Best product and the best price on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "W.F.",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "A bit expensive, but works well",
      "text": "I wear contacts daily and they dry my eyes out pretty badly. My eye doctor previously had me use the Refresh brand, but I found that it wasn't doing a great job of keeping my eyes slick enough to have my contacts feel comfortable in my eyes. These Systane drops do a much better job of keeping my eyes comfortable. For reference, I use Acuvue Oasis 2-week contacts.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "It Hurt My Eyes",
      "text": "This caused terrible eye pain, very excessive tearing, shooting nerve pain, and sinus pressure. They sent me two bottles, great, just what I did not need. THEY WILL NOT ACCEPT RETURNS OF THIS TERRIBLE PRODUCT EITHER. Be very wary of this product. They are your eyes.",
      "rating": 1.0,
      "verified": true,
      "author": "Sunlightening",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Good Value for your Money!",
      "text": "I've had dry eye for quite a while and ignored the symptoms and finally, it was too much watering of the eyes. I decided to try 'Systane' (Ultra) and was pleasantly surprised that it lubricated my eyes quite well but you have to use several drops to stop the watering and I would purchase this item again from the seller. The two in package is a good deal. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Lou",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Not as great as I had hoped",
      "text": "I bought these hoping they would help my dry eyes, but they made virtually no difference. I applied 2 drops to each eye ~every 3 hours and used up both bottles. I had much better luck with the Refresh Optive Advanced eye drops",
      "rating": 2.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 2,
      "publication_date": 20200209
    },
    {
      "title": "Just get it.",
      "text": "If your eyes are constantly dry from contact use, allergies or a dry climate just get this. It's great.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Castle",
      "helpful_votes": 4,
      "publication_date": 20181014
    },
    {
      "title": "Eyes feel all natural with this product",
      "text": "After seeing the reviews for this product I decided to buy these eye drops. I just started using contacts and my eyes have been getting extremely dry but with these eyedrops my eyes feel like normal! I use a drop in each eye in the morning before I put in my contacts and sometimes a drop after they are in. Depending on the day, this will be good enough until I take my contacts out but I always carry it in my pocket if I go on long drives with the ac blowing in my face. A drop in each eye before driving can save a lot of irritation!",
      "rating": 5.0,
      "verified": true,
      "author": "Sapawa",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Didn't work for me",
      "text": "I'm sorry but this product made my eyes feel worse. It initially lubricated my eyes and they felt great. About 15 minutes later, my eyes felt like they had sand in them.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Austin",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Expensive but very effective - gold standard of eye drops",
      "text": "I've been buying this brand of eye drops for years and they really are the gold standard for people who need to moisturize their eyes. I wear contacts every day and suffer from allergies, so my eyes are always dry and/or irritated and these eye drops are a nightly routine for me. Wish they were more affordable, but they are the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Jameson",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Helped reduce eye redness",
      "text": "I didn't realize I had any eye problems, but I live in a dry climate so perhaps I had dry eyes and didn't realize it. It wasn't until I noticed different people asking if I'm okay because my eyes looked red. Since using these drops daily, my eyes don't look so bloodshot and I haven't had anyone asking me if I'm okay.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan Perryman",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "I love these drops!",
      "text": "These are better than normal drops because they keep your eyes moist for longer. I will say that the price on amazon is a bit high, so if you have a Costco membership, try getting them there instead.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry Walti",
      "helpful_votes": 2,
      "publication_date": 20190524
    },
    {
      "title": "Best Eye Drops You Can Buy",
      "text": "If you have dry eyes regardless of what time of year it is, these are the drops you should buy. Really you should get a warm compress pack and leave that on your eyes for about 5-10 minutes once a day in addition to using drops so that you open up your tear ducts that can easily get clogged. However, this product will ensure long-lasting, moist eyes and not cause any side-effects. I've never had any burning issues and you're going to get a product that has a long shelf life too. The ones I ordered expire next year, which was much better than a homeopathic alternative I tried from another company that expired 1 month after I bought them.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 11,
      "publication_date": 20161221
    },
    {
      "title": "Works Well For Extended Time",
      "text": "Been using Systane Eye Drops for a few years now and have not been disappointed. Recommended by my optometrist for dry eyes. Had been using Visine but was told it's not good for my eyes. In any event, made the change with good results. Typically I use once in the morning and once in the afternoon.",
      "rating": 5.0,
      "verified": true,
      "author": "John B",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Product was not full",
      "text": "The bottles I received were sealed however were less than 1/2 full",
      "rating": 1.0,
      "verified": true,
      "author": "Nreach",
      "helpful_votes": 3,
      "publication_date": 20190619
    },
    {
      "title": "Gelatinous goop",
      "text": "Terrible eye drops. The tip clogs constantly even with EXTREME shaking. Will not buy again. Had to throw one bottle away mostly full and it's looking like the second is going to follow suit.",
      "rating": 2.0,
      "verified": true,
      "author": "S. Fuller",
      "helpful_votes": 2,
      "publication_date": 20190406
    },
    {
      "title": "Cheaper than brick & mortar stores",
      "text": "I knew the product would be very good quality. I've used them before. This is, however, the first time I ordered the product via Amazon. The biggest reason was they were much cheaper at Amazon than in the stores. I will buy via Amazon again...so long as the price remains less than store bought.",
      "rating": 5.0,
      "verified": true,
      "author": "LoneWolff7557",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Best eye drops for people with dry eyes.",
      "text": "I have chronic dry eyes due to some meds that I take and my eye doctor recommended these eye drops for me. I have used other eye drops but these are the best. Everytime I have itchy or dry eyes, just a couple drops in each eye gives me relief for hours. Highly recommended!!",
      "rating": 5.0,
      "verified": true,
      "author": "Vanna",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "I CANT SEE!",
      "text": "These drops blur my vision horrendously, no clarity or relief. i wish i could get my money back, guess i just have to throw them away.. .",
      "rating": 1.0,
      "verified": true,
      "author": "@Caddy_One",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "very good on my severe dry eye",
      "text": "between my severe allergies and allergy medicines to dry me out, I use these several times a day. nice and soothing",
      "rating": 5.0,
      "verified": true,
      "author": "vlvet18",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Keeps Eyes Moist",
      "text": "I recently had lasik I've been using Systane to stave off the dry eye. At first I used preservative free and once I got the ok, I switched to this. Decently sized bottle that will certaily last a while. Works great in my eyes.",
      "rating": 4.0,
      "verified": true,
      "author": "Tristin",
      "helpful_votes": 2,
      "publication_date": 20181011
    },
    {
      "title": "Pricy but the best",
      "text": "all the pharmacy brands are inferior to this. this is the one to get. other brands can actually annoy my eyes and exacerbate my issues.",
      "rating": 5.0,
      "verified": true,
      "author": "sendcash",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Moisturizing",
      "text": "Very moisturizing for those who have had lasik. The relief is unbelievable once you put these in the icebox for a few minutes. As far as value for you money; these are a little overpriced as a brand in general. But they work.",
      "rating": 5.0,
      "verified": true,
      "author": "Jasmine  ",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Outstanding Stuff, and my Eye Doctor Loves it",
      "text": "Great stuff. I wake up in the middle of the night with dry eyes and this stuff is the best thing I've found for that. Just a quick drop in each eye and back to bed. Then my eyes are in great shape in the morning. I'll keep buying it.",
      "rating": 5.0,
      "verified": true,
      "author": "retrodog",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "10 stars ⭐️ for Amazon and sellers",
      "text": "This works better than others thanks Amazon and they are patient with they stuffed and I like responsibility and if anything goes wrong they will fix it. I’m glad I shop on Amazon because I don’t have to go out only to get food and little of some stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "BIG D",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Over priced and under performing.",
      "text": "Given what this costs, its performance is underwhelming. I expected better at this price. This product performs no better than several else I have used at much less cost. The applicator is tiny...two-thirds the size of my thumb and has a rather \"pointed\" end that is poorly designed. At this price per ounce, I doubt I shall be reordering this",
      "rating": 3.0,
      "verified": true,
      "author": "Lounar",
      "helpful_votes": 2,
      "publication_date": 20170802
    },
    {
      "title": "These drops are the best hands down",
      "text": "Great value for two bottles! These drops are the best I have found for my eyes. I have two autoimmune eye diseases PLUS severe dry eye. I keep a bottle in my purse and one at home. My eyes love this stuff. It feels like moisturizing lotion for the eyes when you put a drop in.",
      "rating": 5.0,
      "verified": true,
      "author": "Scars",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "So far so good.",
      "text": "One of my dogs has dry eye syndrome. The vet recommended a good brand of eye drops to give him 2 x per day. This has worked wonderfully. It's much better than the Visine products. It may cost a bit more, but it's worth it. My dog nearly lost his eye due to him scratching it -- this has helped immensely. I highly recommend it, both for pets and humans!",
      "rating": 5.0,
      "verified": true,
      "author": "jan tetzlaff",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Best drops!",
      "text": "These are so soothing. These are a clear (not milky) drop with a good thickness to the formula. Not too thick to cause blurry vision. Leaves a nice protective film on your eye without running down your face during application, like some \"watery\" drops tend to do.",
      "rating": 5.0,
      "verified": true,
      "author": "JillU",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "These are the only eyedrops that work for me.",
      "text": "Unless you are allergic to the preservatives, in which case you need the single-use tubes, these are the best eyedrops for my very dry eyes which tend to get scratched easily by flying dust on windy days. These are the only brand that really lubricates and protects",
      "rating": 4.0,
      "verified": true,
      "author": "Linda NYC",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "DOORBUSTER!!!!!!",
      "text": "I get this pack and it’s very convenient. It soothes my eyes as well as lubricate them👀🌍. I love putting the drops in, it feels Amazeing, good for the money 💰, you get two of them. It helps also take red eyes away, and then you will feel more 🚨 through out the day.",
      "rating": 5.0,
      "verified": true,
      "author": "MaryJane Hoad",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Great stuff ..",
      "text": "This is the only \"Systane\" that continues to help my dry eyes. There are different formulas but the \"high performance\" is the only one that helps my dry eyes. Now that it's allergy season this is a must have!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bee",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Good Dry Eye Gel Drops",
      "text": "This product is a little to expensive for the quality. I only buy it when it is on Sale. It is better than the inexpensive dry eye drops but not as good as the expensive or mid priced drops. Worth it when it is on sale and not that expensive, otherwise, just get the 8 dollar dry eye drops. They are almost as good and you get double the amount of the actual liquid.",
      "rating": 4.0,
      "verified": true,
      "author": "DylanD",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Overall best 4 night w dry eye",
      "text": "I have tried many drop for to my severe dry eye. Pure Moist drops is the best with contacts and a combo of Ultra and their Gel is great at night. Refresh is also good but doesn't last as long.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken W",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Keeps my balls lubed.",
      "text": "I use these drops throughout my day and the gel at night. After lasik, I've had very dry eyes and these drops seem to keep me well lubed. I have yet to find a better price on these drops.",
      "rating": 5.0,
      "verified": true,
      "author": "MadBenco",
      "helpful_votes": 5,
      "publication_date": 20170312
    },
    {
      "title": "VeryvNice",
      "text": "Very Complete solution for Dry Eyes I really feel comfort from these Double Action Formule for Dry eyes Lovely Drops but price is little Expensive Thanks for Your pretty Item. Thanks 🙏 Guys",
      "rating": 5.0,
      "verified": true,
      "author": "R Sheraz Khan",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "necessary to have one if overuse of eyes",
      "text": "nowadays, we use lots of electronics every day, to be honest, it is inevitable to use them! eye drops especailly helpful for releasing our eyestrain. It feels a bit pain for the first time, but after that, it just works as usual with no pain!",
      "rating": 4.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "DO NOT ORDER - BAD QUALITY CONTROL, NO RETURNS",
      "text": "TERRIBLE!!! Just found out the hard way that this item is NOT returnable yet my package arrived like this... SO MAD!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Lauren ",
      "helpful_votes": 2,
      "publication_date": 20200610
    },
    {
      "title": "Keeps eyes moist and no itching.",
      "text": "Was recommended by my optometrist and it great. Have used for 6 years.",
      "rating": 5.0,
      "verified": true,
      "author": "LeRoy Elliott",
      "helpful_votes": 2,
      "publication_date": 20190812
    },
    {
      "title": "Bad reaction...",
      "text": "I am having a reaction to these drops. My eyes ate swoolen watery red & itching. I see I can not return or get a refund. I gave bought 2 kinds if drops same brand & having same reaction! Send me an email my pic won't upload. I want u to see my eyes!!",
      "rating": 1.0,
      "verified": true,
      "author": "MB",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Too small to be worth the price",
      "text": "I overlooked that they're 10 mL each. Definitely not worth the price, and wouldn’t buy them again.",
      "rating": 2.0,
      "verified": true,
      "author": "D2S",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Dependable and soothing relief for the eyes",
      "text": "A neighbor asked me to buy these for her and she reports that this product is fantastic. I trust that input as she needs to use these drops several times per day. I feel confident in recommending them since I know that they are helping my neighbor with her dry eyes condition. I have no other information other than I have never heard her complain about them. For me that means a five star rating and A+",
      "rating": 5.0,
      "verified": true,
      "author": "Bannis",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "The best drops I’ve tried so far",
      "text": "I have really dry eyes. I used to get headaches from how dry they were. I got some samples of Systane drops from my eye doctor. I really liked the way they worked. So when I ran out of the samples I decided to order more. You do have to apply more than once a day, like other eye drops. But they last long enough to relieve the dryness for awhile. I will be buying more when I run out.",
      "rating": 5.0,
      "verified": true,
      "author": "JustaGrl33",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Burns eyes",
      "text": "I bought these and they burn my eyes and I have no clue why, I stare at a monitor all day so I bought these for when my eyes get dry but they just burn and make them feel sticky because the liquid leaves them very mucus like",
      "rating": 3.0,
      "verified": true,
      "author": "Jonathan A.",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "this is a MUST for daytime dry eyes",
      "text": "I have very severe allergies/ dry eyes, and this is a great day time eye drop for me. For the night I use a thick gel-like lubricant but I love keeping this on me and I use a couple of times during the day!",
      "rating": 5.0,
      "verified": true,
      "author": "Ravina",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Eye lube",
      "text": "As far as eye lube goes; it's great. My eyeballs used to move really slow. All I could watch were trees, stationary bikes, and documentaries about desks. No more. Plop a dooper in each of your squish orbs and be amazed as your eyes turn into lightning bolts.",
      "rating": 5.0,
      "verified": true,
      "author": "A H",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Good quality eye drops",
      "text": "Love these eye drops! My opthomolgist recommended them for my dry eyes from contacts. I stopped using contacts but I still use them for irritation from allergies. 1 drop typically does the trick so these little bottles last a long time!",
      "rating": 5.0,
      "verified": true,
      "author": "Meg",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Good- but",
      "text": "My boyfriend has bell Palsey, and needs eye drops because he can’t control his eye lid, these worked perfectly to keep it moist and dry, however, week later I did end up finding cheaper eyedrops that are name brand eyedrops that give you way more than this. But they work :)",
      "rating": 5.0,
      "verified": true,
      "author": "AshleyZiemann",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Tried many different products for dry eyes. This one works!",
      "text": "I currently use these eye drops about every other night, and wake with no redness or burning. Previously I used the drops a few times daily when I first got them, but now I only use every other night. Seems to last. Nice product.",
      "rating": 5.0,
      "verified": true,
      "author": "v75rab",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "To expensive",
      "text": "I personally saw zero difference from this and Walmart’s brand. Will not be purchasing this again.",
      "rating": 1.0,
      "verified": true,
      "author": "OpenKari",
      "helpful_votes": 2,
      "publication_date": 20190306
    },
    {
      "title": "Years of eye problems.",
      "text": "After trying antihistamine drops at doctor's recommendation. Gooy goopy nasty. Finally a lubricating eye drop you can use repeatedly throughout the day as needed. So far so good!",
      "rating": 4.0,
      "verified": true,
      "author": "Buddy",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "I would order again",
      "text": "I would order again. Everyone needs this in their cabinets",
      "rating": 5.0,
      "verified": true,
      "author": "klgotta",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "great soothing relief",
      "text": "I tried these and they work so well I put them on recurring delivery - keep in my desk to refresh my tired eyes - nice fast long lasting relief for my tired eyes",
      "rating": 5.0,
      "verified": true,
      "author": "moldie",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Systane Ultra Lubricant Eye Drops, 2-count .33 fl oz (10 ml) Bottle",
      "text": "I like having 2- per pack. And it last me a month or so. it will last me for a while until I have to re order again. This product is excellent for my eye condition The Ultra is less gummy than the other Systane Gel Product. Though you have to remember to shake the contents before you use it. I enjoy this product it works for me. And for the price it's a great savings from buying it local at CVS or Safeway. Thanks again Amazon for have this product for online buyers as myself to take advantage of the \"Prime\" 2-day shipment free offer on this product line.",
      "rating": 5.0,
      "verified": true,
      "author": "Shihan",
      "helpful_votes": 4,
      "publication_date": 20130507
    },
    {
      "title": "the absolute BEST",
      "text": "if you want a good eyedrop that moisturizes your eyes and doesnt just feel like water, LOOK NO FURTHER!!!! its like a nice cool bath for your eyes or something haha",
      "rating": 5.0,
      "verified": true,
      "author": "Rez",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "!!!",
      "text": "Item is fine. But Amazon ratings on my purchases are to warn you. They lie with splash ads for free debit card. Then rip you off. That’s fraud!",
      "rating": 1.0,
      "verified": true,
      "author": "Mike Anderson",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Love these! It just feels super heavy when you ...",
      "text": "Love these! It just feels super heavy when you put them on that other eye lubricants don't do but it still all works the same+",
      "rating": 4.0,
      "verified": true,
      "author": "Hailey",
      "helpful_votes": 2,
      "publication_date": 20181022
    },
    {
      "title": "good product",
      "text": "These eye drops seem to work just as good as my Renew drops, if not better. They are thinner liquid but seem to last twice as long as the Renew drops I used before. Very pleased with these eye drops for Chronic Dry Eye. I will be a repeat customer!",
      "rating": 5.0,
      "verified": true,
      "author": "Debra",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Systane Ultra really works",
      "text": "Thank you for the ongoing delivery service, we had to skip one occurrence but the reorder came next scheduled delivery arrived without a problem",
      "rating": 5.0,
      "verified": true,
      "author": "I. Purvins",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Much Improved Over the Earlier Version",
      "text": "I have extremely dry eyes and glaucoma, and the Dr told me to use these four times a day. The dryness was scratching my corneas, but now my eyes are much better.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith L.",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "LOVE THIS PRODUCT",
      "text": "I wear contact lens and these help me a lot when take them off to keep my eyes from drying out and feeling bad in general! RECOMMEND",
      "rating": 5.0,
      "verified": true,
      "author": "Guillermo Semorile",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "有效缓解我眼睛疲劳",
      "text": "It is indeed effective. My eyes are easily blurred and I am very tired to see things. This relieves my eye fatigue and makes my eyes clearer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Comfort for both contacts and allergies",
      "text": "I love them. My optometrist recommended these eye drops when I first got contacts. I add a drop every morning and they are awesome. For the first 10 minutes after adding I can feel my contacts more, but this goes away and does a great job keeping them feeling comfortable for the rest of the day. My wife, who suffers from allergies, tried the drops one day when her eyes were dry and itching and now used them every day as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Haley M Downing",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Great product!",
      "text": "These eye drops work well for dry eyes and the two pack is nice. I like that I can keep one bottle by my bedside for the morning and one in my purse when needed. It's a good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Colleen W.",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Dry Eyes with Glaucoma",
      "text": "My husband suffers enough from glaucoma and the regimen of drops. When his eyes became dry we bought a number of OTC drops which just didn't work. I finally searched Amazon and read the review for Systane, bought it and my husband is breathing a sigh of relief. The drops soothe his eyes and the comfort lasts. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "SharonE",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Systane Eye Drops",
      "text": "These eye drops are great for lubricating my eyes. I’ve been using them daily for the past year and highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "SAOT66",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Bad batch?",
      "text": "I have used Systane drops for years, but this batch may have been bad. I got pink eye from BOTH bottles (used weeks apart, brand new). Completely unacceptable, and potentially dangerous and vision-threatening.",
      "rating": 1.0,
      "verified": true,
      "author": "AkhilN",
      "helpful_votes": 2,
      "publication_date": 20200212
    },
    {
      "title": "Best stuff ever",
      "text": "I keep a bottle next to my bed and on my desk at work. They can be a life saver first thing in the morning or a long day at work. I started the vials after Lasik and went to the bottle after the healing period. My eyes arent really that dry anymore but they help alot on those rough days.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelman7",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Amazing!!",
      "text": "I love using this eye drop! I won't lie, I am probably addicted to it. It really helps with relieving my semi-dry eyes. It helps a lot when I put it in my eyes before I sleep and wake up with still-hydrated eyes! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Helen",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "THIS IS A PRODUCT I RE-ORDER",
      "text": "I think these are good eyedrops for over the counter product. Because it IS a re-order, WHY must I always rate it??",
      "rating": 5.0,
      "verified": true,
      "author": "Toni Molik",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Wonderful eye drops for dry eyes",
      "text": "Takes away the feeling of something in the eye and eases the feeling of gravel. Returns the eyes to feeling normal.",
      "rating": 5.0,
      "verified": true,
      "author": "GJN",
      "helpful_votes": 0,
      "publication_date": 20201020
    }
  ],
  "product_meta": {
    "title": "Systane Ultra Lubricant Eye Drops, Twin Pack, 10-mL Each,packaging may vary",
    "description": "Size:0.33 Fl Oz (Pack of 2)Systane Ultra Lubricant Eye Drops are clinically proven to deliver extended protection and high-performance relief from your dry eye symptoms. This Ultra formula provides you with the extended relief that you need. These lubricant eye drops have been clinically proven to reduce both the signs and symptoms of dry eye, quickly. Providing immediate, long-lasting moisture and protection Systane Lubricant Eye Drops offer the relief you need to get through your day. You no longer have to suffer through burning and irritation due to your dry eyes, get temporary relief with these lubricant eye drops. Available in multiple size bottles to keep your eyes feeling moist and refreshed during your day. The Systane Family of Products is the #1 Doctor Recommended brand of artificial tears for dry eye symptom relief. Don’t let dry eyes ruin your day, Systane provides temporary relief from your symptoms.",
    "rating": 4.7,
    "feature_bullets": [
      "#1 Dr Recommended Brand of Artificial Tears*, packaging may vary",
      "Extended Protection",
      "Fast Long-Lasting Dry Eye Symptom Relief",
      "Reduces both the signs and symptoms of dry eye",
      "Quickly soothe irritated eyes wherever you are"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "6 x 5 x 4 inches; 0.8 Ounces",
      "Item model number": "0065143141",
      "Date First Available": "January 28, 2010",
      "Manufacturer": "Systane",
      "ASIN": "B0036B8QL0",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item is not eligible for international shipping.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Vision Care",
      "Rewetting Drops",
      "Contact Lens Care",
      "Health & Household",
      "Health, Household & Baby Care"
    ],
    "price": 15.39
  }
}