{
  "website_summaries": [
    {
      "verdict": "Unusual yet dressy design is certain to turn heads.",
      "pros": [
        "Water resistant to a limited depth",
        "Striking retro-flavored timepiece",
        "Stainless steel case with black dial and slim dot-and-stick markers",
        "Sapphire glass"
      ],
      "cons": [
        "Deployment clasp can be difficult to secure"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Cool and stylish like the Jetsons.",
      "text": "Cool and stylish like the Jetsons. A little overpriced as it probably feels more like a \"$300\" watch, but I still love the look and the history behind the Ventura model.",
      "rating": 4.0,
      "verified": true,
      "author": "reatanak",
      "helpful_votes": 8,
      "publication_date": 20171226
    },
    {
      "title": "Impressive watch with incorrect instruction manual",
      "text": "The watch came well packaged, and arrived on time. The watch is exquisite, and looked even better than the picture. The watch was a gift, and the recipient was thrilled and extremely happy with the watch. The only downside was that the instructions included with the watch were not the correct instructions for the watch received. Additionally, it was necessary to watch a YouTube video to figure out how to work the watch clasp. Having received the appropriate instruction manual would have been helpful. Also, we aren't sure whether the watch is self winding or battery operated. It will be necessary to try to find an online manual for the watch.",
      "rating": 5.0,
      "verified": true,
      "author": "TER",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Nice exclusive design if you don’t mind grabbing some extra $$.",
      "text": "Liked it’s design, of course due to the movie MIB Disliked a little bit the strap attachment system, so called a folding clasp. Works a little awkward and gives the sensation that is gonna break soon (hope not).",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Fred",
      "helpful_votes": 2,
      "publication_date": 20190831
    },
    {
      "title": "Elvis wore this watch in Blue Hawaii.",
      "text": "I have been wanting this watch since Elvis made it famous around 1961. The band is different, but adequate. The watch is not round, not square, not rectangle, not like any other watch. Thank you for making it affordable. It is a great conversation piece.",
      "rating": 5.0,
      "verified": true,
      "author": "James May",
      "helpful_votes": 3,
      "publication_date": 20181221
    },
    {
      "title": "Very sharp watch.",
      "text": "The package arrived as promised within three days. I was very impressed with the quality of the watch. I really like the contrasting black leather band with the silver in the case and the dial. The think the size is perfect. It is large enough for the Art Deco shape to be noticeable without it being over the top. The warranties offered through the seller (WatchMaxx) and through Amazon allows one to buy with confidence. Very pleased!!",
      "rating": 5.0,
      "verified": true,
      "author": "FlyingV",
      "helpful_votes": 2,
      "publication_date": 20190729
    },
    {
      "title": "The cleanest design Ventura",
      "text": "Have wanted one since I saw Elvis wearing it in Blue Hawaii when I was little. Same one they used in all the MIB movies. A classic original American design, nothing else like it. Just need a 56 Caddy to go with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dylan",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Timeless Classic!",
      "text": "I love this watch, it's so unusual and classic all at the same time! If it was good enough for Elvis in Blue Hawaii and the guys in Men and Black I figured it would be good enough for me too and I was right!",
      "rating": 5.0,
      "verified": true,
      "author": "Craig5150",
      "helpful_votes": 10,
      "publication_date": 20150701
    },
    {
      "title": "Beautiful unique timepiece",
      "text": "The Ventura quartz is an absolutely stunning watch. Easily the favorite in my collection. I received it within two days of ordering (AmazonPrime member) and it was packaged with care. I definitely recommend this seller; i'll be ordering again in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "my johnson",
      "helpful_votes": 4,
      "publication_date": 20160809
    },
    {
      "title": "Subtle and Clean",
      "text": "Had this watch for about a week and love it. Nice craftsmanship and I love the style. I think I’ve found a brand I’ll stick to as long as I can. Take notice that it is a smaller styled watched, similar to what would today be a “women’s “ watch. It’s not meant to be ogled but admired subtly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "LOVIN' THIS FINE TIMEPEICE!!!",
      "text": "I've been wanting one of these watches for about 15+ years and I finally decided to treat myself. i'm so glad i did. This is probably the last watch I'll ever spend this much on and I have NO regrets. I cannot count the amount of compliments I've received so far. On second though.... I may go ahead and get the brown one too... then I'll stop. LOL!!!",
      "rating": 5.0,
      "verified": true,
      "author": "William J. Wonka, Esq",
      "helpful_votes": 7,
      "publication_date": 20140314
    },
    {
      "title": "Hamilton Ventura",
      "text": "Super stylish and uniquely classy timepiece. Perfect accessory for an 'attention drawing' night out on the town.",
      "rating": 5.0,
      "verified": true,
      "author": "Paulie Mendonca",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Great customer service",
      "text": "Very happy with purchase. We couldn’t figure out the clasp on it, but the customer service was exceptional and got us sorted. Very pleased",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie S.",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Very Disappointed",
      "text": "Very disappointed. This is advertised as the male watch but I received the smaller female watch.",
      "rating": 2.0,
      "verified": true,
      "author": "Vincent Abbatiello",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Awesome, slick watch",
      "text": "Awesome, slick watch! Totally love it. Only difficulty is with the strap - it's a pain to secure. I'll probably replace it with a flex band.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Miller",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "Hamilton Ventura OMG WTF",
      "text": "I have 28 watches, (yes I may a problem:-) This is my favorite watch. Both in form, weight, style, comfort. There is no comparison excepting that this and the others tell time. Think for Ford VS Bugatti. All the details are right and the watch is awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 19,
      "publication_date": 20120115
    },
    {
      "title": "It's so unique...",
      "text": "I must say that it delivered fast and looks better in person. The watch is going to take time getting used to as I never had clasps like it but I love how elegant and classy it is, I've gotten compliments almost every time I wear it...more than my very expensive Emporio Armani. I am very happy with my purchase, worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Theodore K.",
      "helpful_votes": 3,
      "publication_date": 20140423
    },
    {
      "title": "Couldn't be happier!",
      "text": "This is THE WATCH my husband has measured all other watches by, we are so pleased with our purchase, it came just as we were informed it would and might I add, my satisfaction has been of utmost importance to Amazon and their vendors, not only with this purchase, but everything I purchase, I am very happy with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160511
    },
    {
      "title": "one of the Kings favorite watches",
      "text": "great watch, Elvis wore this style of watch in the movie Blue Hawaii",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Bovender",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Hamilton Ventura men's watch",
      "text": "This is a very unique watch, with a vintage style that would look great with a suit or formal wear. The watch is very light weight (compared to my Omega Seamaster) and is very comfortable on the wrist. The only negative aspect of this watch is that the face and hands are not luminous, so it is very difficult to read in low light conditions.",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 8,
      "publication_date": 20131119
    },
    {
      "title": "It's a great watch!",
      "text": "I have this watch. I purchased another thinking it was a larger version of my present watch. I was wrong, It's a great watch!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "This watch is BEAUTIFUL, I love it",
      "text": "This watch is BEAUTIFUL, I love it. The way the watchband connects was easy to figure out, and it stays latched. The only \"bad\" thing I can say is that it was running when it arrived. I wonder how much battery life was used before I received it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170116
    },
    {
      "title": "Sleek Art Deco Watch.",
      "text": "Love this watch! Beautiful history and a beautiful watch. I love the unique Art Deco design. Light weight for its size and extremely comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "It's nice",
      "text": "Going to order another one for my son. It's that mice",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey Jones",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Love it!",
      "text": "My husband loved his birthday present! This watch is unique. And handsome. Thanks for sending it so promptly!",
      "rating": 5.0,
      "verified": true,
      "author": "Buffy",
      "helpful_votes": 0,
      "publication_date": 20151104
    },
    {
      "title": "I gave this watch to my husband for his birthday ...",
      "text": "I gave this watch to my husband for his birthday. He says it \"rocks!\" Secure clasp on strap is a bit tricky but we figured it out. Very handsome watch on a man's wrist.",
      "rating": 5.0,
      "verified": true,
      "author": "Library Diva",
      "helpful_votes": 0,
      "publication_date": 20151112
    },
    {
      "title": "Quality",
      "text": "Beautiful, smaller than expected but beautiful. Clasp while unique and in its self beautiful can be fiddly to close",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara Pringle",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "Great looking watch",
      "text": "It is a beautiful time piece and quite unusual looking. I get compliments all the time on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Val O Beasley",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "He loves it and loves the fact about Elves had one just like it, Elves wore the watch in Memphis when ...",
      "text": "Bought this watch for my husband for Christmas. He loves it and loves the fact about Elves had one just like it, Elves wore the watch in Memphis when preforming",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161225
    },
    {
      "title": "Way Cool",
      "text": "The coolness factor is only exceeded by the quality of the manufacturing. one two three four five six seven eight",
      "rating": 5.0,
      "verified": true,
      "author": "Jonah Morgan",
      "helpful_votes": 0,
      "publication_date": 20140428
    },
    {
      "title": "Even better in person",
      "text": "Even better in person .......Grad gift for my son. He was ecstatic; he has been wanting this since he first saw it on Men in Black. A beautiful timeless piece to add to his collection. Thank you Amazon for your help in making it possible and for shipping so quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Lina",
      "helpful_votes": 0,
      "publication_date": 20150426
    },
    {
      "title": "Makes you want to get dressed up",
      "text": "I just recieved this as a birthday/fathers day gift and I couldn't be happier with this watch. Fit and finish are very good ,the leather band is well made though alittle stiff,but I'm sure it will soften with use.It took a couple of tries to get the deployment band adjusted but once you figure it out it's pretty simple. I've only worn this watch out twice but and have had numerous comments/ compliments on it. I told my wife I like it so much that it makes me want to get dressed up and go out more often.Win/Win for both of us. I will update on accuracy and reliability later. A fine watch and a great piece of americana.",
      "rating": 5.0,
      "verified": true,
      "author": "steveh",
      "helpful_votes": 0,
      "publication_date": 20140615
    },
    {
      "title": "I'm pleased as punch that I finally got hat I really ...",
      "text": "I'm pleased as punch that I finally got hat I really wanted in life. It's a beautiful thing! And looks like no other.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Green",
      "helpful_votes": 7,
      "publication_date": 20161116
    },
    {
      "title": "I really like the watch but it is about $70 less in ...",
      "text": "I really like the watch but it is about $70 less in two weeks from when I got it : (",
      "rating": 4.0,
      "verified": true,
      "author": "Janette Myers",
      "helpful_votes": 0,
      "publication_date": 20160427
    },
    {
      "title": "A work of art",
      "text": "I just got this watch after wanting one for years. It's a thing of beauty. I hope it proves to be as durable as it is pretty.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Richardson",
      "helpful_votes": 5,
      "publication_date": 20100415
    },
    {
      "title": "A huge disappointment.",
      "text": "IT came with a defective clasp. Can you believe a watch of this price comes with a band that does not work. I had to find a jeweler to diagnosis the problem and now I have to hassle with returning it. What a huge disappointment. I wanted this watch for so long and it just keeps popping off my writs. It is a beautiful watch but God forbid you have a problem.",
      "rating": 1.0,
      "verified": true,
      "author": "mr. ipod",
      "helpful_votes": 7,
      "publication_date": 20140820
    },
    {
      "title": "It's a beautiful looking watch but I thought it would be a ...",
      "text": "It's a beautiful looking watch but I thought it would be a little bigger not too happy with it but I'll keep it anyway should of order the xxl Elvis edition wish I could exchange it :(",
      "rating": 3.0,
      "verified": true,
      "author": "eric brandon",
      "helpful_votes": 0,
      "publication_date": 20141105
    },
    {
      "title": "Plan ahead",
      "text": "I ordered this watch for an anniversary gift and paid for expedited shipping. Because of the holiday and processing time, it actually didn't arrive until after our wedding anniversary. It is a nice watch and my husband likes it, after he figured out how to put the band on (take your time it is a bit tricky the first time).",
      "rating": 4.0,
      "verified": true,
      "author": "Mrs. A. Brown",
      "helpful_votes": 0,
      "publication_date": 20130909
    },
    {
      "title": "Men in Black Watch",
      "text": "The Hamilton Mens H24411732 is a very attractive watch, however the band is too small and it is uncomfortable as the metal portion under your wrist digs in to you. Not real happy with it.",
      "rating": 3.0,
      "verified": true,
      "author": "coolreed",
      "helpful_votes": 6,
      "publication_date": 20130130
    },
    {
      "title": "it was so small, its for womens, im ...",
      "text": "it was so small , its for womens , im so dispoinnt .. !",
      "rating": 1.0,
      "verified": true,
      "author": "saif alotaibi",
      "helpful_votes": 4,
      "publication_date": 20151003
    }
  ],
  "product_meta": {
    "title": "Hamilton Mens H24411732 Ventura Stainless Steel Watch with Black Leather Band",
    "description": "Asymmetric stainless steel case with a black leather bracelet. Fixed polished stainless steel bezel. Black dial with silver-tone hands and dot indices hour markers. Quartz movement. Scratch resistant sapphire crystal. Solid case back. Case diameter: 31 mm. Case thickness: 11 mm. Deployment clasp. Water resistant at 50 meters / 165 feet. Functions: hours, minutes. Additional Information: end of battery life indicator. Hamilton Men's H24411732 Ventura Black Dial Watch.\n\n\n\n\nPRODUCT DETAILS\n * Is Discontinued By Manufacturer :No\n * Product Dimensions :4.72 x 4.72 x 4.72 inches; 15.84 Ounces\n * Item model number :H24411732\n * Department :Womens\n * Batteries :1 Unknown batteries required. (included)\n * Date First Available :June 1, 2004\n * Manufacturer :Hamilton\n * ASIN :B003XGN3TI\n\n * .zg_hrsr_item {list-style : none};\n * Amazon Best Sellers Rank: #135,353 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry)  *  #819 inMen's Wrist Watches \n    *  #35361 inMen's Shops \n   \n   \n\n * Customer Reviews:4.7 out of 5 stars76 ratings Asymmetric stainless steel case with a black leather bracelet. Fixed polished stainless steel bezel. Black dial with silver-tone hands and dot indices hour markers. Quartz movement. Scratch resistant sapphire crystal. Solid case back. Case diameter: 31 mm. Case thickness: 11 mm. Deployment clasp. Water resistant at 50 meters / 165 feet. Functions: hours, minutes. Additional Information: end of battery life indicator. Hamilton Men's H24411732 Ventura Black Dial Watch.",
    "rating": 4.7,
    "feature_bullets": [
      "Imported",
      "Dramatic watch featuring asymmetric stainless steel case with black dial and slim dot-and-stick markers",
      "31-mm stainless steel case with anti-reflective sapphire dial window",
      "Quartz movement with analog display",
      "Calfskin band with deployment-clasp closure",
      "Water resistant to 50 m (165 ft): In general, suitable for short periods of recreational swimming, but not diving or snorkeling"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4.72 x 4.72 x 4.72 inches; 15.84 Ounces",
      "Item model number": "H24411732",
      "Department": "Womens",
      "Batteries": "1 Unknown batteries required. (included)",
      "Date First Available": "June 1, 2004",
      "Manufacturer": "Hamilton",
      "ASIN": "B003XGN3TI"
    },
    "categories": [
      "Wrist Watches",
      "Men",
      "Watches",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 603.9
  }
}