{
  "website_summaries": [
    {
      "verdict": "Belkin's Conserve surge protector probably won't save you a ton of money, but it does provide a convenient way to selectively shut off any power-sucking devices in your home.",
      "pros": [
        "The Belkin Conserve surge protector allows you to completely shut down most of your components to save on energy costs while keeping two outlets reserved for electronics you want to keep \"always on\"",
        "surge protection for cable/satellite RF lines",
        "sliding safety covers for outlets",
        "wireless remote included for power on/off"
      ],
      "cons": [
        "No socket for Powerline network adapters",
        "no phone line or network protection"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 8.0,
        "Performance": 7.0
      },
      "publication_date": 20090417,
      "rating": 7.4,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "A fiery unit, 2 years later (just like the others).",
      "text": "2 years later, mine started on fire. EXACTLY like those other reviews. I thought those were just anomalies and that my experience would be different. This switch was used once per week on my Jiffy J-2000 clothing steamer (1300 Watts, which is well below the 1800W rating). I did not witness the fire, but it did occur when the product was OFF, which is bizarre and disturbing.",
      "rating": 1.0,
      "verified": true,
      "author": "DH",
      "helpful_votes": 52,
      "publication_date": 20160527
    },
    {
      "title": "Fire hazard",
      "text": "This thing started an electrical fire. I bought it in Feb this year (2020). It’s a good thing that I was at home and smelled the burning. I had ONE lamp plugged into it so it was not overloaded. If I could give it negative stars then I would.",
      "rating": 1.0,
      "verified": true,
      "author": "Carole  Jordan",
      "helpful_votes": 4,
      "publication_date": 20200611
    },
    {
      "title": "I like it no current flow lower electric bill...",
      "text": "I’ve had mine for over 5 years. I use mine to power everything in the living room and it’s great.. one switch next to the light switch I turn everything off when I leave the room... I have another one about 30’ away the other end of the house many walls between them and one would turn both off so there’s definitely a good signal. I think you could change the Chanel that the remote is on so you don’t end up interrupting the other one but I haven’t checked... it also has 2 outlets that bypass the switch on the surge protector Incase u need something to stay on like your internet for example....",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Good, but serious flaw",
      "text": "These are quality surge protectors, and the outlets are great - but it has one serious flaw (or maybe it's a design element) - there is a \"circuit breaker button\" for the top outlets that disconnects frequently. I put these surge protectors on my wall (cord going down), and noticed one morning the \"top button\" had gone off in the middle of the night, so my phone didn't charge. If you plug things into the bottom two outlets, they're \"on\" constantly, but the top 6 outlets are connected to that breaker button. I have two of these and they both work that way, so understand you're going to have to constantly re-activate that breaker to get these to work!",
      "rating": 3.0,
      "verified": true,
      "author": "M. Long",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Remote switch stopped communicating to outlet",
      "text": "Just shy of 3 years, the remote switch is no longer communicating with Switched outlets. It happened a couple of times before this (I thought it was the battery, but it communicated again after flipping the switch back and forth a few times). As of today it totally stopped. Even put in a brand new battery (yes, I even checked the charge). Unfortunately, there doesn’t seem to be a manual override for when the remote fails, so basically that’s 6 out of 8 useless outlets right there. SMH",
      "rating": 1.0,
      "verified": true,
      "author": "Unboxophile",
      "helpful_votes": 2,
      "publication_date": 20181202
    },
    {
      "title": "Prone to malfunction",
      "text": "It functions OK when it is working. The remote switch is kinda fiddly... it broke immediately when I first got it. Amazon quickly replaced the unit for me. After that it worked for 2 years, although the remote button sometimes requires me to fiddle with it to toggle the switch; that is not a well-made product. Today all of the remote-powered outlets stopped working completely. I've never had a surge protector where the outlets broke before... how bad does your product have to be to screw up something that basic? I will be searching for a replacement with another brand. Disappointing product.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Martin",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Don't buy this - or anything from Belkin",
      "text": "Do not buy one of these. Mine failed after 6 months. I called Belkin, and they validated my Amazon receipt. All good so far, right? No. Because Belkin said they do not have these anymore (they are on their website as \"coming soon\" for 33% less than I paid) and since they did not exist, they said \"We will give you $14.95 credit\". So I said \"let's use that toward something else\". Oh, sorry, you can't do that unless it costs less than $14.95. Have you ever tried to find anything useful on Belkin's website for $14.95 or less? So now I have a brick, I'm out $15, and Belkin doesn't care.",
      "rating": 1.0,
      "verified": true,
      "author": "TornadoTJ",
      "helpful_votes": 4,
      "publication_date": 20160705
    },
    {
      "title": "Shut Off  Socket",
      "text": "Greetings . . . I bought this socket to auto shut off heaters because they are very quiet & have been inadvertently left running when leaving the house . The socket timer does the auto shut off for 3 different time selections BUT the reason I subtracted a star is because the reset switch only functions as a toggle back On . If something happens & you need to leave earlier than planned , The switch does NOT function as an off switch . I think the cost of a switch that also functioned as an Off would only raise the price a bit & would be a better choice .",
      "rating": 4.0,
      "verified": true,
      "author": "knobe",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Four way comparison of grounded switches (lighted and non-lighted)",
      "text": "Pros: Good construction, name brand. Cons: Standard #1 Philips screws, but case needs to be pried apart to open. Comparison: Compared this to three other switches. The Belkin has a low intensity green light, can be used with a night light and non-distracting. The non-lighted variants will have less internal wiring, so that would be the benefit. Conclusion: For a lighted and grounded switch, I would recommend the Belkin. For a non-lighted grounded switch, I would go with the Leviton. The GE would work as well. Cannot recommend the Uninex due to quality issues.",
      "rating": 4.0,
      "verified": true,
      "author": "aTypicalEngineer808",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "One remote controls all other power strips",
      "text": "8 outlet with remote works great . The reason for my 3 star rating is that I bought 3 of them for different uses in my home not knowing that one remote will control all three outlets. So if I remotely turn off my computer which is plugged into one . My TV turns off and it is plugged into a different power strip. Same holds true for my bedroom lamps which are plugged into the third power strip. Turning off the bedroom lights with the remote also turns off the TV and the computer. They are almost useless to me.",
      "rating": 3.0,
      "verified": true,
      "author": "Rick7229",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Remote didn’t work, had to return it. Got a refund notice like 2 days later, QUICK!!",
      "text": "Got it and remote wouldn’t turn the power strip on, only off. Remote switch seemed like the problem, didn’t rock back and forth smoothly. Other than the remote function, power strip was nice and had a lot of room for plugs. Says it is made in USA, was happy about that but wish it had been tested at the factory before shipping it out. Seller was surprisingly fast about refund!! That also was nice",
      "rating": 3.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Great little gadget",
      "text": "Works as expected, really love the light that turns on when it is in use, so at night when I'm not using the appliance, I don't forget to turn it off, very useful. I've been an Amazon customer since 2015, and in that time, I've discovered that I rely mainly on reviews from the Amazon community when I'm deciding what to buy, so I always try to give my honest and unbiased review of anything I buy, so that people like me can make decisions based on their needs. That being said, if this review was helpful to you in any way, please click on the \"helpful\" button below. Thanks for reading!",
      "rating": 5.0,
      "verified": true,
      "author": "Captain Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Always trust Belkin great product",
      "text": "Love these belkin surge protectors with remotes. These are great for rooms without light switches, to plug in a floor lamp or anything you want to turn on when you come in the room. Also great for Christmas lights, we use this for our tree and inside decorations every year. Current have 6 of these. I would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Royib812",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Works as expected. Just what I needed for my home studio!",
      "text": "Wanted something that made it quicker and easier to power on and off my powered monitors and subwoofer in my home studio. This works perfectly for the job and I was also able to run my two 27\" HD monitors power and my audio interface through thru it as well to help cut down on energy use. Looking fwd to seeing my next electric bill. May not be a ton cheaper but anything less is just a bonus on top of the amazing convenience this power strip offers already.",
      "rating": 5.0,
      "verified": true,
      "author": "Dayne Stryker",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Great for resetting cable modem and wireless router remotely",
      "text": "I bought this to reset my cable modem and wireless router remotely. My Charter internet experiences frequent short outages that require unplugging my cable modem and wireless router for 15 seconds and then plugging them back in. These two devices are located upstairs and I'm usually downstairs. I plugged them into this surge and keep the remote Downstairs. It works perfectly, saving me countless trips, especially when it's a long outage requiring multiple on-off attempts. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "GeeBLateTop Contributor: Nail Art",
      "helpful_votes": 0,
      "publication_date": 20170612
    },
    {
      "title": "OK, but wears out quickly.",
      "text": "So I definitely owned this from Nov 27th 2015 up to March 29th 2017. In that time the Surge Protector worked admirably. It switched on, when I hit the remote switch and switched off when I switched it back. Powered all my devices as I needed. EXCEPT, last week there was a thunderstorm in my neighborhood. My apartment complex was hit with a lightning strike and as a result my Home Audio reciever blew a capacitor and now my HDMI audio/video input no longer woks on my reciever. I'm looking for a new surge protector now and I'm hoping to find something fairly soon as my replacement reciever is too expensive to replace easily.",
      "rating": 3.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "No manual off switch",
      "text": "While it works as promised, I find it annoying that it doesn't have an off switch. Does it kill them to use the same existing switch as an off switch like by double pressing or long press. If I want to turn off the attached device before the timer goes off, I have to unplug the cord and plug it back on to use the device again. I am taking two stars off for this oversight and sub optimal product design. Really.. it would have costed them like nothing to add this feature! I hope they read this and add it in their newer version.",
      "rating": 3.0,
      "verified": true,
      "author": "A. bukres",
      "helpful_votes": 3,
      "publication_date": 20161117
    },
    {
      "title": "Terrible design for my use",
      "text": "I purchased a coffee pot that doesn't have an auto off switch (stupid design on this also). So I purchased this device thinking I could accidently leave the coffee pot on and plugged into the device, then it would turn it off. This part does work. However, if I remember to turn on and off the coffee pot, when I want to turn on the coffee pot, I have to turn on the coffee pot, then press the button on the plug in device. You shouldn't have to do 2 things to turn it on. For that reason, I think it's a bad design.",
      "rating": 2.0,
      "verified": true,
      "author": "Seashells",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Still working 5+ years later",
      "text": "Appreciate that I can set the timer to limit the amount of time for charging electronics. Do wish that the timer settings were 1 hour/90 minutes/2 hours, or maybe 1 hr/2hrs/3hrs, and that the socket had an \"off\" button to easily stop charging when done. Sometimes electronics need more than 1/2 hour but less than 3 hours to charge, and the light is extremely bright in a dark room, so if one is trying to sleep then to turn it off it's necessary to unplug the whole thing. First-world problem, I know. Purchased this in June 2012 & it's still going 5+ years later (unlike a couple of other Belkin items I've purchased).",
      "rating": 4.0,
      "verified": true,
      "author": "idigapony",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "Does the job; nice quality, a pleasure to use, lighted switch.",
      "text": "Good quality. Has a nice lighted switch rocker, light is green in color and just bright enough, not overly bright. The light is on only when the switch is in the on position; otherwise there is no light visible. It has a nice click action, both tactile and audible, that feels good and is easy to switch. Build quality is solid. Item is pretty lightweight. I wouldn't mind if it wasn't so wide, but there must be some electronics stuffed inside or something.",
      "rating": 5.0,
      "verified": true,
      "author": "Reader",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "Great Idea from a Company With No Concern for Quality or Customer Satisfaction",
      "text": "Unfortunately, Belkin quality control is non-existant. I bought two of these; the first one lasted six months, then the remote control (and the front-panel \"Controlled outlet\" switch) stopped working. I replaced it. That one lasted six months, too. I suspect there is a defective relay inside because the green \"controlled outlet\" switch LED glows green when you turn it on, and fades back to dark over the next 3-8 seconds. You can't get inside, because they have those \"irreversible\" screws that won't let you unscrew them. So, Belkin gets one star (which is higher than any other Belkin product I've ever bought) because their products are pretty, offer desirable features, and inevitably fail.",
      "rating": 1.0,
      "verified": true,
      "author": "Carol Anne Ogdin",
      "helpful_votes": 0,
      "publication_date": 20150627
    },
    {
      "title": "Energy conservation product does not work",
      "text": "This is a great power outlet, but a HORRIBLE energy conservation product. It doesn't work at all. It worked for about 5 days, and then would work intermittently, and then the energy remote totally stopped working. I could not get any part of the product to work as a conservation product to work for my TV and things and I am very disappointed. I can no longer return this, and I am just sad about it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161123
    },
    {
      "title": "My light switch is now convienently located!",
      "text": "I have a room with no light switch. Now I have one. My lamp is plugged into the switched outlet. and my charger in the non-switched outlet. The only complaint is that I can't select a channel. I have 2 and putting the one in the living room on sometimes puts the bedroom one on.",
      "rating": 5.0,
      "verified": true,
      "author": "Skibum",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "not reliable. Be careful!!",
      "text": "This thing could be a potential fire hazard. It worked perfect for 1 a year and a half. I have many Belkin products that have been fine. The timer feature stopped working, green lights up but does not shut off power. It would work again for a few weeks and just fail again. I kept trying (3 strikes your out!!) thinking it was me... it was not. They should design this thing to default to NO power if the unit is not working. If you put it on something you want to make SURE turns off I would NOT recommend this device. Its in the trash now.",
      "rating": 1.0,
      "verified": true,
      "author": "diydiy",
      "helpful_votes": 2,
      "publication_date": 20160702
    },
    {
      "title": "Great Surge Protection and the ability to turn-off my external hard drives remotely",
      "text": "The one specific thing that drew me to this surge protector was the ability to switch off my external hard drives without having to unplug them or reaching behind the desk to turn off the surge protector at the switch. The wireless remote switch was exactly what I was looking for, providing me with the ability to locate the surge protector in a hidden location without having to worry about access. The short 4ft cord cut down on the tangled mess that is prone to every computer system, no matter if it is a laptop or a desktop. I have been using this Surge Protector for the past 10 months without problems. I would recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "kron45",
      "helpful_votes": 0,
      "publication_date": 20160316
    },
    {
      "title": "Remote works even without line of sight",
      "text": "Bought it for the remote function in attempt to prevent power adapters constantly warm and wasting energy and it's life. Remote works at living room distances. It even works when the power bar is inside of the cabinet and remote is somewhere outside without line of sight",
      "rating": 5.0,
      "verified": true,
      "author": "Julian L.",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Convenient Energy Saver",
      "text": "This little remote power strip is a dream come true! I love it. The range on the remote is good and it doesn't have to be pointed at the strip to turn it on. With the 2 always on ports this is a perfect strip to use with your entertainment center. Big Flat Screen TVs suck a lot of power (even when they aren't on) with this my modem is always on and I can turn the power to the TV, Playstation, and Gbox off when I'm not using it. I like that I can sit down and just reach over and have everything on and ready to use.",
      "rating": 5.0,
      "verified": true,
      "author": "S McQuirk",
      "helpful_votes": 0,
      "publication_date": 20150909
    },
    {
      "title": "Remote rarely works",
      "text": "I have owned this less than a week, and I already have to take the battery out and back in, and press the buttons HARD over and over to get the remote to work properly. The WHOLE POINT of this product is the remote. Avoid at all costs.",
      "rating": 1.0,
      "verified": true,
      "author": "Captain Internet",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Fantastic! Works great",
      "text": "Fantastic! Works great. I was concerned about negative comments about the switch/remote but we have had zero issues. Still works great. We use it in my boyfriends office at his workstation (he does computer repairs) We were concerned about all the computer stuff plugged up 24/7 leeching electricity so we decided to invest in one of these. We have the switch on the wall next to the light outlet so its easy to remember to turn it on/off when he's done. Our electric bill did go down but we also switched over to LEDS and other smart outlets at the same time, so I can't tell if this had an effect/how much, but every little bit helps I suppose.",
      "rating": 5.0,
      "verified": true,
      "author": "Darth Vader",
      "helpful_votes": 0,
      "publication_date": 20150529
    },
    {
      "title": "One of the best surge protectors available given the options it provides for the price",
      "text": "Pros - Lots of space for larger adapters - 2 outlets always on and 6 others can be turned on/off from the main unit and remote - Remote works a good distance away. I keep mine about 15 feet from the main unit and it works well. Cons - After a power outage the switchable outlets can only be turned back on initially from the main unit, not remote. That's my experience. I initially bought this with intent to move my entertainment items to a ceiling shelf next to my projector tv but decided not too. I'm glad I didn't.",
      "rating": 4.0,
      "verified": true,
      "author": "indub",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "No Way to Override Timer and Switch it Off",
      "text": "I like the concept of a simple timer, but expected that the same button that turns it on would also turn it off if I didn't want it to run the full length of the timer interval. In my case, it is plugged into a power strip which has a trip switch. Just touching the power strip switch momentarily cuts power and the Belkin outlet goes to off. Lucky me. Of course, if I had other things plugged into the power strip that I didn't want to cycle off, this wouldn't be a solution.",
      "rating": 3.0,
      "verified": true,
      "author": "SaidWhatWhen",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "9 years later, had to change the battery in the remote,",
      "text": "otherwise this has worked perfectly since i purchased it in 2011. I use this surge protector for my electronics and use the remote daily with no problems until last night when it failed to turn off the equipment. Replaced the battery and it again works fine. Thank you Belkin for a most useful and reliable product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Randomly turns off",
      "text": "The idea is really cool to be able to turn everything off when you leave the house, but the remote turns everything off randomly. It's annoying when you are in the middle of using things and it turns off.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "It works.",
      "text": "We use this (2 purchased) to control accessory devices on our TV (such as ROKU and XBOX) which do not need to be \"always on\". There are 8 possible channels so you can have different ones control different sets of devices. It works well. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Kent Morgan",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Super solid, really appreciate the light on the power switch!",
      "text": "It's great that you can stack two of these in the same 1-gang electrical outlet. Wish they didn't stick out so much to one side, but they feel solid and we really appreciate the light to show the switch is on - a must for kitchen appliances! All the bad reviews look like a different version of this, so hopefully these will hold up.",
      "rating": 5.0,
      "verified": true,
      "author": "Geoff",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Frankly the remote isn't good enough.",
      "text": "This power strip is fine. The remote that comes with it doesn't work well when in the holder/wall mount. Meaning it doesn't work. Even out of the holder it requires several times pushing it. Also the remote is hard to get out of the holder.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Works perfectly!",
      "text": "This works perfectly!! I bought it for, and use it with my electric blanket. The blanket has a 10 hour auto-off feature, but that's just for safety. It's normal for your body to cool down while you sleep, but I like being warm when I crawl into bed for the night. I set the timer for 3 hours and go to sleep. In 3 hours, the Belkin timer turns off the electric blanket and I've been sleeping much better. The unit is solid built and appears to be durable enough to last for years.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Swarthout",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Uses power to save power...",
      "text": "I try to conserve as much power as possible. My entertainment system is all hooked up to a surge protector that I use as a kill switch. This required me to reach into the inner recesses of cabling twice a day so I thought this device would make my life more convenient. On my kill-a-watt, with the switched outlets off and nothing connected to the always on ports, I'm still showing a .03 amp current where as manually switching my old surge protector showed 0. Unless my math is off, that results in an additional 32KwH per year, or enough to run my entire home for 3-4 additional days. I dunno, am I being crazy?",
      "rating": 3.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20150808
    },
    {
      "title": "Works as inteded. Unique timer design.",
      "text": "Excellent idea for a wall outlet timer. I use the 30 minute timer for a small fan for my shower. Unfortunately my master bathroom does not have an exhaust fan to prevent moisture build up that promotes mildew and mold growth so for a long temporary measure I am using the 30 minute timer to set a small fan aimed at my shower to dry up the standing water in the shower to prevent mold from forming. Works great! Just press the button on this timer and it will turn off after the selected time. No need to unplug the device or reset anything. When you need to start the timer again just press the button. Couldn't be easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "I love this thing",
      "text": "I've had mine for over two years when these were sold in stores and eighty bucks. I love mine and would highly recommend anyone else but this. It's a great way to reduce your electric bill. Just plug in your entertainment system or computers and mount the remote near the wall switch! You'd be amazed how much energy those things suck up when they aren't even on.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Clark",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Convenient item",
      "text": "Using this for light strings that are installed in a walk-in closet. Instead of plugging and unplugging, there is a convenient switch. Have multiple of those, some of them 7+ years old, still working fine. Happy with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Koelner",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "broken",
      "text": "so I've had this for almost a year and the first time the power is out and now the only part that works are the constant on outlets, the other 6 no longer work, too much money for something that broke this fast",
      "rating": 1.0,
      "verified": true,
      "author": "slo",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "May be a factor rebuilt unit.",
      "text": "Bought to replace one I had for 5 years and quit working.Got new from amazon the remote did not work so put new batterie in it would turn on but not shut off.So tried oil remote from 5 year old one and worked fine. Also the new one was in a plain brown box like it was a rebuilt unit.",
      "rating": 2.0,
      "verified": true,
      "author": "Les Boone",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Unable to complete warranty return",
      "text": "The timer worked as expected for 5 months, then became erratic and finally stopped all together. Getting Belkin to replace it under warranty has proven impossible. After jumping through all their hoops, they sent me a dead link to get an RMA. When I tried to create a user account to request an RMA - I got an \"OOPS! the page you requested doesn't exist\" message - after entering a page worth of information. For $10, it just isn't worth another hour of my time to try and get them to honor their warranty. I'll avoid buying Belkin products in the future.",
      "rating": 1.0,
      "verified": true,
      "author": "David C. So Cal",
      "helpful_votes": 6,
      "publication_date": 20140207
    },
    {
      "title": "Smart gadget.....",
      "text": "This is exactly what I was looking for. I don't use my desktop all that often so having the option to switch my computer and all it's gadgets completely off by cutting off the power supply works for me. The wireless on/off switch makes it a breeze to supply power when needed. There are also two outlets on this extension cord that is permanently on even when you have the rest of the outlets (6 of them) on the off position on the remote. The remote must be removed from it's case to get to the battery. It took me a while to realize this as it is not on the manual.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Mann",
      "helpful_votes": 0,
      "publication_date": 20150722
    },
    {
      "title": "This works pretty well. The remote is a little sensitive when ...",
      "text": "This works pretty well. The remote is a little sensitive when trying to turn things on; you have to push it down firmly even after you click it to the \"on\" position. The electrical contact in the remote must have a little play. But it's responsive and great that you can have some devices that always receive power, and some that can turn off by the switch. I'm glad I bought it. Just wish the remote switch felt as robust as a regular light switch.",
      "rating": 4.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20160301
    },
    {
      "title": "Remote control surge protector short lifespan",
      "text": "Remote controlled surge protector worked great for seven months then some of the remote controlled outlets stopped working completely. I'm disappointed on the life of this product. I love the design and it worked great until now and it's useless to me. I would not purchase this exact product again or recommend it to a friend. I'm also confused and disappointed in the reviews on this item being for a number of items sold by this company. It makes it very difficult to know how well reviewed a specific item really is.",
      "rating": 2.0,
      "verified": true,
      "author": "K. Read",
      "helpful_votes": 0,
      "publication_date": 20170117
    },
    {
      "title": "Works great!",
      "text": "Tried smart power strips before, but they were pretty flaky in operation. We use this device to power off the power-hungry \"media unit\" on our older but otherwise excellent plasma TV in a spare bedroom. This unit has been extremely reliable and the large wireless power switch works very well. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Perfect for use with a hot glue gun.",
      "text": "I use this with my hot glue gun for wood adhesive and sealing packages. I used to forget to unplug the glue gun all the time so this is super useful, energy efficient and a lot safer. Turning it on and adjusting the timer duration is really simple, especially if you have it plugged in somewhere easy to reach like a counter-height outlet or extension cord.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara T.",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "I returned the first and was again hopeful that it was just a bad plug, the second was the same",
      "text": "I really wanted this to work. It was the simplest timer I could find. I needed it to shut off my dehydrater at exactly 6 hours. Twice I woke up to it still running 9 hours after starting. I returned the first and was again hopeful that it was just a bad plug, the second was the same. 4 overdone batches of jerky later I’m done trying with this thing. I found a 24 hour type that was 3 bucks and works exactly how I needed it to.",
      "rating": 1.0,
      "verified": true,
      "author": "Lorrie andrews",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Wireless switch - reduce unwanted power usage",
      "text": "This is perfect for a family room entertainment unit. Turns off the tv and other devices which don't need to be \"ON\" during the night, or other times when not in use. Reduces power usage!",
      "rating": 5.0,
      "verified": true,
      "author": "BK",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Jan Davis review",
      "text": "This is the best product! We all do this get halfway to work and worry if we turned off heating appliances. I use this for my favorite curling rod/brush. My hair always needs a little touch up after I dry it. I set timer on 15 minutes and 1/2 hour down the road, I don't have to worry whether I unplugged it or not!. I also sometime use a small fan heater to take the chill off a room, often in the morning when I am not as alert. My commute is over an hour it's great not to worry that I need turn around to go check that it is off.",
      "rating": 5.0,
      "verified": true,
      "author": "davisjan",
      "helpful_votes": 0,
      "publication_date": 20170126
    },
    {
      "title": "Working fine, bulky design",
      "text": "Working great, but Belkin should spend some money to hire some decent product designers. Smaller is better. Plus the idea is awkward to use. It must be plugged into the wall, and then the appliance plugged into it. You have to reach the outlet each time you use it. You have to plug it into an extension cord to get it to where you can reach it. Pretty messy. Good idea, needs work.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Ross",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Easy way to limit appliances from running all day while you're at work.",
      "text": "**UPDATE**: The timer intermittently stopped cutting power after 6 months of use. Once the button was pressed to turn it on, it stayed on forever until it was unplugged. NOT a graceful failure. Graceful failure would've been not powering on at all, instead of leaving potentially unsafe appliances to run forever. Works great for my dryer! Something went awry with my dryer and it no longer shuts itself off predictably, leading to fears that it might burn the house down while left on all day long. No longer! If the dryer malfunctions and keeps going, this will limit the time it stays on. Simple solution to a problem that would probably require a much more expensive repair otherwise.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff D",
      "helpful_votes": 0,
      "publication_date": 20140926
    },
    {
      "title": "I use this in my home office to turn off ...",
      "text": "I use this in my home office to turn off my monitors, lamp, and little desk items. The switch is fairly accurate, mine fails to register every 15 or so switches. I just flip the switch again when this happens. When power is lost you have to push a button on the power strip to get the remote switch working again. That is the only downside to this really.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Claiborne",
      "helpful_votes": 0,
      "publication_date": 20170126
    },
    {
      "title": "This works great!",
      "text": "This thing is great. It works exactly as expected. I use it in my mobile DJ setup to turn off and on several dance floor light fixtures that are usually set up on the opposite side of the floor as my DJ booth. This way I don't have to run DMX cable, and the fixtures work better in sound active mode anyway. So when the bride and groom are having their dance, I can turn off the psychedelic lights, but then when the guests start hitting the dance floor, I can turn them back on. This lets me have lights on both sides of the dance floor, and still be able to control them from my DJ booth. Win win!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20141008
    },
    {
      "title": "Failed after working for 3 years.",
      "text": "My Belkin socket worked well for about 3 years, then it would not shut off. I called Belkin. They said, \"that's ok\". I said no it isn't. I expected more than 3 years from the device. They also told me it was discontinued, even though I could see that it was still offered for sale on their web site. I am happier with a competing product I also bought on Amazon, which is the \"Woods Import - Digital Countdown Timer\". I plan to buy another one to replace the failed Belkin, which it outlasted. I'm also considering the \"Simple Touch C30004 the original Auto Shut-Off Safety Outlet, Multi Setting\".",
      "rating": 3.0,
      "verified": true,
      "author": "John L. Ryder",
      "helpful_votes": 0,
      "publication_date": 20150422
    },
    {
      "title": "Love the wi-fi controllers.",
      "text": "I love the wi-fi remote controllers. However, it's important to know that there can be cross talk between different controllers meant for different surge protectors. Luckily there is a way to get around that by setting a different channel frequency for a specific surge protector/controller pair. The downside is that the unit is overpriced.",
      "rating": 4.0,
      "verified": true,
      "author": "hyacinth2007",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "work great, ordering more",
      "text": "Have had two of these for a few years now. I love having them on our laser printer (in the basement and we leave it off most of the time), box fan, on tool battery chargers, ski boot driers, and space heaters. One got smashed in a bag and the button would no longer click. I dissembled it and was able to bend the plastic switch back into place. I am coming back to order a couple more so I don't have to keep switching them around. I have run at 1200w heater with none of the melting issues others have seen. My heater des have a thermostat and so it is not drawing 1200w constantly.",
      "rating": 5.0,
      "verified": true,
      "author": "TN Cook",
      "helpful_votes": 0,
      "publication_date": 20160131
    },
    {
      "title": "too bulky",
      "text": "belkin confirmed that a surge protector cannot be connected to this conserve socket so it is impossible to connect more than one device to this socket. also, this is very bulky; it is meant only for the top wall socket. this is a problem for me because i use this to charge my electric toothbrush in the restroom but the only outlet in the restroom has a cabinet above it so i have to put it on the bottom socket. this covers the top socket which makes it completely useless. there is also no way to cancel the charge once it has started aside from unplugging the entire device. besides these issues, the conserve socket works well.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Saechao",
      "helpful_votes": 14,
      "publication_date": 20101221
    },
    {
      "title": "Very pleased.",
      "text": "Bought these for a fan next to the bed. Exactly what I needed. While they only have three choices of setting times (1/2 hour, 3 hours or 6 hours) it works for me. Note you can't turn them off using the \"on\" button before the setting time expires - you need to unplug them or the device. I am planning to buy a couple more to use in the home workshop - one dedicated for the soldering iron.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim T.",
      "helpful_votes": 2,
      "publication_date": 20160915
    },
    {
      "title": "Just the thing for those of us that can't remember to turn things off",
      "text": "This little timer is great. I now have three and I use two on my laptop power supplies and one on my subwoofer. The large, but not obtrusive, green light is easy to see and you can quickly tell when its on. This works great for those things that are just around that we don't think much about turning off. I put a <a href=> Kill-o-Watt power meter </a> on it and its true -- when its off, its off. No power drain at all. Eventually these things will pay for themselves in electricity savings and save me repairs on stuff that I used to just leave on all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Munchiniwa",
      "helpful_votes": 0,
      "publication_date": 20130323
    },
    {
      "title": "Best surge protector",
      "text": "Indispensable. This is the best surge protector out there I ever bought ... Got 5 in apartment. Saved $$ on electricity immediately. Electric company sent letters asking if apartment was still occupied. Two outlets on all the time - good example: entertainment area (*TV & Cable plugged vs other accessories turned off via switch when not in use) ... Using in Kitchen and bedroom with on/off switch nearby in arms length for simple appliances using electricity only when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Consumerist",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "I've bought these at least three times because I keep ...",
      "text": "I've bought these at least three times because I keep finding uses for them. The latest are as safety timers for my wife's curling irons and for the clothes iron in case people forget to unplug them. She used to call to see if I was still home to check to see if she forgot to unplug the curling irons, and sometimes had done so. We now know they won't be on more than 1/2 hour at a time at most. I wish they'd drop the lime green back and make it the same off white as the front, but I'll endure the color because this is such a simple, effective product.",
      "rating": 5.0,
      "verified": true,
      "author": "Shines",
      "helpful_votes": 0,
      "publication_date": 20150614
    },
    {
      "title": "My wife finds that omission pretty irritating but not so irritating as to not use ...",
      "text": "These timers do the job of turning off power after a specific elapsed time. There is a button at the top that allows the user to turn the unit on. The complaint I have is that the button cannot be used to turn the unit off. Once the unit is turned on, the only way to turn it off before the scheduled time has elapsed is to unplug the unit. My wife finds that omission pretty irritating but not so irritating as to not use it..",
      "rating": 4.0,
      "verified": true,
      "author": "gb",
      "helpful_votes": 0,
      "publication_date": 20161222
    },
    {
      "title": "Nice while it lasted...",
      "text": "It works. It's awesome. Able to use it in my garage to add extra overhead lighting without having to rewire. Update: after three years the device quit working with the remote. The outlets controlled by the remote still worked, but you could only turn them on and off with the manual witch on the power strip. Changed batteries on remote and tried everything to get it to work again, but the strip just wouldn't take anything. It was nice while it lasted...",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "Great battery charger timer",
      "text": "Using some battery chargers, the chargers will not shut down when the battery reaches a full charge. Overcharging a tool battery can shorten its usable life. Most batteries will reach a full charge in three hours and this timer fits that time parameter. I use it in order not to overcharge my various Harbor Freight batteries, as it is set for 3 hours. It works as it is suppose to work. An hour setting would make this count-down charger perfect but the 1/2 hour setting is workable for batteries that require only one hour rapid charge.",
      "rating": 5.0,
      "verified": true,
      "author": "Eugene Kasper",
      "helpful_votes": 0,
      "publication_date": 20150604
    },
    {
      "title": "Terrible product",
      "text": "I had one of these that worked for awhile and then stopped. Before it stopped I had ordered two more. One of them didn't work at all out of the box. I returned it. The other one was inconsistent from the start. Now after about a month it has stopped working altogether. The return time expired Feb. 10, 2019. Terrible product, save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Doug Sturm",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Great -- as long as there's no interference with the remote's signal",
      "text": "With the remote control, this is a convenient way to turn off things that don't really turn off, like TVs and other modern electronics. However, after about 18 months, the unit has started turning itself on and off. Likely, there are some radio signals interfering with whatever channel the remote is on.",
      "rating": 3.0,
      "verified": true,
      "author": "Phreaddy",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "So when my son completes a task I can easily turn it back on with just a button and ...",
      "text": "I have purchased two now. I am the mother of an autistic boy and I hooked the tv up to this. Now he has to ask for the tv and only gets 30min. I wish I could set it to 15min. I just have the tv plugged into it. So when my son completes a task I can easily turn it back on with just a button and whatever he was watching on netflix is still there. :) Bought a 2nd one for myself for the powerstrip my hair products are plugged into. This way they never are left on. I plan to get another for my sons electric train because he leaves it on.",
      "rating": 5.0,
      "verified": true,
      "author": "CClady",
      "helpful_votes": 0,
      "publication_date": 20160407
    },
    {
      "title": "Great To Prevent Overcharging Mobile Phone Or Tablet Batteries",
      "text": "In the past, I'd been guilty of putting my electronics on a charger and sort of forgetting about them. With modern battery minder software, I've found that this behaviour can shorten battery life (in terms of number of charge cycles it will tolerate before it starts to degrade the number of hours the electronics will run untiil another recharge is needed). Using this little gem, you can pick from 3 different charging times and be assured that you won't walk away and come back after a few days and find your battery full charged (... but secretly a little fried). It's a bit pricey, admittedly, but it's better than having to get a battery replaced prematurely.",
      "rating": 5.0,
      "verified": true,
      "author": "VoxS",
      "helpful_votes": 0,
      "publication_date": 20140306
    },
    {
      "title": "Great solution for a straightener without auto shut-off",
      "text": "Too many times I have driven away from my house with the nagging question \"Did I turn off my straightener?\" Since I love my straightener and didn't want to spend $50+ on a new one, this Belkin Conserve Socket was the best solution. It has three \"conserve\" options, the shortest time limit being 30 minutes. You just plug it in and push the grey button on the top to get the electricity flowing, and it shuts off at the selected time period. It's been reliable turning off at the set time and has given me peace of mind. Even if I accidentally leave my straightener on, I know the Belkin Socket will cut off its power soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Musselman",
      "helpful_votes": 0,
      "publication_date": 20140408
    },
    {
      "title": "Terrible device",
      "text": "The remote stopped working on Day 2. The idea is great but the switch is pretty janky and feels like cheap plastic. I wouldn't recommend this to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Naomi Tan",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "the device works very well and is very easy to use",
      "text": "Once it's properly set up, the device works very well and is very easy to use. The documentation doesn't clearly indicate that the remote switch is inserted into a protective, rubberized sleeve. The reason this is important is that the user has to remove a protective plastic \"block\" before the device becomes fully functional. The package comes delivered in its original box, not in a protective envelope. The seal on my package was broken on delivery. It didn't seem as though the contents were opened or damaged, but it's disappointing that the seal was so flimsy.",
      "rating": 4.0,
      "verified": true,
      "author": "Handsome Seagull",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "Worked for a while",
      "text": "I purchased two of these and they worked well for a while then the switches stopped turning them off and on. The batteries in the switches were good and I made sure they were set with the channel on the power switch. I decide to go with the Belkin conserve power strip with the master outlet that shuts everything off when the master is turned off. I put my air purifier as the master because it doesn't draw any watts in the off position and my tv draws 11 watts turned off. I recommend the Belkin Conserve Master Power Strip over this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140817
    },
    {
      "title": "Perfect",
      "text": "I'm originally from Australia where all of our wall outlets have their own on/off switches. When I moved to the US I was surprised to see the outlets here don't have them. An on/off switch makes sense - you can turn something off without unplugging it. Not only is that less wear and tear on the plug and wall socket, it is also safer - less risk of being shocked or electrocuted. It can also save you money by cutting off any standby power the plugged in device may be using. This little device solves all of that. I have been using them for almost 2 years and love them. No problems to report. They just work.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140527
    },
    {
      "title": "Fantastic product!",
      "text": "This product is fantastic if you ever need to place a surge protector in an area that is not easily accessible, but don't want to run up your electric bill by leaving it drawing power 24/7. It is also nice that it does provide a couple outlets that have constant power, so you don't have to cut power to everything, but can stop drawing power for items that you don't need on all the time. I use this for my home office and absolutely love that at night and on the weekends I can use the remote to cut power to my work computer and other electronics. Well worth the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Boca375",
      "helpful_votes": 0,
      "publication_date": 20140216
    },
    {
      "title": "Try it out first",
      "text": "I bought this to use with a towel warmer. However, after 14 hours of using it (following directions) with cell phones, iPads, and other small devices, I discovered that it NEVER automatically turned off at the end of a designated time period. I contacted Belkin product support; all the steps I had taken using the product were correct. I was instructed to return the socket. It would be a good idea to try this socket in a controlled situation before leaving it on, unwatched, with an appliance. My experience may well be the exception; I have used many other Belkin products successfully.",
      "rating": 1.0,
      "verified": true,
      "author": "Cecelia Lange",
      "helpful_votes": 0,
      "publication_date": 20150305
    },
    {
      "title": "Great For My Kitchen!",
      "text": "I live in an old building where some of the wiring is still ye olde fabric coated stuff, which makes me nervous. I don't like to leave much plugged in and potentially drawing power when I'm out, so I use this for my microwave. It looks nice, and the little green light makes it easy to see when it's on. Great for kitchen use. I have it plugged into the top outlet and there's plenty of room for another plug below it (although maybe not for a bulky square ac adapter plug).",
      "rating": 5.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20150125
    },
    {
      "title": "This destroyed my coffee maker. Initially thought it was ...",
      "text": "This destroyed my coffee maker. Initially thought it was a coincidence. The coffee maker was only 4 years old. It happened on the 4th or 5th time I used the device. Bought a new coffee maker. With the old coffee maker was always turning the Belkin on last, usually after realizing that the coffee was not happening. With the new coffee maker turned the Belkin on first. When I turned the coffee maker on its light flickered several times. Then plugged the coffee maker straight into the outlet. No light flickering. It would be one thing if the Belkin failed always in the on position, that would have be okay. But don't need its failure destroying devices.",
      "rating": 1.0,
      "verified": true,
      "author": "Leroy G.",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "Really cool innovation",
      "text": "This switch, does its job. It make easy to turn off electronics that you don't use in the moment without having the power switch at the sigth of everyone. You can connect the things one time, hidde the switch and basically forget that is there. The remote works great (don't forget to configure the remote and the switch in the same frecuency). Just one detail, it is a big switch, it doesn't looks like in the photos but is big, like other power switches with more plugs, but nothing that cannot be addapted. Great Quality, if by chance you get the extra discount (some times they drop the price by 15-20%) don't doubt to buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Gustav",
      "helpful_votes": 0,
      "publication_date": 20120730
    },
    {
      "title": "May run into issues with the switch.",
      "text": "This worked well for me for about a year before I started having problems with it turning itself on. I would turn it off, and after a random period of time, it would turn back on despite the switch still being in the off position. Here's what I found out. If you change it to a different channel using the switches, it will start behaving normally again. I did this, and haven't had a problem since. Hopefully it will stay that way! I just wanted to let people know in case they run into this problem.",
      "rating": 3.0,
      "verified": true,
      "author": "Nate",
      "helpful_votes": 3,
      "publication_date": 20130325
    },
    {
      "title": "Two Units Defective",
      "text": "I purchased two of Belkin's Conserve Socket Power Timers. They came in one day! Kudos to Amazon for their amazing Prime shipping speed. Unfortunately both of the timers are defective. They have a green LED that is supposed to light up when the start button is pressed and stay on during the countdown. For both of mine, this light came on only when the start button was being pressed. As soon as I lifted my finger off the start button, the LED light went out. I telephoned Belkin and they said that both units are defective. It is of concern that both had the same problem right out of the box. I'm not sure that I want to order replacements.",
      "rating": 2.0,
      "verified": true,
      "author": "diyfan2010",
      "helpful_votes": 2,
      "publication_date": 20120626
    },
    {
      "title": "Great For A Technivorm Coffeemaker!",
      "text": "I bought this for my Technivorm Coffeemaker, which doesn't have an automatic shut-off feature, but makes great coffee. I knew about this deficiency before I bought the coffeemaker and thought that I would be smart enough to shut it off, until I forgot to turn it off during a weeklong vacation. I was pleased to find this product. I will echo others in saying it would be nice to be able to adjust the time or have additional options, but leaving the unit on for 30 minutes sure beats leaving it on for 7 days!",
      "rating": 5.0,
      "verified": true,
      "author": "Baxter",
      "helpful_votes": 0,
      "publication_date": 20140816
    },
    {
      "title": "So VERY useful!",
      "text": "I have this plugged into a power strip beside my bed, and it's SO useful. Almost all my \"must be recharged\" devices (my phone, my tablet, my Kindle) say not to leave the device plugged in after it's recharged. And yet, the best time for me to recharge them is while I'm sleeping, and *nothing* takes 8+ hours to recharge. Now I just set the Belkin socket at 3 hours and alternate nights charging my phone or my tablet, and I'm not as worried about frying out my batteries by leaving them plugged in for so long. It's exactly what I needed, and I'm thinking of giving some to my more pragmatic friends as stocking stuffers this Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "Yvonne Jocks",
      "helpful_votes": 0,
      "publication_date": 20131025
    },
    {
      "title": "No More Worries About Leaving Small Appliances Unattended",
      "text": "I purchased this product for my wife to use at her dressing table. Since most small appliances are not equipped with an auto-off feature, I wanted something that she would use for her beauty appliances (e.g., heated rollers, curling iron.) Way too often, we would leave and house, and she had doubts as to whether she had unplugged her beauty appliances. Back to the house we went to check the appliances. No more return home trips since she received the Belkin socket. She loves it, and I now have peace of mind. I would recommend this item to anyone who has appliances that are not equipped with an auto-off feature.",
      "rating": 5.0,
      "verified": true,
      "author": "Bernard Lenortavage",
      "helpful_votes": 0,
      "publication_date": 20140612
    },
    {
      "title": "Purchase to SAVE Money",
      "text": "Absolutely worth the purchase. Think of how many items are plugged in that you are paying the electric co for that you are not using. Yes if it's plugged in & turned off you but you are still paying the electric co.This allows you to set a timer for 30 mins 3 hrs or 6 hrs and will shut off automatically and the electric to the product. Now you are not paying the electric co. Press the button when you want to use it. Save money. Is their really a decision to be made? Yes the decision is how many will you purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 0,
      "publication_date": 20160220
    },
    {
      "title": "Scents Galore",
      "text": "Neat little gadget. For reasons I won't go into here, I no longer burn candles. I am now burning oil in an electric warming pot. Unfortunately I have not been able to find one with an automatic shut-off switch, so every time leave the house I have to remind myself with a note taped to the door to unplug my oil warmer. This outlet saves the day. There are 3 settings -- 1/32 hour, 3 hours an 6 hours. Just set the time, push the button and enjoy your aroma therapy. If you want to leave the house before the timer has expired, just unplug the warmer from the outlet. No more worrying about my oil burning dry.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Queen",
      "helpful_votes": 0,
      "publication_date": 20140426
    },
    {
      "title": "No more getting upset at my wife and daughter",
      "text": "I purchased \"Belkin Conserve Socket F7C009q Energy-Saving Outlet's\" as \"surprise gift's\" for my wife and daughter. The reality is that I was worry about curling irons/straightening irons remaining turned on after they were done and the respective fire hazard. These devices were very easy to use, no tools necessary, and both my wife and daughter were happy that I ordered them. They use the 30-minute setting, which is activated by simply touching the button on top. I would have liked the option to remain on for 45 minutes or one hours (for other purposes) versus 3/6 hours, but these met my purpose.",
      "rating": 4.0,
      "verified": true,
      "author": "Gamer",
      "helpful_votes": 0,
      "publication_date": 20140224
    },
    {
      "title": "At least I won't burn the house down now",
      "text": "I went to work with my hair straightener left plugged in one too many times, so I bought this to prevent myself from setting the house on fire. It does exactly what I need it to do, the only downside is that it melted a little when I put it away next to the straightener when it was still a little hot.",
      "rating": 5.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Just Awesome",
      "text": "This product is awesome and I am already recommending it to all my friends. I just bought a new phone, so I was getting into the habit of waking myself up in the middle of the night to see if it was charged so I could disconnect it. Now, I can just hit the top bottom and sleep through the night- which is greatly appreciated. Also, unlike some of the other timers, this one looks good on the wall outlet It's modern and looks cool. (It's also nice to know that it is completely shutting the current off so as not to \"ghost\" energy- something I'm sure my charger was doing as it stayed plugged in all day)",
      "rating": 5.0,
      "verified": true,
      "author": "Coccia90",
      "helpful_votes": 0,
      "publication_date": 20130916
    },
    {
      "title": "Great switch to turn on/off items at the plug.",
      "text": "I use this to power external hard drives for my computer. They work great. We power a lamp in the bathroom with another switch. Very convenient. Well made, the switch lights up when the power is on. It would be nice to have a different color to see the switch in the dark, but it is in no way a deal breaker.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny D. Hobbs",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "Died after 3 years",
      "text": "I don't know...is that a good \"life' for an item like this? Apparently the on/off switch on top was \"fried.\" Could have been a power surge since it doesn't have a surge protector feature. Until this happened, it worked fine for the 3 hour timer on our heated towel bar, which we use to dry towels and avoid mildew.",
      "rating": 3.0,
      "verified": true,
      "author": "Super Sue",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Works great for timers and surge protection",
      "text": "These are great, have several around house. We use one on our coffee maker. Set the side slide switch to 3 hr, then in the mornings just press the on button make coffee. After the 3 hr time, power if cut off coffee maker, protecting it from surge and running all day. Use these on all kinds of devices so you don't forget to unplug or turn off while protecting devices from surges too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jdmath",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "Saves Worrying for Us!!",
      "text": "Last year, we bought a great coffee maker - does what we want. Unfortunately, the coffee maker does not use any internal timer. The Belkin release of this simplified timing device does the job, without error. It's a perfect choice for busy families with crucial electric components that could end up damaged or destroyed. Please make certain of the maximum Amps needed or used by the devices you intend to use, first. Simply read the values from the plate information; or, write the model numbers, part numbers & visit the manufacturer's website. Then, test it out some weekend; and you'll find safety means worry-free.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Tomer",
      "helpful_votes": 0,
      "publication_date": 20130612
    },
    {
      "title": "Great idea, needs a couple usability tweaks.",
      "text": "I love these things, especially for controlling window fans to cool my house as I don't have air conditioning. I also use one for a space heater in the bathroom, which eliminates costly \"oops, left it on\" incidents. Two needed improvements: * Need an obvious way to tell the timer to start over, either with or without moving the time setting. I don't know if pressing the button does this or not, so I unplug and replug it. * Need to be able to command early shutoff, e.g. by holding down the button. If it had those features it'd be a 5-star product. I'm happy with mine, though!",
      "rating": 4.0,
      "verified": true,
      "author": "A Student",
      "helpful_votes": 0,
      "publication_date": 20130626
    },
    {
      "title": "Useful until it fails - not for safety-critical applications",
      "text": "I've used mine for both a water distiller and a lotion warmer. It failed after three years of use. Unfortunately it fails in the \"on\" mode so half an hour becomes \"permanently on\". If you're thinking of using this for anything where \"always on\" could cause a danger, do not use this product. I just ordered another one because nothing else seems to have a half hour timer and the lotion warmer won't cause a fire if it's left on.",
      "rating": 3.0,
      "verified": true,
      "author": "Bill McGonigle",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "Great to use with battery chargers, coffee makers",
      "text": "Now got three of these. They are perfect for battery chargers (I've got several in the garage for different power tools). These warn not to leave the battery in the charger once it is charged. I leave the chargers permanently connected via the Conserve Socket (normally with the 3hour timer), and just press the button. Battery will be charged when I next want it, with no worries about overcharging. The only negatives - as others have said, I wish it had an 'off' button (only way to turn it off early is to unplug it). The LED could also be a little brighter (sometimes tough to see in bright sunlight with the garage doors open).",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Hill",
      "helpful_votes": 0,
      "publication_date": 20130321
    },
    {
      "title": "They're a little tacky because they stick out from the wall a little more than I thought and would like. Still probably worth it",
      "text": "Seems to work okay with some outlet plugs, but 1/4 ORDERED DOESN'T FIT ANY PLUG IN MY WHOLE HOUSE. I think maybe just a defect so I'll be sending it back for a replacement. All four arrived slightly scuffed which made me think maybe the one that doesn't work was used, but couldn't be the case since package was sealed. I don't mind the slight scuffs though. They're a little tacky because they stick out from the wall a little more than I thought and would like. Still probably worth it if it actually helps my electric bill.",
      "rating": 4.0,
      "verified": true,
      "author": "shopper",
      "helpful_votes": 0,
      "publication_date": 20140807
    },
    {
      "title": "Perfect small size uses only one outlet",
      "text": "I put this on my exercise weight machine that does not have any on/off. Normally it just stays on unless you unplug it from the wall. This little switch works great. No more plugging in the machine before workout and unplugging afterwards. The little toggle switch on the side of this switch box is easy to get to and easy to toggle on/off. I will be buying another one for my elliptical machine as well, since it goes to sleep when not in use, but also does not have an on/off. Why let the machine waste power in sleep mode? Using one of these will save some electricity.",
      "rating": 5.0,
      "verified": true,
      "author": "Vegas Ross",
      "helpful_votes": 0,
      "publication_date": 20130908
    }
  ],
  "product_meta": {
    "title": "Belkin 8-Outlet Conserve Switch Surge Protector with 4-Foot Cord and Remote, F7C01008q,White",
    "description": "Style:Energy Conserve Surge with RemoteBelkin Conserve Switch - Energy Saving Surge with Remote (F7C01008q)\n\nFROM THE MANUFACTURER\nThe Belkin Conserve Switch Surge Protector with Remote lets you control power to your whole computer system with a single click. The included wireless remote makes it easy to shut off power--including standby power--to up to six devices at once, such as your computer, monitor, printer, external hard drives, speakers, and more. Additionally, two Always-On Outlets stay on for devices that need continuous power, like your router or cordless phone. Place the remote on a desk or shelf, or use the included wall mount.\n\n\n\n\nF7C01008 Conserve Switch\nSurge Protector with Remote\nAt a Glance: * Wireless remote lets you control from up to 60 feet away\n   \n   \n * A single click eliminates power to 6 remote-switched outlets\n   \n   \n * 2 Always-On Outlets for devices that need continuous power, like routers\n   \n   \n * Includes wall mount for wireless remote\n   \n   \n * 1-year limited warranty; $100,000 equipment warranty\n\n\n\nWith the Conserve Switch, you'll easily reduce power consumption and save on energy costs.\nView larger.\n\nUp to six devices can be controlled by the wall-mount remote switch. Save Energy with a Single Click\nA typical household spends an average of $30 per year by leaving computer system devices on but not in use.* The Conserve Switch Surge Protector helps to eliminate wasted power and to keep your electronics well-organized and protected. The included wireless remote has a 60-foot range and does not require a line of sight to the surge protector. Eight Versatile Surge-Protected Outlets\nThe Conserve Switch offers a total of eight surge-protected outlets, six of which are switchable and two that are always on. This means that you can connect up to six devices that can be controlled by the remote, and two devices that will always stay on. The Always-On Outlets are useful for devices that require a constant flow of energy, such as routers, alarm clocks, cable modems, or DVRs.\n\nFor easy operation, the Conserve Switch features a re-settable circuit breaker, a \"not grounded\" light to indicate when a ground is not present, and a manual override button to control switched outlets. It also protects sensitive electronics from power spikes or surges with 1000 joules of surge protection.\n\nSmart Space-Saving Design\nThe Conserve Switch has a slim design that saves space. A sliding safety cover on every outlet provides added protection, and a cable management system keeps cords neat and organized.\n\nSave Even More with Conserve\nFor greater convenience and energy savings, you can place additional Conserve Switch units throughout the house and control them all with a single remote.\n\nThe Conserve Switch Surge Protector is backed by a limited one-year warranty and a $100,000 connected equipment warranty.\n\nAbout Belkin's Conserve Products\nBelkin Conserve products help you to do your part by making it easier to reduce your energy consumption.\n\n*Calculation based on a computer, printer, scanner, monitor, external hard drive, and external speakers on, but not active, for 20 hours per day, at $0.117 cost per kilowatt hour. (Sources: U.S. Energy Information Administration;U.S. Department of Energy).\n\nWhat's in the Box\nBelkin F7C01008 Conserve Switch Surge Protector 8-Outlet, wireless remote switch (battery included); remote switch wall mount; and user's guide [PDF].\n\nCertified Frustration-Free Packaging\nAmazon.com has certified this product's packaging is Frustration-Free. A Frustration-Free Package is easy-to-open and comes without excess packaging materials such as hard plastic \"clamshell\" casings, plastic bindings, and wire ties. It is exactly the same as a traditionally packaged product--we've just streamlined the packaging to be opened without the use of a box cutter or knife and will protect your product just as well as traditional packaging during shipping. Products with Frustration-Free Packaging can frequently be shipped in their own boxes, without the need for an additional shipping box. Learn more.\n\n\n\n\nConserve FamilyF7C016 Power Switch\nF7C005 Insight Energy Use Monitor\nF7C007 Smart AV Auto-Off Surge Protector\nF7C009 Socket Power Timer\nF7C008 Valet Smart USB Charging Station\nF7C01008q Conserve Switch Surge Protector\n\"Cut power with the flip of a switch\"\n\"Find electricity wasters\"\n\"A powerstrip that turns off when your TV turns off\"\n\"It's a timer for your energy\"\n\"A home for your mobile devices\"\n\"Remote-controlled surge protector\"\nFeatures: * Cuts power completely to reduce energy costs\n * Easy-to-see illuminated switch\n * Lets you leave cords plugged in without drawing power\n\n\nFeatures: * Helps Make Better Energy Decisions\n * Customizable for Different Electric Rates\n * Tracking Feature monitors actual usage\n\n\nFeatures: * Compatible with all TV brands\n * Simple Setup\n * 1080 joules of surge protection\n * Works with satellite/cable boxes\n\n\nFeatures: * Easy to Set\n * Saves Energy\n * Keeps Home Safe\n\n\nFeatures: * Charges 4 devices\n * Shuts off automatically\n * Frees up wall outlets\n * Reduces clutter\n\n\nFeatures: * Wireless remote with mount\n * Save energy and eliminate standby power\n * 6 wirelessly controlled outlets\n * 2 always-on outlets for satellites and DVRs\n\nUses:\nElectric grill, coffee maker, clothing iron, heater, all electric items\n\nUses:\nTV, stereo, microwave, heater, all electric items\n\nUses:\nTV, DVD player, stereo, cd player, cable/satellite box\n\nUses:\nSpace heater, curling iron, electric toothbrush, etc.\n\nUses:\nCell phones, mp3 players and mobile devices in general\n\nUses:\nTV, DVD player, DVR, stereo, cable/satellite box",
    "rating": 4.4,
    "feature_bullets": [
      "Control power to your whole computer system with a single click",
      "The wireless remote switch lets you shut off power-including standby power - to up to six devices at once: your computer, monitor",
      "Two Always-On Outlets stay on for devices that need continuous power, like your router or cordless phone",
      "4 foot cord length",
      "Ships in Certified Frustration-Free Packaging",
      "Place remote on a desk or shelf, or mount it on the wall - 60 foot range; line of sight not required"
    ],
    "specifications": {
      "Product Dimensions": "15.4 x 6.3 x 2.2 inches",
      "Item Weight": "1.68 pounds",
      "Manufacturer": "Belkin Inc.",
      "Language:": "English",
      "ASIN": "B003P2UMNK",
      "Item model number": "F7C01008q",
      "Customer Reviews": "4.4 out of 5 stars1,256 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#243 in Surge Protectors",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 15, 2010"
    },
    "categories": [
      "Accessories & Supplies",
      "Electronics",
      "Surge Protectors",
      "Power Strips & Surge Protectors"
    ],
    "price": 31.19
  }
}