{
  "website_summaries": [
    {
      "verdict": "Sleek modern home for your betta fish that will look great on your countertop or in your office.",
      "pros": [
        "These cool little fish \"hotels\" can be stacked atop one another to provide multiple separate homes for your fish",
        "The outer shell of this tank can be detached and painted to match your decor",
        "Tank made from glass"
      ],
      "cons": [
        "The design partially obstructs your view of the fish",
        "There is also a lidless model, which is not best for all environments"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Cool for you. Uncool for fish.",
      "text": "This was just one of those things that looks cool and interesting but when you get it. It's just dumb. You can't see the fish at all. No light really gets in the bowl. And it's really small. And my fish died a week after being put in this. So....yeah. Overpriced too for a gimmick.",
      "rating": 1.0,
      "verified": true,
      "author": "Kent M Koren",
      "helpful_votes": 161,
      "publication_date": 20180110
    },
    {
      "title": "cool, chic tank",
      "text": "This tank is not big enough for a fish!! Do some reading on tank and fish size before purchasing this. I use it for holding to keep my betta while I clean his 5 gallon tank or it can be used as a medicine tank as well if your fish gets sick. It should not be used for daily living!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 793,
      "publication_date": 20160701
    },
    {
      "title": "Better for a house plant",
      "text": "Got this for a beta, never had one prior to this. Not any room for them to move not to mention no filtration. Went and got him a 5 gallon tank with a filter and a light for less money and now he can actually move around. So now this is being used for a house plant.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 99,
      "publication_date": 20180108
    },
    {
      "title": "my 9 year old was very disappointed..",
      "text": "Too small for the price...my 9 year old was very disappointed...her beta only have a small tank to swim in.",
      "rating": 2.0,
      "verified": true,
      "author": "Tangerine",
      "helpful_votes": 10,
      "publication_date": 20171230
    },
    {
      "title": "Shipped with broken glass. Sent back and got a ...",
      "text": "Shipped with broken glass. Sent back and got a different one with a filter. Now I can see how wrong keeping a fish in this kind of tank would have been.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 6,
      "publication_date": 20180601
    },
    {
      "title": "Needs improvements",
      "text": "Looks cool, but I ordered one item and received 3 so I returned the other two. The one I kept had a leak so I had to return that as well... I ended up buying another kind of fish tank, with more water capacity.",
      "rating": 3.0,
      "verified": true,
      "author": "Halini Brune",
      "helpful_votes": 3,
      "publication_date": 20180216
    },
    {
      "title": "Stylish Tank!",
      "text": "Our Beta fish seems comfortable, made sure to add an item that provide some protection from the turbulence our small filter provides. Water evaporates fast, important to add water that is the same temp as tank water.",
      "rating": 5.0,
      "verified": true,
      "author": "John Thomas",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "it's pretty small. unless you have minnow",
      "text": "it's pretty small. unless you have minnow, this won't be big enough for your fish. i just have one small gold fish, but i feel like it needs more room. it's pretty though.",
      "rating": 3.0,
      "verified": true,
      "author": "tribey",
      "helpful_votes": 2,
      "publication_date": 20180605
    },
    {
      "title": "Fun Fish Tank",
      "text": "I love this little fish tank. Not only is it original and fun, but you can purchase more and stack them. It is very easy to clean and the handles make it easy to carry as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Crissy",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Satisfied",
      "text": "Exactly what I hoped it would be like looks just like pics good size to still be able to clean out in the sink easy we use for beta fighting fish...super cool for the kids.. stackable AND perfect size to get a heater not too small for not cooking said fish",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Kline",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "It was a disappointment: ( it is extremely cheap looking on both ...",
      "text": "It was a disappointment :( it is extremely cheap looking on both glass container and plastic cover. Also the item description on capacity is totally off. Glass container is ONLY ONE gallon big, not 2 gallons. Though the pictures look great and design was so modern, I returned the received item.",
      "rating": 1.0,
      "verified": true,
      "author": "Sonia J",
      "helpful_votes": 8,
      "publication_date": 20170922
    },
    {
      "title": "Fish apartment",
      "text": "This is like a modern little apartment for your fish. My son has a beta & it works perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "DqDaly",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "A bit on the small side but nice",
      "text": "It’s as described. Nice looking, just a tad smaller than I had wanted. It’s a one fish only place.",
      "rating": 4.0,
      "verified": true,
      "author": "NewMom",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Luv this modern fish tank!",
      "text": "Luv this Modern fish tank! Purchased a beta fish and she seems to be very happy!",
      "rating": 5.0,
      "verified": true,
      "author": "KT",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Cute Little Fish Box",
      "text": "Super cute little fish box. Nice design, but that nice design reduces light. I appreciate the handles for carrying and moving the box. Not two gallons. Seems to hold a little less that one gallon of water. Overall, I really like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Thack",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Cute idea",
      "text": "It was a gift and I am not sure if it is being used or was liked by the recipient.",
      "rating": 3.0,
      "verified": true,
      "author": "Kassandrawitha_k",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "It’s ok",
      "text": "Child was very excited, thought it would be cool. Am barely see fish in the holes.",
      "rating": 2.0,
      "verified": true,
      "author": "Cap",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "aquarium",
      "text": "well built. Easy to add a filter. I use for baby guppies.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Larsen",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Exactly as described",
      "text": "My college daughter absolutely loves this tank in her dorm room! She can’t wait for her roommates to get one so they can connect them!",
      "rating": 5.0,
      "verified": true,
      "author": "heidi Otterman",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Really modern fish tank",
      "text": "Great little beta fish tank. Works perfectly and looks super sleek and modern. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Loreleib",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Beautiful in person",
      "text": "Love it! It's so modern an stylish makes me wanna buy more fish just to get another aquarium! Perfect in size! Quality on point!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Craven",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Even cuter in person",
      "text": "My 15yr old daughter loved it. She made a new home for her fish right away.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Fish bowl with style",
      "text": "\"Bubbles\" the betta fish loves his ultra-modern minimalist fish condo. Looks great on the coffee table!",
      "rating": 5.0,
      "verified": true,
      "author": "L. MCGUFFIN",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Best fish tank for betta",
      "text": "Love how it looks and that it can be stacked. It matches my home’s modern decor and everyone who sees it wants one too.",
      "rating": 5.0,
      "verified": true,
      "author": "Aymi Lau",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Room for 1 available",
      "text": "This fish hotel is awesome it’s a nice size and very nice look!",
      "rating": 5.0,
      "verified": true,
      "author": "April Harris",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Cracked tank",
      "text": "Nice fish hotel. Got it in July, used it in September and it leaked. Glued it and it still leaked. Tried return it, can’t get anybody!",
      "rating": 1.0,
      "verified": true,
      "author": "nancy williams",
      "helpful_votes": 6,
      "publication_date": 20171028
    },
    {
      "title": "look better in picture than real life - not worth it.",
      "text": "There's really nothing special about it after receiving the item. At first I thought it looks rather modern and stylish for a decoration... the quality wasn't that nice. you can really see the fish in the tank, for its price it's not worth it. i ended up paying a little bit more and got the fluval tank, which look so much better and more functional as well. dont waste your money on this thing",
      "rating": 2.0,
      "verified": true,
      "author": "LCT",
      "helpful_votes": 3,
      "publication_date": 20140121
    },
    {
      "title": "The mirrored glass will freak your fish out!",
      "text": "I love the look of it, however, my fish freaked out from the mirrors and jumped out twice trying to escape. I even covered the top and he jumped out the side holes. Now I'm stuck with this tank to use as a decoration. If the \"windows\" were normal Plexiglas or glass I think he would have loved it and I would be happy as well. I also think that a cover should be an option for those that have other pets (particularly cats).",
      "rating": 3.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 6,
      "publication_date": 20170904
    },
    {
      "title": "2 bowls leaked",
      "text": "Returning our second FishHotel as BOTH leaked. We transferred the fish into a full tank the day before we left on a week long trip. We returned a week later to find the fish swimming in inches of water! Terrible product. Pain in the a*& to have to do two returns.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Spencer",
      "helpful_votes": 42,
      "publication_date": 20130404
    },
    {
      "title": "Trendy, but High Maintenance",
      "text": "I like the look of the tank, but it's a hassle having to clean it every week. Therefore, I purchased a 1-3 gallon water filter, but the tank was not deep enough for the pump. Now half of the pump is out of the water, which is a slight eye sore, but at least I don't have to clean the tank again (maybe). By the way, I had to purchase this item twice because the first time, the glass tank did not fit inside the white frame. The second time, the glass fit, but there were minor scratches to the glass and the white frame was dirty.",
      "rating": 3.0,
      "verified": true,
      "author": "Ray V",
      "helpful_votes": 9,
      "publication_date": 20110902
    },
    {
      "title": "Too Small Tank",
      "text": "Bought this tank for son for his gold fish. Cute to look at but not practical for use. The actual water tank is about 7\" x 7\" x 6\" (dimensions given in descriptions are for the outside decorative carrier) and you are told not to fill it completely so this is a very small tank...less than a gallon. Too small for the gold fish. Too small for a filter. Too small for the calculations for water chemicals. Windows in condo are also too small to really see a fish swimming around. Would not recommend to friends.",
      "rating": 2.0,
      "verified": true,
      "author": "DDAVIS",
      "helpful_votes": 8,
      "publication_date": 20111227
    },
    {
      "title": "Cute",
      "text": "I bought this without even owning a fish and can’t wait to get one. It’s made well and is true to the picture.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Drafahl",
      "helpful_votes": 3,
      "publication_date": 20180719
    },
    {
      "title": "Very Chic but no Cover",
      "text": "This is a great little aquarium that is super modern and chic. It's absolutely not meant for any fish but a betta, but provides plenty of space for those little beauties. The only issue I have with this tank is that there's no little cover for the top of it. There should be a little plastic cover with holes for air circulation but alas, nope.",
      "rating": 4.0,
      "verified": true,
      "author": "Claire Poirot",
      "helpful_votes": 3,
      "publication_date": 20110616
    },
    {
      "title": "This tank is the perfect size for a betta",
      "text": "This tank is the perfect size for a betta, as long as you are filling it to the top. I'm not sure why other reviewers are so frustrated with the tank when the specifics of size are so clearly listed. My betta is extremely happy and began creating bubble nests almost immediately. It really is a lovely tank and fun for you and your little fish to peak out at each other through the windows. This tank offers a nice amount of privacy for the demeanor of this fish. I have 5 small moss balls and a hollow hiding log wish seems to create a nice environment for my happy little betta.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 4,
      "publication_date": 20180714
    },
    {
      "title": "Looks good, feels cheap.",
      "text": "This is a unique product that looks pretty cool in our master bedroom. It is very thin, however, and feels a bit cheap. I'm afraid I'm going to break it when I have to clean it. But, we have had it for a year and it still looks good and is in one piece.",
      "rating": 3.0,
      "verified": true,
      "author": "FlyingLyon",
      "helpful_votes": 0,
      "publication_date": 20131205
    },
    {
      "title": "Fish style",
      "text": "I love the look of this fish \"bowl\". The only difficulty I have is when I have to clean it. Not easy to empty the water without getting it all over the frame. I do love the \"handles\" and the little rubber stops on the bottom so it does not scrape the furniture.",
      "rating": 4.0,
      "verified": true,
      "author": "Marianne Solomon",
      "helpful_votes": 9,
      "publication_date": 20110128
    },
    {
      "title": "Decorative",
      "text": "This is a nice decorative piece. To put your goldfish or any type of fish in",
      "rating": 5.0,
      "verified": true,
      "author": "Arleen Forbes",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Great!",
      "text": "I really love the tank! I read reviews first- to find out there werent actual \"rooms\" so thankfully I wasnt expecting that. (maybe I was silly for expecting that?) When you first pull it out you may think- aw its feels kinda cheapy- but afer you set it out- you realize it looks awesome. I really lov eit. The top portion of the tank sort of acts as handles- so the actual tank/water part doesnt go up that far. I'm not sure if I would ever \"Stack\" them. I'm sure it would be fine- but I would worry that if I bumped it, it wouldn't stay together. Could look SUPER cool- but I am too clumsy for that!",
      "rating": 5.0,
      "verified": true,
      "author": "LawyerK",
      "helpful_votes": 44,
      "publication_date": 20110429
    },
    {
      "title": "impressed!!",
      "text": "Today my fish hotel was delivered! The box it came in was huge! I opened it up, and to my surprise it was MUCH larger than i thought it would be! Its sturdy and stable. A GREAT accent piece for the home! MY fish hotel will be used as a cake topper for our wedding! I plan to paint it key lime green, im really impressed with my purchase! Plus i did the super saver option and my order was shipped the morning after it was placed! Really excited to use it on the big day! Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "ak",
      "helpful_votes": 5,
      "publication_date": 20130212
    },
    {
      "title": "Cool design but too small for betta fish",
      "text": "Very cool design. Sleek and modern. But the fish hotel is too small for a Betta fish. Once the tank is filled with water, it is less than a gallon. Not enough room for a Betta to swim around. I also wish it had more cut-outs for viewing. Ended up purchasing a 5.5 gallon tank and going to use the fish hotel as a terrarium.",
      "rating": 2.0,
      "verified": true,
      "author": "Donna S. Fitzgerald",
      "helpful_votes": 4,
      "publication_date": 20130327
    },
    {
      "title": "Fish Hotel",
      "text": "The fish hotel is very neat looking although I wish there was some kind of a cover for the top of it. I also don't like that it's hard to clean out because it's hard to get the glass tank out of the white design.",
      "rating": 3.0,
      "verified": true,
      "author": "abbbbbbeeeeeey",
      "helpful_votes": 5,
      "publication_date": 20110119
    },
    {
      "title": "Great look/Maybe not so practical",
      "text": "I have owned it for a few weeks and have a few fish in it, it's good quality and looks great. A lot of people complain about the size, but it appears to me to be larger than any standard glass fish bowl I have ever been sold at a pet store as a kid. My only complaint is that one of my twin solar flare sword tail fish jumped out over night and was dead on the kitchen floor. So it you have jumpy fish this is not the best choice.",
      "rating": 3.0,
      "verified": true,
      "author": "LaurenM",
      "helpful_votes": 2,
      "publication_date": 20130919
    },
    {
      "title": "Multi purpose",
      "text": "These are marketed as a fish bowl, but I used it to house a couple of aloe plants. The clear portion can be removed and used without the white exterior, or because of the open \"handles\" on the side, it's possible to stack these with additional boxes. Simple, easy to use, sturdy, modern, decorative and multi-functional",
      "rating": 5.0,
      "verified": true,
      "author": "Sara R.",
      "helpful_votes": 35,
      "publication_date": 20160518
    },
    {
      "title": "Four Stars",
      "text": "Very cool fish tank, but no lid covering to stop my kitties from eating them.",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20140816
    },
    {
      "title": "Luv luv this",
      "text": "I bought this fish hotel for \"the love of my life\" for his birthday present b/c I thought it was cute & chic without going over board on the spending$$$. Let's just say I luv it so much that I plan to buy this for my 2 BFFs for their B'day and for myself!",
      "rating": 5.0,
      "verified": true,
      "author": "Saint",
      "helpful_votes": 4,
      "publication_date": 20140225
    },
    {
      "title": "Super Cute",
      "text": "I think I had originally saw this in a magazine, and thought it looked really cute...I was excited to find it on Amazon and then when it came, it was exactly what I was hoping for. I didn't realize that you could purchase 2-3 of these and stack them together - what a great idea. Now we just need to get a fish...",
      "rating": 5.0,
      "verified": true,
      "author": "SC",
      "helpful_votes": 10,
      "publication_date": 20111230
    },
    {
      "title": "Very Stylish!!",
      "text": "Very Stylish, easy to clean and gives space to the fish! The Beta fish loves swimming around in it. Better than drab breakable bowls!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20130116
    },
    {
      "title": "Cool and contemporary",
      "text": "I purchased this product as a gift, and the recipient absolutely LOVED it. Easy to clean, fits just about anywhere. It not only provides a home for your fish, but it also serves as a decorative piece. Kudos to the inventor!",
      "rating": 5.0,
      "verified": true,
      "author": "Natalia Galeano",
      "helpful_votes": 4,
      "publication_date": 20110919
    },
    {
      "title": "My goldfish love modernism",
      "text": "I adopted 2 goldfish from my kids' preschool class. The thing I don't like about keeping fish is how the tank looks. I love the fishotel. I wish I was small enough that it could be my home! I guess I'd have to have gills, too... anyway. It is sort of small, but so cool looking. Easy to clean.",
      "rating": 4.0,
      "verified": true,
      "author": "Leigh F. Feather",
      "helpful_votes": 2,
      "publication_date": 20130523
    },
    {
      "title": "Pros, but cons",
      "text": "I love the tank. However. It has the tendency to grow mold around the edges. Amazon being the amazing company it is sent us a new one but it does the same thing so I dont know if I'd recommend it ricking your lil fish getting sick...",
      "rating": 3.0,
      "verified": true,
      "author": "Johnna Hyde",
      "helpful_votes": 8,
      "publication_date": 20170621
    },
    {
      "title": "Otherwise it is a cool concept.",
      "text": "I purchased this as a gift. I watch as it was set up. I should have read to dimensions. It is small. Otherwise it is a cool concept.",
      "rating": 3.0,
      "verified": true,
      "author": "xoxoxo",
      "helpful_votes": 3,
      "publication_date": 20150111
    },
    {
      "title": "Very Modern and Cute",
      "text": "I have this in black and white and this looks great in my new modern/contemporary living room. It looks great with my new leather furniture.",
      "rating": 5.0,
      "verified": true,
      "author": "Proc Girl",
      "helpful_votes": 3,
      "publication_date": 20111221
    },
    {
      "title": "Awesome",
      "text": "The fish hotel is awesome, by daughter loves it. It even has handles to carry it easily.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Dionne",
      "helpful_votes": 13,
      "publication_date": 20101003
    },
    {
      "title": "Fish Condo",
      "text": "Wish I had read the reviews first! Yes, it is very modern & sylish. But not practical. I spent extra money for clip on LCD lights and decided to put it all in the closet & buy another tank when I saw how cloudy the water was in 2 days and still would have had to purchase air filters! Nice concept...but think it through, the next time, Teddy!",
      "rating": 2.0,
      "verified": true,
      "author": "Kanike",
      "helpful_votes": 5,
      "publication_date": 20110823
    },
    {
      "title": "Hotel fish tank",
      "text": "We bought the hotel fish tank off amazon for christmas,and we love evrything about it.It's excactly as described.Contemporary,true white,perfect size for a desk {which is where we have ours next to a window} Easy to clean everyone who see's it comments how cute it is.Amazon has the best prices on this, even better than ebay!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 6,
      "publication_date": 20120112
    },
    {
      "title": "Leaky tank!",
      "text": "This tank arrived and we were pretty happy. Well....no longer....it leaked all over our counter. This tank is poorly made and not properly sealed. We are very dissatisfied with this product. Do not buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Tom S Keener",
      "helpful_votes": 13,
      "publication_date": 20160408
    },
    {
      "title": "It's really fun. Wish it was a little bigger",
      "text": "It's really fun. Wish it was a little bigger, but it's nice. Left the fish stickers on it, because they're so cute. A little trickier to keep clean they a round bowl, or one that's not inside a shell like this is, but I'd order it again.",
      "rating": 4.0,
      "verified": true,
      "author": "PACZ",
      "helpful_votes": 0,
      "publication_date": 20150217
    },
    {
      "title": "Love the concept",
      "text": "The tank started leaking after about a week so I had to get rid of my fish. I however put colored rocks in the bottom of the tank and some motive candles looks awesome that way :-)",
      "rating": 3.0,
      "verified": true,
      "author": "Matthew Hathaway",
      "helpful_votes": 0,
      "publication_date": 20140427
    },
    {
      "title": "Great Unless You Have A Cat",
      "text": "It is very nice and looks fantastic. Unfortunately, our cat turned it into a fresh seafood raw bar. We then put a cover over it but lost another fish. We finally realized that the cat was putting his paw in until the top as the openings on the side are not glass - they are cut open. I do love the bowl but not that much. They need some type of simple netting attachment for those of us with cats.",
      "rating": 3.0,
      "verified": true,
      "author": "MBD",
      "helpful_votes": 12,
      "publication_date": 20120406
    },
    {
      "title": "love them",
      "text": "make quite a statement. a little awkward feeding the fish in the lower tank but nothing too horrible.",
      "rating": 5.0,
      "verified": true,
      "author": "Ev",
      "helpful_votes": 6,
      "publication_date": 20100925
    },
    {
      "title": "Good",
      "text": "bought it as a present from my younger brother who has two goldfish. pretty much same space as a regular fish bowl. He likes it. cool design. only problem: wish it was a bit bigger especially for price. no leaks or problems thus far with the bowl and we've been using it the last three months. our fish are jumpers, but havent made their way out of this one thus far.",
      "rating": 4.0,
      "verified": true,
      "author": "James the VI",
      "helpful_votes": 4,
      "publication_date": 20120308
    },
    {
      "title": "Love",
      "text": "Great fish tank lots of compliments!!! Can't wait to get another fish tank and stack it..thank u very much ok",
      "rating": 5.0,
      "verified": true,
      "author": "Quilt Corral",
      "helpful_votes": 0,
      "publication_date": 20131002
    },
    {
      "title": "5STAR Fish Bowl Condo Resort",
      "text": "This is a great simplistic durable product. The glass aquarium slides into the condo shell which allows for multiple units to be stacked together. Fish love it. Great for home, office n school.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth",
      "helpful_votes": 4,
      "publication_date": 20110713
    },
    {
      "title": "very happy",
      "text": "The \"fish home\" offers plenty of space for the fish to swim around and is well designed to make caring for the fish a breeze. I would highly recommend this to anyone who is interested in this.",
      "rating": 5.0,
      "verified": true,
      "author": "st",
      "helpful_votes": 8,
      "publication_date": 20110119
    },
    {
      "title": "Fun alternative to the glass bowl or plastic box tank",
      "text": "This is a nice alternative to the plastic cases sold at the pet shop down the street and much more unique than the standard glass bowls. Sturdy insert so I am not concerned about leakage or cracking ... very glad we purchased it for our pet beta \"whale\".",
      "rating": 5.0,
      "verified": true,
      "author": "andthensome",
      "helpful_votes": 6,
      "publication_date": 20111102
    },
    {
      "title": "The coolest Mod home for your beta",
      "text": "My beta, Roberto Cavali, absolutely LOVES his new home! This is the best designed fish-bowl that I have ever seen.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelatida",
      "helpful_votes": 5,
      "publication_date": 20110523
    },
    {
      "title": "Roomy fish tank.",
      "text": "This fish bowl is awesome. I ordered this last Saturday on the 22nd and received it yesterday 8/27 I'm so happy, it's so convenient since it has the handles and its not slippery when I lift it to move it to a different place. My fish was so happy in it, it's not small at all for him, I will be ordering another one soon for my next fish.",
      "rating": 5.0,
      "verified": true,
      "author": "Heade Acosta",
      "helpful_votes": 4,
      "publication_date": 20150828
    },
    {
      "title": "Loves it!",
      "text": "I love this product! It is stylish and functional. My Beta loves it too. It is a huge tank, a little bigger than I thought but it a great size for him. I attached an old light I had from another beta bowl and it looks amazing! Thank you, well worth the cash, and super fast shipping!",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 3,
      "publication_date": 20120430
    },
    {
      "title": "Great beta bowl",
      "text": "I got two of these and am very happy with them. There is plenty of space for a fish and plant and it's easy to feed the fish in the bottom tank through a top cutout, even while they are stacked. I got them in white and they look great. I think black might be too dark (would be hard to see the fish) unless you have a really sunny window to put them in.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 7,
      "publication_date": 20111112
    },
    {
      "title": "Looks Great",
      "text": "I should have read the ad more clearer as there is no lid, but it looks great and I'm happy with it!",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Kaschull",
      "helpful_votes": 0,
      "publication_date": 20140121
    },
    {
      "title": "umbra fishhotel aquarium",
      "text": "Not too much to say;but; it takes up too much space. It is nice but not convenient to stack up and try to feed or clean. It has a lot of wasted space for my taste. The frame is very bulky",
      "rating": 2.0,
      "verified": true,
      "author": "pat houseknecht",
      "helpful_votes": 2,
      "publication_date": 20111103
    },
    {
      "title": "My sister loves it...",
      "text": "Gave this as a Christmas gift, my sister is a fish fanatic and loves seeing her fish in fancy digs like this! Only problem was the first one arrived broken, so make sure little ones don't rush to open the box (broken glass!). Amazon replaced it without a problem. Overall, it is a quality product that is great for fans of aquatic life.",
      "rating": 5.0,
      "verified": true,
      "author": "MedicBill",
      "helpful_votes": 2,
      "publication_date": 20140129
    },
    {
      "title": "Modern / Contemporary - love it",
      "text": "Love it! *** I would like to know because they’re stackable, if I purchase another will there be an open space in between for my beta to breathe?",
      "rating": 5.0,
      "verified": true,
      "author": "Cara",
      "helpful_votes": 2,
      "publication_date": 20180620
    },
    {
      "title": "very cute!",
      "text": "Love this fish tank/bowl.. Can't wait to get a few fish for it. Came exactly as pictured. You will love it Just want to edit my review. As much as I love this bowl I have yet to buy a fish for it because your pretty limited to beta fish and I hear I need a lid for the bowl so it doesn't jump out. Last thing I want is to come home with the fish on the floor... A little Leary about it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lets be real..",
      "helpful_votes": 0,
      "publication_date": 20140209
    },
    {
      "title": "Looks cool",
      "text": "My Beta fish loves this. Looks like a condo. Get lots of compliments. As far as fish bowls go, this is the best looking in my opinion...",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 4,
      "publication_date": 20111026
    },
    {
      "title": "I have a happy fish",
      "text": "I'll be honest, My co-worker and I bought this with the assumption that the fish would have actual rooms to swim in. But it doesn't. It's a glass box that fits down into the plastic crate. That disappointment aside, it's a neat fish box. Everyone loves looking at it at work. And it holds a gallon of water perfectly-which is a nice amount of a betta (you really don't want less than that). All in all, I'm quite happy with it. Now I just need to find a couch for my fish and we're set :)",
      "rating": 5.0,
      "verified": true,
      "author": "Zombiedottie",
      "helpful_votes": 33,
      "publication_date": 20110228
    },
    {
      "title": "Fun! Not functional",
      "text": "I love this tank the only thing it needs is a filter. I constantly Have to change the water! Worth the buy! And It looks great on a desk!",
      "rating": 4.0,
      "verified": true,
      "author": "Brandon Wilkins",
      "helpful_votes": 3,
      "publication_date": 20140104
    },
    {
      "title": "Five Stars",
      "text": "I put this in my office and everyone loves the look",
      "rating": 5.0,
      "verified": true,
      "author": "Phu Nguyen",
      "helpful_votes": 2,
      "publication_date": 20141125
    },
    {
      "title": "So cool, I ordered this for my niece and she ...",
      "text": "Product arrived as promised and was exactly what I ordered. So cool, I ordered this for my niece and she loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Shria  Tomlinson",
      "helpful_votes": 0,
      "publication_date": 20150814
    },
    {
      "title": "So cool! We used it for our fish and then ...",
      "text": "So cool! We used it for our fish and then once he died we use it as a carrier for our turtle - every person that has come to our house says what I cool tank!",
      "rating": 5.0,
      "verified": true,
      "author": "learningtoloveonlineshopping",
      "helpful_votes": 0,
      "publication_date": 20141118
    },
    {
      "title": "Great design, the handles are a nice feature",
      "text": "Big hit as a gift for my beta loving niece. Great design, the handles are a nice feature. Came on time and packaged well.",
      "rating": 5.0,
      "verified": true,
      "author": "epJackson",
      "helpful_votes": 3,
      "publication_date": 20180104
    },
    {
      "title": "Highly satisfied!",
      "text": "Very cool looking fish bowl. Betta seems to love it....looks stylish in my modern home.",
      "rating": 5.0,
      "verified": true,
      "author": "R & M",
      "helpful_votes": 0,
      "publication_date": 20140906
    },
    {
      "title": "... I bought the fish because it was just so beautiful. I get compliments on it all the time",
      "text": "I actually bought this before I bought the fish because it was just so beautiful. I get compliments on it all the time; such a cute little fish tank that also works as an accessory piece",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170711
    },
    {
      "title": "Looks modern and cool.",
      "text": "Big enough for a Beta or a couple small goldfish. Looks modern and cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin02",
      "helpful_votes": 0,
      "publication_date": 20150507
    },
    {
      "title": "Beta fish prefer to be in aquariums by themselves so if she would like to get another beta fish it would be doable ...",
      "text": "Fast shipping. Purchased for daughter to put her beta fish in. Beta fish prefer to be in aquariums by themselves so if she would like to get another beta fish it would be doable because these aquariums are stackable & therefore wouldn't take up much space. By adding an extra aquarium it would really make it look like a hotel. Aquarium is also easy to clean & you can decorate the outside if you like. Daughter loves it because it's very unique.",
      "rating": 5.0,
      "verified": true,
      "author": "KristaBelle",
      "helpful_votes": 3,
      "publication_date": 20171226
    },
    {
      "title": "We love this. Great modern look I wanted and our ...",
      "text": "We love this. Great modern look I wanted and our beta likes it too. At first he was a little discolored-- maybe in shock because he was unfamiliar with his new home, but he has been back to his regular color and happy since he adjusted. Pretty easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Hirte",
      "helpful_votes": 0,
      "publication_date": 20151012
    },
    {
      "title": "Love this!",
      "text": "Came swiftly on prime, no cracks or dents or anything. \"Windows\" are a good size and the glass is great quality. There is a slot on top where I can insert food and my betta fish can breathe. Each cube only holds a little over 1 gallon of water, which is a little small for my betta fish (i was hoping for 2 gallons as was listed). Also, the bottom is clear, not frosted, so I'm anticipating some problems with the male betta fish (they charge if they see another male).",
      "rating": 5.0,
      "verified": true,
      "author": "RB",
      "helpful_votes": 12,
      "publication_date": 20170730
    },
    {
      "title": "It's simply amazing however there were a few small issues..",
      "text": "I would give it a five star however it did arrive with stickers on it and it smelt terrible so I had to wash but otherwise it's absolutely amazing!",
      "rating": 4.0,
      "verified": true,
      "author": "Destini L.",
      "helpful_votes": 2,
      "publication_date": 20170927
    },
    {
      "title": "Five Stars",
      "text": "A very unique idea for a gift. This is supercool!",
      "rating": 5.0,
      "verified": true,
      "author": "Annette P. Feie",
      "helpful_votes": 2,
      "publication_date": 20150213
    },
    {
      "title": "but its a cool idea.",
      "text": "I wish they has different colors, but its a cool idea.",
      "rating": 4.0,
      "verified": true,
      "author": "Raymond Perez",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Five Stars",
      "text": "expected the glass to go all the way to the top... : (",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "An attractive home for your fish",
      "text": "I've had this awhile now. I wish I had such a nice home. It has never leaked, is easy to clean and gets many compliments. My only complaint is that if you have a fish that is suicidal, he just may be able to jump to his death. It would be nice if Umbra would design a clear cover to prevent this from happening. When I had a Betta, I did put a bit of plastic w/small holes on top for added safety as he was a jumper.",
      "rating": 5.0,
      "verified": true,
      "author": "seven seas",
      "helpful_votes": 3,
      "publication_date": 20151129
    },
    {
      "title": "A great size for a betta and stylish too",
      "text": "A great size for a betta and stylish too. You can't see the fish all the time of course, but he gets some privacy too that way.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaylan",
      "helpful_votes": 2,
      "publication_date": 20140830
    },
    {
      "title": "pressie",
      "text": "she just loved her pressie and her fish a very happy. service was quick and efficient thanx for every thing.",
      "rating": 5.0,
      "verified": true,
      "author": "mutchie",
      "helpful_votes": 0,
      "publication_date": 20131219
    },
    {
      "title": "Five Stars",
      "text": "Looks great it's not to small for a single betta mine is happy",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Four Stars",
      "text": "My fish died as soon as we transferred him to this aquarium but it looks really cool",
      "rating": 4.0,
      "verified": true,
      "author": "jahnainicole",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "I have one beta fish and he seems to enjoy it. I clean it weekly",
      "text": "I have one beta fish and he seems to enjoy it. I clean it weekly. The glass is kind of thin and feels delicate but I haven't had any issues with leakage or cracking yet. It's a very stylish aquarium.",
      "rating": 4.0,
      "verified": true,
      "author": "Janay Wheeler",
      "helpful_votes": 2,
      "publication_date": 20160717
    },
    {
      "title": "Wish it had a lid. Not just for fish!",
      "text": "If it had a clear lid, and if the glass container went all the way to the top, I'd give it 5 stars. I created a small mossery (mossarium) in this and it looks very nice!",
      "rating": 4.0,
      "verified": true,
      "author": "Tom G.",
      "helpful_votes": 12,
      "publication_date": 20141002
    },
    {
      "title": "One Star",
      "text": "Continues to kill the fish, even after it was cleaned.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe Hallahan",
      "helpful_votes": 5,
      "publication_date": 20150211
    },
    {
      "title": "Five Stars",
      "text": "The fish hotel is very clever and my granddaughter loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170625
    }
  ],
  "product_meta": {
    "title": "Umbra 460410-660 FishHotel Unique Glass 2 Gallons Mini Aquarium Tank Bowl for Goldfish Betta Glofish and Small Fish perfect as Home Business Birthday Gift Ideas, White",
    "description": "The Umbra Fishhotel Mini Aquarium is an ideal starter fish tank - an award-winning cool, modern home for your finned friends such as bettas, goldfish, and other small fish. Modelled after contemporary condominium apartments, this reinvented aquarium features a sleek white shell with assymetrical windows. Individual units can be stacked to create a condo effect. Small glass bowl is removable for cleaning. Measures 7-1/2 inches by 7-1/2 inches by 8 inches and holds 1.8 gallons of water. Designed by Teddy Luong for Umbra - original, modern, casual, functional, and affordable design for the home.",
    "rating": 4.5,
    "feature_bullets": [
      "Glass and ABS Plastic 1.8 Gallons Mini Aquarium",
      "WOW EFFECT - Stackable fish tank with striking modern minimalistic design. Can stack multiple FishHotels for tall condo apartment-like appearance. Detachable outer shell can be painted to match your home or office decor",
      "EASY TO CLEAN - ABS plastic façade and asymmetrical windows surround a glass bowl, removable for ease of cleaning",
      "FOR SMALL FISHES - Perfect glass aquariums for small tropical fish, glofish, goldfish or betta/beta",
      "FITS ANY SPACE - This mini aquarium measures 7.5\" wide x 7.5\" deep x 8\" high. Weighs 5 pounds. Capacity 1.8 Gallons"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "7.5 x 7.5 x 8 inches; 3.31 Pounds",
      "Item model number": "460410-660",
      "Department": "Home",
      "Date First Available": "January 9, 2010",
      "Manufacturer": "Umbra",
      "ASIN": "B0033FGDRS",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Fish Bowls",
      "Aquariums & Fish Bowls",
      "Pet Supplies",
      "Fish & Aquatic Pets"
    ],
    "price": ""
  }
}