{
  "website_summaries": [
    {
      "verdict": "Another inexpensive option showcasing a compact build amidst a simple, easy-to-use design.",
      "pros": [
        "Many customers admire the small size of this fryer, using it even when traveling",
        "Perfect for feeding one to two people",
        "Adjustable temperature"
      ],
      "cons": [
        "No indicator light when the oil has reached boiling",
        "Pan is not removable, which makes for difficult cleaning"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Happy with little deep fryer!",
      "text": "It is cute don't need lots of oil. This is great for 1 or 2 persons. The only thing I don't like is you can't take off the pot to clean. I have to be careful not to wash the outside. Rather than that I'm very happy with this little deep fry. It heats up pretty quick too. So I recommend this to anyone that is single or 2 persons that live in the house. Update I can fry three of those chicken legs easy🙂 with out the frying basket.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 33,
      "publication_date": 20190206
    },
    {
      "title": "THE BEST! I wanted a small fryer as there is ...",
      "text": "This is a small deep fryer which is what I was looking for. It arrived the day AFTER I ordered it (how do they do that?) and so I used it tonight to cook some fried mushrooms and some french fries. THE BEST! I wanted a small fryer as there is just me and my husband now and this on did not take up much counter space and there is still plenty of room inside to cook enough food for a family. I let it cool down and then put it in our refrigerator....we'll use again tomorrow! I love this little fryer. Don't hesitate...just buy it. You'll be glad you did!",
      "rating": 5.0,
      "verified": true,
      "author": "Velma Martin",
      "helpful_votes": 40,
      "publication_date": 20171204
    },
    {
      "title": "Sad it arrived defective",
      "text": "First try it would not heat. Checked it all out and noticed something was loose inside. Shook it and it stopped the loose sound. Yes, not too smart. Tried again and it turned on, only to never stop heating, the thermostat was stuck \"ON\". It never STOPPED heating. Burnt $8 worth of peanut oil, dumped down the drain and packed for return. Could have had a FIRE if left unattended. Then I checked the box. Gold old Presto used to be stamped out it Wisconsin, this too is now made in China. So sad. It's a cute little unit would have been perfect if it wasn't so cheap and broken.",
      "rating": 1.0,
      "verified": true,
      "author": "Judie",
      "helpful_votes": 9,
      "publication_date": 20200103
    },
    {
      "title": "Fryer stops heating high enough in less than one month",
      "text": "Within one month of owning, this fruer stopped heating to above 300 degrees even when the thermostat is on 390 degrees. Crap! Dont buy. Tried to make some shrimp for memorial day...and the fryer wouldnt heat up high enough to keep the batter on the shrimp.",
      "rating": 1.0,
      "verified": true,
      "author": "Israel Contreras",
      "helpful_votes": 10,
      "publication_date": 20190526
    },
    {
      "title": "Good except for small size and lack of temperature-ready indicator",
      "text": "Works much better than our previous deep fryer (one of the bare bucket with lid models). It's good for cooking some chicken or corn dogs, but it's just a little small for doing something like fries and chicken at the same time. Also, there's no way to tell if it's at the right temperature without a thermometer, and it takes a while to heat up, which makes for a lot more guessing than I'm comfortable with. The lid and basket are great, at least.",
      "rating": 4.0,
      "verified": true,
      "author": "Logan Warner",
      "helpful_votes": 15,
      "publication_date": 20171219
    },
    {
      "title": "Perfect size",
      "text": "My kids won’t eat fries in the air fryer unfortunately. There is just something about a deep fried French fry.. it’s small enough that I keep it on my counter top. Super easy to clean. Heats up quickly also!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 5,
      "publication_date": 20200608
    },
    {
      "title": "Sexy little appliance and portable",
      "text": "It cooks excellent! I can use this and skip fast food! I can use healthy oils and control my portions while saving money. I eat healthy and workout but I allow myself to cheat with shoestring fries and breaded wing dings! No telling what fast food spots use to fry. Great just for me or 1 mother, and heats up quickly!",
      "rating": 5.0,
      "verified": true,
      "author": "Shopmatic",
      "helpful_votes": 3,
      "publication_date": 20190121
    },
    {
      "title": "I dont fry food in the house.",
      "text": "I dont fry food in my house because it stinks and leaves a lingering fried food odor for days in my clothes and hair!! I purchased this deep fryer to use outside on my patio and it works great!! Now we can indulge in frying our food without the shameful smell in our home! Its easy to use and easy to clean. I just pour the old grease into a empty spaghetti jar and wash it outside with my water hose with soap and a thick rag!",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Cute little deep fryer",
      "text": "This is the cutest little deep fryer. Does not take up much room and easy to clean. I made French fries the other night and they were absolutely delicious. It gives me something fun to do when I am in my house self distancing. Perfect gift for just one or two people, as it is small. Very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy Meharry",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "DIdnt Work",
      "text": "I was excited when this arrived because i was replacing a bulky deep fryer that took up to much counter space and used way to much oil especially since I don't reuse oil that much. Anyway, I spent Sunday afternoon marinating and breading my chicken tenders. I fill the fryer with oil, plug in and wait .. and nothing ... i waited about 45 minutes and the oil didnt heat. The unit was on because the light was on but nothing. I turned the dial up, down, on, off and still nothing..",
      "rating": 1.0,
      "verified": true,
      "author": "Russell D",
      "helpful_votes": 2,
      "publication_date": 20190924
    },
    {
      "title": "Worked Perfect for baby frier",
      "text": "Outstanding worked great for one or two, however party of four or more way too small . My wife hates smell of fish clams it's smell's, stinks up house,LOL! HA! I took it out in Shop already fried up some fries, shrimp, onion rings then fresh fish outstanding love it. Last did some frozen bean burrito learned let thaw out some in trig for while anyway easy clean up having great time with grandson fishing who staying with us for summer..",
      "rating": 5.0,
      "verified": true,
      "author": "Terry L Hammersley",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Impossible to clean interior",
      "text": "I bought this because it matched all the criteria I was looking for, except for cleaning. I thought it might do. It didn't. It was ok until I fried some homemade fried chicken in it, which totally stained the interior, which was already hard to clean. And the only way to clean the lid of course is in a dishwasher. I ended up tossing it, and buying the Presto model 05420 instead. It's more basic, but at least it's got non-stick material inside and out, and is easy to sponge clean.",
      "rating": 3.0,
      "verified": true,
      "author": "T Elliott Cato",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Great little fryer",
      "text": "First time ever buying a deep fryer exceptionally perfect for what I needed to do, cooking dinner for one is so easy I've had fun making homemade fish and chips chicken tenders and taquitos . It heats up quickly and maintains and even temperature I use coconut oil in my fryer.the basket is a good size and it's easy to know how much to fill up the fryer and has a lid that you can keep shut up and still lets the steam out while cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "Jette Porrazzo",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Tiny, but great!",
      "text": "I love this thing. It is tiny, which works for me since I only fry things as side dishes or additions to rice-based dishes, never in large amounts. It only requires a small amount of oil and a short time to heat!! To get an idea of the size of this, you can put a whole bag of okra in it, or 1.5 pound of fish fillet cut into pieces, or 2/3 of a big egg plant cuz you do not want it to stick together, or 1.5 big onion...",
      "rating": 4.0,
      "verified": true,
      "author": "AA",
      "helpful_votes": 8,
      "publication_date": 20160719
    },
    {
      "title": "Would not buy",
      "text": "Very disappointed, the fryer works great, but the thermostat does not work at all - so I have no clue where the oil temperature is at. I have to use a oil thermometer and still when I set it on the Presto dial - it does not read what the dial says. I would not purchase again. But it is a good size for 1 person.",
      "rating": 2.0,
      "verified": true,
      "author": "R. Noyes",
      "helpful_votes": 5,
      "publication_date": 20180114
    },
    {
      "title": "Fantastic Deep Fryer",
      "text": "Perfect deep fryer meets all expectations for frying shoe string fries, frozen okra, chicken wings and much more. Heats up quickly, really appreciate the top to prevent splatters and easy to clean. Also does not require a lot of oil. Price is reasonable. Recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Faith of Mustard Seed",
      "helpful_votes": 6,
      "publication_date": 20171016
    },
    {
      "title": "Its small enough to put away in a cabinet whenever im done with it.. easy to clean as well.",
      "text": "Love this lil machine! Its the perfect smal size to use for snacks and sides for dinners. Someone in my home uses this lil thing at least once a day. I wasn't expecting much from it, but let me tell ya, im overly impressed with it! It definitely works and holds up like expensive appliances! Ive had it for a while now, and its still doing great. I really love how its small enough to put away in a cabinet whenever im done with it.. easy to clean as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiff",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "meh",
      "text": "Wanted to get a deep fryer to make some delicious fried foods like french fries and fried shrimps. This does the job but it's hard to know when the oil is up to temperature- I wish it has some kind of temp control that tells you when it's good to go, but you just gotta kind of wait it out and guess.",
      "rating": 3.0,
      "verified": true,
      "author": "Lucky",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Great small fryer",
      "text": "This is a great little fryer. We have a really big fryer, but it is rarely used because it takes so much oil and is a bit of a hassle. This is great for making a few servings of fries, a couple of egg rolls, fried cheese, a few biscuit doughnuts. It is quite small, but that's why I got it.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Mulkey",
      "helpful_votes": 3,
      "publication_date": 20170310
    },
    {
      "title": "Fairly basic and small, but does a great job for the price",
      "text": "Wow, bought this for our daughters apartment and she loves it! We used it when staying with her recently and it was wonderful and easy to use. Fairly basic and small, but does a great job for the price in our opinion!",
      "rating": 5.0,
      "verified": true,
      "author": "Colorado Mike",
      "helpful_votes": 4,
      "publication_date": 20170317
    },
    {
      "title": "Presto Deep Fryer",
      "text": "I purchased this unit at the end of May and by the beginning of July it wasn't working properly. The oil stopped getting hot, ruining the food I was deep frying. I called Presto directly due to the 1 year manufacturer warranty and they will be sending me a new cord. If this doesn't resolve the problem, I'll have to send the unit back for them to look at. Very inconvenient to say the least. Buyer Beware!",
      "rating": 1.0,
      "verified": true,
      "author": "Sidney Griffin",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "I’m a fab",
      "text": "Love it for my single person household. This is my first air fryer and I’m shocked at how much oil is needed and can only imagine the crazy amount needed for bigger devices. It’s super easy to clean and the instructions came with some awesome tips.",
      "rating": 5.0,
      "verified": true,
      "author": "HonestlyWhitney",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Good, don't like the magnetic plug",
      "text": "Like the small size for our already crowded countertop. Heats up quickly. One feature I would change is the plug. It is too short and there is a \"magnet\" feature where it has to click on just right or else the unit will shut off. A bit annoying as one little nudge will cut off the fryer while cooking.",
      "rating": 3.0,
      "verified": true,
      "author": "Kristen S.",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Efficent",
      "text": "It is little.. I bought it for that reason. It is exactly what I thought it would be. Nice for 1 or 2 people. This is NOT for a family.",
      "rating": 5.0,
      "verified": true,
      "author": "James A. Duncan",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "sweet rice balls",
      "text": "I have used it for many times for frying pork chops, sweet rice balls, fries etc. it works very well and is easy to clean. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mo",
      "helpful_votes": 4,
      "publication_date": 20170414
    },
    {
      "title": "if it has a short don't use it",
      "text": "I bought a fryer on 6/3/2020 and I liked the fryer but it has a shortage of some kind and only works if I play with the cord and I don't like doing that I only had it a little over a month . I tried getting a smaller one because it's just my husband and I. can I send it back and just get another one or how do you want to handle this matter.",
      "rating": 4.0,
      "verified": true,
      "author": "gwendolyn williams",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Great Purchase",
      "text": "Bit of a pain to clean, but it’s very easy once the crumbs are removed. Seems they love to be chased around the outer ring. Love using it and it’s great for one or two people without using a bunch of oil. It was a great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "ymlljcd",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Small, compact, not meant for a large family",
      "text": "This is a small fryer. I would not recommend for anyone wanting to fry for more than 2 people because it would take a long time. But small, easy to clean, temp control and easy storage ability. It would be nice for a camper or apt or small kitchen.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff & Kristyn Robinson",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Perfect fries!",
      "text": "This fryer is exactly what we needed to prepare meals for two. My husband loves French fries, they come out perfect every time.",
      "rating": 5.0,
      "verified": true,
      "author": "Lesleigh",
      "helpful_votes": 8,
      "publication_date": 20150908
    },
    {
      "title": "Smaller than expected",
      "text": "Much smaller than I thought cama takes a long time to come up to temperature. If I hadn't been so lazy, I would have returned it. My old fry daddy with a much better product.",
      "rating": 2.0,
      "verified": true,
      "author": "riversidedogwalking",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Awesome little fryer",
      "text": "We were looking for something smaller since we are empty-nesters. This is a bit small for deep frying burritos, but for smallish items; french fries and single items, it's about perfect. The lid is remove able and the fryer is small enough to clean it easily",
      "rating": 4.0,
      "verified": true,
      "author": "CH",
      "helpful_votes": 0,
      "publication_date": 20170813
    },
    {
      "title": "Excellent!",
      "text": "I love this fryer! After reading the reviews I was skeptical about the magnetic plug. I’ve had no problems with it at all!! This fryer is the perfect size for 1-2 people. Would buy again!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Exactly what we needed. Happy customer 😄",
      "text": "Love not wasting a lot of oil. Exactly what we were looking for!!!! Love the stainless steel very attractive & doesn’t look cheap!! Excellent price too.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Great LITTLE Deep Fryer",
      "text": "This was a gift for my daughter and it has been used and used and used. Great product, wonderful fried \"finger foods\". She's happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry C",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Perfect size just for me",
      "text": "I use to own larger fryer making batches of teriyaki wings. Perfect size just for me. I can try 5-6 wings at a time w/o them sticking together. Happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Mackie",
      "helpful_votes": 6,
      "publication_date": 20150701
    },
    {
      "title": "Nice mini fryer",
      "text": "I love the size of this fryer. Exactly what I was looking for. It is a little light weight and I do put it on a hot plate before heating it up. Other than that it cooks good and I'd purchase it again",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Love it",
      "text": "Love this...do not do much deep frying, but we do like to deep fry crappie when we are lucky enough to catch some! This made cooking them much cleaner and easier. I like the small size. I used to have a fry baby and this is way way better!",
      "rating": 5.0,
      "verified": true,
      "author": "mom and teacher",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Still good, just not perfect",
      "text": "My husband and i enjoy this little buy, however, about a month into having it, the cord and front temp knob fell off. It still works, just doesn't have a front knob plate anymore.",
      "rating": 3.0,
      "verified": true,
      "author": "Dittsyqueen",
      "helpful_votes": 5,
      "publication_date": 20150827
    },
    {
      "title": "Not worth buying !",
      "text": "It’s for a 1 person serving size. It takes soooo much oil & the oil ended up over spilling although it was up to the suggested line & The frying tray sucks because everything gets stuck to it and it’s so difficult to clean. Have to leave it soaking in water for over an hour . If i still had the box I’d return it. Don’t think it’s worth the money!",
      "rating": 3.0,
      "verified": true,
      "author": "Stephanie ",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Easy to use, Like the product",
      "text": "Good product to use. Does get hot. Somewhat hard to clean amd has a loose lid.",
      "rating": 5.0,
      "verified": true,
      "author": "J.P.",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "The Basket is small.",
      "text": "I was disappointed with the size of the basket. This item was returned.",
      "rating": 3.0,
      "verified": true,
      "author": "Bea",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Perfect size for small jobs, but top is not easy to de-grease",
      "text": "This is the perfect size for SMALL jobs. But the top is not easy to de-grease.",
      "rating": 5.0,
      "verified": true,
      "author": "Flash’s mom",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Good for small meals",
      "text": "Like it for my tiny family. Would buy it again. Cooks food pretty well.",
      "rating": 5.0,
      "verified": true,
      "author": "Myia Awusah-Duke",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Paying attention to the reviews",
      "text": "Didn’t realize how small it’s you can only put two chicken legs in the deep fryer at a time . Good for college student not for my house hold",
      "rating": 3.0,
      "verified": true,
      "author": "Crystal D.",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "I like this deep fryer and it is the right size ...",
      "text": "I like this deep fryer and it is the right size for me. The food comes out the way I like it.",
      "rating": 4.0,
      "verified": true,
      "author": "James Taylor",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "About perfect for one person.",
      "text": "About perfect for one person. One star off for the basket handle design. Would be nice to be able to flip that in for storage, with oil in the fryer. It does come off but just another part to keep track of.",
      "rating": 4.0,
      "verified": true,
      "author": "LarryK",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "352 deg. is all it go's to with the ...",
      "text": "352 deg. is all it go's to with the dial max at 390 deg. I put the warm oil in my old fry daddy to finish dinner",
      "rating": 1.0,
      "verified": true,
      "author": "Gene/Carla",
      "helpful_votes": 5,
      "publication_date": 20161206
    },
    {
      "title": "Well made, easy to stow in a small space.",
      "text": "Cute little unit, perfect for two. I bought it to use on my boat when we’re on shore power. Doesn’t hold a ton of stuff, but we love it to do shrimp, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert W.",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "but it is a great size and works well looks nice as",
      "text": "had a few problems with oil leaking from somewhere?? but it is a great size and works well looks nice as well",
      "rating": 4.0,
      "verified": true,
      "author": "debra kay",
      "helpful_votes": 4,
      "publication_date": 20160218
    },
    {
      "title": "DO NOT BUY",
      "text": "It melted after the first use! Why would you line the top of a deep fryer with plastic? Also, it is a pain in the butt to clean.",
      "rating": 1.0,
      "verified": true,
      "author": "Neriah Almahdi",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Can not emerge to clean.",
      "text": "I love it services only 2 people servings. It is all we need.",
      "rating": 5.0,
      "verified": true,
      "author": "Rusty",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Great Fryer",
      "text": "Neatest little fryer you ever thought of. Just right for two people. We use it fairly often.",
      "rating": 5.0,
      "verified": true,
      "author": "omullins",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "So far so good.",
      "text": "I got this for my mom and she said it was perfect for one person size portions.",
      "rating": 5.0,
      "verified": true,
      "author": "Mindy Soard",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "It's perfect for 2",
      "text": "I bought this as a replacement for another deep fryer I had. I bring it with me in my RV. This is perfect for two people. No grease splatters because the lid fits so well.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria M",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Good for the value",
      "text": "Doest take up alot of counter space and easy and clean. No grease splashing.",
      "rating": 4.0,
      "verified": true,
      "author": "John R. Beard",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "just leaving it in after frying until oil dirty and time to change",
      "text": "Fast heating oil and the consistent and exact temperature produced from this little fryer is on par with restaurant equipment fryer. The different is only for 1 serving at one time. In my opinion no need separate container for oil, just leaving it in after frying until oil dirty and time to change. Cleaning is easy. Save space for small kitchen. So far no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Wan Liem Lie",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Four Stars",
      "text": "compact and fast very small, only can cook 1 serving at a time",
      "rating": 4.0,
      "verified": true,
      "author": "meccadat",
      "helpful_votes": 2,
      "publication_date": 20170529
    },
    {
      "title": "The fryer is a bit small however it works great and we use it often",
      "text": "The fryer is a bit small however it works great and we use it often. It arrived on time and there was no damage",
      "rating": 5.0,
      "verified": true,
      "author": "eddie",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Would by fry daddy again",
      "text": "Short cord didnt like. Lid fell on floor an cracked!",
      "rating": 4.0,
      "verified": true,
      "author": "betty",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Four Stars",
      "text": "Super cute! Great for small frying jobs! Easy clean up!",
      "rating": 4.0,
      "verified": true,
      "author": "Bahamamama",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "OK for price",
      "text": "This is a stripped down bare bones basic model, too small, but it works OK for the price. Two chicken pieces maximum. Doesn't use much oil.",
      "rating": 3.0,
      "verified": true,
      "author": "Herb from WA",
      "helpful_votes": 0,
      "publication_date": 20170110
    },
    {
      "title": "Presto cooker",
      "text": "Nice little deep fryer. It doesn't get really hot, but, that is okay, keeps it from splattering all over. It is easy to clean up.",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy Wells",
      "helpful_votes": 0,
      "publication_date": 20160514
    },
    {
      "title": "Compactness",
      "text": "This fryer is perfect for our new camper. It is the best size for just the two of us. Does not use much storage room, which is needed in camping.",
      "rating": 5.0,
      "verified": true,
      "author": "Edna Markham",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Poor quality",
      "text": "Hard to maintain temp. Impossible to dry food enough to avoid over flow!",
      "rating": 2.0,
      "verified": true,
      "author": "Curtis Jay Bushell",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Five Stars",
      "text": "This is a great little fryer just right for 2 people",
      "rating": 5.0,
      "verified": true,
      "author": "werkerss",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "You won't be dissapointed.",
      "text": "Perfect for my small space needs and works great! I highly recommend if you are looking for a small fryer for one or two people.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Humphries",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Perfect size for cooking for 1 or 2 people",
      "text": "Perfect size for cooking for 1 or 2 people. Anything more and it becomes time consuming to load and unload. Still a great product.",
      "rating": 4.0,
      "verified": true,
      "author": "Eddie",
      "helpful_votes": 0,
      "publication_date": 20150826
    },
    {
      "title": "I am very happy that I bought it on here",
      "text": "Works very well , We use it almost every week , it cooks wings real well also. I am very happy that I bought it on here.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck310",
      "helpful_votes": 0,
      "publication_date": 20160625
    },
    {
      "title": "Does the job!",
      "text": "Cute! Perfect for my needs- small batches of fried food. Pretty easy to clean.",
      "rating": 4.0,
      "verified": true,
      "author": "Patricia A CT",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "AGreat Little Cooker!!!",
      "text": "This little cooker does an excellent job cooking quick delicious meals for my grandchildren! Easy cleanup too! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Jan",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Good buy",
      "text": "So easy to clean! Makes things for two people. Use this alot!",
      "rating": 5.0,
      "verified": true,
      "author": "patricia l.",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "She has enjoyed it so far",
      "text": "This was a Christmas gift for my sister. She has enjoyed it so far!",
      "rating": 5.0,
      "verified": true,
      "author": "RS",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Works fine no complaints there but it would be nice if ...",
      "text": "Works fine no complaints there but it would be nice if it had some way of draining by attaching to the side",
      "rating": 3.0,
      "verified": true,
      "author": "MJinDal",
      "helpful_votes": 0,
      "publication_date": 20160917
    },
    {
      "title": "Loving deep fryer",
      "text": "Perfect size for small family. We received it and couldn't wait to try. It worked great!",
      "rating": 5.0,
      "verified": true,
      "author": "Edwards",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "She is well satisfied.",
      "text": "well packed for shipping. Wife has used 1 time. She is well satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "70newbe",
      "helpful_votes": 0,
      "publication_date": 20161116
    },
    {
      "title": "Presto deep fryer",
      "text": "Awesome little deep fryer. Great for single servings. Easy to use & easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Teri",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Three Stars",
      "text": "Works good. Needs a lot of oil and it’s kinda too small for me",
      "rating": 3.0,
      "verified": true,
      "author": "LadiiLoca",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "I like this fryer it is great for 2",
      "text": "I like this fryer it is great for 2. No problems have used it about 15 to 20 times so far I give 4 stars because I never give 5 I recommend",
      "rating": 4.0,
      "verified": true,
      "author": "In Search of",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "fantastic",
      "text": "fun machine ... works great, heats up fast and just the right size.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaqui",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "Exactly what I needed. I cook for only myself ...",
      "text": "Exactly what I needed. I cook for only myself and it's big enough for me and small enough to fit in small cabinets (I live in San Francisco).",
      "rating": 5.0,
      "verified": true,
      "author": "Nneka",
      "helpful_votes": 0,
      "publication_date": 20150325
    },
    {
      "title": "Made for one",
      "text": "So far so good. It is definitely designed for a single person and works well for funnel cakes for the kids since you can only make one at a time.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150103
    },
    {
      "title": "Perfect for 2",
      "text": "The perfect size for just two people. It's simple and easy to clean. I wanted something for fries and hushpuppies-- nothing too fancy. Very pleased with this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "carol kerr",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "Was kind of small. Very hard to clean without ...",
      "text": "Was kind of small. Very hard to clean without scratching.",
      "rating": 3.0,
      "verified": true,
      "author": "Tina Cisneros",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "Great for small meals",
      "text": "The basket needed something on it to where you could let it strain the grease off the food",
      "rating": 3.0,
      "verified": true,
      "author": "Monty Kirkpatrick",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Works great.",
      "text": "Only drawback it because of holes where the basket goes to close it, can't keep oil in it. Works great.",
      "rating": 4.0,
      "verified": true,
      "author": "RDM",
      "helpful_votes": 0,
      "publication_date": 20160120
    },
    {
      "title": "item arrived in good time. so far works ok",
      "text": "item arrived in good time. so far works ok. item arrived with dent on brushed aluminum cover; cosmetic, does not affect function so did not return.",
      "rating": 3.0,
      "verified": true,
      "author": "mr.v",
      "helpful_votes": 0,
      "publication_date": 20160714
    },
    {
      "title": "Perfect size for the few things I deep fry",
      "text": "Perfect size for the few things I deep fry. The feature which interested me the most is the aluminum interior. I am trying to get away from teflon, especially for the higher heat used to deep fry. I worried about the cleaning but it turned out to be no problem since nothing burns or sticks in all that oil. I strain oil and keep in fridge for one or two more uses. It comes with a nice deep basket, also easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Joan M. Housman",
      "helpful_votes": 5,
      "publication_date": 20160114
    },
    {
      "title": "Five Stars",
      "text": "this is just the right size for me and my husband.",
      "rating": 5.0,
      "verified": true,
      "author": "Therese H.",
      "helpful_votes": 0,
      "publication_date": 20160123
    },
    {
      "title": "Nice little fryer.",
      "text": "Great size for storing.Thermostat is correct setting.Probably doesn't need a thermostat as you're using it on high for virtually everything.Looks and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160301
    },
    {
      "title": "Perfect fryer!",
      "text": "So simple to use, clean and store! My favorite summertime appliance",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberlee Cooper",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Nice LITTLE frier.",
      "text": "Used it once. So far so good except diameter not sufficient for longer fries or strips.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20141018
    },
    {
      "title": "Fry Days",
      "text": "Nice unit. Heats up quickly, has the nice basket and looks good on the counter. My only wish it that it was about 25% bigger since you can't fit as much in as I'd like. A bit larger would allow for not only more but more even cooking. This replaced a Fry Daddy which though larger, I wasn't a fan of how thinly it was coated. A faux looking non-stick coating which didn't last very long. This unit isn't coated.",
      "rating": 4.0,
      "verified": true,
      "author": "Watchdog",
      "helpful_votes": 2,
      "publication_date": 20161009
    },
    {
      "title": "poor",
      "text": "Arrived without one of 4 rubber feet, totally unsteady on remaining 3 feet, removed those and will try to adapt something that will work, otherwise will sit too close to the counter and burn it? Don't want to return it but don't want to cook with hot oil while fryer rocking. Not happy as with my other purchases on amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Alternative",
      "helpful_votes": 3,
      "publication_date": 20161230
    },
    {
      "title": "deep fryer",
      "text": "Received product in a reasonable length of time and in excellent shape. heats quickly and does a great job.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "Deep fryer",
      "text": "Works great. Just the right size for me and my wife.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Riley",
      "helpful_votes": 0,
      "publication_date": 20160301
    },
    {
      "title": "This fryer was amazing at first",
      "text": "This fryer was amazing at first! The size was perfect for a single person it cookeded evenly and you get that golden crust. However the oil started leaking out! The front bottom rubber has melted!",
      "rating": 1.0,
      "verified": true,
      "author": "Deborah H Burge",
      "helpful_votes": 3,
      "publication_date": 20180318
    },
    {
      "title": "very small one batch fryer",
      "text": "I am not sure what the max temp is but it doesn't seem very hot, especially when you have such a tiny fryer. It takes a long time to reheat for a second batch and it is very small, enough for one portion of french fry and a small portion at that. I'm looking for similar style with more heating power and bigger size.",
      "rating": 3.0,
      "verified": true,
      "author": "John Coleman",
      "helpful_votes": 6,
      "publication_date": 20150209
    },
    {
      "title": "Great for a small family or single person",
      "text": "It was deli.vered as described. Use it a lot. Next would buy a bigger capacity. Great for a small family or single person.",
      "rating": 4.0,
      "verified": true,
      "author": "Rodney",
      "helpful_votes": 0,
      "publication_date": 20140825
    },
    {
      "title": "... fryer at my brother's house and I saw how easy and convenience was to use it",
      "text": "I saw this Electric fryer at my brother's house and I saw how easy and convenience was to use it. As soon as I returned to my home I ordered and love it! It is not to big, but perfect size for small family. I really recommend it!",
      "rating": 4.0,
      "verified": true,
      "author": "essin",
      "helpful_votes": 0,
      "publication_date": 20150422
    },
    {
      "title": "Perfect size",
      "text": "Good size and great quality. Perfect for preparing fried food for two people. Doesn't use to much oil.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170311
    }
  ],
  "product_meta": {
    "title": "Presto 05470 Stainless Steel Electric Deep Fryer, Silver",
    "description": "Fry delicious deep fried foods, fast and easy, in this space-saving deep fryer. Brushed stainless steel exterior with anodized aluminum interior for fast, even heating. Adjustable thermostat for easy temperature selection. Handy indicator light signals when the fryer is plugged in. Vented cool-touch cover with built-in spatter screen reduces odor and spattering. Compact size saves counter space and stores easily. Oil capacity: 1 liter (1.1 quarts) 120 volts AC, 1000 watts, 60 Hz only.",
    "rating": 4.3,
    "feature_bullets": [
      "Adjustable thermostat for easy selection of the desired frying temperature. Oil capacity: 1 Liter ( 1.1 quarts).",
      "Handy indicator light lets you know when the fryer is plugged in. Compact size saves counterspace and stores easily.",
      "Anodized aluminum interior for fast, even heating. Brushed stainless steel exterior.",
      "Fry crispy, delicious french fries, shrimp, chicken, onion rings and more.",
      "Vented cool-touch cover features a built-in spatter screeen. Fries with the cover closed to reduce odor and spattering."
    ],
    "specifications": {
      "Product Dimensions": "8.25 x 8.63 x 8.25 inches",
      "Item Weight": "3.1 pounds",
      "Manufacturer": "National Presto Industries, Inc.",
      "ASIN": "B003UVG622",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "5470",
      "Customer Reviews": "4.3 out of 5 stars772 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#25,728 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 29, 2010"
    },
    "categories": [
      "Small Appliances",
      "Fryers",
      "Home & Kitchen",
      "Deep Fryers",
      "Kitchen & Dining"
    ],
    "price": 43.0
  }
}