{
  "website_summaries": [
    {
      "verdict": "A gorgeous and efficient way to prevent bottom-dwelling and foraging aquatic reptiles from accidentally consuming smaller substrates, these large and naturally formed river pebbles arrive in a wide range of pretty colors and patterns. What will you get?",
      "pros": [
        "Naturally formed smooth river pebbles",
        "Large and chunky pebbles make a convincing riverbed",
        "Easy to disinfect, clean, and maintain",
        "Aquatic turtles won’t consume the chunky pebbles"
      ],
      "cons": [
        "Unfortunately, uneaten food may slip between the space between these larger river rocks"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Smooth large rocks that work well for my turtle's aquarium.",
      "text": "These are great for a turtle aquarium. They're larger so your turtle doesn't end up eating any of them. When they first arrive they do need washed since they seem to come with a paper dust all over them. The colors of the rocks are very nice, having a natural look but still plenty of variety in the shades. I bought one bag for my 20 gallon aquarium and it works, but I'm picking up a second one since the first bag only covered a portion of the bottom of the tank. The rocks are all completely smooth too so your turtle can't injure themselves somehow on them. They work great!",
      "rating": 5.0,
      "verified": true,
      "author": "Where the Sidewalk Ends",
      "helpful_votes": 11,
      "publication_date": 20170902
    },
    {
      "title": "UPS Guy's face = priceless",
      "text": "10 pounds of smooth pebbles for $10, good deal and they're perfect for our turtle habitat. Yeah I guess you can get a bag at the dollar store, but for $1 you're gonna get 1 pound, and you're probably not going to be able to get 10 bags all at the same place (and if you need 50 pounds? Good luck). But perhaps the best part about ordering 5 bags from Amazon is the confused look on the UPS guy's face as he delivers a 50 pound litteral box of rocks to your door 😂.",
      "rating": 5.0,
      "verified": true,
      "author": "Mayfield",
      "helpful_votes": 14,
      "publication_date": 20161002
    },
    {
      "title": "A lot of pebbles for 10 gallon tank and don't slide!",
      "text": "My friend has 3 small turtles in a 10 gallon tank and had too much water and only a floating fake rock. I bought these and a new Tetra 25845 Repto filter and set his tank up. Turtles love it!!!! These pebbles stay in place and turtles climb on them to rest.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa L. Sanchez",
      "helpful_votes": 9,
      "publication_date": 20170501
    },
    {
      "title": "Nice stones",
      "text": "These are really nice stones. Beautiful assortment of colors and perfect size. Nothing too small so I don't have to worry about her ingesting any. I used 2 bags in a 45 gallon tank (36 x 12) and that was perfect for what I needed because I have large rocks on one side to secure the turtle dock. I would recommend at least 3, if not 4 bags in a tank of the same size if all you're using for a base is the stones.",
      "rating": 5.0,
      "verified": true,
      "author": "Artist",
      "helpful_votes": 25,
      "publication_date": 20151230
    },
    {
      "title": "The turtles love the new rocks!",
      "text": "Bought 3 packages to put a thin layer on the bottom of a 40 gal breeder tank (36\" long x 18\" wide with about 6-7\" of water). They look great compared to the smaller black rock I used to have. The turtles do not try to eat the rocks (full grown, 13 year old turtles). The turtles love to dig in the rocks and seek out food - wish I had bought them years sooner because the turtles are obviously enjoying the new environment so much. They also make the tank appear \"brighter\". Some of the other reviews had me concerned - this was a great purchase for my turtles.",
      "rating": 5.0,
      "verified": true,
      "author": "J Lamb",
      "helpful_votes": 4,
      "publication_date": 20170118
    },
    {
      "title": "Not for 4\"-5\" Turtles like advertised",
      "text": "I bought 2 of these bags. These were on the pricey side, considering I have seen 20lbs bags go for the price I paid for these. I gave theses a try because they were advertised to be for 4\"-5\" turtles like mine are. But I found myself picking out the smaller ones ones my turtles started to put them in their mouth. I did this about 5 times before I decided to take them out for good. They worked well for my goldfish, but I would recommend these for baby turtles only. These are pretty easy to clean, but they do accumulate quite a bit of gunk.",
      "rating": 3.0,
      "verified": true,
      "author": "Joli",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Great but has flaws",
      "text": "I found some rocks broken in half with sharp edges, but there were only like 2 or 3 broken ones in 1 bag. I bought one bag and it filled my entire 10 gallon tank with about an inch of rocks, so if you have a 10 gallon tank I recommend buying at least 2 bags. The rocks look beautiful and not fake at all. They were also nicely polished.",
      "rating": 4.0,
      "verified": true,
      "author": "Emilie Briggs",
      "helpful_votes": 3,
      "publication_date": 20180313
    },
    {
      "title": "Turdy loves the rocks!",
      "text": "Turdy love the rocks. He's still only a little bigger than a quarter.... he uses the rocks to climb and bask, and he'll go into his little shell to blend in with the rocks when he wants to hide. Cleaned easily, I scrubbed them lightly with a soft brush and rinsed several times. Water in tank is clear. I used 1 and a half bags of the large rocks for a 10 gallon tank.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcey",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Small enough to eat",
      "text": "These looked like great pebbles, but I returned them without using them. My turtle is a ravenous eater and I thought these pebbles would be big enough to deter him. He is a six inch turtle and some of the pieces were smaller than his head so I was worried that he would try to eat one and choke. These pebbles would look really good in a tank and they might work for you, but the product just didn't work for my situation",
      "rating": 4.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Smooth and Natural, CANNOT boil",
      "text": "The rocks are natural and look great in my tank. The coating makes cleaning algae growth easier. I did notice that you cannot boil them. The coating on them seems to melt a bit with extreme heat.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer Swarthout",
      "helpful_votes": 3,
      "publication_date": 20180330
    },
    {
      "title": "Love these!",
      "text": "These are beautiful pebbles! Perfect for our turtles enclosure. Variety of colors and not too small.",
      "rating": 5.0,
      "verified": true,
      "author": "Melody Wood Batchelor",
      "helpful_votes": 11,
      "publication_date": 20160315
    },
    {
      "title": "Perfect! Very satisfied",
      "text": "I used these rocks for my tiger salamander's tank. When I brought him home he had changed from a water dog the day of! He still needed an area to swim around, but also that he could chill on above water. I have even found him burrowing under these rocks. They were a little dusty when I opened the bag, but they were super easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Dutoit",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Cool looking rocks",
      "text": "At the time I clicked on this product, the picture was wrong. It shows rocks that are much smaller than these large exo terra turtle pebbles. The ones I received were just right for my turtle tank. I bought 2 bags for my 29 gallon tank and they covered the bottom of the tank fine. Well, maybe three bags would cover it more thoroughly but I didn't want too thick a layer of rocks. They are really cool though. :) My turtle likes to dig around in them for any food that may have sunk to the bottom. The color of the rocks are cool too. They aren't just dark but have beige, brown, and gray too.",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia",
      "helpful_votes": 3,
      "publication_date": 20140802
    },
    {
      "title": "Four Stars",
      "text": "3 bags were perfect for my aquarium and they look great",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20170426
    },
    {
      "title": "Beautiful aquarium rocks",
      "text": "I do not have a turtle but I bought these for my aquarium. They are beautiful, natural looking, and offer great value. The 10 pound bag fit the bottom of my 10 gal tank just perfectly. The rocks are also large and heavy so when you do a water change they do not get sucked up by the siphon! So happy I found these.",
      "rating": 5.0,
      "verified": true,
      "author": "diane",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Best Aquarium Stones I Have Ever Used",
      "text": "These are the best aquarium stones I have ever used. They match my granite countertops perfectly, are semi-polished and smooth (except for two stones), and my baby Yellow Belly Slider is happy. Additionally, they arrive almost dust free. I recommend rinsing them in any case but they are fantastic. Finally, two ten pound bags is barely enough for a twenty gallon tank. If you want several layers stones, I suggest three or even four bags.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 0,
      "publication_date": 20170513
    },
    {
      "title": "Takes some time to get them tank ready!",
      "text": "Super SUPER dirty! When I first open the rocks I thought they were just kind of dusty, but as I started to rinse them tons of debris went into the water. I had to rinse these rocks forever until the water was clear! But other than that they are great rocks I've used them to weigh down aquatic plants in my turtle tank!",
      "rating": 4.0,
      "verified": true,
      "author": "Sierra",
      "helpful_votes": 2,
      "publication_date": 20180430
    },
    {
      "title": "Very natural and large sea bed for your aquarium",
      "text": "These are great in my 29G aquarium for a natural looking sea bed I used these with an underground filtration system and particles flow through and are filtered perfectly. Heavy rocks! Be careful putting them in a glass aquarium! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Landru",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "as expected",
      "text": "as expected, had your basic large smooth stones with a few \"unique\" ones mixed in there too. pleased with purchase. ended up buying 5 bags. 3 to cover the bottom of my 75 GAL and two more to make the rock basking platform",
      "rating": 5.0,
      "verified": true,
      "author": "natelie",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Should have bought 3 bags",
      "text": "I have a 44 gallon corner tank and 2 bags covered the bottom. Going to buy one more bag for better coverage so he can dig around like turtles do. Love the colors of the rocks!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy and Billy",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Look great in my turtles aquarium",
      "text": "Look great in my turtles aquarium, too big for him to eat but gives him a nice substrate to walk on instead of the smooth glass he was on before. I might order these for another aquarium because I just like the look of them",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Olstad",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Dirty rocks",
      "text": "The rocks were very dirty I had to soak them overnight and scrub them down. They still make the water very dirty. I wanted to return it but is would cost me more to return it then what I paid",
      "rating": 2.0,
      "verified": true,
      "author": "Ava P",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Funny turtles <3",
      "text": "My turtles think they are in the wild...they try to look for stuff under the rocks and move them around, it's too cute. Later they end up eating their crap under the rocks... but It makes them happy so I'm happy !!",
      "rating": 5.0,
      "verified": true,
      "author": "sara a.",
      "helpful_votes": 4,
      "publication_date": 20160621
    },
    {
      "title": "Good alternative for fish tanks",
      "text": "Rocks advertised for aquariums are typically overpriced. These were much less and are of good quality. I used some in combination with fluorite for a planted aquarium. I like it very much!",
      "rating": 5.0,
      "verified": true,
      "author": "Wilson",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Perfect for what I needed",
      "text": "These are for the bottom of planters for my plants. Works for what I needed. Next time maybe do not pack them in the same box with items that can be broken tho. Was rather disappointed when I opened the box and the little hand mixer/milk frother box was beaten up. Thankful it worked.",
      "rating": 5.0,
      "verified": true,
      "author": "CarolynB",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "My box and ybs love these",
      "text": "My turtles are happy. These are much softer on their feet than gravel. My small box turtle has a hurt foot and when I switched to these from gravel she was walking all over her tank. She loves them",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20170417
    },
    {
      "title": "Heavy",
      "text": "Cute for my turtle tank, had to buy a few more bags because they didn't fill out as much as I thought they would. Very sturdy and heavy so my turtles cant just move them around easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Grace McCollum",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "They covered the bottom of my 10 gallon tank with ...",
      "text": "They covered the bottom of my 10 gallon tank with no issues. Since the tank has a dock and some \"plants\", it's enough for me. Turtles seem to have no issue with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Lulu",
      "helpful_votes": 2,
      "publication_date": 20170725
    },
    {
      "title": "Lower grade rock. Many broken. Not like store bought bag of the same product.",
      "text": "Very disappointed in the quality of rocks received. Many many were broken and rough. I bought the exact same product from the local pet store and all were perfect. It seems like the bags being sold here are of a lower grade.",
      "rating": 1.0,
      "verified": true,
      "author": "toitle",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Good Purchase",
      "text": "I have a 30 gallon tank, so I bought two bags and they laid out very nicely. I can't lie though I get scared when I clean my tank and put them back in because I think they're gonna break the glass. Not only that but they pull back on my cuticle when I'm taking them out, but they are smooth and dont harm my turtles.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenzie",
      "helpful_votes": 0,
      "publication_date": 20170629
    },
    {
      "title": "Perfect !",
      "text": "Purchased this for a 10 gallon tank ... it is perfect ! Bag filled up the whole tank. Just make sure you wash the rocks out before placing in tank , they have dirt on them !",
      "rating": 5.0,
      "verified": true,
      "author": "Destiny Martinez",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Natural looking but really dirty",
      "text": "They’re a good size for turtles and have nice natural colors but are really dirty and have to wash a lot and even after doing that they weren’t completely clean. Also the residue sticks on the tank’s glass",
      "rating": 2.0,
      "verified": true,
      "author": "Iruma",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Solid",
      "text": "Bought 2 bags for 75gal. Overall a pretty good product. They are smooth and very nice looking. My turtles like to dig at the rocks and they are able to do so without causing complete chaos with the design.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen P.",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Best quantity for quality in price range!",
      "text": "Thus far, awesome product. We have an autistic foster child who is obsessed with all things under water. My wife and I decided on a turtle tank. We have a 40gallon long tank, 3 bags worked as just enough. I did soak them in bleach water for 15 min and thouroughly rinse and let fully air dry before putting them in the tank. Pictures will be added as soon as we have it all complete.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Wonderful for turtles",
      "text": "I really recommend these... the stones are really smooth, all different sizes and colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula K Hinton",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Are these natural rocks?",
      "text": "Good on first sight. the size is just right for the turtles that they won't try to eat it. Problem is the rocks fade and break down over time (1 month), make me wonder if they are true natural river rocks. Some of the dark colored ones show patches of transparent pink/white. half of the rocks now has cracks & holes on them. Couple broke down to small pieces as if it's made of bricks...",
      "rating": 2.0,
      "verified": true,
      "author": "Shylo",
      "helpful_votes": 0,
      "publication_date": 20160719
    },
    {
      "title": "I have a 10 gallon tank and they look great! There were some broken pieces but I threw ...",
      "text": "I have a 10 gallon tank and they look great! There were some broken pieces but I threw them away after cleaning them before adding them to my tank.",
      "rating": 5.0,
      "verified": true,
      "author": "Tory",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Perfect! My turtle loves them",
      "text": "My turtle loves these rocks! The previous owner was using cheap fish pebbles and my turtle I noticed would try to eat them. so as soon as i found these i knew I needed them they are just the right size for my turtle and I notice he’s a lot happier because he can move around a lot better I used about a bag and a half of these to fill the bottom of my tank perfectly! Extremely pleased with these rocks",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Hard to clean",
      "text": "I liked the rocks but it is a pain in the butt to clean, I soaked for 15 minutes and washed and washed and washed, thought I got all residue off, nope, made my tank very stinky (I had run my filter over night and didn’t put my turtles in it) now my water is cloudy and just pain in my butt now! Probably won’t order again!",
      "rating": 2.0,
      "verified": true,
      "author": "Kristen Todd",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Rocks",
      "text": "Used to fill tank on one side for drying off the turtle.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Wish we had more",
      "text": "We love these. We wish we'd added more in our setup. Our plecos seem to like hanging on here as well.",
      "rating": 5.0,
      "verified": true,
      "author": "KBJA Field",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Beautiful colored rocks for almost half the price of local ...",
      "text": "Just what we needed for sons axolotl tank. Beautiful colored rocks for almost half the price of local pet store.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "Great buy",
      "text": "Fast shipping, exactly as advertised, will be perfect for my turtles",
      "rating": 5.0,
      "verified": true,
      "author": "Bethany Smith",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Natural and Necessary",
      "text": "Pretty rocks, they are covered with slider poop now and ready to be replaced. Can i get another round please!",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie Valent",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Perfect size and great price.",
      "text": "Perfect size for my needs and much cheaper than at the pet store.",
      "rating": 5.0,
      "verified": true,
      "author": "Casices",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Turtle approved",
      "text": "These smooth pebbles are great, but they do break down over time, and some are magnets for algae growth. However, that can be avoided with a minimal increase in care. My turtle definitely appreciates them.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Good amount",
      "text": "I have a 10gl and it was good for it but anything bigger and you might need more begs",
      "rating": 5.0,
      "verified": true,
      "author": "Adrian Avila",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Excellent addition for my turtle tank...looks great and creates a nice environment for my Turtle",
      "text": "The Exo Terra Turtle Pebbles are a great addition to my turtle tank. They look really nice and because they are the real thing they make our turtle's enviroment genuine and eco friendly in appearance and environmental safety. The turtle seems to really like them too...he often swims down to move the pebbles to get his food that sank to the bottom...and, he sit down there a lot too...I think he likes the feel of the soft, rounded stones and pebbles on his underside...! ...??? I'll probably be getting more of these when I move my turtle to a larger tank. I recommend these to anyone for turtles, fresh water fish or other critters. PWN.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul W. Norman",
      "helpful_votes": 6,
      "publication_date": 20121130
    },
    {
      "title": "Great turtle pebbles",
      "text": "Great pebbles. Not quite enough for my 20 gal. tank, but I will be buying more.",
      "rating": 5.0,
      "verified": true,
      "author": "Old hen",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Four Stars",
      "text": "Look very nice in the tank, help keep the tank look orderly. Will definitely order more in the future.",
      "rating": 4.0,
      "verified": true,
      "author": "JainaTop Contributor: Pets",
      "helpful_votes": 2,
      "publication_date": 20161215
    },
    {
      "title": "Rocktastic",
      "text": "For rocks them simply rock! After a few minutes of rinsing the rocks in a strainer they were ready for the aquarium. they look great in the aquarium a good mix of colors and all nice and smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan ",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "Good, Sort of",
      "text": "I bought this for my RES turtle that is 7-8\" long. She hated them. But she has always been strange. If your turtle don't mind them, then they are a good find, but if you have one like mine that hates having things in her tank, save your money.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20140620
    },
    {
      "title": "These are so beautiful and polished",
      "text": "These are so beautiful and polished! My turtles love them and have been playing around in them since I've added them to their tank! I am going to have to order some more.",
      "rating": 5.0,
      "verified": true,
      "author": "Dare",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "Rinse rocks two to three times",
      "text": "Very nice rocks but take a couple rinses to remove debris",
      "rating": 4.0,
      "verified": true,
      "author": "Brown91",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Five Stars",
      "text": "My turtle really like these instead of rocks I had in aquarium.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "A wonderful product",
      "text": "Beautiful pebbles perfect for aquarium to give a natural look!",
      "rating": 5.0,
      "verified": true,
      "author": "Shelly",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Nice!",
      "text": "Nice looking rocks. Will need two bags for a tank 29 gallons or larger.",
      "rating": 4.0,
      "verified": true,
      "author": "Sam McDonald",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Good Value",
      "text": "I like the rocks I would call them medium size. I would like to note that the colors do not really match the pictures. They are a lot more brown/white and natural looking then the darker greys and blues shown in the picture. That was okay with me because that matches the color scheme in my aquarium better but if I was specifically looking for darker colored rocks I would probably have given these 2 or 3 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20120707
    },
    {
      "title": "Perfect turtle rocks!!",
      "text": "The rocks are great. Heavy box! Lol box of rocks!! They are clean, and the size I expected. They are absolutely perfect for a tank.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashlie07",
      "helpful_votes": 0,
      "publication_date": 20161018
    },
    {
      "title": "Great for turtles.",
      "text": "These look great in my turtle tank.i will but again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Wack",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "LOVE THEM",
      "text": "Purchased these to go in my turlte's tank. They are perfect size so the turtle can't try to eat them. I would and probably will order these again.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Kahl",
      "helpful_votes": 0,
      "publication_date": 20160531
    },
    {
      "title": "smaller than anticipated",
      "text": "I mean it says Large but they aren't really i guess if you consider a pebble being a chip but really smaller than anticipated",
      "rating": 3.0,
      "verified": true,
      "author": "Neospell",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Beautiful natural rocks",
      "text": "These are beautiful stones. They look so lovely in my turtle tank and the Amazon price beats any fish store for sure!! (Paid $17 a bag at PETCO). However, you could go to Home Depot and buy a large bag from the garden section of river rocks for $4.xx a bag and it's about 5 times the size of these. For a small tank I would recommend definitely but if going larger l, try bulk at a home improvement or landscaping place...just wash them with water very very well first!",
      "rating": 5.0,
      "verified": true,
      "author": "Alissa",
      "helpful_votes": 5,
      "publication_date": 20160723
    },
    {
      "title": "Quality sucks",
      "text": "Some rocks are cracked and sharp. Not good for little water turtles",
      "rating": 1.0,
      "verified": true,
      "author": "LeoValenz",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Excellent product!",
      "text": "Great for our Red Earred Sliders who cannot have bottom gravel substrate (substrate is important & rocks should be no small than what these turtles could possibly eat, swallow, or become lodged between skin and shell).",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy Olson",
      "helpful_votes": 0,
      "publication_date": 20151025
    },
    {
      "title": "Nice and smooth",
      "text": "Very clean pebbles, only needed to rinse it. Nice and smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Lin",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Too hard to clean",
      "text": "Looks great, but it's too hard to clean. I tried cleaning the rocks with a gravel cleaner, but it doesn't work. The only way to get them clean is to remove them from the terrarium and wash them by hand",
      "rating": 1.0,
      "verified": true,
      "author": "T. Kane",
      "helpful_votes": 0,
      "publication_date": 20150221
    },
    {
      "title": "Awesome",
      "text": "Bought two bags for my 29 gallon tank fit perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Looks great.",
      "text": "Purchased one bag for a 20 gallon tank and it made a nice even layer. Will definitely be buying another bag to add a deeper bed of pebbles to bury plants and such. A little noisy, but very aesthetically pleasing. My only complaint is I wish they were more clear on how to clean them.",
      "rating": 4.0,
      "verified": true,
      "author": "Luis",
      "helpful_votes": 0,
      "publication_date": 20150511
    },
    {
      "title": "Some pebbles were quite small, i had to take ...",
      "text": "Some pebbles were quite small, i had to take them out of the bunch so my turtle wouldn't accidentally swallow it. Also, took a lot of washing, the water turned murky white and rinsed it so many times.",
      "rating": 4.0,
      "verified": true,
      "author": "mayumi",
      "helpful_votes": 0,
      "publication_date": 20150425
    },
    {
      "title": "As expected",
      "text": "Mostly round, was hoping for more variety. The turtle seems to love them though",
      "rating": 5.0,
      "verified": true,
      "author": "Failte Acres",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "Nice Rocks!!",
      "text": "I purchased these to put in the tank for a turtle that we are baby siting for awhile. His tank had the small multicolored rocks which I found out are not the best for Red Eared Slider Turtles, so I purchased these. He loves them and will push them around while \"playing\"!!",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Thompson",
      "helpful_votes": 0,
      "publication_date": 20120525
    },
    {
      "title": "Not great for turtles",
      "text": "I would not advise using these with turtles. Food tends to get stuck in between the rocks and the only way to really clean is to take all of the rocks out and scrub which is a very big job if you are using a 20 gallon tank...",
      "rating": 2.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Love them",
      "text": "These rocks are beautiful for my aquarium . The stones Are huge which makes it easier to clean the tank with c:",
      "rating": 5.0,
      "verified": true,
      "author": "Jonnie",
      "helpful_votes": 3,
      "publication_date": 20150423
    },
    {
      "title": "Just what I need",
      "text": "I'm very pleased with my purchase. They are big enough that my turtle can't eat them. They bring a more natural feel to the tank. I bought two 10 pound bags for my 40 gallon breeder tank 36x18. It covered the bottom except for a couple bare spots. I'm going to buy 1 more bag. Just like any other rock or gravel they need to be rinsed very well. I placed the rocks in the bathtub with hot water and shook /moved them around for a few minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160114
    },
    {
      "title": "Nice big rocks to keep critters from eating them",
      "text": "Nice big rocks to keep critters from eating them. Some are pretty cool looking. I ended up needing just shy of two bags to adequately cover the bottom of a 10-gallon tank.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "Very impressed with these rocks! They are all very ...",
      "text": "Very impressed with these rocks! They are all very smooth and mixed in the basic browns there were some very unique colors and patterns. Will purchase these again",
      "rating": 5.0,
      "verified": true,
      "author": "Erin E",
      "helpful_votes": 0,
      "publication_date": 20170606
    },
    {
      "title": "ok if you have a larger turtle",
      "text": "They're a little too large for my little turtle, so next time I'll get the medium. Have to really rinse them before use, because they're very dirty/dusty when you receive them.",
      "rating": 3.0,
      "verified": true,
      "author": "ChristinaP",
      "helpful_votes": 0,
      "publication_date": 20150805
    },
    {
      "title": "Great product",
      "text": "The pebbles work great for our turtle we ordered 3 bags for a 55 gallon tank",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Carrera",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Happy Turtle!",
      "text": "Product is as described. Perfect for larger turtles. Nice natural assortment of colors as pictured. Looks great in tank. Not much pre-cleaning required.",
      "rating": 5.0,
      "verified": true,
      "author": "Janette P",
      "helpful_votes": 0,
      "publication_date": 20160414
    },
    {
      "title": "USELESS",
      "text": "Please don't waste your money on these pebbles....very difficult keep clean and keep clean.....save your money!",
      "rating": 1.0,
      "verified": true,
      "author": "Paul D",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Very natural looking, tons of beautifully colored stones!",
      "text": "They were beautifully colored, very natural looking, and all of them were different shapes, sizes and colors!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessie Amanda ",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Good.",
      "text": "Good. My turtles don't eat it, and they like to hide their poops underneath.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20161004
    },
    {
      "title": "Great product for turtle tank",
      "text": "Safe size for turtles Good mixture of colors You need at least 2 pack for 20G-Long tank",
      "rating": 5.0,
      "verified": true,
      "author": "oaltinok",
      "helpful_votes": 0,
      "publication_date": 20160417
    },
    {
      "title": "Exactly what expected however",
      "text": "Exactly what I expected but is a little over priced. Went to Menards and bought rock for 2.49 for 10 pounds",
      "rating": 4.0,
      "verified": true,
      "author": "Paula",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "made cage way to hard to clean",
      "text": "with the rocks in my tank it was horrible to try to keep clean. I have turtles and the rocks had my water cloudy in 2 days I took them out and my tank is a lot cleaner.",
      "rating": 2.0,
      "verified": true,
      "author": "teresa salazar",
      "helpful_votes": 0,
      "publication_date": 20140121
    },
    {
      "title": "Would be a great product if aquatic turtles weren't difficult to clean",
      "text": "Would be a great product if aquatic turtles weren't difficult to clean, the rocks made it hard for my turtle to walk on.",
      "rating": 4.0,
      "verified": true,
      "author": "Frankie Hathaway",
      "helpful_votes": 0,
      "publication_date": 20150914
    },
    {
      "title": "Five Stars",
      "text": "Just the right size, smaller than you think. Turtle loves to flip them all day long, lol!",
      "rating": 5.0,
      "verified": true,
      "author": "Roberto F.",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "Three Stars",
      "text": "for a 10 gallon tank you need 2 bags of these to cover the bottom.",
      "rating": 3.0,
      "verified": true,
      "author": "camachohead",
      "helpful_votes": 0,
      "publication_date": 20161011
    },
    {
      "title": "Five Stars",
      "text": "These matched the stones I had in my tank perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "my turtle loves his new home",
      "text": "what a difference these rocks make in the tank! went from boring to a brand new \"crib\" love them..",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Wallett",
      "helpful_votes": 0,
      "publication_date": 20151017
    },
    {
      "title": "Turtle seems to be satisfied. Pebbles are smaller than expected",
      "text": "Turtle seems to be satisfied. Pebbles are smaller than expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra P D Bushnell",
      "helpful_votes": 0,
      "publication_date": 20161028
    },
    {
      "title": "Great service all around!!!",
      "text": "I like the delivery service and product very much. Was on time with in the window and had updates. Will use again thanks !",
      "rating": 5.0,
      "verified": true,
      "author": "Miguel lopez",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Pond rocks, but worth it!",
      "text": "Not too big and not to small. Perfect size for my turtles. provides a natural feel to any aquarium.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina ",
      "helpful_votes": 0,
      "publication_date": 20150925
    },
    {
      "title": "Great rocks with a good variety of shapes/sizes/colors, safe for turtle",
      "text": "These definitely spice up the turtle cage while being easy to manage/safe. The only things I didn't like is that despite washing them, my aquarium was heavily clouded for over a day after putting in.. Also, it is easy to put in too much....two bags is more than enough for a 36\"x18\" breeder tank. Also, when piled against each other - there isn't that much space for ghost shrimp/other small fish to hide...the rock shapes are all relatively smooth which is good for the turtle but means that the rocks can really fit in tightly against each other.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew Marlowe",
      "helpful_votes": 0,
      "publication_date": 20140410
    },
    {
      "title": "Clean and Inspect before use",
      "text": "Please be sure to inspect and clean these rocks properly as I found a cigarette butt in one of the 3 bags I ordered. Otherwise though they are good rocks and fairly inexpensive !",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Three Stars",
      "text": "I liked the size of the rocks and it looks great but had to rinse it off very well.",
      "rating": 3.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20160110
    },
    {
      "title": "Great quality",
      "text": "Shipping was fast. Turtle seems happy. Will order again need more rocks.",
      "rating": 5.0,
      "verified": true,
      "author": "jennifer quinonez",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Nice Rocks to add Decor",
      "text": "Purchased 2 bags for a 20 Gallon tank. I already had some rocks in there. I think 3 bags would be good for a 20 Gallon tank. They are just rocks but definitely add decor to my turtle tank. My turtle enjoys picking at them too.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria Colasuonno",
      "helpful_votes": 0,
      "publication_date": 20150604
    },
    {
      "title": ".......",
      "text": "Not bad rocks for the turtle, not too happy though. I bought two of these and the color is way way off. Not really matching my setup how I was planning.",
      "rating": 3.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20120605
    }
  ],
  "product_meta": {
    "title": "Exo Terra Turtle Pebbles, Large",
    "description": "Exo Terra turtle pebbles are smooth river pebbles that have rounded over time in fast moving rivers. The smooth pebbles prevent injury to bottom dwelling or foraging turtles. The variations of colours and patterns create a natural looking riverbed. Round pebbles 5/9-inch to 5/8-inch, perfect for turtles with a shell diameter of 4-inch or more. Easy to clean and re-use. Soak and disinfect pebbles by placing them in a large bucket of water for 15 minutes. Rinse until all of the visible particles are removed and the water runs clean. Comes in pack of 2. Available in 10-pound plastic pack with large size.",
    "rating": 4.6,
    "feature_bullets": [
      "The smooth pebbles prevent injury to bottom dwelling or foraging turtles",
      "The variations of colours and patterns create a natural looking riverbed",
      "Round pebbles 0.3-0.4-inch, perfect for turtles with a shell diameter of 4-inch or more",
      "Available in 10-pound plastic pack with large size"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3 x 9 x 13 inches; 9.85 Pounds",
      "Item model number": "PT3833",
      "Department": "Substrates",
      "Date First Available": "January 21, 2010",
      "Manufacturer": "Exo Terra",
      "ASIN": "B0035HD408",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Rocks",
      "Reptiles & Amphibians",
      "Habitat Décor",
      "Pet Supplies"
    ],
    "price": ""
  }
}