{
  "website_summaries": [
    {
      "verdict": "The Sony BDP-S570 is probably the best all-round Blu-ray player yet. Not only does it rock with Blu-ray discs and SACDs, it blows the doors off the brave new world of TV streaming. Having BBC iPlayer on tap is a huge attraction, and if you have media files on USB, this deck will do its utmost to play them. For the cash, you just can't carp.",
      "pros": [
        "High-quality Blu-ray playback",
        "Full HD 3D compatibility",
        "BBC iPlayer heads up an impressive list of streaming content",
        "Sony's Bravia Internet Video portal",
        "Excellent file support for media on USB"
      ],
      "cons": [
        "You'll need a new HDMI v1.4 AV receiver to integrate it into your home cinema",
        "Navigating the volume of services is a challenge",
        "Limited file support when streaming video across your home network"
      ],
      "aspects": {},
      "publication_date": 20101022,
      "rating": 9.3,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "An 8 year problem SOLVED!",
      "text": "I have an analogue TV. Most people have no idea what i'm talking about. My TV is HD. It's a great TV. But I have no HDMI connection. Everything I tried to get Internet onto my TV proved useless. We bought this Disc Player and it WORKS PERFECTLY. Yah!!!! An 8 year problem SOLVED!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Andree",
      "helpful_votes": 2,
      "publication_date": 20170625
    },
    {
      "title": "Excellent Blu-Ray Player",
      "text": "I needed a replacement blu-ray player, but unfortunately my older HD television does not have HDMI inputs. I am stuck with component video as the only HD resolution alternative. I ordered this player only because it has component video outputs, but I have to admit that the wireless wi-fi capability was a definite bonus. It arrived right on time, in excellent condition. It was even gift wrapped so that prying eyes wouldn't see the word SONY all over the box and make off with it when the delivery was left on the doorstep. Hook-up was easy. The picture quality is excellent (well, as good as I can determine on a 55 inch tv at 1080i). Hihgly Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig Hutton",
      "helpful_votes": 3,
      "publication_date": 20130816
    },
    {
      "title": "Not Fully Tested Blu-Ray player",
      "text": "I bought this one to replace the same existing 2010 model that I had that would not load movies. Though it would be simpler to do this. After hooking the Player up, it would play movies, but when I tried to connect to the my wireless network, I tried at least a dozen times with no success. All the apps for Netflix, Prime Video, Hulu, etc. were all missing. I returned the player for a refund. Bad lesson of not to buy used equipment.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel Cheng",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "It hangs up on acquiring internet content for several minutes...",
      "text": "on occasion, but other than that it is great! I use it to listen to music and photo slide shows from my laptop using dlna and my home network, though not all common media formats are supported through this connection. Netflix is good, youtube is ok, but not all youtube videos are available. Disks load fast and look great. Due to the availability of programs on netflix, I have not really any watched cable, considering canceling it. If it did not hang on \"acquiring internet content\" which at times lasts several minutes, would display all youtube videos, along with Vimeo, and would play all media types through dlna, it would be a 5 star product for sure!",
      "rating": 4.0,
      "verified": true,
      "author": "D. nichols",
      "helpful_votes": 0,
      "publication_date": 20110128
    },
    {
      "title": "big problems streaming Netflix",
      "text": "The disc player function works fine, but the player doesn't stream well. I've done all possible trouble shooting with wired vs wireless connection, new modem and router, internet speed testing, etc. It's definitely a problem with the blu-ray. When playing Netflix it stops every few seconds and says \"Loading. Please wait.\" Sometimes we can get a solid 20 minutes out of it, but it's hit and miss. We've had some problems with streaming Pandora, too.",
      "rating": 1.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 2,
      "publication_date": 20140216
    },
    {
      "title": "Sont BlueRay",
      "text": "This BlueRay player is a good buy. I installed without problem. I had to learn how to get connected to the various online services such as Netflix. But they generally work the same so after the initial learning experience the rest were easy. Setup procedures went without problems. The biggest problem was having to to the Sony web site to get directions on how to use the remote device to key in my routers security code. This information should be in the paper manual delivered with the player. All in all though I would recommend this player for anyone who wants a BlueRay player.",
      "rating": 4.0,
      "verified": true,
      "author": "James M. Overby",
      "helpful_votes": 0,
      "publication_date": 20110210
    },
    {
      "title": "Sony BDP-S570 3D Blu-ray Disc Player",
      "text": "I use this player to play DVDs and Blu-Ray discs; I stream NetFlix and have done one software upgrade online. I was able to do everything with little difficulty; if I can do it anyone can. I have had it for a little over a month and had no issues with it. The remote is sized well with decent buttons; nothing is too big or too small. The time it takes to insert a disc to playing the disc is reasonable; I don't think I played more than six blu-ray discs and they play about as fast as a DVD. All the blu-ray I did play worked just fine. It has enough inputs and outputs for my use.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerald Williams",
      "helpful_votes": 0,
      "publication_date": 20110304
    },
    {
      "title": "Sony Blu-ray doing OK",
      "text": "I got this DVD to upgrade to blu-ray and my Netflix account, I also wanted to get ready for video streaming. The comments about the DVD playing were pretty good. When I first hooked it up it saw my wireless router(still a G router, dual band router coming soon) and downloaded the updated software for the DVD. The DVD was suppose to load really fast and be ready to play before you could get back to the couch. Well not really, the loading still takes at least a minute or more. Other than the slow load of the DVDs everything else seems fine. Picture is good, although I am not an expert.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Holland",
      "helpful_votes": 0,
      "publication_date": 20110224
    },
    {
      "title": "Great Blu-Ray and Streaming Video player, but......",
      "text": "I really like this player but the reason I purchased this model was for the WiFi. It replaces a PS3 which I moved into another room. PS3 worked great and never had any problems connecting to my wireless network. But after setting it up, I find that the internal WiFi is terrible. Found the network right away, then lost the connection. I was going to return it for the 370, but thought the 570 even without WiFi was still a better product. Now that I spent several days running ethernet cables throughout my house, I've connected the player using the wired setup and it's great. If you're buying this for WiFi, think twice.",
      "rating": 3.0,
      "verified": true,
      "author": "Dr. Ray Comfortable",
      "helpful_votes": 0,
      "publication_date": 20110117
    },
    {
      "title": "Internet Down Message every time!",
      "text": "Every time I try to watch video from Netfix, Amazon Instant and Crackle. I get a message saying 'your network must be down. Check you internet connections. The internet is never down when I get the message. This does not happen on Tivo or even my Wii player. Sometimes when the video is interrupted with this message, when it finally comes back up the video will start from the beginning, even the video nearly over. This problem is very annoying. I am able to play dvds and blue rays with no problems.",
      "rating": 2.0,
      "verified": true,
      "author": "CTree",
      "helpful_votes": 0,
      "publication_date": 20130809
    },
    {
      "title": "wifi works great.  don't buy lower model",
      "text": "The wifi setup was fast and easy and the speed is excellent. I don't know the exact resolution we are getting, but it looks awesome. I am using an old wireless B router and the connection is super fast. DO NOT BUY THE LOWER MODEL IF YOU WANT TO CONNECT TO THE INTERNET. The lower model has to have an ethernet cable connected or you must by the SONY BRAND ONLY wifi device which makes the total cost more than this model. Also, this model does a great job with automatically updated the firmware version. You will not be disappointed with this bluray player.",
      "rating": 5.0,
      "verified": true,
      "author": "Matteo Tucker",
      "helpful_votes": 0,
      "publication_date": 20110110
    },
    {
      "title": "Lousy Netflix Player",
      "text": "I bought this because I wanted a Netflix device. My experience with it has been awful. I've got it hardwired to my LAN and the thing stalls as if there are low data rates starting about 9:00 PM every night. While my Sony device is sitting stalled, I've got my Mac Powerbook open streaming THE SAME MOVIE from a wireless connection. In fact, it's streaming as I type this review. Why would the Sony sit in a state that looks like it's being confronted with low data rates while a wireless device on the same network is playing? Cannot recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott Butler",
      "helpful_votes": 2,
      "publication_date": 20110126
    },
    {
      "title": "Has trouble streaming",
      "text": "This player does fine with discs, but when I use it to stream video from Netflix or Amazon, it frequently interrupts the program with the message \"Network error\" or some other cryptic phrase. I know there's not really a problem with my network because such interruptions never happen when I use my TV itself, or my son's Playstation 3, to stream the same programs from the same source. So don't buy this machine expecting to rely upon it for streaming, a significant negative in a time when streaming is rapidly displacing discs as the preferred way to access video.",
      "rating": 2.0,
      "verified": true,
      "author": "Aging  Boomer",
      "helpful_votes": 0,
      "publication_date": 20110216
    },
    {
      "title": "The Only Way To Watch TV",
      "text": "Takes awhile to get everything registered and WiFi ready and seems like the instructions could have been a little better written. Despite that, I would absolutely recommend this product. The picture quality is top notch and the player is very responsive to commands and runs smoothly and quietly . I have been using this product for about a month extensively and it has performed flawlessly. To have all the choices of movies and other content is fabulous. If you hate all the commercials on regular TV as bad as I do your gonna love this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Crowwing",
      "helpful_votes": 0,
      "publication_date": 20101224
    },
    {
      "title": "The Best Blu-Ray Player",
      "text": "Initially I purchased one of the new Sony Blu-Ray players just to see how it worked. I was so happy with its performance that I purchased a second one a week later. Internet access via my wireless network was simple and quick. The performance of the movies from Netflix is fantastic, and the ability to access videos on my home computers (via PlayOn) is great. For the money and the top notch performance of this player no other Blu-ray player comes even close. Buy two and connect to Netflix and your computers easily.",
      "rating": 5.0,
      "verified": true,
      "author": "G. R. Mears",
      "helpful_votes": 3,
      "publication_date": 20100716
    },
    {
      "title": "Sony did a nice job on this player!",
      "text": "I replaced a Sony PS3 with this DVD player and I couldn't be happier! It connected to my 5.8Ghz router in a snap (you do have a choice between the standard 2.4Ghz and the 5.8Ghz Wifi network frequencies.) While I don't have a Netflix account yet, it streams videos very nicely from Youtube and some of the other video streaming services. It's easy to setup and use, especially with the existing Sony sound system and the Sony HDTV. It's a Sony, what more can I say? I highly recommend this DVD player!",
      "rating": 5.0,
      "verified": true,
      "author": "W. Stubbs",
      "helpful_votes": 0,
      "publication_date": 20110211
    },
    {
      "title": "Great Blu Ray!!!",
      "text": "I truly don't understand the negative reviews on this player.. Any number of devices can be defective, I guess. We found this blu ray very easy to install right out of the box. Quickly loads movies, etc, and it's features are endless. For a player that offers so much you would normally pay over $200+!! Navigating the menu is pretty simple as well. Our folks bought a different player at Best *** for $180 and theirs doesn't have half the features ours does. We like the fact the the front panel buttons are not easy to push since we have two little kids in our house.",
      "rating": 5.0,
      "verified": true,
      "author": "ShoeJunkie",
      "helpful_votes": 0,
      "publication_date": 20110715
    },
    {
      "title": "Great buy for the money",
      "text": "This player was a great price and it was delivered to us ahead of schedule. It was easy to hook up, and the wireless configuration was a breeze, but we are still having problems with the Netflix registration. you have to register it seperately, and the Sony website is having issues with my account. We'll get it resolved. The only recommendation I would have is creating an account on Sony first. If you use the guest account you will have a hard time registering all the extras that come with this player when you need to activate them.",
      "rating": 5.0,
      "verified": true,
      "author": "KLSterling",
      "helpful_votes": 0,
      "publication_date": 20110108
    },
    {
      "title": "one of the best bluray player!",
      "text": "I received this player yesterday. Setup is very breeze and easy. connect to my router via wired setup and the player automatically connect to the internet. The player automatically detect my laptop that connected through wireless and I'm able to play video, music and view photos. Got tons of free apps : Pandora, Slacker, Fearnet, epicurious.com, wired, myplay, youtube, and the list goes on and on. Haven't try pay subscription or playing bluray/dvd yet. Hulu Plus also included. so far I'm happy with the system.",
      "rating": 5.0,
      "verified": true,
      "author": "Kits",
      "helpful_votes": 0,
      "publication_date": 20101201
    },
    {
      "title": "good deal",
      "text": "i gave it as a gift, but they liked the product very much",
      "rating": 4.0,
      "verified": true,
      "author": "Frances Mary Fischer",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Not bad at All",
      "text": "After reading previous reviews on the item. Taking into account some of the short comings mentioned. I think I made a pretty good choice. Flawless playback so far, with excellent quality. Not having a large array of BD I have yet to come across any compatibly issues. The only shortcomings were the small panel buttons until you become familiar with their location on the front panel, bring your glasses. Concerning the WiFi it's always best to hard wire if possible. But if not you will see some issues. But not worth keeping this player in mind.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Jones",
      "helpful_votes": 0,
      "publication_date": 20101130
    },
    {
      "title": "Perfect Machine",
      "text": "This BR DVD is terrific. I was up and running, including Netflix, in ten minutes. I was a bit apprehensive with some of the negative wi-fi reviews, but this connected in a snap. Netflix interaction is very cool too. For all of those who gave this machine a negative review because you can't connect, I would look at yourself instead of blaming Sony because while I'm no newbie, I am not a networking genius either. Don't think twice; for the price and features, I couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20110115
    },
    {
      "title": "Outstanding piece of equipment",
      "text": "I bought this Blu-ray player after my DVD player died. It was CNET's top rated player for the price. It was very easy to set up. I don't know that Blu-ray video is that much better than DVD (I have a 1080p, 120hz tv), but the audio is terrific. The channel separation and clarity is much better. I didn't buy this for the internet capability, but that has been a real treat and we're watching more movies through instant play that we ever have with discs. I would recommend this product to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "William E. Simmons",
      "helpful_votes": 0,
      "publication_date": 20101003
    },
    {
      "title": "Finally,  a Blu-ray player I can live with",
      "text": "This is my fourth Blu-ray player. One thing that has driven me crazy is how slow discs load, especially discs with gimmick-laden menu systems. My previous machine, an LG, was especially bad, even with the latest firmware updates. This Sony is blazingly fast, some DVDs load in as little as 1/10 the time of the LG. Also, none of the compatibility issues my previous players have had. Netflix streaming quality is noticeably better that previous machines, also. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20101206
    },
    {
      "title": "Very nice",
      "text": "This only streams online if you buy a separate electronic thingy, but we didn't do that. Just so you know. However, it plays the discs just fine. No real complaints--the remote control lost its signal once, but my husband had enough patience to figure out how to make it work again. I just jumped onto Amazon and ordered a Sony universal remote to make it work. Different strokes for different folks, I guess!!",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie Thompson",
      "helpful_votes": 0,
      "publication_date": 20130414
    },
    {
      "title": "Good Blu-ray player with all the bells and whistles",
      "text": "I bought this for my mother for Christmas. I got this model because it has wifi and Netflix and Pandora streaming. The Netflix streaming is still Netflix streaming, so it doesn't look that great compared to the sweet quality of blu-ray movies. The fact that my mother can use the features without calling me for help should encourage anyone afraid of all the bells and whistles included in this device. She uses Pandora and Netflix regularly without any problems over a wireless connection, so it's certainly working well! It supports 3D blu-ray, so it's somewhat future-proof. If I didn't already have a PS3 for playing blu-ray and Netflix, I'd buy one for myself!",
      "rating": 5.0,
      "verified": true,
      "author": "CalNemesis",
      "helpful_votes": 0,
      "publication_date": 20110118
    },
    {
      "title": "So far: at or beyond expectations",
      "text": "The player is indeed fast. The online add-ons work well so far: as well as (or better than) any on other TV or blueray player I currently own. My previous player was the LG BD-390 (not long ago considered by cnet and others as the top choice) - this player is quicker, has more functions, and was less expensive than the BD-390. The S570 build and software are high quality as well. I have not gotten to trying the 3D function yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20101226
    },
    {
      "title": "Can not view all youtube videos on this model!",
      "text": "Frustrating-I can not view all of the youtube videos in my playlists, for example, one list has 147 videos, mostly music but not all Vevo, but only 12 show up when I pull it up on the dvd player. I updated the firmware a couple of weeks ago and even less show up now! It seems to be a problem for many people with this player and I could not find any info on the Sony site as to if they are working on a fix or not. Does anyone know a fix or workaround for this? Thanks so much!",
      "rating": 3.0,
      "verified": true,
      "author": "6760",
      "helpful_votes": 0,
      "publication_date": 20110224
    },
    {
      "title": "Love my Sony Blu Ray",
      "text": "Everything works great on my Sony Blu Ray player. The WiFi works great. Netflix and Amazon pay per view work great and there is a wide seletion of other free and fee online content. All the native picture and HD video files from my Sony DSC-HX5 Cyber Shot play perfectly, as do most computer movie files, both from USB chip readers and DVD data disks (but not from my Iomega USB exernal drive). All in all, I'm very pleased with the player.",
      "rating": 5.0,
      "verified": true,
      "author": "William Brandt",
      "helpful_votes": 0,
      "publication_date": 20110416
    },
    {
      "title": "Great player!",
      "text": "So far the 570 has proved to be all it's supposed to be. BluRay discs seem to load faster than the older Sony player I replaced, and I might add, that I paid more for. BluRay picture is magnificent of course. I got this one for the streaming capability. Setting it up to \"talk\" with my router was a little tricky but once they made contact it has worked superbly. I can't speak of it's 3-D capability as I don't have a 3-D TV.",
      "rating": 5.0,
      "verified": true,
      "author": "John Peterson",
      "helpful_votes": 0,
      "publication_date": 20110302
    },
    {
      "title": "Top of the line.",
      "text": "This is clearly a top of the line product. While I expected excellent performance, I was surprised at the user-friendliness of this item in comparison to other Sony products that were so confusing to operate. I have barely needed the manual to install and operate its' many features. It works very well with other components, even those of different manufacturers. It installed very seamlessly with all of my differing entertainment modules. If you want the best, there is no other choice.",
      "rating": 5.0,
      "verified": true,
      "author": "jkhigh",
      "helpful_votes": 0,
      "publication_date": 20110501
    },
    {
      "title": "Open the damn door!  I shouldn't have to wait on that.",
      "text": "It's an excellent 3D blu-ray player. It has (or at least had in 2010) all the bangs and whistles you would expect. Network interface, Netflix, etc... Not much to complain about this this one except that sometimes when I want to load or unload a disc it tells me I have to wait a few seconds. Screw that, open the damn door! I shouldn't have to wait on that.",
      "rating": 4.0,
      "verified": true,
      "author": "msr-norwalk",
      "helpful_votes": 0,
      "publication_date": 20131011
    },
    {
      "title": "Very Good BD Player",
      "text": "I changed from a Samsung piece of garbage that had problems playing some of my titles to this Sony which powered through everything with no stalls or hiccups. Video quality is exceptional. Same with audio. Network connection was a breeze through my wired network. I really love the 15sec skip forward and backward button. I tended not to use the streaming services. I used an Apple TV and my Tivo for that. The Netflix connection only lets you see what's in your queue. For discs, this is a fantastic player.",
      "rating": 4.0,
      "verified": true,
      "author": "William Lueg",
      "helpful_votes": 0,
      "publication_date": 20110616
    },
    {
      "title": "WIFI appears to be weak",
      "text": "This unit has all the features you want. Easy navigation good picture quick start up. The wifi appears to be very weak and erratic.Using a g router the picture constantly stops. Excellent performance with a wired connection. The first unit I received would not connect wirelessly as something was wrong. Amazaon replaced the defective unit within 1 day, excellent service. Overall I am very satisfied with the performance.",
      "rating": 4.0,
      "verified": true,
      "author": "J. F. Thompson",
      "helpful_votes": 0,
      "publication_date": 20101231
    },
    {
      "title": "Awesome Blu Ray Player",
      "text": "I was a little sceptical when I read the reviews of some people regarding the Netflix Wireless streaming. Do not be dismayed. The wireless connectivity is awesome. I have netflix streaming wirelessly in my upstair bedroom while my router is my downstairs living room. It works great. The dvd loading and playing is very fast. I also have an older bdp s300. This is a huge improvement from that model. I would recommend anyone to buy this player. You will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Gautam Gupta",
      "helpful_votes": 0,
      "publication_date": 20110125
    },
    {
      "title": "Great network BlueRay player!",
      "text": "I bought the 3D version for future use, as I do not have a 3D-capable TV, but the price difference was not much at all. So, I haven't used the Blu-Ray disk or 3D features yet, but the network features are great. I had been streaming Netflix to my TV through an old laptop and my wireless home network - with moderate success and poor resolution. With the same exact wireless home network and service, I get high quality Netflix downstreaming with this unit - just love it! Adding Pandora was pretty easy too!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark in Cincinnati",
      "helpful_votes": 0,
      "publication_date": 20110203
    },
    {
      "title": "Sony BDP-S570 3D Blu-ray Disc Player",
      "text": "Sony BDP-S570 3D Blu-ray Disc Player arrived as advertised and on time. It is working flawlessly. Most pleased with the performance.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas B. Gardner",
      "helpful_votes": 0,
      "publication_date": 20170924
    },
    {
      "title": "Good device",
      "text": "I'm not an expert at home theatre but this devise was easy to hook up and use. I just wish there was a warning/instruction about having to perform occasional updates on it. Maybe there is and it's buried in the instruction manual somewhere but I think that advertising it as a feature would have been a good idea so I didn't have to find out the hard way when my device just stopped working.",
      "rating": 5.0,
      "verified": true,
      "author": "Marge McCahon",
      "helpful_votes": 0,
      "publication_date": 20130120
    },
    {
      "title": "Surprised it held up so well all of this time",
      "text": "This is actually a nice player. I was very nervous when it showed up and it was so light. It felt kind of flimsy to me because it is so light, but this has not been the case at all. It has gotten dropped off the stand a few times and it still plays like nothing happened. It streams VERY well. The only time there has ever been a problem with streaming is if there was a problem in our network, never the players fault. Movies are crisp and clear when we rent or buy, but we stream mostly.",
      "rating": 4.0,
      "verified": true,
      "author": "robert",
      "helpful_votes": 0,
      "publication_date": 20130313
    },
    {
      "title": "Great Blueray Player",
      "text": "I previously used a PS3 to watch blue-rays, so I can't compare this product to other stand alone Blue-ray players. That being said, I really like this one. Blue-rays load quickly and produce a terrific picture. The wireless functions/apps (netflix, youtube, etc.) work great even though my router is at the other end of my house(no lost signal). Easy setup and works flawlessly with my Sony soundbar/subwoofer. The only drawback so far is the netflix app. It will not allow you to search the database of movies. It only offers the ability to watch movies in your instant queue. The ps3 has a better netflix app. Other than that minor annoyance, I love this player.",
      "rating": 4.0,
      "verified": true,
      "author": "mackfoo",
      "helpful_votes": 0,
      "publication_date": 20101227
    },
    {
      "title": "Would Highly Recommend",
      "text": "Bought for my Dad for Christmas. I set it up for him, and it took less than five minutes from opening the box to having it wirelessly connected to the Internet and streaming Netflix. Very user-friendly and easy to use. Also, my Dad has a Sony LCD TV, so the remote seamlessly works with the TV and Blu-Ray player; one less remote my parents need to worry about is always a good thing!",
      "rating": 5.0,
      "verified": true,
      "author": "Troy W",
      "helpful_votes": 0,
      "publication_date": 20110104
    },
    {
      "title": "Great player for the money!",
      "text": "After my first generation Blu-ray player died, I say the reviews for this one and gave it a try. Good move on my part. These have come so far in just a couple years. The set up was very easy. I have a D-link `N' router - the player found it and worked through the encryption very quickly. The streaming is easy to use and great. The player itself is very good - fast startup and sharp picture.",
      "rating": 5.0,
      "verified": true,
      "author": "PKR",
      "helpful_votes": 0,
      "publication_date": 20110319
    },
    {
      "title": "Great Blu-Ray player",
      "text": "Works great, plays blu-rays and regular DVD (up-scaling) picture and sound quality is outstandingly. As soon as i pluged in the player there was a firmware update ready to go. Using player on a wired Ethernet connection,(have not tried wireless),, connected a 16 GB sony flash drive to rear USB port and in the player menu selected to use Rear USB flash drive instead of on-board memory. Plays Streaming netflix movies, with out and issues, no buffering / stuttering problems. All streaming media worked just fine. Plus the price was great also.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean J. Gordon",
      "helpful_votes": 2,
      "publication_date": 20101210
    },
    {
      "title": "Great Player",
      "text": "As other reviewers said I think your internet speed and wireless router play a large roll in how happy you are withthis product. I have a G Belkin wireless router and have absolutely no problem with my Netflix. DVD's look great. Only annoyance is trying to set everything up as i had to keep going back an forth between my bedroom (Where the BluRay was) and my office to get codes to complete all the set up for everything to connect from online registration. Whole process took about 30 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "aliciag",
      "helpful_votes": 0,
      "publication_date": 20101222
    },
    {
      "title": "Doesn't stream in surround sound",
      "text": "Know that this unit will not stream in surround sound. Everything else worked perfectly. Also, the unit runs extremely hot, so I would not recommend placing any components on top of it. I returned it because it did not stream in surround.",
      "rating": 3.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "easy intallation and fast play",
      "text": "So much better than my previous Samsung model, which always have problem playing bluray DVD. My suggest is Don't buy Samsung!!! This Sony one took me 5 minutes to install. Play bluray is fast and smooth. Wireless built-in allow me to watch Netflix and many other programs in stream. I recommand this model, rather than the one without wireless built-in. Do not buy wireless \"enabled\" model. That requires a Sony proprietary wireless adapter cost USD 79. Another problem I have with Samsung is Swival base of 46\" LCD TV. The swival base broke in a normal turn after a year. Samsung is still behind in many details.",
      "rating": 5.0,
      "verified": true,
      "author": "Chi Yu Lin",
      "helpful_votes": 0,
      "publication_date": 20110228
    },
    {
      "title": "Decent player for 1 year, followed by weird behavior, followed by DEAD",
      "text": "Main thing is that it started skipping and flashing and doing weird stuff after a year. Then a few days later it was pretty much incapable of video playback. For the year it worked.... Decent player. Disc playback: great Netflix streaming: so so Other features: don't care GUI: decent",
      "rating": 1.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 3,
      "publication_date": 20110824
    },
    {
      "title": "Another excellent SONY product!",
      "text": "I purchased this from Amazon to have a Player with Network capability. Loads Blu-ray discs much faster than my old Blu-ray player. Found my 2WIRE AT&T Wireless router immediately after entering the key. Excellent streaming Video performance. Nice small size. Easy to understand Remote Control & set-up instructions make this a winner in my book. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevon Huntley",
      "helpful_votes": 0,
      "publication_date": 20101216
    },
    {
      "title": "nice and compact",
      "text": "nice and compact, sleek design that blends in well with other devices. no overbearing display either!!. There were quite a few updates early on but have been minimal since. 3D capable, which is great for some of the content that I have watched on it. Wish they would have gone with the slot instead of a ejecting tray.",
      "rating": 5.0,
      "verified": true,
      "author": "LLCoolR",
      "helpful_votes": 0,
      "publication_date": 20130406
    },
    {
      "title": "Great Bluray player",
      "text": "Technically this Sony Bluray player is great; however the initial user interface was a little tricky. It did not respond well after initial connection (HDMI used); then after reconnect everything goes smoothly. The network connection was easy and quick; browsing and playing youtube videos were easy and flawless, but replay youtube videos wasn't easy or at least there is no clear steps to re-play again the same video if you don't start from initial search. Blurays disks plays very well and look great at 1080p.",
      "rating": 5.0,
      "verified": true,
      "author": "Checo Riojas",
      "helpful_votes": 0,
      "publication_date": 20110222
    },
    {
      "title": "Love it!!",
      "text": "I absolutely love this Blu Ray player. It is easy to use and the network setup was a breeze. It seamlessly connected to my router and the apps are great. DVD playback is crisp, clear and quick. Blu-ray movies are incredible. I don't have a 3D tv yet, but I do have a Samsung 46\" 120hz TV and the two work perfectly together. I would recommend this product to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Jdiamond34",
      "helpful_votes": 0,
      "publication_date": 20110212
    },
    {
      "title": "Great product!",
      "text": "We bought this Blu Ray player a few weeks ago and have enjoyed it very much. I don't know much about technology and how to hook anything up really but my husband really wanted this and loves it! He's an IT guy so he knows what he's talking about. I love how we can access youtube, netflix, blu rays, dvds and anything we want on this player. It was worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessie",
      "helpful_votes": 0,
      "publication_date": 20110209
    },
    {
      "title": "A Great Choice",
      "text": "I bought this DVD player primarily because my Sony BDP-S350 wouldn't recognize a blu-ray disk I authored with SONY Vegas Movie Studio Platinum 10. I was very frustrated because I intended to create at least 40 more family DVD's. Also this DVD I authored played in other SONY players that were older than the BDP-S350! Anyway I have been very happy with it and appreciate the built-in Wi-Fi capabilities and its ability to stream video. I plan to update the firmware later this year to allow for 3D playing. Of course it plays the DVD's I authored. Very fast and easy to setup.",
      "rating": 5.0,
      "verified": true,
      "author": "RLHenry",
      "helpful_votes": 4,
      "publication_date": 20101003
    },
    {
      "title": "Excellent Blu-Ray player!",
      "text": "I bought this blu-ray player to replace an older Sony model that had really slow load times and had trouble with some burned DVD's. This Blu-Ray doesn't disappoint. Pros: - Extremely fast load times - Superb picture quality Cons: - Extra Internet content little lacking. Gave it 4 stars, because the internet content isn't as good as some of the other players, but if you just use it for the blu-ray player functionality, it is definitely 5 stars!!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20100921
    },
    {
      "title": "trouble with my Sony BD",
      "text": "This DVD bluray is currently being sent to Sony for repair after only 2 months of slight use. It would freeze the picture about half way through all movies; otherwise the picture was great and so was the color. It may be I got a bad unit, but Amazon's 30 day policy caught me and I had to use Sony's 90 day warranty policy to get the repairs made. Meanwhile, I have no DVD player.",
      "rating": 2.0,
      "verified": true,
      "author": "Robert C. Pierce",
      "helpful_votes": 0,
      "publication_date": 20110311
    },
    {
      "title": "Good Player",
      "text": "Setup was very easy. Player logs onto our network flawlessy. A lot of content has been added to its menu since we got it. The player plays bluray and the image and sound are what you would expect from bluray. I would get this same unit again.",
      "rating": 5.0,
      "verified": true,
      "author": "Roy C. Lewis",
      "helpful_votes": 0,
      "publication_date": 20130927
    },
    {
      "title": "Great buy!",
      "text": "I bought this as a gift for my boyfriend. I did a lot of research on cnet and user reviews before deciding on this purchase. It hasn't disappointed. Load time is fast and the picture/sound is great! I don't use it for Netflix streaming as I already have my Wii set up for this and didn't see any reason to switch it around. Haven't used youtube, yet, either.",
      "rating": 5.0,
      "verified": true,
      "author": "amazonqueen",
      "helpful_votes": 0,
      "publication_date": 20110624
    },
    {
      "title": "Disappointed by Limited Netflix Support",
      "text": "Generally a good device, comparable to a lot of the others out there at present. However, I was very disappointed to find out that you have to log onto Netflix from your PC and add items to your viewing queue before they can be viewed this way. I much prefer the Samsung interface, which allows a variety of ways to view and choose items in Netflix from the TV itself.",
      "rating": 3.0,
      "verified": true,
      "author": "Greybeard",
      "helpful_votes": 0,
      "publication_date": 20110117
    },
    {
      "title": "Is it Sony or is it Netflix??",
      "text": "This is an elegant dvd player. Amazon price and delivery outstanding as always. Slim, fast work up and a fabulous picture quality upgrade to all the dvd's it plays, whether blu ray or not. I have a great Sony TV (LED, 3d) and this helps, BUT Netflix streaming is awful. Instant play stops and starts with jerks. It is usually unwatchable, and that was why I bought this model. I might cancel Netflix, and just use it for movies from DVDs. Is it Sony BD or is it Netflix which has the problem? I dont know.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian Fawn-meade",
      "helpful_votes": 0,
      "publication_date": 20110220
    },
    {
      "title": "Grand Slam Selection !!",
      "text": "After carefully doing research for the best BLU-Ray player on the market at a reasonable price, I chose Sony BDP-S570. I have had it for almost 2 weeks now and I have not run into any glitches yet. Easy setup, easy to use too, awesome picture. Too, you will be hard pressed to find a better price anywhere other than Amazon.Com.",
      "rating": 5.0,
      "verified": true,
      "author": "G. L.",
      "helpful_votes": 0,
      "publication_date": 20101217
    },
    {
      "title": "Works Great",
      "text": "When looking for a blu-ray player, I had two requirements: 1) built in wi-fi 2) apps. This player has been great with both of these. I have a second, older blu-ray player, and this loads disks much faster, which is nice to reduce the wait time when wanting to watch a movie.",
      "rating": 5.0,
      "verified": true,
      "author": "JTD",
      "helpful_votes": 0,
      "publication_date": 20121224
    },
    {
      "title": "Easy to set up, need to allow wifi to 'warm up' each time you turn on",
      "text": "Easy to configure the wifi and Netflix. It does take a couple minutes to find the connection when you power on the player. I only have a 5meg connection but it has been fast enough to stream Netflix so far. There is an option to leave the fan on at all times to enable a quicker startup but I haven't tried it yet to see if that 'fixes' the need for it to 'warm up'.",
      "rating": 4.0,
      "verified": true,
      "author": "Camping Man",
      "helpful_votes": 0,
      "publication_date": 20101204
    },
    {
      "title": "Sony BDP-S570 #D Blu-Ray Disc Player",
      "text": "There are a lot of reviews that do a very good evaluation of this product. I will not ry to cover the same material. The user interface is somewhat Spartan, but nonetheless it is a very good machine at a very good price. I bought it for the WiFi interface, but found that the wireless rear speakers (also on 2.4GHz) interfered too much with the WIFI to allow a reliable connection. Notwithstanding, when I shut off the wireless speaker I was able to easily make the WiFi connect even with a password secured WiFi link.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Hammer",
      "helpful_votes": 0,
      "publication_date": 20110320
    },
    {
      "title": "CR recommeds this DVD player",
      "text": "Happy with this DVD player purchase.I found out after I purchased this DVD player that It is recommended by CR. I have played a few movies and happy with the preformance so far. I have not tried the 3D yet. The wireless was a snap to setup and the preset websites were easy to access too. I thought it was a good purchase so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Bobb21060",
      "helpful_votes": 0,
      "publication_date": 20110206
    },
    {
      "title": "An excellent blu ray player",
      "text": "I bought this for my husband for Christmas and it turns out that I use it more than he does! My primary use is watching Netflix, Hulu, and watching DVDs/Blu-Rays. My favorite feature is that the unit remembers where you left off while watching a DVD in case it shuts off while you are away. I also really like how quickly it starts up - it just takes 2 or 3 seconds.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Colon",
      "helpful_votes": 0,
      "publication_date": 20110203
    },
    {
      "title": "Lots of Features",
      "text": "This is my first Blu-Ray player, so I don't really have anything to compare it against. However, the set-up was a snap. The thing that took the longest was entering the security key for my WiFi network. So far, everything works as advertised and the picture looks great. I particularly like having the Internet access.",
      "rating": 5.0,
      "verified": true,
      "author": "CDawg",
      "helpful_votes": 0,
      "publication_date": 20110102
    },
    {
      "title": "Sony Blu Ray",
      "text": "This is a great product for the price. I had an older Sony BluRay player that I purchased about four years ago. Veerrry slow. This one is ready to go within ten seconds after installing the DVD. Good additional features, Netflix, Amazon capable. I bought it to upgrade from my intolerably slow earlier model, and it was a BUY recommendation from Consumer Reports. Try it, you'll be happy!",
      "rating": 5.0,
      "verified": true,
      "author": "H. Leo",
      "helpful_votes": 0,
      "publication_date": 20110331
    },
    {
      "title": "Love this player!",
      "text": "Very slim design and has a remote that has good sized buttons that are clearly marked. Love the streaming capability of Netflix and Amazon. My non blu ray DVD's look great and this player is very easy to set up and use. As soon as the price comes back down to what I paid, I'm buying another. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "km",
      "helpful_votes": 0,
      "publication_date": 20110629
    },
    {
      "title": "great choice",
      "text": "I received the Blu Ray player and tried to connectect it to my wireless network. I have a 2 year old Linksys G router that apparently was not compatible with this Bluray player. I needed to by a new wireless router, the Cisco e3000, which has worked flawlessly with the player. Connecting the Blu Ray player with the new router took about 1 minute. fast and easy wit the WPS(WIFI protected setup) When I connected to Netflix it streamed perfectly. DVD's and Blu rays loaded quickly and the interface menus are easy to use. I would recommend the player, just be aware of the router compatibility. if you have an older router it might not work with this Player.",
      "rating": 5.0,
      "verified": true,
      "author": "RJC",
      "helpful_votes": 0,
      "publication_date": 20100605
    },
    {
      "title": "Good one",
      "text": "Connecting to secured wireless network though took a while but it was OK (go online to sony support and find out your specific router, and it would lay out the procedure for connecting to wireless network specific to that router).But wireless streaming of Netflix is very smooth no glitches so far. I could also download the Iphone app for the remote. Works fine. ( I am mentioning these two points, because several other reviewers had raised this issue, so I was a bit concerned, but I had no issues on these two.)",
      "rating": 5.0,
      "verified": true,
      "author": "Manish K. Srivastava",
      "helpful_votes": 0,
      "publication_date": 20101217
    },
    {
      "title": "Good deal",
      "text": "Good DVD player. We were happy with the pricing because all the local ones were higher. The only issue that I've had with it was that if you have any upper case letters in your wifi router password, it doesn't have a way to accomodate that. I contacted Sony support and they couldn't give me any help. I ended up changing my password just so I can use the DVD player with Netflix. Other than that, we've been very happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Teresa M. Benson",
      "helpful_votes": 0,
      "publication_date": 20110205
    },
    {
      "title": "Sony is excellence!",
      "text": "I rarely get disappointed with Sony and this player is no different. Works well with Netflix and playing disks. Streams and plays HD great. Will even see my DNLA server hard drive and play VOB files remotely. It can have difficulty with menu's from these remote files. I'm going to get another for a bedroom.",
      "rating": 4.0,
      "verified": true,
      "author": "LWM",
      "helpful_votes": 0,
      "publication_date": 20110218
    },
    {
      "title": "Great product that works as it should!",
      "text": "Previously bought a Samsung Blu-ray player. Had issues with it and it finally died. Returned that one to a different seller and received money for a new player. Decided to go with a Sony based on a friend that had good luck with his. I've never had an issue with this one. Sony I think by far makes the best blu-ray around. Will be purchasing another Sony if I need another Blu-ray. Would also recommend others purchase one.",
      "rating": 5.0,
      "verified": true,
      "author": "MG",
      "helpful_votes": 0,
      "publication_date": 20120213
    },
    {
      "title": "Great product for the price!",
      "text": "Wi-fi was easily set up, netflix connection to my account was a snap! bonus materials (videos/movies/tv shows) were available from other sources. I haven't tried any of the pay as you go except 1 movie on the Amazon pay per view channel, streamed fine. I found the TV show SOAP on Netflix, so I've been watching that mostly since we received the player. I purchased this for the streaming of Netflix mostly, and haven't watched a Blue-ray disc yet, but regular DVD's look fine. Not sure why I would want to pay more for a blue-ray.... but hey I grew up watching snowy tv stations.. and we had our choice of 3 of them!",
      "rating": 5.0,
      "verified": true,
      "author": "L Verkeyn",
      "helpful_votes": 0,
      "publication_date": 20110111
    },
    {
      "title": "blu-ray player",
      "text": "This Blu-Ray player has worked beautifully! I researched Blu-Ray players for many hours and this one came out on top, and I'm very glad it did. I have had no problems with DVD or Blu-Ray playback and all the internet play (wi-fi) I have done has never had a problem or interruption. Great product!!",
      "rating": 4.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20110501
    },
    {
      "title": "Very happy with purchase but not perfect",
      "text": "The unit arrived a day early. 5 stars for seller. Blu-ray player loads fast. Beautiful picture and plays all disks I've loaded so far. Upconversion is excellent. Was not familiar with PS3 style menu so had to get a little used to it. No big deal. Unit makes weird noise during startup every once in a while. Sometimes, first two seconds of audio is not played with video. Not sure why. No big deal. Will definitely keep.",
      "rating": 4.0,
      "verified": true,
      "author": "Diego Silang",
      "helpful_votes": 0,
      "publication_date": 20100421
    },
    {
      "title": "Could have save more",
      "text": "I cannot find anything to flaw in this product. The setup was faster and easier than any player I have setup in the past. The wireless internet connection process was easy and flawless. Since buying this the prices have dropped even further, as lower as $129 - $138. Shop around and get buy one.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron C",
      "helpful_votes": 0,
      "publication_date": 20101222
    },
    {
      "title": "Overall product review",
      "text": "Pros: Great services for the price. Cons: Slow startup speed. Not very easy to use. I purchased this device so I could use things like Pandora radio and try out netflix. The initial setup was not to bad but it does take some time. Once it is connected to the internet and you have activated the services such as Pandora, everytime that the device is turned off and restarted it loads the internet content. this is a three step process and just makes getting to your internet serviced application about 20 seconds longer. This device is amazing for the price. It is basically like a PS3 minus the gaming capability.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 2,
      "publication_date": 20101123
    },
    {
      "title": "Great Product - Some Features Left to be Desired",
      "text": "Initial setup was easy but when it got to the part of network setup, the manual sends you to the web. That's okay, understanding the miriad different types of processing systems and routers available, but I had to register into three different sites before it let me lookup the setup process. I admit, once found the instructions were reasonably comprehensive. However, connecting to my home computer network is another story. I learned that even when I'm able to figure it out (few instructions given), I will only be able to access music as video streamining is not possible. So here we have a HD video capable piece of equipment that won't allow video. Go figure.",
      "rating": 4.0,
      "verified": true,
      "author": "Chuck Miller",
      "helpful_votes": 0,
      "publication_date": 20110129
    },
    {
      "title": "No Regrets",
      "text": "I would buy it again. It was faster than I anticipated. The picture is better than I anticipated (including from dvds) It essentially is a remote controlled computer to search specified sites from the internet and it can play dvds and blu-ray.",
      "rating": 4.0,
      "verified": true,
      "author": "JJ  Brown",
      "helpful_votes": 0,
      "publication_date": 20110130
    },
    {
      "title": "So-so WIFI but good DVD",
      "text": "Has problems linking to home WIFI and storing enough of movie for continuous play; frequently stops to load; all my other devices do not have this problem. Plays DVDs fine, but linking to Netflix is a disappointment.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Dixon",
      "helpful_votes": 0,
      "publication_date": 20131213
    },
    {
      "title": "NICEEEEEE",
      "text": "I bought this to replace my Insignia Blu-Ray which is being moved to the bed room....I just finish unpacking and setting up and it took a total of about 10 minutes Netflix works great..and I love the addition of Amazon being available as well Ive only watched a demo of an HD video from Amazon so far and this thing looks amazing...watching the first bluray as I write and it also looks amazing...I cant rate the 3D of this player yet due to no 3D TV...YET",
      "rating": 5.0,
      "verified": true,
      "author": "Edward Bartram",
      "helpful_votes": 0,
      "publication_date": 20110104
    },
    {
      "title": "Noisy",
      "text": "I bought the nicer of the Sony Blue-Ray players as I wanted to have a capable machine which could integrate will with my HK/Panasonic HD setup. The product itself has been resonably good with the exception of it having a lot of drive noise. We have a nice home-theatre set up where the product is very close to the seating area. The noise was noticable but not return-worthy out of the box and is getting worse as time goes on. We are contemplating buying a different player and putting this one in the kid's room.",
      "rating": 2.0,
      "verified": true,
      "author": "Peter Nevius",
      "helpful_votes": 0,
      "publication_date": 20121204
    },
    {
      "title": "Doesn't play most of the foreign DVD",
      "text": "I had old Sony DVD players since year. I replaced it with this BD player by reading all the great reviews. It does play the BD very well and excellent quality when connected to my Samsung 1080p TV with HDMi cable. But I found that this player doesn't play most of the foreign DVD, it doesn't play MP3 audio CD, it doesn't play some of the home burnt DVD/VCD/CD. So I'm not very happy with this player. Any comment on how to make the BD player play these other discs would be appreciated.",
      "rating": 3.0,
      "verified": true,
      "author": "Kailas P Deshmukh",
      "helpful_votes": 0,
      "publication_date": 20110118
    },
    {
      "title": "Great Product",
      "text": "This is a great Blu-ray WIFI N player. Easy to setup and connected to WIFI and internet with Pushbutton feature on the router. NASD(media server) auto connected and was able to browse music, photos, and videos. Interface is much faster than the Samsung 6900 and about $100 less expensive. Currently watching Netflix Season 3 of 24-flawless. The only feature that I could recommend to Sony if they are reading this is to add a media player to build playlists. Additionally, a non-IR remote control would be nice.",
      "rating": 5.0,
      "verified": true,
      "author": "AverageConsumer",
      "helpful_votes": 3,
      "publication_date": 20101011
    },
    {
      "title": "Sony BDP-S570",
      "text": "I had previously purchased the BDP-S470. This is pretty much exactly the same with the exception of the built in wireless feature which I love. The cost was only about $5-$10 more for this one. That is great considering that the adaptor to connect the BDP-S470 is about $60. You can also hook it up through a line connection as well. It was easy to set up along with all of the accounts for Netflix etc. Streaming was perfect! No interruptions or wierd pauses. I love it. It is also able to play 3d movies which is a great added feature since most movies are now being made in 3d.",
      "rating": 5.0,
      "verified": true,
      "author": "Shopaholic",
      "helpful_votes": 0,
      "publication_date": 20110122
    },
    {
      "title": "Outstanding DVD Player",
      "text": "Great DVD player; purchased because of wireless capability and interface with my Sony Bravia LCD. Does a great job with both! S570 is fast loading with easy to use menu controls. Wireless connection was easy to set-up. Would like for Sony to install more app's on this device, but, overall very pleased with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Cook",
      "helpful_votes": 0,
      "publication_date": 20100704
    },
    {
      "title": "Great For Price",
      "text": "I've had this for 8 months. It works fine. Every once and a while I have to unplug it to reset it because it locks up. Netflix streams fine. Fairly easy to link into your wifi network. Picture is good. Good device to watch Blu-ray discs on or stream content from Netflix, Amazon, etc.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Zanyor",
      "helpful_votes": 0,
      "publication_date": 20110810
    },
    {
      "title": "Great product with all the features for a great price",
      "text": "Excellent product. The audio and with a blue ray never sounded like this with a DVD on the same surround system. The SD card on the front makes for a great way to access folders of music for playback thru the surround system. Wireless setup took a minute to complete.",
      "rating": 5.0,
      "verified": true,
      "author": "bf",
      "helpful_votes": 0,
      "publication_date": 20110224
    },
    {
      "title": "very satisfied with my purchase",
      "text": "I had been delaying upgrading our dvd player to blu-ray because I didn't think we needed to spend money on another dvd player. I finally gave in to my husband and we bought this player during the black friday specials and are very pleased with our purchase. My favorite part is the wifi and ability to stream videos/tv. We have chosen not to pay for cable tv and will probably be using this feature often. When watching dvds, they do not take long to load, (I had heard this can be a problem with blu ray players) I do reccomend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "TBC",
      "helpful_votes": 0,
      "publication_date": 20101207
    },
    {
      "title": "Easy to use/Problem linking it to my Mac Router/Modem",
      "text": "I got this couple of weeks ago. I like the design of the unit more than the design of the Samsung unit I had before. Sony has done a great job, putting together a smart set. I have had huge problems linking it to my Mac router.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Shah",
      "helpful_votes": 0,
      "publication_date": 20110119
    },
    {
      "title": "Best on the market",
      "text": "Never purchased a Blu-Ray DVD player before this model, liked it so much I purchased a second. Use them primarily for Netflix streaming, but as far as DVD playback the picture and audio are excellent. I would highly recommend this unit to anyone interested in a player with built in Wi-Fi.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter J. Quinn",
      "helpful_votes": 0,
      "publication_date": 20110120
    },
    {
      "title": "Worked fine for me",
      "text": "Bluray worked fine for me last 2 months. Quick load time, Bluray's play without problem. Connected to net just fine to do firmware upgrade. Online stuff is ok but not really the reason I purchased a Bluray player. There was an annyoing step where I had to online register to proceed, but after that ok. I prefer the TIVO streaming of Netflix better than the Bluray just because Sony shows pictures of the movies on your favorites list rather than title list. Maybe I just need a bigger TV :) Overall very happy with this purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin M",
      "helpful_votes": 0,
      "publication_date": 20101023
    },
    {
      "title": "the best",
      "text": "this is one of the better blue-rays on the market, no complaints!",
      "rating": 5.0,
      "verified": true,
      "author": "deuse",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "BDP-S570",
      "text": "This is a great unit, actually now I own two of them, the first one which is in my bedroom had some problems with streaming Netflix and other streaming programs but after updating the latest firmware (version M04.R.735) works flawlessly. Sony eSupport: [...] I am so happy with it that I bought second unit for my living room.",
      "rating": 5.0,
      "verified": true,
      "author": "Mayor George",
      "helpful_votes": 0,
      "publication_date": 20101228
    },
    {
      "title": "Great DVD player for the price.",
      "text": "I have had problems with other Blueray players taking a long time to read the disk and stopping in the middle of the movie. I have never had that problem with this player. In fact, I purchased a second unit for my bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Gilmore",
      "helpful_votes": 0,
      "publication_date": 20110317
    },
    {
      "title": "Great Blu-Ray Player",
      "text": "This player seems to do it all. I can not only play Blu-ray discs, but DVD's and music CD's, too! Connect to the internet with ease is also a huge plus! Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "RickTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20131012
    },
    {
      "title": "Sony 3D blueray",
      "text": "This blueray is perfect. Fast loading and have all the preprogram for youtube, netflix...etc I have samsung but I think sony is better product. I still figure out why my 3D TV only recognizes 720P instead of 1080p when I play 1080 movie on this blueray. I might need to check HDMI cable version.",
      "rating": 4.0,
      "verified": true,
      "author": "Loan D. Pham",
      "helpful_votes": 0,
      "publication_date": 20110130
    },
    {
      "title": "it gets overheated easily after playing for more than an hour",
      "text": "It works perfectly...After three years of using it, it gets overheated easily after playing for more than an hour.",
      "rating": 4.0,
      "verified": true,
      "author": "Rom Al",
      "helpful_votes": 0,
      "publication_date": 20150111
    },
    {
      "title": "Decent Player",
      "text": "Overall this player is not a bad player in the price range. It loads blu-rays fast and it does a good job at up-converting dvds. I have not had any problems with Netflix, the only bad thing is that you cannot search movies on the player itself; you can only see your instant queue. You have to use a computer or something else to add movies to your queue. The wifi works great, I have not had any issues with it since I set it up. If your in the market for a blu-ray player, this is definitely one to consider.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20110127
    }
  ],
  "product_meta": {
    "title": "Sony BDP-S570 3D Blu-ray Disc Player (2010 Model)",
    "description": "Begin enjoying Blu-ray 3D movies in Full HD 1080p or DVDs in near HD quality faster than ever with the Sony BDP-S570 Blu-ray Disc Player. Wirelessly stream photos, videos and music or instantly access a wide variety of entertainment apps including: Netflix, , Pandora, Slacker, Picasa, YouTube and more.\n\nFROM THE MANUFACTURER\nBegin enjoying Blu-ray 3D movies in Full HD 1080p or DVDs in near HD quality faster than ever with the Sony BDP-S570 Blu-ray Disc Player. Wirelessly stream photos, videos and music or instantly access a wide variety of entertainment apps including: Netflix, , Pandora, Slacker, Picasa, YouTube and more.",
    "rating": 4.2,
    "feature_bullets": [
      "BRAVIA Internet Video , Access movies, music, videos and more.",
      "Built-in Wi-Fi and Blu-ray 3D playback capability.",
      "iPhone , iPod touch BD Remote.",
      "Quick Start , Load to watch movies faster than ever.",
      "DLNA wireless streaming of photos, videos and music"
    ],
    "specifications": {
      "Brand Name": "Sony",
      "Item Weight": "2 pounds",
      "Product Dimensions": "8.11 x 16.92 x 1.81 inches",
      "Item model number": "BDP-S570",
      "Batteries": "2 AA batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Color Name": "Black",
      "Specification Met": "Certified frustration-free",
      "Special Features": "Nv: Dimensions",
      "ASIN": "B0036WS4D4",
      "Customer Reviews": "4.2 out of 5 stars626 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#169,379 in Electronics",
      "Date First Available": "February 10, 2010"
    },
    "categories": [
      "Television & Video",
      "Electronics",
      "Blu-ray Players",
      "Blu-ray Players & Recorders"
    ],
    "price": ""
  }
}