{
  "website_summaries": [
    {
      "verdict": "The Motorola Droid X makes another fine addition to Verizon's Android family, bringing with it a rich multimedia experience and more connectivity features.",
      "pros": [
        "The Motorola Droid X boasts a gorgeous 4.3-inch touch screen and great multimedia features like an 8-megapixel camera with HD video capture, HDMI output, and DLNA support",
        "The smartphone can also be used as a mobile hot spot"
      ],
      "cons": [
        "Camera is a bit sluggish",
        "Motoblur software is a lot better but still not quite as refined as HTC Sense",
        "Lacks a front-facing camera"
      ],
      "aspects": {
        "Design": 9.0,
        "Features": 8.0,
        "Performance": 8.0
      },
      "publication_date": 20100623,
      "rating": 8.3,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Best music player of Motorola's phones.",
      "text": "This model was the first smart phone I owned, purchased in 2010. It is a simplistic phone to use. There have been many ungrades since this phone came out, but it still remains the best music player of the Motorola phones. I accidentally washed my first one in a front loader washing machine, dryed it out before turning it on and kept using it. I recently dropped in while is was plugged in and messed up where is plugs in to charge, and that is why I bought a refurbished one to replace it.",
      "rating": 5.0,
      "verified": true,
      "author": "JLee",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Still goin' strong",
      "text": "The original droid (a.k.a. OG Droid) was one of the most revolutionary devices that ever hit the market. It is still a decent phone, especially if you root and put a custom ROM on it. I just use it as an emulator for NES and SNES games and just messing around with it. I personally like the keyboard and the D-pad on it is just fun to use. I highly recommend this item. I also got it from Amazon Warehouse, and Amazon always seems to have items in superb condition.",
      "rating": 5.0,
      "verified": true,
      "author": "bhayes",
      "helpful_votes": 3,
      "publication_date": 20120223
    },
    {
      "title": "Its really not so bad",
      "text": "This is my first droid, i really enjoy it over my last phone.. the samsung reality. This may not be the best Droid, but for the money its pretty good! Pros: Fast Browsing, its a DROID, Its got a decent screen res, Great Camera, and easy texting Cons: For some reason, it wont add some contacts i put in it, i dont know why, but maybe its weird and idk what im doing. No memory card, i just realized this so i cant take pictures, listen to music or anything till i buy one. The keyboard doesnt feel good when it opens, it doesn't open smoothly. Other than that, its a god phone for the money!",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan Forbes",
      "helpful_votes": 0,
      "publication_date": 20120426
    },
    {
      "title": "Android A855",
      "text": "This is my first Smart phone and I wonder why I waited so long. The Amazon wireless customer service team was great to help me assess the options. The features on this phone are easy and I really like the slide out keyboard. It is small and compact and fits easily in my pocket without any bulk. I am a fan of Motorola products. I was able to purchase this phone without a contract since Verizon would not discount a phone since my contract date was not up for renewal. If you need a phone always buy from amazon and not the retail store.",
      "rating": 5.0,
      "verified": true,
      "author": "Pankster",
      "helpful_votes": 4,
      "publication_date": 20110803
    },
    {
      "title": "Cheaper than going through verizon",
      "text": "I broke my first droid recently so I needed to replace it. The insurance I had on it wanted a $100 DEDUCTIBLE to replace my phone. Since I can get a BRAND NEW droid on amazon for $100 I told them where they could stick their phone. Found this refurb and it works as well as the original did. It's kinda slow loading even though I don't have a lot of crap on it and it glitches and locks up sometimes but I can live with it since I don't want to spend $600 for a new phone.",
      "rating": 3.0,
      "verified": true,
      "author": "bigghoss",
      "helpful_votes": 0,
      "publication_date": 20130223
    },
    {
      "title": "Verizon requires contract & data plan!",
      "text": "I found the droid after a search on Amazon for \"no contract, no data plan\". Neither is true. I went to 2 different Verizon Stores and both tell me that a minimum of $80 a month is required for ANY smartphone. I have to return the phone. I can't believe there are so many people willing to pay $80 a month for phone service! I just want a replacement phone with a little technology to replace my old misbehaving phone.",
      "rating": 2.0,
      "verified": true,
      "author": "C. Apley",
      "helpful_votes": 0,
      "publication_date": 20121117
    },
    {
      "title": "There are better options for your",
      "text": "Product as described but is not capable to work with todays technology. There are better options for your money",
      "rating": 3.0,
      "verified": true,
      "author": "Nurse",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Phone was exactly as advertised in great condition",
      "text": "I bought this phone for my daughter as a replacement for her previous phone that had an unfortunate encounter with a microwave (don't ask). The shipping was extremely prompt. I ordered the phone over the weekend and it arrived the following Thursday. The phone was in great condition. You hardly even notice that it was used. My daughter loves it so I call this a successful purchase all the way around. I would definitely recommend purchasing from CityTek.",
      "rating": 5.0,
      "verified": true,
      "author": "john glover",
      "helpful_votes": 0,
      "publication_date": 20130619
    },
    {
      "title": "good phone overall",
      "text": "The phone was a Version , so had to get it flashed to my carrier. My problem i know, but the phone sends random texts to whomever...the seller offered to replace it, if i sent back the original box and i didn't have that. Also the charger was faulty so i replaced it the second day i had it. Not a bad phone, not sure about the seller, but will not flash phones again.",
      "rating": 3.0,
      "verified": true,
      "author": "roselover",
      "helpful_votes": 0,
      "publication_date": 20130206
    },
    {
      "title": "First Smartphone",
      "text": "I love it. I'm not a geek but I have loved setting this phone up and using it. The physical keyboard is hard to use, flat keys. but the touch screen is nice a little light to the touch but you can download pretty much anything to make the phone the way you want it. I charge every night but I downloaded a task manager and it does help, not bad for an Android. Over all I am pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "D. J. Smith",
      "helpful_votes": 0,
      "publication_date": 20130305
    },
    {
      "title": "Droid A855",
      "text": "The phone is small and a bit slow, but is better than a lot of the newer phones on the market today... hands down this phone beats any Samsung, or Nokia I've ever used. Very pleased with the product as far as durability. Call quality is great. Would recommend,...",
      "rating": 3.0,
      "verified": true,
      "author": "llgk",
      "helpful_votes": 2,
      "publication_date": 20130107
    },
    {
      "title": "Overall the phone does seem very durable",
      "text": "I bought this phone about a week ago and for the most part it’s a great phone. The only problem is that sometimes the apps load slower than expected. Also the phone is not lightweight at all; actually it’s kind of bulky. Overall the phone does seem very durable, and would be a great fit for someone who uses their phone mainly for talking and/or texting.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130311
    },
    {
      "title": "A good deal",
      "text": "The Droid A855 arrived timely and in excellent condition; However I could not use this cell phone because I am with a different phone carrier. This mix-up was not the seller's fault; Yet, I returned this product and received a full refund without any type of negative retail hinderance. I would definitely buy from this seller again!",
      "rating": 4.0,
      "verified": true,
      "author": "Eddie G Holt",
      "helpful_votes": 0,
      "publication_date": 20121226
    },
    {
      "title": "Shipped just on time",
      "text": "I am happy with the device..defenitelny refurb has plenty of scuffs and scratches on it but I brought a phone case so with the case on it I am very satisfiyed..no tech issues with the phone and charges great..surely worth the buy especially if you only need if for a few months..Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Miamil",
      "helpful_votes": 4,
      "publication_date": 20120622
    },
    {
      "title": "Regret.",
      "text": "Received this phone a few months ago, kind of thinking it was a shifty price I took the chance anyways. I opened the back, removed the battery and scratched off the white out in the phone to find the word refurbished, clearly if it was underneath white out the seller did not want it to be seen. The battery is also really weak, and it just stopped working today. The screen completely shut off while I was using it (I have never dropped it, thrown it or slammed it on anything). Worst phone I have ever owned.",
      "rating": 1.0,
      "verified": true,
      "author": "dionne",
      "helpful_votes": 0,
      "publication_date": 20140425
    },
    {
      "title": "Droid",
      "text": "This phone was a replacement for the Droid X, which I dropped, cracking the screen. I found this phone to not be as user-friendly as the item it replaced. I am not completely comfortable using it. I have difficulty answering calls, by sliding the strip on the touch screen. More often than not, the call has ended before I can answer.",
      "rating": 3.0,
      "verified": true,
      "author": "Kupaakani",
      "helpful_votes": 0,
      "publication_date": 20120116
    },
    {
      "title": "upset",
      "text": "probably its my fault for not reading all the details but my droid was with out a sim card slot,which doesn't serve me much purpose but to use my droid as a extra camera, i hardly use it but once im using it as a camera i find the battery to run out before the day up it holds limited pictures also, but that's just me probably i should read up more on the phone but it doesnt help me out much at all",
      "rating": 1.0,
      "verified": true,
      "author": "Joyz",
      "helpful_votes": 0,
      "publication_date": 20120411
    },
    {
      "title": "sad",
      "text": "i really liked this phone. the only bad thing is how much it froze. it was beyond normal. i wish it still works. the recent thing it does, is select things on its own and scrolls through stuff by itself. i cant use it anymore cuz i cant select things. and i purchased this march 1st and its june 3rd and that is a short time",
      "rating": 3.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20120603
    },
    {
      "title": "One of motorolas better models",
      "text": "Not a bad phone in it's time. Uses ANdroid OS",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Gray",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "It was a fast and easy transaction! Finally got a new old phone",
      "text": "It was a fast and easy transaction! Finally got a new old phone!!! Verizon transferred all data and now I am a happy camper again. Thanks..",
      "rating": 5.0,
      "verified": true,
      "author": "L. DeFalco",
      "helpful_votes": 0,
      "publication_date": 20151014
    },
    {
      "title": "great phone",
      "text": "I love this phone because it is easy to use and navigate. I love that there are already great apps that I need on the phone and I love how the charger works that comes with the phone. I don't like the fact that it is not a verizon phone. I took it to get activated and the people said it is an alltel phones. The word verizon was not on the bottom of the phone like it was supposed to be.",
      "rating": 4.0,
      "verified": true,
      "author": "doingmealways",
      "helpful_votes": 0,
      "publication_date": 20131002
    },
    {
      "title": "this is a verizon phone",
      "text": "i would just like to let everyone know that way when u buy this kinda phone its a verizon phone and it can be used for prepaid or contract ... great phone had one just like it going back to this one from a note 3 ...",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160910
    },
    {
      "title": "Cell Phone Has Major Problems!!!",
      "text": "This is the worst purchase I have ever made with Amazon. This phone is absolutely terrible. I wish I could return it. I thought I just had to learn the phone but after having the phone, I'm not even sure this was a brand new phone because it blinks out constantly, I cannot hear on the phone without using the speaker phone, it takes almost a whole minute to switch between ANY screens on the phone. These are just a few of the problems I am having with this phone. This was a horrible purchase for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Hallie Senette",
      "helpful_votes": 0,
      "publication_date": 20131108
    },
    {
      "title": "droid phone",
      "text": "We received the phone in a timely manner... It had a little wear which was mentioned before we bought is but has been working wonderfully since then... thank you so much",
      "rating": 5.0,
      "verified": true,
      "author": "Pwhite",
      "helpful_votes": 4,
      "publication_date": 20121006
    },
    {
      "title": "phenomenal",
      "text": "The Droid X that I got was good for a while then it became possessed and started calling and texting and surfing the web on its own and when i opened up any app, accuweather opened. I emailed the company and told them what was happening.I had even used the phone about 3 and a half weeks. But there was a statement on the packing slip that if there was a problem within a month to let them know. I got an email back (on a Sunday) that said a new phone would be in the mail on Monday for me. Very very happy! Great customer service!",
      "rating": 5.0,
      "verified": true,
      "author": "michelle lies",
      "helpful_votes": 0,
      "publication_date": 20130409
    },
    {
      "title": "Is a good product, easy to use, good price",
      "text": "I bought it, because a lost my Iphone and to buy another one even with the insurance was to expensive for me , and after I seen many phones I decide the Droid A855 , and I am please that I did it.",
      "rating": 4.0,
      "verified": true,
      "author": "Myrna Castaneda",
      "helpful_votes": 0,
      "publication_date": 20130711
    },
    {
      "title": "It is a 4 year old phone...what do you expect?",
      "text": "I bought this to replace my current phone because it was damaged. I got this in really great condition. This phone was just way to slow for me, couldnt complete simple tasks. So i sent it back.",
      "rating": 2.0,
      "verified": true,
      "author": "thejmjohnson",
      "helpful_votes": 0,
      "publication_date": 20131023
    },
    {
      "title": "Don't send a power cord at all if it's a broken one",
      "text": "Phone arrived quickly and appears to be in good condition. I plugged it in for hours with the cord that was shipped with it, and the phone would not turn on... I thought it was broken. Then I realized that the power cord would only work if it was pushed to the back and to the right. The phone fits my old charger and now I can tell that it's charging... But that other charger wasted a lot of time for a sleepy 3rd shift cardiac RN. More frustrated than anything else... But glad it looks like it will work once it charges up.",
      "rating": 3.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20120421
    },
    {
      "title": "Immediate issues",
      "text": "Had issues almost immediately however thought we would try it out. Just over a month and the power button does not work so we can't let it die. Have a replacement on the way.",
      "rating": 3.0,
      "verified": true,
      "author": "Sharon Allen",
      "helpful_votes": 0,
      "publication_date": 20131126
    },
    {
      "title": "Not What I expected!!!",
      "text": "My son had the same phone two years ago. We purchased it brand new, therefore I still had many of the accessories including the dock and charger. This was a plus because the charger that I received did not work.. When charging the phone I must keep inserting the charger into the connector, because this phone does not charge well. In addition, there was no SD card in the phone. I hope that theses issues are the only ones. I would have appreciated honesty from the seller.",
      "rating": 2.0,
      "verified": true,
      "author": "DBent",
      "helpful_votes": 0,
      "publication_date": 20130128
    },
    {
      "title": "Not exactly what I expected!",
      "text": "Phone has been refurbished and not put back together properly, the reset date is 1969, so when you have to remove battery to reset this phone due to lock up you also have to reset times! Had to buy an SD card just to take pics! The FB app is wont even show you who your talking to! My sons friend has same phone and non of these issues! I contacted amazon but it went though a seller I guess is kinda what I was told! The camera does take good pics and you can hear great on the phone!",
      "rating": 2.0,
      "verified": true,
      "author": "brian",
      "helpful_votes": 0,
      "publication_date": 20130610
    },
    {
      "title": "Droid A855 cell phone",
      "text": "Over all I like the phone, but it is difficult to learn to use it and it did not come with an instruction manual. They give a difficult web address and then you have difficulty reading what it says on the web page. I really would like a printed manual. Also, they sent a phone charger with a cord so small that I was unable to charge the phone until I purchased a new phone charger. The phone arrived within the time frame that was stated.",
      "rating": 4.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20130924
    },
    {
      "title": "Motorola Droid- Not a good choice.",
      "text": "Does not work well. My daughter had to glue it together when it was 3 weeks old. Only works part of the time. I guess you get what you pay.",
      "rating": 1.0,
      "verified": true,
      "author": "catfish",
      "helpful_votes": 0,
      "publication_date": 20131106
    },
    {
      "title": "Beware of seller",
      "text": "This was my first smart phone purchase. After a short time the phone stopped working correctly. While texting or typing, I would press \"p\" and get something like \"llddd\". I wrote about it in my review, so Platinum Galaxy called me and told me that if I would send the phone back that he would replace or refund the phone. I sent the phone back a month ago and have not received anything back from the Platinum Galaxy. Not even a email. I would not trust this seller again.",
      "rating": 2.0,
      "verified": true,
      "author": "Julian Mayers",
      "helpful_votes": 0,
      "publication_date": 20121217
    },
    {
      "title": "Product Review",
      "text": "Wasn't my favorite phone in the world, but it arrived to me promptly and was in condition as described by seller. And at least I had buttons on my phone again!!!!",
      "rating": 3.0,
      "verified": true,
      "author": "Devin",
      "helpful_votes": 0,
      "publication_date": 20130208
    },
    {
      "title": "Satisified Customer!!!!",
      "text": "My Fiancee needed a phone Badly and he was ...in between phones.However This was an Amazing turnaround this phone arrived,Before His carrier could get one delivered!!!! No problems!!! This phone was in immaculate condition,and He decided this phone was practically brand new and he would not be purchasing another phone .I will be a repeat Customer!!!And for anyone who buys from this seller.....YOU ARE IN GOOD Hands!!",
      "rating": 5.0,
      "verified": true,
      "author": "YOLANDABENNETTJOHNSON",
      "helpful_votes": 0,
      "publication_date": 20131025
    },
    {
      "title": "Love it...",
      "text": "I chose this rating because the phone is wonderful... The details were 95% exact... Everything looks like new on it.. I chose this phone because I wanted an android and could not find one cheap any where but on amazon... I would definitely recommend this product to anyone who is looking for a phone... If they need it quick and in great condition then this would be the place to go..",
      "rating": 5.0,
      "verified": true,
      "author": "kimberly r. fuller",
      "helpful_votes": 0,
      "publication_date": 20130325
    },
    {
      "title": "This phone is useless. it has a virus in it n I ...",
      "text": "This phone is useless. it has a virus in it n I can't use it. I would like a refund. It got to me quick but the quality stinks",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "Had to get a phone",
      "text": "Phone broke and had to replace it immediately since its the only way for school and babysitter to contact me. ordered this phone because it looked good and was the right price. It is far too old to play the newer apps. I have like five apps and everything else is saved to my memory card but I keep getting alerts that my phone is running out of memory. Oh well.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130901
    },
    {
      "title": "Great phone (only for america)",
      "text": "I think that this is a great phone for the price. It has a nice 4\" screen and a good 5mp camera. It lags a bit but I think that can probably be fixed. Please note that this phone does not have a sim card slot so you can only use it with Verizon in America. I had to return this phone because it did not work in my area. If you use Verizon and live in America and want a decent phone for the price, then by all means go for it :)",
      "rating": 4.0,
      "verified": true,
      "author": "maT",
      "helpful_votes": 0,
      "publication_date": 20121130
    },
    {
      "title": "I only had this phone for a couple of weeks, and have had to buy a new phone.",
      "text": "When I got this phone (it was supposed to be new), the store manager at my local verizon said the battery had water damage. I contacted amazon and they told me that I could return it or take a discount in order to buy a new battery. I took the discount (mistake), and now the phone has suddenly stopped working. The screen is black and will not come up at all. I have had to buy a new phone.",
      "rating": 1.0,
      "verified": true,
      "author": "Kimberly Roy Ewing",
      "helpful_votes": 0,
      "publication_date": 20121210
    },
    {
      "title": "non't working correctly",
      "text": "I purchased this cell phone with the understanding it was new. It has not worked correctly in the last couple of days The screen scrolls at radium and the speaker does not sound right. When playing music it will shut off the song playing and ask for a selection. Is there a warranty for this phone? There was no paper work with the shipment, only the manual for use. I feel this phone was pretty expensive for it not to work correctly.",
      "rating": 2.0,
      "verified": true,
      "author": "ladydi",
      "helpful_votes": 0,
      "publication_date": 20120107
    },
    {
      "title": "2nd phone; 1st smartphone",
      "text": "Got this for my daughter and she loves it. This is her first smartphone and she is enjoying it and likes all the apps and free games. This is also my first experience with a smartphone and they do not hold battery life very long in comparison to basic phones but it lasts us all day until we get home to recharge.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20121214
    },
    {
      "title": "I'm not happy with the cell at all",
      "text": "The cell turns off and I can't turn it back on for at least 3-5 mins. after every phone call. I'm not happy with the cell at all...problems inside cell!",
      "rating": 1.0,
      "verified": true,
      "author": "susan Goodban",
      "helpful_votes": 0,
      "publication_date": 20160227
    },
    {
      "title": "Great at first then a piece of S***",
      "text": "When I first got the phone it was dirty but in good condition the packaging was nice and arrived early. The phone worked fined but after a while it would overheat a lot, freeze and not work with certain apps. I had to keep factory resetting the phone to get it to work and one day it just decided to stop working all together. Waste of money. Buy a new phone.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin Bruton",
      "helpful_votes": 0,
      "publication_date": 20130819
    },
    {
      "title": "Has some 3G limitations",
      "text": "But is a good phone otherwise. You can't save images sent through texts on this phone which I find really annoying.",
      "rating": 4.0,
      "verified": true,
      "author": "Shari Norton",
      "helpful_votes": 0,
      "publication_date": 20130903
    },
    {
      "title": "Good At first",
      "text": "I bought this phone March 2012, after a week i noticed a button wasnt working, but i ignored it, but after 2 months, the home screen button wouldn't work and a month after that the whole touchscreen stopped working",
      "rating": 2.0,
      "verified": true,
      "author": "Cook James",
      "helpful_votes": 0,
      "publication_date": 20120907
    },
    {
      "title": "The phone came on time",
      "text": "The phone is what we ordered. However we did not know it would not work for t-mobile because one of the the other posts on it said any unlocked phone would.)-: So now we are stuck with a phone we cant use... So now next time we will do our homework before believing what strangers write about products...",
      "rating": 4.0,
      "verified": true,
      "author": "stephanie",
      "helpful_votes": 0,
      "publication_date": 20130513
    },
    {
      "title": "crappy phone",
      "text": "Well i got this phone to replace my blackberry phone that was falling apart, i had to go back to it 4 days afgter i received the phone.i was too lazzy to follow the return process. the back part peeled off. All the buttons from the far right are not working. Slow as hell and i cant take pic because apparently all the sd card i put in this garbage are full. Just a disaster.",
      "rating": 1.0,
      "verified": true,
      "author": "crappy fone",
      "helpful_votes": 0,
      "publication_date": 20130517
    },
    {
      "title": "Jumping Screen",
      "text": "When we recieved the phones, one of the 2 was in great condition.. the second phone however was not. There were very noticable scratches on the phone, that wasnt the problem.. the problem was when you get to the main menu screen the screen keeps jumping. You cannot even press the option you want until the jumping stops. Am not a very happy buyer!!",
      "rating": 2.0,
      "verified": true,
      "author": "Seana",
      "helpful_votes": 0,
      "publication_date": 20120815
    },
    {
      "title": "LOVED IT",
      "text": "Product came on time! Was not damaged! which is a good thing for me because it was my first time ordering a phone off the internet. Company is very supportive....they sent a number just in case i needed it. Also gave my 45 days of FREE insurance. So Thumbs Up All The Way!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Mendenhall",
      "helpful_votes": 0,
      "publication_date": 20130428
    },
    {
      "title": "Review",
      "text": "This cell phone was a big disappointment. It came with no headphones, no sim card, (because there was no sim card I couldn't even take pictures) it also takes about 6 hours for it to charge. I do apologize but I totally wouldn't recommend it.",
      "rating": 2.0,
      "verified": true,
      "author": "Carrington Woods",
      "helpful_votes": 0,
      "publication_date": 20140626
    },
    {
      "title": "Motorola Droid A855 CDMA (Black) QWERTY",
      "text": "This phone was listed under cricket well its not a cricket phone so the money for this phone was a waist . I turnd the phone on once and turnd it off and well it wont come back on at all ..",
      "rating": 1.0,
      "verified": true,
      "author": "sheila white",
      "helpful_votes": 0,
      "publication_date": 20140509
    },
    {
      "title": "Android A855",
      "text": "I really enjoy the Android A855. It is a definite upgrade from any phone I have had in the past. I use it all the time because being off at University, it is the only way most people can get a hold of me. I also love some of the features on it, such as the maps feature. It has been used on several occasion to get me home or wherever I am needed to be. I thoroughly love this phone.",
      "rating": 4.0,
      "verified": true,
      "author": "pglock",
      "helpful_votes": 0,
      "publication_date": 20111206
    },
    {
      "title": "Fairly satisfied",
      "text": "I was very pleased with how quickly the phone arrived with free shipping. I was a little dissatisfied with the condition of the phone, it was pretty scratched up, and the SD card was removed. Therefore I had to purchase one separately. The phone works well, now that it has an SD card. Overall, I'm fairly pleased.",
      "rating": 3.0,
      "verified": true,
      "author": "michelles7529",
      "helpful_votes": 0,
      "publication_date": 20120623
    },
    {
      "title": "The phone doesn't let you use the camera unless you ...",
      "text": "The phone doesn't let you use the camera unless you have an sd card. It is a little slow opening things up and freezes up a lot. Touch screen sometimes doesn't lock properly when you're in a call and sometimes drops the call. But overall for a cheap phone it does the job.",
      "rating": 2.0,
      "verified": true,
      "author": "Marissa",
      "helpful_votes": 0,
      "publication_date": 20140821
    },
    {
      "title": "Phone was broken and not as described",
      "text": "In the description, it stated that the phone was in new condition. When I recieved the phone, the power button was loose and about to break off. I turned the phone on and it had someone else's contacts and background on it. This phone was definitely not new and I am VERY disappointed with this purchase and seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Kelsey",
      "helpful_votes": 0,
      "publication_date": 20131003
    },
    {
      "title": "Great Phone",
      "text": "It arrived on time in great condition overall. I was able to activate it on prepaid service. After activation I got critcal android updates from motorola. This phone is very fast, good quality sound and video. No freezing up. and the Battery life is great and the phone is like new. Good job guys!",
      "rating": 5.0,
      "verified": true,
      "author": "21candles",
      "helpful_votes": 0,
      "publication_date": 20130506
    },
    {
      "title": "4 star",
      "text": "the screen is hard to read in daylight and the sound can be difficult to hear at times. Other than that I like this phone",
      "rating": 4.0,
      "verified": true,
      "author": "Dianne Segers",
      "helpful_votes": 0,
      "publication_date": 20121209
    },
    {
      "title": "No memory card",
      "text": "Everything was perfect except the phone did not include a memory card for the phone. The original phone I got from verizon did include it and I was expecting it.",
      "rating": 4.0,
      "verified": true,
      "author": "craig rische",
      "helpful_votes": 0,
      "publication_date": 20130724
    },
    {
      "title": "Nice phone, but can be slow",
      "text": "This Motorola Droid is a smooth phone, with nice graphics and an excellent camera. However, remember that it is almost three years old, and doesn't have the quickness that a new Droid RAZR or Galaxy Nexus would. It is, however, a pretty good phone for the price, and I would advise towards getting it, if you are using it as a texting phone, with a few apps downloaded.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrew McDonald",
      "helpful_votes": 0,
      "publication_date": 20120214
    },
    {
      "title": "Excellent.",
      "text": "This was a good investment. My son and nephew enjoyed the phones . I would reorder from this company. Great",
      "rating": 4.0,
      "verified": true,
      "author": "Princessa",
      "helpful_votes": 0,
      "publication_date": 20130206
    },
    {
      "title": "Tricked",
      "text": "Well it was working just fine when I first received it but now it gets stuckn. It shuts off by itself and the power button does not work. I was exciting about receiving this phone but once it arrived I was very dissatisfied. I will not purchase anything from this company again. This phone was supposed to be new and apparently it isn't.",
      "rating": 1.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20120916
    },
    {
      "title": "Best phone ever.",
      "text": "This phone is just amazing. The speed, and the looks are just great. When I first put in the charger, and saw that red eye, I knew I was in love with the phone. Very happy with the phone overall. I was bothered to Activate the phone with a \"special call\" but I got around it, and now I'm enjoying the phone. 5/5 :D",
      "rating": 5.0,
      "verified": true,
      "author": "Marisol",
      "helpful_votes": 0,
      "publication_date": 20111206
    },
    {
      "title": "excellent deal!",
      "text": "Phone is in excellent condition, works well. The only thing I did know was that I'd need SN SD card. Still great deal, great service!",
      "rating": 5.0,
      "verified": true,
      "author": "curvy mamma",
      "helpful_votes": 0,
      "publication_date": 20120621
    },
    {
      "title": "It's really what I expected a very good article",
      "text": "It's really what I expected a very good article It's really what I expected a very good article It's really what I expected a very good article It's really what I expected a very good article",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Quiros Chavrria",
      "helpful_votes": 0,
      "publication_date": 20121228
    },
    {
      "title": "phone",
      "text": "The phone itself was in very good condition but there was no instruction book with it so I was a little lost with how some things on the phone worked.",
      "rating": 4.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 5,
      "publication_date": 20120718
    },
    {
      "title": "not what i expected",
      "text": "Ordered this as a quick replacement phone but ended up not getting what i thought it was. 1. doesnt work with SIM cards 2. searched for this under tmobile cell phone and its Verizon and 3. it didnt come with any shipping info now i have to return it and wait for another. truly heart breaking",
      "rating": 1.0,
      "verified": true,
      "author": "valencia",
      "helpful_votes": 0,
      "publication_date": 20121208
    },
    {
      "title": "Great phone!!",
      "text": "I got this for my daughter for Christmas. We had it activated yesterday and she has been very pleased with it so far. She is with page plus and the phone is perfect. Thanks so very much for a great product!!",
      "rating": 5.0,
      "verified": true,
      "author": "goodkarma",
      "helpful_votes": 0,
      "publication_date": 20121223
    },
    {
      "title": "couldn't use it ...",
      "text": "I ordered this product to be used in France and the seller said it was an international version... Well, not THAT international since i couldn't use it with the french system of 'sim card' and had to send it back to the seller. I wish people were more explicit in their notion of 'international' and knew eough about the systems in europe that require a slot in the phone to put a plan chip or 'sim card' in it in order to function... Waste of time and money for both of us. I am very disappointed and have to search for a new offer ...",
      "rating": 2.0,
      "verified": true,
      "author": "Abcolsz",
      "helpful_votes": 0,
      "publication_date": 20121007
    },
    {
      "title": "support",
      "text": "i got the order before anticipated delivery date. i ordered 2 one was everything that i expected and the second one was locked with no way to get into it. i contacted the seller and with in a few hours i had a reply with how to fix the problem. i am very satisfied with the customer support that i received",
      "rating": 4.0,
      "verified": true,
      "author": "me",
      "helpful_votes": 0,
      "publication_date": 20120718
    },
    {
      "title": "Can't be put on Tmobile network",
      "text": "Worthless and outdated for the USA Tmoblie says it can't be put on their network. Really should not be offered in the USA",
      "rating": 1.0,
      "verified": true,
      "author": "D. G.",
      "helpful_votes": 0,
      "publication_date": 20130216
    },
    {
      "title": "Took way too long for shipping... it actaully changed to a later period wtf??",
      "text": "good condition etc but too long the wait for shipping, the owner/ seller changed my date for its arrival for a later time, i can be patient but when it takes this long.... i might get a little heated and excited about when it will arrive.",
      "rating": 3.0,
      "verified": true,
      "author": "Jake Willington",
      "helpful_votes": 0,
      "publication_date": 20140313
    },
    {
      "title": "Good first generation Android phone, missing memory card",
      "text": "I was impressed with the almost brand-new condition of the phone. Only disappointment was that the 16MB card had been removed and I had to buy another card. I bought card with less memory, so it didn't add too much to purchase. Seller should have disclosed this.",
      "rating": 3.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20110708
    },
    {
      "title": "Present",
      "text": "I got this for my grandson for Christmas. It recently quit on him. I don't know why. He probably dropped it, but he enjoyed it while he had it.",
      "rating": 3.0,
      "verified": true,
      "author": "Eugenia Reynolds",
      "helpful_votes": 0,
      "publication_date": 20140425
    },
    {
      "title": "faulty product.",
      "text": "first off bought this for my gf. good: it works. bad. came with liquid inside the screen! glitchy! camera keeps coming on randomly. cant call people with out a blue tooth head set, horrible.",
      "rating": 2.0,
      "verified": true,
      "author": "dave",
      "helpful_votes": 0,
      "publication_date": 20130109
    },
    {
      "title": "great phone",
      "text": "This phones amazing it works better than most new phones and it looked like new when I got it. So happy with this phone its the best.",
      "rating": 5.0,
      "verified": true,
      "author": "awsome",
      "helpful_votes": 4,
      "publication_date": 20121007
    },
    {
      "title": "Holy Crap!",
      "text": "So not only did it come in the mail 3 days early! It works great and has some scratches but exactly what it told me it would! Im in love here :)",
      "rating": 5.0,
      "verified": true,
      "author": "Alysia Henderson",
      "helpful_votes": 0,
      "publication_date": 20130408
    },
    {
      "title": "Motorola Droid Android",
      "text": "Love it. Haven't had any shut-downs, trouble with the battery or learning how to use my new phone. It's really a very nice phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Marty Burton",
      "helpful_votes": 3,
      "publication_date": 20130316
    },
    {
      "title": "Wonderful!",
      "text": "The phone is brand new, it says used, but it doesn't look that way! I am very happy with the phone and I totally reccomend these people to get phones from. The shipping was slow, but I don't care cause it was so worth it with this GREAT QUALITY!! I'll totally reccomend to friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio",
      "helpful_votes": 15,
      "publication_date": 20120711
    },
    {
      "title": "good buy!",
      "text": "i got the phone and it is just as described.. had minor scratches on the corners of the phone but the screen was spotless! i just got a cover for it and it looks like new!! and super fast shipping! would def buy from this seller again!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20120706
    },
    {
      "title": "Great Phone for any age",
      "text": "This my second time buying this phone and it works great but a little outdated. I would recommend to anyone wanting a lowcost android phone. note: it cost me 25.00 with shipping included 2014",
      "rating": 4.0,
      "verified": true,
      "author": "G3A951",
      "helpful_votes": 0,
      "publication_date": 20140225
    },
    {
      "title": "NEVER WORKED!!!!!",
      "text": "It never worked!!!! I guess I got the purchase price back but that doesn't make up for all the hassle and double shipping charges to ship it both ways. No refund on that!!",
      "rating": 1.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20131201
    },
    {
      "title": "I have purchased one of these and when it arrived ...",
      "text": "I have purchased one of these and when it arrived i put it on the charger and it would not hold a charge it just stayed with a black screen and when i moved it the charger sparked i am very nervous about the phone so i haven't touched it since so i lost 40.00 on that purchase so other buyers just be careful of your purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Venom",
      "helpful_votes": 0,
      "publication_date": 20140914
    },
    {
      "title": "NOT NEW PHONE!!!!!",
      "text": "Phone was supposed to be new. The first one was defective, so I exchanged it for another. The second one didn't work either. Very disappointed. Hoping to get my money back. Would not recommend this distributor.",
      "rating": 1.0,
      "verified": true,
      "author": "Steph",
      "helpful_votes": 0,
      "publication_date": 20121219
    },
    {
      "title": "So happy",
      "text": "My son was disappointed when his Droid A855 was damaged by a bottle of water in his backpack while on a recent field trip. He was delighted that we were able to find one online that was in great shape and affordable. We couldn't be more happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Cara",
      "helpful_votes": 0,
      "publication_date": 20120515
    },
    {
      "title": "Excited~!",
      "text": "Well.. My friends say it's awesome, and I'll be getting it today. I'm super excited to try it out and I'll write another review once I fool around with it :)",
      "rating": 5.0,
      "verified": true,
      "author": "Secret",
      "helpful_votes": 0,
      "publication_date": 20130711
    },
    {
      "title": "Problems",
      "text": "I was happy with it but then this week I started having problems taking pictures. I finally got that fixed and now I am having a problems receiving pictures that are sent as text.",
      "rating": 3.0,
      "verified": true,
      "author": "Gena Cosper",
      "helpful_votes": 0,
      "publication_date": 20121213
    },
    {
      "title": "crap",
      "text": "worst thing i bought on amazon and i shop on here a lot . the phone only worked for a week and didn't want to turn on after i plugged it up for hours and still nothing",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140119
    },
    {
      "title": "Great Seller and shape",
      "text": "The phone has a great feel. The only reason i am giving it a 4 is because the seller never replied to me. It came faster than expected and was in great shape. It is an awesome phone because I have access to google play.",
      "rating": 4.0,
      "verified": true,
      "author": "linda bowen",
      "helpful_votes": 0,
      "publication_date": 20130603
    },
    {
      "title": "I was told the item was new.",
      "text": "The phone only works on speaker phone and I was told an SD Card came with it as well. Lo and behold it came in some weird case. I know what a verizon case looks like. That was far from it. my first and last purchase off of Amazon",
      "rating": 1.0,
      "verified": true,
      "author": "Taurean Smith",
      "helpful_votes": 0,
      "publication_date": 20130708
    },
    {
      "title": "lil Mama",
      "text": "You can tell that it was a used phone but so far it works OK. Got it for my 13 yr.old because he dropped his galaxy in the shower its a down grade for him but still a pretty good phone.",
      "rating": 3.0,
      "verified": true,
      "author": "Shamara",
      "helpful_votes": 0,
      "publication_date": 20140317
    },
    {
      "title": "Horrible",
      "text": "This phone drops every single call I make! I have to call someone back like 4 times to be able to have a full conversation. Worst phone I have ever had. If it actually worked it might be a decent phone..",
      "rating": 1.0,
      "verified": true,
      "author": "sam",
      "helpful_votes": 0,
      "publication_date": 20140215
    },
    {
      "title": "phone  sevice activation",
      "text": "it came on time but did not have instructions also did not let me know that it needed a micro SD card its the little things that make it hard when trying to get it up and going with a new product",
      "rating": 3.0,
      "verified": true,
      "author": "kennieth McKellar",
      "helpful_votes": 0,
      "publication_date": 20131004
    },
    {
      "title": "another slow motorola",
      "text": "Looked like a pretty good phone at first for a qick replacement. But motorola has slow products in general. Well... this is another one of them. I would never buy another motorola seeing as this is the 3rd one and still horrible.",
      "rating": 2.0,
      "verified": true,
      "author": "alpha",
      "helpful_votes": 0,
      "publication_date": 20130417
    },
    {
      "title": "water damage",
      "text": "this item was sold as barely used and when the item was delivered to me, I noticed the phone had water damage and was not described on the details on the wedsite. the phone runs slow and pauses frequently.",
      "rating": 2.0,
      "verified": true,
      "author": "Tom c",
      "helpful_votes": 0,
      "publication_date": 20131030
    },
    {
      "title": "What I think about my Droid",
      "text": "The battery does not last long and the internet loads slow. The price was ok and being able to have it shipped was good in light of the weather we are experiencing,other than that it is ok.",
      "rating": 3.0,
      "verified": true,
      "author": "Rita Reed",
      "helpful_votes": 0,
      "publication_date": 20140206
    },
    {
      "title": "You get what you pay for",
      "text": "By all means, I was not expecting much considering the item was under $100. However, I did expect it to work once I activated it. So much for that since the screen will not come back on. Getting ready to box it up and send it back the same day I received it. Smh",
      "rating": 1.0,
      "verified": true,
      "author": "Crystal M.",
      "helpful_votes": 0,
      "publication_date": 20131024
    },
    {
      "title": "Liz in OKC",
      "text": "Great phone...everything came as ordered and worked well and at a fantastic price. I would recommend this seller if all their products are this good. The phone was slightly scratched at the edges of the metal but I expected that from a used phone.",
      "rating": 5.0,
      "verified": true,
      "author": "elizabeth harris",
      "helpful_votes": 0,
      "publication_date": 20120305
    },
    {
      "title": "LOVE!!!",
      "text": "I got the phone so quickly.......And the phone looks very well...Nice appearance to me!! It is not expensive as well. Generally speaking, I love the phone and the seller together..Haha",
      "rating": 5.0,
      "verified": true,
      "author": "wayne",
      "helpful_votes": 0,
      "publication_date": 20130412
    }
  ],
  "product_meta": {
    "title": "Motorola Droid A855 CDMA (Black) QWERTY Android Touch-Screen Smart Phone",
    "description": "The first Android-powered phone for Verizon Wireless, the 3G-enabled Motorola DROID smartphone offers a full package of powerful mobile connectivity--from easy access to all your social networks and viewing of full Web sites, to spoken turn-by-turn directions thanks to the new Google Maps with Navigation Beta app. One of the thinnest full-QWERTY slider phones available, the Motorola DROID also features a high-resolution 3.7-inch touchscreen display and a virtual onscreen keyboard that auto-rotates depending on the phone's orientation. You'll also be able to capture high-resolution images and DVD-quality videos on the go with its 5-megapixel camera with flash. The Motorola DROID offers the powerful Android 2.0 operating system, fast and reliable Verizon Wireless 3G connectivity, and a wealth of Google Mobile services--including the new Google Maps with Navigation app. With integrated Google technology, the Motorola DROID brings one-touch access to the popular Google mobile services millions use every day, including Google Search by Voice, YouTube, and Picasa. The DROID also provides easy access to both personal and corporate email, calendars, and contacts supported by Exchange Server and Gmail. In addition to 3G connectivity, the DROID offers Wi-Fi networking (802.11b/g) for accessing home networks, business networks, and Wi-Fi hotspots while on the go, and Bluetooth connectivity for both hands-free devices and stereo music streaming. Other features include memory expansion via microSD memory cards (a 16 GB card is included with the device), threaded text and picture messaging for seamless on the go conversations, Visual Voicemail capabilities, 3.5mm headset jack, and up to 6.4 hours of talk time. NOTE: CHARGE YOUR PHONE FOR 3- 4 HOURS Once the phone is delivered.",
    "rating": 3.6,
    "feature_bullets": [
      "This product has been carefully audited and is certified to be 100% functional.",
      "This offer includes the following accessories 1. Battery 2. Battery Cover (if applicable) 3. Wall Charger",
      "Android smartphone with slide-out QWERTY keyboard",
      "Features GPS, a 5 megapixel camera, 3G data and WiFi access",
      "Download apps, games and more from the Google Play Store"
    ],
    "specifications": {
      "Product Dimensions": "4.56 x 0.54 x 2.36 inches",
      "Item Weight": "5.9 ounces",
      "ASIN": "B003DQD5CS",
      "Item model number": "A855",
      "Customer Reviews": "3.6 out of 5 stars569 ratings3.6 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "OS": "Android",
      "Wireless communication technologies": "Bluetooth, Wi-Fi",
      "Connectivity technologies": "Bluetooth, Wi-Fi",
      "Other display features": "Wireless",
      "Device interface - primary": "Touchscreen, Keypad",
      "Audio Jack": "3.5 mm",
      "Form Factor": "Slider",
      "Colour": "Black",
      "Manufacturer": "Motorola",
      "Date First Available": "December 19, 2005"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Cell Phones",
      "All Departments"
    ],
    "price": 49.99
  }
}