{
  "website_summaries": [
    {
      "verdict": "A large toy box with novel design that might just inspire little ones to pick up after themselves.",
      "pros": [
        "A lightweight build coupled with wheels makes it easy for kids to pull along as they clean up",
        "Tough and durable",
        "Ample room for toys",
        "Lid-free construction offers easy access and eliminates safety concerns"
      ],
      "cons": [
        "Lid-free design won't keep toys out of sight"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Once it is full it is easy to wheel it into his bedroom for storage",
      "text": "I gave this to our grandson for his 2nd birthday. The 1st thing he did was climb inside of it and used it for a little house. The next thing I knew all his friends at his birthday party were inside of it with him. I was worried that it would not support the weight but it did and it held up well. Now his mother uses it to put his toys in and she can wheel it around as she is picking up the toys. Once it is full it is easy to wheel it into his bedroom for storage. His mother is very happy with this item she said it works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth2717",
      "helpful_votes": 17,
      "publication_date": 20160924
    },
    {
      "title": "Great value for money",
      "text": "When the box arrived I wondered if this item would be big enough. Hubby got it put together in no time and after filling it, there was room to spare! Our eldest grandson really enjoys the fact that he can push this toy box around. We had fun putting the stickers on together as well. There is no lid to close the box. Some may prefer this as that would make the room look tidier. This toy box is for when the grands visit and is stored in an area that is not used daily, so isn't a requirement for us. Highly recommended, despite there being no lid.",
      "rating": 5.0,
      "verified": true,
      "author": "Grum",
      "helpful_votes": 7,
      "publication_date": 20181114
    },
    {
      "title": "Flimsy, came missing parts, and Amazon does not process returns so you have to contact the maker.",
      "text": "When it arrived, it was missing the axel for the wheels. Amazon does not provide support/returns/exchanges for it. I had to call Step2. It is also really flimsy and not strong at all. If you have a climber or a little one who leans on the side to reach the toys inside, this thing is going to collapse. I do not recommend this at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Mrs. Bolin",
      "helpful_votes": 5,
      "publication_date": 20190701
    },
    {
      "title": "Great buy",
      "text": "A little smaller than I thought it would be, but I love this toy box! We will be ordering at least one more! My 2 year old (who is the size of a 4 year old) climbs in and out of this thing all day to get his toys and it’s holding up great! I love that he can move it around where he needs it, it helps make clean up easier also. You won’t regret this buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Username",
      "helpful_votes": 6,
      "publication_date": 20181230
    },
    {
      "title": "Great toy storage box!",
      "text": "My child (pictures) is 5yo. He can fit inside and he likes when we pull him around. The bottom piece is a thin kind of board so it probably won’t hold too much weight. I use it to store my child’s many various size vehicles, the vehicles are pretty heavy which is why I wanted something sturdy. This is a little bit hard to move around because it only has 2 wheels and they don’t turn. It was pretty easy to assemble. I definitely recommend it to others it you’re looking for a good toy storage container. Item arrived a week after purchase, so pretty good delivery speed.",
      "rating": 5.0,
      "verified": true,
      "author": "Liiz",
      "helpful_votes": 2,
      "publication_date": 20200519
    },
    {
      "title": "Damaged / Unusable Product",
      "text": "I bought this as a Christmas gift, but when the recipients finally opened it to assemble, it was damaged and they were unable to put it together. I was informed (unfortunately) after the deadline to return. Not happy.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20180213
    },
    {
      "title": "Solid Purchase",
      "text": "Thought it was a little smaller in person, as to what I anticipated. However, it just might be better that way. My son is one and it’s small enough where he can dig into it, he just can’t quite reach the bottom yet. Also, because it has wheels and the compact size, it makes it easier to move from room to room, if your ever inclined to do so. It’s pretty sturdy, you place the stickers on it. Might take two people to assemble, depends. We bought one and then purchased another for the grandparents house.",
      "rating": 5.0,
      "verified": true,
      "author": "Zuul",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "2 stars",
      "text": "Came early and was super excited but the solid metal rod that allows you to have wheels is bent. Now we can't use the wheels which was major why we bought it but the box still is big and seems sturdy.",
      "rating": 2.0,
      "verified": true,
      "author": "Rgr",
      "helpful_votes": 8,
      "publication_date": 20170513
    },
    {
      "title": "Tons of missing pieces after a long wait.",
      "text": "Extremely disappointed is an understatement. After waiting weeks for this to arrive, it comes with LOTS of missing pieces. All that arrived in the box is 4 sides, and two wheels. No instructions, no stickers, and no way to piece things together. Not even the rod to hold the wheels on or screws/nails to hold it together. I now have a very sad and disappointed 2.5 year old because he saw it and got excited. Just to find out we can’t use it at all. Do NOT buy this item unless you want total dissatisfaction and disappointment",
      "rating": 1.0,
      "verified": true,
      "author": "Rachel Phillips",
      "helpful_votes": 2,
      "publication_date": 20200501
    },
    {
      "title": "Better than I thought it would be",
      "text": "This is great. I like that it is an open box. It rolls easily and holds a lot more than I thought it would. I'm quite pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Cat",
      "helpful_votes": 5,
      "publication_date": 20171208
    },
    {
      "title": "Great size, super buy!",
      "text": "My husband needed a toy box for his law office...he does family law, and a lot of kids end up coming into the office and need something to occupy them. This toy box rolls from place to place easily, and fits so many toys! It's size makes it unobtrusive, yet it's just the right size for kids! It's the perfect answer to what he needed.",
      "rating": 5.0,
      "verified": true,
      "author": "DeterminedDebs",
      "helpful_votes": 6,
      "publication_date": 20160815
    },
    {
      "title": "Great toy box!",
      "text": "It arrived quickly and was easily assembled. Sturdy soft plastic, no sharp edges and a good size. Easy to move around with the two wheels on one end and the molded handles. My 17 month old grandson lots to push it around! He can easily take the toys in and out of the toy box. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Annette Jackson",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Toy box for my toy rental package is a big win",
      "text": "I rent toys and my customers are so impressed when they see my toys box. Love it. It is big and a little bulky but it fits a lot of toys so no real complains here.",
      "rating": 5.0,
      "verified": true,
      "author": "Silvia C",
      "helpful_votes": 2,
      "publication_date": 20180730
    },
    {
      "title": "Highly recommend",
      "text": "I absolutely love this! I had a hard time assembling it but that's just me. My boyfriend had it put together in less than 10 minutes. It holds quite a bit and is so easy to move around. It is absolutely worth the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Savannah",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Great for storing toys",
      "text": "I really like this toy box. It's been almost 4 years since I brought this to keep the toys organized (I live in a small apartment). No issues with quality. Just wish it came with some kind of optional lid I could use to close it.",
      "rating": 5.0,
      "verified": true,
      "author": "carolyf",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Would get another",
      "text": "Looks wonderful! Not hard to assemble. My 2 year old beats on it, climbs on it, throws toys at it...in and out of it, runs his truck and bike into it. Looks good! I will probably purchase another for my baby girl.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack of all trades",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Great product at a good price.",
      "text": "Product arrived with minor damage, but I believe that took place during shipping. Nice size and my 2 year old can push it room to room with general ease. I was surprised at how sturdy this toy box is and will be purchasing another one in the near future to get rid of all the totes that currently hold my son's toys.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Very nice!",
      "text": "Big and spacious box, my 18 month old baby loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Yaybt.",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Super easy access for two year old",
      "text": "Super easy for my two year old to put away toys and get toys out. He can easily drag it around but I decided to make him leave it in the one room so he just moves it around in his room. It holds a good amount of toys.",
      "rating": 5.0,
      "verified": true,
      "author": "ShopperGirl5104",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "Great  toy box",
      "text": "I love this toy box. It is exactly what I was loooking for for my baby’s nursery. It was missing the bar that holds the wheels but I was able to use two long bolts and four nuts to hold the wheels on. Works great.",
      "rating": 4.0,
      "verified": true,
      "author": "Jacqui",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Cute and sturdy",
      "text": "Super easy to put together and sturdy. My child loves to push himself over and into the toy box. He fits well and has enough room to play with his small toys",
      "rating": 5.0,
      "verified": true,
      "author": "Chris T",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "One Star",
      "text": "Very disappointed we put the toy box together to find out the stickers were not in the box!",
      "rating": 1.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Loved it so much I bought it twice!",
      "text": "I bought this same toy box 8 years ago for my first son. We have moved to 5 states during that time and it still looks the same as when we got it. I loved this toy box and knew it was sturdy, so I just bought another one for my baby so they can each have one. It’s a great size as well, holds a lot of toys.",
      "rating": 5.0,
      "verified": true,
      "author": "Tonyandmanda",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "cute, inexpensive and functional toy box",
      "text": "Purchased for my home for my grandkids. Was easy to assemble. Fits in the space I had available. Grandkids are able to access the toys easily. The wheels make it easy to move. No lid to get in the way. Easy to pick up toys and place in toy box. The price was good compare with other toy boxes.",
      "rating": 5.0,
      "verified": true,
      "author": "MP Mom",
      "helpful_votes": 24,
      "publication_date": 20110719
    },
    {
      "title": "Great room to carry a load of toys",
      "text": "Love these so much that I bought one for each of my kids rooms. Fits a lot and fits in the bottom of a standard closet with ease.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristy Edwards",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Grandson loves it!",
      "text": "Bought this toy box as a birthday present and he loves it! We love that there is no lid since he likes to climb into the box and have the older children pull him around! We make a game of picking up the toys, by rolling the box around the room.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Zilka",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Surprisingly great toy box",
      "text": "I really love this toy box. It's bigger than I expected, taller than I really expected but fits a pretty large volume of toys. It was fairly easy to put together. The only issue I had was the board at the bottom, you have to make sure it's fully in the slots before you put on the finishing touches and I didn't do that! That was user error,not construction error. It's sturdy, seems pretty safe and it's cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Garber",
      "helpful_votes": 2,
      "publication_date": 20140728
    },
    {
      "title": "It's okay",
      "text": "The toybox is okay. It isn't easy to move, and it isn't as sturdy as we were hoping. We have a 3 year old who tends to be rough on things, and he was able to break this in a month just from moving it around with his toys.",
      "rating": 4.0,
      "verified": true,
      "author": "Bethany",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Good product",
      "text": "I expected the bottom to be plastic too but it’s a hard cardboard however it’s still sturdy and has a lot of space",
      "rating": 4.0,
      "verified": true,
      "author": "April Daniels",
      "helpful_votes": 2,
      "publication_date": 20180522
    },
    {
      "title": "came fast and was easy to put together",
      "text": "Outstanding product, came fast and was easy to put together. My grandson takes all the toys out of it and climbs inside to watch TV! I know he is safe because there is no lid, or sharp edges. Thanks for a great product that keeps a four year old very happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Cathie C.",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "Disappointed. Parts missing. Had to send back.",
      "text": "This would of been great if it had all the parts with it.",
      "rating": 1.0,
      "verified": true,
      "author": "Mina",
      "helpful_votes": 2,
      "publication_date": 20181113
    },
    {
      "title": "Nice and strong storage!",
      "text": "I bought this as a present for my great-nephew. I got it because of the size and the wheels. When fully loaded my nephew can't roll the box, but he's 3 so he will be able to move it once he's a little older. It's pretty deep...a good size. He likes the stickers on the side",
      "rating": 5.0,
      "verified": true,
      "author": "KyAuntie630",
      "helpful_votes": 0,
      "publication_date": 20160126
    },
    {
      "title": "It was pretty easy to put together",
      "text": "It was pretty easy to put together, some parts were kind of annoying though to put together but it got done pretty quick. I couldn't get the things that go on the bottom of it to go on, they were different pieces and wouldn't go on each side no matter how I turned it so I left those off. It's a really nice size, it will be plenty big for a while to hold all the toys. My son loves pushing the toy box around the house.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy Page",
      "helpful_votes": 0,
      "publication_date": 20141213
    },
    {
      "title": "Holds A Good Amount Of Toys",
      "text": "Easy to assemble if you follow directions, took about 30 minutes. It's cute and my daughter likes it.",
      "rating": 5.0,
      "verified": true,
      "author": "Celica O",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Sturdy",
      "text": "Set up pretty quickly and is bigger than I thought. Not having an issues with it and I've had for a few months.",
      "rating": 5.0,
      "verified": true,
      "author": "ataylor",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Unique and functional. Would tecommend",
      "text": "I really like this toolbox. The instructions were clear on how to assemble and it was simple, overall. I wasnt fond of the graphics, but turns out they are stickers. I just left them off and couldn't be happier!",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "NO WRITTEN DIRECTIONS FOR ASSEMBLY, except a few notes in SPANISH!!!!",
      "text": "Adorable toy box BUT ASSEMBLY was quite CONFUSING! It had to be done TOTALLY by looking at pictures, some of which were not clear at all. There were some notes on one or two, but they were in SPANISH!!! NOT ONE SINGLE DIRECTION IN ENGLISH!! Luckily, my husband was finally able to figure it out. We checked and RECHECKED, and no, there were NO ENGLISH DIRECTIONS! We could hardly believe it! Maybe we just got a fluke one or maybe they are all this way. I have no idea!",
      "rating": 4.0,
      "verified": true,
      "author": "CM",
      "helpful_votes": 0,
      "publication_date": 20150305
    },
    {
      "title": "Love this!!",
      "text": "I needed a toy chest that wasn’t wooden, and this is truly the best. It fits all his toys perfectly. And he gets to play rolling it around too.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikauris",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Best toy box",
      "text": "Perfect size! Love it! Everything fits and my two year old can reach and get anything he wants the size is perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Janell H",
      "helpful_votes": 10,
      "publication_date": 20140415
    },
    {
      "title": "Sturdy And Easy To Move!",
      "text": "Easy to assemble with a toddler under your feet. Sturdy, holds a lot of toys, and very easy to move around. Love this toy box and will be purchasing another for upstairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Letta",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Space saving toy box",
      "text": "Toy box was easy to assemble. Item was smaller than I expected but fits nicely in a small room. Very cute!",
      "rating": 3.0,
      "verified": true,
      "author": "LYPG116",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Been using it for 2 years now.",
      "text": "Excellent. Sometimes my toddler dumps out all the toys and puts his bedding and stuffed animals in there and is just cozy.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth R.",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Very spacious",
      "text": "Nice size kind of hard to get the bottom screws in from the inside though",
      "rating": 5.0,
      "verified": true,
      "author": "Brandy H",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Not bad for the pop price",
      "text": "Simple to assemble, my 14 year old put it together. Not sure how it will hold up over the years.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda.A",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Looks as expected and only little strong person can fix it",
      "text": "My kid loves it very excited as soon as we fixed it, as a woman i found little hard to assemble it. Need to have another person's help to firmly fix the screws",
      "rating": 5.0,
      "verified": true,
      "author": "Naga",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Step 2 was fantastic in getting new wheels out to me at no ...",
      "text": "For whatever reason, the wheels were missing when I put this thing together. Of course because why not I didn't realize it till the rest of the toy box was put together, so returning it was out of the question. Step 2 was fantastic in getting new wheels out to me at no expense. Great quality toy box for the money, and A+ customer service!",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Zuccarelli",
      "helpful_votes": 0,
      "publication_date": 20150126
    },
    {
      "title": "Awesome Gift",
      "text": "Very nice size. Even rolls on carpet easily when empty. Have not filled it up yet as it is a Christmas gift to know how the weight of toys will affect it on a carpet. Appears it would be super easy for a toddler to drag around an apartment or house.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Perfect in every aspect!!",
      "text": "More than pleased-it's perfect-easy to assemble-perfect for all-even parents-love it-bought for our Great grand kids toys we have for when they come visit...they love it also....",
      "rating": 5.0,
      "verified": true,
      "author": "Annette Egenlauf",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Fun colors",
      "text": "The only thing I didn't like about this toy box is that it only has two wheels. It is a little difficult for toddlers to move around thus it should've had four wheels for easy transport.",
      "rating": 5.0,
      "verified": true,
      "author": "Adrianna Shelton-Gunn",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "This toybox is just perfect for our kids toys",
      "text": "This toybox is just perfect for our kids toys! Ot was a good size for a great price and it is super sturdy. It has great little wheels to make it easy to move around and it fits SO much stuff. It also looks very cute with our colorful playroom decor.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20160401
    },
    {
      "title": "Great big toybox",
      "text": "This is a cool toy box bigger then expected fits so many toys easy to clean",
      "rating": 5.0,
      "verified": true,
      "author": "Jay&Liz",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "perfect for my babys room",
      "text": "This is a cute toy box. Very fun colors that is perfect for a bright and friendly childs room. My daughter loves to go to it and pull her toys out. Beware when you are putting together and make a special note to put the wheels on the same side - I thought I had but had not and ended up taking most of it apart again. So- not too much fun to put together but the end result is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Ann Brannigan",
      "helpful_votes": 0,
      "publication_date": 20130806
    },
    {
      "title": "Easy to put together.",
      "text": "Holds a lot more than it looks. My girls love them as i ordered 2. It can rly go either way for gender. And rly at the end of the day its just to hold toys.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "Great toy box!",
      "text": "This toy box is exactly like the description. Before we ordered this toy box, my daughters toys were in a wagon & a clothes basket...all of her toys fit in the toy box & there's room for more. It didn't take long to assemble & I did it by myself. It's a super cute toy box & a great price. My daughter is 21 months old & loves throwing all the toys out so she can sit inside & its strong enough to hold her. I give this toy box 5 stars!!",
      "rating": 5.0,
      "verified": true,
      "author": "Carma",
      "helpful_votes": 0,
      "publication_date": 20131227
    },
    {
      "title": "Nice little toy box",
      "text": "Mine came without assembly instructions which is annoying but they were available as a pdf on the Step 2 site. Pretty easy to put together and sturdy enough to hold a lot but still light enough for my little guys to roll around.",
      "rating": 4.0,
      "verified": true,
      "author": "CHRISTIAN D.",
      "helpful_votes": 20,
      "publication_date": 20160324
    },
    {
      "title": "1 year old and his Mom approve.",
      "text": "Bought for a 1 year old as a toy box and he loved it. Has already figured out how to roll it. His mom loves it too as there is enough room for a bunch of toys. Even though it is stage 2 - I bought it for him to use long term.",
      "rating": 5.0,
      "verified": true,
      "author": "Claire",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "Perfect toddler toybox",
      "text": "I love this toybox. It's perfect for what we needed. It fits nicely in the closet. We added some paw patrol stickers and he is in love! And it makes clean up time so much easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Candice S.",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "AWSOME.",
      "text": "Perfect for a low price. Our Grandson Loves his first toy box.",
      "rating": 5.0,
      "verified": true,
      "author": "brad stamps or Kristina Stamps",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Works well",
      "text": "This works well for putting toys and stuffed animals in, but I thought it was too expensive for what you get. No complaints about the product itself, though. It's pretty sturdy and fairly easy to put together.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20130827
    },
    {
      "title": "... somehow purchased this accidentaly it was still a pretyy good buy. We needed a toy box for him ...",
      "text": "Altho this purchase was a total accident lol i believe my three yr old nephew somehow purchased this accidentaly it was still a pretyy good buy. We needed a toy box for him anyway. Its still surviving this three yr old!",
      "rating": 5.0,
      "verified": true,
      "author": "LJMS",
      "helpful_votes": 0,
      "publication_date": 20151121
    },
    {
      "title": "Love the box itself",
      "text": "Love the box itself. However a piece was missing and when I contacted the seller they said they didn't have them anymore. So one of wheels won't stay on for the rolling feature. Looks nice and holds lots of toys though!",
      "rating": 3.0,
      "verified": true,
      "author": "Debra H.",
      "helpful_votes": 0,
      "publication_date": 20160127
    },
    {
      "title": "Nice",
      "text": "Wasn’t short enough for my son to grab his own toys but he’ll grow into it.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Young",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Missing parts!",
      "text": "I received this today, it is great but unfortunatelly is missing the metal rod for the wheels, so we cannot put it together! Very disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Silvana",
      "helpful_votes": 3,
      "publication_date": 20180205
    },
    {
      "title": "5 stars",
      "text": "I recently ordered this for a Christmas gift and ended up loosing the screws. I called customer support told them what happened and they sent me a whole new toybox! 5 stars on all levels!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Safe and fun",
      "text": "My grandson loves it now he empties it and climbs in...",
      "rating": 4.0,
      "verified": true,
      "author": "JoJo In Jersey",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Great product but patience needed to assembly",
      "text": "It holds a lot of my sons toys and is the perfect height for him to dig around and gets stuff out but it was difficult for me to put together since the screws that where sent where either to big or not long enough luckily I had some other screws in my home I could use but for the price it's a great product.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "Perfect toy bin",
      "text": "I love this toy bin so much that I bought a second one a few months after buying the first one. We use one to store dress-up costumes and the other for our wooden train set - it is a great size for both of those things. It is easy to assemble, but I learned that it must be assembled on a hard floor to snap the sides together. I like that it doesn't have a lid that can close on my boys' heads. The wheels and handle make it easy to move around the house.",
      "rating": 5.0,
      "verified": true,
      "author": "VandyB",
      "helpful_votes": 0,
      "publication_date": 20120426
    },
    {
      "title": "It's a great toy box",
      "text": "It's a great toy box, just the right size for a child. The only issue I had was that I found it a little hard to put together.",
      "rating": 4.0,
      "verified": true,
      "author": "Marge",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "Much larger and sturdy than I thought!",
      "text": "The toy box was so easy to assemble. The construction is very sturdy and holds way more than I originally thought it would! A GREAT purchase for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Missing parts",
      "text": "Product feedback: I found this toy box durable and great to store small to medium sized toys, cannot store big sized toys in it (as expected considering the dimensions provided). I didn't like the look of the toy box and assembling is also not as easy and quick as you may expect it to be. Complaint: I m having missing wheels and parts to attach the wheels. If I have not assembled the rest of the toy box, I would have returned the product.",
      "rating": 2.0,
      "verified": true,
      "author": "Pallavi",
      "helpful_votes": 0,
      "publication_date": 20131125
    },
    {
      "title": "Ok not the best",
      "text": "It’s ok. Hard to put together not enough space to put screws in. Plastic is a little buckled. Would not buy again.",
      "rating": 3.0,
      "verified": true,
      "author": "Kari",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Large capacity",
      "text": "Much larger capacity than expected, great! Only problem is if your child is too small, they won't be able to reach into the bottom themselves. My nephew is 1yr old and can't reach, but he'll get there!",
      "rating": 5.0,
      "verified": true,
      "author": "Robbie",
      "helpful_votes": 0,
      "publication_date": 20160118
    },
    {
      "title": "Missing pieces",
      "text": "Received product and all parts where in the box except the screws to put it together.",
      "rating": 1.0,
      "verified": true,
      "author": "Samira S",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "I love this! It's a perfect toy holder to keep ...",
      "text": "I love this! It's a perfect toy holder to keep in my living room and my son can wheel I around.",
      "rating": 5.0,
      "verified": true,
      "author": "kim F",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Very roomy",
      "text": "Set up was pretty easy and fits all my son's toys in it. Bigger than expected which is good.",
      "rating": 5.0,
      "verified": true,
      "author": "Chantel Giffin",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Perfect for storing toddler's toys",
      "text": "This toy box is perfect for my 14 month old grandson. He loves to be able to reach over the sides and pull out a big toy all by himself! It will be several months before he can actually get to the smaller toys at the bottom of the box. It is very well made and looks great sitting in the hall.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Mcmurray",
      "helpful_votes": 0,
      "publication_date": 20130321
    },
    {
      "title": "Four Stars",
      "text": "Not as big as I thought it was going to be",
      "rating": 4.0,
      "verified": true,
      "author": "Wanda Summers",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "very nice little box",
      "text": "Perfect for a small house with a little one. Not very big but is perfect for what we needed it for!",
      "rating": 4.0,
      "verified": true,
      "author": "Roseanne",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Missing pieces",
      "text": "It did not have directions which is fine but it didn’t have stoppers (little black things) for wheels and did not have stickers!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "peggy desautels",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Bottom piece missing.",
      "text": "Purchased as a Christmas gift. Upon assembly Christmas day, we found the bottom was missing. Never had this problem before. It's a shame because it would have made a nice roll round toy box. Gave it a 2 star rating because it is cute and a good concept.",
      "rating": 2.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20131226
    },
    {
      "title": "Love it. perfect for small spaces",
      "text": "Love it .perfect for small spaces. And your toddler can pull it out from wherever to get toys by themselves .the wheels on it was a very smart idea.color is also beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Aby",
      "helpful_votes": 0,
      "publication_date": 20150821
    },
    {
      "title": "Mis shapen, warped wheel",
      "text": "Wheel is missing shapen, so it thumps instead n of rolling",
      "rating": 2.0,
      "verified": true,
      "author": "sharon",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Sturdy and spacious toy storage",
      "text": "This toy box was easy to assemble, is very sturdy and can roll it from yo room with ease. Hold LOTS of my sons toys. I’m happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "C. Eller",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "MISSING PARTS!",
      "text": "Very upset as when this arrived there was a hole on the end of the box and one of the rods was missing!😡 Try to call step2 and every time I call there are supposedly 17 calls ahead of mine! Can’t ever get through to talk to anyone!!",
      "rating": 2.0,
      "verified": true,
      "author": "Cheryl R.",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Cool little box that holds a lot of toys and ...",
      "text": "Cool little box that holds a lot of toys and will last years as she gets older. The baby loves it even though she can't reach all the way into it yet. Keeps things organized too. Easy to put together. Took about 30 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Kameron Crawford",
      "helpful_votes": 0,
      "publication_date": 20141112
    },
    {
      "title": "Best Toy Box",
      "text": "We were looking for a toy box to put our grandchildren's toys in and this was the perfect choice. Not only is it made extremely well, but I can move it from one room to the next. This works out great as I move it out of our living room when the grandchildren are not there. I would reccomend this to everyone, especially those that need a movable toy box.",
      "rating": 5.0,
      "verified": true,
      "author": "ljv",
      "helpful_votes": 0,
      "publication_date": 20120522
    },
    {
      "title": "Great!",
      "text": "Nice deep toy box, super easy to put together...and nice bright colors. I love the wheels on it too...it makes it super easy to put away. I also love that it's not really wide so it fits pretty easily into my small corner that I have it in now. It holds a TON of toys.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Keifer",
      "helpful_votes": 0,
      "publication_date": 20140101
    },
    {
      "title": "Just what the little guy ordered",
      "text": "My youngest grandson (just turned 1) is amassing quite the collection of toys. He also likes to \"fish\" around in the toy box, and choose his own playthings, and I think, before long, will be hauling this toybox by himself.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald F. Quinlivan",
      "helpful_votes": 0,
      "publication_date": 20140624
    },
    {
      "title": "Great Toy Chest",
      "text": "Bought this for my 20 month old for Christmas. He loves it , and so do I. No longer are his toys laying all over, and it helps organize them better It was easy to put together, it took about 20 minutes. You will need a Phillips and a Hammer however.",
      "rating": 4.0,
      "verified": true,
      "author": "Kawan",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "A good value",
      "text": "It holds a surprising amount of toys, is well built and looks good. It is a lot nicer product that I expected for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "janet b",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "Five Stars",
      "text": "Love it. It is as big as i wanted it to be for a toy box ♡♡♡",
      "rating": 5.0,
      "verified": true,
      "author": "JEN JEN",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Horrible",
      "text": "Didn’t come with instructions, stickers, wheels or any assembly parts. Already contacted customer support once for stickers and wheels and they sent wheels and bolts but no stickers. Terribly disappointed. I DEFINITELY DO NOT recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "jessica johannes",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Missing parts",
      "text": "It was missing all of the small parts that were supposed to come with it. I had to make due with being crafty. Thanks for the unnecessary hassle.",
      "rating": 1.0,
      "verified": true,
      "author": "Kaela McAndrew",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Great deal",
      "text": "We purchased these for our grandchildren for Christmas. The shipping time was fast, well packaged and arrived without a problem. The kids really seem to enjoy it it seems well-made. I would not hesitate to purchase this item or any items from the seller again.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Winkler",
      "helpful_votes": 0,
      "publication_date": 20130116
    },
    {
      "title": "My kid love this. Size was as expected perfect fit. Stores lot of toys",
      "text": "My kid love this. Size was as expected perfect fit. Stores lot of toys",
      "rating": 5.0,
      "verified": true,
      "author": "Manoj",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "I loveeeee this toy box!! It's small enough ...",
      "text": "I loveeeee this toy box !! It's small enough to fit in my apartment yet deep enough to hold a lot of toys . My son loves to push and pull it all around the house and he can do so with ease.. Well worth the buy 👍🏼👍🏼👍🏼👍🏼👍🏼",
      "rating": 5.0,
      "verified": true,
      "author": "Dee03",
      "helpful_votes": 0,
      "publication_date": 20150712
    },
    {
      "title": "perfect toy box",
      "text": "PERFECT first toy box for a boy or a girl. Easily put together with a slim ling phillips head (and maybe a hammer) it is really great. Thick strong bottom and very appealing to kids.",
      "rating": 5.0,
      "verified": true,
      "author": "hate to say this",
      "helpful_votes": 0,
      "publication_date": 20141210
    },
    {
      "title": "Another solid Step 2 product",
      "text": "I purchased this as a gift for our two-year-old grandson. The rolling toy box is attractive and well built. It functions exactly how I thought it would. This is our third Step 2 purchase and I've been very happy with each item.",
      "rating": 4.0,
      "verified": true,
      "author": "Ken Decker",
      "helpful_votes": 0,
      "publication_date": 20130904
    },
    {
      "title": "Fail",
      "text": "came without hardware and stickers. Could not even put together",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa DeBruyne",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Not easy to assemble",
      "text": "Not easy to put together Does hold a lot of toys Tall sides made it hard for my 2yr old to grab toys half way down or more",
      "rating": 2.0,
      "verified": true,
      "author": "Jwillyfromphilly",
      "helpful_votes": 0,
      "publication_date": 20200225
    }
  ],
  "product_meta": {
    "title": "Step2 Lift and Roll Toy Box",
    "description": "Great, easily transportable toy box with easy lift handle has the flexibility to go almost anywhere. Designed with two legs that provide stability and easy-grasp handles, this toy box provides over 3 cubic feet (0.08 m3) of storage for toys, books, games or clothes. Its durable molded wheels won’t scratch floors, and its design and colors match today’s interior home décor. Item makes it easy for toddlers to access toys by themselves. Its durable poly construction is maintenance-free and wipes clean easily. Adult assembly is required.",
    "rating": 4.6,
    "feature_bullets": [
      "Easy lift handle with the flexibility to transport anywhere",
      "Over 3 cubic feet (0.08 m3) of storage for toys, books, games or clothes",
      "Built-in handles are easy to grasp and durable molded wheels won’t scratch floors",
      "Designed with two legs that provide stability",
      "Design and colors match today's interior home décor and its durable poly construction is maintenance-free"
    ],
    "specifications": {
      "Product Dimensions": "27.5 x 20.75 x 19.75 inches",
      "Item Weight": "12 pounds",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "ASIN": "B0038B7CRC",
      "Item model number": "700400",
      "Manufacturer recommended age": "18 months - 6 years",
      "Best Sellers Rank": "#135,030 in Home & Kitchen",
      "Customer Reviews": "4.6 out of 5 stars495 ratings4.6 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "August 23, 2018",
      "Mfg Recommended age": "18 months - 6 years",
      "Manufacturer": "Step2"
    },
    "categories": [
      "Kids' Furniture",
      "Toys & Games",
      "Furniture",
      "Home & Kitchen",
      "Chests & Trunks"
    ],
    "price": 49.99
  }
}