{
  "website_summaries": [
    {
      "verdict": "The 10.7x Olympus M.Zuiko ED 14-150mm f4.0-5.6 for Micro Four Thirds cameras delivers impressive image quality for a superzoom lens.",
      "pros": [
        "Reasonable price tag",
        "10.7x zoom range",
        "Compact design",
        "Minimal distortion"
      ],
      "cons": [
        "Modest aperture",
        "Soft edges at longer focal lengths",
        "No image stabilization"
      ],
      "aspects": {},
      "publication_date": 20130814,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great all around lens. Light weight with great all purpose optics.",
      "text": "This is a light-weight and super versatile lens. I have seen this described as a great walking around lens and I would have to agree. I just switched from my Olympus E-3 camera with three lenses to a micro four thirds OM-D with just this lens. Going from wide angle to a decent telephoto with the camera's great low light capability, I am very happy for my general photography purposes. Obviously this lens won't do if you have particular needs and want the extra light gathering capability that a professional lens would bring. But if you are traveling and need one lens due to weight and/or space this would be the one.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Schlenger",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Excellent range, poor autofocus.",
      "text": "This lens gives you a range that is comparable to the 18-200mm for the Nikon and Canon cameras, and is much lighter. The unfortunate aspect of it that it causes autofocus to be very slow, to the point where it may not focus at all (especially if the object is very far away). This may be because of the way the Olympus does autofocus, but it is unpleasant nonetheless.",
      "rating": 4.0,
      "verified": true,
      "author": "Maarten Hofman",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Great Travel Lens",
      "text": "For owners of Micro 4/3 lenses, this lens is a nice addition to the kit. It is small enough to carry all day, but the wide focal range allows you to capture images from up close or far away. However, like all zooms in this class, there are some image compromises over what prime lens can do. For everyday use, however, it is hard to beat.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Billmore",
      "helpful_votes": 0,
      "publication_date": 20151115
    },
    {
      "title": "In my experience the best results are achieved by keeping the shutter speed at ...",
      "text": "This is a magnificent lens, producing crisp images all through the focal range, and eliminates a lot of lens changeovers (which was a major reason for my buying it). In my experience the best results are achieved by keeping the shutter speed at 1/500, or faster, as you extend the lens (even though my camera has image stability), and I increase the ISO setting to achieve that end. That's not a problem to me, just something to be aware of, and it's the only reason I give it 4 stars and not 5. I like Olympus products, having owned a couple of their cameras now, and this lens lives up to my expectations.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter Goonan",
      "helpful_votes": 2,
      "publication_date": 20140909
    },
    {
      "title": "Excellent Walk-Around Lens for OM-D E-M5",
      "text": "This is likely to be my mainstay lens for my OM-D E-M5 especially when I'm traveling.. It is easy to use and light weight. The colors it produces are better than I get on my DSLR.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Crays",
      "helpful_votes": 6,
      "publication_date": 20130220
    },
    {
      "title": "The do-everything lens",
      "text": "This is a perfect travel lens. It has a range equivalent to 28-300 in film camera terms, yet the lens is small and light. The image quality is great, it focuses very fast (on the Olympus OM-D), and it feels very solid. The focusing ring is buttery smooth, but the zoon ring is a little stiff. Of course, the max aperture is an smallish f/4. That is the compromise you make for the portability and versatility. However, since cameras can now produce good results at ISO 3200, this is less of a concern.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Ortiz",
      "helpful_votes": 8,
      "publication_date": 20120625
    },
    {
      "title": "My everyday lens",
      "text": "I have had this lens for a while now and it has become my everyday lens. The only time I use another is if I need good macro ability as this lens does not do macro and that is why it only gets 4 stars. The control rings are both smooth and accurate. Great Lens.",
      "rating": 4.0,
      "verified": true,
      "author": "Sunnydon",
      "helpful_votes": 0,
      "publication_date": 20140617
    },
    {
      "title": "Nice lens, but wish it  could go wider.",
      "text": "Nice lens. I use it on Blackmagic Pocket Cinema camera and autofocus feature does work. However, 14mm is not wide enough on the Pocket Cinema camera to be much use when filming people indoors – unless you are going for strictly closeup shots. For telephoto shots, the lens is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Lightweaver",
      "helpful_votes": 0,
      "publication_date": 20141020
    },
    {
      "title": "Useful lens",
      "text": "Very practical do it all lens!!Used it all the time in my latest trip to Miami with my also new E.M1!!Both great!! Albert E",
      "rating": 5.0,
      "verified": true,
      "author": "Albert E",
      "helpful_votes": 0,
      "publication_date": 20140330
    },
    {
      "title": "I love this lens!",
      "text": "For what it is, I find it to be pleasantly sharp all around - wide & tele, wide open & stopped down. It captures great images, and this plus the fine Olympus 60mm macro are all I need for an excellent day in the backcountry. It's nice not having to swap lenses from wide to tele, and unless you're a super OCD pixel peeper or making poster sized enlargements, this lens gets it done. That being said, it is a long lens relatively speaking (4.25\" or about the width of my E-M10) and so if I don't need telephoto, I do swap it for the 14-42mm IIR kit kens (and take off the accessory grip).",
      "rating": 5.0,
      "verified": true,
      "author": "Zen",
      "helpful_votes": 2,
      "publication_date": 20141023
    },
    {
      "title": "Very happy.",
      "text": "Covers the ground in place of 2 zoom lenses. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard W. Crapuchettes",
      "helpful_votes": 0,
      "publication_date": 20160909
    },
    {
      "title": "Great Lens",
      "text": "Awesome lens! I have been using it for a few months now and it takes great photos both wide angle and zoomed in.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen L Price",
      "helpful_votes": 0,
      "publication_date": 20150606
    },
    {
      "title": "14-150 Oly lens",
      "text": "I have several other m 4/3s lenses, but this one is great for walking around. The range is just what is needed and the photo quality is wonderful! I also have the 45-200 lens and find it a bit soft at the long end, but this one doesn't seem to have that problem. It's really not a fast lens, but I knew that when I bought it, so use it largely for outdoor shooting, though I have used it indoors as well and as long as you have stable hands, it works just fine! I'm very glad that I bought it! Photos here,. Look at photos taken in May 2011 for this lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth C. Conant",
      "helpful_votes": 5,
      "publication_date": 20110524
    },
    {
      "title": "Great all around lens.",
      "text": "Purchased this lens for my PEN EPL 2, this lens is lightweight and quality wise very good for what it is, the range makes it so easy to quickly reframe which is ideal for travel photography, it is sharp and incredible small for ten focal length, good image quality, focus is fast, it is a great outdoor lens.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Sanchez",
      "helpful_votes": 0,
      "publication_date": 20120504
    },
    {
      "title": "Great Lens!",
      "text": "Have a this 28-300mm lens (35mm equivalent) on my E-M5 and it is a great workhorse. Of course there are compromises to having a zoom like this and it is not weatherproof. However when hiking or cycling it is the perfect companion. Probably not the lens for the pixel peeking types but it is more than adequate for everyday use.",
      "rating": 5.0,
      "verified": true,
      "author": "ChrisA",
      "helpful_votes": 3,
      "publication_date": 20130813
    },
    {
      "title": "Quality lens",
      "text": "Great all-around lens! Was initially a bit concerned regarding the plastic construction, but seems high-quality, and keeps the weight down on my Olympus E-P2. If I could change anything, it would be internal zooming.",
      "rating": 5.0,
      "verified": true,
      "author": "nuke",
      "helpful_votes": 6,
      "publication_date": 20110102
    },
    {
      "title": "Olympus ED 14-150",
      "text": "Very happy with the ease of use and the quality of picture. Amazon has the best products and price and ease of returning if it is not what you want.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce A. Wenker",
      "helpful_votes": 2,
      "publication_date": 20110106
    },
    {
      "title": "Enjoy using it, a lot.",
      "text": "It was a real pain in the neck changing between the two zoom lenses that this one lens replaces by by going from 14-150mm. That's over with no real loss in maximum aperture. This lens is quite comfortable to carry. Draws a bit of unwanted attention to the person carrying it but not as much as an SLR with a comparable zoom. The photos taken are excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Retired but part-time",
      "helpful_votes": 3,
      "publication_date": 20130820
    },
    {
      "title": "Excellent Lens",
      "text": "This lens is going to be my walk around lens on my E-M5 camera. I'm very happy with it. It is fast focusing sharp and clear.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul A. ValentineTop Contributor: Cycling",
      "helpful_votes": 2,
      "publication_date": 20120712
    },
    {
      "title": "Olympus ED 14-150mm Lens",
      "text": "Good price to get this lens in Amazon recently.the lens is use for my E-PL1 and one lens use for everywhere, no worries change lens. the picture is sharp and auto focus still performs well. Especially the close up performs more better than original lens but remember update the firmware. Otherwise the operation will have some error occur.",
      "rating": 4.0,
      "verified": true,
      "author": "Olympus EPL1 14-150 mm",
      "helpful_votes": 6,
      "publication_date": 20111201
    },
    {
      "title": "Nice!",
      "text": "Takes nice pictures. Easy to change between lenses and to add attachments to! I am enjoying taking pictures with this lens!",
      "rating": 5.0,
      "verified": true,
      "author": "GU",
      "helpful_votes": 0,
      "publication_date": 20130306
    },
    {
      "title": "I use this lens a lot.",
      "text": "Good solid lens, a bit fuzzy at the extremes, and not super fast, but not really slow. Good value for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "R. S. Command",
      "helpful_votes": 2,
      "publication_date": 20130729
    },
    {
      "title": "Lightweight packed with performance",
      "text": "What can I say, this small and light lens defy its size/weight with its impressive performance. Sample shots in my blog: [...] Highly Recommended specially for Olympus bodies with onboard anti-shake. With a Panasonic body, using it at the tele end is very tricky and needs support. I hope Panasonic will introduce a body w/ onboard antishake where this lens will be a killer telephoto!",
      "rating": 5.0,
      "verified": true,
      "author": "dogears",
      "helpful_votes": 2,
      "publication_date": 20110621
    },
    {
      "title": "wide telescopic range",
      "text": "makes you pretty lazy with this lens haha, can go from wide angle to pretty much as fat as 300mm with the x2 zoom in olympus pen cameras",
      "rating": 4.0,
      "verified": true,
      "author": "Justin Wong",
      "helpful_votes": 0,
      "publication_date": 20130818
    },
    {
      "title": "Love the quality of my pics!",
      "text": "Sure it's a little pricey, but it's small and very lightweight and takes awesome pictures! I'm glad I made the investment.",
      "rating": 5.0,
      "verified": true,
      "author": "JaneInVegas",
      "helpful_votes": 4,
      "publication_date": 20100918
    },
    {
      "title": "Better than Nikons 18-200vr",
      "text": "I understand that these long range zooms have sample variation, but I got a good one. I have had Nikons 18-200mm and sold it because the image corners were wretched above 80mm. This lens holds up great at that range. The only slight softness on mine is the bottom left corner at 14mm and f4, otherwise it is sharp everywhere. Also very light weight and small, especially compared a a DSLR lens with this range. Great and useful lens..balances great on my E-pl1",
      "rating": 5.0,
      "verified": false,
      "author": "J. Capobianco",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "Olympus ED 14-150mm",
      "text": "The lens is the most lightweight in this range even the body made of plastic and assemble in China. However, this lens has great picture quality. I think this lens is first choice to get a jonery.",
      "rating": 4.0,
      "verified": false,
      "author": "Benny",
      "helpful_votes": 4,
      "publication_date": 20121028
    }
  ],
  "product_meta": {
    "title": "Olympus ED 14-150mm f/4.0-5.6 micro Four Thirds Lens for Olympus and Panasonic Micro Four Third Interchangeable Lens Digital Camera",
    "description": "OLYMPUS 261504 Zuiko Digital 14–150mm f/4.0–5.6 ED Lens\n\nFROM THE MANUFACTURER\n\n\n The M. Zuiko Digital ED 14-150mm F4.0-5.6 (35mm equivalent 28-300mm) lens is designed to maximize the performance advantages of the Micro Four Thirds System, and it's significantly lighter and more compact--easily fitting in a jacket pocket. \n\nThe new lenses, made with ED (extra-low dispersion) glass for superior image quality, complement the design of the PEN® cameras, including the powerfully simple E-PL1, also announced today, making it the all-in-one package for consumers with any skill level, including those who are new to photography. \n\nThe Micro Four Thirds System standard meets the telecentric requirements of dedicated digital design. Light rays strike the imaging element nearly head-on for optimum edge-to-edge image reproduction. It also enables much more compact design than the Four Thirds System standard (or other interchangeable lens systems) because it reduces the outer diameter of the lens mount by 6mm, and the distance from the lens mount to the sensor (the flange back distance) by approximately half. As a result, M. Zuiko Digital Micro Four Thirds System lenses offer uncompromising professional quality for capturing both still-images and High-Definition (HD) videos, and the lenses are exceptionally compact to make capturing your life more fun. \n\nThe high-power wide-angle to telephoto M. Zuiko Digital ED 14-150mm F4.0-5.6 zoom lens is 65 percent smaller and 70 percent lighter than the comparable 10x ZUIKO Digital ED 18-180mm F3.5-6.3, making it ideal for everything from portraits and indoor scenes to sports and landscape photography. \n\nBy maximizing the advantages of the Micro Four Thirds System design, compact size, low weight and amazing image quality, the new lens significantly expand the photographic potential of the system. The inner focusing mechanism uses a light, compact, single-element unit to enable exceptionally fast, quiet autofocusing for smooth, superior operating ease during still and video capture. The manual focusing mechanism is designed to offer a responsive feel and precise operation, enabling you an affordable, high-quality means to capture your life in stills or HD videos. \n\nThe 14-150mm lens also offers quieter and more responsive AF performance, and provide professional image quality for capturing amazing still images and videos. It is compatible with all Micro Four Thirds System Olympus PEN cameras, and all other current and future cameras that comply with the Micro Four Thirds System standard. When mounted on an Olympus PEN camera, the lens is stabilized thanks to the camera's in-body Image Stabilization system and offer effective shake compensation at all focal lengths.",
    "rating": 4.3,
    "feature_bullets": [
      "High-power wide-angle M.Zuiko Digital ED 14-150mm F4.0-5.6 zoom lens; 35mm equivalent 28-300mm",
      "ED (extra-low dispersion) glass for superior image quality",
      "100 percent angle of view",
      "Lightweight design; ideal for everything from portraits and indoor scenes to sports and landscape photography",
      "Designed to maximize the performance advantages of the Micro Four Thirds System"
    ],
    "specifications": {
      "Product Dimensions": "3.27 x 2.52 x 2.52 inches",
      "Item Weight": "9.9 ounces",
      "ASIN": "B0035LBRMQ",
      "Item model number": "261504",
      "Customer Reviews": "4.3 out of 5 stars51 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#1,608 in SLR Camera Lenses",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 2, 2010",
      "Manufacturer": "Olympus"
    },
    "categories": [
      "SLR Camera Lenses",
      "Electronics",
      "Lenses",
      "Camera & Photo",
      "Camera Lenses"
    ],
    "price": 599.0
  }
}