{
  "website_summaries": [
    {
      "verdict": "These rugged yet soft dinosaurs are cuddly, crinkly, squeaky, and a perfect fit for all but the biggest dog breeds.",
      "pros": [
        "Chew Guard technology makes this a tougher plush toy",
        "Several other dinosaurs to pick from, available in large or small",
        "Soft, makes crinkle noises, and includes a squeaker"
      ],
      "cons": [
        "Not intended for chewing, and not 100% indestructible"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "This is my favorite toy",
      "text": "Seriously I love this toy. If I could chose my dogs favorite toy, this would be it. It is adorable, and good sized! I do wish that the squeaker was optional. I ended up unsewing it to get it out because we have other small animals in the house and a squeaker encourages prey drive. But I really love this toy, and my puppy really loves this toy! Update* This is my dogs favorite toy. He loves the crinkle in the tail! and he loves sucking on the horns (odd, but whatever). He goes to sleep with it every night and uses it as a pillow, an eye mask, or as a \"binky\" of sorts.",
      "rating": 5.0,
      "verified": true,
      "author": "Madi K",
      "helpful_votes": 9,
      "publication_date": 20190726
    },
    {
      "title": "Survived my mastiff!",
      "text": "I have a full grown Caine Corso mastiff. He was a rescue from a puppy mill. Unfortunately from all the inbreeding he has a cleft pallet. I believe because of this cleft he does not chew on toys but sucks on them. I have never seen anything like it. He looks like a puppy trying to nurse. Anyways we have trouble with toys just turning into a mushy mess and falling apart. This has lasted longer than most already. He wont let it out of his site.",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 3,
      "publication_date": 20190409
    },
    {
      "title": "goDog is the best",
      "text": "I have a very picky older golden retriever who loves to tear things apart. It has been a challenge to find toys durable enough for his persistence and dedication. :). goDog does an amazing job. My dog likes soft toys (think of children's plushies), but needs something strong enough to deal with his chewing apart. goDog toys are the perfect blending of the two: soft and durable. They aren't dog proof or tear proof, but they provide enough resistance to last a good amount of time and keep him happy. goDog is always my 'go to' for my picky little boy! Keep doing what you are doing, goDog!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Bradley",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "ANOTHER GREAT Dog Toy from goDog!",
      "text": "My dog absolutely LOVES these toys that I've bought from them! It's priceless to see his reaction when he realizes the package is for him. It's like a small child on Christmas morning - it's adorable! Aside from an issue I had with a different one of their toys (was 100% my fault), these toys have lasted him! I currently have a couple that I've had for the better part of a year and they're still going strong. Would totally recommend this brand of dog toy and will continue purchasing for him!",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Horrible horrible incredibly strong laundry detergent odor permeated entire house immediately.",
      "text": "Horrible horrible incredibly strong laundry detergent chemical odor permeated entire house immediately. Whatever else was true this plush dog chew toy was not cleaned and rinsed even remotely properly. I would not consider giving this to a pet it is a chemical poisonous bomb. It made the other toy we bought that came with it stink just by being in the same box with it. This item should not even be allowed to be sold as it is, it is a complete hazard.",
      "rating": 1.0,
      "verified": true,
      "author": "Barbara McCray",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Love godog toys",
      "text": "I love the godog toys. No stuffing makes them safer for pups, and they are durable! I have an eleven month old large breed pup and we have 4 godog toys that we have bought over the months since we have got our dog at 8weeks and we still have all of the toys. He plays tug with them and loves to play fetch with them. They are machine washable (I hang dry them). All our godog toys are fully in tact with no holes or tears. Some of his other toys have holes or the ears were ripped off with chewing, but godog stood up to the challenge and is a great purchase in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "My dog loves his Dinosaur",
      "text": "Nothing with my dog is chew proof (180 lb Great Dane), but once he tears off the frills and removes the squeaker, he plays with it constantly. This is his 4th godog and he loves each of them until we break down and get a new one. They really are durable as long as he isn't trying to kill it. He throws it around and carries it all over.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Great toy",
      "text": "This is my third go dog dinosaur for my dog. He has an 15 pound 18-month-old puppy. These are his favorite toys they are fairly tough, but he has been able to put a few holes in the old ones. They are still usable and it definitely took him some time to chew through the material. I believe the worst damage was done with his puppy teeth. Because I sold his first one back up and he hasn’t torn out the stitches. No dog toy is completely indestructible . He plays with these constantly!",
      "rating": 5.0,
      "verified": true,
      "author": "lexie",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Massive Disappointment",
      "text": "**Update - already received replacement toy after submitting request form on manufacturer website. They sent a completely different toy that seems to be holding up much better. It’s basically a giant fuzzy ball. Massive disappointment. 30 lb, 11 month old small shepherd mix ripped multiple holes into it in well under 30 minutes. He’s tearing it apart now... This “chew guard” and “tough” fabric is a joke. He doesn’t get through $2 plush toys this quickly. Waste of money.",
      "rating": 2.0,
      "verified": true,
      "author": "Stephen",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "He loves it... but.... the nose is a problem",
      "text": "The pterodactyl toy seems well made and is just the right size for a 50-pound dog. My poodle is very proud of his big-boy toy. He likes to carry it around in his mouth with the legs pointing up so that it looks as though he has tusks. The tail makes an appealing crinkling sound when he bite it. The squeak is very loud. This is his current favorite. UPDATE --the only issue with this toy is the nose, which is unreinforced felt. My dog chews right through it. The rest of the toy holds up fine. Hey, Godog, can;t you reinforce the nose?",
      "rating": 3.0,
      "verified": true,
      "author": "EDL",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "I will forever recommend",
      "text": "I have a 15lbs Pomeranian that chews through EVERYTHING! I’ve never been able to have a toy for more than a day and he has had this for MONTHS! He loves soft stuffed animal type toys but everytime I would get him one I would have to immediately throw it away because he would ruin it. He did chew a hole through the nose and the back foot after about a month but I just pulled out the stuffing and he still loves it. I have several toys from this company and will continue buying more and my grandparents loved the toys so much they bought a few for their pups as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Tabby",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Better then most",
      "text": "My German Shepard Pit mix is almost 4 months old, unable to find a stuffy that holds up. He loves stuffed animals so I was excited when I saw this one. Although he has chewed it up a bit, it has been 24 hours. Nothing usually lasts this long haha! I'm impressed he isnt able to get to the squeaker yet. That's usually the first thing he rips out. I'm impressed it's only the blue area and tag that he is able to destroy at this point! If it gets worse I'll update this post.",
      "rating": 4.0,
      "verified": true,
      "author": "K2jmom01",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Cute and fun but NOT chew-proof",
      "text": "Ok, so this dino is super cute and my dog loved it, but he also chewed a hole into it after only about 15 minutes. He's definitely an aggressive chewer, but he's also only a cavalier spaniel/bichon mix, so a big dog would probably destroy it even faster. Luckily, he'll still happily played with the torn up \"skin\" as long as I keep him from eating the stuffing, but I was still hoping for at least a day before he'd chewed holes in it. Just be aware if you've got an intense chewer that this probably isn't much more durable than any other dog toy",
      "rating": 2.0,
      "verified": true,
      "author": "Janelle Thornton",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "I LOVE THIS DOG TOY AND SO DOES MY BUDDY",
      "text": "I purchased this toy because it didn't have long fur like many other stuffed dog toys. My little pup has a habit of ripping the fur off his stuffed animals. This brand has tons of cute dinosaurs that my dog loves! My Dog is not very rough on toys so this has lasted us years. My mother's German Shepheard, who is quite rambunctious and full of energy, is a toy destroyer. Some parts of these toys only lasted her about a day, like spikes on the back etc. I was very happy with this purchase and bought two more.",
      "rating": 5.0,
      "verified": true,
      "author": "Belle Noxon",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Rexie needs surgery...didn't make it😕",
      "text": "Poor Rexie lasted an hour. The fabric did not tear but the seams are very poorly stitched with thin thread. The dogs love him so I pulled all the stuffing out along with the squeeker and will sew it back up. We will see how it goes and I will post an update. If I can figure out how🙃. Okay UPDATE... I took all the stuffing out sewed the stitch lines and it worked for two minutes. Then the fabric was torn but not the tear resistant inner layer🙄☹️. No win situation.. RIP Rexie!",
      "rating": 3.0,
      "verified": true,
      "author": "Roni Weaver-Anderson",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Adorable",
      "text": "I just received the \"frills\" version of this toy and I'm not sure which of us likes it more . It has a little crinkler at the end of the tail, a squeaker in the tail, and the whole thing is soft and floppy and adorable! I got the large for my springer ( for his birthday) . I didn't realize that it didn't have any fill , but I like it, it works. I immediately ordered another for his brother in a different shape and I'm so excited to see it . I can't speak for the chew proof portion because my guys aren't toy killers , but the material looks promising!",
      "rating": 5.0,
      "verified": true,
      "author": "Koryn d Hayes",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "These are not durable in the short term, but great for long term play",
      "text": "I'm not gonna beat around the bush: Takes my dog about 5 minutes to get into the stuffing. However, this is the only toy I've found that she will not eat afterwards. Absolutely refuses to do so, which is rare. I think they line it with something that tastes bad to the dog. So, after she de-stuff's the innards, this is our go-to for tug-of-war and general play. I love this brand and will continue to buy it until my dog gets really really old. lol.",
      "rating": 5.0,
      "verified": true,
      "author": "animefiend7",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Laster longer than expected",
      "text": "For our boxer and our pitbull puppy, these goDOG Dinos actually lasted longer than the KONG toys we got them. They were able to tear them open in about a week (compared to an hour with KONG), and so I took the stuffing out of them and they played with the \"skin\" for another 3 weeks or so. After they tear the \"skin\" into pieces and they start to smell really bad, we tossed them. Not a bad toy for medium dogs; perfect for small dogs; but probably not good for large or aggressive dogs if you don't want to buy new ones every other month.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "NOT FOR PITTIES",
      "text": "I'm giving this 5 stars because it is a good toy, just NOT FOR PITTBULLS. The first one I had lasted months... until a week ago he destroyed it and decided to pee on it afterwards. So I ordered another, thinking it would last awhile again, nope. Within 20 mins he had it torn apart. He just turned a year old so he is older now than when I had gotten the first one last time. These are great toys, just not for extreme chewers or pitties.",
      "rating": 5.0,
      "verified": true,
      "author": "Madonna M Qualls",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Got a fluke?",
      "text": "I am a GoDog-aholic! I LOVE them, and they have been the best stuffed animals with the \"chew guard\" stuff. However, this one will have to be thrown away. It's more like a \"chew treat\", as it took him 5mins to start directly at the \"chew guard\" rim on the horn and eat his way around. I'll try to return, but doubt it will work, as it's garbage now. I'll try GoDog again, and hope for another winner.",
      "rating": 1.0,
      "verified": true,
      "author": "Dy",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Cute..  didn't last",
      "text": "I ordered two of these little guys... They are super cute, But not any more durable than most dog toys. Keep in mind I'm confident my dog could chew through a brick wall if she wanted to, this little thing stood no chance and lasted .... 30 minutes? Maybe haha Worth a try, maybe i should just her a rubber tire to chew on. But this dinosaur didn't stand a chance.",
      "rating": 3.0,
      "verified": true,
      "author": "Dustin",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "great purchase and so cute",
      "text": "super cute and fun! my dog absolutely loves it, i gave it 5 stars but 4 for durability because it only lasted a day. my dog is a 145 pound german shepherd baby and he tears up any toy unless it’s a hard chew like toy but i’m sure if it was any other dog that didn’t do that or was as strong it would last forever! he still loves it even though it’s falling apart and he won’t walk around my house without holding it! would buy again for sure",
      "rating": 5.0,
      "verified": true,
      "author": "lex",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Rylen - 1 Chew Guard - 0",
      "text": "We were looking forward to “chew guard” but to our disappointment the toy held up for maybe 10 minutes. We have had others last weeks, but this one was a fail. She was able to rip right through and pull the squeaker out. Back to the companies we know have a quality product that can with stand a chewer.",
      "rating": 1.0,
      "verified": true,
      "author": "BRNW",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Came with no stuffing inside",
      "text": "This product seems to be pretty durable so far. My dog likes it and has not yet ripped any holes in it. It's unusual for plush toys to last as long as this one has in my household. That being said, I am giving this toy 3 stars because it came with no stuffing in it. It's literally just a shell. I didn't bother returning it because my dog doesn't care and still plays with it. Overall, I would consider buying this brand again.",
      "rating": 3.0,
      "verified": true,
      "author": "Savannah",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Not durable",
      "text": "I was fooled by the reviews, this is not very durable for dogs who play. I have a 5 year old retriever mix and an almost 2 year old Dane mix. This is what they (mainly my Dane mix) did in TWO days!!! Puncture holes all over and squeaker no where to be found. I don't reccomend if you have dogs that chew or play hard with their toys. I gave 2 stars because it lasted longer than a day and it's cute.",
      "rating": 2.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Cute but not so durable for my pet.",
      "text": "Really like this item and it is tough but my great Pyrenees had it torn up before the day was done, and really thought I found one that would last awhile. She still plays with the carcass but no squeaker or stuffing is there, did try sewing some of the stuff back in so can verify it is tough, especially on my needles, but not so tough for the dog. Think this would be a good item for dogs that are not such tough chewers.",
      "rating": 3.0,
      "verified": true,
      "author": "P. D. Swanson",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Pretty strong",
      "text": "Now I have an extreme chewer. So it could last longer on most dogs. Mine goes thru an antler every 2 months if that helps prove my point. The only thing he really destroys is the joints. He has a hard time tearing the fabric. His goal is to turn it inside out. Takes him about 3 weeks. He takes it around like a little kid carries their blanket. He looks towards his new one",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Didn’t last a week",
      "text": "I have a 1 year old corgi that likes to chew threw her toys. Thought I’d give this a try since it’s labeled as durable. Nope. After 1 day the horn was chewed through. And within 3 days the nose and stuffing was all gone. The fact it didn’t last even a week with my dog, I can’t endorse this.",
      "rating": 2.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "She's not a super aggressive chewer",
      "text": "My dog loves this toy. This is the second one of these I've purchased for her. She's not a super aggressive chewer, but she loves squeekers. Unfortunately, the squeeker in this toy is not really well surrounded by stuffing and it only lasts for about 10 minutes before it's dead. The lack of stuffing makes the toy kind of floppy and my dog likes that but it makes the plastic squeeker inside very accessible. I had hoped for some squeeker technology improvement when I bought this second one, but no such luck. Now I just have 2 cute squeekless Triceratops.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Impressed with the durability",
      "text": "We've had this a month, and it's still going strong. Sophie maims most toys on the very first day--she found a vulnerable vein in a GoDog hen I bought at the pet store within an hour or so (although just one seam and one of the squeakers; I took out the stuffing and she stills plays with it every day, and the remaining squeakers are intact). She hasn't managed to open any seams in this despite regular play. She has somehow defeated the squeaker without actually getting to it--but I'm more than OK with that! She's chewing on its crinkly tail at this very moment. I'm happy to have found GoDog and will stick with its dino line for now.",
      "rating": 5.0,
      "verified": true,
      "author": "Bemused",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Totally TOUGH!",
      "text": "This toy is TOUGH! We have gone through at least 10 other toys (the typical “extra tough” dog brands) and when I bought this one almost two months ago, I thought we would have the same issue: 12 week old teething pitbull 11, toys 0! But this bad boy has held up and is still in great shape!! We have had to wash it a number of time and dry it since the puppy loves it SOOOOO much and it looks great! He loves it so much that I bought a second in the event he misplaced his baby! Seriously, the best-no other toy compares!!",
      "rating": 5.0,
      "verified": true,
      "author": "AGO",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Squeaker arrived broken",
      "text": "UPDATED 5/11: We received a free replacement toy in the mail once we filled out the company’s form online (not the same one) and my dog has not put it down in over 7 hours. She chewed the face off in hour 2, but the squeaker is still going strong and she hasn’t gotten it out yet. Pleasantly surprised with company’s responsiveness and relative durability of second toy. Dog seems to like chewing the animal well enough, but the squeaker didn’t make any noise out of the box. Disappointed, since squeaky toys are pup’s favorite and we had high hopes for this one.",
      "rating": 4.0,
      "verified": true,
      "author": "Amber Dickey",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Not for heavy chewers!",
      "text": "Awesome dino, but my Boston Terrier destroyed it in just a couple of days! The only reason it lasted that long is because she directed most of her attention to the other dino I got first. With my other dogs it probably would have lasted longer, but they couldn't keep it from my Boston Terrier. Once she heard it squeak it was over in a matter of minutes.",
      "rating": 3.0,
      "verified": true,
      "author": "Sonja McLamb",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Lasts WAY longer than all other toys!",
      "text": "Got a chewer? I can't recommend this material enough!! He has a purple horse made with this fabric that is almost 7 months old. He is a German Shepherd that just turned a year. He has destroyed and chewed apart all of his other toys. After seeing how his favorite toy, the horse was holding up, he also now has a dragon and a dino! GREAT fabrication!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Don’t buy it",
      "text": "This lasted about 10 minutes out of the box before one of the seams gave out and my dog ripped it open. So sad considering we have another product from this company, the blue/purple dragon, and that’s lasted over 4 months. We actually still have that one and thought this would hold out the same. Sadly mistaken. Do not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Saddlemoon",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "not that great, company lies.",
      "text": "To be honest, this one is kind of a rip off. They say that its chew proof and its not. My dog had it open in about 45 minutes. The only good thing is that the outer shell is still here and he plays with it now and again. As far as not causing a mess and not to much fluff to clean up, thats a big lie!",
      "rating": 2.0,
      "verified": true,
      "author": "Troy",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "This Toy Lasts Longer than 95% of the Rest",
      "text": "My dog is an accomplished chewer. He is probably the great grand pup of some distant hyena capable of chewing elephant bones. These toys are certainly not chew proof, but my champion toy destroyer doesn't make easy work of it. These toys, unlike others, last WEEKS! I highly recommend any of the toys with this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Nbrightw",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Beautiful toy, didn’t last long",
      "text": "My dog really liked the toy but it didn’t last long at all. It only last a few minutes before the body was exposed! I was really surprised because the smaller goDog purple dinosaur toy that I purchased several months ago is totally fine! The triceratops is a nice size toy and was much easier for my dog to rip open in the body. The ears and tail are still intact and have a crinkle sound and she picks it up on occasion, but it doesn’t squeak on the main body and isn’t very interesting anymore. I’m so sorry to leave this review because I like the brand. Perhaps I got a dud toy.",
      "rating": 2.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "German Shepherd Favorite!!",
      "text": "My 2 y/o German Shepherds favorite toy. This is a replacement of her first one. The first last a whole year and she carries it everywhere all day. She’s rough with it and plays tug of war as well. This is the only toy I have found to withstand her, as she prefers stuffed animals over the plastic hard toys.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Black",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "If you dog really chews a lot this won't last long - disappointed.",
      "text": "Had this product for my Lhasa Apso and they have lasted him years, got them for our new Australian Sheppard and it lasted about a week. Ordered it a while ago but had forgotten about it, gave it to her this week and found her eating stuffing in no time. Never left her alone with it, was in the same room and one minute it was fully intact and the next she was eating stuffing. Since they lasted my other dog years I must have gotten a false sense of how tough they really were when a big chewer got a hold of them. It's a shame because we like them but definitely can't purchase them for her anymore.",
      "rating": 2.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Amazing product.  My dog loves it!",
      "text": "Dude. This is the only stuffed animal that has survived my Cane Corso/Blue Nosed Pitbull Mix. The only thing she’s was able to tear off this thing was his little horn. Other than that she can’t get the thing apart. ITS AWESOME!!! If you have a chewer..:I highly recommend this brand!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie S.",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Within one hour of receiving the toy, our 11 ...",
      "text": "Within one hour of receiving the toy,our 11 month old red heeler had torn multiple holes in the toy and had broken the squeaker on the first bite,torn the horn and nose off and pieces around the head within minutes and had stuffing ripped out. Was very skeptical on the purchase of this toy because have had dog togs before that last longer that was bought from walmart. Not impressed already submitted refund claim with this product.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Mattoon",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Worth it!!",
      "text": "I have a black lab puppy and man oh man is she ruthless. Toys do not last in this house. She LOVES plush toys which is why I thought I’d give these a try before I gave up completely. I am so glad I did. She loves her dinosaur! She tears him up and so far he’s lasted a month, which is a super long time. He is still alive and has not needed any sewing or anything. I highly suggest!",
      "rating": 5.0,
      "verified": true,
      "author": "Sierra",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Not for large Dogs",
      "text": "I own two Mini Schnauzers and my daughter has a yellow lab. I bought this because it was recommended for dogs that chew. I received this on last Thursday and my schnauzers had a ball with it. They played with it but didn't rip it at all. On Sunday my Daughter's dog came for a visit and the toy was destroyed in about 10 minutes. The lab ripped into it as if it was made of regular cloth. She has a thing for squeakers. I had high hopes for this toy, but it is like all the others I have tried. I do not recommend this toy for large dogs that are strong chewers.",
      "rating": 1.0,
      "verified": true,
      "author": "Herron",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Not durable but it’s my dogs favorite",
      "text": "My 38lb dog is obsessed with GoDog stuffed animals. He received this Christmas morning and within 20minutes it was missing a leg and a tail. These are not durable however I still buy them because my dog loves them. I watch him closely and remove the stuffing and squeaker as he destroys it. And then it’s just the outer layer which he loves to snuggle with.",
      "rating": 4.0,
      "verified": true,
      "author": "Danielle Nordquist ",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Our dog loves this triceratops toy! ❤️",
      "text": "Our dog loves this toy! To be fair, he’s not a crazy aggressive chewer, but he loves playing tug of war with the dinosaur or just cuddling with it during nap time. The tip of the tail makes a crinkle noise. The squeaker was the first casualty and no longer works after just two days. That said, I’d still buy another as a replacement because he’s so happy when he’s dragging it around the house. 🐾",
      "rating": 5.0,
      "verified": true,
      "author": "Jelihi",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "This is wonderfully MADE!!",
      "text": "This is very soft and nubby and sturdy. This is a great size for a medium to large size dog. Has a lot of stuff fabric, so not as much stuffing for your dog to swallow if it was to be broken open. I can’t see our dog ripping this though!",
      "rating": 5.0,
      "verified": true,
      "author": "LK27",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "It only took 45 minutes.",
      "text": "I bought the triceratops and received it 3 days ago. My 50 lb. bulldog/boxer/yorkie-mix played with this for 30-45 minutes and destroyed the squeaker in the first 10 minutes with ease. Shortly after she ripped a seam open, and has pulled all the stuffing out. She's also created a number of other holes. Save your money, get a Kong. I've had the Kong for 6 years and my pet can't kill it. :)",
      "rating": 1.0,
      "verified": true,
      "author": "James Michael Grove",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Are zero stars possible?",
      "text": "Within 10-15 mins MAX my 10 month old dog ripped multiple pieces off of the dinosaur. All the little triangles and the horns on the face are ripped or eaten off already. Disappointed because the body seemed durable, just the smaller pieces sticking off it the body was the issue :(",
      "rating": 1.0,
      "verified": true,
      "author": "Christina Harrity",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Still intact two months later",
      "text": "Adopted two evil little terriers who play tug of war constantly. They've been through so many toys and stitched up toys that I've needed to toss after finding cotton stuffing all over the house. This toy has been in some major battles and is looking the same as when it arrived. Not sure how they make this but its a very well made, sturdy and fun toy for crazy dogs who have a strong bite.",
      "rating": 5.0,
      "verified": true,
      "author": "Mama Nature",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "better than expected!",
      "text": "My husky loves toys like these. Especially when there is a squeaker involved. From the other comments I've read about this I was skeptical it would last my dog for long because of him being such a chewer. But this toy has not even torn yet and I've had it for days. My dog loves it and I would 10/10 recommend it for heavy chewing dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Fun For A Day, But Easily Chewed Into Pieces.",
      "text": "Have let her play with this toy for two days. Already finding pieces of the inside of the toy in the house. I expected something a bit durable. If your dog chews, I do not recommend this toy. Definitely not for a puppy that is teething.",
      "rating": 1.0,
      "verified": true,
      "author": "On Time",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "It puts up a mostly valiant fight with my Goldendoodle",
      "text": "GoDog are the only soft toys we buy for our goldendoodle who loves to chew her toys to death. It took about a day to get at some of the fiddly bits on this but the rest is fine. She's destroyed lesser toys in minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "GFX",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Tougher than most!",
      "text": "My 6mo pup (24lb male lab mix) absolutely loves his triceratops. There's obviously no toy on earth that is chew-proof but we've had it for a week and he made his way through the tail then the horn, bringing all the stuffing out. I just wish there would be a no squeaky option for owners as he's figured that out and won't stop 😅 He's still going at it and loves it so thank you!",
      "rating": 4.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Maybe not the toughest, but relatively durable",
      "text": "My pup is a *tough* chewer -he might be only 15lbs but he can gnaw through literally anything.. he’s gnawed apart wooden furniture, electrical cords, anything he can get his lil teeth on. I had a feeling this wouldn’t be “indestructible” given his abilities, and I’ve been pleasantly surprised -he chewed off the horns in like an hour, but after some sewing, the toy has held up pretty well.. it’s lasted over a week, which is saying something :)",
      "rating": 5.0,
      "verified": true,
      "author": "Surfing yogi",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Super chewer, lasts about 2 months",
      "text": "We as a household love this brand of dog toys. We have an older dog that these would last about 2-3 years. We got a puppy and she’s a super chewer. They last about 2 months and then stuffing, squeak, and it’s torn to pieces. I know a toy should last longer, but she’s a super chewer and most toys last a day if we are lucky. We’ll be buying these always. And they are so cute, and colorful.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Ziegenhorn",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Great for my Lab/Husky mix dogs",
      "text": "We love these toys! I have 2 large dogs (Lab/Husky mix) and they will disembowel there toys. These ones are perfect, no much filling and the fabric holds up well. They will typically chew the feet or face off trying to get to the squeaky. But after the squeaky is gone we use it for general fetch and tug play. They have lasted me for more then two years. This is one of several replacement toys I finally needed to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Sweeney",
      "helpful_votes": 2,
      "publication_date": 20170908
    },
    {
      "title": "Power chewer hasn’t destroyed it yet!",
      "text": "We are three months into living this toy. Our puppy is clearly a power chewer-antlers and bones last a month at most. She shreds stuffed toys and will work incessantly to pull apart seems and yank out stuffing. BUT this one has held up. A few of the points on the edges have been pulled off but the seems are holding. She loves this guy, drags it around, plays tug with it, chews and pulls. Great, sturdy and one of her favorites!",
      "rating": 5.0,
      "verified": true,
      "author": "Carey",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "RIP stitches opened after 2 months",
      "text": "Our goDog Just for Me TRex only lasted two months before it’s stitches opened up. My dog ate a chunk of the stuffing so I am trying to see what to do about it. We had the goDog dragon last two years so I hoped the goDog TRex would, too.",
      "rating": 4.0,
      "verified": true,
      "author": "Guy&GalTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Surprised at how much he loves it",
      "text": "I got very fed up with the Bark Box people, so now every month I just order my boy a toy and a treat from Amazon. I can't believe how much he loved this dinosaur. It's cute and soft, but not a lot of filling which is great. My dog LOVES to rip out filling. This one is staying on the keep pile...but we all know our dogs have no rhyme or reason for what they love!",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonHuntressTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "My two big dogs love it!",
      "text": "This is bigger than I expected and my pups love it! I am pretty happy that the squeaker inside broke after a day .They haven't torn any limbs off yet and it's been over a month! They like to play tug of war with it and chew on it and it's still whole so far! If this review was helpful, please click the helpful button. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel J",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "One of our favorites!",
      "text": "For some reason my dog gravitates towards the dinosaur toys. We have SEVERAL from this brand. He loves them. They are advertised as touch to break- but my dog always manages to get the squeaker out. It took him about a day- but he successfully got that thing out. I will say that even if he tears a hole in them and gets the squeaker out- this toy holds up much better than most others. It doesn't rip into pieces but rather stays intact even with a hole in it. We will buy from this brand again.",
      "rating": 5.0,
      "verified": true,
      "author": "CourtneyE",
      "helpful_votes": 0,
      "publication_date": 20161020
    },
    {
      "title": "Love these dog toys!",
      "text": "I bought this on sale and jumped on it so quickly that I haven’t even used it yet. I love these products though. Super durable, just the right size for my 30 lb mutt, and so so cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel H.",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Doesn't hold up with super chewers",
      "text": "Arrived in mint condition. Within 30 minutes the squeaker was dead, no more squeak. A week later the crunchy bit in the tail was gone. And a week after that it was completely tore apart, stuffing and dead squeaker removed because I don't like our dog eating this stuff. They are cute toys but regardless what they say, they don't hold up with super chewers.",
      "rating": 2.0,
      "verified": true,
      "author": "DLougher",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Durability depends on chew force and frequency applied",
      "text": "My dogs loves goDog toys like this one, he's a large breed and very active, but although he chews his toy all day he doesn't apply to much force, I have seen a hard chewer destroy one of these in minutes. So, it's durable but not for a dog who chews very hard.",
      "rating": 4.0,
      "verified": true,
      "author": "ana godinez",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Not this one :-(",
      "text": "I have gotten a few of these goDog toys and they've been very durable and chew proof. For some reason, once my dog started to play with this one and squeak it, he ripped it to the stuffing.....only about an inch long. I had to take it away from him or there would have been stuffing everywhere.",
      "rating": 1.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "This Toy Had No Stuffing",
      "text": "Unfortunately, this toy didn't last long. Archie had the squeaker out in 20 minutes. Also, I noticed that it had no stuffing! That's a first. This brand of toys is usually excellent. Not this toy, though.",
      "rating": 2.0,
      "verified": true,
      "author": "Joyce Ann, Florida",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Legs come off with very little pull.",
      "text": "I was disappointed .This was billed as double stitched and durable.Yes I have a pit bull ,but within 5 min it was completely destroyed.Usually something billed as durable lasts a little longer.",
      "rating": 2.0,
      "verified": true,
      "author": "Psych RN",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Root",
      "text": "Root, cracks me up. He’s a year and a half old and he loves to destroy things!! But he know what his toys are and aren’t. He’s been at this thing for the past hour. He destroys toys in seconds, by the snap of fingers it’s gone! But he’s yet to budge with it and absolutely can’t enough of it and ABSOLUTELY loves it!! Worth it for you destructive creatures.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaylee",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Wrestlemania time!!!",
      "text": "Oh my!! This is a fun toy for my pug.. I got the large one on a hunch he would enjoy wrestling with it.🙂 he loves this toy.. where it gives him some fight back capability.. he can carry it around to.. and he can jump up on the bed with it.. It has a squeaker and a crinkle tail.. he loves both.",
      "rating": 5.0,
      "verified": true,
      "author": "Jodi Lynn Brown",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Great product and great price",
      "text": "I have used these before, and my dog loves them. She has attempted to shred every other toy I’ve given her, but these are her buddies. She has only torn one of them, but because of they way they are made gave up after a little tear. I’m sure this has everything to do with the way your dog plays, but they seem to be much stronger than any others I’ve bought. It’s also nice being able to wash them without it falling apart. There is also a great selection!",
      "rating": 5.0,
      "verified": true,
      "author": "lewisad49",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Not master chewer proof",
      "text": "Our dog “enjoyed” her triceratops for about 48 hours before she turned it into a biceratops... I sewed up the torn horn so hopefully it will last another 48 hours or so. Before easily chewing off the horn, the rest of the toy did provide enjoyment for the short time she had the toy",
      "rating": 1.0,
      "verified": true,
      "author": "Jacquelyn Bordelon",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Be prepared for a mess",
      "text": "Not as good as the dragon from this brand. As soon as they have put a hole in the nose or horns, they can easily work their way into chewing it methodically like a bone (except my dog thankfully does not eat the pieces) until the head is almost gone.",
      "rating": 3.0,
      "verified": true,
      "author": "Larka_etherin",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Heavy chewer won",
      "text": "Slightly durable, lovely dog toy. Like most dogs, ours ate the tail off the Dino toy, then she proceeded to eat the face. Mind you, it’s still around, and slowly leaking the soft filling. Of durable toys, it’s lasted a lot longer then other toys. Our dog sleeps with it, rests her head on it, it’s quite a stinky snuggle dog toy. Super soft too.",
      "rating": 4.0,
      "verified": true,
      "author": "Raza",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "NOT for agressive chewers!!!",
      "text": "Believe the reviews that say these toys were shredded in minutes. I chose to ignore those and listen to the ones where they actually lasted longer than a normal plush. My 1 year old Airedale ripped the tail off this thing within the first few hours, which is a shame - she loves plushies but have yet to find one strong enough for her. I added one star to the review since the company apparently offers a one time replacement as their \"guarentee\" although according to their website, processing and shipping of the replacement takes 8-10 WEEKS. Just so that my dog can shred it again in an hour......",
      "rating": 2.0,
      "verified": true,
      "author": "KDC",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Not made for aggressive chewers",
      "text": "My 7 month old mixed Beagle puppy broke the speaker in less then 5 minutes and then proceeded to eat it's nose in less then 12 hours after giving it to her. I bought her 2 dragons from the same brand and didn't even bother to give them to her. Thank you Amazon for being willing to let me return all 3 items. Even the one she destroyed!",
      "rating": 1.0,
      "verified": true,
      "author": "Eileen",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "It's absolutely has no chew guard to it!",
      "text": "This item was just another peice of crap . It said it was chew proof , HA my dog had it torn to prices within 15 min. It was nothing described as being chew tough/proof. Cuz it's not unluss you are talking Chihuahua chew proof. I do not recommend this item for playful puppies.",
      "rating": 1.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Lasted longer than most toys..... and now his fav",
      "text": "Been at least 2 weeks -- that is a LONG time for this little doggie! No signs of wear yet (he destroys most toys, even \"tough\" ones). He takes this one to bed with him now, it's a fav and I am ordering another for the day we have to say goodbye to this one. Nicely done toy!",
      "rating": 5.0,
      "verified": true,
      "author": "MGW",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Not as tough as they used to be.",
      "text": "I used to love these toys for my dogs because they lasted forever. Either my dogs have become much more destructive or the toy is not being made to the same standards. I think my dogs are about the same as they used to be, except maybe a little older. This means the toy is not as tough as it used to be. The triceratops lost its horn and has a hole in his head as a result. Cute toy but I will not be buying again.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Barber",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Death to squeakers",
      "text": "My Aussie, who chews up everything, loves this dinosaur. It is not chew proof though. She had it maybe 30 minutes before she had chewed the tail open to get the squeaker out. She then murdered the squeaker. We wish we could find squeakless stuffed animals for her.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Cute but disappointing",
      "text": "My dog is a chewer and he has a history of destroying every cloth toy we purchase for him. I was drawn to this toy because of it's claims of being \"indestructible.\" Unfortunately, the product did not live up to it's name or characteristics. My dog destroyed this toy in under 10 minutes. The company has a one toy 30-day replacement/warranty policy and I received a replacement, but my dog ended up chewing through it is less than 5 minutes. My dog loved this toy, but the immediate clean up was not worth it.",
      "rating": 1.0,
      "verified": true,
      "author": "Wolverine State Resident",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Indestructible dog toys",
      "text": "One of 3 or 4 that have lasted a little longer than most of the many indestructible toys I've bought frim Amazon for my Labradoodle. Most of them I've have to take away her within 15 to 30 min. because she's torn them to pieces or has chewed big hunks of rubber out of them.",
      "rating": 4.0,
      "verified": true,
      "author": "Linda G. Irwin",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "cute but not strong enough",
      "text": "This toy is adorable, and a good size. But it was no match for our 15lb puppy. He had one of the horns torn off in about 20 minutes, and a hole punctured through in another 20 minutes. He loved it, but we didn't love picking up fluff so quickly. For a pup who is not quite as an aggressive chewer as ours, I think it would be fine. But if yours likes to chew, don't waste the money.",
      "rating": 2.0,
      "verified": true,
      "author": "Aaron S.",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Indestructible!",
      "text": "This toy is truly made of indestructible material! My dog is a tour and the last toy I purchase from godog didn't disintegrate whatsoever and I still have it today! They make great products!",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Fann",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Was super cute...for about 10 minutes 🤔",
      "text": "Was really hoping that this would be a toy that lasts longer than just a few minutes. As you can see in the picture it didn’t. Within 10 mins he had the stuffing out. It’s was super cute and I think if you have a smaller dog it might last a bit longer then ours did. The search continues 😂",
      "rating": 3.0,
      "verified": true,
      "author": "Kristi Knudson",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Do not recommend for large aggressive chewers",
      "text": "I rated this toy a 3 because it did last two wks which is longer than most toys. I have a German shepherd just under 2 yrs old and today he tore into his Dino. If you have smaller breed or a dog that isn’t that aggressive of a chewer, this toy may work for you. I do not recommend for large breeds or extreme chewers.",
      "rating": 3.0,
      "verified": true,
      "author": "leeann",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Nope!  Not durable AT. ALL.",
      "text": "This didn’t last even 20 minutes. I don’t have a huge dog. I have a Keeshond.",
      "rating": 1.0,
      "verified": true,
      "author": "Beknlee",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Cute, cute, cute!",
      "text": "I can't wait for puppy 5 month birthday on 10-12 so that he can get his 3 horn. I was looking for presents and when I saw this I just laughed. I had to get it and figured I'd have to send it back for being too small. When I opened the box I was pleasantly surprised that it is a good size and my Tank will have a great time trying to chew everything apart.",
      "rating": 5.0,
      "verified": true,
      "author": "Moosemaven",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Done in two chew sessions",
      "text": "Disappointed at all the hype this product description gives. It does not live up to the description. Pup made a hole in the first chew session- around the sewed-on logo patch on the triceratop's behind. I hand-sewed around the patch to reinforce it. Then pup made a sole in the middle of the fabric (not even on a seam) during the next chew session. I sent it back.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Buse",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "probably received the very tiny version, rather than the size i ordered, but still...",
      "text": "this toy is incredibly tiny--looking at the dimensions posted beside the exact one from my order i believe they sent me the wrong size, which is a pain because now i have to return it and await for something bigger than a hamster in a miniscule sunbonnet if ever i wish to actually let my dog have it. also, now that i have one of these in hand, i'm assessing it as not very durable for any avid chewers but we'll see...Kong and Goughnuts are probably the only toys i should get for my girl and it's time to stop hoping for the miracle plush that will hold up to a working German Shepherd. sigh.",
      "rating": 1.0,
      "verified": true,
      "author": "Erin G.",
      "helpful_votes": 0,
      "publication_date": 20151112
    },
    {
      "title": "Very durable and fun to play with",
      "text": "Get this for your tough chewer. My dog destroys most toys within a day or two. This one has lasted 3 weeks so far! That’s a record in our house. He loves to play with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Trevor",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Much bigger than I expected, but the pup loves it!!",
      "text": "I can honestly say I’ve been pleased over all by multiple items I’ve purchased just like this one from the seller. This one in particular though is pretty big compared to others I’ve purchased, and my pup goes crazy over it! She’s a 4 month old black lab and this thing hasn’t left her side since it arrived 24 hours ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Felicia Mary",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Lasted two days, but my dogs are heathens",
      "text": "This toy was adorable, and I know my older dog would of cherished it forever. But since I have two other heathen beasts, it was tugged on and torn to bits. If you have one dog that would toss it around or snuggle with it, it would be a good toy.",
      "rating": 3.0,
      "verified": true,
      "author": "Anna Denny",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Red dragon is not good choice",
      "text": "Less than 15 min and my 2year old jack Russell had 2 holes in it and the squeaker out.....this is in the red dragon. I usually get the gray one but wanted to try something different- ugh.",
      "rating": 1.0,
      "verified": true,
      "author": "cara",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Only good for non aggressive chewers",
      "text": "Unfortunately it did not withstand our aggressive chewer puppy and it was destroyed in minutes. But our cheweenie loved it and was perfect for him. I would recommend for non aggressive chewers.",
      "rating": 3.0,
      "verified": true,
      "author": "Taylor",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Greay quality, the only brand i would buy",
      "text": "My pups, 20&25lb, have destroyed so many toys I stooped buying any toys for them for a long time. Last Christmas one of my friends gave us a godog toy and it lasted for months!! I know it doesn't sound like a big deal but we have even tried the toughest Kong and it didn't last two days. Most stuffed anything last only about five minutes. Once we tried godog, that is the only brand I would buy. Its not cheap but the quality is well worth it. One note tho, I usually cut the taGS before I give it to my pups. Just because the tags can be chewed off relatively easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Yung",
      "helpful_votes": 0,
      "publication_date": 20151007
    },
    {
      "title": "Not made for a game of tug of war, but good enough to keep them entertained",
      "text": "I purchased one of these toys for my little guy, this Christmas. Despite being eight years old, nothing has him acting like a puppy quite like a plush toy with a squeaker. After having gone through a bunch of similar toys that typically wouldn’t last more than a week, I decided to try this one out. Not only does he love it, but the toy is still practically intact! The only reason I haven’t given it five stars is because within the first day he managed to pull open one of the seams just a smidgen. Nothing unfixable, however.",
      "rating": 4.0,
      "verified": true,
      "author": "Inês",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Would order again",
      "text": "My Cocker Spaniel is a destructive little dude so this has been perfect for him. He slings it around, chews on it all the time and so far has held up wonderful with no holes, rips or tears.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Zero stuffing",
      "text": "I just received this in the mail. I know it said it was minimal stuff but this thing had like zero stuffing except for the feet. I wish there was a Velcro thing so I can at least put a bottle in there for my dogs.",
      "rating": 3.0,
      "verified": true,
      "author": "Alyson",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Don’t buy this",
      "text": "This was delivered today and in 30 minutes my dog had it destroyed. Stuffing and squeezer on the floor. I ordered this because it was advertised as tough and durable. I am so disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Bobbie12",
      "helpful_votes": 0,
      "publication_date": 20200601
    }
  ],
  "product_meta": {
    "title": "goDog Dinos Frills The Triceratops Dog Toy",
    "description": "Size:StandardgoDog Dinos are a blast from the past.Made with bubble plush and lined with Chew Guard Technology, these toys stand up to tough play. Minimal stuffing gives these toys a fun \"floppy\" feel that dogs love!\n\nAMAZON.COM\n\n\n\n\nDinos are every dog's prehistoric favorite! Made with bubble plush and Chew Guard Technology™ these are sure stand up to tough play! Even though no dog toy is indestructible, our goDog toys with Chew Guard Technology are tougher and last longer than standard soft plush toys...and we GUARANTEE IT! If this toy does not outlast your standard plush, we will send you a onetime replacement. (see product packaging for details)\n\n\n\n\nGODOG TOYS\ngoDog™ is a fun lovin' brand from Quaker Pet Group featuring toys for dogs of all breeds and sizes. A wide array of goDog toys are available with tough Chew Guard™ technology. Chew Guard offers added durability to help toys stand up to tough chewers. goDog toys are bright and colorful! Check out all of the fun families of toys.\n\nQUAKER PET GROUP – A FAMILY OF PRODUCTS FOR YOUR FAMILY OF PETS.\nQuaker Pet Group is committed to providing products that will enrich the lives of pets and their pet-parents world-wide. We offer innovative, solution-based products that meet pet’s needs. Our brands include Sherpa®, goDog™, Hear Doggy!®, SuperCat™, New York Dog™, Fox & Hounds™ and SilverTails™.\n\ngoDog™ Dinos Large Spike Large Frills Large Bruto Large Terry Small Spike Small Frills Small Bruto Small Terry",
    "rating": 3.9,
    "feature_bullets": [
      "goDog Gray Frills Dino with Chew Guard Technology",
      "Super-soft bubble plush dogs love",
      "Fun squeaker and under-stuffed for less mess",
      "Super tough to stand up to rough playtime fun",
      "Features Chew Guard Technology and double stitched seams to last longer than your standard plush toy, GUARANTEED! See below for additional details"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "16 x 7 x 8 inches; 6.4 Ounces",
      "Item model number": "770795",
      "Department": "Pet Supplies",
      "Date First Available": "January 25, 2010",
      "Manufacturer": "Quaker Pet Group",
      "ASIN": "B0035XWPZM",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Chew Toys",
      "Dogs",
      "Toys",
      "Pet Supplies"
    ],
    "price": 10.89
  }
}