{
  "website_summaries": [
    {
      "verdict": "Intended to hold two pairs of cross-country skis, this bag's compression straps let you carry the skis more easily by binding them as one unit. Consider padding the bag with your ski clothes.",
      "pros": [
        "Holds two pairs of Nordic skis up to 210 centimeters in length",
        "Exterior compression straps keep skis from shifting inside",
        "Padded interior divider protects gear and keeps it organized",
        "Ends are reinforced with high-density polyethylene board",
        "Heavy-gauge zipper",
        "Cinch strap helps transport easily"
      ],
      "cons": [
        "Bag is best suited for Nordic skis"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Easily fits 2 pairs of nordic (ie cross country) skis and poles",
      "text": "Nice basic protection for your cross country (nordic) skis and their poles. Easily fit two pair and poles (actually fit 4 pair and two sets of poles). Fit my 206 cm skis in (snug but they fit). Not alot of extra padding, so not really suitable for air travel. Nice heavier guage zipper should go for a bit, and reasonable weight material.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Corrigan",
      "helpful_votes": 8,
      "publication_date": 20180113
    },
    {
      "title": "Bag shorter than advertised.",
      "text": "This bag is advertised as being able to hold two pairs of skiis up to 210 cm/82.5 inches in length. I bought this for two pairs of x-country skiis, one of which is 80 inches long. But the bag is only about 78 inches long. So basically it's a 200 cm bag. I've missed my return window, so I'm stuck with it..",
      "rating": 1.0,
      "verified": true,
      "author": "GracieLou731",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "held 2 pairs of skis and boots",
      "text": "This was a gift for carrying cross country skis and worked well, making it much easier to transport 2 pairs of skis and boots.",
      "rating": 5.0,
      "verified": true,
      "author": "elemiller",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Holds more than we thought!",
      "text": "Bought this for our Nordic skis. Held two pairs for Nordic skis, 2 sets of poles and 2 sets of boots! Very happy with the purchase. Quality seems good for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "What I was looking for",
      "text": "This turned out to be exactly what I was looking for. Enough room to keep two sets of XC skis and poles for tallish people to help protect the inside of our SUV while on ski outings. It is not very heavy duty protection (for the skis). I would not recommend this bag as a travel bag for a lot of airport use. The price is right for what I use it for.",
      "rating": 4.0,
      "verified": true,
      "author": "jlabel",
      "helpful_votes": 2,
      "publication_date": 20150318
    },
    {
      "title": "Designed for Nordic Skis",
      "text": "Bought a \"ski\" bag previously, but was too short for Nordic Skis. This one is long enough for Nordic Skis. Big enough to hold two skis plus poles.",
      "rating": 5.0,
      "verified": true,
      "author": "Meg-Dawg",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "You get what you pay for",
      "text": "In all honesty, you get what you pay for here. The cinch straps are a huge benefit, as it makes a wobbly dual pair of XC skis into a single rigid transportable item. The separator inside is kinda a joke. What is needed here is some strapping inside so that the padding stays in position to prevent damage to your skis.",
      "rating": 3.0,
      "verified": true,
      "author": "Rick W",
      "helpful_votes": 2,
      "publication_date": 20140131
    },
    {
      "title": "Fit 2 sets of XC skis (not boots)",
      "text": "Plain and simple bag for two sets of skis and poles. Nothing more/nothing less price is right",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Do not buy this bag if you want it to ...",
      "text": "Do not buy this bag if you want it to fit 203cm or 207cm nordic skis. It is NOT 83in (210cm) as it claims. I measure 199cm or 78.5in max and that's being very generous. I have no idea how other reviewers have given it positive points as the bag will NOT fit long classic nordic skis. The product information lies. I returned it immediately after receiving since none of my nordic skis would fit.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin Jones",
      "helpful_votes": 3,
      "publication_date": 20160218
    },
    {
      "title": "Better than what it was designed for",
      "text": "Actually used this to carry all my drywall levels and wood clamps. Way heavier than skies and this thing held up great while moving. Looks like a pretty good zipper. No frills, but no BS either.",
      "rating": 5.0,
      "verified": true,
      "author": "Hair Jordan",
      "helpful_votes": 0,
      "publication_date": 20161019
    },
    {
      "title": "what a louse design. only have foam separator in ...",
      "text": "what a louse design. only have foam separator in the middle of bag. no fastening straps for ski or poles. your equipment still got banged inside the bag. what a joke. stingy for $40 bag. sorry you have to buy extra accessories. What a ripped off!!!! Double ski Bag!!!",
      "rating": 2.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 2,
      "publication_date": 20160211
    },
    {
      "title": "works good for that",
      "text": "using to hold a back drop display, works good for that too",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "this simple bag is a great value, and is adequately sturdy and functional",
      "text": "For the price, this simple bag is a great value, and is adequately sturdy and functional. Can pretty easily carry 2 sets of skis & poles--a great concept for carrying cross country skis! One complaint is that it takes some effort to squeeze 210 cm skis inside. The padding doesn't really do anything, but that doesn't seem to matter.",
      "rating": 4.0,
      "verified": true,
      "author": "JBS",
      "helpful_votes": 0,
      "publication_date": 20150114
    },
    {
      "title": "Great bag, takes a beating",
      "text": "We put skiis in the bag and then put it on top of our Subaru and drive 4 hours. So it takes a bit of a beating but so far the zippers have been solid, no problems with raveling or tears. We are very happy with it and would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "nekko925",
      "helpful_votes": 0,
      "publication_date": 20140324
    },
    {
      "title": "Double Nordic Ski Bag for my Alpine skies",
      "text": "The may fit two pairs of Nordic skis, but with Alpine Bindings, only one pair fits. The price is good and the quality seems to be good as well. I will update this posting after this weekend if the bag fails in any way. I do not expect that to happen.",
      "rating": 4.0,
      "verified": true,
      "author": "J. MacDonlad",
      "helpful_votes": 0,
      "publication_date": 20130320
    },
    {
      "title": "Watch the word Nordic... it means cross ...",
      "text": "Watch the word Nordic... it means cross country skis... not downhill. If you have downhill skis you will barely fit one pair.",
      "rating": 4.0,
      "verified": true,
      "author": "kart97",
      "helpful_votes": 3,
      "publication_date": 20150326
    },
    {
      "title": "Great buy",
      "text": "Exactly what I wanted. Easily holds two pairs of skis and poles.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Rye",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Very nice bag for our skis",
      "text": "We have two adult sets of cross country skis including one over 200cm. Also have a kids set and they all fit in this bag with poles. Perfect. Nice carrying handles as well.",
      "rating": 5.0,
      "verified": true,
      "author": "MNPilot",
      "helpful_votes": 0,
      "publication_date": 20140309
    },
    {
      "title": "Works great.",
      "text": "This bag is durable and works great. May not have major brand name on bag, but equally as good!",
      "rating": 5.0,
      "verified": true,
      "author": "Wilber Enterprises",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "Great Ski Bag",
      "text": "I use this to transport and store two sets of cross country skis and poles. Great value for the money, love how it has a middle divider to keep both sets separate from each other.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn R",
      "helpful_votes": 3,
      "publication_date": 20130405
    },
    {
      "title": "Super thin",
      "text": "Not padded at all. Bag is paper thin and divider is inadequate. It is big enough to fit two pair of XC skis. Not disappointed, but I would certainly use additional padding when using this bag for travel.",
      "rating": 2.0,
      "verified": true,
      "author": "Wyatt Johnson",
      "helpful_votes": 3,
      "publication_date": 20150315
    },
    {
      "title": "Good for two pairs of cross-country skis and two pair of poles.",
      "text": "Bag is good for two pairs of cross-country skis and two pair of poles. Fabric separator is small to isolate pairs from each other , but helpful. Quick delivery. Everything is as described and expected.",
      "rating": 5.0,
      "verified": true,
      "author": "SG",
      "helpful_votes": 4,
      "publication_date": 20130329
    },
    {
      "title": "Dont buy it unless your skies have no bindings and you own no poles",
      "text": "No matter how you try to fit the skies in it, 2 skies will not fit. Maybe they mean 2 skies without bindings? Note - quality of bag naterial is awful.",
      "rating": 1.0,
      "verified": true,
      "author": "Q123456",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Four Stars",
      "text": "good value. not very thick fabric, but considering the price a good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "50-something",
      "helpful_votes": 0,
      "publication_date": 20160408
    },
    {
      "title": "Five Stars",
      "text": "Accommodated 2 pairs of 185 mm skate skis & a pair of down hill with poles.",
      "rating": 5.0,
      "verified": true,
      "author": "furryoldgrover",
      "helpful_votes": 0,
      "publication_date": 20160327
    },
    {
      "title": "Perfect",
      "text": "Durable. Works great! Easily fits two pair of skis and poles.",
      "rating": 5.0,
      "verified": true,
      "author": "MK",
      "helpful_votes": 0,
      "publication_date": 20160307
    },
    {
      "title": "Excellent Product & Good Value",
      "text": "Easily held two sets of nordic skis with poles. Good quality materials and well designed. Cushioned divider worked fine even though its does not extend the entire length of bag.",
      "rating": 5.0,
      "verified": true,
      "author": "M. A. Kammer",
      "helpful_votes": 9,
      "publication_date": 20110505
    },
    {
      "title": "Like it ...",
      "text": "Very good ski bag ... and big enough for my husband's skis. Well made and strong, looks nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20140407
    },
    {
      "title": "Four Stars",
      "text": "Nice bag, plenty of room for ski's poles and a few clothing items when travling",
      "rating": 4.0,
      "verified": true,
      "author": "Big Ring Rider",
      "helpful_votes": 0,
      "publication_date": 20150128
    },
    {
      "title": "Nice bag. Easily holds two sets of back country ...",
      "text": "Nice bag. Easily holds two sets of back country skis, with poles. One complaint is that after very little use one of the zipper tabs came off.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Shumway",
      "helpful_votes": 0,
      "publication_date": 20150314
    },
    {
      "title": "Good value",
      "text": "Slow shipping but when it came I was fairly impressed with it. Fabric isn't the highest denier count but I didn't pay for 1000 denier. I would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "TRAVIS SMITH",
      "helpful_votes": 2,
      "publication_date": 20140205
    },
    {
      "title": "Cross Country Skiing",
      "text": "When a product does what it is suppose to do. Then i'm happy buying it. Nothing more is needed to say on this great product.",
      "rating": 4.0,
      "verified": true,
      "author": "John Gustafson",
      "helpful_votes": 0,
      "publication_date": 20140401
    },
    {
      "title": "Not a double ski bag",
      "text": "This was advertised as a double ski bag but it didn't even fit one pair of average-sized skis.",
      "rating": 1.0,
      "verified": true,
      "author": "Patricia ",
      "helpful_votes": 0,
      "publication_date": 20160229
    },
    {
      "title": "could use straps inside bag to help separate skis",
      "text": "It's a good bag. The only thing inside it to separate 2 pairs of skis is a little pad in the center. Other than that, it makes carting your skis around a lot easier.",
      "rating": 4.0,
      "verified": true,
      "author": "Gregory P. Stewart",
      "helpful_votes": 5,
      "publication_date": 20110214
    },
    {
      "title": "Decent bag",
      "text": "Good bag and certainly long enough for my skate skis. The materials is thin woven nylon, so if you're looking for something durable to go on an airplane, you might consider another option because there is absolutely no padding in this.. But just to transport/store yourself, this is perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Brittany B.",
      "helpful_votes": 0,
      "publication_date": 20160626
    },
    {
      "title": "Five Stars",
      "text": "Reasonably priced and perfect for fitting 2 pairs of nordic skis with poles.",
      "rating": 5.0,
      "verified": true,
      "author": "Pete M",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Smaller than that thought it would be,",
      "text": "Smaller than that thought it would be, but does the job",
      "rating": 3.0,
      "verified": true,
      "author": "Tiina O.",
      "helpful_votes": 0,
      "publication_date": 20150228
    },
    {
      "title": "NICE!",
      "text": "Excellent product for the price - used it last winter and kept my poles and skis manageable",
      "rating": 5.0,
      "verified": true,
      "author": "John S.",
      "helpful_votes": 0,
      "publication_date": 20160424
    },
    {
      "title": "Functional",
      "text": "A good product for getting durable items through the airport but watch out since it offers little protection. You'll want to add foam padding or a hard-case to carry fragile items. I used it to transport anime props and it pairs well with a standard long-rifle hardened gun case since there's enough give in the fabric to fit such things.",
      "rating": 3.0,
      "verified": true,
      "author": "ARN",
      "helpful_votes": 0,
      "publication_date": 20130727
    },
    {
      "title": "Great Bag/Price",
      "text": "The design and quality of material of the bag exceeded our expectations. This is a great bag for a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "SR",
      "helpful_votes": 0,
      "publication_date": 20140207
    },
    {
      "title": "Fits only one set!",
      "text": "2 stars at best. I don't mind the thin material and the fact that the bag is shorter than some skis but not being able to fit two skis is a deal breaker. Will send back..",
      "rating": 2.0,
      "verified": true,
      "author": "Kaitirawi",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "Love it!",
      "text": "Love it. Fits two pairs of skis in easily. Very happy and have had it for a couple of years. That's the true test.",
      "rating": 5.0,
      "verified": true,
      "author": "Liesel",
      "helpful_votes": 0,
      "publication_date": 20140205
    },
    {
      "title": "liked it",
      "text": "Reasonable price. Does the job. Boot bag would be nice.Like the buckle straps to prevent shifting and potential damage to skiis",
      "rating": 4.0,
      "verified": true,
      "author": "gg",
      "helpful_votes": 0,
      "publication_date": 20130701
    }
  ],
  "product_meta": {
    "title": "High Sierra Double Nordic Ski Travel Bag with Water Resistant Coating and Quick Release Compression Straps - Holds Two Pairs of Skis of up to 210 cm",
    "rating": 3.9,
    "feature_bullets": [
      "polyester",
      "Imported",
      "CONVENIENT - Main compartment with U-shaped opening holds a single pair of Nordic skis",
      "PROTECTIVE - Center of bag is padded to protect bindings",
      "ADJUSTABLE - Quick-release adjustable compression straps on each end.",
      "MULTI-FUNCTIONAL - Long webbing handles can be used as a shoulder strap.",
      "COMFORTABLE - Extra large handle is padded for comfort."
    ],
    "categories": [
      "Winter Sports",
      "Ski Bags",
      "Skiing",
      "Outdoor Recreation",
      "Sports & Outdoors"
    ],
    "price": 39.99,
    "specifications": {}
  }
}