{
  "website_summaries": [
    {
      "verdict": "A leader when it comes to both price and reliability. Made by a brand that's been a top-seller in batteries for generations.",
      "pros": [
        "Affordable price",
        "Batteries hold a charge for a decent period of time and work well for toys and devices that tend to drain batteries fairly quickly"
      ],
      "cons": [
        "Some users gripe that the batteries are slightly larger than their standard counterparts"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Best batteries ever",
      "text": "I've always had amazing luck with these. Sad stores around me don't sell them because they know it takes away constant business. These replace a set I've had for years...",
      "rating": 5.0,
      "verified": true,
      "author": "M. James",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "You could probably find them cheaper...",
      "text": "Right after I bought these the price went up and I wouldn’t paid what they were asking for them now I actually went and bought another brand bc they were cheaper. They work but are kinda pricey for just a two pack.",
      "rating": 5.0,
      "verified": true,
      "author": "kbonomo",
      "helpful_votes": 2,
      "publication_date": 20180111
    },
    {
      "title": "GREAT PRICE ON A GREAT BATTERY",
      "text": "THESE BATTERIES ARE RECHARGABLE AND HOLD THEIR ENERGY VERY WELL. THIS IS A REALLY QUALITY PRODUCT AT A VERY CHEAP PRICE FOR RECHARGABLE BATTERIES. SURE BEATS SENDING YOUR BATTERIES TO A LANDFILL WHERE ALL OF THE BATTERIES THAT ARE NON RECHARGABLE END UP. I WAS TOLD BY A COUPLE RETAILERS THAT THEY SIMPLY THROW THESE AWAY AND ACCEPT RECHARGABLE BATTERIES ONLY AT THEIR STORE. TRUE STORY !",
      "rating": 5.0,
      "verified": true,
      "author": "JOE DOE",
      "helpful_votes": 4,
      "publication_date": 20140305
    },
    {
      "title": "OK for low drain products.",
      "text": "OK for C batteries, but the Tenergy variety are way better. I know low discharge batteries have gotten better with time, but 3000mAh is too low for today's needs. Spend a little more, and you won't regret it.",
      "rating": 2.0,
      "verified": true,
      "author": "SonnyK",
      "helpful_votes": 0,
      "publication_date": 20161127
    },
    {
      "title": "really good",
      "text": "I have begun using rechargeables because I like the new battery powered candles, but don't want to be buying and discarding regular batteries as often as is necessary for the candles. The rechargeable are great. I keep extras on hand so when the discharged batteries are being charged, I have another set to keep the candles burning.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Houghton",
      "helpful_votes": 2,
      "publication_date": 20121127
    },
    {
      "title": "Good batteries",
      "text": "These actually last well in my kids emergency vehicle toys despite constant use. They charge quickly and seem to do just as well the next time.",
      "rating": 5.0,
      "verified": true,
      "author": "El Presidente",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "The name Rayovac speaks for itself. Very satisfied.",
      "text": "Holds charges a long time. I use the BC1HU charger I got here on Amazon that hold all size batteries. I use these in my smoke detectors and I've got 15ft ceilings. Don't want to be changing out batteries all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "ShoeHoundTop Contributor: Coloring",
      "helpful_votes": 0,
      "publication_date": 20131117
    },
    {
      "title": "Plenty of juice.",
      "text": "I've been using these in my Streamlight spotlight for over a year, and they still hold a charge for hours. It seems like I rarely ever have to recharge them. I ended up buying other sizes and have had the same results. They're great for kids' toys.",
      "rating": 5.0,
      "verified": true,
      "author": "Hoosier in TX",
      "helpful_votes": 0,
      "publication_date": 20130310
    },
    {
      "title": "I am currently researching whether more expensive rechargeable batteries will do better.",
      "text": "Did not meet my expectations; charge lasted a little over half the life of a same-company disposable battery. I am currently researching whether more expensive rechargeable batteries will do better.",
      "rating": 2.0,
      "verified": true,
      "author": "Bradley L. Underwood",
      "helpful_votes": 2,
      "publication_date": 20180201
    },
    {
      "title": "Saves us tons of money",
      "text": "We were going through batteries galore when I decided to get this for my son's crib soother. Have to replace every two weeks with the other set we have on charge but never run out of batteries again!",
      "rating": 5.0,
      "verified": true,
      "author": "pesavento",
      "helpful_votes": 0,
      "publication_date": 20130720
    },
    {
      "title": "Rayovac Platinum Low Self Discharge NiMH C Size Batteries, 2 Pack",
      "text": "These work but have relatively low maH so will need frequent recharging in high drain devices. Will have to see if they last any longer than other Nimh batteries.",
      "rating": 3.0,
      "verified": true,
      "author": "Oliver B. Cannady",
      "helpful_votes": 3,
      "publication_date": 20130106
    },
    {
      "title": "My 1st set of C size NiMH batteries.",
      "text": "I bought four batteries to replace the nicads in my Fluke 97 Scope meter. Only time will tell if these batteries are any good or not. I just couldn't see paying an extra $15 for a piece of heat shrink tubing and a short wire for essentially the same thing as a NiMH replacement battery pack. So far they seem to charge and work just like they should. They were almost fully charged when I got them. Maybe I'll update my review in 6mo when I've got more use out of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Stan",
      "helpful_votes": 0,
      "publication_date": 20120212
    },
    {
      "title": "Five Stars",
      "text": "batteries hold charge for good length of time. Charge quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "bennielou",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Great work",
      "text": "I use the Rayovac platium in my wireless speakers and it does the job great. Last longer that the energizer, in use and in rest, charge great with my energizer family charger also.",
      "rating": 5.0,
      "verified": true,
      "author": "Julio",
      "helpful_votes": 2,
      "publication_date": 20110912
    },
    {
      "title": "Good quality",
      "text": "Good quality battery that has lasted for a few weeks in a baby swing and a vibrating bouncy seat. Heavier than the rechargable Energizer D batteries I bought at the same time. I'll be switching my Energizers out for Rayovac.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "very disappointed in these batteries",
      "text": "very disappointed in these batteries! Bought them for my cat's toy-The Cat Meow-only worked for a short time and when recharged lasted for even a shorter time. Cat disappointed too!",
      "rating": 2.0,
      "verified": true,
      "author": "Barbara T,",
      "helpful_votes": 0,
      "publication_date": 20141208
    },
    {
      "title": "Rechargeable batteries are great",
      "text": "It seems expensive at first to buy rechargeable batteries. They do charge quickly and last a long time, less expensive over time",
      "rating": 4.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 0,
      "publication_date": 20140115
    },
    {
      "title": "Rayovac platinum C size batteries",
      "text": "Happy with my purchase it arrived on time and it works fine so far, I'm very pleased with the performance.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Miceli",
      "helpful_votes": 0,
      "publication_date": 20130211
    },
    {
      "title": "then the batteries are performing expectedly and aren't a disappointment.",
      "text": "I bought these because a third-party review ranked these on top. Based on another purchaser's Amazon review, I decided to make sure the batteries were charged. They needed an hour or so on the charger to top off the juice. I going to use them in a gate opener keypad, so we'll see about the other claims with respect to longevity. If you don't hear back from me, then the batteries are performing expectedly and aren't a disappointment.",
      "rating": 4.0,
      "verified": true,
      "author": "ninjaneer",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Very short charge",
      "text": "These are really disappointing. They have a short charge and need very frequent re-charging after little use. I won't be buying this brand again.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Monestere",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "awesome",
      "text": "great for kids toys!!!! I am so glad I don't have to keep buying pack after pack after pack of batteries for my kids toys. They charge easy. Just put them in every once in a while at night and then pop them back in the toys in the morning and no more melt downs!",
      "rating": 5.0,
      "verified": true,
      "author": "Kayleigh",
      "helpful_votes": 0,
      "publication_date": 20140218
    },
    {
      "title": "Five Stars",
      "text": "Wonderful! Met all my expectations. They charge quickly and work very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Simpson",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "good batteries",
      "text": "Charged them up once and haven't had to charge them since. I put them in my aircraft marshalling wands which are LED so they don't use much juice, and they are still bright as the first time I tried them almost a month later",
      "rating": 5.0,
      "verified": true,
      "author": "JDogBlingBling",
      "helpful_votes": 0,
      "publication_date": 20120828
    },
    {
      "title": "Best Batteries",
      "text": "I live in S Florida where batteries easily corrode due to moisture. I have learned over the years that the RAYOVAC rechargeable batteries do not corrode as easily as regular batteries or other brands of rechargeable batteries. So now, I don't even consider buying any other batteries except the Rayovac rechargeable ones. IMPORTANT: This product was formerly named \"Hybrid\" and thus, I recommend getting the Platinum because it is a newer battery.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Tischa Weathers",
      "helpful_votes": 3,
      "publication_date": 20111216
    },
    {
      "title": "Amazon always has a good price on batteries",
      "text": "These batteries work well and hold a charge. There's not a lot to say about batteries--except if they don't work. Would buy them again. Good price. A great item to add to meet the free shipping criteria.",
      "rating": 5.0,
      "verified": true,
      "author": "maxandsam",
      "helpful_votes": 0,
      "publication_date": 20121202
    },
    {
      "title": "Rechargeable Bs",
      "text": "Saved a ton of money and since most electronics require batteries now this is the cheapest way out and never have to worry about needing batter5ies.",
      "rating": 5.0,
      "verified": true,
      "author": "anon",
      "helpful_votes": 0,
      "publication_date": 20131130
    },
    {
      "title": "What I was looking for",
      "text": "These re-chargable batteries were the best price I could find, and did the job. Arrived on time and have been working fine since.",
      "rating": 5.0,
      "verified": true,
      "author": "AllisonM",
      "helpful_votes": 0,
      "publication_date": 20121014
    },
    {
      "title": "Four Stars",
      "text": "Pricey but needed rayovac for my game camera, we will see how long they hold a charge",
      "rating": 4.0,
      "verified": true,
      "author": "Cyndee Baldwin",
      "helpful_votes": 0,
      "publication_date": 20161012
    },
    {
      "title": "Less lossage when stored after charging.",
      "text": "They do seem to hold a charge (during inactivity) longer than most other recharageables I've used, and not noticeable defects.",
      "rating": 5.0,
      "verified": true,
      "author": "jonl",
      "helpful_votes": 0,
      "publication_date": 20130205
    },
    {
      "title": "Five Stars",
      "text": "Love it! I use it all the time. Prompt shipping. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Liz Ross",
      "helpful_votes": 0,
      "publication_date": 20141124
    },
    {
      "title": "Great rechargeable batteries",
      "text": "Never had any trouble with these. Even though C type batteries are not that common nowadays, they do come in handy from time to time, Would recomend to anybody who wants a good lasting battery for unusual occasions. And it holds its charge very well when not in use.",
      "rating": 5.0,
      "verified": true,
      "author": "Lucas Aimar",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Great batteries",
      "text": "These are great batteries at a great price, we've been using them for a few weeks now and are yet to charge them.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlene",
      "helpful_votes": 0,
      "publication_date": 20130414
    },
    {
      "title": "Rayovac self-charge",
      "text": "Charges faster and batteries last longer. Good product. We use these for our outside lights. They do a good job.",
      "rating": 5.0,
      "verified": true,
      "author": "Judi L. Bowland",
      "helpful_votes": 0,
      "publication_date": 20130307
    },
    {
      "title": "So far so good. no complaints",
      "text": "So far so good. no complaints. I'm using them with a boombox and they work just fine. I have two sets that I alternate between while one set is being recharged.",
      "rating": 4.0,
      "verified": false,
      "author": "Ostrich",
      "helpful_votes": 2,
      "publication_date": 20110827
    }
  ],
  "product_meta": {
    "title": "Rayovac Rechargeable C Batteries, High Capacity Rechargeable Plus C Battery (2 Count)",
    "description": "Less waste, and even more power. RAYOVAC Rechargeable Plus Batteries last up to four times as long as alkaline batteries, and twice as long as standard RAYOVAC rechargeable batteries. Use these powerful batteries time and time again to keep disposable batteries out of landfills and more money in your pocket. Recommended for high drain devices. RAYOVAC Recharge Plus batteries come pre-charged and ready to use. Lasts longer on one charge than RAYOVAC Recharge Batteries.\n\nAMAZON.COM\n\n\n\n\n\n\n\nRayovac Platinum nickel metal hydride (NiMH) rechargeable batteries are the most economical battery solution for high-drain devices like digital cameras, portable video games, kids toys and wireless gaming accessories.\n\nTHE LATEST RECHARGEABLE TECHNOLOGY\n\n\nView larger.\n\nLow Self Discharge: These NiMH batteries have improved charge retention. With Low Self Discharge, the batteries are able to retain 70% to 80% of their full charge at 6 months and 50% to 60% at 12 months. Low Self Discharge batteries are ready when you are! If you have fully charged the batteries but left them in a device, such as a digital camera, or are storing them in a drawer, they will still have 70% to 80% of their full charge after 6 months! Non Low Self Discharge batteries, also called \"Standard\" NiMH batteries, can only hold 20% of their full charge capacity after 12 months.\n\nPre-Charged: Rayovac Platinum Rechargeable batteries come pre-charged and ready to use right out of the package. No need to charge them first!\n\nCycle Life: Rayovac Platinum Rechargeable batteries can be re-charged and re-used over 300 times. This helps both your pocket book and the environment, saving you $100's vs. disposable alkaline or lithium batteries while reducing waste!\n\nHigh Performance: Rayovac Platinum Rechargeable Batteries give you superior performance in high-drain devices with high mAh capacity ratings and impressive results in digital cameras:\n\nNo \"Memory Effect\": Unlike Nickel Cadmium (NiCad) rechargeable batteries, Rayovac Platinum NiMH rechargeable batteries do not gradually lose their maximum energy capacity if they are repeatedly recharged after being only partially discharged. Rayovac Platinum NiMH rechargeable batteries can be recharged at any state of discharge without harming the performance of the battery.\n\n\n\n\n\nRAYOVAC NIMH RECHARGEABLE BATTERIES MAKE AN ENVIRONMENTALLY SMART CHOICE.\nREDUCE WASTE\nThey can be charged and reused up to 500 times, producing far less waste than disposable alkaline or lithium.\n\nNO TOXIC CHEMICALS\nThey do not contain the toxic chemicals that are found in older Nickel Cadmium (NiCd) Rechargeables.\n\nRECYCLABLE\nRayovac has partnered with Call2Recycle, giving consumers the ability to recycle NiMH batteries for FREE. There are 30,000 drop-off sites available at municipalities and retailers. Drop-off site locations can be found by calling 1-800-8-BATTERY or visiting http://www.call2recycle.org.\n\n\n\n\n\nRayovac Platinum NiMH Rechargeable Batteries are available in AA, AAA, C, D and 9V sizes.\n\nTwo chargers are also available, a 5 hour charger for AA and AAA and an overnight charger for AA,AAA, C, D and 9V battery sizes.\n\n PACKAGING\nRayovac Platinum offers a 100% paper package (made with 80% recycled content) on its rechargeable batteries.",
    "rating": 4.2,
    "feature_bullets": [
      "Lasts up to 4x Longer than Alkaline Batteries - Keep your devices powered up to 4 times longer vs RAYOVAC High Energy Batteries",
      "Batteries Come Charged & Ready To Use – RAYOVAC Rechargeable Batteries are ready to use right out of the pack. For optimal performance, RAYOVAC recommends charging batteries prior to using",
      "Recharge up to 500 times",
      "Works in ALL CHARGERS",
      "5 Year Power Warranty – Covers batteries for 5 Years while in storage"
    ],
    "specifications": {
      "Product Dimensions": "1.11 x 3.75 x 4.5 inches",
      "Item Weight": "4 ounces",
      "Manufacturer": "Rayovac",
      "ASIN": "B003D7LHJ0",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "PL714-2 GENE",
      "Batteries": "1 C batteries required.",
      "Customer Reviews": "4.2 out of 5 stars67 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#170,631 in Health & Household",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 19, 2010"
    },
    "categories": [
      "Household Supplies",
      "9V",
      "Electronics",
      "Health & Household",
      "Household Batteries"
    ],
    "price": 9.99
  }
}