{
  "website_summaries": [
    {
      "verdict": "Easy to use powder that works on both carpets and upholstered furniture.",
      "pros": [
        "Gives you almost 1,000-square-feet of coverage area per bottle at a reasonable price point",
        "Manufactured in the United States and follows all safety considerations for use around animals and humans",
        "Should effectively kill adults and larvae within several days"
      ],
      "cons": [
        "Not as effective against heavy infestations of adult fleas and larvae"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Add fragrance to the ingredients label FFS!",
      "text": "Upon opening I smelled a hideous old lady cheap perfume scent that is not advertised on any part of the label with the 1% \"inert\" ingredients. My sensitivity to chemical perfumes doesn't match their \"inert\" description. Returning this promptly for a different flea killing powder. Sigh. Why would this not be marked on the label or store description??",
      "rating": 1.0,
      "verified": true,
      "author": "Kendra Schirmer",
      "helpful_votes": 9,
      "publication_date": 20190708
    },
    {
      "title": "Worked Fabulously",
      "text": "Once Your animal is treated for fleas first and then you treat your home with this product you’ll never see fleas again for a very long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 5,
      "publication_date": 20190310
    },
    {
      "title": "Simple, safe and effective way to kill fleas and their larvae.",
      "text": "Probably the safest and easiest way to get rid of fleas. Just sprinkle it thoroughly around the room with the fleas and brush them in using a broom. Leave the power for about a week and repeat as necessary. I've had great success with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Del Ritchie",
      "helpful_votes": 6,
      "publication_date": 20171108
    },
    {
      "title": "Phillips Feed and Supply Was Good, the Product was Not!",
      "text": "The company that shipped this did so quickly and the packaging was great. The product however just didn't work and I ended up solving our problem with Arm and Hammer Carpet/Pet Fresh (baking soda with pretty smell)...Serves the same purpose (dried the little BUGgers out) but is much cheaper. Personal note, flea check the new pets you adopt from rescue places before you bring them in your door......the kitten was great the surprise guests that came with him and infested our house were not.",
      "rating": 2.0,
      "verified": true,
      "author": "Ohm",
      "helpful_votes": 23,
      "publication_date": 20140213
    },
    {
      "title": "Worked when other methods has failed!",
      "text": "The instructions were easy to follow, and it didn't affect any material we spread it on. We have 3 cats and a dog and they were exposed to it and zero reactions to it. It also worked! We had tried the spray/fogger ones and still had problems til we used this. I would definitely get it again.",
      "rating": 5.0,
      "verified": true,
      "author": "rathaviper",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Large enough for my whole house",
      "text": "Before I found this, I was spending a lot purchasing several small containers that weren’t enough to do more than one carpeted room per container. This one took care of my entire two-story house of which the entire upper level is carpeted",
      "rating": 5.0,
      "verified": true,
      "author": "awilli",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Still have fleas",
      "text": "Ordered this and it was delayed so they had to send a replacement. When I did get it I applied it right away,to the carpets and upholstery, blocked off the room and waited several days before running the vaccum. A week after running the vaccum, I still have fleas, the product did not work.",
      "rating": 1.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 3,
      "publication_date": 20161028
    },
    {
      "title": "Easy and safe",
      "text": "Our cat has brought home several infestations this year. This product came highly recommended by my sister and it helped us eliminate the fleas ands far has prevented them from coming back",
      "rating": 5.0,
      "verified": true,
      "author": "John Hoadley",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Does the job",
      "text": "Does the job...its best to let it sit for 2 days before vacuuming up...keep children and pets away until it's vaccumed up...but it did do the job...",
      "rating": 4.0,
      "verified": true,
      "author": "adyR",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Great product",
      "text": "It does work...but as the instructions say it does take up to 30 days to work",
      "rating": 5.0,
      "verified": true,
      "author": "michelle baker",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "This product works great!",
      "text": "Really gets rid of fleas! Work the entire container into your carpet and leave it on. Fleas cannot live in this environment. I was amazed.",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine Georges",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Not safe for cats!!!",
      "text": "I ended up not using it because it says not safe for animals, and I have indoor cats.",
      "rating": 1.0,
      "verified": true,
      "author": "Brittany Martinez",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "It was super easy to use and clean",
      "text": "I had flees when I moved into a new apartment and used this once and they were gone! It was super easy to use and clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessyka Young",
      "helpful_votes": 0,
      "publication_date": 20160815
    },
    {
      "title": "Didn’t work",
      "text": "This stuff didn’t work for me at all and I had really high hopes.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "FLEA PROTECTION",
      "text": "THIS IS A VERY GOOD PRODUCT. IT REALLY WORKS AND NOT A BAD SMELL TO IT AT ALL. GOOD TIMELY DELIVERY AND WILL USE THIS PRODUCT AGAIN.",
      "rating": 5.0,
      "verified": true,
      "author": "420",
      "helpful_votes": 2,
      "publication_date": 20131214
    },
    {
      "title": "Works!",
      "text": "After I used this on my carpets and within the crevices of upholstered items, fleas were gone. Thank goodness",
      "rating": 5.0,
      "verified": true,
      "author": "Stino",
      "helpful_votes": 0,
      "publication_date": 20161121
    },
    {
      "title": "Great stuff",
      "text": "I put on carpet then sweep up,I also put under and between chair and couch cushions,works great,on anything I also put at bottom of base boards along wall",
      "rating": 5.0,
      "verified": true,
      "author": "tony",
      "helpful_votes": 4,
      "publication_date": 20140322
    },
    {
      "title": "A useful that served the purpose I bought it for",
      "text": "A useful that served the purpose I bought it for. Rather expensive considering that it is 99% borax, which can be bought for about $2.00 in the laundry section of the grocery store under the name 40-Mule Team Borax.",
      "rating": 4.0,
      "verified": true,
      "author": "Ktina",
      "helpful_votes": 8,
      "publication_date": 20141205
    },
    {
      "title": "but these dust like particles work big time",
      "text": "you'd think borax crystals would work out of the grocery store shelf. nope, too big, but these dust like particles work big time. and they work for a good length of time as well. so forget those truly expensive carpet crystals, because they last only a couple of weeks, and get these not so expensive crystals.",
      "rating": 5.0,
      "verified": true,
      "author": "Hon Lee",
      "helpful_votes": 0,
      "publication_date": 20150902
    },
    {
      "title": "It does work!",
      "text": "We used this product in conjunction with a flea shampoo to get rid of a mild case of fleas. It did take about 2 weeks for the product to work, but we have not seen any fleas since (on the pets or on us). It was easy to apply the product to the carpet, and we were able to dust 2 rooms and an area rug with the contents of one bottle. We would defiantly use this product again.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret",
      "helpful_votes": 0,
      "publication_date": 20160916
    },
    {
      "title": "This One Works!",
      "text": "I had been at war with the flea situation in my house. I sprayed, bombed, Frontlined everything over and over again. Then, my local pet store recommended this. It actually slices up fleas on contact. My bites have decreased at least 90% and I just started using it this week. Save your money on all the other household flea products. This one works.",
      "rating": 5.0,
      "verified": false,
      "author": "C. Peterson",
      "helpful_votes": 8,
      "publication_date": 20140828
    }
  ],
  "product_meta": {
    "title": "NaturVet – No Flea Carpet Crystals – 2 lb – Dry Crystal Powder Repels & Kills Fleas – Apply to Carpet, Upholstered Furniture & Other Household Surfaces – Not for Direct Use on Pets",
    "rating": 4,
    "feature_bullets": [
      "No Flea Carpet Crystals is a dry crystal powder that works to kill fleas.",
      "Crystals works when applied on carpet and under cushions of upholstered furniture.",
      "Flea repellant, crystals are easy to vacuum up. Do not apply to pets!",
      "Jar should last the average home approximately 1 year and cover approximately 1,000 sq ft.",
      "cGMP Compliant, Manufactured in the USA"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Item model number": "978084",
      "Department": "Flea & Tick",
      "Date First Available": "March 29, 2010",
      "Manufacturer": "Garmon Corp. / NaturVet",
      "ASIN": "B003FVWCFM",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Flea & Tick Center",
      "Pet Supplies",
      "Household Powders"
    ],
    "price": ""
  }
}