{
  "website_summaries": [
    {
      "verdict": "An impressively sturdy and entertaining cat tree at a budget price. The best deal for the least amount of money.",
      "pros": [
        "Easy to clean",
        "Durable faux fleece covering",
        "Very affordable price"
      ],
      "cons": [
        "Some consider shelving material to be on the \"flimsy\" side"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Choose a company with better customer service and includes all the parts.",
      "text": "This was relatively easy to assemble, but came without 2 of the necessary larger bolts to affix the top 2 tiers. I tried to find something to substitute for these at Home Depot, but was told there was nothing that matched them. I notified the company that I still needed two of the larger bolts and could not complete the tower, but they NEVER bothered to respond. There are better products with better customer service.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda B",
      "helpful_votes": 9,
      "publication_date": 20170407
    },
    {
      "title": "Get what you pay for....",
      "text": "Box intact, main house on unit cracked upon opening it. Have purchased this companies products before with complete satisfaction. However, this unit is lower cost, made in China, made out of particle board, the carpet quality is poor, etc. There are exposed staples at the bases of all scratch posts, holding the sisal rope in place. A cat could hurt himself if a claw caught inside the staple while scratching. Very disappointed in this product, will have to return it, and do not want a replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "krobie",
      "helpful_votes": 4,
      "publication_date": 20161128
    },
    {
      "title": "Loved it for 2 months, then the fabric on ramp started getting holes in it...",
      "text": "Our 2 cats are OLD (14 and 16). They don't do much. :) So when 2 holes appeared in the fabric on the ramp, we were not happy. They hardly use the ramp. They scratch on the poles, and the jump up to the middle section with the little \"house\". We are seriously disappointed. I REALLY did not want to have to buy a new cat tree for 2 senior cats in less than 3 months. I expect more from Amazon (and usually get it).",
      "rating": 1.0,
      "verified": true,
      "author": "EAG, DC",
      "helpful_votes": 4,
      "publication_date": 20180811
    },
    {
      "title": "Cheddar Bob Loves His New Lounge Tree!",
      "text": "This is a great purchase and great value for the price. I have a large orange tabby. Cheddar Bob is 18lbs and I was concerned if this would be suitable for his size, and I’m happy to say that he loves it! It was so simple to put together and it solid quality. I’m very pleased with it and Cheddar Bob loves it too!",
      "rating": 5.0,
      "verified": true,
      "author": "jennifer sapero",
      "helpful_votes": 4,
      "publication_date": 20180518
    },
    {
      "title": "Torn apart after a year",
      "text": "I saw that people in the reviews still have a beautiful tree after a year. I must be the unlucky one. Mine is all ripped apart, and the sisal has come loose on one of the scratching posts. My cat is a skinny little thing and not very strong. So my tree at least isnt very sturdy. Reached out to the company and they suggested i buy another scratching post to replace the ripped up one. Except i paid $40 for this tree, and dont think i can convince myself to pay around $20 just to replace one part of the tree. That just shows how money hungry they are. They used to replace parts for free.",
      "rating": 1.0,
      "verified": true,
      "author": "T.B.",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "My BIG cat LOVES this cat tree.",
      "text": "My cat weighs 20 lbs. He really enjoys this cat tree. He even plays with the hanging toys. He likes to lay in the covered area. He takes up the whole thing but he fits. It is sturdy. He climbs all over it and i am not joking when i say he is a huge cat. I was leary but the other reviews helped a lot. I only have the one cat but he is spoiled rotten and he loves this cat tree!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 4,
      "publication_date": 20171211
    },
    {
      "title": "Our kitties love this tree!",
      "text": "Our 7-month-old and 2-year-old kitties love this cat tree to scratch and lounge, and we love it because it is sturdy. We have bird feeders outside and have bought two of these for placement in front of windows for \"cat TV\" both upstairs (tree view) and downstairs (birdfeeder and birdbath view). They both use it differently. Right now the little guy is sleeping on the top perch upstairs, after climbing and scratching on it. It is certainly a better value and seems more sturdy than cat trees we previewed at the big box pet stores. Assembly was quick (maybe 20 minutes because the cats kept investigating). Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "coolbeans",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Really nice cat tree. Broken on delivery.",
      "text": "This company makes the best cat trees- I foster and I’ve tried more than a usual number of brands and these hold up the best. Be aware: the item is heavy and packed in a box with no “cushion” around the product. My box arrived clearly squished, with holes ripped out of two of the four corners, and the the top shelf of the tree is cracked in half. I’m not able to bring this item to return location so I’ll probably eat the costs and make do without the top shelf. Not ideal.",
      "rating": 3.0,
      "verified": true,
      "author": "K M",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Great Tree House ***",
      "text": "I was hesitant prior on making this purchase because my Chinchilla Persian cat is very picky when it comes to toys, trees, people and even food. However, as soon as I received the product and opened the box she was very excited. She couldn't wait for me to put it together and in fact was playing with the parts even before I assembled her new tree. I placed it between the sofa and balcony window where she can look outside and even watch TV. She loves it...!!! It's tall enough where she can view everything and if she wants privacy she can hide as well (see photos). So far this product has been great for our cat.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 2,
      "publication_date": 20170626
    },
    {
      "title": "Acceptable for larger cats",
      "text": "I have a very large Siamese cat (11 lbs) so I was a little worried that the platforms would be too small for him. As you can see from the photos, he does not seem to think this is an issue. He spends most of his time when we are not home hanging out there. It’s also very sturdy. He comes barreling at it from 30 feet down the hall and vaults directly to the highest twine pole and it doesn’t fall over (though I often find it’s moved an inch or two). My kitty gives it a 10/10. Oh - and the little puffballs that hang down were promptly ripped off. Not a big deal for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Cat Castle",
      "text": "I love it because it was easy to put together and looks great. It is slightly tippy for my two cats but I don't think it can fall over, and I put it in a corner. The little ramp is totally useless, however, and neither of them will step on it but one of them delights in using it as a scratching post. She also likes to hide under the ramp. I suppose she thinks we can't see her. The little house hasn't intrigued either one yet, but they like running through it. One star withheld because of the tippiness. A bigger base would have taken care of it. Easy fix.",
      "rating": 4.0,
      "verified": true,
      "author": "CK",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Good for small cats.",
      "text": "Pros: 1. Easy to put together. 2. Feels well made Cons: 1. The platforms are a lot smaller then they seem in the picture. If you have small cats(<10lbs/4.5kg) it will probably be plenty but mine are medium-large at 11-15lbs and while they could sit on the platforms I don't see them having enough room to really lounge in the way cats love to lounge. I will probably make my own platforms and attach them to the top.",
      "rating": 3.0,
      "verified": true,
      "author": "sean",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "Good quality little cat tree",
      "text": "It’s a little smaller than I pictured even though I read through all the measurements before ordering. Adult cats still fit on it but not roomy enough to be super comfy. Easy to put together and was packaged well. Good price for the quality and all our other cat trees of this brand have lasted for many many years. If you have a large cat maybe look for something with bigger dimensions on the cat house and the cat perches!",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon Scouten",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Awesome cat tree",
      "text": "Having had this, now, for several months, I want to say that my cat LOVES it -- it's well made, looks great (our walls are light-light yellow and this tree is ivory so it looks nice next to the wall). Kitty sits on the highest level most often, but inside the little \"house\" and on the other levels as well. In winter, when the house is a bit cold, she tends to cozy up on it; the fleec-y covering is great. No more of those brown-carpet cat trees for us! And, the price was right. (Assembly was easy.)",
      "rating": 5.0,
      "verified": true,
      "author": "Karen ",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Defective ramp",
      "text": "This product was defective the ramp does not work it was cracked I would like a replacement part and a refund or You to ship me a new one at no charge I do not want to have to return the defective one can you submit can you take a photo of house defective",
      "rating": 1.0,
      "verified": true,
      "author": "Melanie F. Stricker",
      "helpful_votes": 2,
      "publication_date": 20180609
    },
    {
      "title": "well done",
      "text": "the cat tree arrived today---it was easy to assemble--. i thought it would be a good buy--given the reviews, but it really is very sturdy and very well put together. i have a small covered balcony and i think that i could put it outside as long as it isn't hit by direct rainfall. i put it beside my bed so she's near me. she can climb up to a platform and watch over me as i sleep. izzy watched the assembly and has checked it out...this is worth every single penny...very happy about it. thanks ARMARKAT for you thought design.",
      "rating": 5.0,
      "verified": true,
      "author": "macky",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Meow-nificent!",
      "text": "Great product! My cat is part Bengal part pain in the butt. He loves to climb on anything and everything - especially things he's not suppose to climb on! So I gave in and spent the money. Boy, am I glad I did. Reddington loves it! It was very easy to assemble and even comes with an extra string toy! It's a great combination for the cat who loves to climb, hide, pounce and scratch. It's got everything I was looking for to keep him entertained. Great product. Great price. I highly recommend this to anyone a bit price conscious like myself. You get a lot for your money, and your furry friend is sure to love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Katelyn",
      "helpful_votes": 5,
      "publication_date": 20160417
    },
    {
      "title": "It works well for us, we may get a second one!",
      "text": "I have two cats with very different personalities. I have bought cat trees before and either one will use it and the other ignores it. In other cases, neither one will use it. I took a chance on this model because it is open. They both loved it and use it everyday. They use the scratching post and unlike the ones I've bought before, they didn't destroy the posts in one week. They climb to the top and chase each other around it. I couldn't be happier, they don't even attempt to claw my furniture anymore. I may get a second one to have one downstairs and one upstairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Rocky Castillo",
      "helpful_votes": 2,
      "publication_date": 20170117
    },
    {
      "title": "Armarkat has the best cat trees!",
      "text": "I bought my first Armarkat Cat Tree 9 years ago. I still have it and my cats still love it. I have five cats now so I wanted more cat trees for them. I naturally went with Armakat. My cats love this cat tree as much as the older one! I've purchased two more Armakat Cat Tree too! My cats love them all!!! If I could give Armakat 100 stars, I would!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Mann",
      "helpful_votes": 2,
      "publication_date": 20170330
    },
    {
      "title": "Solid! Very sturdy",
      "text": "I’ve had several cat trees, but this one is by far the most sturdy I’ve had. It’s solid! And I mean it because I have a chunky almost 18 lbs 4 y/o cat and it holds him just fine. He loves it! The fact that the top is square and not round like most, makes him stay on the top for longer, even taking naps, his paws stick out but again, he’s big. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "christy",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Solid, good quality carpet, very nice cat tree!",
      "text": "Researched cat trees for days before settling on the Armakat brand. You might be able to find a larger, fancier cat tree for the same price as an Armakat, but I guarantee the construction won't be as good. This thing is solid. I have a very active 2.5 month old Sphynx kitten who loves to climb everything. She adores getting up and down this tree. It was very easy to put together and the carpet is nice and thick. The carpet did shed a little when we first put the tree together, but we ran the vacuum over it and it's all good now. I will update my review in a few months if anything changes!",
      "rating": 5.0,
      "verified": true,
      "author": "L Wardle",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Well built",
      "text": "This tree is actually better built than I expected for the price. I've seen similar trees at the pet store for 2 to 3 times the price. My two boy cats (brothers) love this thing and they put it through its paces. So far, they have not done a bit of damage to it and I put cat nip on it frequently for them. I've been really happy with this tree and so have they!",
      "rating": 5.0,
      "verified": true,
      "author": "Maggi Maggi",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "This tower's sleeping platforms are too small for even a 6 mos old cat",
      "text": "I am very disappointed with this product. Although it was easy to put together and so far the material is holding up pretty well, the size of the sleeping platform is deceiving and is basically already too small for my kitten, who is only 6 mos old. He still tries to sleep on the top tower but he hangs off the sides and has fallen off in his sleep. If we didn't put it up against a wall he wouldn't be able to use it at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Abe",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "She is totally fine but I'm glad I was there to help her ...",
      "text": "I got this for my 5 month old kitten and she loves it EXCEPT...she got her jaw caught in the little loop that's meant to hang the toy from. She was playing with it from above and her bottom teeth and jaw got stuck in it. She is totally fine but I'm glad I was there to help her get unstuck. I would suggest cutting off the loop as soon as you get it. She plays with it all the same even without the dangling toy.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20160912
    },
    {
      "title": "Cats Love This Thing!",
      "text": "Our cats should be writing this review lol They love this thing. Was able to get this fully assembled in 15 minutes. The little round hanging toy (brown) however did not last, one swing of my cats paw split it open. For those wondering if this will support a heavy cat, base on the materials put together, the answer is yes, this is solidly put together.",
      "rating": 5.0,
      "verified": true,
      "author": "DJ Freddy D",
      "helpful_votes": 3,
      "publication_date": 20170502
    },
    {
      "title": "Easy to put together, good quality, and loved by our kitty.",
      "text": "I put the cat tower together, and our kitty was instantly enthralled. The tower wobbles a little because of the uneven floor, not because of poor quality. As long as the parts are screwed together well, it appears to be a solid structure. The instructions and tools that came with it made it easy to build. The dangling ball is a hit with the kitty and makes her do a lot of jumping around, which is a great way for her to channel her energy and practice her acrobatic skills. I am extremely pleased with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Janetzko",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "The Scratching Solution!",
      "text": "Our kitten could not love this tree more! Assembly was very easy. Once it was up, she sniffed around it for a few hours and then ventured onto the top level for a nap. After that, they were inseparable! (see pics!) Up to this point, we'd had some issues with her scratching on the furniture and rugs. The posts have completely taken care of the problem! She scratches on the posts constantly and never touches the furniture anymore! A fantastic, unintended benefit! She also seems to have lost interest in eating our Pacific Parrotlet. She'd rather bat the puff ball (*NOT a euphemism) or lounge in the little condo than munch on the bird.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristian E. Gamble",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "Fantastic cat tree!",
      "text": "We purchased this not long ago and already our kitten \"Frankie\" is in love with it! Besides the fact that Frankie loves it, I should say that it was very easy to assemble and seems to be very well made. We really like the fleece that covers all the surfaces and the sisal rope on the poles didn't take long for our kitten to figure out are perfect for scratching! Both Frankie's dad and I think this is a fab cat tree - especially for the price. All three of us highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Keltie",
      "helpful_votes": 0,
      "publication_date": 20170209
    },
    {
      "title": "Great cat tree!",
      "text": "My cat loves this tree. She scratches on the post and hangs out on it all the time. We actually put her food in the cubby in the middle and she eats in it too. I'm sure your cat will love it and you won't regret buying it. It's pretty sizeable so make sure you have the room to fit it where you want to. It was easy to put together and seems a lot sturdier than the 1st cat tree my cat had for many years. I give it 5 stars and so does my cat!!",
      "rating": 5.0,
      "verified": true,
      "author": "DJ GodsOwn",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "I could not be happier. I have two cats who both use it ...",
      "text": "I could not be happier. I have two cats who both use it all the time. One is 20 lbs. He uses every platform, including laying on the top to look out the window. They do not use the little ramp at all. They just jump up. Fantastic product and plenty stable.",
      "rating": 5.0,
      "verified": true,
      "author": "Cat S",
      "helpful_votes": 2,
      "publication_date": 20170406
    },
    {
      "title": "My cats favorite toy and resting place.",
      "text": "Exactly as described. My 2 year old cat tookntomit immediately. The cat tree cane with 2 fuzzy balls and a note that they weren’t really intended for use but were merely a decoration and should be discarded. I fastened them to the top level with an elastic string and after a year it continues to amuse the cat. Easy to assemble, took maybe 20 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Ernest Bentley",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Sable’ Favorite Spot",
      "text": "My cat loves this tree. Perfect height for her to sit and watch the world go by outside. Easy to put together. Make sure you save the tools because over time the bolts will loosen (well I have a fat cat so maybe that’s part of the problem). Carpet on the tree does get full of hair as happens with every cat perch made. This cat was priced very competitively and I would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanya Ehret",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Great Kitty Tree for a Great Price!",
      "text": "Was looking for a kitty condo that had lots of activity for my new kitten. Kitty loved it and was playing on all the pieces before I could even get it assembled. Easy to assemble and can't beat the price! Prices start at over $100 for condos at the pet store and they do not have all the things that this one includes. My only complaint would be that the 2 perches are a little on the small side but I figured if my kitten outgrows them I could probably have someone cut me a couple larges pieces to replace them.",
      "rating": 4.0,
      "verified": true,
      "author": "$implicity",
      "helpful_votes": 0,
      "publication_date": 20161102
    },
    {
      "title": "Favorite catnap perch!",
      "text": "Easy to put together, sturdy, and Boots loves it! Great value for the cost (was around $60-$70 when I bought it). I've own one other cat tree from this company, and I'm equally satisfied with that purchase. Note: I read other reviews before purchase, and opted not to attach the dangling toy. Great buy regardless.",
      "rating": 5.0,
      "verified": true,
      "author": "DJ",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "After Six Years, Finally Time to Replace It",
      "text": "I bought this cat tree in 2014 and my cats have loved it to death. It's completely shredded and destroyed so time for a replacement. I'm so happy that this particular tree is still being sold because I'm going to just buy a replacement. This tree has been very sturdy and was a great purchase. My cats love how tall it it, but it has a pretty small footprint, and still remains stable. Despite a very active Siamese, who leaps before she looks, they've never managed to knock it over. The only thing that has broken on this cat tree - the little toys. Those lasted about a day! But I didn't buy this cat tree for the toys.",
      "rating": 5.0,
      "verified": true,
      "author": "AnnaShelly",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Our 3 youngest like this tree and take turns perching at the top",
      "text": "Our 3 youngest like this tree and take turns perching at the top. I love watching them play with the dangling toy. The oldest wants nothing to do with it and still attacking the couch so we put vinyl around the sides to deter him from scratching. We don't have the tree against a wall and it seems to be very sturdy. We used to have the kind that use a spring rod to cling to the ceiling but after a year of them jumping on the tree that eventually broke down and we had to keep replacing them. This one has a wide enough base so it doesn't really move when they jump on it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20161010
    },
    {
      "title": "Well made but not perfect for XL cats",
      "text": "It's a well-made product and one of my cats uses it occasionally. Both cats are very large (17-18 pounds) and they don't fit well on the platforms or in the little cubby area but one uses the sisal rope (and ladder) to sharpen her nails and enjoys being on the top platform if she curls up. I wasn't sure how to attach the little puff balls to the platforms but I put their own toys around it for them to play with. If it was built for larger cats, this would be 5-star.",
      "rating": 4.0,
      "verified": true,
      "author": "Bargain Hunter",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "great - but remove string for hanging toy!!",
      "text": "Pros -This was very well made. My husband could have put it together much quicker - was hard to tighten inserts/screws/etc. from bottom. But best quality cat tree I've seen. Packed INCREDIBLY well. Cons - really small ledges. Should have gotten the bigger one BEWARE THE BLACK STRINGED TOYS - my cat got her neck caught - don't use ! I put another cat toy in the hanging loop - would be great if they had another 'loop' or more, hanging from the bottom of other ledges...",
      "rating": 4.0,
      "verified": true,
      "author": "Creative Basket Lady",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "It could be a great cat tree",
      "text": "It could be a great cat tree. I have another armarkat tree that is sturdy and amazing, which I left a 5 star review on. The one I received this time could be a great tree, but one of the holes was not drilled through completely, and it throws the whole tree off balance, so it's super wobbly. Too much of a pain to return. Maybe I'll super glue it :/",
      "rating": 2.0,
      "verified": true,
      "author": "Bree",
      "helpful_votes": 2,
      "publication_date": 20170315
    },
    {
      "title": "Sturdy and Well-priced",
      "text": "This thing is really sturdy. I know this because I have a 3yo who climbs under it and sometimes tries to climb on it, before he's yelled at to get off. I only have one ten pound cat, who seems to like it a lot (as long as the kid isn't climbing on it). Also, a much better price than anything I was able to find in any of the local pet stores.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Guptill",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "A luxury palace for our fur family",
      "text": "My cat has found his new home. He really needed something to get \"high\" on and has found his needs fulfilled with this product. Once he climbed on it he found his home. He sleeps at the top often and perches on the second tier to watch out the window daily. It is a safe-haven respite from our dogs that tend to enjoy aggravating him from time to time though he brings that on himself often. Still he has a place to go that they can't. He enjoys everything about it from the scratching posts to the high level perch(s).",
      "rating": 5.0,
      "verified": true,
      "author": "Damag Castellum",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "My kitties love this thing",
      "text": "My kitties love this thing, the only problem I've noticed with it is that the carpet or material on it tears up really fast. We've only had it about six months and I am looking to buy another one but I will not be buying this one. Also, the ball rips off and you can't put it back on there cause the hoop thing is weak.",
      "rating": 3.0,
      "verified": true,
      "author": "Mckenzie",
      "helpful_votes": 2,
      "publication_date": 20170622
    },
    {
      "title": "Cat loves it but not the best quality",
      "text": "My cat loves it and it looks very impressive. However, it was a bit dirty when it arrived and the little balls that hang were made with supper awful string... the second the string got wet from my cat putting it in his mouth it broke. He didn't even chew on it but one or twice. Literally within second it broke. Also the base sits a bit funny since it has 3 screws sticking out of the bottom so that it is a bit unleveled.",
      "rating": 4.0,
      "verified": true,
      "author": "Elaine Ruiz",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Durable Tree For Your Feisty Felines",
      "text": "I have two cats. One of them is five years old and the other is a just a kitten so between the two of them, this cat tree definitely gets its use. I've had it for over five months and It's shown to be very stable, durable and interactive for my feisty felines. Not only that but the assembly directions that it comes with are very easy to follow. It took me about 30 minutes and a glass of wine to put together. I did a lot of research on finding an affordable, good quality cat tree and this one seemed to be the best bang for the buck. And, it's an attractive one too!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary R.",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "However it took him a minute to get up tge platforms because they are so close together and pretty tall. He loves the scratching posts",
      "text": "Its very stable and space efficient. However it took him a minute to get up tge platforms because they are so close together and pretty tall. He loves the scratching posts. Most of all he loves running around with the fuzz ball so i didnt bother attaching it to the climber. Design is strange because theres quite a few staples to keep the parts together, and there are two different lengths of the thicker screws with no clear W2 or W5 printed on them as the instructions denote. My cat ia only 9 lbs and barely fits laying on the platforms.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "A little wobbly, but cats love it and it’s good quality",
      "text": "Our cats love this tree. Our smaller car hides out in the little shelter & scratches the post and our big cat (who barely fits on the tiers!) still loves to curl up on the top level where there is a little bit of a higher edge so he doesn’t fall out. It is not super sturdy: it wobbles a bit, but honestly if my cats love it, that’s all that matters to me! It’s held up entirely with quality since purchase nearly a year ago.",
      "rating": 4.0,
      "verified": true,
      "author": "MH08",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "top platform bolts too short to attach top platforms",
      "text": "Really good price, but the top bolts were too short to attach top platforms. Will have to go to Home Depot to get longer 9/16\" ? bolts, not sure on the size, oh, 10mm by 45 mm. Also, I didn't think my 15lb cat was that big until I compared him to the condo. No way he fits. I looked at the videos and it's great for kitties, but for full grown cats it seems a little small. I got one platform on by stealing a longer screw from the base. As you can see in the second photo the top platform is missing.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Erickson",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Sturdy, thick, quality tree!",
      "text": "There isn't anything wrong with this tree, my cat just doesn't like it. The tree is sturdy, the material is plush, the posts are thicker than other trees I've bought, and all the hardware is included. Maybe it's the layout that just doesn't appeal to my cat? While she would probably fit in the cubby, the strip on the outside is too thin for, anything, really. It's also a cream whiter color, that clashes with my other beige trees but that's not a fault of the product at all.",
      "rating": 4.0,
      "verified": true,
      "author": "Karina Dominguez",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Love Love Love this Cat Tree and so does my ...",
      "text": "Love Love Love this Cat Tree and so does my newly adopted kitten. It arrived via UPS and was extremely easy to put together in about 30 minutes. My Kitten loves it and uses it all the time. I will say he totally destroyed the first ball that hangs from the top tier but fortunately they included 2 balls. The second ball is still in tact and is played with daily. The quality is great and the price is awesome!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nana in Maine",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "The ramp was perfect for my arthritic cat",
      "text": "My cat is old and has arthritis in her hips. She has trouble jumping. She likes the ramp so she can climb into the box. She loves the box! Armarkat is a quality brand. The cat tree looks great in the house. It is easy to assemble. The instructions are simple. All the parts are there. The holes are pre-drilled. They even included tools!",
      "rating": 5.0,
      "verified": true,
      "author": "Bud",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "Kitty Cat Approved",
      "text": "We've actually had this for several months. Our cat absolutely loves his cat tree. Even though he's a pretty big cat, he likes to sleep on the top platform. I am impressed with the quality of this product and have no doubt that it will last for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "John S",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Cat heaven haven",
      "text": "My two kitties LVOE this cat tree. I have one who sits in the top all of the time and the other who loves to sleep in the square area. My cats are 6lbs and 16lbs and they both fit and play in it. It is also the perfect height for those of you with “tree cats’. who love to climb. I’m glad I bought it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn G",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Solid and easy to assemble.",
      "text": "I bought this right away after bringing our forever furry friend home. She didn't take to it right away but after 5 months she started laying on it daily. She uses the scratch posts a few times a week and will perch to look outside when placed by the window. It's pretty sturdy, easy to assemble, and fits nicely in the corner. My cat is around 8lbs and fits perfectly on the top perch.",
      "rating": 5.0,
      "verified": true,
      "author": "Candice M. Donaldson",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Sturdy and pretty cat tree",
      "text": "We really liked the look of this cat tree- it fits the decor of the rest of our house unlike many of the other brown cat trees out there. This tree is also sturdy and is the perfect height for our cat to leap from to our cat shelving. Our cat uses it everyday. The only minor downside we've noticed in the months we've had it is that it has acquired a slightly pinkish tinge over time. It's not bad though. Everything else about this cat tree makes it worth the recommendation.",
      "rating": 5.0,
      "verified": true,
      "author": "Hai Phan",
      "helpful_votes": 0,
      "publication_date": 20170128
    },
    {
      "title": "... the third Armakat tree we've bought--this brand is that good. The trees are sturdy and well-made and our ...",
      "text": "This is the third Armakat tree we've bought--this brand is that good. The trees are sturdy and well-made and our kittens are already climbing all over them. They are also using their trees to scratch--and leaving my furniture alone. I like the choice in sizes Armakat offers, which has enabled me to fit the trees to the space in different areas of my home. These are great products, very well designed with good materials. They will last for years--and most important, our kittens feel secure on their trees, and are enjoying scampering all over them.",
      "rating": 5.0,
      "verified": true,
      "author": "Ariel D",
      "helpful_votes": 0,
      "publication_date": 20160819
    },
    {
      "title": "Our new kitty loves it!",
      "text": "We recently rescued a cat and wanted to get her a cat tree to keep her occupied and help make her feel at home. After hours and hours of searching for just the right one, we settled on this one. Received it on 04/08/15 and was easily assembled by my 17 year old son. Our new cat, Hobbes, loves to play with the ball hanging off the top platform. Product is well made, the base is good and stable, only wobbles a tiny bit when she's jumping from platform to platform because it's on carpet but on hardwood or laminate, I don't think it would wobble as much. Great deal for the price! No complaints. Happy cat!",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 2,
      "publication_date": 20150409
    },
    {
      "title": "Pretty great cat tower",
      "text": "Pretty great cat tower, especially for the price. Our cats love to sleep on the two upper platforms. Assembly was really easy, took me maybe 5-10 minutes. The base is a smidge small - my cat will come running and launch herself at the cat tower, causing it to rock a bit, but we have ours against a wall. I think the ramp is a bit too steep for regular use, my adult cats would rather leap up to the second level and my foster kittens preferred to climb up the scratch beams. It is a great height; my cats are perfectly at face-level when they sit in the highest platform, so I can give them lots of kisses.",
      "rating": 4.0,
      "verified": true,
      "author": "Alice",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Moderate, attractive playground for lively cats.",
      "text": "Our two young (but growing) kitties enjoy this tree, for both romping and resting. I fits nicely into a narrow corner space, and is fairly unobtrusive in the living room. The hanging ball (included) was very compelling, but does not stay hanging very long with active cats. They still enjoy it on the ground. Overall, a good value for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Shelley N.",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "Great Cat Tree",
      "text": "At first I thought that this product might turn out to be wobbly and unstable like most cat trees that I purchase online. However, this one is great. I have several cats who climb to the very top and sleep all day. I will say that this is not for any cat over 9 lbs. This is only suitable for small to medium sized cats only. I have one cat that is 17 lbs, and there is no way that he would ever be able to climb this tower. The slimmer the cat, the better. I still recommend this product. This cat tree has plenty of \"scratching\" areas and is very sturdy,",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen R.",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "Was skeptical...",
      "text": "I was so skeptical at first, because this was a great price. I was afraid I was going to receive it and it would break within the first few weeks. Not the case. We have two rambunctious kittens crawling all over this daily and jumping around like crazy and it's holding up just nicely. My larger, older cat doesn't bother with it much, but I don't think it would have any issues holding her. So glad we purchased this!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Thinking about buying this? Bet.",
      "text": "Now this is my first time owning a cat let alone a cat tower and I got her pretty recently so she hasn’t even seen it yet but w.o.w is this thing huge, and sturdy. Like I could hit this b*tch with my car and the tower would still be A1. Im half tempted to play on this thing myself. I’ll update the review if somehow it sucks but I doubt that’s going to happen. Buy it! (This thing would be like $200 at PetSmart and you know it)",
      "rating": 5.0,
      "verified": true,
      "author": "Neal C.",
      "helpful_votes": 2,
      "publication_date": 20180501
    },
    {
      "title": "does seem to like the ease of walking between the different layers and ...",
      "text": "It does come unassembled...but not difficult to put together. It came with the ladder broken, but we felt we could fix it instead of trying to return it and pay freight costs. The top 2 platforms really should have higher sides........most cats prefer the \"snuggle-in\" feeling verses possibly sliding off. Our cat, who is almost 11yrs old, does seem to like the ease of walking between the different layers and the double opening of the \"cubbie\".",
      "rating": 3.0,
      "verified": true,
      "author": "Evelyn Burdick",
      "helpful_votes": 0,
      "publication_date": 20161121
    },
    {
      "title": "Functional",
      "text": "The cats love it. They grew up on it. It’s a good size for kittens and small adult cats (10-15 pounds). Only thing is, the screws keep coming loose and I have to adjust it every week or so that is doesn’t fall apart.",
      "rating": 3.0,
      "verified": true,
      "author": "Chloe",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Now that our kitty is almost full grown he takes up the whole of the landing spaces like that cat in the picture",
      "text": "Can't beat this for the price. Now that our kitty is almost full grown he takes up the whole of the landing spaces like that cat in the picture. Doesnt care and neither do we. I'd say this is great if you just have 1 cat. 2 or more xats might need something sturdier. I like how it's tall but doesn't hoist your cat to king/queen status above everything and everyone. The color is nice and basic, it's easy to set up, and easy to vacuum.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Bates",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "I'm so happy she loves her new home in our new home",
      "text": "After a move, I wanted to get my cat a new and smaller cat tree since I wasn't able to take her old one to our new home. This is exactly what I wanted. She loves her new tree and sleeps on the top shelf daily. She loves the posts to pull her nails on, plays in the box, and plays with the hanging toys too. She is about 13 pounds and fits well on the shelves to sleep. The only part she doesn't use is the sloping steps to the box. She just jumps up. I'm so happy she loves her new home in our new home! =)",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer K. Manfre",
      "helpful_votes": 0,
      "publication_date": 20161105
    },
    {
      "title": "a queen in her tower",
      "text": "Our female cat claimed this tower right away. It was an excellent retreat from her overweight brother as she can leap to the top if needed. Its pretty wobbly at the very top so we try to keep the post screws tight. We set it up in front of our bow window and she monitors the ins and outs of the neighborhood kitties all day from her throne in the sky.",
      "rating": 4.0,
      "verified": true,
      "author": "Michelle Wilson",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "Our cats love it!",
      "text": "This is our second Armarkat tower because the cats used the first one so much we decided to get a smaller one for the office. This one is just as good and well liked as the first one. This time we got the 53-inch and it has held up to two cats running and jumping on it. They use all parts of it for climbing and exploring except for the ramp. They totally ignore the ramp part, but I think it adds to the stability. One cat really likes sleeping on the top tier. Glad we went with this brand again.",
      "rating": 5.0,
      "verified": true,
      "author": "Tech Gal",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "Well built for the price; magical",
      "text": "Super easy setup. My cat fell in love instantly. If I were to violently knock this thing over, it wouldn't break; sturdy! However, the ball didn't last very long because of the elastic string attached. I'd recommend changing the elastic string to a regular, more durable string. Other than that, this is probably one of the best purchases I've made yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Caitlin",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "The cat says \"meow\"...",
      "text": "I've got it by a window and my elderly (16yo) cat absolutely loves this design of cat tree. She can easily use the little \"ramp\" and spends her time in the hidey box watching to world go by.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary D.",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "The BEST Cat Perches",
      "text": "This is the only company I will order cat perches from. They are sturdy and beautifully made. Over the past few years I have purchased (3) in different styles. Spoiled kitties have them in almost every room! Easy to put together and stand the test of time and cats - meowy-happy with our perches!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Pilates",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Sturdy, good quality, perfect for bigger playful cats",
      "text": "Easy to put together. Very sturdy and good quality. My cat immediately climbed up to the top and sat comfortably on the top perch. He also uses the scratching posts and plays with the hanging ball all the time. Bought this one after having to return a different brand that was too small and flimsy for bigger cats, very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Castle",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "The cats love this thing",
      "text": "The cats love this thing. It is next to a window, and they like to look out at the birds and squirrels. They spend most of their time on the top tier. They love to scratch on the poles. Based on other reviews, we did not affix the string toys, but the cats still bat them around on the floor. It took about 15 minutes to assemble - it would have been faster, except that the cats were lying on the parts.",
      "rating": 5.0,
      "verified": true,
      "author": "Reviewer",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "Cat LOVES it!",
      "text": "What can I say? This tree was a big hit with our kitty. She LOVES it and it’s much more sturdy than any other cat tree I have owned. It has a clean look and is made with quality parts. Two thumbs up!",
      "rating": 5.0,
      "verified": true,
      "author": "Annette DiMaggio",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Fat cat fits!",
      "text": "Best cat condo ever! Sturdy, nice looking, doesn't take up much space, and has withstood abuse from my big, brute, maine coon. At first I thought the platforms would be too small for my big ass cat to sleep on, but he makes it work. He doesn't really go in the house part much because he'd take up the whole space, but that's OK. Definitely happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "LovelyIRIS89",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Sturdy, neutral color, cat loves it",
      "text": "My cat loves her new kitty tree and spends much of her time perched on the top platform or hanging out in her little house. Against sand colored carpet and light yellow walls, it sort of fades into the background and doesn't take over a room despite the large size. It's quite sturdy when placed against a wall. The only thing I don't like is the back of the stairs is uncovered particle board, so if you want to place it sideways against a wall (which works better in my space), you end up looking at a pretty ugly unfinished surface. My cat isn't into the stairs anyway, so I may just take them off--doesn't seem like they're structural.",
      "rating": 4.0,
      "verified": true,
      "author": "MBHH",
      "helpful_votes": 0,
      "publication_date": 20130620
    },
    {
      "title": "and I have to say it's survived all of their daily abuse wonderfully. The carpeting is still nice and plush despite ...",
      "text": "I ordered this cat tree shortly after we brought home two 6-week old kittens, and I have to say it's survived all of their daily abuse wonderfully. The carpeting is still nice and plush despite their inclination to use it as a scratching post - instead of the sisal posts. One of our kitties turned into a 10 lb monster (who we affectionately call \"the dumpling\") and even when she throws herself at it full force, I'm not worried about it tipping over. Overall a great, sturdy product that I hope our cats will enjoy for many years to come!",
      "rating": 5.0,
      "verified": true,
      "author": "Spark",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Cat deterent",
      "text": "It has done a great job of keeping the cats off the furniture in the living room. They were sneaking in there and getting on the back of the couch or both would get in a chair together. Since it is the only room they are supposed to stay out of, of course the are determined to go in there. This saves us correcting them constantly. It only takes getting a paw in it once to discourage them.",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Pretty Good Quality. Small Problem With The Base",
      "text": "My small cat absolutely loves this tree, she spends hours on it. When it comes time to replace it I will be buying my next product from the same manufacturer. Quality is at about the 90% level with me, the only problem I have with it is the screws that are on the bottom of the base do rub against my hardwood floors, they are not recessed into the base enough. Something for you to consider before buying it.",
      "rating": 5.0,
      "verified": true,
      "author": "George Francis",
      "helpful_votes": 0,
      "publication_date": 20170304
    },
    {
      "title": "The Cat Castle",
      "text": "My cat looooves to hang out on this thing, I find her on it every day when I get home, one thing about it is she keeps tearing up the hanging toy, came with 1 replacement but she loves that ball so much that every time I put it back on, she rips it off and can play with it for hours. actually, I believe that ball is her #1 favorite toy-works for me",
      "rating": 5.0,
      "verified": true,
      "author": "D5e",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "Ladder ripped off",
      "text": "I have a very small cat, he is fully grown but only slightly larger than a kitten. He managed to tear the ladder which was held on by four screws, completely off. The screws for the ladder I don't think are long enough. I am at a loss as to how such a small kitty can tear this tree up.",
      "rating": 3.0,
      "verified": true,
      "author": "WonkyPopBallWaffles",
      "helpful_votes": 0,
      "publication_date": 20170709
    },
    {
      "title": "so I'm quite happy.",
      "text": "For such a small-platformed cat tower, the price is right. Even my fat cat, especially my fat, huge, big-boned cat, is getting my money's worth out of this. The steps were a joke, and impossible to stably-secure, so they lie on the bottom level as an unsecured after-thought, but that hasn't dimmed anyone furry child's affection for or ability to use this. The rest of it is quite stable and that seems to be enough for my fury kids, so I'm quite happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Wilson",
      "helpful_votes": 0,
      "publication_date": 20160120
    },
    {
      "title": "Great for playing and scratching",
      "text": "My cats love this tree. They both play on it or sleep on it. And they it is great for scratching, much better than any scratching post I have ever had. When I bought it before the holidays it was on sale for a great price and back ordered. It was well worth the wait.",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy M.",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Easy to put together and a favorite for my cat",
      "text": "My cat just loves this! She loves the scratching posts and I think it cuts down on her using the furniture. She loves to sleep on the top every day. She also likes playing with a toy if you attach one to the string. I would buy this again in a second. Very sturdy and has held up well.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Wood",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "Sturdy and Long-Lasting",
      "text": "I’ve had this for almost 2 years now and it’s held up extremely well. For the first year, I only had one cat, but the second year I moved into a house with 7 more cats (yes, 8). The wear and tear of the extra 7 cats has barely showed, even though most of them use it daily. It is extremely sturdy and fairly easy to assemble. I have recommended this brand to a lot of my fellow cat owners.",
      "rating": 5.0,
      "verified": true,
      "author": "Tsarina Islam",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Good price and decent quality",
      "text": "Good price and decent quality. It was pretty easy to put together maybe 20 minutes. It’s pretty study and the cats love it . The have decided to use the scratching posts on the cat tree instead of my couch!!! Overall I would buy it again it’s well worth it, they seem to be always hanging out on it all day!",
      "rating": 5.0,
      "verified": true,
      "author": "devonnic75",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Worth the price!!!",
      "text": "My 4 month old kitten was already making herself at home in the house part as we were putting this together. She is still learning how to maneuver and climb all the posts but as she will be an indoor cat this is a great learning and exercising tool for her. Fairly easy to put together and you don't need any tools. The only obstacle you might run into is that your cat may want to \"help\" you put it together lIke mine did, lol. Just a suggestion but I tied other toys to the post to get her acclimated to it as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen Long",
      "helpful_votes": 0,
      "publication_date": 20160318
    },
    {
      "title": "My cats seem to enjoy this- just wish the top platform were larger/wider or ...",
      "text": "My cats seem to enjoy this- just wish the top platform were larger/wider or had a second one. I understand for stability it probably can't be too big but my cats do seem a little crammed. There's usually a race to see which cat will get there first to claim the space. Good price, easy enough to put together, would purchase again",
      "rating": 4.0,
      "verified": true,
      "author": "Cptn Seaweed",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Excellent & Kitty Loves it!!",
      "text": "Excellent product. Arrived in a couple of days [I have Prime]; packaging was super and appropriate to contents. The instructions inside were clearly written and easy to understand... no tools needed... everything came in the box. I put it together myself in about 15 minutes. My kitty LOVES it!! Definitely RECOMMEND this kitty tree and the seller that I purchased it from! Trust me... this Kitty Tree is made so much better than the junk trees sold and displayed at local Pet Stores! You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Cyn;-)",
      "helpful_votes": 0,
      "publication_date": 20150527
    },
    {
      "title": "Good for a big guy",
      "text": "This tree is very reasonably priced and sturdy once I put it together. It was hard to get the “stairway” bit to line up, though. My cat loves this thing. He’s 8 years old and very big compared to most other cats I’ve met, and he was up there chasing his tail like a kitten again, he liked it so much. So don’t worry if you have a big cat, this is big enough. Definitely recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Very nice!!",
      "text": "Great product!! Very sturdy, good materials. The only thing that confuses me is my cat will scratch everything else by the posts. That's why I bought it lol!! But it's a beautiful piece. Leo seems to like sleeping on it more than he likes sleeping on our bed now!! He's a little big for the box to lay into but he still lays down. He instantly chewed off the little furry balls. Ha ha.",
      "rating": 5.0,
      "verified": true,
      "author": "Mayra",
      "helpful_votes": 2,
      "publication_date": 20170331
    },
    {
      "title": "Life saver and my kitten approves",
      "text": "My kitten LOVES this cat tree! She loves climbing it, sleeping on it and using the poles for her claws. It only took her about 24 hours to break one of the dangling ball toys but that's because she plays with it quite hard! It's nothing on the product. And the best part is I can replace the toy with some of her old ones that she broke off of her old toy. She breaks a lot of toys",
      "rating": 5.0,
      "verified": true,
      "author": "Kasie Mays",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Great cat tower",
      "text": "Great cat tower! Our kitten has thoroughly enjoyed it after a bit of trepidation. After about a month, she did manage to tear the little stuffed ball off of it but she loves sitting on it and watching the outside. She also loves to sharpen her nails on the scratching post which we encourage over using the sofa. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Rogelio Medina",
      "helpful_votes": 0,
      "publication_date": 20170817
    },
    {
      "title": "Spoiled cats love it.",
      "text": "Simple enough to put together, the instructions could have been a little more spaced out (only \"four\" steps but not really!). Is a touch wobbly, best in a corner. My cats love it, started using the scratching posts almost immediately.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica S.",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Easily assembles. Some reviews stated that it's a bit ...",
      "text": "Cat LOVES it!!! Easily assembles. Some reviews stated that it's a bit wobbly. I don't have an issue with that. My cat jumps, attacks, climbs, scratches it without worry. The danging toy it comes with doesn't attach well at all. My cat had it ripped off within minutes then thought the loop it was attached to would make a good chew toy. I cut that off completely. She's only 5 lbs. now; will see what happens when she's full grown and done being kitten crazy.",
      "rating": 5.0,
      "verified": true,
      "author": "FL2015!",
      "helpful_votes": 0,
      "publication_date": 20160129
    },
    {
      "title": "This cat tree is awesome! It was really easy to assemble and I ...",
      "text": "This cat tree is awesome! It was really easy to assemble and I think it is a lot more attractive than other options with the white fabric and modern shapes. My cat was completely obsessed as soon as I finished setting it up. She spends the majority of her time up there and loves all of the scratching posts and wrestling with the hanging toy. I will say that I would get something bigger for a large cat. My cat is less than 7 lbs and she is a perfect fit on the top platform.",
      "rating": 5.0,
      "verified": true,
      "author": "Grace",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "Nice size and easy assembly",
      "text": "Perfect size for my small apartment. Easy assembly and it seems very sturdy. I ordered a pizza and had the box opened, pieces sorted out, and put together before dinner arrived. I did have the one washer as a leftover part, however I don't know what difference it would really make. My kitten Axel, had the little toy untied in no time. The cat tree did feel a little wobbly when I sort of shook it, but when Axel jumps up there, it doesn't move at all. He weighs probably around 8 pounds and is 5 months old.",
      "rating": 5.0,
      "verified": true,
      "author": "cassandra",
      "helpful_votes": 0,
      "publication_date": 20170327
    },
    {
      "title": "Great item; sturdy and well loved",
      "text": "Puts together with ease, and my cats love it! Looks good, tall enough so both cats have some window access, and just high enough to make it so my smaller cat can't quite reach down far enough to smack her larger brother. FYI, this isn't for very large cats; it's sturdy enough but the top spots are only about a foot square (or less). This is great for us, though, since my smaller cat likes to be queen of the castle.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaime B.",
      "helpful_votes": 0,
      "publication_date": 20160215
    },
    {
      "title": "Love it! Great price too!",
      "text": "I love this cat tree! My cat doesn't care for it that much but my two kittens love it! They even go to sleep in it. I also love the white carpet compared to the regular nude colors you normally find out there. The only thing about it is that the fur balls attached to the strings ripped in 1 minute after the kittens got to it, but they still get a lot of fun out of it. So 5 stars from me. Also, if installed right it is quite sturdy. Buy away! You won't regret ! 👍🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170616
    },
    {
      "title": "Best Amazon Purchase",
      "text": "Best product I have ever bought. All parts there, all hardware, and excellent and easy instructions. I am 82 years old and was able to easily assembly and have a fantastic kitty condo for my kitten, Goldie.",
      "rating": 5.0,
      "verified": true,
      "author": "elizabeth m white",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "... assemble this when it arrives and it is very easy to put together",
      "text": "You have to assemble this when it arrives and it is very easy to put together. My cat ignored it for the first couple of days but now she loves it. She doesn't use the house part much but she loves to perch at the top, scratch the posts and pull on the string that the ball is connected to. It's more attractive than most towers that I have seen and isn't too much of an eye sore.",
      "rating": 5.0,
      "verified": true,
      "author": "Mamoru",
      "helpful_votes": 0,
      "publication_date": 20171107
    }
  ],
  "product_meta": {
    "title": "Armarkat B5301 53-Inch Cat Tree, Ivory",
    "description": "Model No.: B5301; Covering Material: Faux Fleece; Covering Color: Ivory; Board Material: Pressed Wood; Post Diameter: 3-1/2-inch; Overall Dimensions: 24-inch (L) X 22-inch (W) X 53\"(H); Max Holding Weight: 40 lbs; Base Dimensions - 22 X 20, House Dimensions - 14L X 12W X 12H; Perch Dimensions - 14 X 12",
    "rating": 4.7,
    "feature_bullets": [
      "Great unit for scratching, climbing, sleeping, and exercising",
      "Made from attractive pressed wood with faux fleece covering",
      "Looks great in any room",
      "Easy assembly",
      "Ramp, instruction manual, and necessary tools included"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "24 x 22 x 53 inches; 17 Pounds",
      "Item model number": "ARMARKAT-B5301",
      "Date First Available": "October 27, 2006",
      "Manufacturer": "Armarkat",
      "ASIN": "B003BYQ1JG",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Activity Trees",
      "Cat Trees & Condos",
      "Pet Supplies",
      "Beds & Furniture",
      "Cats"
    ],
    "price": ""
  }
}