{
  "website_summaries": [
    {
      "verdict": "An easy to set up bounce house that provides endless hours of fun for the little ones.",
      "pros": [
        "Simple to set up and take down",
        "The pump works well and inflates the entire castle in roughly 30 seconds",
        "There is a secure mesh entrance in the back and a small slide in the front",
        "We love the optional roof top and would suggest adding it to your order if you live in a sunny area",
        "Durable and safe for children under age 5",
        "Can hold the weight of an adult",
        "An added bonus is how quickly this material dries after getting wet in the rain"
      ],
      "cons": [
        "The fan is a little on the louder side, but not bad"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Perfect for keeping kids busy",
      "text": "We bought this as an extra activity for my kids and their friends at their birthday party. It sure kept them busy. More of the kids played on the bounce house than our trampoline! It held up perfect to a house full of kids and even for some adults. What I loved about it is that it was gentle enough for a group of 1 yr olds to play on!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 28,
      "publication_date": 20160305
    },
    {
      "title": "Bounce House Flexing",
      "text": "My little guy loves this. From unopened box to my kid jumping on it took about 10 minutes. All you do is unroll it, tie the input tube to the fan, make sure the other tube is tied closed, stake the corners, and blow it up. Putting it away isn't too bad. This thing is fairly portable if you wanted to take it with you to see the grandparents. It's also a subtle flex on all the mediocre parents on your street, so there's that too. If this thing craps out in the next few months, I'll update this review. So far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 3,
      "publication_date": 20200120
    },
    {
      "title": "Still gets 5 stars because it gave us 3 great years. I recomend cutting off the shoe net ...",
      "text": "After having this for 3 years my kids are now 8 and 3. My 8yo weighs 65lbs, most people think he is 10. We had our first issue this last weekend. My 8yo grabbed the net where you are supposed to store shoes and a friend pulled him back. The net strings tore a hole in the fabric and now there is a huge gash. I used one of the included patches but they are just stickers and the wwight of the bigger kids just poos them off. Still gets 5 stars because it gave us 3 great years. I recomend cutting off the shoe net as soon as you get it... Trust me, the kiddos wont use it anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah R.",
      "helpful_votes": 4,
      "publication_date": 20180318
    },
    {
      "title": "Kids love it",
      "text": "Super easy to setup. Appears to be very durable. Don’t be alarmed if you feel air coming out of seams. It’s obviously designed that way so the thing doesn’t pop from the constant air flow generated by the blower. Carry bag is just a basic bag. Would’ve liked to see something more like a camping chair style bag with a tie closing. This doesn’t change the fact that I love it though. Kids love it more. Bounce away!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Terrible product that cost too much.",
      "text": "Do not buy. Seams came apart less than 3 times of use. Missed the return window by 2 days. It doesnt even bounce. My kids are 2 and 4 so you would think they could bounce around. This was the biggest waste of money. I dont believe these positive reviews on this product. My kids did not find this fun. This \"bounce house\" is the same exact product as the $50 blow up bounce house except this one has a blower and is a tad bit bigger. I would not recommend this product if your kids actually want to jump around.",
      "rating": 1.0,
      "verified": true,
      "author": "Cheyenne",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Great buy for hours of fun and exercise.",
      "text": "Wonderful our three year old granddaughter loves it. Very well constructed, and durable. We did away with storage bag and use a plastic tote to store jumpy house. Easy to ut up and take down. Blower is not as loud as I thought it would be, so much so we have used jumpy house inside our home on rain days. Great buy for hours of fun and exercise.",
      "rating": 5.0,
      "verified": true,
      "author": "AK RV'er",
      "helpful_votes": 6,
      "publication_date": 20170806
    },
    {
      "title": "Great Beginner Bouncy House!",
      "text": "Pros: Easy to setup Pump works well Slide is nice and slippery to function as a slide Jumping platform material looks and feels durable. It looks to me like polyurethane dipped tarp or ripstop. Cons: Maximum weight is pretty low Stitching looks a bit questionable and not sure how well it'll hold up. One side with net opening held by velcro won't hold up to toddler wanting to open it. If a child somehow bumps near the opening, he/she could potentially fall out. Would rather have it closed off than opening too easily.",
      "rating": 4.0,
      "verified": true,
      "author": "EK",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "I do not recommend and we want our money back or a new ...",
      "text": "We bought this at Christmas for two young kids and the quality is disappointing. This is our second Little Tykes bounce house and this one was by far less quality than the one we had previously. The stitching is all loose and there is a large hole already with very little use. We have this setup in our new garage on smooth concrete with no sharp objects nearby. I do not recommend and we want our money back or a new one sent to replace this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Leslie Cooksey",
      "helpful_votes": 5,
      "publication_date": 20180308
    },
    {
      "title": "Bounce bounce bounce",
      "text": "I purchased this for my 2yo. It fits nicely indoors as I intended it. We keep it in a bonus/ game room area. It is a good Size and takes up a A good amount of Space. My toddler loves this bouncer on rainy days when we are stuck inside. He has 12yo siblings who get in the bouncer with him but are not allowed to jump because I want it to last and secondly Because it’s Not made for big kids in the slightest. It inflates in no time which is a bonus when your kid just needs a quick distraction.",
      "rating": 5.0,
      "verified": true,
      "author": "skeptic1",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Love love love!",
      "text": "We love this thing! It keeps my 4 year old and 2 year old entertained for hours. Super easy and quick to set up, take down, and store in the bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda A.",
      "helpful_votes": 9,
      "publication_date": 20170508
    },
    {
      "title": "Quality product that my kids love",
      "text": "This is such a great quality product. I bought this toy in December 2010--7 years ago. We dont use it that often--maybe five or six times a year but has held up perfectly for seven years! My kids ages 2-9 all love playing on it. Set up and take down is super easy. I can have it up in three minutes and put away in 5 minutes. I would definitely recommend this product for some fun outdoor play.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate Chiafolo",
      "helpful_votes": 3,
      "publication_date": 20171219
    },
    {
      "title": "Sturdy, high-quality bouncer",
      "text": "Bought this as a quarantine impulse buy and it is the best thing we have purchased, EVER. My kids can jump and slide HARD on the bouncer and it stays consistently sturdy and yet cushiony for them. It inflates in almost 15 seconds with the fan it comes with, and the noise isn’t nearly as loud as I was expecting. It’s perfect for the indoors and fits in our basement (9 foot ceiling) with room to spare.",
      "rating": 5.0,
      "verified": true,
      "author": "Grace",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Great buy, durable material and easy to set up",
      "text": "My granddaughter turned 3. The weather was so iffy and I wasn’t sure if I was going to be able to use it. The sun came out and I attached a sprinkler mat at the end of the slide and the kids loved it. 5 kids and the oldest is 10, also jumped and it held up great. Loved it The only issue was trying to get it in the bag after the party.",
      "rating": 5.0,
      "verified": true,
      "author": "TONYA CRENSHAW",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "BIG YARD FLEXIN!!",
      "text": "This is big yard \"flexin\" right here. The kids and my neighbors enjoyed it all day. It burned their afternnon energy. We are kickin quarantine's tail with this baby here. No more bored kids. It fits 3 kids inside ages 4, 5,6 and could have added 2 more comfortably. The only thing is you have to keep blower running to keep it inflated. Amazon Never disappoints!!",
      "rating": 5.0,
      "verified": true,
      "author": "DeeM",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Great purchase, well worth it!",
      "text": "This was a mega hit for my son’s birthday party. We’ve had it out to use several more times over the summer. Planning to use it in the basement during the winter months when my kids just need to burn off some energy. We used a sprinkler with it to make it more fun on hot days, but it’s also a big hit when dry.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan A. Schneider",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Doesn’t last very long.",
      "text": "Loved this at first (the first two or three months), but we’ve had it for a year and it has completely disintegrated. The tube that connects the jump house to the blower is full of holes and we’ve used it maybe 10 times with a very tiny toddler (2).",
      "rating": 2.0,
      "verified": true,
      "author": "Virginia",
      "helpful_votes": 2,
      "publication_date": 20190114
    },
    {
      "title": "Easy to inflate and easy to put away!",
      "text": "This bounce house is perfect for my toddler. It’s very easy to set up. Once you lay it on the ground, tie up the blower, and flip the power button, which takes less than 3 minutes, the whole thing is inflated in no time at all. To take it down, simply turn off the blower and untie the two areas that am an be used for the blower. It takes less than five minutes to fold, roll, and bag then bounce house. The bag that comes with it is a good size for the bounce house. Definitely worth the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Lulu",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "A great kiddy pleaser",
      "text": "My family (including four grandchildren all under the age of 3) took off to quarantine for a month away from the city where the kids could have some outdoor fresh air. What good is a backyard without an activity. The JUMP AND SLIDE BOUNCER was the best investment I made for that wonderful month together! Kids love to Jump and Bounce...t'is a simple knowledge eh? They jumped and bounced in this colorful instant plug-in-and-blow-up toy with cover from the sun till they were (thankfully) tired enough to nap. tee hee. I highly recommend this terrific fun-house for kids (and I confess I did my share of jumping in there with them). To your health!",
      "rating": 5.0,
      "verified": true,
      "author": "karen moss",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Best toy I've ever gotten my son",
      "text": "I wish i had gotten this sooner. We have a huge bonus room and use this inside mainly but have put it outside as well. My 2.5 yo can run in and push the button himself to inflate it. He is obsessed with it and is a great way to get his energy out during these times that we aren't allowed to go to the park. we have been using it daily for about 2 months.",
      "rating": 5.0,
      "verified": true,
      "author": "Bekr Kasim",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "This has been one of the best purchases ever for my 4 and 2 year old grandchildren!",
      "text": "I bought this as a joint birthday gift for my then soon to be 4 and 2 year old grandchildren. It has been a HUGE hit! Was the centerpiece of Palmer's 4th birthday party (and will eventually be for Addie Beth's 2nd one....when we can all get out of social distancing)...but in the meanwhile, it has been a life saver during this shelter in place time! They play on it every nice afternoon, getting out energy and having a ball! It has been a wonderful investment...and is very easy to set up and to take down.",
      "rating": 5.0,
      "verified": true,
      "author": "CN",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Great Price, High Quality, Easy to Use.",
      "text": "It goes up within a minute. It's super easy to use. It's large. We use it inside on rainy days (you need a large room). Outside, we throw a tarp under it to keep it clean. We put balls inside of it, and let the kids try to throw them out, and Mom & Dad try to toss them back in before they make it out. It's a lot of fun. Nice to have the kids corralled in a happy space.",
      "rating": 5.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Lots of bouncy fun!",
      "text": "This was a HUGE hit at my 3 yr old's birthday party! We bought it bc it was only slightly more expensive than renting one for a single day and it was smaller than a rental which fit in our yard better. Because of rain, we actually had to set it up in our garage for the party. It worked out fine. It seems pretty durable. At one point, there were 3 grown women (not jumping) and two toddlers in it. It fit 5 kids ages 2.5-4.5 just fine. I think any more would get tight. The blower is a little loud but the kids definitely don't care. Good purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "Amazing - but watch the slit",
      "text": "So overall this is amazing! Kids love it, great size without being too big, deflates and inflates quickly and easily... HOWEVER, there is a slit in the back to enter and exit - by son leaned back on the netting and fell through/out and broke his arm.... We added zip ties to keep it closed now and the kids only ever climb in and out using the \"slide\" and works great. Just a warning for other parents with Littles.",
      "rating": 4.0,
      "verified": true,
      "author": "Jacquelyn Torres",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Holes and small tearing near stitching.",
      "text": "Great bouncy house however, we have had for only a month and I went in it with my little ones today since the weather is nice finally and I noticed several tiny holes within the bouncer. I'm not sure if it's supposed to have them or not but I also noticed some small holes that looked like they are separating from the stitching. This bouncy has been gently used and never even reached near the maximum weight limit (two small skinny toddlers and a 70 lb 11 year old). Hopefully it lasts atleast a year but with all of the holes and beginning stages of tearing...it's not looking likely. Such a bummer.",
      "rating": 2.0,
      "verified": true,
      "author": "Amanda Irvin",
      "helpful_votes": 5,
      "publication_date": 20150316
    },
    {
      "title": "Good enough for now",
      "text": "Overall its a great product, especially during the quarantine. I will say that it wear and tears easily. After only 1 hour of use from my 3 year olds I noticed fraying threads along the seams. Im also hearing a sound of air escaping from the side but I didnt see a hole.",
      "rating": 4.0,
      "verified": true,
      "author": "N1993",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Avoid",
      "text": "I cannot review the sturdiness, durability, or inflatability(sp?) because the blower did not work. I received the Shady Jumper on Wed. April 8th, and set up the jumper but the blower did not start. Tried multiple outlets, and gave it a lot more effort than a buyer should. Still no luck, I’m sure the blower is defective. When I received the box it did appear to have box tape securing all of the corners, sometimes this is an indication that the item was previously used. Now I am waiting on hold, and writing a negative review for a product. If you are like me, and loth having to jump through hurdles like this then avoid this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew Stansbury",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Bad quality",
      "text": "Very disappointed I put it on for my son birthday and just the time is one Brocken in one side of the slide didn’t even get the have fun with all the kids I had a very bad day since all the kids waiting for the bouncer house",
      "rating": 1.0,
      "verified": true,
      "author": "ounissa bedja",
      "helpful_votes": 3,
      "publication_date": 20181029
    },
    {
      "title": "Good for the Price",
      "text": "I bought this for my nieces and nephews when they come to my house. I've used it five or six times and they have really enjoyed it. It isn't the most sturdy construction, however, and right off the bat it did have a couple of leaks and has gotten a couple of more since then. So for a few smaller children (I'd say 50-60 lb or less) it is still good but if too many kids get on it or bigger kids then it does start to sag. But for the price I'm ok with it and, when they outgrow it, it will go into the garbage chute anyhow.",
      "rating": 4.0,
      "verified": true,
      "author": "H. Perez",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Easy set up!",
      "text": "We Love this! Bought it for my 3 year old twins birthday party. It’s been a huge hit. Very easy to set up and put away. The the hardest part of putting it away is stuffing it back into the bag (you kind of need two people). It’s slightly smaller than I was expecting but good for my 3 year olds. Seems good for 1-4 small children at a time. We love having the roof attached to shade the house on sunny days. Seems to be of good quality. We’ve had it for about a month and used it at least 10 times.",
      "rating": 5.0,
      "verified": true,
      "author": "Twin mommy ",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "My kids who are both under 5 years old love this. It is easy to set up and ...",
      "text": "I was reluctant to buy this because of the price but after comparing it to rental prices for bounce houses I took a chance. My kids who are both under 5 years old love this. It is easy to set up and it inflates very quickly. The sun shade is an added bonus because my back yard lacks proper shade. It even comes with a carrying case to store it. I haven't had any issues with the bounce house and we've owned it for almost a year now. I am glad I purchased this.",
      "rating": 4.0,
      "verified": true,
      "author": "S.A.",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Wonderful Backyard Addition",
      "text": "This was a gift for my grandchildren in Texas. It was am immense hit, and they love using it! The \"roof\" is a must for sun-loving areas. I highly recommend this to anyone who wants a great item to entertain young children, while they use up some of their enormous energy in an excellent way! It takes a few minutes to set up and to take down. My daughter is a master doing both!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathalee",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "Unrepairable part",
      "text": "After using it for about 15 times, one part is broken so I cannot secure it to the floor Something simple is transforming this to an insecure product. Hope they start using better quality materials",
      "rating": 1.0,
      "verified": true,
      "author": "M. Sada",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Fun & easy to assemble little bouncy house",
      "text": "Excellent outdoor bouncy house to exert energy for two 4 year old twins that have been at home for several weeks, Adhering to the ‘stay at home’ regulation. Thanks Amazon for quick delivery and for all you do for the nation during this uncertain time!",
      "rating": 5.0,
      "verified": true,
      "author": "ML",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Great Bouncer!",
      "text": "I purchased this for my 4 yr old and it's as great as I thought it would be as far as functionality. I definitely like the cover because it really cuts down on the heat and direct sunlight. I am a little worried about the durability. Some strings that sow the strips together have frayed. It should be fine for kids. Definitely don't buy this is you want to jump around with your kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Walker",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Wonderful way to keep young boys busy.",
      "text": "Our kids love this. We have it set up in the basement so they can burn off energy when the weather doesn't permit outside play. I did have to fix one seam with regular thread and one tiny tear was patched on the slide portion. The fan is of really good quality. We have had it running for hours on end. We use it nearly every day for at least a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Keisha",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Perfect",
      "text": "We got this for our Grandson. It inflates within two minutes and deflates within 5. It is much sturdier than I expected. It seems like it is made with quality products, time will tell. I am very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Kari S. Jones",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Best ever!",
      "text": "Small 6 inch tear in the seam I need to sew, but overall extremely a great price for hours of entertainment of the kids!!! Perfect for the stay home orders haha! Placed it in our basement",
      "rating": 5.0,
      "verified": true,
      "author": "M. Krisco",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Fun",
      "text": "Used a birthday party. 3-6 yr olds LOVED it and had a blast. It was bigger than I had anticipated. Easy up and down. My only complaint is that it got a tiny hole after only a few hours where the stake rubbed.",
      "rating": 5.0,
      "verified": true,
      "author": "skelton062",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "So far, so good",
      "text": "I love the roof on this thing because I live where its hot and sunny. My grandsons have abused this jumper on several occasions and it has held up so far with all 4 of them (ages 4-12) in it, along with their 270 pound dad. Its been a real crowd pleaser.",
      "rating": 5.0,
      "verified": true,
      "author": "Mimi",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Worth every penny",
      "text": "I can’t believe how easy this was to put up and down. My so. Loves it. He is 5 and about 50lbs. He and his cousin were both able to fit in the bouncy house comfortably with room for one or two more kids. So glad I purchased this.",
      "rating": 5.0,
      "verified": true,
      "author": "anita diggs",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Warranty details.",
      "text": "The 90-day warranty. When I purchased the dry Inflatable Bouncers, I was not aware of 90 day warranty from the date of purchase. Since Bouncers are generally purchased to be kept outdoors, I would have expected at least a 1 year warranty. I believe that the warranty length should be included in the product specifications or product description, as it is pertinent to the purchase decision. If I had been made aware that the warranty was only 90 days, I would not have made the purchase. No warranty length is provided at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Marcus Buck",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Awesome fun",
      "text": "Didnt know exactly what to expect but this is a must have for summer fun. I was intimidated at the thought of having my 2 year old not be able to use this as i attepted to read directions and put it up as he anxiously waited beside me. I had this up by myself (female power) in a few minutes. Very easy. My son is 2 and my nephew is 5. Plenty of room for them to jump. Oh, and deflating it and putting away was just as easy. Deflates quickly, just fold and put in bag- done!",
      "rating": 5.0,
      "verified": true,
      "author": "madsam",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "WOW!!!",
      "text": "This is made very well. Both parents have got in with the kids and this bouncy house is mighty. Just so happy with the whole package. The blower is really powerful. We are all happy.",
      "rating": 5.0,
      "verified": true,
      "author": "ToniB",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "super easy setup and tear down",
      "text": "This bounce had tears in the seems when it arrived. It arrived very fast, super easy setup and tear down. If it didnt have the tears in the seems and if I wasnt expecting more than 4 kids to use It I would have replaced it instead of buying a bigger bounce house.",
      "rating": 3.0,
      "verified": true,
      "author": "Bill Russell",
      "helpful_votes": 2,
      "publication_date": 20170726
    },
    {
      "title": "Good quality for this price point, looks impressive and kids love it",
      "text": "Game changer! For 200 bucks it’s really hard to ho wrong with this purchase. Its a great size for kids and looks impressive. Is it professional quality, nope but its still pretty durable and more importantly i can move and set this up by myself in less than 4mins.",
      "rating": 4.0,
      "verified": true,
      "author": "Mj1231",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Great fun for the kids!",
      "text": "Have used it over a dozen times over a month and a half and so far so good. My daughters love it. Very easy to put up and put away (5 min) with an oversized bag for easy storage.",
      "rating": 5.0,
      "verified": true,
      "author": "David L.",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Love it!!!",
      "text": "Oh what fun they have!!! They get excited just watching it inflate!!! My only concern is when my 1 1/2 year old and 4 year old lean on the opening with the velcro. I’m afraid they are going to fall out. Just make sure the Velcro is connected properly and it’s fine. Spend the extra money for the canopy! It is high enough to accommodate even a 9 yr old.",
      "rating": 5.0,
      "verified": true,
      "author": "vincent",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Great at home bounce house",
      "text": "Love this bounce house! My kid and her friends love it. So easy to inflate and deflate. Literally inflates in under a minute and deflated and put up in under 5 min. Also I’m rainy days it fits in our garage or on our patio.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Gaar",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Hours of fun.",
      "text": "The children love jumping and playing in this playhouse. It was a great gift that will continue to give for years to come. The tarp for underneath the jump house is imperative.",
      "rating": 5.0,
      "verified": true,
      "author": "Lake Lover",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Hours of entertainment",
      "text": "This bounce house is amazing! So easy to set up, and it provides hours of entertainment for the kids. Fits easily in the storage bag so it’s easy to put away. We live in South Georgia so it gets very hot down here in the summer. The top on this provides nice shade which keeps it from getting too hot and burning their little feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Adele Caldwell",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Good product",
      "text": "My kids love it. I bought it for my daughter's 2nd birthday. It was bigger than I expected, no issues so far and my girls are rough.",
      "rating": 5.0,
      "verified": true,
      "author": "Kisha Carter",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Fits Four Great Easy Set Up",
      "text": "Easiest set up and take down. Kids loved this we have four kids 2-7 and they all played in here spacious !",
      "rating": 5.0,
      "verified": true,
      "author": "Richardsons",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Doesn’t stay inflated.",
      "text": "It is easy to set up and get going, but the Product is made of cheap material and doesn’t inflate like it is supposed to. I returned mine because I felt that it wasn’t safe for my two small kids to jump on. The fan could be stronger to help with this, but save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Danny Young",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Fun, durable, and EZ!",
      "text": "We are really pleased with the durability and design of this bouncy house. Was made to be easy for parents to set up and let the kiddos have fun. Just follow the guidelines of how to use and care for it and it does the trick, every time. Happy with this purchase for what it does and the price offered.",
      "rating": 5.0,
      "verified": true,
      "author": "Smith",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "I got gypped BIG TIME",
      "text": "I really got gypped. I opened the box with supposedly the little tykes jump and slide bouncy house. All it had inside of it were three tarps, a blue one, a yellow one and a green one, with a big piece of molding clay wrapped up inside of each one and secured with tape. Ruined my kid’s bday party.",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle Morton",
      "helpful_votes": 3,
      "publication_date": 20180207
    },
    {
      "title": "Love",
      "text": "Hands down best entertainment for a 3 yr birthday. Watch out for the older bratty kids.... best for toddlers. Shade cover is super important to keep sun off kiddos",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Great jumpy house",
      "text": "Easy to set up and seems pretty durable so far. We had several kids in it ages 1 to 7 during an afternoon party and it held up well to a lot of jumping. It’s fairly quick to disassemble as well. Exactly as described. Not too large to store either.",
      "rating": 5.0,
      "verified": true,
      "author": "Marisa   SF",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Easy set up take down",
      "text": "Good bounce house for the price. My 3 yo loves it. Great quality. Set up and take down takes 5 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason ",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Worth the Money",
      "text": "After finding out how much it would cost to rent a bounce house for my son's fourth birthday, I decided to buy this instead. There were only about 6 kids who would be bouncing in it, so I thought it was worth a try. I worried that this bounce house would be cheap and wouldn't hold up for the day like a commercial bounce house would. I was wrong! Although only about 3 -4 kids should really be in there at once, it's not a problem since there is a slide and the kids are constantly getting in and out of it. After a few weeks of playing in it quite a bit, it is still in great shape.",
      "rating": 5.0,
      "verified": true,
      "author": "MyHumbleOpinion",
      "helpful_votes": 0,
      "publication_date": 20110808
    },
    {
      "title": "Perfect for my 3yr old twins!",
      "text": "We bought this for our twins 3rd birthday. When they turned 2, I had purchased an inflatable jumper that was much smaller and popped after only a few months. This was more expensive, but I thought it was worth it for the at home entertainment, esp in winter or summer. They LOVE it. It's easy to inflate and deflate and store. It's definitely big enough for 2 3yr olds and probably 1 more. It's fairly large. It just fit in our family room, but we've since moved it to the basement for ease of storage and inflating. Perfect for keeping kids active when it's too cold/hot/wet to play outside!",
      "rating": 5.0,
      "verified": true,
      "author": "C. Sharer",
      "helpful_votes": 0,
      "publication_date": 20091124
    },
    {
      "title": "Awesome bounce house! Great price!",
      "text": "Bought this for my 3 year old's birthday and it's great! All the kids fit in it and had a blast. Her and my 18 month old play in it daily now. We set it up in our garage so we can turn it on whenever they feel like playing in it. I'm 5'3 and 115 pounds and play in it with them. I don't catch a lot of air or anything when I jump but i can bounce around and have fun with them. The slide is also fun for me and the kids love going down it over and over.",
      "rating": 5.0,
      "verified": true,
      "author": "Kay0115",
      "helpful_votes": 0,
      "publication_date": 20150208
    },
    {
      "title": "Brings lots of joy and memories.",
      "text": "3 yr old and 1 yr old grandchildren love it. Easy to setup and put away. Takes 1 min to pull out of basement closet and inflate and 3 minutes to deflate, fold up and slide back in closet. Brings lots of joy and memories.",
      "rating": 5.0,
      "verified": true,
      "author": "SC3",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Can't say enough good things. This bouncy is small enough to be ...",
      "text": "Can't say enough good things. This bouncy is small enough to be manageable but large enough for many kids to play. It packs up easily, inflates easily, and we even put it inside our living room completely inflated during a snowstorm last year so the kids could get some energy out. It's tough, too. Literally hours of good times in this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeannine",
      "helpful_votes": 2,
      "publication_date": 20151013
    },
    {
      "title": "AMAZING!",
      "text": "I wanted something that would be a great gift for my 2 year old and also durable enough for my home daycare kids to play in! They've had a BLAST! It sets up in less than a minute and is very durable; along with being WAY BIGGER than I expected! We got it about a week and a half ago and the kids have seriously played in it nearly every day! Way worth the money versus a rental already!! I also love that we went with the shady roof one :) Easy set up, easy takedown! Above all...AMAZING TOY!",
      "rating": 5.0,
      "verified": true,
      "author": "AWard",
      "helpful_votes": 0,
      "publication_date": 20130918
    },
    {
      "title": "and I'm so glad we did",
      "text": "We replaced our original Little Tikes bouncer without the sunshade with this one, and I'm so glad we did. I love the extra sun protection on this, which was always my major concern on the last bouncer. We use our bouncer ALL the time, and it has proven to be the best purchase ever. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "SM",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Awesome product",
      "text": "Purchased this for my goddaughter this past Christmas. She simply loves it. Bounce house comes with the blower and even a pretty good storage bag. Far exceeded my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Alberto Ros",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Get it and be the hero of any backyard birthday party",
      "text": "This is so great! It is simple to set up and only takes about 20 seconds to inflate. Also the blower cord is long, so we don't need an extension cord to reach out in the yard. I love the roof for keeping it shady too.",
      "rating": 5.0,
      "verified": true,
      "author": "Turkey",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Buy it!",
      "text": "Best Christmas present ever. We have the fun house now for family parties! Inflates in less than 1 minute We use ours inside in the playroom",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Love it",
      "text": "Got this for my nephew for his birthday party! All the kids loved it and still love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Great buy!!",
      "text": "We got this as a Christmas present for our girls. They love it. It takes no time to inflate. But remember to stake it down on windy days. We had to learn that the hard way. Great because it has shade from canopy. The kids love climbing all over it.",
      "rating": 5.0,
      "verified": true,
      "author": "RD",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Perfect during quarantine",
      "text": "My almost 3 year old is in this everyday since we got it. We fortunately have room indoors, will help when the Texas summer starts. Great investment during this pandemic time.",
      "rating": 5.0,
      "verified": true,
      "author": "Leizel",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Oh Yeah!",
      "text": "If you don't have one, get one! Kids cant get enough of this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "MARIE HOOD",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Totally worth it",
      "text": "When you take it out of packaging it seems difficult to put together. However, instructions are clear and it took much less time than expected",
      "rating": 5.0,
      "verified": true,
      "author": "Hebert Claude",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Endless Fun!",
      "text": "What a HIT!! My Kids LOVE this thing. They are 1, 3 and 5 and each of them get equal enjoyment out of it. Very simple to set up and take-down. We are meticulous about ensuring it stays clean on the inside and does not get wet so that it will not mildew. We plan to get many years of enjoyment out of this!",
      "rating": 5.0,
      "verified": true,
      "author": "Stay-at-home Beach Momma",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "Great for parties and just having a fun day",
      "text": "I have a two year old and she loves this thing. It was a huge success at her birthday party. Does not fit very well back in the box after you use it, but what does.... Just make sure you have lots of room.",
      "rating": 5.0,
      "verified": true,
      "author": "Chenslee",
      "helpful_votes": 0,
      "publication_date": 20170506
    },
    {
      "title": "So much fun",
      "text": "So much fun. Really sturdy! Easy out of the box.",
      "rating": 5.0,
      "verified": true,
      "author": "VK",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Blower blew on first inflation",
      "text": "The blower “popped” and emitted an acrid burning smell, 15 seconds into the very first inflation of the bounce house. The children were watching. The aftermath continues to be a horror-show. No support on the weekend. Could not be more disappointed. You do not want to know how the kids feel about the experience.",
      "rating": 1.0,
      "verified": true,
      "author": "Bailey Gilligan",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Great investment through the seasons!!",
      "text": "Wonderful quality!!! Great through the ages!! I recommend this version with the added layer of sub barrier for little ones. It’s not SPF but every layer helps protect their skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Organizer101",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Every child must have this!",
      "text": "This thing is the best investment ever!!!!!! My daughter loves it. She uses it every single day and rather uses her jumpy than going to the park. I love this thing. I'm 220lbs and this thing hold me inside with her no problem at all. I don't jump I just crawl in there with her but it's very very durable and easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Fun option for backyard entertainment",
      "text": "Great option for the kids to enjoy outdoors. Expected it to be sturdier and better quAlity of material. Best ROI, though! Three of the four toddlers have put it to great use",
      "rating": 5.0,
      "verified": true,
      "author": "Silvia Ortiz",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "We bought this for my youngest daughter's second birthday. ...",
      "text": "We bought this for my youngest daughter's second birthday. It was a big hit! Her 4 year old sister loves it as well! We have used this outside, but we primarily use this in our basement. It literally inflates in seconds and the kids have a blast getting energy out on cold days when outside play is not an option. I wish I would have bought this two years ago!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jjn2011",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "Durable",
      "text": "Durable and fun! This is my third purchase of these so I know how fun it is for the boys. They love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Roy Tait",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Great purchase! Super easy setup and take down",
      "text": "Great purchase! Super easy setup and take down. There were 4-5 toddlers in it with plenty of room to bounce and play. There are some places at the seams where the stitching seems to be coming undone. I noticed it right when we took it out of the box to set it up, before it had been used. I was disappointed to see that, so I am a little worried about durability. We've only used it once, but it held up well and the stitching didn't get any worse. I would definitely give it 5 stars, but am giving it 4 because of the quality of stitching coming right out of the box.",
      "rating": 4.0,
      "verified": true,
      "author": "rmb",
      "helpful_votes": 0,
      "publication_date": 20161001
    },
    {
      "title": "Best Purchase!",
      "text": "We have a heated garage and two young kids with winter birthdays - this has been perfect to set up when we can't get outside and we can't wait to bring it outside once it warms up - and up to our cabin!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Johnson",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Perfect on all accounts",
      "text": "This is a very sturdy product and our daughter loves it. Absolutely no issues and highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Totally worth it",
      "text": "This is a great bounce house ! Kids love it it’s easy to inflate and take down. Worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Charlotte",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Easy to set up and break down",
      "text": "Super easy to set up! Great for toddlers and even some small 5 or 6 year old!",
      "rating": 5.0,
      "verified": true,
      "author": "shoeicide",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "I'm came out good, kids love it",
      "text": "I'm came out good, kids love it. And have fun with it. I had it out at a party and just let little ones get in and it did good. I say it's for kiddos under 5 only",
      "rating": 5.0,
      "verified": true,
      "author": "Fonzie",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "Long-lasting Product",
      "text": "I love this product and have owned it for 3 years. Great for children of all ages (even adults), just heed manufacturer's limits and warnings. Very durable construction and blower fan works like new after years of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Deb Fizz",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Shade is nice for sunny weather, but won't be good for stargazing",
      "text": "Perfect for the 1-6 year old age range. Easy backyard entertainment. Good value compared to renting a larger bounce house if your kids are still in this age range. The canopy version is nice if you don't have a shady yard.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah C",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "So happy I purchased",
      "text": "Purchased for my grandsons’s 2nd birthday! It’s his new favorite thing to do. We add some balls from his ball pit and he doesn’t want to leave. Parents love it because he plays hard and sleeps great.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ann Zohouri",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "great product!",
      "text": "I waited for this to come back in stock as it was recommended by a friend. I wanted this model because of the shade cover. I highly recommend this bounce house. I never give reviews so if I do that means it was an amazing product",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Great bounce house!",
      "text": "This thing is great for kids! The 250 lb weight limit gets tested if the tie isn’t tight enough in the blower. It will fly off and deflate. Super sturdy otherwise!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Six",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Kids Love It",
      "text": "This thing is awesome. Can handle 4-5 toddlers at once. Bought this instead of renting for a bday party.",
      "rating": 5.0,
      "verified": true,
      "author": "M.Taylor",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Excellent Product",
      "text": "My wife and I were in the market for a bouncer for our one year old twins and two year old toddler. I found this on line and cannot be happier. The shade is a very nice feature, even in the rain-soaked Pacific Northwest. Set-up is a breeze....it takes less than a minute to inflate after being unrolled and properly placed. The kids absolutely LOVE it and I am looking forward to using it over the next several years. Well constructed and quality materials ensure that we will be able to do just that.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Daw",
      "helpful_votes": 0,
      "publication_date": 20110922
    },
    {
      "title": "Perfect for 3 children",
      "text": "Super easy to set up, take down and run. Very sturdy and large enough for 3 kids aged 6 to 1 years old.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Inside and outside, great toy!",
      "text": "My son got this for his 3rd B-day and loves it. We have used it at his B-day party (Four 3 yr olds were in it), inside the garage the whole winter, at multiple playdates, and in the spring we used it outside (we put a blue tarp underneath to prevent something poking a hole in it). It blows up superfast and stores away very nicely as well when not in use. Good buy, hopefully it will hold up until our next son gets big enough to use it too:-)",
      "rating": 5.0,
      "verified": true,
      "author": "S.N.",
      "helpful_votes": 0,
      "publication_date": 20110714
    },
    {
      "title": "Money well spent",
      "text": "I purchased this item for my 2yrs old grandson He said to me MAMA this is the bestest(lol) surprise I love it MAMA.I love it too I like the fact that it has a top on it that way he is not in direct sunlight.He is in this bounce house EVERY day I’ve couldn’t have made a better purchase",
      "rating": 4.0,
      "verified": true,
      "author": "Julia Smith",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "This is simply AWESOME. The kids love it (I mean",
      "text": "This is simply AWESOME. The kids love it (I mean, its a bouncy castle in the backyard - what's not to love?). The pleasant surprise was how simple it is to set up and take down. They give you a bag to store it in which I figured we'd never get it back into once we blew it up the first time but it fits back in easily. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "wanted More",
      "helpful_votes": 0,
      "publication_date": 20150605
    },
    {
      "title": "Value to fun ratio is awesome!",
      "text": "Best money spent for my son's birthday party. Very easy to setup and take down. Comes with it's own storage bag similar to a air mattress. I like this one more than other because it has a roof and it gets hot in Texas.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonian",
      "helpful_votes": 0,
      "publication_date": 20160811
    }
  ],
  "product_meta": {
    "title": "Little Tikes Shady Jump n Slide Bouncer",
    "description": "The Little Tikes Shady Jump 'n Slide bouncer is a backyard inflatable with an arching shade canopy for bouncy fun in the sun! This inflatable bouncer features a slide and large bounce area covered by a protective canopy. Kids can play together and get great exercise in this timeless bounce house. The mesh sides help keep kids on the bouncing surface.\n\nFeatures: \n• Arched canopy provides constant shade\n\n• Two mesh doors (on back) for easy entrance into unit\n\n• Side mesh pockets for shoe storage and other items\n\n• After inflation, blower must run continuously while children are playing\n\n• Bouncer must be anchored firmly in place\n\n• 7-foot wide jumping surface\n\n• Maximum number of children: 3\n\n• Maximum combined weight limit: 250 lbs\n\n• Product Size: 144.00''L x 108.00''W x 72.00''H\n\n• Accessories include:\n\n* 1-Heavy-duty blower with GFCI plug\n\n* 1-Repair kit\n\n* 1-Storage bag\n\n* 4-Blower stakes\n\n* 6-Bouncer stakes\n\n• 90 Day Limited Warranty from date of purchase on polyester inflatable fabric bouncer\n\n• 1 year Limited Warranty from date of purchase on blower\n\n• Refer to instruction booklet for set-up, storage, maintenance and care\n\n• Designed for home outdoor use only!",
    "rating": 4.6,
    "feature_bullets": [
      "Large, 7-foot padded arena for bouncer fun, and slide to exit",
      "Arched canopy provides constant shade;Inside bounce area to max height of roof: 67.00 inches Height",
      "Three mesh slides protect children, and let parents watch the fun;Inside bounce area: 85.00 inches Length x 71.00 inches Width",
      "Stakes anchor the bouncer firmly in place, while a heavy-duty blower provides continuous airflow",
      "Built of puncture-resistant material.Inside bounce area to max height of roof: 67 inch H"
    ],
    "specifications": {
      "Product Dimensions": "108 x 144 x 72 inches",
      "Item Weight": "38.3 pounds",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "ASIN": "B003NSBMV2",
      "Item model number": "620089X1",
      "Manufacturer recommended age": "36 months - 8 years",
      "Best Sellers Rank": "#30,928 in Toys & Games",
      "Customer Reviews": "4.6 out of 5 stars903 ratings4.6 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "April 1, 2009",
      "Mfg Recommended age": "36 months - 8 years",
      "Department": "ToysAndShoes",
      "Manufacturer": "Little Tikes"
    },
    "categories": [
      "Toys & Games",
      "Sports & Outdoor Play",
      "Inflatable Bouncers"
    ],
    "price": 299.99
  }
}