{
  "website_summaries": [
    {
      "verdict": "The fact that you have to be careful with these lightweight sunglasses shouldn't stop you from considering them – more affordable but still offer the crisp vision wearers love about the brand.",
      "pros": [
        "The extremely lightweight build, sleek minimalist design, and protective polarized, glare-proof lenses make these Maui Jim sunglasses an excellent choice for men who want to save a few dollars"
      ],
      "cons": [
        "Frameless lenses are delicate, and extremely thin stems are flimsy",
        "May not suit men who prefer smaller lenses"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Finest Pair Of Maui Jims I've Purchased.",
      "text": "This is my third purchase from Amazon and the first from Cove Creek Outfitters of these same, Maui Jim HCL Bronze Lighthouse sunglasses. My first two pairs lasted many years but arrived feeling flimsy and easily breakable. Perhaps MJ has improved on its frame design because these glasses are ultra-sturdy and strong. The lenses are spectacular! Pricey, yes, but worth every dollar. If you want to see the world in a beautiful way, you must own a pair of Maui Jims. And if you go with Lighthouse Bronze you will look good in a beautiful way also.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 3,
      "publication_date": 20200331
    },
    {
      "title": "Questionable whether these are genuine Maui Jim sunglasses",
      "text": "I have had multiple pairs of Maui Jim Lighthouse Sunglasses, and was buying a second pair as a backup. When these new ones arrived, I compared them to the sunglasses I bought directly from the Maui Jim website. The lenses are significantly larger, and the lettering/ words on the sunglasses arms so not read the same. There are not two different sizes of these sunglasses on the Maui Jim website. This causes me to believe that these sunglasses are knockoffs. I have returned them for a refund. I will order another pair from an authorized Maui Jim dealer, and pay full price. Sometimes when a deal seems too good to be true, it probably is....",
      "rating": 1.0,
      "verified": true,
      "author": "Cabin Guy",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Very comfortable",
      "text": "These glasses are great! They are so lightweight I don't even feel them on my face. I had one pair for at least 3 years but I lost them on a trip. I tried on several cheap pairs at a local store but ended up buying a new pair of Maui Jims. One thing to consider is Maui Jim's customer service. If you lose a nose pad, they will send you new ones for free. I broke a temple on a pair and for $10 I sent them in and they replaced them.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 4,
      "publication_date": 20171016
    },
    {
      "title": "Don't HEM Me In!!!",
      "text": "Nothing to dislike and everything to like. I just gave a second pair as a gift and this is the best idea ever! The color s down to the lenses can be chosen!! This rimless pair clear is wonderful because no one can see it and you cannot feel them on your face which means no suffering and sliding and very little sweat!! What a way to greet the sun!",
      "rating": 5.0,
      "verified": true,
      "author": "Paschal Fougeray",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Best I've Ever Owned",
      "text": "The best pair of sunglasses I have ever owned. The amber lenses allows me to wear them on overcast days without my view becoming too dark. They are so light that I sometimes forget that I am wearing them. My ophthalmologist recommends them and I feel that my eyes are being protected from glare and harmful ultraviolet rays. I find it best to clean them as instructed.",
      "rating": 5.0,
      "verified": true,
      "author": "Logos 7",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Great seller, great sunglasses..........for women too!",
      "text": "I love, love, love these sunglasses. As a female, they fit my face perfectly. I had actually bought a pair of these years ago and this year while tapping our maple trees, I lost them in the woods (still hoping to find them in the spring!). The last pair I had, I had for 3 years. If you take care of them they will last you for years. Worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Raymond",
      "helpful_votes": 3,
      "publication_date": 20170305
    },
    {
      "title": "Lenses scratch too easily",
      "text": "I really like these sunglasses and they are incredibly comfortable but but I can't justify the cost when a fall from my head to a wood deck scratches them as badly as it did. I'm pretty careful with sunglasses and have another pair (different brand) that are over 6 years old.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Terrible quality",
      "text": "These are VERY VERY thin frames and very flimsy. I've had three (3) other Maui Jim sunglasses and have always liked them. I keep a pair in each car. This pair is so flimsy that I'm afraid that they will fall apart everytime I put them on. Don't waste your money buying these - wish I hadn't!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Joy",
      "helpful_votes": 2,
      "publication_date": 20191003
    },
    {
      "title": "Best sunglasses out there.",
      "text": "This is my fourth pair, not because they are poorly made, but because I am not careful. They are well made, the most comfortable and lightweight sunglasses I have ever owned and they have great coverage and the best Polarized lenses on the market. They also look great.",
      "rating": 5.0,
      "verified": true,
      "author": "SSSNES",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Not as advertised.",
      "text": "Not as described!! These are actually Sugar Beach. And hands down the crappiest Maui Jim’s I’ve ever had. 10 year wearer. Nosepiece is not attached to lenses properly. Arm fell off right side 2nd day wearing.",
      "rating": 1.0,
      "verified": true,
      "author": "Brandi",
      "helpful_votes": 3,
      "publication_date": 20190730
    },
    {
      "title": "A quality product and a company that stands behind it!",
      "text": "I think Maui Jim sunglasses are expensive, but they are high-quality. The best part about Maui Jim is that you can send in your sunglasses for repair if they break or the lenses get scratched. The cost of repair is VERY reasonable versus having to shell out for new sunglasses. Individual style preferences differ, but I love my Lighthouse Maui Jims and wouldn't consider buying another brand.",
      "rating": 5.0,
      "verified": true,
      "author": "rkroeber",
      "helpful_votes": 4,
      "publication_date": 20170116
    },
    {
      "title": "Loving my new shades",
      "text": "Used to be an Oakley guy but I like the way the world looks better thru my new MJs. The brown ones really make color pop and handle lower light situations well. I somehow lost one of the nose pieces, not to worry, just went to the MJ website and they shipped me new ones for free, no cost or shipping cost. Really cool, great customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Andrews",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Great quality & lightweight",
      "text": "Love these. I don’t do well wearing eye glasses or sun glasses as they give me headaches. These are so lightweight and comfortable. Easy to wear for long periods of time especially since I have sensitive eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "Biker Parents",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Love them! I've always purchased cheap sunglasses that ending ...",
      "text": "Love them! I've always purchased cheap sunglasses that ending up wearing poorly. Finally made myself spend the money on quality. So glad I did. These are so light weight I barely know I have them on. I love the frameless lens, the lens color is fantastic, just the right shading. Comes with protective soft bag and hard case.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "The Best Brand Ever!!!",
      "text": "These are perhaps the best sunglasses I've ever owned. I've been wearing Maui Jim Sunglasses exclusively now for about 3 decades, and do not see any reason to purchase any other brand. I would strongly recommend this product. They are extremely light weight and very nice looking. I had to surrender this pair to my Nephew... well, actually I simply forgot to ask for their return. They look better on him!",
      "rating": 5.0,
      "verified": true,
      "author": "Shooki",
      "helpful_votes": 0,
      "publication_date": 20160728
    },
    {
      "title": "Counterfeit",
      "text": "Sent my sunglasses to Maui Jim for repair after the polarization was chipping off the lenses. Maui Jim confirmed these are counterfeit sunglasses. Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Kara Wattenbarger",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "These are the best ever!",
      "text": "This is my husband's third pair of Maui Jim sunglasses (yes, he's a little hard on them!). These are the most resilient, flexible, light and stylish pair he's had. He loves them and so do I!",
      "rating": 5.0,
      "verified": true,
      "author": "Lanita Legan",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Awesome as Always",
      "text": "I have owned a couple of pairs of these before and each pair are great. This pair was no exception. I love the fit and they’re light weight. The quality is exceptional.",
      "rating": 5.0,
      "verified": true,
      "author": "Wm",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Protection vs. Appearance",
      "text": "The actual sunglasses do not look like the picture. The lens appear to be more bronze and almost mirrored in the image. However, upon arrival, they are much darker and also bigger. I initially started a return based on the appearance alone. However, I decided to wear them. They are really nice, as far as clarity, being lightweight, & protecting my eyes. So, at this time, I am keeping them!",
      "rating": 3.0,
      "verified": true,
      "author": "KFS",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Great glasses",
      "text": "Don’t even realize they are on. Great pair of glasses as long as I don’t loose them!",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Millice",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Eye Protection from The Sun",
      "text": "I had been to a retina specialist so my pupils were very dilated; usually that is really a problem driving back home. These sunglasses keep out the sun glare so effectively...the drive was not that bad. A couple of days later I had to wait in an entrance line in the sun and could easily read an article in a magazine. Sometimes sunglasses are dark so they make reading difficult.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Very flimsy. Doesn't seem authentic.",
      "text": "I just received this item and I do not believe it is an authentic Maui Jim. It seems very flimsy and came in an odd eyeglass case. I paid full price for authentic and may return these or would like a discount.",
      "rating": 1.0,
      "verified": true,
      "author": "shirley klinghoffer",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Polarize coat is bad",
      "text": "Polarize coat is not what you would expect from Maui Jim’s product quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Brian H.",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "LOVE these sunglasses!",
      "text": ":LOVE, LOVE these glasses! The brown tint makes everything bright and more colorful. You literally can't feel them on your face. They are amazing. This is my second pair (dropped something on top the first pair). Nothing else compares!",
      "rating": 5.0,
      "verified": true,
      "author": "CareBear",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "I find them to be exceptionally lightweight and comfortable to the point it's easy to forget I'm wearing ...",
      "text": "This is my second pair of Maui Jim Lighthouse sunglasses. The first was purchased at Sunglass Hut and I definitely overpaid. I dropped these sunglasses on concrete several times before they began to show any trace of flaws. I find them to be exceptionally lightweight and comfortable to the point it's easy to forget I'm wearing them. I still have my original pair, but use them only as a loaner or backup.",
      "rating": 5.0,
      "verified": true,
      "author": "Hemlar",
      "helpful_votes": 0,
      "publication_date": 20150330
    },
    {
      "title": "Five Stars",
      "text": "I like these better than more expensive Maui Jim models I wore out.",
      "rating": 5.0,
      "verified": true,
      "author": "My Pen name",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Well worth the sacrifice of paying a little more!!!!!!",
      "text": "I love these glasses, so light weight and comfortable. They were recommended to me by my daughter. I am so happy with them. A little expensive for me, but I am so happy, I recently had to have eye surgery. I will make payments and enjoy my glasses. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "sandra branam",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Love them",
      "text": "Love these glasses I have always bought cheaper ones because I tend to lose them I wanted something light weight brown lenses that fit my face and had clarity. These for me fit all wants. I would recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Classic feel and look",
      "text": "Very light and sporty. While wearing them, you almost and sometimes do, forget that you have them on. Highly recommended to anyone because it fits all head/face sizes unlike others.",
      "rating": 5.0,
      "verified": true,
      "author": "BobboNJ",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Light, comfortable and look great!",
      "text": "I have had these for nearly two years, and I love them. They are super light, and very comfortable. They have held up well to nearly daily use. After almost two years, there are slight cracks were the bridge connects the two eye pieces, but it has yet to be an issue. The polarization is great for cutting out glare when driving or seeing under the water when spot-fishing. They are so light and comfortable, that I can easily wear them all day. If I loose them, or if they were to break; I would definitely get another pair.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Robinson",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "👍🏽👍🏽👍🏽👍🏽👍🏽",
      "text": "Super lightweight Feels like you’re not wearing them Crisp view",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Love these sunglasses",
      "text": "Love these sunglasses. So light and feel great on. Vision is great. Cuts down glare. They are a little fragile though so take care. I broke a set ...but liked these so much I had to have another. The brown color looks good too.",
      "rating": 5.0,
      "verified": true,
      "author": "trs80",
      "helpful_votes": 0,
      "publication_date": 20151231
    },
    {
      "title": "Maui Jims always",
      "text": "All I ever wear. Its a bummer when you loose a pair. $$$$$",
      "rating": 5.0,
      "verified": true,
      "author": "Mjones",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Great value",
      "text": "These were a gift for my boyfriend. They were amazing. He was very happy",
      "rating": 5.0,
      "verified": true,
      "author": "Kim G",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Love these Maui Jim's",
      "text": "These glasses are very light and I don't even feel them when they are on. I play a lot of tennis and they are exactly what I was hoping for. And they look great!",
      "rating": 5.0,
      "verified": true,
      "author": "Laury Browning",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Flexible Temples",
      "text": "Great sunglasses. The temples are very flexible so they are a little hard to put on one handed, but they are still very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "PrimeExample",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Light and effective",
      "text": "Great, light sunglasses. Make sure to use case, as they can break fairly easily. Super for running or other sorts.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo-Ann F.",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "These things are so awesome that I even wear them when it's raining like ...",
      "text": "These things are so awesome that I even wear them when it's raining like a douche. Better to see the world all rosy than all grey and they really make the colors of the leaves standout in fall. Very flexible and durable too. Combined with the warranty, these are worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy Bob",
      "helpful_votes": 2,
      "publication_date": 20151107
    },
    {
      "title": "Cheap case and lens cloth",
      "text": "Disappointed in the quality of the case and lens cloth. A significant reduction versus previous years versions. Very disappointing",
      "rating": 3.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "My husband’s favorite!!",
      "text": "Our 4th pair. First was chewed up by the dog, second pair was stolen, the third pair was sat on and broken...love them so much we keep ordering them.",
      "rating": 5.0,
      "verified": true,
      "author": "Gayanne Coleman",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "lightweight sunglasses",
      "text": "The quality of product on the perfect position. Sunglasses did not hooked. İf you are looking for this items my suggestion buy from this seller.",
      "rating": 5.0,
      "verified": true,
      "author": "tural1990",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Husband loves them!!",
      "text": "My husband loves these sunglasses. He lost his other pair and had to get new ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Ochoa",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Awesome sunglasses.",
      "text": "Love these sunglasses. This is my second pair of these. They are light weight and do not hurt my ears due to the slender ear pieces.",
      "rating": 5.0,
      "verified": true,
      "author": "Tricia Base",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Best sunglasses ever!",
      "text": "This style of Maui Jim Sunglasses are my absolute favorite! They fit perfectly, are light and flexible. I sadly broke the frame of my original pair and was thrilled to find a brand new replacement on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Designden",
      "helpful_votes": 0,
      "publication_date": 20150717
    },
    {
      "title": "He says this pair is much better than what he had before",
      "text": "Got these for my husband who only wears this brand and lost his last pair. He says this pair is much better than what he had before. He says these have three tones to them.",
      "rating": 4.0,
      "verified": true,
      "author": "Thabisile",
      "helpful_votes": 0,
      "publication_date": 20150315
    },
    {
      "title": "Expensive -- But A Good Choice If Less Expensive Brands Do Not Fit",
      "text": "A good choice. Expensive, but it was the only one that provided proper fit for my wife.",
      "rating": 5.0,
      "verified": true,
      "author": "Radio Dave",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "We both love them.",
      "text": "I have these in black and my wife has them in brown. We both love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew W.",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "Great glasses and good deal",
      "text": "Not a fan of expensive glasses typically. After months of searching for the perfect set for my shape of face the maui jim lighthouse was the best option. I did find them at sunglass hut, and since I was able to try them on there I patiently waited for a sale to no avail. If I include taxes the savings over sunglass hut's retail price was $90. This is my first pair of maui jims and I now see why they are priced high, although it still seems a bit ridiculous to spend so much on glasses when the cost of production in japan is likely under $10. Outside of cost I am a big fan of the glasses.",
      "rating": 5.0,
      "verified": true,
      "author": "TD",
      "helpful_votes": 0,
      "publication_date": 20130724
    },
    {
      "title": "Try them you'll love them.",
      "text": "I love them. They are light, deflect the light and sun, and they look good on me. I recommend people try them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "Great sunglasses",
      "text": "Light, flexible, great visibility, rests eyes from sunlight. Durable, attractive. Love them",
      "rating": 5.0,
      "verified": true,
      "author": "Erin Mas",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Very nice sunglasses. Maui Jim makes some of the best ...",
      "text": "Very nice sunglasses. Maui Jim makes some of the best for the money sunglasses you can buy--in my opinion. Also light weight, so no stress on the nose.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "I really like these glasses",
      "text": "I really like these glasses. They are comfortable to wear. They are not heavy on the bridge of my nose. They provide excellent coverage on sunny days.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170604
    },
    {
      "title": "Perfect Style, color and degree of darkness",
      "text": "I love them... they are so lite I forget I have them on!!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Julie N A",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Quality & Style",
      "text": "Maui Jim are top quality, these don’t disappoint, I love them. Very stylish!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Great sunglasses",
      "text": "This was a replacement pair.... so light and great polarized lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Raymond S. Mcleod",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Love Maui Jim sunglasses but I need smaller lenses",
      "text": "Too square and large for my face. Love Maui Jim sunglasses but I need smaller lenses.",
      "rating": 2.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20170216
    },
    {
      "title": "Five Stars",
      "text": "Best pair of Maui Jim's ever. This is my 3rd pair",
      "rating": 5.0,
      "verified": true,
      "author": "PAC",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "very nice..",
      "text": "There as describe, very nice... prob would of bought a tad larger size for me",
      "rating": 4.0,
      "verified": true,
      "author": "TR",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "Maui Jim Lighthouse Sunglasses",
      "text": "Great sunglasses! Super light but gives plenty of coverage. I can wear these sunglasses all day.",
      "rating": 5.0,
      "verified": true,
      "author": "IdahoGirl",
      "helpful_votes": 0,
      "publication_date": 20150728
    },
    {
      "title": "Five Stars",
      "text": "My husband loves the fitting and the color lenses is very calming",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Landaverde",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "Fragile",
      "text": "I like them. Third pair. They scratch really easy though. Have to be careful w them.",
      "rating": 4.0,
      "verified": true,
      "author": "BuddyG",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Not as advertised with case",
      "text": "Love the glasses but they did not come as advertised with the brown case or inner sleeve.",
      "rating": 4.0,
      "verified": true,
      "author": "Leslie",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Maui Jim are the only sunglasses I will own. ...",
      "text": "Maui Jim are the only sunglasses I will own. I've had Revos, oakleys and ray bans. Nothing companies to the lens and quality. The service and repair department are outstanding. Cannot complain. You will be happy",
      "rating": 5.0,
      "verified": true,
      "author": "eugene matthews",
      "helpful_votes": 2,
      "publication_date": 20150317
    },
    {
      "title": "Five Stars",
      "text": "They are perfect which surprised me because, after I ordered them, I noticed it said MEN'S.",
      "rating": 5.0,
      "verified": true,
      "author": "marsha kraushaar",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "Sunny Side",
      "text": "You cant beat Maui Jim. The reseller delivered as promised",
      "rating": 5.0,
      "verified": true,
      "author": "CB",
      "helpful_votes": 0,
      "publication_date": 20170501
    },
    {
      "title": "Maui Jim Lighthouse Sunglasses",
      "text": "Pros: very light and the frame is flexible so breakage is minimized lenses provide exceptionally clear vision Cons: the flexible frame makes it difficult to use one hand to put them on the lenses smudge at the top and bottom where they lay on your face Though the vision is exceptional with the lenses, I personally would get another \"model\" of Maui Jim's.",
      "rating": 5.0,
      "verified": true,
      "author": "rkt",
      "helpful_votes": 0,
      "publication_date": 20130721
    },
    {
      "title": "Five Stars",
      "text": "Super lightweight. Great lenses. Really cuts glare. Feel a little fragile, but so far, so good.",
      "rating": 5.0,
      "verified": true,
      "author": "John T Arthur",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "Five Stars",
      "text": "These sunglasses are amazing for the price. Super light weight, and very nice quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Good fit and do not slip",
      "text": "Had a pair before and these were replacements. Seamless delivery service. If they're your first, here are my takes: Very lightweight. Good fit and do not slip. Amber shade is true. I use these for driving mostly and they can stay on for hours with no discomfort. Nose pieces are well designed and soft. I'm all about function over form. Function is perfect for me. (Form is not lacking either.)",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Crawford",
      "helpful_votes": 0,
      "publication_date": 20140902
    },
    {
      "title": "Plastic / Scratches easily / Rubber pulls hair",
      "text": "Feels great while running, lightweight. The only problem I have with these glasses is that they scratch easily, more than other maui jims that I have had. I am still getting a couple more because they are so comfortable - this time I have purchased a special non-scratch pouch - one that they easily slide into, while still not too spacious.",
      "rating": 3.0,
      "verified": true,
      "author": "Cooriander",
      "helpful_votes": 2,
      "publication_date": 20130707
    },
    {
      "title": "Love these glasses",
      "text": "Love these glasses. Light as can be. Love running, playing sports or just out and about with these. Doesn't feel like I have anything on but has full polarized protection!",
      "rating": 5.0,
      "verified": true,
      "author": "fish413",
      "helpful_votes": 0,
      "publication_date": 20150930
    },
    {
      "title": "I didnt think I would like the HCL Bronze color lens but my buddy talked ...",
      "text": "I didnt think I would like the HCL Bronze color lens but my buddy talked me into them. And I have to say after getting used to them and working in conditions where I am in direct sun and then inside and back and forth these are the first sunglasses that I can leave on my head all day without taking them away from my eyes. Really like these and the frame size fits a bigger head like mine just about perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Draper",
      "helpful_votes": 0,
      "publication_date": 20150618
    },
    {
      "title": "Best glasses ever!",
      "text": "Worth the money...buy these if you want the best sunglasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay M.",
      "helpful_votes": 0,
      "publication_date": 20150712
    },
    {
      "title": "Best sunglasses I have eve had",
      "text": "2nd pair. First pair lasted 10 years. Best sunglasses I have eve had.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark N.",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "good quality super comfortable and lite",
      "text": "they are just like the ones I bought directly from Maui Jims, very happy",
      "rating": 5.0,
      "verified": true,
      "author": "colette vallee",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Light weight and good feel.",
      "text": "Hard case is noted as included, but I did not receive one. Lowered the rating, otherwise 5 stars. Light weight and good feel.",
      "rating": 2.0,
      "verified": true,
      "author": "N.",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Great Sunglasses!",
      "text": "Sunglasses are exactly what I wanted, third pair of Maui Jim's and I wouldn't wear any other brand !",
      "rating": 5.0,
      "verified": true,
      "author": "Michael E. Mader",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Awesome buy",
      "text": "This is the best pair of sunglasses that I have ever owned. The service was like no other. Would highly recommend the glasses and the seller!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160704
    },
    {
      "title": "Five Stars",
      "text": "Great sunglasses. Very light weight so barely feel them on. Provide just enough shading without distorting the view...",
      "rating": 5.0,
      "verified": true,
      "author": "Laura J Watson",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "Great came in on time",
      "text": "Great came in on time. Worn them all weekend golfing. Don't even know they are on they are so light. Time will tell how they hold up",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170605
    },
    {
      "title": "Five Stars",
      "text": "Just exactly the pair I lost , delivered as promised",
      "rating": 5.0,
      "verified": true,
      "author": "Trevor",
      "helpful_votes": 0,
      "publication_date": 20150901
    },
    {
      "title": "I like the size of the lens",
      "text": "I like the size of the lens. I do wish they had the metal legs but I do like that they are very light and comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "G. Dixon",
      "helpful_votes": 0,
      "publication_date": 20170501
    },
    {
      "title": "Maui Jim another level I highly recommend",
      "text": "Stylish contemporary legendary !!! I've owned ray ban for years . Maui Jim another level I highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "kevin campbell",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "One Star",
      "text": "make sure you check the lens before you take the tape off, mine had a scratch under the tape.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Five Stars",
      "text": "Great lightweight sunglasses that give wonderful eye protection and provide rich colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "very light weight which is good for extended wear",
      "text": "very light weight which is good for extended wear, but they feel a bit fragile so be careful. All-in-All they look and feel nice.",
      "rating": 4.0,
      "verified": true,
      "author": "89crx",
      "helpful_votes": 0,
      "publication_date": 20150618
    },
    {
      "title": "Five Stars",
      "text": "Love them...first pair of sunglasses that I've ever had that fit comfortable!!",
      "rating": 5.0,
      "verified": true,
      "author": "Robbie B. Moore",
      "helpful_votes": 0,
      "publication_date": 20170320
    },
    {
      "title": "Very masculine. When I ordered them it did not ...",
      "text": "Very masculine. When I ordered them it did not indicate that it was men's glasses. I tried to pull it off but everyone said they were too masculine. They are light weight! I often forgot that I had them on. They are the quality you'd expect from Maui Jim. Get them for your husband and sons!",
      "rating": 4.0,
      "verified": true,
      "author": "Latoya",
      "helpful_votes": 0,
      "publication_date": 20140711
    },
    {
      "title": "Five Stars",
      "text": "I expected the best with these glasses, and that is exactly what I got!!!! Highly recommended these glasses!",
      "rating": 5.0,
      "verified": true,
      "author": "Chance W.",
      "helpful_votes": 0,
      "publication_date": 20151118
    },
    {
      "title": "JUST AWESOME!!!",
      "text": "i`ll be honest ,those are One of the best sunglasses you can get for the money!!!I have RayBan and Oakley,but those are way better!!! I highly recommend Maui Jim :)",
      "rating": 5.0,
      "verified": true,
      "author": "KDG",
      "helpful_votes": 0,
      "publication_date": 20130826
    },
    {
      "title": "Very light very comfortable",
      "text": "Love this sun glass. I got a pair for myself but my mom loved it so much I ended up giving it to her. I missed it very much. I got another pair online which saves me $15! It is super clear, light and comfortable. It is not cheap though, but it really worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lingyu",
      "helpful_votes": 0,
      "publication_date": 20131219
    },
    {
      "title": "Love my Maui Jim's",
      "text": "This is my third pair over the last 12 to 15 years. They are brilliantly clear and make eveything appear much better with their polarizing effect. Colors are richer, shadows virtually disappear and my eyes are much less strained under all conditions. Also, their light weight frame make them feel as if their not even there! I'll never be without them again!",
      "rating": 5.0,
      "verified": true,
      "author": "William S",
      "helpful_votes": 0,
      "publication_date": 20140617
    },
    {
      "title": "Lightweight, comfortable sunglasses!",
      "text": "These glasses are so lightweight and comfortable I forget I have them on. Very worth the $150 price tag, I've bought Oakleys, Ray Ban's and Versace glasses and these are my favorite!",
      "rating": 5.0,
      "verified": true,
      "author": "Renee",
      "helpful_votes": 0,
      "publication_date": 20140218
    },
    {
      "title": "Great, lightweight...",
      "text": "got these for my husband for Christmas. He loves them. They are so lightweight yet durable. His fave brand! Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Dalcour",
      "helpful_votes": 0,
      "publication_date": 20130128
    },
    {
      "title": "Maui Jim comes through again",
      "text": "Love the style and love the polarized lenses. Nose pieces are very comfortable and the weight of the glasses is fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott J.",
      "helpful_votes": 0,
      "publication_date": 20140306
    },
    {
      "title": "and she thinks they are the best sunglasses she's ever worn",
      "text": "I bought these for my wife and she loves them. This is her second pair (she lost the first), and she thinks they are the best sunglasses she's ever worn. Personally I think they're a bit expensive but... happy wife = happy life.",
      "rating": 5.0,
      "verified": true,
      "author": "Travis Tallant",
      "helpful_votes": 3,
      "publication_date": 20150603
    },
    {
      "title": "Never purchasing another brand",
      "text": "This is my second pair of Maui Jim. Awesome design and frame. Good Anti-glare and very helpful during winter with snow on ground. The seller service was very fast and prompt and prices are very reasonable compared to retailers at the mall. Strongly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Preethi Kundoor",
      "helpful_votes": 0,
      "publication_date": 20130103
    },
    {
      "title": "sunglasses",
      "text": "I have owned several pairs of Maui Jims. These are very comfortable glasses and I like to wear them when I am driving in the rain. They really seem to take the glare off the road.",
      "rating": 5.0,
      "verified": true,
      "author": "slvrmpl",
      "helpful_votes": 0,
      "publication_date": 20121201
    },
    {
      "title": "Nice Purchase",
      "text": "Lightweight, fit well, and good clarity. I wear contacts and have been looking for the perfect pair for wearing to play tennis and take to the beach.",
      "rating": 5.0,
      "verified": true,
      "author": "Carmen M. Lowden",
      "helpful_votes": 0,
      "publication_date": 20131119
    },
    {
      "title": "Just great...",
      "text": "Sunglasses just great! Light, vivid colors and full polarization. Quality is amazing. TV and computer monitor are totally blacked out when looking on them vertically. No other sunglasses I have can do that. I am happy with these.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexey Boyko",
      "helpful_votes": 0,
      "publication_date": 20121204
    }
  ],
  "product_meta": {
    "title": "Maui Jim Lighthouse Rimless Sunglasses",
    "description": "Named for Hawaii's first and still working lighthouse, located in Lahaina Harbor, the Lighthouse rimless polycarbonate sunglasses from Maui Jim are a timeless style that provides unmatched clarity, style, and durability.",
    "rating": 4.4,
    "feature_bullets": [
      "Nylon,Polycarbonate",
      "Imported",
      "All Maui Jim sunglasses feature PolarizedPlus2 lens technology that goes beyond shielding your eyes from glare and harmful UV rays by enhancing colors to reveal the true beauty of the world around you",
      "Enjoy ultimate UV protection combined with premuim style, incredible durability, glare-free vision, and color-boosting patented technologies",
      "HCL Bronze lenses feature a warm tint that provides versatility in changing light conditions",
      "Polycarbonate is designed to offer outstanding impact resistance and good optics--an excellent choice for fast paced activities when impact resistance is a priority",
      "Frames constructed from lightweight, injected nylon, designed for extreme comfort and extended wear time",
      "True to our independent roots for 30 years, Maui Jim Sunglasses are still designed and tested in Hawaii",
      "Backed by a 2-year manufacturer warranty to the original purchaser and when purchased from an authorized Maui Jim reseller, and includes a Large Brown Sport Case to keep your glasses in pristine condition",
      "Lense Width: 65 millimeters; Lense Height: 38 millimeters; Bridge Length: 16 millimeters; Temple Length: 127 millimeters"
    ],
    "categories": [
      "Accessories",
      "Sunglasses",
      "Women",
      "Clothing, Shoes & Jewelry",
      "Sunglasses & Eyewear Accessories"
    ],
    "price": 169.99,
    "specifications": {}
  }
}