{
  "website_summaries": [
    {
      "verdict": "Leaves floors shiny and covers scratches effectively.",
      "pros": [
        "Works on a variety of hard floor types",
        "Does not leave a film or get foggy",
        "Helps blend fading so that it is not as noticeable",
        "Lasts for six months"
      ],
      "cons": [
        "This product seems to be a little bit harder to apply than some others available",
        "May need more than one coat"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Amazing Results!",
      "text": "Great product! Easy to use and the results were incredible. My floors haven't looked this amazing in the 40 years I've lived here. Was recommended by a friend who's a builder and I've recommended it to many friends since using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Peed",
      "helpful_votes": 29,
      "publication_date": 20180309
    },
    {
      "title": "Easy to do and looks great",
      "text": "Super easy to use. I vacuumed my wood floors, then swiffered then twice. I used a microfiber cloth on my Swiffer head to apply the Pro Shot to the floors. I just kind of splattered it beside me and did a 10-12 ft spot at a time. It did leave some streaks, but that's because of me not using the correct applicator. Others have complained about scratches appearing, which I have had one. The scratch was also my fault and what happened would have scratched any surface! Those complaining of scratches just don't know how to take care of their floors in general. I love this and would purchase again! Oh, and it covered about 675sf.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittney",
      "helpful_votes": 3,
      "publication_date": 20190123
    },
    {
      "title": "Wow!",
      "text": "Wow! I'm going to buy cases of this. Seriously please never stop making it. It made my floor so shiny and took practically no time. I've added two photos; before and after. Amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 9,
      "publication_date": 20170926
    },
    {
      "title": "Easy to apply and leaves a beautiful clear mirror shine",
      "text": "Easy to apply and leaves a beautiful clear mirror shine, is not slippery, and lasts for months. It stays shiny even when the laminate or tile floors are steam cleaned . Love it on my laminate flooring as well as tile, ceramic, and many unconventional uses like old wood cabinets. Would not be without it!",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Garcia",
      "helpful_votes": 5,
      "publication_date": 20170419
    },
    {
      "title": "New floors in a bottle!",
      "text": "We have a home with the original 1940s hard wood flooring. With two young children and a dog, we didn't want to put it the time or expense of refinishing them, but they were definitely in need of some tlc. This stuff works wonders. I put the solution in a spray bottle and apply it with a sponge instead of a sponge mop. 1 bottle lasted a year with several applications.",
      "rating": 5.0,
      "verified": true,
      "author": "ayo12",
      "helpful_votes": 2,
      "publication_date": 20181001
    },
    {
      "title": "Great shine and not slippery",
      "text": "I've used this over the past 8 years on the bamboo floors in my mother's house. She is in her 80's so it's important that I not use anything that is slippery. After doing research I found this product and started using it before she even moved into the house. It really brings back the shine and makes her floors look GREAT! She recently fell and broke her pelvis. She had to use a walker for several weeks and they left LOTS of marks on the floors. I just came back from giving them the once over with Pro Shot and they look GREAT again. LOVE THIS PRODUCT!!",
      "rating": 5.0,
      "verified": true,
      "author": "Briesac",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Love it!",
      "text": "Absolutely love the product. I used it all over my house on various types of flooring. Dries quickly and is super easy to apply. It was a bit of a life saver when I needed to quickly refinish my floors for an event and didn't have the time to deal with polyurethane on my hardwoods. I also was able to skip the strong odor that comes with polyurethane, which was great since I have small children.",
      "rating": 5.0,
      "verified": true,
      "author": "Lonnie",
      "helpful_votes": 3,
      "publication_date": 20161101
    },
    {
      "title": "Amazing Product",
      "text": "RAVE... we’ve tried everything to bring back the shine to our laminate floors. We’ve tried Bona and Rejuvenate. They work good for a few days but then go dull again. Pro Shot restorer and finish works so well and dries so fast. Thought I’d share. You’re welcome 🤣🤣",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190310
    },
    {
      "title": "Fantastic product for shiny hardwoods - don't set bottle down where you don't want a ring!",
      "text": "If you want tired hardwoods to look awesome, this is it. Really easy to use, don't try to 'spread' thin - put on and move around to cover. DON\"T put the bottle down on top of furniture, the ring it leaves will perplex you for a long time as it is not easy to get off once applied. This made our floors absolutely shine when we were prepping our house for sale!",
      "rating": 5.0,
      "verified": true,
      "author": "Wanda",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Great for worn and faded oak floors",
      "text": "I moved into a rental that had old unevenly faded oak flooring. Three layers on the faded areas and one layer on the rest brought it back to life. I’m amazed how much better the floor looks. It’s now been two months since I used it and it’s held up well but it will need a layer in another month or two on the traffic areas I think",
      "rating": 5.0,
      "verified": true,
      "author": "F",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Revitalized my hardwood floors",
      "text": "I was about to get my hardwood floors sanded. It’s been awhile. But then I tried this. It isn’t the same as a complete sanding and refinishing, of course. But it really revitalizes the floor. I am pleased with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave A. ",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "BUY IT ...IT WORKS WONDERS",
      "text": "This is the absolute BEST floor product I have ever used. Everyone thinks that we had our floors redone, but it is this restorer. I only used one coat of it since we are busy painting and renovating our home ...with company coming in, this surely did the \"it will do for now ' trick and then some. Our house was built in 1946 and since then the hardwood floors have been re sanded and finished. We are the 2nd owners and the floors did not keep the shine no matter what I had previously tried. This is now the ONLY hardwood floor product I will ever use.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen-Ann Williams",
      "helpful_votes": 3,
      "publication_date": 20150820
    },
    {
      "title": "Use a lot",
      "text": "Use this a lot, but if you do move something a bit heavy across it - rocking chair, ottoman, it will leave a mark on the floor - looks like scuffing - really no way to make it right.",
      "rating": 4.0,
      "verified": true,
      "author": "LiteraryLady",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "WOW",
      "text": "This stuff is phenomenal. Floors are vibrant again and no longer dull. Most importantly, they do not show every dog footprint like before. Super easy to put on, super easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "avid reader",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Wow New Floors",
      "text": "I must say I'm impressed and get compliments from visitors all of the time if your hardwoods are dull. This is the product for you",
      "rating": 5.0,
      "verified": true,
      "author": "11bravo",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Best I have found for ceramic tile",
      "text": "I use this on older ceramic tile. Having regrouted I wanted everything to be protected and brighten the floors. This is my second order and the first coat lasted about 3 months. I mopped yesterday and put a new coat.",
      "rating": 5.0,
      "verified": true,
      "author": "Troy",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "It did not do what I thought it was going to do.",
      "text": "I bought it to give a sheen to my ceramic tiled floors. It was awful as it made the tile look streaked. I would not recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "Concetta Czapla",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Nice Results",
      "text": "Works as advertised. Covered many small scratches from my dog and left a really nice overall finish. Easy to apply and clean up – I used a wool applicator. The hard part was cleaning the floor thoroughly before application! Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "av323ci",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "No difference before and after",
      "text": "Absolutely waste of money, I followed the instructions to the teeth and nothing, a little gloss that faded in days",
      "rating": 1.0,
      "verified": true,
      "author": "Darien",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "works great!",
      "text": "I have older linoleum flooring in my kitchen area. I needed something to spruce it up. This product did the job for me. The floors look much better after applying this product on them.",
      "rating": 5.0,
      "verified": true,
      "author": "fosmert",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "I couldn't be happier with this product",
      "text": "I bought this product as a last resort before having to have my floor refinished. Initially, there was sun damage which I tried to fix, but I used the wrong product which caused white stains in addition to the damage already there. I read the very positive reviews of Pro Shot and decided to try it. What a huge difference it made! The problems on my floor are gone - the fading is now more blended and hardly noticeable; the stains are gone. I couldn't be happier with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori West",
      "helpful_votes": 0,
      "publication_date": 20150628
    },
    {
      "title": "Great Product",
      "text": "Happy with this product. I applied two coats to my very worn hardwood floors. Certainly improved their look. It's not a miracle worker. Some of the really worn areas are still really worn looking. Just with a sheen to them now. But, would certainly recommend the product and will use again. The first time I applied I used a sponge on hands and knees. The second time I used a sponge mop and a condiment squeeze bottle to apply. Highly recommend this application. Much easier to evenly distribute.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20140318
    },
    {
      "title": "Best Floor Restorer Ever",
      "text": "Have been using Pro Shot for years. It made my old, dull, scratched up wood floor beautiful again. I can't say it looks like new, but without Pro Shot, I would have had to replace my floors by now. It's especially great if you have pets who have accidents. Also, I tried Pro Shot on my brand new kitchen tile floor. Even though it's new, it looked even better after the Pro Shot. At first I put down two coats just for protection, but the floor looked so good, I gave it two more coats. Now it glows.",
      "rating": 5.0,
      "verified": true,
      "author": "Gail Grabowski",
      "helpful_votes": 0,
      "publication_date": 20140406
    },
    {
      "title": "Product as expected and received timely",
      "text": "Product as expected and received timely. It leaves a nice long lasting shine to our oak hardwood floors.",
      "rating": 5.0,
      "verified": true,
      "author": "Judi V.",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Fantastic Restorer",
      "text": "I recently removed wall-to-wall carpeting from my living room, dining room and hall. Since the hardwood floor has always been covered with some type of carpeting for 50+ years, I wasn't sure what the condition of the floor would be. Since I didn't want to go through the expense of having the floor professionally restored, I decided to try Pro Shot after reading many favorable reviews. After carefully cleaning the floor, I applied this product and was absolutely astonished at how beautiful it looked with relatively little effort, and minimal expense. I wholeheartedly recommend this product, especially if your hardwood floor has some less than attractive areas. I plan to apply it again in 6+ months, or as needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Mozart",
      "helpful_votes": 2,
      "publication_date": 20101104
    },
    {
      "title": "It was easy to apply",
      "text": "This product worked very well for me. It was easy to apply. I did a moderate coat and kept applying to a workable area and then on to the next. Let it dry for a couple hours, and decided to do another lighter coat. A nice looking finish for a worn but intact laminate wood floor for a good price. I recommend thoroughly cleaning the floor of any particles and grime first for a nice smooth finish. Hoping it holds up for a while before needing recoat.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160813
    },
    {
      "title": "... and a small dog my sealed pine floors were pretty scratched up and dull",
      "text": "With a big dog and a small dog my sealed pine floors were pretty scratched up and dull. I will buy this again when I need to redo my floors. It has a nice shine, dried quickly (45 mins in a home with the AC running). I did put some water based stain on the dog nail scratches prior to using this product. My floors look new again!!! I hope it lasts awhile as I've never used this before.",
      "rating": 5.0,
      "verified": true,
      "author": "Grandma S",
      "helpful_votes": 0,
      "publication_date": 20150820
    },
    {
      "title": "Great Product!",
      "text": "This stuff is AMAZING!!! It made my dull looking wood floors sparkle! It does take a significant amount of time to prep and apply, but it is well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz S",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Not effective",
      "text": "This product had very little effect on my floors. I applied it per directions- on clean,dry floors. But, I could tell only a small difference after 3 coats dispite the fact that the bottle says 1 coat is usually enough.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeremy&Jihan",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "Great product",
      "text": "Really good product! Doesn’t make floors oily, but still leaves a nice shine. Lasts for about 3 weeks then you need to use again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline Laino",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "FOR THE PRICE MY FLOOR LOOKS 100 PERCENT BETTER. FYI",
      "text": "MY FLOORS ARE OLD AND SCRATCH UP, IT DOES'NT HIDE THE SCRATCHES . IT DRIES CLEAR I USED 2 COATS. THE FLOOR SHINE IS UNBELIEVABLE ... AS LONG AS I DID NOT HAVE TO SAND. FOR THE PRICE MY FLOOR LOOKS 100 PERCENT BETTER. FYI.. ITS DOES DRY COMPLETELY IN 45 MINS",
      "rating": 5.0,
      "verified": true,
      "author": "Kizzy",
      "helpful_votes": 0,
      "publication_date": 20170101
    },
    {
      "title": "The absolute best",
      "text": "This was FANTASTIC! I recently moved into an off campus house and the previous tenets were party-ers. The lovely wood floors were in compelete disrepair. After a good scrub down I poured a decent amount of this product on spread it around. The results were AMAZING! I cannot express how drastic the changes were. It’s like a brand new floor!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Ernest Ambrose",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Just ok",
      "text": "I wish the scent would have lasted longer, but it works pretty well.",
      "rating": 3.0,
      "verified": true,
      "author": "Heather Talley",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Makes my tile floors look like new",
      "text": "I have been using this on my interior tile floors for years. Goes a long way, helps to seal the grout and makes the floors look like new. I use dish washing liquid to mop with as anything stronger might remove it. I have never had to strip the floor to reapply. If your grout and tile are very soiled you might have to clean it with a stronger product the first time. Very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Beverly Light",
      "helpful_votes": 0,
      "publication_date": 20140919
    },
    {
      "title": "Best floor finish I've found",
      "text": "I've used this product for years and love it. I've not only used it on wood floors, but on any wood that i'd like to have a bit more shine. On the floor, it seems like it lasts about 3 months. It's very easy to apply on a clean floor with a mop. Go over it once and leave it. If you keep going over it, it smears and you get lines in the finish. A bottle lasts a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler N.",
      "helpful_votes": 0,
      "publication_date": 20151117
    },
    {
      "title": "Also most excellent on hardwood",
      "text": "Whoa.. talk about s product that delivers.. put this on latex paint and you got a front door that will make your neighbors cry!! Also most excellent on hardwood floor",
      "rating": 5.0,
      "verified": true,
      "author": "Treehouse Buyer",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Works great",
      "text": "This stuff works great! You have to be careful to lay it down evenly and not try to go over an area more than once. But it works so well and last so long.",
      "rating": 5.0,
      "verified": true,
      "author": "Imagine Otherworlds",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "This made my floor look better than new and gives it a layer of protection",
      "text": "This made my floor look better than new and gives it a layer of protection. It is very easy to apply and durable. It's the best floor care product I've ever used.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Btica",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "It looked like perhaps like I did not put enough on",
      "text": "This was used on a porcelain tile floor. I read and followed the directions to the letter. I cleaned and wiped the floor on my hands and knees. I used a temperature/humidity gauge to make sure it was within the range allowed. I applied as directed. It looked like perhaps like I did not put enough on, even though I followed directions, and I have put liquid finishes on other floors before. I waited and then applied a second coat as directed. The second coat partially dissolved the first coat leaving a sticky mess which is now always dirty. I must use a solvent to get it off. I have no idea why it did not work.",
      "rating": 1.0,
      "verified": true,
      "author": "123",
      "helpful_votes": 6,
      "publication_date": 20160303
    },
    {
      "title": "Quality!",
      "text": "Pro shot is the absolute BEST floor product ever! I have been using it for years, always with questions from visitors of where to buy this product. Unfortunately I have not been able to find it in any store...only from catalogue sources, and now Amazon! Thank you! It has the sheen and durability of wax, but there is no wax, or oil in it...not slippery or sticky...the perfect floor product!",
      "rating": 5.0,
      "verified": true,
      "author": "jackie B.",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "Try this before a full refinish",
      "text": "Definitely a huge difference. Puts a nice shine without being too glossy or slippery. Put two coats as it had been many years since the floor was refinished. Easy to do. Fast drying. Has held up to weekly cleaning and washing.",
      "rating": 5.0,
      "verified": true,
      "author": "Gale Golden",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "This product is AMAZING!",
      "text": "This is an amazing product. I bought a bottle last year and didn't need another one until recently. Put the wax down last year, and touched up 6 months later.My floor was originally no wax linoleum put down 12 years ago, but it was not shiny any more and was difficult to keep clean. After using the wax, my floor looks brand new. It's high gloss and I can see the reflection of my furniture on it. It's also much easier to keep clean. I mop it once a week..no wax. Good as new. Highly r eco mended. I get lots of compliments on how good the floor looks.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlotte Harp",
      "helpful_votes": 0,
      "publication_date": 20150804
    },
    {
      "title": "Beautiful shine with one use",
      "text": "I use this at my shop and at home really makes a difference and beautiful shine!",
      "rating": 5.0,
      "verified": true,
      "author": "daniel&sherry",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "really works good",
      "text": "Applied it on used laminated wood floor that had a dull finish, made it shine real nice, seems to protect the surface after applied. As other reviews stated, make sure the floor is clean (no dog hair, lint or dust). Will continue to use it, better than wax or other stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 2,
      "publication_date": 20140113
    },
    {
      "title": "Pro Shot....really works!",
      "text": "This is an AMAZING product!......have tried everything.....over the years to give wood floors a fresh look without the stress of professionals to sand and coat. Will never purchase another product. Simply that good.",
      "rating": 5.0,
      "verified": true,
      "author": "m grace",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Good for light scratches",
      "text": "I purchased this floor restorer to touch up a few scratch marks on my hard wood floors. It worked quite well on most areas but I have one deeper scratch in my dining room and even after several coats the scratch is still very noticeable.",
      "rating": 4.0,
      "verified": true,
      "author": "Sambolee",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "Great Floor Shine",
      "text": "This is an excellent product. I have long needle wide pine floors. It is the second time I have used prophet and it restores the shine and covers small scratches very well. I will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Vandy",
      "helpful_votes": 0,
      "publication_date": 20170805
    },
    {
      "title": "Our GoTo floor product",
      "text": "Pro's - our 3/4 inch oak flooring, completely revitalizes - lasts a long time on our floors - we reapply about every 2 to 3 years. - also we use it on our ceramic tile kitchen floor - adds a sheen and seals the grout all in one coat. - Dries very quickly - No long lasting odor in the house - tiny odor when applying - but nothing that bothers me Con's - pricey",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20170708
    },
    {
      "title": "My kitchen floor is bright and beautiful and it doesn't get dull if you wipe up ...",
      "text": "Yes. I have spent hundreds of dollars trying to undo the damage that I did to my laminate floors cleaning them and then realizing that I scrubbed the top coat off of them needless to say I gave up until I found pro shot on Amazon. My kitchen floor is bright and beautiful and it doesn't get dull if you wipe up a spill. I'm very very pleased.",
      "rating": 4.0,
      "verified": true,
      "author": "edges Erica",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "super dull and this product really surprised me after several ...",
      "text": "My floor was tired looking, super dull and this product really surprised me after several coats it looks great. Impressive for the $$$, no nasty odor just make sure your floor is very clean ahead of time, even a high grit sandpaper and then a few coats of this you'll be impressed",
      "rating": 4.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20150121
    },
    {
      "title": "This stuff made our dull bamboo floors shine like new and filled in a ...",
      "text": "This stuff made our dull bamboo floors shine like new and filled in a lot of the small surface scratches. Will definitely use it again once it needs it, probably a once a year item.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "Gave my older floor a nice shine again",
      "text": "Gave my older floor a nice shine again. But, it did leave a lot of streaks because of the sponge I used. I don't think that could be avoided.",
      "rating": 4.0,
      "verified": true,
      "author": "Joel K.",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "Best product on the market for hardwood floors",
      "text": "Not sure how well this works on new hardwood or laminate floors, but does an amazing job on my 1950's hardwood floors that have never been refinished. Hides scratches and shines for months and months. Tried others that shined for a couple of weeks but this stuff is amazing. I just pour it on the floor and use a swiffer to spread it on.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph N.",
      "helpful_votes": 0,
      "publication_date": 20131214
    },
    {
      "title": "OMG...Unbelievable",
      "text": "Never found a product that works so effortless and easy as this. Beyond that the results are astonishing. This is it, if you're like for a shine and polish that will last.",
      "rating": 5.0,
      "verified": true,
      "author": "william g. young",
      "helpful_votes": 0,
      "publication_date": 20160805
    },
    {
      "title": "Get this stuff!!!",
      "text": "Get this stuff!!! It’s amazing!!! I tried everything and this by far worked the best on old laminate flooring that my dog scratched up. Highlyyyyy recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason G.",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Great product for old dull floors",
      "text": "This stuff is awesome. Created a nice shine on my circa 1974 flooring. And contrary to some reviews I read, it is not slippery.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Four Stars",
      "text": "WORKS WELL WITH A NICE SHINE. WOULD BE EXPENSIVE TO USE ON WHOLE FLOOR",
      "rating": 4.0,
      "verified": true,
      "author": "Raymond T. Goss",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Exceeds expectations",
      "text": "A quick review just to acknowledge what others are saying...this product works phenomenally! I used it on my cherry-wood floors, which were dull and scratched after 8 years with a family of 5 plus 3 dogs and a cat. Now they look new! Well, still scratches and dings, but there is now a shine that brings back the attractiveness of the floors. I'm exceptionally happy with Pro Shot Floor restorer!",
      "rating": 5.0,
      "verified": true,
      "author": "Mar-Mat",
      "helpful_votes": 0,
      "publication_date": 20130314
    },
    {
      "title": "Leaked",
      "text": "Seems like a good product, but had to return. Cap was cracked and it leaked all over the bag.",
      "rating": 1.0,
      "verified": true,
      "author": "debbie ",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Leaves dog paw traces",
      "text": "Left a great shine,after drying 3 days I let my dog in,now I have dog smug marks,how do I removed the marks,tried damp micro towel still see them",
      "rating": 5.0,
      "verified": true,
      "author": "Robert L",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Oooh shiny!",
      "text": "Works really well. Try to mop in one direction with an even amount or you'll see the unevenness, esp on dark wood. Not sure how long the shine last, but my rubber slippers smudge if my feet drag",
      "rating": 5.0,
      "verified": true,
      "author": "Corinthian",
      "helpful_votes": 0,
      "publication_date": 20170209
    },
    {
      "title": "Satisfactory product.",
      "text": "One coat is fine, three thin coats works well on my tiles. Just shiny enough.",
      "rating": 4.0,
      "verified": true,
      "author": "carolyn maragh",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "makes wood floors look better than new",
      "text": "I use this twice a year to refresh my 30 year old hardwood. Wash with whatever hardwood cleaner you prefer like Bona. Spread Pro Shot evenly over clean washed floor with a microfiber pad. Nice shine!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mustang Sally",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Awesome product. Easy to use",
      "text": "Awesome product. Easy to use. My kitchen floor looks like new. I get lots of compliments on how shiny it looks. Dries fast and with minimal odor. Will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Di G.",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "It keeps your floors looking like hey weer just finished",
      "text": "this product is absolutely fabulous on floors, I've been using for years.It keeps your floors looking like hey weer just finished!!",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "This stuff is amazing!! I have already bought 3 bottles and ...",
      "text": "This stuff is amazing!! I have already bought 3 bottles and will not use anything else on my hardwood floors. It truly shines and makes the floor look brand new again. The shine lasts a long time before you really need to do it again. Well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "TRACEY CARNEVALE",
      "helpful_votes": 0,
      "publication_date": 20150619
    },
    {
      "title": "It drys fast, and looks great!",
      "text": "My floors looked dirty when cleaned. I talked to a friend and they recommended this product. I followed the instructions and cleaned the floor and applied the Pro Shot, and the floors shine like never before. Highly recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "Seals the floor to a nice shine. It's important to find a good day ...",
      "text": "Seals the floor to a nice shine. It's important to find a good day to day cleaner to use with this as certain cleaners will strip the shine. Method cleaner works great in conjunction with this sealant.",
      "rating": 5.0,
      "verified": true,
      "author": "John B",
      "helpful_votes": 0,
      "publication_date": 20150925
    },
    {
      "title": "SHINE ON!",
      "text": "Works as advertised. The shine that it places on my vinyl flooring is exceptional and it make cleanups easier. I've only just applied it within the last two weeks so I still need to see its durability but so far so good!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Robinson",
      "helpful_votes": 0,
      "publication_date": 20150305
    },
    {
      "title": "but dull, tired looking - they are at least10 years ...",
      "text": "I used this on my wood laminate floor in the kitchen/dining area. My floors weren't scratched, but dull, tired looking - they are at least10 years old. I put 2 very light coats on and they look great - just like new floors.",
      "rating": 5.0,
      "verified": true,
      "author": "Pam S.",
      "helpful_votes": 0,
      "publication_date": 20150517
    },
    {
      "title": "Five Stars",
      "text": "This is the best floor \"polish\" I have ever used. Ease of use, no problem at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruger",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "When you apply it looks perfect, but after leaving it for 24 hours drying ...",
      "text": "It does not fix on the floor, after do all the procedures it still coming out with single water, or even walking on it. When you apply it looks perfect, but after leaving it for 24 hours drying it still coming out and nos bunch os scrats in my floor..",
      "rating": 1.0,
      "verified": true,
      "author": "Diego",
      "helpful_votes": 3,
      "publication_date": 20150812
    },
    {
      "title": "My floors look Great!",
      "text": "This is the 2nd purchase if this product. The first bottle made me a believer. I have old oak hard wood throughout the house and this product works not only for looks but also protection of the old oak.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcia A Borst",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "Great Product",
      "text": "I have linoleum in most of my apartment. It looks like wood plankes but it is vinyl. After steam mopping all the old gunk off the floor I applied Pro Shot. I used my swiffer mop and a clean dry Swiffer cloth to apply it. It looks amazing, better than when I moved in. I am ordering more!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Deanne",
      "helpful_votes": 0,
      "publication_date": 20140512
    },
    {
      "title": "This product does a great job. Just make sure your floor is clean ...",
      "text": "This product does a great job. Just make sure your floor is clean before applying this product. Anything left on the floor before applying this product will show up.",
      "rating": 5.0,
      "verified": true,
      "author": "RHHARP",
      "helpful_votes": 0,
      "publication_date": 20160402
    },
    {
      "title": "This works amazingly well!",
      "text": "This stuff is amazing! Used it on my 85 year old hardwood floors. Everyone thinks I used a drum sander to refinish. Highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20161030
    },
    {
      "title": "Pro Shot - best floor finisher on the market!",
      "text": "Pro-Shot is the best floor finisher on the market. It works wonders for old hardwoods to bring back the luster. My daughter recently bought an old house built in 1949 with hardwoods throughout. After I cleaned the floors thoroughly, I used Pro Shot to finish them and the result was amazing!! It brought back the luster of the beautiful floors. What a great product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Char",
      "helpful_votes": 2,
      "publication_date": 20101002
    },
    {
      "title": "Simply Amazing...",
      "text": "My 17 year old hardwood floor was looking pretty dull and rough. Applied two coats of this product and the floor looks almost new. Yes, stripping, sanding and refinishing the floor would provide better long term results, but you can beat this product for the price and results. I plan to purchase more to cover my entire house.",
      "rating": 5.0,
      "verified": true,
      "author": "William B. Ramsey",
      "helpful_votes": 0,
      "publication_date": 20130129
    },
    {
      "title": "Great Product, Results and Easy to Apply",
      "text": "This is a great product. Some of the review seem a little critical. Short of sanding and refinishing, nothing can work a miracle on an old floor. However, this product is close. We were getting our house ready to sell and one of our floors was really in need of refinishing. This product gave those old floors new life. I am amazed at it really. Fo a small investment of money and time it really is a great product. Easy to apply and great result.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Osborne",
      "helpful_votes": 0,
      "publication_date": 20150424
    },
    {
      "title": "Best restorer out there",
      "text": "Use this to help my older wood floors look shiny and new. I am on my second bottle and will not use anything else. One bottle can take care of all my wood floors.....Best restorer out there!",
      "rating": 5.0,
      "verified": true,
      "author": "JED",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "Works",
      "text": "This really works but the prep time it takes to pre-clean the floor does take some time. Still it is cheaper than re-sanding. It does not last forever either. Still a better option to make your floors shine up.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian M. Kaplan",
      "helpful_votes": 0,
      "publication_date": 20140301
    },
    {
      "title": "AMAZING product! I bought a house with hard wood ...",
      "text": "AMAZING product! I bought a house with hard wood floors about 40 years old. This made them shine like they were just put in yesterday. I will definitely be buying more of this product once mine runs out.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronnie",
      "helpful_votes": 0,
      "publication_date": 20160422
    },
    {
      "title": "Amazing",
      "text": "This stuff is amazing! I used it on worn entry way worn wood flooring. Amazing shine and hides the ugliness pretty well. It made it look so much better! I also used this on our pergo kitchen floors. All I used was a sponge mop, let it dry overnight ( the bottle says 45 minutes). Love this stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "femme246",
      "helpful_votes": 0,
      "publication_date": 20131017
    },
    {
      "title": "Easy to use/great results",
      "text": "Works great. Easy to apply. Floor is all nice and shiny again.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Herman",
      "helpful_votes": 0,
      "publication_date": 20170326
    },
    {
      "title": "Glowing floors",
      "text": "This stuff is great. Goes on easy, very shiny and wears well.",
      "rating": 5.0,
      "verified": true,
      "author": "T.W.",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "Love Pro-shot",
      "text": "The best product I've ever used on my floors. Just pour on a clean floor and mop with even strokes with a damp mop and let dry. Beautiful and lasting! One bottle goes a long way. Worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Greene",
      "helpful_votes": 0,
      "publication_date": 20170222
    },
    {
      "title": "Great for worn floors",
      "text": "This did wonderful things to my scuffed and worn wood floors! Follow the directions and see great things happen! It doesn't fill in scratches or dings, but the finish is so shiny, they look much less noticeable.",
      "rating": 4.0,
      "verified": true,
      "author": "Chelsey M.",
      "helpful_votes": 0,
      "publication_date": 20151130
    },
    {
      "title": "Fantastic item",
      "text": "I used this product to restore my kitchen vinyl floor after stripping the wax from years of waxing. It is the most beautiful floor I have ever seen. I used ZEP to do the stripping, then used your product. I just love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy Rosburg",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "- my floor looks good now. i have 1/2 bottle left (10x12) room",
      "text": "my floors looked bad- after cleaning well- applied 2 coats, of pro shot, - my floor looks good now. i have 1/2 bottle left (10x12) room.",
      "rating": 5.0,
      "verified": true,
      "author": "SPIRAL AMETHYST",
      "helpful_votes": 0,
      "publication_date": 20160405
    },
    {
      "title": "Renew your wood floors",
      "text": "Renews are real wood floors amazingly. Better than having to varnish and it cleans and shines.",
      "rating": 5.0,
      "verified": true,
      "author": "LynneBR",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "Fantastic product for beautiful floors!",
      "text": "I get so many compliments on my hardwood floors when I use this product. my daughter now also uses it on all her hardwood floors. I would highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen L Haden",
      "helpful_votes": 0,
      "publication_date": 20160701
    },
    {
      "title": "Amazing product! It’s been over a month now and ...",
      "text": "Amazing product! It’s been over a month now and my hardwood floors still look like new. Easily the best $20 spent on Amazon this year!",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Korzha",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "Easy spreading",
      "text": "Our floor was dull and never treated by the previous owners. Now it shines like new. But you have to apply it 2 or 3 times. After the 1st time in the sun light you notice the smear streaks from when you applied it.",
      "rating": 5.0,
      "verified": true,
      "author": "Coen",
      "helpful_votes": 0,
      "publication_date": 20130812
    },
    {
      "title": "I like this product",
      "text": "I like this product. It leaves your floor shining. The reason for the four stars was only due to the fact that the shine fades away in matter of two weeks or so. But it can be restored by just splashing some back to the floor and a quick mop.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Rosa",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "Indispensable!",
      "text": "We live in a 1960's split-level home with hardwood floors throughout. I find Pro Shot to be indispensable in keeping the floors looking great.",
      "rating": 5.0,
      "verified": true,
      "author": "Cspepper",
      "helpful_votes": 0,
      "publication_date": 20160126
    },
    {
      "title": "Floor needed help",
      "text": "My new hardwood floors were getting dull. I tried a few spot applications and it didn't look any better. Then I read the directions. In order to get that nice brilliant shine - you need to follow them. Not sure if the shine will continue but the first attempt worked.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20140130
    },
    {
      "title": "Very Good Product",
      "text": "Don't expect miracles If your floors are shot then only refinishing will do. But if you do refinish be prepared for the expense, dust, fumes and the need to move furniture. The product is great when you just want to increase the gloss. It hides minor imperfections as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Handyman",
      "helpful_votes": 0,
      "publication_date": 20121226
    },
    {
      "title": "Amazing!",
      "text": "My wife was going to shoot me when she found out that I had spent over double the advertised price for Pro Shot to have it shipped to Canada, 1but when she used it for the first time, she was so pleased, she told me I should have ordered more. The shine on this old floor is outstanding! Really outstanding!! We will never use anything else.",
      "rating": 5.0,
      "verified": true,
      "author": "Graham Patterson",
      "helpful_votes": 0,
      "publication_date": 20160804
    },
    {
      "title": "I found out I can't do the \"buff n coat\" ...",
      "text": "I found out I can't do the \"buff n coat\" process to refresh my hardwood floors. This product leaves a chemical residue which requires a full refinishing of all my hardwood floors. These types of products should be taken off the market.",
      "rating": 1.0,
      "verified": true,
      "author": "Kim J.",
      "helpful_votes": 4,
      "publication_date": 20140627
    },
    {
      "title": "Good product good value.",
      "text": "Good product for hardwood floors. Puts a nice coat of protective shine on the wood.",
      "rating": 4.0,
      "verified": true,
      "author": "Bj",
      "helpful_votes": 0,
      "publication_date": 20190722
    }
  ],
  "product_meta": {
    "title": "PRO SHOT 22823 Industrial Re-Newing Floor Restorer, 32-Ounces",
    "description": "Pro Shot Floor Restorer fills scratches so they are unnoticeable;rejuvenates dull spots in your floors by giving these areas the same shine as the rest of your restored floor. Underwriters Laboratory;Inc (UL) listed as to slip resistance. Pro Shot also protects from detergents;black heel marks;spills;and contains no wax so there is no yellowing or wax buildup. Pro Shot will also seal your floor and protect it with a clear brilliant finishthat last for months at a time-what a time and money saver. Works on sealed wood;laminates;vinyl;no-wax;linoleum;bamboo;slate;flagstone;ceramic tile;and more. Consumers will delight in the ease of Pro Shots one coat application;only a sponge mop is needed to apply. Originally used by hospitals;schools;shopping malls;and industry alike;this exceptional product is now available for your home. New floors in a bottle.",
    "rating": 4.6,
    "feature_bullets": [
      "Fills scratches and rejuvenates dull spots",
      "Seals and dries to a clear brilliant finish",
      "Lasts for months",
      "Perfect for all old and new floors",
      "Exceptional results"
    ],
    "specifications": {
      "Product Dimensions": "3.3 x 3.3 x 10 inches",
      "Item Weight": "2 pounds",
      "Manufacturer": "Pro Shot Corporation",
      "ASIN": "B003DR0JF8",
      "Item model number": "22823",
      "Customer Reviews": "4.6 out of 5 stars975 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#8,675 in Industrial & Scientific",
      "Is Discontinued By Manufacturer": "No",
      "Volume": "32 Fluid Ounces",
      "Is Assembly Required?": "No",
      "Batteries Required": "No",
      "Import Designation": "Made in USA"
    },
    "categories": [
      "Floor Cleaners",
      "Household Supplies",
      "Home & Kitchen",
      "Health & Household",
      "Household Cleaning"
    ],
    "price": 19.95
  }
}