{
  "website_summaries": [
    {
      "verdict": "A contemporary electric wheelchair that provides a lightweight, convenient travel option.",
      "pros": [
        "Long wheel base makes it easy to maneuver the wheelchair",
        "Includes dual swing-away storage bins",
        "Available in six stunning colors",
        "Armrest height and width are simple to adjust"
      ],
      "cons": [
        "Suspension fails to provide ample support on rough terrain, resulting in bumpy rides"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "This is really a great chair for the money",
      "text": "This is really a great chair for the money. I have had it 2 weeks now and am really pleased with it. The sellers are great people they phoned me to tell me it was shipped, and said if I had any questions to please give them a call. As for the chair the turning radius is awsome and it sets me at bar heitht so I can eat without trying to move from the chair to a stool. Love the machine would recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen",
      "helpful_votes": 24,
      "publication_date": 20170804
    },
    {
      "title": "Not worth the headaches",
      "text": "Worked fine the first few weeks, but then the charger stopped working while on a cruise to Alaska. Now the battery wont take a charge. Too many problems and no one to contact directly to get it resolved! Piece of crap! No place to fo to replace the inoperative battery. DO NOT BUY THIS CHAIR.",
      "rating": 1.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 7,
      "publication_date": 20190607
    },
    {
      "title": "Nice chair",
      "text": "I ordered this for my 91 year old mother. It took her awhile to get the hang of it. It's really a nice chair. Small to fit in little spaces. Battery seems to hold a charge for a long time, but she doesn't use it 24/7.",
      "rating": 5.0,
      "verified": true,
      "author": "Reading gma",
      "helpful_votes": 11,
      "publication_date": 20180826
    },
    {
      "title": "Make sure to be present at delivery. Better getting an appointment with the the delivery company, otherwise they will not leave",
      "text": "Great chair. Easy to use.I have another one in a different location, and Ihave been very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "MANUEL MEDINA-MORA",
      "helpful_votes": 6,
      "publication_date": 20171203
    },
    {
      "title": "Fair value for the cost.",
      "text": "A little concerned about service in the future. Assembly was not too bad. Chair operates very well.",
      "rating": 5.0,
      "verified": true,
      "author": "R English",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "chair",
      "text": "it would be a lot nicer if there was suspenion. jars my back hitting the cracks",
      "rating": 4.0,
      "verified": true,
      "author": "DAVID WHITTINGTON",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "A must for indoors.",
      "text": "Absolutely no problems for flat surface. Best for indoors, patios, etc.Easy to get through hallways and through door ways. Fits easily into car trunk with room for baggage.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 15,
      "publication_date": 20150426
    },
    {
      "title": "this is a good size for us at a good competitive price",
      "text": "It would be helpful if this wheelchair had more clearance. 2 inch clearance would solve problems. Otherwise it is satisfactory but I must qualify because it has not been used much. After much shopping and comparison, this is a good size for us at a good competitive price. Have not disassembled for transport but it looks easy to do and the pieces are not too heavy. Note, we have only owned for approx. a month.",
      "rating": 4.0,
      "verified": true,
      "author": "Inquisitive learner",
      "helpful_votes": 14,
      "publication_date": 20151116
    },
    {
      "title": "Freedom",
      "text": "I have been hesitant about buying one of these, but my concerns were taken care of by this great chair. It is so easy to drive and very comfortable to sit on. For the first time in 2 years I was able to go to our back yard. It runs great inside, outside on the driveway and also on the grass. It feels like I have been set free.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Cummings",
      "helpful_votes": 3,
      "publication_date": 20191208
    },
    {
      "title": "I'm happy with GO CHAIR Pride Mobility Electric Chair",
      "text": "I'm happy with GO CHAIR Pride Mobility Electric Chair. I heartily recommend it to anyone needing transportation around the house and outside as well.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Wenger",
      "helpful_votes": 8,
      "publication_date": 20170923
    },
    {
      "title": "Love my Go Chair",
      "text": "I had viewed u-tube on how to assemble the Go Chair and it was easy to put together it did not take long for me to assemble and have it charged and running. I did it by myself without my husband's help. It made me feel very good that I could put the Go Chair together so easily. I love the use of the Go Chair because of it's maneuverablity am so happy I have the use of the Go Chair, Thank You. Maria Zoschak",
      "rating": 5.0,
      "verified": true,
      "author": "Maria E.Zoschak",
      "helpful_votes": 3,
      "publication_date": 20190218
    },
    {
      "title": "Well built but heavy.",
      "text": "My mom bought this chair and it is very heavy. We were looking for portability and mobility. The quality is great, however it’s difficult to operate. The joystick is loosey goosy. She was looking for something that can travel in the car and on a plane.",
      "rating": 3.0,
      "verified": true,
      "author": "CJC",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Easy to operate and very comfortable to use.",
      "text": "The ease of turning is great! I used it in the house for a few weeks and took it out today for the first time to a restaurant and it was great! Easy to sit at a table, navigating a door by myself was challenging but I think it will improve over time.",
      "rating": 5.0,
      "verified": true,
      "author": "SM",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "joystick is sensative and you can't be too heavy on it",
      "text": "I don't dislike anything. It turns on a dime so I can turn around in the elevator even when someone else is in there. It's comfortable, doesn't take up much room, it's just great!",
      "rating": 4.0,
      "verified": true,
      "author": "annie",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "A life saver",
      "text": "I use the chair only indoors daily. Have had it 5 years now and really like it. I added a gel cushion but it really is not needed. Would buy again because it is comfortable, small enough to get everywhere in the house and has a sturdy feel",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 19,
      "publication_date": 20121227
    },
    {
      "title": "Battery pack poor design??",
      "text": "I was checking this out at a neighborhood dealer. While the salesman was demonstrating how to take it apart he broke it. The battery pack would not release and he said because it was a poor design. Has anyone else had this happen to them? I would like to add that we bought this chair and so far no problems with the battery pack. However I haven't been able to find a good ramp that will work with this chair. When going up the ramp my front wheels came off the ground about 4 or 5 inches and that was scary! So needless to say I won't be using that ramp anymore.",
      "rating": 3.0,
      "verified": false,
      "author": "lollymop",
      "helpful_votes": 9,
      "publication_date": 20170914
    },
    {
      "title": "In 10 months from new, had to have motor ...",
      "text": "In 10 months from new, had to have motor replaced twice. It's still in the shop for the past 30 days getting the second motor. I'll never own another Pride chair. Currently looking at other brands to buy another new chair.",
      "rating": 1.0,
      "verified": false,
      "author": "Dennis Shade",
      "helpful_votes": 10,
      "publication_date": 20180713
    },
    {
      "title": "I love the compact nature of the chair",
      "text": "I love the compact nature of the chair. It has a great turn radius. I have muscular dystrophy and the parts are still too heavy for me to get in a trunk. I bought some dog ramps and can drive it into my trunk thanks to the easy to use joy stick. The only thing that is terrible is the seat. It is absolutely the most uncomfortable seat known to man. I asked if they could do it with a captain's chair and they said it would throw off the balance. With how much we have to pay, a better seat should be doable.",
      "rating": 3.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20180304
    },
    {
      "title": "Can’t return",
      "text": "My mother couldn’t use the chair and beware I couldn’t return it. So I’m stuck with this large chair with no place to put it!",
      "rating": 1.0,
      "verified": false,
      "author": "Crystal Mace",
      "helpful_votes": 5,
      "publication_date": 20190503
    },
    {
      "title": "Great $$ & looks great!!",
      "text": "Great $$!! Waiting for it to get here. Will comment later.",
      "rating": 5.0,
      "verified": false,
      "author": " Mike",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Accessible and easy to use",
      "text": "I liked it’s accessibility turn radius and ease of use.",
      "rating": 5.0,
      "verified": false,
      "author": "DeeDee Reed",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Great equipment, but consider other sellers",
      "text": "The Pride Go Chair is a light weight power light, and Amazon is offering it at a good price. However, if you have Medicare benefits and your doctor thinks that you would medically benefit from using it, you can actually get one for little or no cost. Consider power chair providers like [...] who can use your insurance benefits to get one. If however you're unable to get this using insurance benefits this is an excellent price and you should give it consideration.",
      "rating": 4.0,
      "verified": false,
      "author": "Robert Hlozek",
      "helpful_votes": 22,
      "publication_date": 20100714
    },
    {
      "title": "Getting from point A to point B",
      "text": "Love the Bermuda color! I have great hopes for my new chair! Also, I use a wheelchair because I have Multiple Sclerosis",
      "rating": 5.0,
      "verified": false,
      "author": "Karen August",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Kills muscle tone",
      "text": "My brother has this powerchair and was delighted when he moved from a traditional wheelchair into this power chair. After about a year of using nothing but his index finger and thumb to move, he no longer uses his arms, hands or upper body for anything and has lost most of the strength in those body parts. He recently fell out of the chair and could not even crawl to help himself. Not only he had lower body issues, he now has upper body issues as well. He was stranded on the floor for days. I don't think you are doing anyone a favor by putting them in a joystick operated device.",
      "rating": 2.0,
      "verified": false,
      "author": "Richard",
      "helpful_votes": 15,
      "publication_date": 20120828
    }
  ],
  "product_meta": {
    "title": "New GO CHAIR Pride Mobility Travel Electric Powerchair + 18AH Batteries Upgrade (Sapphire Blue)",
    "description": "Color:Sapphire BluePride Mobility has always been known for their excellent full-sized power wheelchairs and great travel-sized scooters. Now you can have the terrific features of both in the All New Go-Chair. With an easy-to-remove battery pack and lightweight frame, the Go-Chair is a great choice to get you going. The all-new Go-Chair is re-engineered from the ground up, offering a sleek, bold new style available in an array of contemporary colors. Enhanced performance and comfort, along with feather-touch disassembly, allows you to enjoy light-weight travel and independence on the go. With an increased weight capacity of 300 lbs. and a sleek, bold look, the new Go-Chair makes travel easy.",
    "rating": 4.2,
    "feature_bullets": [
      "Exclusive Top Mobility 1-Year Hassle-Free In-Home Service Plan - Included",
      "Increased 300 lb. weight capacity, Faster speed - up to 3.7 mph",
      "Larger, 18 amp batteries",
      "Improved agility - longer wheel base; wider stance; compact turning radius 25.4”",
      "Dual swing-away, under seat storage bins"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "33 x 25.5 x 22 inches; 66 Pounds",
      "Item model number": "Go-Chair",
      "Date First Available": "July 25, 2016",
      "Manufacturer": "Pride Mobility",
      "ASIN": "B003TMG7K8",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Electric Wheelchairs",
      "Wheelchairs, Mobility Scooters & Accessories",
      "Mobility & Daily Living Aids",
      "Mobility Aids & Equipment",
      "Wheelchairs",
      "Health, Household & Baby Care"
    ],
    "price": 1499.0
  }
}