{
  "website_summaries": [
    {
      "verdict": "Slim profile on this helmet is especially good for young players, as it won't pop off during play.",
      "pros": [
        "Provides a very comfortable fit with proper levels of padding and with a slim profile",
        "Offers extra protection around the jaws and ears",
        "Padding includes a moisture-wicking capability to keep the player feeling cooler",
        "Helmet matches all NOCSAE safety standards"
      ],
      "cons": [
        "Helmet will fit too tightly for some",
        "Only made for really young players"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "This Tee Ball Batting Helmet fit perfect. I recommend it for the ages of three ...",
      "text": "This Tee Ball Batting Helmet fit perfect. I recommend it for the ages of three and four. The padding in this helmet is thick and good for the protection that the little players need. The only draw back to the helmet is that it does not come with a face protection. But it does have the hookups for a shield. The price for this helmet is below what it should be for it's quality. I do recommend this helmet for your Tee Ball players.",
      "rating": 5.0,
      "verified": true,
      "author": "Retriever",
      "helpful_votes": 0,
      "publication_date": 20170601
    },
    {
      "title": "Great helmet but runs small.",
      "text": "Really nice and well made, especially for the Amazon price HOWEVER, I must return it. The size sold is too snug for both my twins boys (age 4.5). Darn! Now I have to keep looking. I so wish they had the next larger size offered. Our boys aren't huge and I didn't think they had particularly large heads.",
      "rating": 5.0,
      "verified": true,
      "author": "Seattle Girl",
      "helpful_votes": 4,
      "publication_date": 20150626
    },
    {
      "title": "Finally!!!",
      "text": "My daughter is 4 and very small for her age, I mean... really little. This helmet fits her PERFECT! Soon as you take it out of the box you know right away that this is MUCH smaller than typical T-Ball aged helms. If you have a petite child, this is the helmet you want!",
      "rating": 5.0,
      "verified": true,
      "author": "Harland J Hart",
      "helpful_votes": 10,
      "publication_date": 20140305
    },
    {
      "title": "Solid Product",
      "text": "Solid batting helmet. My 3 y/o saw that the guys on TV wore helmets and had to have one. Prime to the rescue. Now when we bat in the backyard, he has to have his helmet in place. Great that he's interested in safety and he'll be ready for his first little league experience.",
      "rating": 5.0,
      "verified": true,
      "author": "Prime Time",
      "helpful_votes": 2,
      "publication_date": 20160721
    },
    {
      "title": "Perfect size for a 3 year old t-ball player",
      "text": "I bought this for my 3 year old sons first season of t-ball. The junior size is way too large for a toddler but I am glad Easton makes a helment specifically made to fit the younger t-ball player (3-4 years old) It fits my son perfect with plenty of room to grow, I can see this helmet lasting 2 seasons! The helmet has a shiny black finish with a front logo sticker.",
      "rating": 5.0,
      "verified": true,
      "author": "Marisa",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "I think he will get to enjoy this helmet for a couple season of baseball",
      "text": "My son is 4 years old and this helmet works perfectly. It is snug trying to get it on. But once on there is more room. I think he will get to enjoy this helmet for a couple season of baseball!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley L.",
      "helpful_votes": 3,
      "publication_date": 20170225
    },
    {
      "title": "Great for toddlers/preschool",
      "text": "Fits my 2-year-old grandson's head perfectly. Very soft padding. Now he can look like his heros.",
      "rating": 5.0,
      "verified": true,
      "author": "netshopper",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Fit 5 Year Old",
      "text": "This fit my 5 year old just fine as he has a normal size nugget IMO. He may get a 2nd year out of it too.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael D.",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Good Helmet",
      "text": "This is a nice little helmet. I ordered the 6- 6 1/2in and It fits my sons head perfectly and he’s 2 and a half but he’s y’all for his age. But it fits good and the peddling is nice, it isn’t loose or too tight. The stickers are kind of coming off and we just opened it but I didn’t order it to look pretty so we don’t mind that.",
      "rating": 4.0,
      "verified": true,
      "author": "Katy D.",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Perfect!",
      "text": "Perfect fit looks like good quality. Haven’t been able to use it bc of quarantine but looking forward to it!",
      "rating": 5.0,
      "verified": true,
      "author": "Tara",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "A little snug",
      "text": "This helmet fit my son for his first season of tee ball. I'm not sure how long it will fit him. It was a little snug. He has always had a smaller than average head circumference as per his doctor.",
      "rating": 4.0,
      "verified": true,
      "author": "Lez McC",
      "helpful_votes": 0,
      "publication_date": 20170621
    },
    {
      "title": "Good as a bike helmet. Protects the ears.",
      "text": "Buy a few MLB stickers or Superhero stickers and personalize it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Small",
      "text": "This is too small for an average size 4 year old.",
      "rating": 2.0,
      "verified": true,
      "author": "Kelli A Thompson",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Perfect for my little guy",
      "text": "Fits perfectly on my 2.5 year old's head, who is average height, slightly lower than average weight, and average head circumference. He absolutely loves it. Since it arrived, he has worn it every day. I think he would wear it to bath and bed if we would let him.",
      "rating": 5.0,
      "verified": true,
      "author": "erica217",
      "helpful_votes": 0,
      "publication_date": 20150818
    },
    {
      "title": "not a new helmet",
      "text": "when I received this helmet, it's not a new one few hair inside and dirty inside but I don't have time to return it. So I throw it out.",
      "rating": 1.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Nice helmet. It’s on the small narrow side",
      "text": "Nice helmet. It’s on the small narrow side, so if your child has a large head you may want to find another helmet.",
      "rating": 4.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Too small for my preschoolers head",
      "text": "I had to return this item because it was way too small for my 5yr old sons head. However, it looked like it was very well made, so it is unfortunate that it did not fit.",
      "rating": 2.0,
      "verified": true,
      "author": "JayneDoah",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "Great helmet for young kids.",
      "text": "Quality helmet for youth hitters. Must be comfortable as well because my boys both like to wear theirs while riding their bikes as well.",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "This helmet is fine, but my 4 year old who is a ...",
      "text": "This helmet is fine, but my 4 year old who is a small child doesn't like the way it fits, it's to tight in the ear area.",
      "rating": 2.0,
      "verified": true,
      "author": "Stephanie Barcomb",
      "helpful_votes": 2,
      "publication_date": 20150928
    },
    {
      "title": "Great helmet for 4-5 year olds!",
      "text": "This is a great helmet! My son plays t-ball and will be 5 years old this week and it's a perfect fit. He likes wearing it as does his little brother who only wears it facing backward lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill Brown",
      "helpful_votes": 0,
      "publication_date": 20150520
    },
    {
      "title": "Little small but maybe my kids have exceptionally large melons ...",
      "text": "Little small but maybe my kids have exceptionally large melons. They didn't get brain damage do a big thumbs up!",
      "rating": 4.0,
      "verified": true,
      "author": "Desert ape",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Two Stars",
      "text": "too small for my 5 year old. Had to return.",
      "rating": 2.0,
      "verified": true,
      "author": "JAMES WOLFE",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Need a more specific size chart",
      "text": "You come to expect quality from Easton, which was fine, had problem with figuring out exact sizing on site, which caused me to return item due to wrong sizing.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Riden",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "This was a perfect fit for my son",
      "text": "This was a perfect fit for my son. We had a hard time trying to find a helmet that fit. They were all way to big! This fits perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Great fit!",
      "text": "Perfect for my four year old, snug but comfortable fit. I felt his head was well protected, even amongst the loose-swinging bats in the pre-school dugout.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20160703
    },
    {
      "title": "Great for little/petite guys/girls",
      "text": "My 5 year old son has a very small head, and we couldn't find tee-ball helmets here. Found this and ordered it, it fit him perfectly. He will be able to use it next year again. If your child has an \"average\" sized head, I probably wouldn't recommend buying this, but it is great for petite or little guys/girls!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "Five Stars",
      "text": "Fit my small 5 year old perfect. I measured his head before I purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa B.",
      "helpful_votes": 2,
      "publication_date": 20170314
    },
    {
      "title": "Perfect fitting helmet for a little slugger!",
      "text": "It's difficult to find a good quality helmet for a little slugger. Fortunately, I found this one on AMAZON. Thanks to the previous reviews; in particular the ones that specified size, I was confident in placing my order for my three-year-old grandson........and the helmet fits!",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn Margaret",
      "helpful_votes": 0,
      "publication_date": 20130606
    },
    {
      "title": "Fits Perfect!",
      "text": "It fits my 3 yr old son. Should last until he's 5.",
      "rating": 5.0,
      "verified": true,
      "author": "Smoke Master",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Five Stars",
      "text": "nice helmet. it fit my 5yo girl tiny head for soft ball.",
      "rating": 5.0,
      "verified": true,
      "author": "booyaa666",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Five Stars",
      "text": "Great Helmet! If fit our little Grand Daughter well. The helmet is very well made and has great padding",
      "rating": 5.0,
      "verified": true,
      "author": "Stan555",
      "helpful_votes": 0,
      "publication_date": 20160617
    },
    {
      "title": "Great for 1st Year Tee Ball",
      "text": "This helmet fits my almost 5 great old girl very well. She has a normal sized head I would say. Good protection esp for first year tee ball! ;)",
      "rating": 5.0,
      "verified": true,
      "author": "MetJet",
      "helpful_votes": 0,
      "publication_date": 20170603
    },
    {
      "title": "SUPER tight.",
      "text": "SUPER tight...my son can't put it on/take off without an adult pulling away the sides to get his head and ears in.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160719
    },
    {
      "title": "A good buy!",
      "text": "My two year old love this helmet! It is a nice size and not very heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "Nadeaja S.",
      "helpful_votes": 0,
      "publication_date": 20170518
    },
    {
      "title": "He enjoyed wearing with no complaints of discomfort",
      "text": "Bought for my 3 year old for his first year of T-ball. He is the smallest kid on the team, weighing in at under 40lbs. This fit him PERFECTLY. He enjoyed wearing with no complaints of discomfort.",
      "rating": 5.0,
      "verified": true,
      "author": "Miranda Taylor",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "Perfect fit for my 3 year old!!!",
      "text": "A perfect fit for my 3 year old son! This is his first year playing T-Ball, and I was worried that the helmet would be too large for his head, but if fits perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Ward",
      "helpful_votes": 0,
      "publication_date": 20150919
    },
    {
      "title": "Five Stars",
      "text": "Good size, snug fit - good for 4/5 yr old.",
      "rating": 5.0,
      "verified": true,
      "author": "KKane",
      "helpful_votes": 0,
      "publication_date": 20160531
    },
    {
      "title": "Disappointed",
      "text": "Disappointed, padding is already falling off the brand new helmet!",
      "rating": 2.0,
      "verified": true,
      "author": "Katie Kircher",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "This is a great helmet for the little ones",
      "text": "This is a great helmet for the little ones. Unfortunately, I had to return it because it was too small.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "Safety First",
      "text": "Cant wait to see the kids use these this weekend! They will look great!",
      "rating": 5.0,
      "verified": true,
      "author": "Frequent customer",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "Searched everywhere for a helmet for my son. All ...",
      "text": "Searched everywhere for a helmet for my son. All of the ones were just a tad to big for him. Took a chance with ordering online, I prefer having him try it on first. But it fit my 4 year old perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "3 year old fits great",
      "text": "This is the only helmet out there we found that fits a 3-4 year old well. My son will play tee ball this year and it stays on solid. Good air flow as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark J. Shive",
      "helpful_votes": 5,
      "publication_date": 20130221
    },
    {
      "title": "-) Fits his head great and the high gloss black finish really goes well ...",
      "text": "Ordered this for our 5 year old T-ball superstar. :-) Fits his head great and the high gloss black finish really goes well with his uniform pants and shoes. Great protection at a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Dynamice",
      "helpful_votes": 0,
      "publication_date": 20150513
    },
    {
      "title": "Exchange needed",
      "text": "I bought these for my grandsons and gave them to them at their first games and they were two small. They are perfect but I need a bigger size. It is past 30 days so it says I can not exchange for the correct size. Can an exception be made??",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey Johnson",
      "helpful_votes": 0,
      "publication_date": 20160614
    },
    {
      "title": "Great helmet, great value",
      "text": "I bought this helmet for my 5yo cousin. It was a perfect fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "He says its very comfortable.",
      "text": "My son loves this helmet. He says its very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Levey",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Easton Natural Tee Ball Helmet",
      "text": "My grandson loves his new helmet. I am pleased with the quality and price of the helmet.",
      "rating": 5.0,
      "verified": true,
      "author": "George L. Hernandez",
      "helpful_votes": 0,
      "publication_date": 20150921
    },
    {
      "title": "Five Stars",
      "text": "Fits a little small on a slim 4 year old",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Wallin",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "Fits Well",
      "text": "My daughter is 6 and some of the helmets the other kids have seem too big and heavy. This is just right. Optional face mask is good too, but I didn't get that.",
      "rating": 5.0,
      "verified": true,
      "author": "Goodbadnugly",
      "helpful_votes": 0,
      "publication_date": 20130428
    },
    {
      "title": "Works great.",
      "text": "Fits my four year old. Got it for tball. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "KJR",
      "helpful_votes": 0,
      "publication_date": 20150615
    },
    {
      "title": "Fits 3yr old perfect",
      "text": "Super lightweight. My son has a head circumference of 20.5 and this helmet fits great. He can put it on by himself without him feeling like it will rip his ears off. At only 15oz it doesn't affect his balance or make his head top heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20130426
    },
    {
      "title": "Great for little guy",
      "text": "My 4 year old insisted on getting a batting helmet. I was surprised to find such a tiny one that fits his small head perfectly. Very pleased with this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Bartnic",
      "helpful_votes": 0,
      "publication_date": 20131025
    },
    {
      "title": "Perfect fit! Reviews on here were true to their ...",
      "text": "Perfect fit! Reviews on here were true to their description. I bought the smallest Rawlings helmet and it wobbled on my sons head. If you need a helmet for your child who is \"petite\" this won't disappoint.",
      "rating": 5.0,
      "verified": true,
      "author": "Marjorie Acosta Hill",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "Wish it could have worked out.",
      "text": "Had to return the item because it was too small. But it looked like a great item.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy Glasscock",
      "helpful_votes": 0,
      "publication_date": 20140813
    },
    {
      "title": "This is a nice helmet. I like that it is not as ...",
      "text": "This is a nice helmet. I like that it is not as bulky as some of them since it is for younger kids. It seems like it would be great. However my son is only 3 and a half and he does not have a large head. This was too small for him so I'm not sure who it would fit.",
      "rating": 4.0,
      "verified": true,
      "author": "Emily KD",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "Five Stars",
      "text": "It does its job its a helmet and the smallest size you will find",
      "rating": 5.0,
      "verified": true,
      "author": "Joe77",
      "helpful_votes": 0,
      "publication_date": 20150523
    },
    {
      "title": "Perfect",
      "text": "Truly the smallest helmet in the market we've seen. It makes all the difference in the world for my little guy to be able to run the bases without having to hold a wiggly helmet to his head!",
      "rating": 5.0,
      "verified": true,
      "author": "KMBVa",
      "helpful_votes": 0,
      "publication_date": 20141031
    },
    {
      "title": "Three Stars",
      "text": "Bought it for my 2 and 1/2 year old grandson and it fits very tight.",
      "rating": 3.0,
      "verified": true,
      "author": "l.jackson",
      "helpful_votes": 0,
      "publication_date": 20170126
    },
    {
      "title": "Wont return helmet",
      "text": "Got the helmet and it was too small. They will not allow me to return it. Not happy with that.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "FINALLY!!!! A Helmet that fits",
      "text": "I just have to say that after 2 years of trying helmets on my now 6 year old son, this one fits perfectly. He has a small head, and every helmet we would ever try was always way too big. This helmet was on sale, so I gave it a shot, and it is great. I also ordered a fase mask that is required for dixie league play, so I just hope that it fits this helmet.",
      "rating": 5.0,
      "verified": true,
      "author": "bullinerfamily",
      "helpful_votes": 2,
      "publication_date": 20120620
    },
    {
      "title": "I was worried if it would fit my son head ...",
      "text": "I was worried if it would fit my son head. Light Weight and can fit in small book bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "Four Stars",
      "text": "The quality seemed excellent, unfortunately it did not fit my 6 y/o. Too tight.",
      "rating": 4.0,
      "verified": true,
      "author": "CS",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Helmet nice... Padding not so much",
      "text": "Foam padding is already starting to fall off the ear section of the helmet. It would hold up better if they made the padding all one piece instead of gluing a soft pad on top of the harder padding. Other than that the helmet fit perfect for our 5yr old and he uses it for his T-ball. Would have scored higher if padding was not falling off ours.",
      "rating": 3.0,
      "verified": true,
      "author": "3dmania",
      "helpful_votes": 0,
      "publication_date": 20150512
    },
    {
      "title": "Five Stars",
      "text": "Fit a two and a half year old very nicely with room for growth. He loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160125
    },
    {
      "title": "great fit for the 3-4yr olds",
      "text": "my son wouldn't take this off, he wears it every time he gets the bat out...great fit for the 3-4yr olds.",
      "rating": 5.0,
      "verified": true,
      "author": "russ",
      "helpful_votes": 0,
      "publication_date": 20141126
    },
    {
      "title": "Five Stars",
      "text": "Fits my 3 1/2 year old perfect, not too tight or too loose.",
      "rating": 5.0,
      "verified": true,
      "author": "SANDRA KENNEDY",
      "helpful_votes": 0,
      "publication_date": 20150329
    },
    {
      "title": "It is small",
      "text": "It is very small but does fit my grandson, age 4, at least for now. The team helmets were too large for him. So it works fine and will do for this season. Overall satisfied with quality and accurate description.",
      "rating": 4.0,
      "verified": true,
      "author": "sclahiga",
      "helpful_votes": 0,
      "publication_date": 20140329
    },
    {
      "title": "great helmet for the cost",
      "text": "great helmet for the cost. My daughter plays tball and they are required to wear a helmet even though there is virtual no chance of them getting hit in the head. This fills the need and fit great for my 5 year old.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina Taylor",
      "helpful_votes": 0,
      "publication_date": 20151215
    },
    {
      "title": "5 year old son great! loved it",
      "text": "Fit my 3.5 year old son great ! loved it !",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151026
    },
    {
      "title": "Nice tee ball helmet",
      "text": "Great helmet for my son's first tee ball season. It did feel a little tight. I should have measured his head first. It was fine this season but he couldn't wear it another year because it'll be too small.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly F",
      "helpful_votes": 0,
      "publication_date": 20160617
    }
  ],
  "product_meta": {
    "title": "EASTON 3.0 Tee Ball Batting Helmet | Youth | Black | 2019 | Dual Density Impact Absorption Foam | High Impact Resistant ABS Shell | Moisture Wicking BioDRI liner | Lightweight Comfort Padding",
    "description": "The solid color Easton Natural Tee Ball Batting Helmet offers impact protection, shock absorption, comfort and durability - all the qualities you've come to expect from an Easton product. While looking great on the outside, on the inside the helmet sports lightweight padding, dial-density foam liner for comfort and shock absorption and BioDri sweat absorbing liner. Your safety being the top priority, the Natural 3.0 meets NOCSAE standard for all levels of play. Concentrate on the game knowing that your dome is protected by reliable quality headgear.",
    "rating": 4.5,
    "feature_bullets": [
      "New lightweight internal padding",
      "High impact resistant ABS shell for maximum protection",
      "Dual-density foam liner for shock absorption and comfort",
      "BioDri padded inner liner absorbs moisture"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "11 x 8 x 9 inches; 1 Pounds",
      "Item model number": "A168019BK",
      "Department": "Unisex-adult unisex-child mens womens",
      "Date First Available": "08M 16, 2010",
      "Manufacturer": "Easton Sports, Inc.",
      "ASIN": "B003ZS8ZW4",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Batting Helmets",
      "Baseball",
      "Sports & Outdoors",
      "Team Sports",
      "Protective Gear",
      "Sports & Fitness"
    ],
    "price": ""
  }
}