{
  "website_summaries": [
    {
      "verdict": "Sony's midrange AV receiver improves on its predecessor with new HDMI features like standby pass-through and 3D compatibility, but it lacks a compelling reason to pick it over its competitors.",
      "pros": [
        "7.1 channel AV receiver",
        "four HDMI inputs",
        "graphical user interface",
        "analog video upconversion",
        "audio return channel support",
        "standby pass-through",
        "3D compatible"
      ],
      "cons": [
        "Not our top pick for sound quality",
        "requires $100 dock for iPod/iPhone connectivity",
        "competitors offer more HDMI inputs",
        "skimpy on extra features, such as traditional multiroom functionality and USB connectivity",
        "dynamic range compression turned on by default"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 6.0,
        "Performance": 6.0
      },
      "publication_date": 20100825,
      "rating": 6.7,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great product.",
      "text": "I read some of the negative reviews and I have never experienced anything close to that. I bought this in May 2011, it is now Nov 2018, and it has been great ever since. It works well with the two Sony tvs that I purchased in that time frame, with the XBR-65X900c being the latest.",
      "rating": 4.0,
      "verified": true,
      "author": "Maricus Lee",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Best AV for money",
      "text": "Great AV reciever, easy to use, easy to install. Had it up and running from my old AV reciever in about 30 minutes. The HDMI is awesome. I realize you have to click over from 1 HDMI to the other but i don't understand why people are \"annoyed\" with this, it is a quick push of a button. You can also just press HDMI 1, 2, or 3. Speakers sound great with it, i have a surround sound Insignia set-up and it sounds awesome. I also have a couple of floor standing 3 foot sony speakers they sound excellent also. I have no complaints for this unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 2,
      "publication_date": 20110324
    },
    {
      "title": "Good Value, Good Sound",
      "text": "I love how this STR-DN1010 receiver works seamlessly with my Sony TV. I know many reviews disliked the display but I found it easy to use. It was easy to select the sound source and easy to select the speaker configuration. My goal was to have a system that worked well with the surround sound of movies and also with my music. It is easy to switch form one speaker configuration for multichannel film sounds to a two channel music arrangement. My Bose bookshelf speakers have never sounded better. The price at Amazon was unbelievable.",
      "rating": 4.0,
      "verified": true,
      "author": "RDB",
      "helpful_votes": 3,
      "publication_date": 20110401
    },
    {
      "title": "good unit",
      "text": "Purchased this to replace a JVC unit that did not have hdmi inputs. The sound on the JVC was slightly better but to be fair it was thx certified and did cost 3 times as much as this sony. So far I've been very pleased. This model is new enough to have pass through for the 4 HDMI inputs and upscaling for the HDMI output, yet is old enough to have a good selection of pre-HDMI component and composite video connections. The speaker calibration process was very easy. Using the GUI and the manual is not so easy.",
      "rating": 4.0,
      "verified": true,
      "author": "Big D",
      "helpful_votes": 0,
      "publication_date": 20130108
    },
    {
      "title": "great receiver",
      "text": "Sony always make a great product, though the only bad thing is the price on some of their items, thank goodness for amazon...i have had a 5.1 for ever and committed to an 7.1 what a HUGE difference i have heard these in best buy showroom (7.1) surround, but to have your own and actually hearing it, what a diference 2 speaker make....this receiver has alot features and power, you don't have to spend alot of money to have quality...thankx",
      "rating": 5.0,
      "verified": true,
      "author": "johnny c",
      "helpful_votes": 0,
      "publication_date": 20120826
    },
    {
      "title": "Good Price for A/V Amplifier 7.1 Excellent Sound & 3D pass compatible",
      "text": "I've replaced STR-DG910 with this new STR-DN1010 mainly for 3D pass compatibility. The GUI (Graphics User Interface) is not bad, but is not GREAT. The sound is Excellent, I've used to have a little Zumm on the speakers with the old one, and a little sound's of the mechanisim of the Blu-Ray player too. NONE with this one. If you are looking for a good deal between Price & Features, this is it.",
      "rating": 4.0,
      "verified": true,
      "author": "Sergio Villa Ramos",
      "helpful_votes": 8,
      "publication_date": 20101016
    },
    {
      "title": "Excellent receiver",
      "text": "This is a fantastic, state of the art receiver. It has a very good dynamic range. It replaced my Sony D1010 receiver which served me well for 17 years and is just like new. I love my old receiver, and only replaced it for the 7:1 feature and the HDMI features. My mother now has it. It is hard to top the D1010, but this receiver is more state of the art. Very clean sound even at low volume. The price was also fantastic. I also hooked up my phono to it, and it works fine. Movie watching is a whole new experience. It makes you feel like you are in the movie.!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Airforce1",
      "helpful_votes": 0,
      "publication_date": 20120614
    },
    {
      "title": "Great reciever for this level of performance",
      "text": "No problems, works great primary use is DMPORT with SONY iPod Attachment. The only complaint I have is I wish it was a little more responsive when it comes to remote response. (I checked with new batteries, issue remained)",
      "rating": 5.0,
      "verified": true,
      "author": "C. Fox",
      "helpful_votes": 0,
      "publication_date": 20140806
    },
    {
      "title": "4 Year Update!!",
      "text": "Bought this from Amazon in 2011. GREAT for my home theater. Paired it with Sony BLU-RAY player and Polk Audio Speakers. It has been fabulous!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "good one",
      "text": "We use this for Netflix and any other kind of streaming that we have to do. It works really well we've had it for a couple years now and it's always done what it supposed to do.",
      "rating": 5.0,
      "verified": true,
      "author": "Alisha mccoy",
      "helpful_votes": 0,
      "publication_date": 20150301
    },
    {
      "title": "More than I expected",
      "text": "I bought this after Black Friday for a great price. This receiver is more than I expected. It does everything I want and way more. I purchased the SS7000 speakers and w3000 sub. The key to floor shaking sound is do not use auto calibration use the manual the system comes alive and will wake anyone sleeping a few houses away. It has plenty of HDMI inputs making it a great add on to my Sony Bluray and Samsung 9000 LED TV. I highly recommend this product to anyone not wanting to spend a fortune but will be more than impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Thrower",
      "helpful_votes": 2,
      "publication_date": 20110212
    },
    {
      "title": "good not great",
      "text": "The Amazon dealer that sent the A/V system was great with both price and service. The auto set up struggled to find the front speakers so after a while I figured out how to manually calibrate to my ear. I was surprised because I liked Sony products. Wild Bill",
      "rating": 4.0,
      "verified": true,
      "author": "will techy",
      "helpful_votes": 0,
      "publication_date": 20120220
    },
    {
      "title": "I love it",
      "text": "We use this for pandora in the kitchen so sound quality is not a huge concern. However, it has been great. The best part is that it turns off when I leave the house with my iPhone , so I never come home to a hot cabinet from the heat of an amp doing nothing. I am very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Basar Energy",
      "helpful_votes": 0,
      "publication_date": 20130122
    },
    {
      "title": "GREAT UPGRADE",
      "text": "I'm happy with my purchase, and I would recomend it. I transfered my HK AVR154 for this unit and it was abreeze to get it up and rrunning. I love the manual because its very descriptive about every advanced setting.This unit is running my NSZ-GT1 and my Sony Bravie TV, with of course the PS3. The sound is amazing, much less mudled than the older HK that I was using, and the picture is flawless. I have a LED LCD and the difference shows. By the way 7.1 is awsome with my BOSE set up.",
      "rating": 5.0,
      "verified": true,
      "author": "JMOB",
      "helpful_votes": 0,
      "publication_date": 20120205
    },
    {
      "title": "Nice design & features but I had quality issues",
      "text": "Overall, it is a nice unit and fairly easy to program. However, within the first 12 months the unit stopped switching to the selected A/V input. I returned the unit for warranty repair and the same problem occurred again about 10 months later. This unit is at the center of my entertainment system - between all of my A/V devices and the display. When it isn't working, the whole system is down for 2-4 weeks.",
      "rating": 3.0,
      "verified": true,
      "author": "Thomas Chiarella",
      "helpful_votes": 0,
      "publication_date": 20120806
    },
    {
      "title": "good receiver",
      "text": "I like it a lot and very happy with it. Great sound and connection capability. Not going to get a 5 star since it was difficult for me to adjust some settings at first. But now i got used to it and I know what i have to do to make my system work. Overall I recommend it!",
      "rating": 4.0,
      "verified": true,
      "author": "mauricio",
      "helpful_votes": 3,
      "publication_date": 20110412
    },
    {
      "title": "Sony STR-DN1010",
      "text": "Very Nice Receiver, Simple set up, Nice Remote, On Screen GUI is not the best. Small footprint, Sounds Good. I would recommend this to friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Walker",
      "helpful_votes": 2,
      "publication_date": 20110118
    },
    {
      "title": "Receiver failed at 2 years 1 month (warrenty = 2 years)",
      "text": "All, I purchased this receiver from Amazon in June 2010 and it failed this past Saturday. It will not power up and I can not reset as there is no power. I wasn't maxing out the power, just casually listening to music. I did not overwork this unit, only listening to surrond sound movies 3 times a week. The rest was mostly bypass for cable to run through it. For Sony to look at this, its $119. This was my third Sony reciever in 15 years (the other two still work, I just wanted hdmi)",
      "rating": 1.0,
      "verified": true,
      "author": "Eric L. Henry",
      "helpful_votes": 0,
      "publication_date": 20120726
    },
    {
      "title": "Great receiver, great price",
      "text": "Much better price that Best Buy. Receiver is great. Two comments: (1) took awhile to get acclimated to menu, then easy and (2) when switching video sources, it takes awhile (4-5 seconds) to update on the TV. Not a big deal, but it is frustrating to wait for.",
      "rating": 4.0,
      "verified": true,
      "author": "Timothy D. Williams",
      "helpful_votes": 2,
      "publication_date": 20101202
    },
    {
      "title": "sony receiver",
      "text": "had this receiver about 1 month and so far so good. excellent sound quality and the g.u.i. adjustments are easy. just follow along with the booklet. If it fails in the future I will follow up on this review.",
      "rating": 5.0,
      "verified": true,
      "author": "bill L",
      "helpful_votes": 0,
      "publication_date": 20121029
    },
    {
      "title": "Cranpa's gift to himself",
      "text": "Finally, after a long wait, got the new receiver. Looks and works fine. Only issue, is when I want to watch a Bluray, but not with receiver on, they are difficult to get to operate separately (both Sony products). Otherwise, very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Cranpa",
      "helpful_votes": 0,
      "publication_date": 20111016
    },
    {
      "title": "Great reciever.",
      "text": "This receiver rocks. Great sound and clarity. Plenty of power and looks awesome. Lots of features so it took some time to figure it all out, but once you use it a little it becomes easy.",
      "rating": 5.0,
      "verified": true,
      "author": "3Dexperience",
      "helpful_votes": 2,
      "publication_date": 20110228
    },
    {
      "title": "Excellent Product",
      "text": "It was the easiest installation I have ever done with a receiver. Having (4) HDMI ports made it very simple to install all my accessories. Sound quality is much better than my previous Sony HT-7000H. Service from Amazon.com was excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "azcottonwood",
      "helpful_votes": 2,
      "publication_date": 20110123
    },
    {
      "title": "Sony Receiver Review",
      "text": "Great purchase for the money - extremely pleased! Would recommend this equipment for anyone wishing to upgrade their entertainment system or to startup a new system.",
      "rating": 4.0,
      "verified": true,
      "author": "pago6491",
      "helpful_votes": 0,
      "publication_date": 20120703
    },
    {
      "title": "Sony STR-DN1010",
      "text": "I like sony products and the quality of this AV is just what I was expecting. Sounds much better than the previous models, has hdmi in and out, no doubt is a great receiver.",
      "rating": 5.0,
      "verified": true,
      "author": "R. V.",
      "helpful_votes": 0,
      "publication_date": 20101225
    },
    {
      "title": "2 units both defective",
      "text": "I've tried two of these STR-DN1010s. The first one had bad audio problems -- crunching, then would just quit. The second one would not pass the component video signals through, though the audio seemed to work for the 15 minutes I had it on. What's with Sony? I've been a Sony fan for a long time, but I am thinking Pioneer now...",
      "rating": 1.0,
      "verified": true,
      "author": "Jeffrey  and Danielle  Otterson",
      "helpful_votes": 10,
      "publication_date": 20101103
    },
    {
      "title": "Big Improvement",
      "text": "I've been using the new receiver for a few weeks now and since I was upgrading from a 12+ year old system, the sound is a big improvement. This may be in part to the automatic calibration during setup. This would have been a 5 star rating if it wasn't for the fact that the manual is horrible to read through and you need to do that to figure out which inputs go with what and the on screen menu is slightly confusing.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20100709
    },
    {
      "title": "Very unhappy",
      "text": "The idea that Bravia sync would work is great, however it is such a pain and this unit has NEVER worked right from day 1!! Yes I have read the manual, yes I am competent, no the product does not work as described. Don't buy...",
      "rating": 1.0,
      "verified": true,
      "author": "1371 Sui Generis",
      "helpful_votes": 0,
      "publication_date": 20120903
    },
    {
      "title": "Sony STR-DN1010 7.1-Channel A/V Blu-Ray Receiver [3D Compatible]",
      "text": "This equipment was purchase brand new; thought I have not installed it at this time; but I do know that it is a very good equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "James D. Kpoto",
      "helpful_votes": 0,
      "publication_date": 20110401
    },
    {
      "title": "Not what I am used to",
      "text": "I bought this product to replace my pioneer elite vsx 26 because blu ray was not in surround sound. There is a great difference between the two. The Sony just doesnt have what it takes. It sounds just like a cheap receiver, no power, no clarity. I guess you get what you pay for. Next time I would opt for a different model.",
      "rating": 3.0,
      "verified": true,
      "author": "skompa",
      "helpful_votes": 3,
      "publication_date": 20101228
    },
    {
      "title": "Just Average",
      "text": "I would not rate this product to be top notch. I originally bought this but returned it and replaced it with Onkyo TX-SR608. Which supports multi zone listening and in my opinion has much better features and qualities. The on ething annoyed me most about this sony receiver was the wire connectors on the back. They are sticky and very hard to fix. Poor quality can be felt easily.",
      "rating": 3.0,
      "verified": true,
      "author": "H. Mohammadpour",
      "helpful_votes": 2,
      "publication_date": 20100623
    },
    {
      "title": "Receiver",
      "text": "This works great. Has a lot of connection so you can connect your devices in whatever way you want to.",
      "rating": 5.0,
      "verified": true,
      "author": "rebelrick",
      "helpful_votes": 0,
      "publication_date": 20140223
    }
  ],
  "product_meta": {
    "title": "Sony STR-DN1010 7.1-Channel A/V Receiver (Discontinued by Manufacturer)",
    "description": "Take your high-definition surround sound experience to the next level with the STR-DN1010 7.1-channel Blu-ray Disc A/V receiver. Enjoy 3D images while hearing sound closer to the way it was captured, plus improve image quality of non-HD video sources to HD using one convenient cable. Offering plenty of connectivity options for your expanding lifestyle, this A/V receiver features 4 HDMI inputs, 3 component inputs and is SIRIUS Satellite Radio-ready. You can also share your music in multiple rooms with wireless 2nd zone technology.\n\nFROM THE MANUFACTURER\n\n\nTake your high-definition surround sound experience to the next level with the STR-DN1010 7.1-channel Blu-ray Disc A/V receiver. Enjoy 3D images while hearing sound closer to the way it was captured, plus improve image quality of non-HD video sources to HD using one convenient cable. Offering plenty of connectivity options for your expanding lifestyle, this A/V receiver features 4 HDMI inputs, 3 component inputs and is SIRIUS Satellite Radio-ready. You can also share your music in multiple rooms with wireless 2nd zone S-AIR technology.\n\n7 HIGH-DEFINITION INPUTS WITH AUDIO RETURN CHANNEL\nGet versatile HD connection options with five HD inputs. Four HDMI inputs (up to 1080/24p capable) let you connect a Sony PlayStation 3 entertainment system, Blu-ray Disc player, or any other HDMI-capable devices, for high definition video and audio. Three component inputs (1080/60i capable) provide added HD-capable connectivity and versatility.\n\nS-AIR ready to deliver room filling sound without the wires or hassle Audio Return Channel eliminates the need for extra cables connected to your TV. This feature allows audio to be sent from your compatible TV to your receiver through the same HDMI cable already being used to send audio and video to your TV.\n\n24P TRUE CINEMA MODE WITH BLU-RAY AUDIO DECODING (LPCM)\nWatch movies at their native frame rate 24p format (24 frames per second) when paired with a 24p playback device like a Blu-ray Disc Player or PlayStation 3 gaming console. And with Linear PCM support, when you connect via HDMI a Blu-ray Disc player that can decode the latest high definition audio formats, including Dolby TrueHD and DTS-HD Master Audio5 you can experience sound closer to the way it was captured.\n\nHDMI REPEATER WITH PASS-THROUGH\nConnect multiple devices via HDMI to your surround sound system, easily switch between them, and then connect everything to your HDTV with just one HDMI cable. Standby pass-through of audio and video conveniently access all your HDMI connected devices without having to power on the receiver.\n\nGet versatile HD connection with five HD inputs. Enlarge S-AIR WIRELESS SURROUND SOUND AND MULTI-ROOM READY\nThe STR-DN1010 is S-AIR Wireless surround sound ready--share music in up to 10 rooms when you add S-AIR receiver/speaker systems (AIR-SA10) and a S-AIR Card (EZW-T100) to your S-AIR-capable receiver (each S-AIR Speaker System sold separately). Enable the system to deliver room-filling surround sound without the hassle of custom installation or running speaker wires across the room. It's the simplest way to break music free from your home theater room, to send it all over the house.\n\nDIGITAL MEDIA PORT\nThe demand for digital audio and video content continues to be strong. Sony's DIGITAL MEDIA PORT (DMP) interface is a proprietary interface that adds networking and connectivity options to your home theater system. Just connect optional accessories (sold separately) which provide the ability to control and power devices while making set up easy and operation simple to use. The DMP will be compatible with various accessories which will include a PC Client ready device, Bluetooth adapter and Audio Docking stations compatible with select Network Walkman and iPod products. Regardless of where you store your music.\n\nBRAVIA SYNC COMPATIBLE\nConveniently operate and control other BRAVIA Sync compatible devices--including BRAVIA HDTVs, Blu-ray Disc Players, surround sound systems, Handycam camcorders and Cyber-shot digital still cameras, all with one remote control.\n\nDIGITAL CINEMA AUTO CALIBRATION\nEnsure you get the best sound experience from your surround sound system with Digital Cinema Auto Calibration. Simply place the included microphone where you will be seated and settings are automatically optimized based on the distance, delays and placement of your speakers.\n\nTECHNICAL SPECIFICATIONS\n * Display: 10 digit dot matrix\n * GUI: Yes (Simple)\n * GUI Blending (Composite/Component/HDMI): Yes(-/-/Yes)\n * Panel: BD Matching Design\n * A/V In/Out (S-Video I/O): Including Front AV: 4/1(0/0)\n * Analog Audio In (Inc TV CEC)/Out (excl. tuner)/TV(CEC): 2/1/Yes\n * Coaxial: 1/0\n * Component Video In/Out (Pass through): 3/1\n * DMPORT: 1\n * Digital Input Assign: Yes\n * Front Input: AV(Gold)\n * HDMI In/Out: (Front input): 4/1\n * Monitor Out (S-Video Out): 1(0)\n * Opt. In/Out/TV(CEC): incl Front input & TV (CEC): 3/0/Yes\n * Pre Out: SW x1\n * SPDIF UPDATE: Yes\n * Receiver Dimension (WxHxD): 17\" x 6-1/4\" x 12-7/8\"\n * Receiver Weight: 19 lb",
    "rating": 3.4,
    "feature_bullets": [
      "7.1-channel A/V receiver with 110 watts per channel, 3D HDMI pass-through",
      "7 HD video inputs (4 HDMI, 3 component)",
      "Upconvert/Upscale from analog to 1080p via HDMI",
      "On-screen graphical user interface for ease of use",
      "You can also share your music in multiple rooms with wireless 2nd zone technology"
    ],
    "specifications": {
      "Product Dimensions": "6.2 x 16.93 x 12.78 inches",
      "Item Weight": "19.84 pounds",
      "Manufacturer": "Sony",
      "ASIN": "B003JC3Z58",
      "Item model number": "STRDN1010",
      "Customer Reviews": "3.4 out of 5 stars73 ratings3.4 out of 5 stars",
      "Best Sellers Rank": "#343,028 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 26, 2010"
    },
    "categories": [
      "Receivers",
      "Home Audio",
      "Home Theater",
      "Electronics",
      "Receivers & Amplifiers"
    ],
    "price": ""
  }
}