{
  "website_summaries": [
    {
      "verdict": "The Yamaha YSP-4100 offers better surround effects, superior sound quality and more features than competing sound bars, but it's expensive and most buyers won't need all its functionality.",
      "pros": [
        "Sound-bar home theater system (no AV receiver required)",
        "best-in-class virtual surround processing and overall excellent sound quality",
        "four HDMI inputs",
        "three digital audio inputs",
        "analog video upconversion",
        "wireless music streaming from an iPod with included adapter",
        "wireless subwoofer kit included",
        "Sirius-ready",
        "FM tuner",
        "automatic speaker calibration"
      ],
      "cons": [
        "Very expensive",
        "doesn't support 3D video pass-through",
        "no subwoofer included",
        "much larger than many competing models",
        "a true 5.1 home theater system sounds better"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 9.0,
        "Performance": 8.0
      },
      "publication_date": 20100609,
      "rating": 8.1,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "I'll never go back to speakers every again.",
      "text": "I have owned a Yamaha sound bar for quite some time now. I bought this to upgrade for more HDMI inputs. Its perfect. Looks super slick and works much better. There is no more 5 beam, 3 beam constant choices. Just surround and stereo. Nice and simple. One note is that you need a particular kind of furniture to support an object of this size and width.",
      "rating": 5.0,
      "verified": true,
      "author": "Vincent Garguilo",
      "helpful_votes": 0,
      "publication_date": 20140312
    },
    {
      "title": "Best single bar surround sound speaker on the planet",
      "text": "I've tried many others, this is the best. Once calibrated its unreal how real this sounds. You can also use it as your receiver so it eliminates clutter in the room. Even better when paired with a Yamaha sub.",
      "rating": 5.0,
      "verified": true,
      "author": "NHota",
      "helpful_votes": 0,
      "publication_date": 20140324
    },
    {
      "title": "Simplistic, effective home theater",
      "text": "We had an earlier model of the Yamaha sound projector for many years, a YSP 1000 and had always been satisfied. When recently deciding to upgrade to a larger HDTV we elected to upgrade the Yamaha as well. It, when paired with a subwoofer delivers full rich 5.2 surrround sound in a 450 sqft room",
      "rating": 5.0,
      "verified": true,
      "author": "AAHenderson",
      "helpful_votes": 0,
      "publication_date": 20140310
    },
    {
      "title": "perfect",
      "text": "It is perfect for my audiovisual room. The sound is just great plus no wirings, no clutters.., just clean crispy sound",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio G. Vasquez",
      "helpful_votes": 0,
      "publication_date": 20131207
    },
    {
      "title": "Better than I am expecting",
      "text": "Very easy to set up, superb performance I have get rid of all may bulky speakers and amplifier I am very happy with the product",
      "rating": 5.0,
      "verified": true,
      "author": "emre eroglu",
      "helpful_votes": 0,
      "publication_date": 20130503
    },
    {
      "title": "great soundbar when matched with subwoofer",
      "text": "If you don't have the space for a 5.1 or 7.1 system then this is one of the better options available. It has the option for auto set-up or manual set-up if you prefer. But to get the best sound you really need to match with a good subwoofer. I bought the Yamaha YST-SW315 subwoofer and have no regrets. It matches very well.",
      "rating": 4.0,
      "verified": true,
      "author": "scott",
      "helpful_votes": 3,
      "publication_date": 20130601
    },
    {
      "title": "outstanding",
      "text": "The Yamaha YSp-4100BL is everything that it's review claimed it is. Far superior to the other less expensive competitive sound bar models in construction and performance. In this case, \"You get what you pay for!\".",
      "rating": 5.0,
      "verified": true,
      "author": "romo",
      "helpful_votes": 0,
      "publication_date": 20111223
    },
    {
      "title": "Great sound.  But not 3D ready",
      "text": "Great sound. But the box says it's 3D ready. When turning on my sound system it indicated Firmware vers 5x.... Which needs to be upgraded to 7x... to allow 3D display and audio. The only way to upgrade the firmware is to get a CD of the firmware and connect through an optical cable using a CD player. Or bring it to an authorized dealer. Irritating to say the least.",
      "rating": 4.0,
      "verified": false,
      "author": "Harold Koslowski",
      "helpful_votes": 0,
      "publication_date": 20130401
    },
    {
      "title": "Fantastic Sound Bar",
      "text": "The B&W Panorama sound bar was my first choice but pricey at $2300. A friend of mine who manages an high-end audio store and familiar with both the B&W and Yamaha lines suggested I look at the Yamaha 4100 specifically. It had more features and was almost $700 less. I took his suggestion and have been extremely happy with the YSP-4100. After upgrading the 4100's firmware to the latest version 7.0.3, 3D HDMI pass thru from my Samsung 3D Blu-Ray to Samsung 3D TV also worked properly.",
      "rating": 5.0,
      "verified": false,
      "author": "Cellphone User",
      "helpful_votes": 31,
      "publication_date": 20110105
    },
    {
      "title": "41oobL",
      "text": "I had the ysp/ upgraded to the 4100 BL -- LISTEN: the movie theater CANT TOUCH U -- this is a MUST HAVE--let R2D2 (the mic) calibrate the room and BOOM-- I put in the LIVE M.jackson in wembley change the setting to concert hall it put me like I was THERE--Jurassic Park part 3 w/ a good subwoofer they were N my livin room--NO complaints about this sound projection",
      "rating": 5.0,
      "verified": false,
      "author": "gregg2kool",
      "helpful_votes": 0,
      "publication_date": 20140129
    }
  ],
  "product_meta": {
    "title": "Yamaha YSP-4100BL Digital Sound Projector (Black)",
    "description": "Yamaha YSP-4100BL Digital Sound Projector in Black\n\nFROM THE MANUFACTURER\n\n\nTHE YAMAHA YSP-4100 DIGITAL SOUND PROJECTOR: THIN IS IN\nWhen it comes to innovation, sometimes less is more: the YSP-4100, for example. It's much thinner than previous YSP models for a slimmer, more elegant appearance appropriate for your HDTV or OLED TV. Yet its room-filling surround sound is spectacular.\n\nThe YSP-4100 Digital Sound Projector offers great new features like HD Audio decoding, 1080p-compatible HDMI (4 in and 1 out), IntelliBeam calibration, UniVolume, and numerous listening modes. Also included are two yAired wireless accessories for connecting to your iPod/iPhone and wireless subwoofer. \n\n\n\n\nHOW DIGITAL SOUND PROJECTOR TECHNOLOGY WORKS\nAccurate Projection of Sound Waves Creates Realistic Surround Sound from a Single Speaker Cabinet\n\n\nFive surround sound channels are directly projected from the YSP;\ninnovative acoustic technology creates two more \"phantom\" channels\n\nThe slim and elegant YSP-4100 on the\noptional YTS-T500 pedestal stand\nThe YSP-4100 uses Yamaha's sophisticated Digital Sound Projector (DSP) technology to precisely control the orientation of the sound by focusing it through multiple beams. The center channel sound is heard directly, while sounds from other channels are heard after reflecting off walls. The result is true multi-channel surround sound that sounds just like a multi-speaker system--but without the need for extra speakers. \n\nAnd it works in any room. Yamaha's eleven CINEMA DSP program settings are guaranteed to create thrillingly realistic soundscapes no matter what your room's dimensions. The main mode is 5-Beam + 2 for 7-channel sources, but you can also choose from 3-Beam + Stereo + 2, 5-Beam, 3-Beam + Stereo, 3-Beam or Stereo, depending on the type of source and your room acoustics, so you'll always be able to get the right sound from your space. \n\nHigh-Defintion Audio Decoding for the Latest Digital Formats\nThe YSP-4100 ensures that you hear the best possible sound from any high-definition source, such as Blu-ray. It is capable of decoding the two lossless high-definition audio formats (Dolby TrueHD and DTS-HD Master Audio) as well as the two lossy audio formats (Dolby Digital Plus and DTS HD High Resolution) for the best sound from any source. \n\n\n\n\n\n\nThe YSP-4100 features 40 beam drivers and two 4-1/2\" woofers\nView Larger ELEGANT, SPACE-SAVING DESIGN\nBuilt-In Digital Amplifiers Mean No Need for Bulky Added Equipment\n\nThis slim unit has everything necessary for projecting true surround sound built-in: DSP for Digital Signal Processor, 40 beam drivers, two woofers and digital amplifiers. No other receiver, amplifier or speakers are necessary, making the system extremely compact and economical. This also makes it handy for use in a different room (zone) in a custom multi-zone system. What's more, the shape is even thinner (3-1/2\" depth) than previous YSP models. \n\n\n\n\nADDED RECEIVER AND AMPLIFIER FUNCTIONS FOR MAXIMUM PERFORMANCE\n\nReplace your complicated receiver and audio setup with a single cabinet.\nShown with optional YTS-F500 floor stand\n1080p-Compatible HDMI (4 In/1 Out)\nThe YSP-4100 provides HDMI connections (4 in/1 out), with support for 1080p resolution. You can connect multiple HDMI sources and enjoy the highest possible video quality when using a 1080p monitor like Deep Color, x.v.Color and Auto Lip-Sync. It is also capable of repeating 1080p/24fps signals from HDMI input to output, maintaining the superior image quality from Blu-ray Disc players and HDTV set top boxes. \n\nAnalog Video to HDMI Digital Video Upconversion\nThe YSP-4100 provides upconversion of video composite and component signals to HDMI. The signal can then be output via a single HDMI cable to a monitor for enjoying high-definition video quality. \n\nIntelliBeam Automated System Calibration\nThis Yamaha-exclusive feature ensures optimum multi-channel sound reproduction with accurate image location. By monitoring and analyzing the sound with the microphone included with the YSP-4100, Intellibeam automatically sets the best beam angles, while optimizing the level and frequency response of each beam. It also offers Direct Start function via remote unit. This makes initial setup both extremely simple and acoustically perfect. \n\nUniVolume\nThis welcome feature, made possible by Yamaha-developed technology, maintains a consistent volume level between different channels, programs, commercials and input sources. It can be switched on and off. \n\nHDMI CEC Functionality\nWhen the YSP-4100 is connected to a CEC (Consumer Electronics Control)-compatible TV, the YSP-4100 will turn on and off together with the TV, also allowing you to use the TV remote to control the YSP-4100 volume. With CEC engaged, signals will pass through the YSP-4100 even if it is off. CEC also provides advanced functionality with other components. \n\nDigital Music Enhancer for MP3 Audio\nWhen music is encoded into a digitally compressed format like MP3, the frequency response suffers. This function restores what was lost, so your music always sounds the way it should. \n\n\n\n\n\nINCLUDES SELECT YAIRED ACCESSORIES FOR WIRELESS CONVENIENCE\n\nIncludes a SWK-W10 wireless subwoofer receiver and a\nYIT-W10 wireless transmitter for iPod/iPhone yAired Technology for Wireless Connections\n\nThanks to Yamaha's yAired technology, you can use your YSP-4100 with an iPod and subwoofer without having to connect any cables. The yAired link transmits uncompressed data (linear PCM) so there is no loss of signal data--unlike systems that use Bluetooth technology to send compressed data--to ensure maximum sound quality. \n\nCharge Your iPod or iPhone and Use It as a Wireless Source \n\nThe YIT-W10 provides wireless connection capability to your iPod. This allows you to use the iPod as a remote control while listening to your iPod music, and provides synchronized power on/off. In addition, the iPod charges when it is in the included charging cradle. \n\nMake Any Subwoofer a Wireless Subwoofer\n\nThe SWK-W10 allows the wireless connection of any subwoofer for boosting bass sound. Simply connect the SWK-W10 receiver to any subwoofer make or model to turn it into an instant wireless subwoofer. And if you're using your iPod/iPhone as a source via the YIT-W10, turning on the iPod/iPhone automatically turns on the YSP-4100 and the wireless subwoofer. \n\n\n\n\nWHAT'S IN THE BOX?\n * One Yamaha YSP-4100 unit\n * Remote control and batteries\n * One Yamaha YIT-W10 for iPod/iPhone wireless dock\n * One Yamaha SWK-W10 for subwoofer wireless receiver\n * Intellibeam microphone (for calibration)\n\n\n\n\n\nOPTIONAL ACCESSORIES (SOLD SEPARATELY)\n * The Yamaha YTS-T500 Integrated TV/ Soundbar Pedestal. The YTS-T500 supports both units on top of a rack, table, etc.\n * The Yamaha YTS-F500 Integrated TV/Soundbar Floor Stand.\n * The Yamaha SPM-K30 Optional Wall Mount Bracket.\n\n\n\n\n\nTECHNICAL SPECIFICATIONS\n * Speakers Section:  * 1-1/2\" x 40 beam drivers\n    * 4-1/2\" x 2 woofers\n   \n   \n * Digital Amplifiers: 120W total power: 2W x 40 beam drivers + 20W x 2 (woofer)\n * Standby Power Consumption: 0.5W\n * Dimensions (WxHxD): 40-1/2\" x 8-3/8\" x 3-1/2\"\n * Weight: 22 lbs",
    "rating": 3.4,
    "feature_bullets": [
      "Has HD audio decoding",
      "Built-in DSP, speakers and apmplifiers with no need for additional speakers and cables",
      "UniVolume keeps volume during TV programs and commericals at the same level",
      "iPod/iPhone connectability via included wireless transmitter",
      "New slimmer design, matching the latest slim flat screen TVs"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3.5 x 40.5 x 8 inches; 22 Pounds",
      "Item model number": "YSP-4100BL",
      "Department": "Home Audio Speakers",
      "Date First Available": "January 15, 2010",
      "Manufacturer": "Yamaha Audio",
      "ASIN": "B0034G4H24",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Home Audio",
      "Electronics",
      "Speakers"
    ],
    "price": ""
  }
}