{
  "website_summaries": [
    {
      "verdict": "If you're looking for baking sheets that you can clean in the dishwasher, this will become your go-to set.",
      "pros": [
        "Made from heavy-weight aluminized steel for superior heat conduction and even baking",
        "Wire rod-reinforced rims prevent warping",
        "Easy-release, silicone-based, non-stick coating",
        "Includes cooling rack and two pans",
        "Dishwasher safe, but hand-washing is recommended"
      ],
      "cons": [
        "Nonstick coating can wear off"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Pans failed twice, major quality control issue needs attention!",
      "text": "I ordered this set, one pan's finish bubbled on the SECOND use. I returned the set and got a replacement set (hassle). Pan's finish bubbled on the FIRST use on the replacement set. I never used either pan above 350 degrees, which is below the max temp shown in the instructions for use. There is something going wrong with the finish on these pans! I am very gentle with all my cooking pans, only hand wash them, never use scratchy pads or the dishwasher, and always use at or below recommended temps. Chicago Metallic needs to get a handle on what's going wrong in the manufacturing process before they sell more of these.",
      "rating": 1.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 14,
      "publication_date": 20180531
    },
    {
      "title": "Don’t waste your money or time",
      "text": "By far the worst baking sheet I have ever owned! The first set I got I used maybe 2 times before the coating bubbled and peeled. I thought maybe it was something I did wrong so I filed a claim on their site and they sent me a new set for free (great customer service!) I used the new set maybe a total of 4 times(hand washing every time) and the same result...bubbling and peeling! Don’t waste your money! Go buy pans at Walmart....surely you can find better quality than this!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190508
    },
    {
      "title": "disappointed in this product",
      "text": "The non-stick coating came off with the food residue as I was washing the baking pan after less than 5 months of use. Tried to get Chicago Metallic to replace their defective pan, they refused. They referred me to Amazon. Amazon said it was a Chicago Metallic problem and Amazon referred me back to Chicago Metallic. Amazon could not/would not replace the product either.",
      "rating": 1.0,
      "verified": true,
      "author": "Mary Jones",
      "helpful_votes": 4,
      "publication_date": 20181127
    },
    {
      "title": "Good but came damaged.",
      "text": "I actually like these pans, They’re good. Deserving of a higher review perhaps but they care damaged. I bought 4 for my wife while I was away and 2 of them came dented. Other reviews list the same issue. It’s weird because honestly they seem sturdy, but who wants to buy one that come already pre dented.",
      "rating": 3.0,
      "verified": true,
      "author": "J Ewing",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Great quality and function",
      "text": "These are really great quality. I was worried that because of the dark color things would char (as is reported for other dark cooking surfaces) but these do a great job. Excellent size as well, very big. Some gripe that there's only 1 rack, but that's just fine for me. These pair nicely with some silicone inserts I got. Very easy to clean. We'll see in some years, but they appear to be holding up well and not collecting grime or char.",
      "rating": 5.0,
      "verified": true,
      "author": "ACZ",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Love these things!",
      "text": "These are such nice, large cookie trays. Built like tanks with a nice non-stick finish. I had no idea they were quite as heavy-duty as they were when I pulled them out of the box. The only downside is that they are quite heavy, but if they weren't I would doubt they were made of steel. I don't think they'll ever warp. The cookie cooling rack is nice, but I wish there were two. All in all, great pans.",
      "rating": 4.0,
      "verified": true,
      "author": "Lallen",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Disappointed",
      "text": "I’ve always loved the quality of Chicago Metallic sheet pans. These are my first time purchase of the non stick ones, very sturdy and the pans do not warp at all. Cleaning is a breeze! This is an update to these pans ! The nonstick coating is flaking off and rusting the pan now, I will never purchase these again and will only buy the regular ones from now on",
      "rating": 5.0,
      "verified": true,
      "author": "M. Hallmann",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Arrived damaged",
      "text": "I purxhased Chicago Metallic for it's high reputation for quality. I don't know whether the product was previously damaged, damaged by Amazon and shipped anyways, or damaged by UPS even though the box did not appear damaged. No time to return as I have holiday baking to do and don't have the time.",
      "rating": 2.0,
      "verified": true,
      "author": "gilmoregirl",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Large, heavy, and high quality",
      "text": "These pans are awesome! Love that they are very large and great quality -- they're quite heavy. The rack fits perfectly in the pan and is perfect for roasting veggies like brussel sprouts or carrots. It really helps things come out crispy! Just wish this came with two racks instead of one.",
      "rating": 5.0,
      "verified": true,
      "author": "CK",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Coating is peeling after two months!",
      "text": "Don't buy this! I typically buy pan sets from a big box retailer, but I wanted a better set. I followed the care instructions but within two months, the coating developed several small (appox. a fourth of an inch) bubbles, then the coating peeled off.",
      "rating": 1.0,
      "verified": true,
      "author": "kychdi",
      "helpful_votes": 3,
      "publication_date": 20181028
    },
    {
      "title": "One Month Use Non-Stick coating coming off! Ewww!",
      "text": "After regular use for about a month the non stick coating started peeling up had to throw them out! Waste of money! Buyer Beware!",
      "rating": 1.0,
      "verified": true,
      "author": "Denis Z.",
      "helpful_votes": 2,
      "publication_date": 20181120
    },
    {
      "title": "Tried and True - the ONLY bakeware you'll ever need!",
      "text": "VERY sturdy and wonderfully non-stick. I have used these pans every day (from baking cookies to roasting veggies) since purchase and they are top notch. Clean up was SO easy!! I also own their roasting pan and plan to gradually wean all other bakeware from my house and replace it with Chicago Metallic products. Tried and true. There is no substitute.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa C",
      "helpful_votes": 0,
      "publication_date": 20171031
    },
    {
      "title": "Great deal!",
      "text": "2 nice jelly roll pans. Sturdy and durable. Easy to use. Comes with cooling grate. Great pricing. Won't see that price again! Already went up!",
      "rating": 5.0,
      "verified": true,
      "author": "Gail Sutton",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "WOW- Nice Heavy duty and stable pans",
      "text": "We finally got to use these pans since we are baking for the holidays. I have to say that these exceed my expectations in every way. Large heavy duty pans that DO NOT WARP and produce even heat while being easy to clean. These Irecommend highly.",
      "rating": 5.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Non-Stick coating on one pan peeled",
      "text": "After first use, the non-stick coating on the first pan bubbled and peeled. I have not tried the second pan. I Requested an exchange, and will see if the next set has the same problem. It was not used above 450 degrees or under a broiler.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard ",
      "helpful_votes": 2,
      "publication_date": 20181114
    },
    {
      "title": "Great Rack!",
      "text": "I purchased these mainly because of the rack. I've seen the rack and tray on cooking shows but couldn't find them locally. I have baking cookie cooling racks but don't work very well when I make Chinese Lemon Chicken. Breading 1\"x 1\" pieces of chicken, then deep frying them twice, once at low and then high was much easier with the rack and tray than paper towels on cookie sheets. I just need to get another rack for the second cookie sheet. These are heavy duty items. I have several Chicago Metalitems including Madeleine Teflon coated pans which are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy Joe",
      "helpful_votes": 0,
      "publication_date": 20120714
    },
    {
      "title": "My wife couldn't be happier with these baking sheets.",
      "text": "These are great quality, very solidly built (don't warp under heat), heavy construction, and very much non-stick. My wife loves them for a variety of cooking applications. My wife is a normal cooker, not some pro baker and not running a commercial restaurant. With that said, she is completely happy with these and if you use these for normal home cooking, you'll be pleased too.",
      "rating": 5.0,
      "verified": true,
      "author": "Carne aTodda",
      "helpful_votes": 0,
      "publication_date": 20161016
    },
    {
      "title": "VERY high quality sheet pans",
      "text": "These are VERY high quality sheet pans. I honestly didn't expect these to be of such high quality, they are equal to some Cuisinart brand sheet pans I have. Heavy duty, Air insulated, Non-Stick, Exactly what I needed to bake more cookies or cook more bacon all at one time. The only thing I wish they had included a non-stick cooling rack / cooking grid instead of just the standard stainless version.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael R.",
      "helpful_votes": 0,
      "publication_date": 20150919
    },
    {
      "title": "Fantastic pans",
      "text": "I bought these as a gift but when they arrived I was shocked at how heavy the box was. When I took the pans out of the box I almost didn't want to give them away! If you're looking for pans that won't warp and heavy duty these are the ones to get. My son, king of the frozen foods, has gone through so many cookies sheets that I decided to get him some decent ones. BONUS - you get the cooling rack. It is a great size and will fit a tray full of cookies on the rack.",
      "rating": 5.0,
      "verified": true,
      "author": "Salem in Texas",
      "helpful_votes": 0,
      "publication_date": 20130103
    },
    {
      "title": "Great Pan!",
      "text": "We had a friend accidentally leave one of these pans at our house after a party we had. After over a year of having it, we finally returned and broke down and bought our own. Having 2 new ones is awesome. These pans are wonderful and we are so happy we have 2 now instead of 1. Great price for an awesome pan!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Easy clean, works great",
      "text": "Works great. Bought it for bacon in the oven. Cleans very easy!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Top quality cookie sheet",
      "text": "Ordered two before. My wife wanted the same sheet but with a cooling rack, hence this order. It would have been nice to have two cooling racks with the two sheets not just one.",
      "rating": 5.0,
      "verified": true,
      "author": "William L.",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Wondering about the finish.",
      "text": "Bought 2 sets of these. Have only used the sheet pans from one set, but the racks from both. The non-stick finish on one of the pans has already started to peel off after a couple of uses. The other pan looks just like new. Wondering how long these will last given the inconsistency of the finish materials.",
      "rating": 1.0,
      "verified": true,
      "author": "Wesley Girlinghouse",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "The pan's finish doesn't last even under light use",
      "text": "I've owned these pans (I bought a set of two w/rack) for 3 months. I've only used the one in the picture about 10 times in a 350 degree oven. I appears that when hot oil drops on the surface, it lifts. I do not recommend these pans. I've had them too long for me to return them.",
      "rating": 1.0,
      "verified": true,
      "author": "750ml",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Wonderful product!",
      "text": "These were a gift for my neighbor who does a lot of baking and she raved about them! She's also my best friend and shares her baked goods with me, so it was a win-win purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula Bueche",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Non stick coating peeled off",
      "text": "Bought these pans about 5 months ago. I like the weight of these pans and they are easy to clean. However, the non stick coating has started to bubble and come off the pans. I have only used for standard baking up to 375 degs. Overall disappointed in this product and would not order again.",
      "rating": 2.0,
      "verified": true,
      "author": "Italian Chef",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Measure your oven before you buy!!!",
      "text": "I roasted a chicken in this pan. It was perfect, and pan was a snap to clean. HOWEVER, the pan only fit on the very bottom of my oven, too large for the racks, so I gave them to my daughter who loves to cook and has a more traditional oven. We used Thanksgiving, with great results. I am looking for a smaller version for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly Joseph",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Love These Pans",
      "text": "They are perfect size and very sturdy. Easy to clean as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Taber",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "disappointed",
      "text": "really liked these cookie sheets in the beginning but after a couple months the non stick coating is peeling and only washed by hand.",
      "rating": 2.0,
      "verified": true,
      "author": "steve",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Horrible",
      "text": "This product is horrible. All coating falling off after about 5 uses.",
      "rating": 1.0,
      "verified": true,
      "author": "Christine Tilley",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "WORTH EVERY DOLLAR!!!!",
      "text": "These are awesome cookie /sheet cake pans. Have owned this set for 1 year or so, and they have held up fantastic! I also use them for homemade pizza and they DO NOT flex (as some cheapies do!). Also have withstood pizza cutter abuse much better than expected. The rack is great for multiple use's, just very satisfied with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "R. S. Ash",
      "helpful_votes": 0,
      "publication_date": 20131104
    },
    {
      "title": "One of the baking pans came with a dent in it.",
      "text": "One of the pans came with a dent in it!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Great value",
      "text": "These are the best cookie sheets I have found yet. Heavy duty and good non-stick coating. I threw away two of my other sheets once I used these one time. Not the cheapest but I feel I got more than I paid for.",
      "rating": 5.0,
      "verified": true,
      "author": "R-Star",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Just what I needed",
      "text": "LOVE. My boyfriend surprised me with these and I absolutely love the quality and the cooling racks",
      "rating": 5.0,
      "verified": true,
      "author": "thecartrunnethover",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Wonderful cookie sheets",
      "text": "VERY heavy so they don't buckle. The cooling rack is a great addition to the set. we use both all the time and if we needed more would not hesitate to re-order. I like the fact that they are not a \"flat sheet\" so they can be used for more than just cookies. Great drip pan also. Very easy to clean too.",
      "rating": 5.0,
      "verified": true,
      "author": "Clifton R. Woods",
      "helpful_votes": 0,
      "publication_date": 20130114
    },
    {
      "title": "Great!",
      "text": "Love! Best baking sheets I have used. Quality is amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Maureen U.",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Non Stick coating peeled off after 1 use.",
      "text": "Baked Pork Chops at 475, went to rinse the pan under hot water, and coating was washing off. Never even used a brush on it.",
      "rating": 1.0,
      "verified": true,
      "author": "Peter Obermann",
      "helpful_votes": 2,
      "publication_date": 20181018
    },
    {
      "title": "Great pans",
      "text": "These pans are great. Very sturdy and do not warp. They are also very easy to clean and do not scratch easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeannie",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Well made- serious heavy weight sheet pans",
      "text": "The pans are a great substantial weight, and the non-stick coating is quality. Cooling rack is nothing to write home about.",
      "rating": 5.0,
      "verified": true,
      "author": "PickyChick",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Quality product!",
      "text": "These are really nice sturdy pans. They clean easly and still look almost brand new after a few uses. The rack we use to put fries and chicken strips on so they bake more evenly.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Mattingly",
      "helpful_votes": 0,
      "publication_date": 20170328
    },
    {
      "title": "Heavy duty!",
      "text": "These are amazing and surprisingly heavy duty. So far I've used them for roasting veggies, works so much better than regular cookie sheet since they have higher sides. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "DH",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "Great quality",
      "text": "These are excellent. I have been looking for good cookie sheets that don't break the bank & these are the ones. So far we have baked on them several times & they still look brand new.",
      "rating": 5.0,
      "verified": true,
      "author": "SwirlMom2",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Amazing! Exactly as described and nothing sticks",
      "text": "Amazing! Exactly as described and nothing sticks. Even heat distribution.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee H",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "nice heavey pans",
      "text": "I have been having problems with pans lately. they warp and don't last for very long. So I went looking for something with a bit better quality. I found it with these pans. They are allot heavier built and don't bend and warp like the pans I was picking up at the stores around here",
      "rating": 5.0,
      "verified": true,
      "author": "just me",
      "helpful_votes": 2,
      "publication_date": 20130208
    },
    {
      "title": "Disappointed",
      "text": "The nonstick coating bubbled up and is peeling off when washed. Only used a few times for baking. (375 degrees)",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "These Pans Are Great!",
      "text": "This set is definitely high quality! Heavy duty, non-warp kind of material! I am very pleased that I bought this set, I use these pans and cooling racks for many different types of cooking. I have no problem recommending these to anyone interested! You won't be disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "iskeyedive",
      "helpful_votes": 0,
      "publication_date": 20120622
    },
    {
      "title": "Great purchase",
      "text": "As someone who is still learning to cook, I realized I needed a pan with a wire rack. I didn't think I needed two pans, but got this anyway. I'm so glad I did. Cleaning the wire rack is best in the dishwasher, but the pans are very easy to wash by hand. Very good quality item.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Maillet",
      "helpful_votes": 0,
      "publication_date": 20130718
    },
    {
      "title": "Coating flaked off within weeks",
      "text": "The teflon coating bubbled up then flaked off in big chunks within the first few uses.",
      "rating": 1.0,
      "verified": true,
      "author": "Cory Pantelakis",
      "helpful_votes": 2,
      "publication_date": 20181102
    },
    {
      "title": "These are great heavy duty pans",
      "text": "These are great heavy duty pans. Have been using Calaphon but always a hassle to clean. These are just as heavy but are so easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce D.",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "Nothing Better",
      "text": "I have just ordered my second set of these. The first is 4 years old and I have used them for everything. I roast vegetables, bake cookies, bake pizzas and roast chicken. I cook bacon in the oven on the cooling grid, I use the grid for cooling cookies after I bake them. I love these pans. They might not fit lengthwise, side by side on one shelf of my oven, but I forgive them. After 4 years of constant use and even dishwasher cleaning, they are still working fine. I just honestly, wanted another set!",
      "rating": 5.0,
      "verified": true,
      "author": "Hiawhatha",
      "helpful_votes": 6,
      "publication_date": 20120518
    },
    {
      "title": "Great for what I use them for",
      "text": "I love this set. I have been looking for a set that has a cooling rack that fits right in perfectly. The only downside is not to the products themselves but to the set. What I really wanted was two pans AND two cooling racks. I could not at the time of purchase find just a cooling rack identical to this to have that, I had to check a bunch of kitchen stores. Still, very nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew C Webber",
      "helpful_votes": 0,
      "publication_date": 20140411
    },
    {
      "title": "Excellent weight, not flimsy",
      "text": "Excellent weight, not flimsy. Good non stick and easy clean up. So good so far! I have to say, anything I have purchased from Chicago Metallic has been a good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20150529
    },
    {
      "title": "Coating peeled off after a couple of uses.",
      "text": "This seemed perfect, but the coating peeled off after only a few uses.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily E.",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "A big step up from my old not-so-non-stick pans ...",
      "text": "Love these baking pans. They are heavy gauge, and the coating is indeed non-stick. Clean up easily and are holding up well in the few months I've been using them. Great value in non-stick bakeware.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20160415
    },
    {
      "title": "Decent, but buckle/warp in the oven",
      "text": "Chicago is typically known for good cookie sheets. These unfortunately buckle in the oven. Better than most though.",
      "rating": 3.0,
      "verified": true,
      "author": "Biscuits",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "Don’t buy.",
      "text": "Don’t recommend this product. As you can the coating came off of a new sheet pan. Unfortunately I served the steaks with the coating without noticing.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa M. Novelli",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "so far so great!",
      "text": "Ordered these to make a lot of cookies for son's party. I had no problems what so ever. Cookies came out evenly and uniform. Includes cooling rack too. I thought the price was fair and using Prime, I received these in two short days.",
      "rating": 4.0,
      "verified": true,
      "author": "Apes",
      "helpful_votes": 0,
      "publication_date": 20110805
    },
    {
      "title": "Durable and sturdy!",
      "text": "I think Chicago Metallic products are heavier and better made than others on the market and these are no exception. They look great!",
      "rating": 5.0,
      "verified": true,
      "author": "Christina Snodgrass",
      "helpful_votes": 0,
      "publication_date": 20160209
    },
    {
      "title": "Good Quality",
      "text": "I love these. I just wish that they came with two cooling grids instead of just one. I intend to go back to the product and see if I can order just the grid. Good heavy quality.",
      "rating": 5.0,
      "verified": true,
      "author": "OBXJoe",
      "helpful_votes": 0,
      "publication_date": 20131022
    },
    {
      "title": "Good size for the parchment paper",
      "text": "Very heavy pans. No warping in the oven. Good size for the parchment paper. Caused crisp bottoms to the biscuits.",
      "rating": 5.0,
      "verified": true,
      "author": "halfsister",
      "helpful_votes": 0,
      "publication_date": 20160120
    },
    {
      "title": "Amazing",
      "text": "This pan is amazing. The cookies I have made on this have hard edges and a soft middle. Best pan ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Absolutely Love!!",
      "text": "What a pleasure it is in today's world when you end up purchasing a WELL MADE PRODUCT. Absolutely Love!!",
      "rating": 5.0,
      "verified": true,
      "author": "ms.turtle",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Another satisfied customer, and one who'll return",
      "text": "Item arrived on time and as described by seller. It fits the bill perfectly. Quality merchandise. Another satisfied customer, and one who'll return.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron G.",
      "helpful_votes": 0,
      "publication_date": 20141122
    },
    {
      "title": "Very satisfied",
      "text": "I like them, a lot. Very heavy duty. They do get a touch hotter that the cheap ones you might be used to but it's only a few minutes less bake time.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy Stanton",
      "helpful_votes": 0,
      "publication_date": 20141128
    },
    {
      "title": "Very good pans",
      "text": "Really like these pans. I have used the metal tray inside much more than I thought I would. They clean up very easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Trials rider",
      "helpful_votes": 0,
      "publication_date": 20150912
    },
    {
      "title": "Five Stars",
      "text": "When it comes to bakeware, my opinion is that no one can even come close to Chicago Metallic.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry Edwards",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Otherwise they are very good pans.",
      "text": "Was going for 5 star, but, I baked meatballs on the tray and they left a stain!! Otherwise they are very good pans.",
      "rating": 4.0,
      "verified": true,
      "author": "eileen bauer",
      "helpful_votes": 0,
      "publication_date": 20150616
    },
    {
      "title": "easy clean up and the cooling rack is so nice ...",
      "text": "heats and cooks evenly, easy clean up and the cooling rack is so nice for cooling your finished product.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel A.",
      "helpful_votes": 0,
      "publication_date": 20160219
    },
    {
      "title": "Five Stars",
      "text": "Heavy duty pans requested by my niece for her wedding shower.",
      "rating": 5.0,
      "verified": true,
      "author": "C. A. Ripperda",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "Nice quality",
      "text": "I am happy with this set. It is exactly as described. Nice and heavy duty with a great non-stick surface. The cooling rack is an added bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "Sinclairika",
      "helpful_votes": 0,
      "publication_date": 20140212
    },
    {
      "title": "Great for Baking Sweet Potatoes Fries.",
      "text": "I use this to make sweet potatoes fries and it makes it nice and crispy. I have no complaints regarding so far. Will keep you posted.",
      "rating": 5.0,
      "verified": true,
      "author": "LilWaif",
      "helpful_votes": 0,
      "publication_date": 20140805
    },
    {
      "title": "Don't warp!",
      "text": "First baking sheets I ever had that don't warp in a hot oven. The extra cost is worth the quality of these pans. The rack is handy too.",
      "rating": 5.0,
      "verified": true,
      "author": "wendy",
      "helpful_votes": 0,
      "publication_date": 20140119
    },
    {
      "title": "Five Stars",
      "text": "Nice clean pans, well made, fit with racks I bought for them for baking bacon.",
      "rating": 5.0,
      "verified": true,
      "author": "WP",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Surface is chipping",
      "text": "I love the sturdiness of this cookie sheet but after a few washes the non stick surface is chipping off.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "seems like good deal, yum love that teflon-esce coating",
      "text": "especially like the wire rack that fits inside it came with, excellent for making spinach chips",
      "rating": 4.0,
      "verified": true,
      "author": "oliver dreher",
      "helpful_votes": 0,
      "publication_date": 20150627
    },
    {
      "title": "Solid pan and not over-sized",
      "text": "heavy gauge, not your thin variety which was what I expected.No Flexing I was pleasantly surprised.",
      "rating": 4.0,
      "verified": true,
      "author": "TeeKila",
      "helpful_votes": 0,
      "publication_date": 20150624
    },
    {
      "title": "the wife loves them",
      "text": "the wife loves the pans and she uses them once a week holding up great no issues probably going to buy her more of them",
      "rating": 5.0,
      "verified": true,
      "author": "carl easley",
      "helpful_votes": 0,
      "publication_date": 20140530
    },
    {
      "title": "It’s a great cooking sheet that doesn’t twist.",
      "text": "Like the sturdiness but it is a little heavy., but understandable trade off.",
      "rating": 5.0,
      "verified": true,
      "author": "Ferdinand L. Schwartz",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Heavy duty",
      "text": "Not the flimsy thin pans that warp with the first sign of heat. work great and the cooling rack is fantastic, it holds every thing that you can bake in one pan.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles E. Koenen",
      "helpful_votes": 0,
      "publication_date": 20140518
    },
    {
      "title": "Gave as gift",
      "text": "Bought these as a gift for my niece and she loves them. Good quality at a reasonable price and came fast and well packed",
      "rating": 5.0,
      "verified": true,
      "author": "moviesme",
      "helpful_votes": 0,
      "publication_date": 20140109
    },
    {
      "title": "Five Stars",
      "text": "this works great I use them for cooking bacon in the oven and it comes out just right",
      "rating": 5.0,
      "verified": true,
      "author": "charles cross",
      "helpful_votes": 0,
      "publication_date": 20150302
    },
    {
      "title": "Coating bubbled & came off",
      "text": "Non-stick coating bubbled & came off after a few uses. Avoid these.",
      "rating": 1.0,
      "verified": true,
      "author": "Alan Gibson",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Worth the money!",
      "text": "Well made, cooks evenly and worth every penny I spent! You get two heavy pans and a sturdy warming rack!",
      "rating": 5.0,
      "verified": true,
      "author": "anonymous",
      "helpful_votes": 0,
      "publication_date": 20131114
    },
    {
      "title": "Great cookie sheets.",
      "text": "These are heavy duty, high quality cookie sheets that bake better. They do not warp or twist while heating in the oven.",
      "rating": 5.0,
      "verified": true,
      "author": "James W.",
      "helpful_votes": 0,
      "publication_date": 20130323
    },
    {
      "title": "Five Stars",
      "text": "We love it for cooking bacon in the oven, just wish there were 2 wire racks.",
      "rating": 5.0,
      "verified": true,
      "author": "Popcorn",
      "helpful_votes": 0,
      "publication_date": 20140718
    },
    {
      "title": "Five Stars",
      "text": "such a good solid pan and I love that it came with a wire rack :)",
      "rating": 5.0,
      "verified": true,
      "author": "Kriss F.",
      "helpful_votes": 0,
      "publication_date": 20140720
    },
    {
      "title": "Great Pans!",
      "text": "These are really nice pans. I use them alot for baking and they have not warped or changed in any way. Very nice and sturdy. Great Quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffanee Bruchu",
      "helpful_votes": 0,
      "publication_date": 20130228
    },
    {
      "title": "Three Stars",
      "text": "Liked the durable coating. Product quality was marred by 2 small dimples in one of the sheets.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "otherwise pretty good pans",
      "text": "When I use the tray on the pan, there are marks where the tray rests on the pan, as if the coating on the pan is coming up. if you do use the tray on the pan, be gentile. otherwise pretty good pans.",
      "rating": 2.0,
      "verified": true,
      "author": "Chen Ry",
      "helpful_votes": 0,
      "publication_date": 20150907
    },
    {
      "title": "Fantastic pans! I have two sets of these",
      "text": "Fantastic pans! I have two sets of these, and they are great. They have a decent weight to them. The grate fits perfectly into them. I would recommend them to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "seebaj",
      "helpful_votes": 0,
      "publication_date": 20151226
    },
    {
      "title": "Great idea, not so sure of quality",
      "text": "I bought these pans for meal prep. They were great for cooking a week’s worth of veggies and protein easily and quickly. After two months, however, the non-stick coating is chipping off of one of my pans.",
      "rating": 1.0,
      "verified": true,
      "author": "George K",
      "helpful_votes": 3,
      "publication_date": 20171029
    },
    {
      "title": "Great pans!",
      "text": "I use these pans almost every day. Strong enough so they don't warp when baking like the thinner pans do. I can make two large meatloafs at a time now without worrying about spills. Love them!",
      "rating": 5.0,
      "verified": true,
      "author": "ELMA5600",
      "helpful_votes": 2,
      "publication_date": 20120517
    },
    {
      "title": "Great gift set",
      "text": "Gave these pans as a gift and the recipient is very pleased with the quality and ease of use. I have received kudos and my give more as gifts at a future date.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean C Hastings",
      "helpful_votes": 0,
      "publication_date": 20131115
    },
    {
      "title": "Quality!",
      "text": "These are super durable sheet pans. The reason for four stars is that they are quite heavy. While I know that means that they're good quality, I've almost dropped them a few times because I was surprised by their weight.",
      "rating": 4.0,
      "verified": true,
      "author": "MMcCurdy",
      "helpful_votes": 0,
      "publication_date": 20170320
    },
    {
      "title": "but work great.",
      "text": "Others buckle when heated - these don't. A bit heavy, but work great.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Reno Patterson",
      "helpful_votes": 0,
      "publication_date": 20140709
    },
    {
      "title": "High quality heavy built",
      "text": "This is not a light weight pan! Appreciate the sturdiness and the no stick is a breeze to clean up",
      "rating": 5.0,
      "verified": true,
      "author": "Darin Hegland",
      "helpful_votes": 0,
      "publication_date": 20130530
    },
    {
      "title": "Love the versatility",
      "text": "Love the versatility of this pan however cleaning of pan not easy.. had to throw one of the pans out after making chicken .Also wire rack rusted in the dishwasher.",
      "rating": 2.0,
      "verified": true,
      "author": "FLORIDA BLISS",
      "helpful_votes": 0,
      "publication_date": 20131211
    },
    {
      "title": "MADE IN CHINA",
      "text": "This is a gift so I can't comment on its cooking quality. I was under the impression that it was made in the USA but I was wrong. MADE IN CHINA.",
      "rating": 1.0,
      "verified": true,
      "author": "r voogd",
      "helpful_votes": 7,
      "publication_date": 20131206
    },
    {
      "title": "Solid no stick pans",
      "text": "I like these no stick pans. They are heavy-weight and don't warp like some of the lighter pans I've had before. The cooling rack is sturdy too. I should add that the only thing that killed my older pans was my tendency to use sharp objects like pizza slicers and knives. Eventually I cut through the no stick, but even with many scratches they still performed very well until I finally got tired of the slowly increasing stick factor. I've ran them through the dish washer numerous times on high heat dry cycle (regular detergent) too.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Au",
      "helpful_votes": 4,
      "publication_date": 20171206
    },
    {
      "title": "BEWARE! Cheap junk at premium price!",
      "text": "Had this baking sheet set since Nov '18. Used the pan maybe five times. Only hand washed. Non-stick coating flaking off in chunks in multiple locations. Chicago Metallic provides lifetime warranty - EXCEPT - you have to pay to ship the pan (and purchase a specialty size box) to them for exchange... that's nearly $20! WHAT A RIP-OFF! Thanks Amazon!",
      "rating": 1.0,
      "verified": true,
      "author": "David B.",
      "helpful_votes": 0,
      "publication_date": 20190408
    }
  ],
  "product_meta": {
    "title": "Chicago Metallic Professional Non-Stick Cookie/Jelly-Roll Pan Set with Cooling Rack, 17-Inch-by-12.25-Inch",
    "description": "At Chicago Metallic, we believe that serious baking requires serious bakeware. That's why we've been crafting innovative equipment, for professionals and serious home bakers, for over 100 years. We've built a global reputation one kitchen at a time. People know our products are built for durability and can be depended on year after year. We're proud to offer three distinct lines of premium bakeware plus stylish, innovative specialty bakeware and baking essentials. The Chicago Metallic Professional line of bakeware makes cooking and baking a delight. The non-stick surface easily releases each recipe and makes clean-up effortless. It's the preferred choice of bakers who understand quality and design, but also want professional-grade durability. This set of Cookie Sheets/Jelly Roll Pans are ideal for sweet treats like jelly rolls, bars, and cookies but can also be used to make one-sheet-pan meals, roast vegetables, reheat leftovers. The Baking Rack is perfect for cooking bacon in the oven or cooling freshly baked cookies. These pans are made from heavy-weight aluminized steel for superior heat conduction and even baking. They features an easy release, silicone based, non-stick coating for ease of baking and cleanup. Non-stick 3-piece set includes (2) cookie/jelly roll pans and 1 cooling rack pans measure 16 by 12 by 2-Inch, rack measures 16-1/2 by 11-1/2-Inch; half sheet pan. Outside measurements of the baking sheets are 17.75-inch-by-12.9-inch-by-1-incce and the bottom of the pan measures 16.75-inch-by-12-inch. Oven safe to 450°F / 232°C; not intended to be used under the broiler. Sharp-edged utensils and knives should not be used.",
    "rating": 4.2,
    "feature_bullets": [
      "IDEAL FOR BAKING MULTIPLE DISHES: The Chicago Metallic Non-Stick Baking Sheet Set is ideal for all types of baking and cooking. Have the flexibility to bake jelly rolls, bars, cookies, one-sheet pan meals, roast vegetables or reheat leftovers",
      "CONSISTENT HEAT DISTRIBUTION: The baking sheet is made from heavy-weight carbon steel to evenly disperse weight and heat for consistent baking results. Suitable for all oven types",
      "NON-STICK COATING FOR EASY RELEASE: The Chicago Metallic Baking Sheets and Cooling Rack feature a non-stick surface. The non-stick coating calls for an exceptional baked good release and easy clean up",
      "THE PERFECT SIZED BAKING SHEET SET: The sheets feature a wire rod reinforced rim to prevent any warping. The 2 baking sheet pans measure 17.75\" x 13\" x 1\"; inner dimensions are 17\" x 12.25\"x 1\". The cooling rack measures 16.75\" x 11.5\"",
      "SPACE SAVING STORAGE: This non-stick baking sheet is easy to store and can be stacked within other baking sheets, making it a great space saver in the cupboard, drawer, or countertop rack",
      "DISHWASHER SAFE FOR FAST CLEAN UP: This baking sheet is dishwasher safe, making clean up fast and easy, however hand washing is recommended to extend product life"
    ],
    "specifications": {
      "Product Dimensions": "16.75 x 12 x 1 inches",
      "Item Weight": "2 pounds",
      "Manufacturer": "Chicago Metallic",
      "ASIN": "B003YKGR9Q",
      "Item model number": "16833",
      "Customer Reviews": "4.2 out of 5 stars354 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#54,259 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "July 20, 2010"
    },
    "categories": [
      "Baking & Cookie Sheets",
      "Home & Kitchen",
      "Bakeware",
      "Kitchen & Dining"
    ],
    "price": 29.09
  }
}