{
  "website_summaries": [
    {
      "verdict": "Protect your home against heat loss from the inside and the outside with this two-roller blocking system.",
      "pros": [
        "Designed for doors with extra-large gaps",
        "Fits doors up to 36 inches",
        "Hook-and-loop closure creates a secure fit",
        "Provides sound dampening between rooms",
        "Keeps warm air in and bugs out",
        "Stays in place well"
      ],
      "cons": [
        "Product requires cutting and assembly",
        "it is not ready to use out of the box",
        "May not slide easily across the floor"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I brought this product last year, and reordered again ...",
      "text": "I brought this product last year, and reordered again. It is the not same and quality product. Here is the picture of the to prove it.",
      "rating": 1.0,
      "verified": true,
      "author": "Dong Tai",
      "helpful_votes": 358,
      "publication_date": 20160705
    },
    {
      "title": "Bought for noise reduction; does the trick!",
      "text": "I wanted something that would keep the noise out to be honest. I live in a small NYC apartment with roommates, and my doors are french doors. I wanted something to fit underneath that would serve specifically to reduce noise, but also not be a pain when I opened and closed the doors. It works wonderfully! It reduces the noise level from outside, and vice versa. The talking and tv in the living room is muted, and I have been told my phone conversations are quieter! So perfect for what I needed! Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Meagan",
      "helpful_votes": 68,
      "publication_date": 20170526
    },
    {
      "title": "Good for Stopping Smells",
      "text": "I love this product. I got it because my neighbor was smoking right outside my front door and I couldn't stand the smoke smell when I came home from work. I am so happy that this door guard stopped the smoke smell. It was not hard to install. My door was slightly difficult to close the first time I put it down, but after the third close, the door closed fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 55,
      "publication_date": 20161117
    },
    {
      "title": "Could definitely be better in several areas",
      "text": "I always try to look for a reason to leave a positive review, but it's just about impossible in this case. I agree with some of the reviews I've seen about the design being poor. You have to realign/adjust the guard practically every single time you close the door or it won't shut. Also, for some doors that aren't as wide, you have to fold the cloth nearly in half before Velcro-ing it down. As a result, the cloth is just hanging there loosely and doesn't look good at all. With a little more effort, these could be really nice, but they didn't meet my expectations.",
      "rating": 2.0,
      "verified": true,
      "author": "Jacob",
      "helpful_votes": 34,
      "publication_date": 20170831
    },
    {
      "title": "Drafts Weren't A Problem, But Noise Was - Now It's Better",
      "text": "I bought this to go under my bedroom door to help block out sound, not drafts, but it does a pretty good job. Assembly and fitting is easy enough, you just cut the excess off each closed-cell foam tube, close the fabric case, and shove it under the door. This is not going to soundproof anything, but it does cut down on the noise compared to the 2\" gap that used to be under my bedroom door. Just remember - measure twice and cut once! It won't work nearly as well if you cut too much foam off.",
      "rating": 4.0,
      "verified": true,
      "author": "Casey Hendley",
      "helpful_votes": 64,
      "publication_date": 20150116
    },
    {
      "title": "Makes opening and closing your door almost impossible because there is nothing to hold it in place.",
      "text": "Once the product has been applied to the door, there is nothing holding the item in place. Other items use an elastic bungee to hold the product to the door so that one may still open and close their door. The material that covers the Styrofoam core is thick and seems durable. But, again, if you want to be able to open and close your door, this product is not for you. The Duck brand draft guard is better in my opinion after using both. However, the Duck brand draft guard's outer material is a cloth like velour which seems less durable.",
      "rating": 1.0,
      "verified": true,
      "author": "Mallory Johnston",
      "helpful_votes": 12,
      "publication_date": 20170517
    },
    {
      "title": "Great!",
      "text": "So, we don't use this for it's intended purpose. One of our cats is impossible to sleep with, so we lock her out of the bedroom at night. However, she likes to meow loudly under the door and reach her paw under and shake the door (she's incredibly ridiculous). We got this to stop her from doing this, and it works perfectly for that! I can't say how it works for stopping drafts though...",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 9,
      "publication_date": 20180227
    },
    {
      "title": "Save your money",
      "text": "This product works fine I'm sure with keeping a draft out, IF it would consistently stay in one place, there's no way for this to stay flush against the door, this is NOT something for real gaps, this is just something you throw on doors that are already fine for added comfort. Save your money and have your landlord fix your gap or get it repaired yourself. EVERY single time we go to open the door it slides down and rolls under the door. Garbage, and it's supposed to work on carpet which we have.... haha NO. Save your money",
      "rating": 1.0,
      "verified": true,
      "author": "Lelia-Beth",
      "helpful_votes": 10,
      "publication_date": 20170625
    },
    {
      "title": "Unimpressive Product",
      "text": "Very unimpressed by this item. I have a standard size door and this product was oversized for the door, following the instructions on the package I trimmed it to fit. Once I trimmed it the product no longer velcroed shut - the Velcro would not reach. The extra fabric constantly slips out from under the door and hangs over. I should have known this product would be disappointing when the box had misspelled words and cheesy photos. Overall the product is very poorly made.",
      "rating": 1.0,
      "verified": true,
      "author": "LLB",
      "helpful_votes": 5,
      "publication_date": 20191026
    },
    {
      "title": "Simple and Effective",
      "text": "I was a little worried that this wouldn't work due to some of the one-star reviews, but these work perfectly in my place. I have bamboo floors with about 1.5 inch gap. I've attached a video so you can see how they work.",
      "rating": 5.0,
      "verified": true,
      "author": "Jumpriver",
      "helpful_votes": 743,
      "publication_date": 20130216
    },
    {
      "title": "Horrible quality.",
      "text": "I bought couple of these last year and was very satisfied. It was good quality and blocked draft and noise pretty good. I needed one more and ordered it. This time, it was horrible. Two Styrofoam rods were very small and they were bent to fit in the box. Material quality was horrible as well. I don't think this can sufficiently block draft, and it won't be able to block sound at all. If this was more expensive, I'd just return it, but it's too cheap to bother.",
      "rating": 1.0,
      "verified": true,
      "author": "B. Shin",
      "helpful_votes": 3,
      "publication_date": 20180730
    },
    {
      "title": "KNOCK OFF PRODUCT!",
      "text": "THIS IS A KNOCK OFF PRODUCT! This should be illegal to sell. It is a direct knock off of the product found at the big box store but this is a CHEAP CHINESE REPLACEMENT. The only guarantee you have here is that you’ll be returning it. DO BOT BUY.",
      "rating": 1.0,
      "verified": true,
      "author": "Esquire",
      "helpful_votes": 3,
      "publication_date": 20191117
    },
    {
      "title": "I cant believe this company pulled a fast one on me",
      "text": "I ordered a second one for our back door because the first one i ordered for our front door worked so well amd great quality material. Well the second one came in a knock off box and wasnt made nearly as well as the first one. Looked like an entirely different product. There wasn't even any adhesive to seal the thing to the door the way the 1st one had so I wound up diy'ing it because it's less hassle than trying to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Tonia Gaskins",
      "helpful_votes": 2,
      "publication_date": 20191112
    },
    {
      "title": "NOT AS ADVERTISED - KNOCK OFF BRAND POS",
      "text": "Bought this \"same\" item a year or more ago and just reordered another to receive this POS. The box it arrived in was a knock off and is not what is advertised. The foam is incredibly skinny and not at all like the one I got before. Not tall enough to even cover the gap under the door and so flimsy. I already threw the box away otherwise I would return it. Not happy to have wasted $20 on this. The beige brown one is the one I ordered a while back and the dark brown one is the one I just received. Annoyed that they're selling this as if it were the described item.",
      "rating": 1.0,
      "verified": true,
      "author": "Francheska S.",
      "helpful_votes": 2,
      "publication_date": 20200524
    },
    {
      "title": "Misleading product name",
      "text": "The packaging is sneaky \"Twin Draft Guard Extreme\" sounds like it's for extreme temperatures but really it's for \"Extra Large Gaps\". I was able to see light under two exterior doors and using this makes one of them unusable because the cloth is nearly too bulky to go under the door. Even on the one useable door, the draft guard tends to slide out and prevent the door from closing. It's okay for a temporary solution or for a door you don't use frequently.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 3,
      "publication_date": 20180122
    },
    {
      "title": "Works keeping fumes from entering",
      "text": "Our door leads straight to the sidewalk of a crowded neighborhood block. People smoke lots of marijuana by the sidewalk of our non-smoking-mandated building, in spite of this not being allowed. Marijuana fumes used to enter into that door every single time they smoked it outside. When we affixed this door draft stopper using nuts and a screwdriver, it is now pressing firmly against the floor. No more fumes – whether marijuana or cigarettes – have entered ever since.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "A VERY successful, satisfactory purchase.",
      "text": "This draft stopper is exactly what I need. An added, unexpected bonus is that it not only keeps drafts at bay, there is also much less noise leaking into the room. I wanted a draft stopper that would stay in place and not need constant adjusting. Mission accomplished! I also like that the foam baffles can be removed so the casing can be washed. A VERY successful, satisfactory purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "djc",
      "helpful_votes": 5,
      "publication_date": 20170313
    },
    {
      "title": "Inexpensive and they really work",
      "text": "This is an easy product to test. When I put them under the doors of my kids who are off to college, their rooms are markedly colder. No heat is bleeding under their doors and this is saving me a bundle. I also put one under our back door to the outside and held a candle by the base of the door. The candle did not flicker at all, whereas before the Draft Guard was in I could feel the cold on my feet. They are very easy to install and I was able to cut them to size. In to have a product that lives up to its advertising.",
      "rating": 5.0,
      "verified": true,
      "author": "Chin Music",
      "helpful_votes": 2,
      "publication_date": 20180228
    },
    {
      "title": "Sound absorption and draft elimination!",
      "text": "I live in an apartment complex and bought this to help with the noise from the hallway. I live with two dogs that bark at the sound of people walking past our door. Not sure what to do, I looked into this product and am so happy with the results. This item fits snuggly under the door working to keep our air conditioning inside, but also absorb the noise from the hallway. The dogs have gone from barking multiple times a day to barely at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexa",
      "helpful_votes": 25,
      "publication_date": 20161024
    },
    {
      "title": "TL;DR multiple wrong colors",
      "text": "So I’m all for mishaps and such. I originally tried to order the navy version of these. The dark brown one came. It wasn’t a super big deal so I kept it. Well the 2nd one came and it WAS navy so I used it on my daughters door. I ordered a THIRD and now this is desert brown. (I think) I’m slightly color blind so maybe it’s beige/olive green/sand? Not entirely sure what I’m supposed to do now as I’m tired of waiting and sending things back. Fix this.",
      "rating": 1.0,
      "verified": true,
      "author": "Raven Sheets",
      "helpful_votes": 2,
      "publication_date": 20180901
    },
    {
      "title": "Great Disappointment",
      "text": "I bought this product thinking it was a solution for the the front door. I would never recommend this product o anyone. It is the first purchase that I have made from Amazon that I am so disappointed about the quality of materials. I followed the instruction to custom cut the fit and even then the door did not close. If I were to cut off more of the styrofoam it would leave a gap for the air to still come under the door. I ordered a door draft from another company and it is aesthetically appealing and keep the warmth in the house and not out under the door.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171030
    },
    {
      "title": "Better than nothing",
      "text": "Essentially all this product is is two small (thin) pool noodles and a pillow case. If you know that, you can really make your own for cheaper. That being said, instructions were easy to follow and I was able to slide under my door. I had to cut them shorter than the recommended 1/2 inch, though, because at a certain point they quit sliding. And the extra fabric at the end makes shutting my door somewhat hard. I’m sure they will work fine for the area they cover, but there is still a 2 inch gap that bugs & air can still get through. There are probably higher quality products out there, but this is probably better than nothing.",
      "rating": 2.0,
      "verified": true,
      "author": "Coastie84",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Works but not for long",
      "text": "I purchased this from the warehouse and the product and box were in \"like-new\" condition. However, the product is cheaply made. If you plan on using daily or more often, it's going to fall apart quick. We purchased for our bedroom door to stop light/noise for a night-shift worker. It does do what it's supposed to do, but, as mentioned, it has started to come apart after only a short time. When you trim it to fit, the velcro that is attached ends up being useless. If you are handy, 2 pieces of pipe insulation and some fabric would do the same job probably for less money.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Definitely a knock off",
      "text": "This must not be the intended product. I saw other reviews saying it was a knock off and i crossed my fingers it wasnt - well the box looks like a bad photocopy with misspellings and other red flags. Then the product itself was SUPER flat and small. Prior reviews said this would be good for a large door gap but it would not fit my door, just slid right over it. I did not get exact measurements but the foam had to be under 1\" diameter Returning and back on the hunt...",
      "rating": 1.0,
      "verified": true,
      "author": "Deanna",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Won't Work For Everyone",
      "text": "This didn't work as expected for me as I have a metal plate that interferes. This means the door won't shut all the way unless I remove the plate because the fabric catches and bunches. What I did appreciate was the design and easy assembly. It's sturdier than a product I bought several years back. Instead of having the guard go under the door, I put the styrofoam roll bar flush along the bottom and place my shoes against it. It's good enough to stop the night drafts, which was my main concern.",
      "rating": 3.0,
      "verified": true,
      "author": "pimster",
      "helpful_votes": 3,
      "publication_date": 20170213
    },
    {
      "title": "Terrible dust collector.",
      "text": "Imagine taking the cheapest crap cloth you can find, slapping it together with some loose and shoddy stitching, and then chopping two foam noodles and stuffing them all into a bag together. I literally mistook this product as packing material when it arrived in a box with other things. The fabric is also that gross fabric that every stray fur and lint sticks to. This product is gross.",
      "rating": 1.0,
      "verified": true,
      "author": "DrowsyKitten",
      "helpful_votes": 2,
      "publication_date": 20180505
    },
    {
      "title": "This thing fell apart after a few months of use ...",
      "text": "This thing fell apart after a few months of use. It did it's job by filling the gap under my door, but started to get stuck under the door and jammed the door. Eventually it started to come apart so badly, that it got jammed under my door while the door was closed, and needed to be cut apart to be removed to free the door. I just use a towel instead now. Not worth the anxiety of not knowing whether or main entry door will be jammed shut or not.",
      "rating": 1.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 3,
      "publication_date": 20170603
    },
    {
      "title": "Cheap and not worth it",
      "text": "It's literally two styrofoam tubes inserted in a cloth. Not worth the price at all as you can find plenty of heavier duty ones that do a better job. I really wanted one that I didn't have to move back and forth as I opened the door but I would rather mess with that hassle than this useless thing. Granted my door is set a little higher so the gap is larger and this thing would get caught under the door constantly, but if you have a normal door with a wooden floor this might do something... not much though.",
      "rating": 2.0,
      "verified": true,
      "author": "Asim",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Pretty good product!",
      "text": "We replaced the carpet in our room with wood floors. Just like old people, old houses are crooked and uneven in so many places. We had a serious 2” gap under our door that let all the AC out. This product was easy to install, has helped keep the room insulated and cool, and helped block out noise and light from the hall. The only drawback was the small adhesion table that came on a tab. We ended up having to use a spot of glue to keep it secured. Nothing major.",
      "rating": 5.0,
      "verified": true,
      "author": "Habu",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Works, but gets dirty and isn't easy to clean.",
      "text": "Using this on an interior door to block light and noise. It does the job, but it also collects pet hair very easily and is a bit tough to clean. If I want another one, I might make my own with some pipe insulation sleeves and a fabric that doesn't tend to collect hair.",
      "rating": 4.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Works Great for Me",
      "text": "I live in an apartment in an older building, and because of settling, I have a small gap under my front door. For years, I'd had to deal with bugs, excess dust, along with leaves, grass, and dirt from the landscaper's leaf blower making their way inside. Once I put on my Twin Draft Guard, all of that stopped. It's not the most attractive thing in the world, but it does the trick. Also, I found a noticeable difference in the room temperature while the A/C is running. I immediately ordered one for my neighbor who has the same problem, but because of a small drop off behind his door, it didn't work for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Bobby J ",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Disappointed.",
      "text": "I must have received a completely different product. 1. The tubes were only 1inch, which did not fit the space under my door (too small). I bought this bc it said the tubes were 2 inches, which is what I needed. Everything I read said they were 2inches thick. The material was NOT microfiber as it says in the description and some of the pictures I see on the reviews. Extremely disappointed. If you are going to sell a different product, sell it under a different product. I thought I was buying what was described/reviewed but was not it at all!",
      "rating": 1.0,
      "verified": true,
      "author": "Marisa H",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Does not fit and it's made of cheap cloth. Perfect for winter - NOT!",
      "text": "Doesn't matter whether I open or close the door this slides right off and I have no intention of attempting to reposition this in the dead of winter whether I'm inside or outside. i was also hoping for light plastic-like material but this is the cheapest of cloth and the foam tubes feel like they would easily break. This is what I get for being lazy so I'll go back to my original plan to make my own. Will be requesting a return. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Rockin60",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Very effective and very easy to install",
      "text": "I really like this thing. I used them in my old house but discarded them when I moved to a new house, figuring that a new house wouldn't be so drafty. After noticing a substantial draft in my side door, I did a lot of research on more fancy draft shields before realizing that I was probably already aware of the best value ones so I reordered one from Amazon. Next time I won't be so quick to throw good stuff away. Either way, I'm a repeat customer so take that for what it is. Oh, it works really well and eliminates drafts from under doors just as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "DJ Tucker",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Cheap and not worth it!",
      "text": "So I'd save your money and buy a more durable well made one. They came and literally my mother in law could of made a better one. It's cloth is cotton and cheaply sewed. Then you slide plastic tubes into the slots. 1.Its constantly sliding off the door when you open it so has be adjusted and slid back every time with your foot. 2.Its already ripped. What a waste of money. You get what you pay for I guess!",
      "rating": 1.0,
      "verified": true,
      "author": "Vivian",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "And it will waste your money if you pay for postage for this ...",
      "text": "VERY poorly manufactured-- I received a defective product, and the replacement that Amazon sent was also defective-- same defect. This product consists of a canvas pocket into which two styrofoam tubes are placed. But, whoever manufactures this brand (I had one from another manufacturer that was made well) makes the openings in the pocket into which the styrofoam is to be inserted too small for the two styrofoam tunes to slide in to. SO-- upshot: THIS manufacturer can't do the job. And it will waste your money if you pay for postage for this thing, and it will waste your time bcs you'll have to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "A Reader",
      "helpful_votes": 4,
      "publication_date": 20151029
    },
    {
      "title": "Great Draft guard",
      "text": "I love this draftguard because it is so simple and easy to use. There are no holes to drill or anything to tack on the doors. It simply slides under the door and that’s all. I got another one for my Dad and he was very happy with it. It does keep the draft / bugs out. However, it doesn’t look all fancy and structured like a nicer installed strip but I like it because it works exactly as expected - to keep the draft out. It appears that it would fit all size openings.",
      "rating": 5.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "They just didn't fit. But the Seller was excellent.",
      "text": "I Purchased these draft guards to replace a guard on our front door that was wearing out. When I took the new guards out of the box I could tell with the fabric was much thicker than the previous guard that I had purchased. I tried to place the guard under our front door, but no matter how how I adjusted it, it just would not fit. I contacted the seller to return them and was promptly provided a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Desert Dweller",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "I have more privacy now",
      "text": "This actually made a big difference in muffling noise. I used it on my bedroom door since I share an apartment with roomates. Its doesnt block noise completely, but I do feel like I have more privacy now and I also dont have to throw blankets against the gap when my roomates watch TV at night.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 4,
      "publication_date": 20170524
    },
    {
      "title": "awesome",
      "text": "there was a lot of slack but all I did to fix it was pull the fabric tight and staple it a couple times (not into the foam obviously) can't see the staples and now it has a super tight seal I can't believe how well it blocks out light, you might have to cut the tubes slightly different lengths to get the door to close right",
      "rating": 5.0,
      "verified": true,
      "author": "Austin",
      "helpful_votes": 4,
      "publication_date": 20170406
    },
    {
      "title": "waste of money",
      "text": "This is a total waste of money. It is so long that the door will not shut and so bulky that the door will not open. It comes with velcro strips that are to be attached to the door bottom to hold it in place. Of course as soon as any moisture gets on these strips, they come loose causing the bulky thing to fall to the floor. This is very annoying if you are trying to enter the door and have to spend an hour trying to wrestle the thing away enough so you can get in your house. I ripped what was left hanging of mine off and tossed in trash",
      "rating": 1.0,
      "verified": true,
      "author": "Louise Sova",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Do Not Buy; Piece of Junk!",
      "text": "If I could give this product 0 stars I would. The item does not look like the pictures and the tubing is much smaller like other reviews pointed out/show in photos. Very poorly/cheaply made and does not match quality shown in pictures. Since the tubing is smaller than pictured and I have a large gap under my door when trying to close/open the door with this on, it just starts to roll under the door and will not stay in place. I already cut the tubing to fit the door so I can’t return the item and now out $16 for this piece of junk. Don’t waste your money on this!",
      "rating": 1.0,
      "verified": true,
      "author": "Kelly McGrath",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "This draft guard is awesome! I live in an apartment complex on the ...",
      "text": "This draft guard is awesome! I live in an apartment complex on the 3rd floor, and my neighbor on the 1st floor breathes more cigarette smoke than normal air apparently. This was to the point where I would start smelling cigarette smoke in my apartment. I placed this bad boy on the front door, but it didn't work because my frame was not smooth, so the cloth got snagged and tore a little, it's still totally usable though! So, instead I opted to use it on my bedroom door instead. It works perfectly! No more second-hand cancer air for me!",
      "rating": 5.0,
      "verified": true,
      "author": "DKim",
      "helpful_votes": 2,
      "publication_date": 20170905
    },
    {
      "title": "Works as described. My 2nd purchase.",
      "text": "We purchased this about 18 months ago and I am coming back to purchase another one now. We purchased navy, I believe that was the only color they had in stock at the time and we didn’t want to wait. Well, it definitely served its purpose and lasted us this long. The color is faded now. I actually can’t think of exactly when it started to fade, but it’s only noticeable as of recently. I have no complaints about the product. It fit well and did not slide off at all, which is why I am purchasing another one.",
      "rating": 4.0,
      "verified": true,
      "author": "Sbram918",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Perfect solution",
      "text": "Perfect solution to our problem! We live in an apartment and our front door is adjacent to a row of garages. We get a lot of wind tunnel issues and our front door automatically slams shut when it's opened. We were having a lot of issues with hallway noise, hearing garage doors, and hearing other doors slam from the breezeway wind tunnel. This didn't eliminate it 100%, but I would say it's definitely at least a 50% inprovement which is huge. We tried more than a dozen other things prior to this, assuming his wouldn't work, but this ended up being what we needed all along.",
      "rating": 5.0,
      "verified": true,
      "author": "Cassi",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Works exactly as it should",
      "text": "We have quite the gap below out front door. We were losing our cool air in the summer and in the winter the cold air was constantly rushing in. There were also several crickets that would sneak in as well as other little unwanted guests. Since we’ve had this we are keeping our place at the desired temperature inside and there are no tiny intruders. It was super easy to set up and it has held together through rain and shine. I would definitely recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Kareen",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Does what it needs to do",
      "text": "What we need. Our front door has a strange rubber sweep on the bottom that creates an awful squeaking sound when it rubs against the laminate floor when opening and closing. We use this draft guard to prevent this from happening. It works for that, but it doesn’t stay in place well. Also, it used to be a velour-like material, now it is a canvas like material. We liked the velour because our cat wasn’t attracted to it. Now, she chews on the canvas. Bring back the old material!",
      "rating": 4.0,
      "verified": true,
      "author": "Christopher Washington",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Works great",
      "text": "It works so great. It fit our door perfectly. But you can cut it if you need it for a smaller door and it seems very simple. I would recommend it to someone that is looking for one. We live in a high rise apartment and the door guard keeps out all that hot humid air that was coming in from the hall way. It also helps keep the light out and helps my daughter from being worried because she use to see shadows from when people would walk by. lol... She is little and it would bother her. It also glides very easily. You do not even notice that it is there.",
      "rating": 5.0,
      "verified": true,
      "author": "Hair/Makeup with MEJ",
      "helpful_votes": 0,
      "publication_date": 20170519
    },
    {
      "title": "Okay, would return if i didnt throw the box out by accident",
      "text": "Does not work that well -- sizing is off and a pain to adjust. Works best on doors that are very low to the ground (i.e. small clearance)",
      "rating": 3.0,
      "verified": true,
      "author": "David W.",
      "helpful_votes": 3,
      "publication_date": 20180827
    },
    {
      "title": "Worthless garbage!!",
      "text": "I tried this on three different doors literally would not allow me to close the doors even after carefully reading and following the instructions.. it's too cheap to send back for a return it would cost me more in shipping than the item is worth.. I only gave it one star because zero stars is not an option unfortunately this doesn't even deserve one star...",
      "rating": 1.0,
      "verified": true,
      "author": "Charles W. Golden",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Know the Facts",
      "text": "For the Positives.. Very Fast and Good Delivery. Great at Reducing Noise.. Very easy to set up and install.. For the Cons It Isn't the advertised 36 inches wide ( mine is 34.5 inches) Given it is Not 36 inches and my door is..it will not stop ( maybe minimised drafts ) Bugs still can get under the door ( spider did so 2 hours after I installed it ) and did so in the inch and half missing from supposed 36 inch length",
      "rating": 3.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "It works like a charm",
      "text": "We bought this draft guard to keep out mostly smells from our apartment neighbors but also the sound of a wind tunnel in our hallway. It works like a charm! Very easy to put together and doesn't collapse when you open and close the door. Sure, it's not the prettiest, but what do you expect for the price? I'm very pleased with this purchase and would buy it again if the need arose.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Peters",
      "helpful_votes": 3,
      "publication_date": 20180607
    },
    {
      "title": "I'm very disappointed--this is nothing like my previous one. The tube is 1.75 inches, not 2.5 as was advertised.",
      "text": "This arrived today. I had another one for several years that I got at a local drug store. It was heavy-duty nylon and very durable. This is a cheap, cotton-type fabric sewn with large sloppy stitches.I'm not sure it will last out this winter. I'm glad I got just one to check it out because I'd be really upset if I had gotten the 5 I actually need. It was said to be 2 1/2 inches, but the foam tube is only about 1.75 inches. The size of the fabric tube is irrelevant. It did go together easily.",
      "rating": 1.0,
      "verified": true,
      "author": "PRBC",
      "helpful_votes": 2,
      "publication_date": 20161212
    },
    {
      "title": "Keeps Out Mice & Cold Air!",
      "text": "I’ve been meaning to get one of these for quite a long time but always forget when I’m at the store. This works great. I live in an apartment complex and the cold air from the hallway and outside door just flows right in under the door. Since I’ve used this, I no longer have this problem. One time last year a mouse managed to get in my apartment from under the door and my cats had a field day. It was horrible. The Twin Draft Guard completely fixed this. Nothing is getting in, cold air or mice!",
      "rating": 5.0,
      "verified": true,
      "author": "kelly blodgett",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Low Quality/Does not Allow for opening door.",
      "text": "This is simply 2 foam pieces and some cloth does not seal, foam prevents doors from opening to closing. This is the second one I have gotten hoping it would be better quality as some reviews lead it to be. Not worth price and after 1 days use to destroyed to even attempt returning. If interested for use on a door that remains closed at all time may be the product for you.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenna Cavanaugh",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Does what it is supposed to!",
      "text": "This did exactly what we hoped it would! Our home used to have carpet before we bought it, and the gaps under the doors are quite big. We needed this mostly to help block sound and light for our toddler’s room. It was very easy to customize and put in. It fits great and has blocked all that extra light and helps muffled sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg and Natalie",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Works better than I expected",
      "text": "I was skeptical at first, but this thing went on easily, and works well. We have a big (too-big) gap under our front door. In the winter, it lets a lot of cold air in (I've even seen snow drifting in under the door). This thing seals up the gap very effectively, the house is a lot warmer. Yeah, I know I need to get the door fixed properly. For now, this thing does exactly what it's supposed to do. Satisfied customer.",
      "rating": 5.0,
      "verified": true,
      "author": "flyboy",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "... these because we live in an old house with horribly messed up front/back door frames - they work as ...",
      "text": "We got 2 of these because we live in an old house with horribly messed up front/back door frames - they work as best as they can, so yes it does help, but it constantly gets stuck under the door and we have to adjust it almost every single time we open/close them. NOTE: you can cut the foam on the inside to adjust it to your door size to help with that problem, but unfortunately I'd have to cut it so short that it wouldn't cover the spot at the bottom of the door with the gap.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Not impressed",
      "text": "I was purchasing as a replacement for my twin draft guards from last year. They are ‘extreme’ meaning the tube is larger. My previous set had a velvet look to them and bands on each side to hold in place and they were a great product. These looks tan to me not brown. They are cloth and you have to fold over a side flap if you cut the tubes and it looks sloppy. Also has some cheap looking Velcro sticky for one side. I doubt it will hold up. It does not look like the picture on the box.",
      "rating": 2.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Would buy it again for the right needs",
      "text": "My master bedroom connects to a bathroom and the bathroom connects to the laundry room. Also bedroom is carpeted and bathroom is wood laminate, which means a large gap under the door. Sometimes the cloth gets in the way of shutting the door, so I trimmed the foam by about 1/2\" and less of an issue any more. Very flimsy construction. It's just a solid foam noodle in a cloth case. But it works for certain doors I don't recommend for main doors to a home. Better for bedrooms or bathrooms. Better on hard floors than carpet. Pros: Blocks noise, smells, and light for my bathroom door Cons: Collects dust and hair - make sure to clean often!",
      "rating": 4.0,
      "verified": true,
      "author": "Chamorrodan",
      "helpful_votes": 2,
      "publication_date": 20160516
    },
    {
      "title": "Absolute Junk, not the material shown, cheap, nylon that that rips and tear, easily",
      "text": "If, you can get this product under your door; it might help the draft. But, the material is cheap and not made for durability and/or sliding under the door. If there is one place I want a durable product, it would be something that is dragged, repeatedly, on the floor. The Styrofoam insides arrived bent and never straightened out. Due to the cheap look and lack of durability I returned this product. In addition, I ordered the extreme one, but received regular one; I have no idea how much of a difference it would have made.",
      "rating": 1.0,
      "verified": true,
      "author": "Jazzy Jaz",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "This works better than I expected!",
      "text": "I used this in my bedroom to keep the cold air from coming out since I have a portable AC in my room. Cutting the tubes was easy, and putting it all together was simple. It is a little loose under the door which causes it to slide out, but you can just kick it back in which isn't that much of a nuisance. You could probably use some double sided tape to secure it to the door nicely. Regardless, it does keep the cold air from leaving my room!",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler M",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "... bought this item a few times before and I love the concept of it",
      "text": "I've bought this item a few times before and I love the concept of it. It's very easy and it stays under the door. Even so there are a few things which needs to be brought to potential buyer's attention. It isn't the best material and it can easily be made yourself. The Velcro that holds the extra cloth doesn't exactly hold everything place. I wished they put extra Velcro to keep the remaining cloth from moving around. The foam rolls have connectors that doesn't keep the 2 rolls attached in place and needs to be fixed every now and then. Aside from that it's a pretty good item and I would suggest anyone who needs it to buy it!",
      "rating": 5.0,
      "verified": true,
      "author": "Winnie F.",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Finally found something to stop my cat!",
      "text": "I've been searching for a way to keep my cat from digging under my bedroom door. She's figured out how to reach under the door and rattle it, which makes a terrible racket and prevents anyone from getting any sleep, and that's made worse by the fact that no matter what side of the door she's on, it's the wrong one. Drafts, noise, bugs, whatever - I have no idea how well it does for any of those things. But, it works great for keeping my cat from using my door to torment and harass me. I just ordered another one for the guest bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Heald",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Does the job",
      "text": "Quick delivery, pretty easy to assemble ... however, my doors must be short in width. After measuring my doors width and cutting the foam to length and putting it all together, the Velcro on the bottom between the foams was short ,,, so I had to improvise... but now it keeps getting stuck as I open and close the door. But on the upside, it helped with blocking out noise and acted as a great good insulator, I’m still glad I got them and yes I’m using them ... I purchased 4 and am using 3 out of 4.",
      "rating": 3.0,
      "verified": true,
      "author": "F&D",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Underwhelming",
      "text": "It does stop drafts, but if you're looking for something to block sound I would not recommend this product. Also, the adhesive to keep it in place only lasted a couple days so now it constantly slides out and has to be moved back in place. Also, when we first installed the door guard it held tightly on each side of the door but now that we've had it a few months it's gotten almost like saggy or stretched out and it looks like crap.",
      "rating": 3.0,
      "verified": true,
      "author": "Erin, Cat Lover",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Really warm up a room.",
      "text": "I bought these because I have an older home and the insulating strip under my front and back doors is worn out. These work great! I bought the beige ones (bought two) and they blend in well. I could tell a difference in the room temp almost right away. The rooms were not nearly as drafty. They do keep sliding forward toward the edge of the door and make it hard for the door to shut. I push them back.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah D. Johnson",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Works well for us!",
      "text": "We bought this to put under our toddler's door to keep noise out of his room while he sleeps. We have wood floors and not only is it colder than carpet, it's also much louder. This works really well for us! I can't attest to how well it keeps drafts out, but... our son was sick and one night we put a humidifier in his room, put him to bed and closed the door as usual. In the morning there was so much moisture in the room that there were drips down every wall! I had to wipe all the walls down when it dried (oops, haha)! So I'm guessing it works great for its intended use!",
      "rating": 5.0,
      "verified": true,
      "author": "NurseK",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "This product is exactly as it was advertised. And worth what I was charged.",
      "text": "Very easy to assemble. Definetly the size I needed for my big door so you need to measure your doors or windows before you order. The green is a good color choice. Not so dark as to show a lot of dust but light enough not to draw a lot of attention. Works well to keep out the drafts from under the door. There was a sizable gap at the bottom of the door that let in quite a bit of air, or to let out quite a bit of heat. I will be buying more of the smaller sizes for my bedroom doors as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Knopp",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "but the produce I received had a velcro tab that easily tucks and hold the excess fabric",
      "text": "In my basement, I have a door to an unfinished storage area to a bathroom and cold air was pouring in under the door. I didn't think a sweep would work and was afraid it would make the door difficult to open and close, so I got the draft guard. It works perfectly. Several reviews mentioned the difficulty of wrapping the excess fabric, but the produce I received had a velcro tab that easily tucks and hold the excess fabric. It's not ugly and it does the job without a lot of drilling or hammering holes into the door. It stays put when the door is opened and closed.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria Thompson",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "Not worth the money.",
      "text": "This product is way overpriced for the materials used. The sleeve is made of very cheap shiny material, no insulation there, and it snags easily...the foam inserts are hollow, so that takes away more insulation value. Overall, I would not have purchased it had I known how cheaply made it is. I had one years ago, heavy canvas type material and solid foam tubes. It lasted a long time - I'll be surprised if this one lasts one season.",
      "rating": 2.0,
      "verified": true,
      "author": "Mama Blue",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Keeps mice away",
      "text": "I have a small opening at the bottom of my door and I bought this to keep away mice. I live in the city in a condo so it is unavoidable, but I have not had a problem with mice coming in through the door since I put this on. I truly only had one mouse last year, but I got paranoid so either my building is doing better or this is the thing that is working for me. Another person on my floor also bought something similar so it must work.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Richmond",
      "helpful_votes": 2,
      "publication_date": 20170523
    },
    {
      "title": "Rips easy- had to throw away after a month",
      "text": "I bought this as a replacement draft guard in my front door. PROS: Easy to understand instructions/easy measuring/fitting, cheap fix for cold nights CONS: The Velcro on the ends of the cloth would not stay closed- so it easily ripped and got caught under our door making leaving or coming home a hassle. After about a month I had to throw it away from it ripping and getting stuck under the door. I would say this would be a good fix for a door that doesn’t have a ton of ‘traffic’ coming in and out all day.",
      "rating": 2.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Disappointed 2nd purchase",
      "text": "I purchased this item last year and was very happy with the quality of materials. So, I re-ordered the same one for my dad and was so very disappointed on the materials used this year. The quality is very poor. Also, the foam used was thinner and came as one piece, but folded so they do not keep the drafts out as well as last year's model. I will not be buying this again.",
      "rating": 1.0,
      "verified": true,
      "author": "K.T.",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Not the same as in the store",
      "text": "I purchase a set of these at Target and they were a nice, soft polyester fleece that glides nicely on the floor. The once i purchased here on Amazon were a cheap canvas fabric that did not have any velcro to attach them like the in store purchase did. My guess is that these are a cheaper chinese copy made to sell online and the in store is the original design. In my opinion",
      "rating": 2.0,
      "verified": true,
      "author": "Craig",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "stopped the draft",
      "text": "great product in that it stopped all drafts coming in our door. the adhesive on the velco strip supplied did not work and the glue came off on the paper cover and didn't stay on the strip. I simply used duct tape to hold the draft guard in place. I'm not 100% satisfied, more like 85%.",
      "rating": 5.0,
      "verified": true,
      "author": "tambourinemonkey66",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Shorter than Advertised!",
      "text": "I was disappointed because it said it would fit a 36 inch wide door. The foam insert was 3 inches short, so it’s actually 33 inches long. I had to make additional foam stuffing to get everything to fit, which was annoying. Besides that it’s easy to install under the door, and the material can be washed. I would not purchase again though.",
      "rating": 2.0,
      "verified": true,
      "author": "Leah E. Cuadra",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "This is a great creation for those who don't have someone to help ...",
      "text": "This is a great creation for those who don't have someone to help them put in a draft protector immediately screwed to the door, or if you don't want something permanently screwed to the door. What I love about this, is it protects you from smells on both sides of the door, can cut foam to fit your door, has velcro for adjusting after cutting it to fit your door, and you can wash it, because it does get dirty after awhile from dragging across the floor. Excellent creation!",
      "rating": 4.0,
      "verified": true,
      "author": "Joy",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "Very good.",
      "text": "I like this product. Easy to install. Looks neat. You don't really notice it. It's a neutral color and shape. It helps with the draft. It stays in place.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Conrad",
      "helpful_votes": 5,
      "publication_date": 20170304
    },
    {
      "title": "Door draft stopper",
      "text": "Overall I do not recommend this product. the foam inserts are too small and the cover is a very thin material. I cut the foam to the size of my door, but the velcro was not long enough to sitick after that. (Normal size door) I had to (fix it with staples) so it would stay. then I had to tape it to the inside of the door just so it would stay in place. Not worth the $ I paid. :(",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Good product for minimizing noise",
      "text": "The guard is not the most attractive item I have ever purchased, but it does what it is supposed to do. We purchased the guard to help keep out some of the noise that travels from the main living area of our home to the bedroom. We have wood floors throughout the main level of our home and the guard fits snuggly under the door. I had to cut mine so that it fit the width of my door. Opening and closing the door with the guard in place is not an issue.",
      "rating": 4.0,
      "verified": true,
      "author": "CSBTop Contributor: Drawing",
      "helpful_votes": 7,
      "publication_date": 20141103
    },
    {
      "title": "Not worth it.",
      "text": "This product does not fit my standard size bedroom door. It it about an inch or two too long and I would have to trim the styrofoam. It's also extremely cheap. It's two pieces of styrofoam and some fabric. Go to a craft store and you can make this yourself in fifteen minutes for $5.",
      "rating": 3.0,
      "verified": true,
      "author": "Spiritbymyside",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "It's what is says it is",
      "text": "It's alright. I don't think it fits the door that well. It's a very simple product and maybe my door doesn't have a wide enough gap for it.",
      "rating": 3.0,
      "verified": true,
      "author": "Dayna Triana",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Employees must be colorblind",
      "text": "While this item does indeed work very well to keep the draft and neighbor's cigarette smoke from making it under my front door, I have tried ordering this in two completely different colors - both blue and black - and each time (and at different attempts) I received BROWN. The box and the listing may claim to be blue, the box and the listing may claim to be black - but the item inside will be BROWN. I tried three times - BROWN. I ordered blue; I ordered black - but instead I got BROWN. It works damn well, it's just not the color they think it is.",
      "rating": 3.0,
      "verified": true,
      "author": "EN",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Doubles as a pet blocker!",
      "text": "This works great on my interior bedroom door at my apartment that was cut short and was very drafty. At first, my cat tried to tear it up and play with it but it held up very well with hardly any damage from him! It also doubles as a way to keep him from sticking his arms under the door and tearing up the carpet when I lock him out at night because he just messes with this instead of the carpet.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Bang for your buck",
      "text": "Exactly what I was looking for. I was replacing some old ones that would just slide all over when you would open the door and I came across these babies . I Like that they are black, more solid, and that you can make them to your own size of the door and/or window . Will buy again",
      "rating": 5.0,
      "verified": true,
      "author": "douglas",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Didn't work for me.",
      "text": "Seems like it a good idea, but didn't work for me. I think the draft comes in from the sides of the door and through the door itself, as much as through the bottom. It also kept creeping forward upon open and close too, which was a real nuisance and made opening an closing the door a time suck. Three it out, reusing the inside tubes for corner packaging.",
      "rating": 1.0,
      "verified": true,
      "author": "RPCV 2002",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Works well to keep out drafts",
      "text": "Follow instructions and you will nave no problem installing this door cozy. However, I suggest that you use a dishtowel or similar fabric before cutting the cozy to see if door will close properly. Because if you cut it, it may not be returnable. Mine took only a few minutes to install including opening the box and works very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Billy",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Not worth the hassle.",
      "text": "While it gets its job done, its so saggy that its constantly getting jammed in the door way so the door gets stuck trying to open/close it. Every time I want to close the door I have to get down and hold the cloth up so it doesn't get pulled under the door.",
      "rating": 1.0,
      "verified": true,
      "author": "Dude495",
      "helpful_votes": 2,
      "publication_date": 20180116
    },
    {
      "title": "Ordered 2, colors did not match",
      "text": "Ordered 2 in \"brown\" and both were different colors! One was a chocolate brown and the other was a light chestnut brown. Incredibly disappointing since, they were intended for doors that are side by side. *FACE PALM* I needed them up right away because they are kids rooms and the draft was so bad, keeping the kids cold, so I just put them up and dealt with it. I would not order these again or recommend to someone who needs more than 1.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenna Smith",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Works for some doors, some not",
      "text": "Originally I purchased Twin Draft Guard for my entrance door. I read directions and adjust the size for my door but didn’t work because threshold is basically blocking the foam tubes and it is impossible to close the door. However, I was able to use it for my garage access door(with huge gap). It’s still tough to open/close but since I don’t use that door often, it’s good for blocking winter draft.",
      "rating": 3.0,
      "verified": true,
      "author": "YH",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "A little disappointed",
      "text": "I thought this product would be great in my house because the gap under our doors is sizeable. Unfortunately I bought these to test out and they did little to nothing to mitigate the airflow through these gaps. This seems to be a case where the pictures looked way better than the actual outcome. I tried them on multiple doors in our home as the gaps vary in size and none really seemed to make sense.",
      "rating": 1.0,
      "verified": true,
      "author": "Sean Flink",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "I live in an 1890's era house which has great hardwood floors but unfortunately",
      "text": "I live in an 1890's era house which has great hardwood floors but unfortunately, they are uneven in the doorway areas due to decades and decades of foot traffic. The resulting uneven gap below the door can't be sealed effectively with a rigid brush bar or sweep. Only the thickness and flexibility of the Twin Draft Guard Extreme is able to completely block the flow and effectively fill the gap. Got it installed in 10 minutes too, and I'm a 68 year old guy with severe arthritis in both shoulders.",
      "rating": 5.0,
      "verified": true,
      "author": "wdrbbq",
      "helpful_votes": 0,
      "publication_date": 20161224
    },
    {
      "title": "Item was not as pictures",
      "text": "This was not the same product as the photo on amazon.com. What I got was a knockoff version. The packaging was different and it didn’t even measure the lengthy of a normal door. Not to mention the foam that goes inside was tiny and didn’t even fill the polyester sleeves. I returned it since it didn’t serve the purpose and was not what was in the description.",
      "rating": 1.0,
      "verified": true,
      "author": "CSDallas34",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "These work great! We have a door that goes up to ...",
      "text": "These work great! We have a door that goes up to the next level which houses our attic. It's worked well for us for the last several years. Last Christmas, my daughter actually listed this on her Christmas list because she's moved out and her her new bedroom is drafty. So, she got it for Christmas and is quite happy with it. I can also say that the scheduled delivery date was perfect, packing was more than adequate and My son might be getting one next! \"Thumbs-up\"!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Weaver",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "GREAT INVESTMENT",
      "text": "My house is 1900 SQ feet. My home was built in the early 90's and have had many upgrades made. My electric bill would raise so high during the winter because I couldn't keep my house warm. I bought this for my front door and for to the garage. Every since, my house stays warm throughout the day and I've dropped about $100 a month from my electric bill.",
      "rating": 5.0,
      "verified": true,
      "author": "linda",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "I was worried about it interferring with my 90-year father's walker and gait as he comes in/out of the house but the velcro keeps this in place and he swings the door wide to move through more easily so it works very well for him",
      "text": "I used Gorilla velcro straps on the underside of the door and attached in the gutter between the rolls to keep this in place. I was worried about it interferring with my 90-year father's walker and gait as he comes in/out of the house but the velcro keeps this in place and he swings the door wide to move through more easily so it works very well for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Perfect solution to air leaks!",
      "text": "I purchased the Twin Draft Guard Extreme because of the large (3/4\") gap under our condo front door. Our heat and air conditioning were leaking out into the hallway. The draft guard was easy to put together, just slipped the foam cylinders into the heavy fabric cover and folded under the edges. No cutting necessary, the foam was the exact size of my door. I slid the guard under my door and it stays in place when I open and close the door....it doesn't shift at all. I don't even notice it's there. It completely blocks the air from escaping and, as a bonus, it also blocks the hallway lighting. I'm very pleased with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Hannahs7",
      "helpful_votes": 3,
      "publication_date": 20160622
    },
    {
      "title": "Beware: cheap quality",
      "text": "I bought it because it had 4-5 star rating. But after getting this cheap quality product, I was wondering how it got the reviews it did. After reading a couple of bad reviews it looks like, as another reviewer’s picture shows, it looks like it’s not even made with the same material as they have previously been selling. The product I got looked more like nunchucks inside a cloth. Product returned. Waste of time and money! Save yours!",
      "rating": 1.0,
      "verified": true,
      "author": "EFC",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Prevents pests from entering dorm room, must-have for college students!",
      "text": "I have used this for the past 3 years in my college dorms to prevent mice from coming into my room. Before using this, I had several mice in my room. Ever since, I haven’t seen a single one! The only problem is the styrofoam often comes out of the cloth sleeve and you have to readjust it. Definitely worth the money though!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200102
    }
  ],
  "product_meta": {
    "title": "Twin Draft Guard 60220-DNA Extreme for Doors Brown PATENTED & TRADEMARKED, Single",
    "description": "Color Name:Brown| Style:SingleTwin Draft Guard is a double sided insulating device for doors and windows the fabric draft stopper sleeve holds foam cylinders on opposite sides of a door, creating an airtight, draft-proof seal. Door draft guard works on any floor, even carpets, to insulate living areas, garages and basements.",
    "rating": 4,
    "feature_bullets": [
      "INSULATION ALL YEAR LONG: Stay warm during winter months and cool during the summer months with the Twin Draft Guard Extreme. It features a patented design that slides in front of windows or doors to block cold air from entering. It also keeps cool AC air from escaping. It even reduces noise and prevents dirt, dust, fumes, or bugs from entering your home.",
      "GREAT FOR DOORS AND WINDOWS: This draft stopper can be used under doors and windows. It’s double-sided, allowing for extra protection from the cold or heat, depending on the season. It features a patented hook-and-loop closure that is adjustable, so you can easily set it to the right fit for your home. This draft stopper fits under doors up to 36” wide. It measures 8. 27” L x 4. 53” W x 17. 91” H.",
      "SAVES ENERGY: Don’t waste energy and money trying to warm up a cold house when there’s a draft! Instead, use our efficient draft blocker. It’ll save energy by helping reduce the amount of power needed to warm or cool your home. This draft stopper is compatible with all types of floors, including carpet, tile, linoleum, and hardwood.",
      "USE ANYWHERE: Our double-sided, insulated door draft stopper can be used for both residential and commercial use. Use it to fill gaps underneath the door of your entryway, living room, basement, or garage. It’ll protect the interior of your home or business from harsh cold and hot temperatures, so you can enjoy the indoors.",
      "DURABLE MATERIAL: The Twin Draft Guard Extreme is made from strong, durable material that is built to last. Featuring water-resistant microfleece, the Twin Draft Guard Extreme will protect your home against the elements, taking the brunt of rain, snow, dust, and other weather-related factors. Keep your home safe with the Twin Draft Guard Extreme."
    ],
    "specifications": {
      "Manufacturer": "Hampton Direct, Inc.",
      "Part Number": "60220",
      "Item Weight": "11.2 ounces",
      "Product Dimensions": "18.2 x 8.2 x 2.5 inches",
      "Item model number": "60220-DNA",
      "Is Discontinued By Manufacturer": "No",
      "Size": "Single",
      "Color": "Brown",
      "Style": "Single",
      "Material": "Microfiber",
      "Item Package Quantity": "1",
      "Included Components": "Door, Gate & Window Hardware",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B003ZSWER6",
      "Customer Reviews": "4.0 out of 5 stars4,434 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#16,151 in Home & Kitchen",
      "Date First Available": "September 12, 2010"
    },
    "categories": [
      "Home & Kitchen",
      "Tools & Home Improvement",
      "Home Décor",
      "Draft Stoppers"
    ],
    "price": 16.99
  }
}