{
  "website_summaries": [
    {
      "verdict": "A basic handgun safe that can be used anywhere.",
      "pros": [
        "Small enough for easy portability",
        "Usable in the home or a vehicle",
        "Cable can be attached anywhere"
      ],
      "cons": [
        "Has a strange smell that a few users find overpowering"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not going to stop a determined criminal",
      "text": "My vehicle was recently burgularized and neither the cable, lock or safe itself remained intact. Fortunately nothing was in the safe, but it was only a minor deterrent to theft prevention.",
      "rating": 2.0,
      "verified": true,
      "author": "Turd Ferguson",
      "helpful_votes": 39,
      "publication_date": 20170517
    },
    {
      "title": "Excellent for CCW sized firearms",
      "text": "It does exactly as it says. This TSA approved locking container will hold my SCCY CPX-2 with two magazines outside the gun and one twenty round box of ammo or with one magazine outside the gun and one fifty round box of ammo. I have had no issues checking my bag with my weapon stored in this going thru Dallas International, Raleigh-Durham International, and Seattle-Tacoma International airports. Just remember to review current TSA firearm regulations at tsa.gov PRIOR to traveling and when checking your baggage in to say \"I would like to declare a weapon please\".",
      "rating": 5.0,
      "verified": true,
      "author": "The1Skate",
      "helpful_votes": 10,
      "publication_date": 20170317
    },
    {
      "title": "Works Very Well For Basic Security",
      "text": "I use this in my vehicle when I have to take grandkids to school or go into a \"prohibited\" building. Works great for me. I also have one in which I keep a Walther P22 with 3 magazines in a filing cabinet, this to keep kids away. It will just hold a Springfield 1911, but I use it for S&W 9mm Shield mostly. Recommended for basic storage to keep firearm secure. As stated in numerous reviews it will not keep a determined thief with bolt cutters from stealing contents but will keep the rest at bay and little hands from touching.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles M.",
      "helpful_votes": 6,
      "publication_date": 20171223
    },
    {
      "title": "False security!!",
      "text": "If you want to keep your gun safe & secure look elsewhere. This box did a great job of providing me with a false sense of security. It didn't slow the bad guys down one bit.",
      "rating": 1.0,
      "verified": true,
      "author": "none",
      "helpful_votes": 418,
      "publication_date": 20150512
    },
    {
      "title": "Uses the same key for all of them",
      "text": "All the keys are identical. We bought 2 and they both use the she exact key",
      "rating": 1.0,
      "verified": true,
      "author": "Morell",
      "helpful_votes": 11,
      "publication_date": 20160723
    },
    {
      "title": "Need to play with lock for storage of gun and holster, otherwise it's great!",
      "text": "I used a pre-existing screw from my driver seat to screw this down and used black tape to cover the silver piece of the exposed lock wire to blend in with the rest of my interior. I hide this under my seat and it's never too hot once I retrieve my firearm which is what I was really worried about. The lock takes some wiggling and getting used to if you're storing your gun with a holster in the box, but just the gun alone and you should be fine. I'm using it for a Springfield compact range officer if that helps",
      "rating": 5.0,
      "verified": true,
      "author": "JPT33",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Well Made Gun Safe for One Pistol",
      "text": "The case is well made and it fit nicely in a hidden compartment of my SUV that seems made to hide this. Unfortunately, I lost \"both keys\" to the case. To be able to get two more keys from the company will cost you almost the same amount as buying another case. So make sure you \"hide\" your keys so you can find them.",
      "rating": 5.0,
      "verified": true,
      "author": "S. CharmianTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Great for what I need it for",
      "text": "Purchased this to store what I need to store in the glove compartment. I attached the security cable to a metal support in the car (behind the glove compartment) the the vault cannot be removed without great difficulty. I'm not saying that it's impossible to remove, but it's going to take a long time to get through that support. Now, if the bad guys have a wire cutter, then so be it. But how many of them carry around wire cutters in their arsenal. They'll rip the glove compartment open, try like hell to get behind it, then maybe get interrupted that they will go away.The vault is big enough for a Nano Beretta plus two magazines.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack and Mom",
      "helpful_votes": 0,
      "publication_date": 20150806
    },
    {
      "title": "Strong and versatile.",
      "text": "No digital key pad, but so what, it uses a key (2 included) and is very strong. Pre-drilled in case you want to mount with screws to a structure. The loop cable tie works well but the small loop on the opposite end gets in the way from the interior and would have been better designed with just a rivet or plug. Two foam inserts to keep contents from rattling. A great buy for what it does.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert B",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Perfect for single gun or possibly two small handguns",
      "text": "Bought this item for a Springfield 1911, fits wonderfully and locks easily. Some of the cheaper made gun locks made the locking mechanism awkward and unpredictable. Sometimes I couldn't unlock it, but not with this one this single gun vault was easily used in the home and transportation from one place to another.",
      "rating": 5.0,
      "verified": true,
      "author": "RocketGnome",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "This is a nice little safe",
      "text": "This is a nice little safe. It's not a high security safe, a determined thief would have no problems defeating it. It should help in the typical smash and grab, especially if it is hidden out of view. I have a gun safe at home, but this was bought for travelling. Camping, out with the family...sometimes you can't carry your gun with you. This will keep my 5 YO from playing with it (he already knows never to touch but why take the risk?) Swim party at family or friends, keep your gun safe and away from curious hands. At a hotel, keep it safe while you are taking a shower... Be responsible and prevent a lifetime of regret!",
      "rating": 4.0,
      "verified": true,
      "author": "Fed Up",
      "helpful_votes": 0,
      "publication_date": 20150914
    },
    {
      "title": "Excellent - love this vault",
      "text": "Excellent - love this vault! Fits my Springfield 9mm Subcompact with room to spare. I Purchased this for transporting my firearm in my SUV to the shooting range. The lockdown cable provided for security is a great feature (I attach mine to a secured D-ring in my vehicle). I read some of the other reviews regarding problems with the lockdown cable ends not being crimped properly, I had no issues with the quality of my cable. Lock on box operates smoothly (extra key provided), interior padding is sufficient, rugged sleek design and looks great. I envision many uses for this security box it's a great product for the dollars spent I endorse it with five stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Rick S.",
      "helpful_votes": 0,
      "publication_date": 20150304
    },
    {
      "title": "Tight fit but it'll get the job done.",
      "text": "I bought this as a way to legally transport or store my firearm in my car without fear of theft. The cable allows it to be secured to your vehicle and while not invincible will stop your Smash n Grabs which are the most common types of thefts from cars. The case itself is sturdy and I'm confident will hold up to anyone trying to break it open without a sledgehammer. Please note that for full sized handguns it is a tight fight and the barrel must be facing toward the latch in order to close properly or you risk scratching your weapon. It has additional room for one standard size magazine for full sized pistols as well.",
      "rating": 4.0,
      "verified": true,
      "author": "The Forgotten Knight",
      "helpful_votes": 0,
      "publication_date": 20160108
    },
    {
      "title": "A good buy very mobile.",
      "text": "Very good small safe that can be hidden just about any where. Good to take with you in a car or motorcycle just have your back pack. Easy to open an close to hang ups what so ever. Very durable material no dents after dropping it. A good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "but only because it's so good! I kept it in my vehicle for ages",
      "text": "I actually don't have my NanoVault anymore... but only because it's so good! I kept it in my vehicle for ages, and it was used as a quick lockbox when I had to go into a building that didn't allow carry (doesn't happen often... I generally avoid places that are marked). Was working with a student last year who was keeping her weapon (a Glock 17) on a shelf in her bedroom, despite having kids in the house. Didn't think that was overly safe, so I gave her my NanoVault. She loves it too!",
      "rating": 5.0,
      "verified": true,
      "author": "Evertiro",
      "helpful_votes": 0,
      "publication_date": 20160609
    },
    {
      "title": "OK for it's purpose",
      "text": "The box is strong and the key works well. It is thin enough to slide under my seat. The drawbacks include that the lining is not real cushy so I can't put a nice weapon in it for fear of dings. Also the security cable attaches weird and there are no clear instructions so you have to figure it out on your own.",
      "rating": 3.0,
      "verified": true,
      "author": "JudyB",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Great Low Security Option",
      "text": "Great low security option. This won’t stop anyone with the right tools but will stop a quick opportunistic person. This is a good lock box if you want to keep a handgun out of kids hands. Makes a wonderful gift to a new gun owner with children!",
      "rating": 4.0,
      "verified": true,
      "author": "JohnKy",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Great portable gun safe.",
      "text": "The GunVault NV200 is a great item to have if you need to lock up your firearm while in a state that requires it to be in a locked container. I also used it while visiting my children and grand kids. I did not want my granddaughter to accidentally get a hold of my firearm while I was at their home visiting. I just locked it in the NanoVault along with any worries that my daughter might have. I also keep the vault in my car for those times I am going into a location that I can not CC. I highly recommend the GunVault NV200",
      "rating": 5.0,
      "verified": true,
      "author": "Michael M",
      "helpful_votes": 0,
      "publication_date": 20150801
    },
    {
      "title": "Stinks--and I don't mean figuratively!",
      "text": "Well-made, perfectly-sized gun safe--will even hold a full size Glock 22--but I cannot give it the 5 stars it deserves because of the rancid stench that comes with the product. I'm not sure I care if it's the foam or the paint, but suffice to say I cannot use it in its present state of funkification. I took it out of its package, and left it in my office overnight, and had to Fabreeze the office several times, before relegating the vault to the screened porch--and my office still smells! I had such high hopes for this, and I cannot understand why nothing has been done to fix the problem--this apparently isn't an isolated issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20161007
    },
    {
      "title": "Stops smash and grab theft.",
      "text": "I've had this for a few months now. Overall, this is a great alternative to an expensive storage solution in your vehicle. As far as smash and grabs go, you should be covered with this installed. The lock itself can be picked by a novice in under 30 seconds. I am relatively sure that if i were to use a crowbar on this i could open it just as quick. The foam inside stops larger items from moving around well enough. If you are looking for a lockbox to strap to your seat and toss it under while you attend to other business this should be fine.",
      "rating": 4.0,
      "verified": true,
      "author": "McCallister",
      "helpful_votes": 0,
      "publication_date": 20160306
    },
    {
      "title": "Nano NV200 Glock fits perfectly",
      "text": "Amazon did it again with their fast delivery, ordered on Monday received on Tuesday afternoon. Ordered to transport my Glock 30S to / from Oklahoma where we have another house. Pistol fits perfectly and room for extra Magazine. Plus since I carry everyday; with as portable as this safe is and the cable that is included I can also use it in my car when I go into a post office, airport,etc. Good quality steel, foam inside keeps pistol and mag. in one place. My Glock 21 with extra mag, will even fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "Better than just a locked car door",
      "text": "I feel better knowing there is more than a locked car door between a thief and my pistol when I have to go into the post office, court house or other office where I can't carry. This is secure enough to stop a smash and grab thief and would slow down a determined crook. The cable is long enough to fasten under the seat and still reach the safe without doing gymnastics. The cable could be heavier, but it's ok. The metal is secure enough to slow a crook and the foam insert should prevent scratches. It's big enough to hold any handgun I own.",
      "rating": 5.0,
      "verified": true,
      "author": "RDRR",
      "helpful_votes": 0,
      "publication_date": 20151221
    },
    {
      "title": "Does the job",
      "text": "The lock isnt always the easiet thing to use but it works fine. I don't want to spend a ton on a lock box as long as it does the job, dont need anything fancy. Works with a G19 and S&W Shield just fine",
      "rating": 5.0,
      "verified": true,
      "author": "Jonah Salerno",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Great buy! Great protection!",
      "text": "Pros: Cable included, Strong/Durable, Acceptable by most Airlines, Great Protection! Cons: Cheap cable. I have used this twice on SouthWest Airlines without any issues. The only compliant I have is that the cable is thin and appears that it can be easily cut. However, not a large issues as when transporting firearms on commercial airlines, your bag is treated more tenderly than others. I will continue using this case for firearms until the FAA or airlines bans it. Also, I haven't had any firearms damaged during transportation while using this item. This case is good from small-medium sized framed firearms (not 1911 sized frames).",
      "rating": 5.0,
      "verified": true,
      "author": "Buzz",
      "helpful_votes": 0,
      "publication_date": 20141105
    },
    {
      "title": "serves the purpose",
      "text": "well I bought this item to put under my car seat. I have a ford fusion and it will not fit under the seat. I was a little disappointed because when I cant take my firearm inside of certain places I thought I could un-holster inside the car out of site of the public. so therefore I was able to put it in my trunk by attaching the cable around the stationary hinge of the trunk lift and it works just fine. although when I un-holster I'm in public and I look around and try to make sure I'm not seen. but I like the sturdiness of the product and would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "kjr",
      "helpful_votes": 0,
      "publication_date": 20140520
    },
    {
      "title": "It's a nice product",
      "text": "Very nicely made little safe for locking valuables for use in our camper. No, it would not slow down someone even kinda determined, but would make a casual thief wandering by reconsider and move on to something easier. Would it fit a gun - not a clue as we don't have one tho others reviews have said it would. Oh and hopefully if you buy one through AMAZON, that they pack yours better. Ours arrived with the two halves overlapping - with the lock still holding which was the 5th star. I pried it apart with no damage other then a minor paint chip",
      "rating": 5.0,
      "verified": true,
      "author": "JD W",
      "helpful_votes": 0,
      "publication_date": 20150518
    },
    {
      "title": "Glock 17 Transport Container",
      "text": "The case will meet my needs: provide a locked container for transport of a firearm inside an SUV in the retarded state of California. The case fits my Glock 17 just fine; not much room to spare, though. The foam lining does not have an over-powering odor, but petro-chemical products do have a tendency to release volatile organic compounds. Leaving the case open for a period of time should accelerate the out-gassing process, diminishing any substantial odor or toxicity. Update: 8/19/12, leaving the case open for two days, there is hardly a trace of odor from the foam. For anyone having trouble with the foam, it could simply be replaced. Price paid: $25.65 Shipping: $0",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20120817
    },
    {
      "title": "Good but..",
      "text": "Nice size and weight. Does what I want it to do...almost. It DOES fit a 1911. As my Sig 1911 Scorpion Carry fits perfectly fine. It does not, however, fit with my Streamlight TLR1S. You can, however, make it fit... But then its too tight and does not want to close easily without applying more pressure than is needed. Otherwise, its good for what I bought it for. Temporary storage whilst out of the vehicle, in a location that I cannot carry, such as work.",
      "rating": 4.0,
      "verified": true,
      "author": "Stefani",
      "helpful_votes": 4,
      "publication_date": 20141201
    },
    {
      "title": "Not to Big...Just Right",
      "text": "There are a lot of places where even with a concealed carry permit you are not allowed to take a firearm. I was never comfortable just locking it in the car. The NV200 cures that. It's small enough that it can be installed just about anywhere in the car, just make sure the cable is bolted to a metal structure. It will hold a 1911, but little more. I like the key lock as the touch pad safes I've seen required that you enter a digital code (high stress... I can't remember my birthdate). Price is right for what you get. Is it Fort Knox? No... but that's not what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140115
    },
    {
      "title": "Unpleasant odor from foam interior",
      "text": "Well constructed but emits a strong, unpleasant odor which appears to be coming from the foam interior. The odor literally permeated the interior of the car and the item had to be returned. We couldn't tell if it was actually from the foam or whatever glue they used to attach it. I hope the manufacturer reads this and rethinks whatever method or material(s) they are using in its construction. It would have served its purpose well if it didn't have this defect.",
      "rating": 2.0,
      "verified": true,
      "author": "CNJ2000",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "Simple Lightweight Solution",
      "text": "Does exactly what it's designed for: prevents smash-and-grab thieves and curious children from getting to its contents. Small and compact, so it fits underneath a car seat easily, out of sight. I did not have any problem with the cable as others reported. I ran it around a seat spring and yanked on it. It held fine, though I didn't pull on it so hard like my life depended on it. It is suitable to secure a firearm for a short time, such as if you had to enter an establishment that prohibited CHL carriers. Apparently also suitable for air travel. Overall, I'm happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Tim Muir",
      "helpful_votes": 0,
      "publication_date": 20140928
    },
    {
      "title": "Solid Lock Box",
      "text": "I was so pleased with the solidness of these lock boxes and their price, that I bought a second one. I now have one installed in each of my vehicles so that I can secure my firearm when need be. I did follow someone else's suggestion in upgrading the lock and the cable for these boxes. Even with that added expense, you won't find a more solid lock box for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "lwolf30",
      "helpful_votes": 0,
      "publication_date": 20160731
    },
    {
      "title": "Just what I needed.",
      "text": "I travel often and never use the safe boxes the hotel provides since the employees have access to them. This box gives me the security I need during my travels. Love it. I can fit my pistol, two additional 12 round mags and my passport in it. That's about the capacity of it depending on what you carry.",
      "rating": 5.0,
      "verified": true,
      "author": "Free Scotland",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "Good car safe",
      "text": "This does the job of keeping your valuables in the car secure better then a lockable glovebox. With the provided cable you can secure it to the frame of your car. The cable is fairly small and could be cut with small bolt cutters easily, but this being said it's a better option then your glovebox for your valuables or small firearms.",
      "rating": 4.0,
      "verified": true,
      "author": "Benjamin ",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "Very nice - but note that it's 20 gauge, not 18 gauge as described",
      "text": "seems sturdy and well made; lock has a solid feel to it; foam is good - enough to secure the contents so that they don't move around inside the closed container. My only beef with this is that the Amazon description says \"18-gauge steel construction\", but the package says 20 gauge. That claimed extra thickness is what nudged me toward this unit versus other competitors. I have half a mind to return it just on principle ... but I think I'll keep it and save the hassle.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark B",
      "helpful_votes": 2,
      "publication_date": 20131119
    },
    {
      "title": "Solid, Functional, Affordable",
      "text": "It arrived as advertised, no surprises. Worked well out of the packaging. Should be functional for keeping uninvited hands off the contents. Good size for portability, yet large enough to handle what I intend it for. Wire seems adequate to secure unless someone is equipped with decent wire cutters. For the price seems to be a good value. My suggestions for improvement are twofold: 1) provide at least one flat key that can be easily stored in a wallet; 2) upgrade the foam a bit. Those two changes would have earned it a five star rating in my book. I would purchase again and recommend it to someone looking for a portable secure box of its size.",
      "rating": 4.0,
      "verified": true,
      "author": "buckeye305",
      "helpful_votes": 0,
      "publication_date": 20140319
    },
    {
      "title": "Perfect!!",
      "text": "Bought this after reading the reviews. It worked great inside my suit case, I declared the unloaded handgun at the ticket counter and they took the suitcase and lockbox key, waited for TSA to inspect it. They returned my lockbox key and locked my suitcase up with a TSA approved lock I furnished. I will also use this box in the car. Instead of storing the gun in the glovebox, I will cable the box under the car seat. The box is heavy and well constructed. Worth every penny. This box fits a Walther .22 lR, chamber open and another cable lock in the gun. It also fits the empty clip.",
      "rating": 5.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20140126
    },
    {
      "title": "NV200 NanoVault with key access is a good purchase.",
      "text": "Purchased the gun safe in April and have been using for both home and travel. I have not tried checking in for taking on a flight. I would get something more durable like a Pelican case. The NV200 holds a Colt Commander and two 7 round Kimber mags fairly well. Only complaint I have are the mags slide around with or without the pistol in the box. Not good when those items are rubbing against one another during travels and possibly having loose ammunition in the case. Great for the home, transporting in the car, and safe keeping in a small space. Good solid case too. Stepped on it and nothing wrong with it so far.",
      "rating": 4.0,
      "verified": true,
      "author": "John the Voice",
      "helpful_votes": 0,
      "publication_date": 20121029
    },
    {
      "title": "I like it, but...(please read)",
      "text": "I like it! Seems well made and tough, my Ruger P95 and a extra magazine fit in snugly. The only problem I see is that the cord is very long so if you got into an accident this thing could easily turn into a heavy leashed projectile. I currently have it leashed to my passenger's seat adjustment bar, see picture to see what I mean. I tried tying the steel cable in knots for the cable won't accept that readily. Any suggestions would be great, excellent product except for that.",
      "rating": 3.0,
      "verified": true,
      "author": "Adam M.",
      "helpful_votes": 2,
      "publication_date": 20141206
    },
    {
      "title": "Pretty good option for the price",
      "text": "I was skeptical about this product given the price, but it was completely without justification. These are well built from appropriately heavy metal with a metal lock and latch. It should take more effort than twisting a flathead screwdriver to open this box. As to the bad reviews for poor quality cables; mine arrived fine with both loops and I can't pull them apart. Either way, other reviewers, these are compression type cable ties. Get a big pair of pliers or a heavy hammer and crush them. They'll hold. All in all a very solid product. Would buy again if I need a third.",
      "rating": 4.0,
      "verified": true,
      "author": "AAC",
      "helpful_votes": 3,
      "publication_date": 20120920
    },
    {
      "title": "Great for car",
      "text": "This is a great small lockbox. It will keep the kids out. With that said if somebody breaks into your car and wants it bad enough they will get it...... it's not heavy duty security.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian & Bethanie",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Works as intended",
      "text": "Comes with two keys. The NanoVault is heavy and secure enough to keep kids out and lawfully store my firearm. It holds a G26, two spare G26 mags and a full size G17 mag. It's tight, but it works. I would NOT buy this safe however to really deter theft. I have zero doubt I could smash/pry my way into this fairly quickly, or just snip the wire and take it with me. So, if you just need your guns out of reach and legally stored this seems like a great, affordable solution. I'll be ordering one with every new handgun I purchase until I can have a dedicated gun safe/vault in my house.",
      "rating": 5.0,
      "verified": true,
      "author": "K F Spear",
      "helpful_votes": 0,
      "publication_date": 20140513
    },
    {
      "title": "Great Product but what’s that Smell?",
      "text": "I love this product, it fits perfectly under the seat and there's plenty of cable to secure it to the seat post. The first thing I thought of when I unpacked it was the high quality sturdy construction. The second thing I thought of was the smell of body odor. I actually thought this was used until I read review pointing out the smell issue. I would definitely recommend this safe to friends and family.",
      "rating": 5.0,
      "verified": true,
      "author": "WC Fields",
      "helpful_votes": 0,
      "publication_date": 20160801
    },
    {
      "title": "great  transport system for your gun",
      "text": "Steel case and a good lock. Also has a cable to secure the box to your car/ and some types luggage. Will only hold one 1911 and a much smaller frame gun. Wish it had a little more foam to keep the guns from moving around but another foam sheet is easy to add. I am not sure but I think this unit satisfies California car requirement to lock you gun when transporting in your \"no trunk\" suv. Should also be approved by TSA for shipping a gun in stowed luggage. Good product . Wish the cable was a little thicker and some extra foam padding hence 4 stars. jp",
      "rating": 4.0,
      "verified": true,
      "author": "pc repair dude",
      "helpful_votes": 0,
      "publication_date": 20140107
    },
    {
      "title": "Decent.",
      "text": "It does what it's supposed to, the foam padding smells a little like rotten food, the latches aren't exactly smooth. I ordered two of these and one has a small gap and the other ones lock mechanism was very tight to turn. I worried about snapping a key honestly. The included security cable will work great provided you follow instructions and wrap it around the lock mechanism. Just fine for keeping young kids out, or a quick \"smash and grab\" theif, but that's it.",
      "rating": 3.0,
      "verified": true,
      "author": "Foo",
      "helpful_votes": 0,
      "publication_date": 20150506
    },
    {
      "title": "Would recommend!!",
      "text": "Use this vault for storing my pistol. The nice thing is can be used at home and in any vehicle type. Light weight but durable!",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Works great",
      "text": "The NV200 works great and super fast freight from amazon. The cable is of good quality and each vehicle now has one onder the seat. I found that you could secure it a couple different ways with the cable but I put the big loop through the little loop and secured it around the metal seat mount thats bolted to the vehicle frame, then put the big loop around the lock receiver. This unit should help against the normal smash and grab. The mounting holes work good in the house too. The three I have are great and I also got another dozen for employee xmas gifts and they liked that idea alot. Nice, big, secure units. No complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael N",
      "helpful_votes": 0,
      "publication_date": 20130108
    },
    {
      "title": "Great alternative for no locking glovebox",
      "text": "The Good: Sturdy construction. Nice finish. Compact, fits easily underneath car seat The Bad: Flimsy cable. Cheap foam padding The Lowdown: I have two of these, one in each vehicle (neither have a locking glovebox). Both are cabled to and tucked underneath the driver seats. Large enough for a wallet, keys, or small handgun. The cable is somewhat flimsy, but should be enough to deter a thief with no tools. Foam padding is pretty much a joke. Better than nothing, I guess.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140910
    },
    {
      "title": "Excellent Vault for Valuables and Handguns",
      "text": "I recently purchase a GunVault NanoVault with key lock and cable to use primarily when traveling with a firearm. The vault is heavy steal, but small and light enough to fit into a suitcase. When not traveling, I use it to lock up and secure my primary carry weapon when my grandchildren are around. With its rounded corners, it protects clothing and other items with which it may be packed. I am very please with my NanoVault. It fits all my handguns, from a pocket pistol to my 1911.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Rogers",
      "helpful_votes": 0,
      "publication_date": 20140609
    },
    {
      "title": "Good transport vault",
      "text": "This fits my full size Glock 21 and is useful for leaving a weapon in your SUV, which doesn't have a lockable trunk. This is an important consideration in states that require such an extra security measure. It would also keep kids from messing with it, but I don't think it would deter even an amateur burglar at all. The cord that comes with it is terrible and could probably be snipped with pliers. But short of a real safe that is bolted to the floor, I don't know of much that could stop a burglar from getting at your guns.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark Worley",
      "helpful_votes": 0,
      "publication_date": 20140426
    },
    {
      "title": "Very Handy To Have - Will Be Buying Again",
      "text": "Third one I have purchased. Let's face it most of the items in this category are only going to slow down a thief if they are determined. These are sturdy and seem up to the job. I agree the cable is not great, but will most likely do the job against a quick smash and grab thief. The first two NV200's I have permanently mounted in my vehicles. This one I replaced the cable with a longer length of chain to better handle my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Unruly Peasant",
      "helpful_votes": 0,
      "publication_date": 20150125
    },
    {
      "title": "this is perfect!!!",
      "text": "foam inserts on both the top and bottom, well made security cable, and large enough to hold my full size G22 and a couple of extra mags. very slim, and made from heavy gauge metal I read some other posts that commented about the smell of the foam...yes, it does have an odor. However, I let the foam soak in my sink with some dish soap for about 10 minutes, then dried them...smell is gone (easy fix) if you are looking for a die-hard, ultra-safe lock box, then you are looking WAY under the recommended price range.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Ross",
      "helpful_votes": 0,
      "publication_date": 20130308
    },
    {
      "title": "Buyer Beware",
      "text": "Loved the idea of having this in my car. When the product arrived, it had no key, so was useless. I returned for a replacement and the same thing happened- the box had been previously opened and the keys removed. Very disappointed with the wasted effort and time to take two different orders back to the post office. I'll be purchasing a different product.",
      "rating": 1.0,
      "verified": true,
      "author": "Theplumfam",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Does what it says it will",
      "text": "I bought two of theses: one for my vehicle and one for my wife. Although the cable can slip out of its groove when the lid is open if you are not aware of it, the case does what it says it can do. I can fit a full size pistol and a small pistol or my wallet and a full sized pistol and possibly my cell phone as well. The cable is long enough where I can put the vault out without it being on a small tether. THis makes it easier to get out onto the floorboards to open it up and retrieve what I need. Goof value and I would definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "NRAcounselor",
      "helpful_votes": 0,
      "publication_date": 20140319
    },
    {
      "title": "Pleased with this Lock Box",
      "text": "I bought this to secure wallet, cell phone, and other small valuables when leaving the vehicle at a trailhead. I looped the security cable around the passenger seat floor bracket and slide the lock box under the seat. Overall I'm very pleased with this box. The weak link would be the security cable, which could be cut with large diagonal cutters if a thief had the time and the tool. I haven't tried fitting a handgun yet, but I'm sure the size is more than adequate. The other purpose I have for this lock box is foreign scuba diving trips where we want to secure passports in a hotel room.",
      "rating": 5.0,
      "verified": true,
      "author": "Super Max",
      "helpful_votes": 0,
      "publication_date": 20120807
    },
    {
      "title": "You better lock it up",
      "text": "Not a bad gun vault, although I haven't had one before so I'm just going off what I think a gun vault should be. It's nice and slim profile fits under my seat and fits my M&P9 full size with a spare mag perfect. My only issues is 1) when you close the lid and lock it it's really tight, which to some might be a good thing so your items doesn't rattle but I'm just afraid of the key braking and 2) how the security cable attaches is weird, I wish they put a separate stud or compartment just for the cable to attach to.",
      "rating": 4.0,
      "verified": true,
      "author": "jbar",
      "helpful_votes": 0,
      "publication_date": 20140627
    },
    {
      "title": "Smells amazing",
      "text": "Does exactly as advertised, with a little bonus. If you were looking to make your house smell like a chemical processing plant, this is the product for you. The foam inside smells like it was soaked in cat urine and radioactive waste before shipment. As soon as you open it, it fills the room with the odor and it lingers there for a long time after your remove it. Other than that it's pretty swell.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin S.",
      "helpful_votes": 0,
      "publication_date": 20160904
    },
    {
      "title": "It's pretty high quality for what you pay for it",
      "text": "It's pretty high quality for what you pay for it. I've had similar sized gun vaults and they all had something horribly wrong with them like the foam stunk up my apartment so much I wasn't allowed to keep it inside or the hinges were so cheaply made you might as well not lock it. I have to say I have no complaints with this one. I got it because we were having family visit along with a 2 year old and I needed something quickly and cheap. It worked for that, but don't expect it to keep out a determined person with a crowbar.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Leon",
      "helpful_votes": 0,
      "publication_date": 20141015
    },
    {
      "title": "This works great, They should have put the cable notch towards ...",
      "text": "This works great, They should have put the cable notch towards the back so one could grab the handle quicker. The lid won't shut unless the handle is in the back. The foam and cable do not leave enough room for the thickness of the handgun. Glad I chose this, as it will not fail as compared to other reviews I have read on the biometrics or combinations. Price was great as well. Shipping, took 2 days",
      "rating": 5.0,
      "verified": true,
      "author": "Mark B.",
      "helpful_votes": 0,
      "publication_date": 20150801
    },
    {
      "title": "Perfect!",
      "text": "I have this under the passenger seat of my vehicle and it's awesome. I will be ordering another for inside the house. It fits my Beretta 92fs perfectly (anything larger will likely not fit), and the foam is great for tucking some emergency cash and important documents (like concert tickets) underneath. The included cable is strong, and the lock works extremely well. The body of vault itself is thick metal and feels like it would be almost bulletproof. For 25 bucks, what more could you want?",
      "rating": 5.0,
      "verified": true,
      "author": "CapnCaveman",
      "helpful_votes": 0,
      "publication_date": 20140613
    },
    {
      "title": "Solid!",
      "text": "This is hefty and impressive in quality. I bought it to keep my wallet safe from a challenging teen in the home. The vault is not big, but it is so formidable in weight and looks, that the average teen won't try prying it open with a screwdriver. I store it in the foyer, so I can lock up or get my wallet, as I come and go in the house. The key is on a office badge-type lanyard around my neck. The extra key is hidden elsewhere. This is much easier than wondering where that $20 bill went that I thought I had. It is the perfect size for at least 2 wallets.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20130715
    },
    {
      "title": "Great little safe.",
      "text": "I had a combination lock version of the GunVault safe before, but the mechanism jammed after a few years of use, so I decided to go with a simple keylock version and I'm very happy with it. Perfect size for my 9MM and I keep it tethered to my wall mounted gun safe keeping the key for that safe locked inside the NanoVault. Perfect solution, no batteries and low cost.",
      "rating": 5.0,
      "verified": true,
      "author": "ScruddlyJr",
      "helpful_votes": 0,
      "publication_date": 20150928
    },
    {
      "title": "Nice little safe",
      "text": "Nice little safe, won't keep someone from stealing you gun but will at least slow them down. I store a Glock 27 in mine with a mag as well and it is a tight fit to get it shut around it but it fits. One other thing I would mention is it was possibly smashed a bit when I got it because I had a very hard time opening it for the first time. I had to take a screwdriver and pry it open along the edge. No cosmetic damage but it was a pain to do.",
      "rating": 4.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20150130
    },
    {
      "title": "Suprising",
      "text": "I just got this and at first glance I was not happy! It looked as if there was no way that this thing was going to hold my G17. To my surprise it has enough room for my G17 with two extra mags. With one mag popped and locked that means 3 mags total! The cable seems sturdy enough but I would like to switch it out eventually for something with a little more to it. I think I am going to pick up another one of these for my girlfriend because she doesn't like it when she has to leave her gun in the car because of her job.",
      "rating": 4.0,
      "verified": true,
      "author": "W. K. Joyner",
      "helpful_votes": 0,
      "publication_date": 20131002
    },
    {
      "title": "Great size and construction, better than alternatives.",
      "text": "Bought as a replacement to a Bulldog brand case that was too small for some of my guns. This is much better made than my Bulldog - foam is better quality, outside has a slight orangepeel-like texture (no slipping) and the locking mechanism is a much better design. This perfectly fits full-size service pistols plus extra mags. Strong construction with a decent lock. Have tried successfully with a 1911, Springfield XD 4\", and Canik TP9/Walther P99 clone all fit easily and did not require force to shut.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140626
    },
    {
      "title": "Decent Deterrent",
      "text": "Great for a Beretta Nano and room to spare. Fits in a .50 caliber ammo can without a problem. Fits under a car seat. Fits between my spare tire wheel in my car. Fits in many places. Fits a weapon nice and snugly protected while offering a great barrier for a firearm. It is much smaller than you perceive, but has room for many things. Degraded one star since this is my second order because my first order arrived without the keys... most aggravating! No smell worth noting. Cable appears strong.",
      "rating": 4.0,
      "verified": true,
      "author": "Gabriel  A Mazzo",
      "helpful_votes": 0,
      "publication_date": 20130814
    },
    {
      "title": "Great Box for S&W 642 revolver",
      "text": "Great box for my snub nose. It fits with room for 2 speed loaders. Many have commented on the cable. Try as we might we were not able to get the clamps to slide. Others have also mentioned a smell. I found no smell to the inside box at all. I am hyper sensitive to chemical smells and almost did not buy this because of the comments of the smell but I have no issues with this box smelling and am so glad I took the chance. I asked others to smell it and they could find no bad odors with it. I am so pleased with the box.",
      "rating": 5.0,
      "verified": true,
      "author": "rothx5",
      "helpful_votes": 0,
      "publication_date": 20140616
    },
    {
      "title": "A must have for traveling",
      "text": "This gun vault is perfect. Keeps my firearm locked away safely so I don't need to worry someone else just picking it up or finding it. Another big plus was the fact that it's approved by TSA to safely transport your weapons in your CHECKED luggage, not your carry-on for obvious reasons! I looked at a lot of products before I settled on this one and after owning it, I will be buying them for some friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon S",
      "helpful_votes": 0,
      "publication_date": 20151021
    },
    {
      "title": "although the airport personnel said the box itself was compliant ...",
      "text": "although the airport personnel said the box itself was compliant for checked baggage, and on one trip, just let us through, on the return trip, we had to go through the whole TSA process, as the lock is NOT TSA compliant......they have no key....just an FYI.....",
      "rating": 5.0,
      "verified": true,
      "author": "SassyPie",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "Fits the Bill",
      "text": "Got the product fast. I did not have an issue with it smelling at all. This box is tough and serves its purpose. Will it stop anyone from stealing your gun if they are hellbent on doing it?...No...but nothing would. What this does, is give you a secure place to store your pistol and hide it out of the way. This has enough room for a full size 1911 and extra mag, plus a money clip. It's strong and installs in seconds to the frame of your seat. I use this everyday and have not had one issue with it not doing what it is intended to do. Great product. Don't miss out.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20110206
    },
    {
      "title": "Nice, slim option for hiding a handgun",
      "text": "Small, fairly inexpensive and fits my glock plus 2 extra magazines. Feels sturdy and I love the slim form factor. It’s more for hiding something versus protecting it from theft.",
      "rating": 3.0,
      "verified": true,
      "author": "Jae Lee",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "... this for a G30S and thought it would be fine since it fits a 1911",
      "text": "I bought this for a G30S and thought it would be fine since it fits a 1911. My mistake. A 1911 is thinner than a double stack 45 so my Glock barely fits in this case. I will buy the next size up and use this one for my wife's G42. Very solid lockbox. The cable is pretty thin and looks like it can be cut through with wire cutters. I plan to upgrade this to a larger cable used for laptops. The cable size took this down a start, otherwise excellent product.",
      "rating": 4.0,
      "verified": true,
      "author": "Keri and Dan",
      "helpful_votes": 0,
      "publication_date": 20150116
    },
    {
      "title": "Glock 22",
      "text": "I use this the trunk of my vehicle. The included cable works perfectly for securing this to the frame exposed inside my trunk. It easily fits my duty Glock 22 and extra magazine, although I wouldn't want to try fitting much more. In hindsight I would have purchased the NV300 NanoVault or MV500 due to them not requiring a key, instead a combination or keypress combo. The reason for this is I store my duty weapon in here daily and the key and times can be difficult to get fully turned when the safe is full.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20131007
    },
    {
      "title": "Great affordalbe gun transportation, but flawed cable loop",
      "text": "Decently secure safe that fits under car seats to stay compliant with many states laws for transporting a firearm. The cable loop is difficult to fit securely in the case with a firearm in the case. I would have given this item 5 stars if the cable loop system was designed better. Perhaps it is because I put a 1911 in the case, where a glock or other firearm would fit more easily. Overall, I sound investment for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "stunkeerg",
      "helpful_votes": 0,
      "publication_date": 20141113
    },
    {
      "title": "Excellent safe for my car",
      "text": "This safe is everything the description says it is. It is compact which fits nicely under the seat in my car without drawing attention to itself or being noticeable at all. I've had quite a few people ride who never knew it was there. Fits my gun and I don't feel nervous leaving in the car at all. I chose the 200 over the 300 because I like the key lock more than the 3 digit combination. Great product. I hope this review was more helpful than if I'd said that it arrived late and didn't smell good when I first opened it.",
      "rating": 5.0,
      "verified": true,
      "author": "DMcnl",
      "helpful_votes": 0,
      "publication_date": 20120529
    },
    {
      "title": "Well built quality",
      "text": "If you want a strong, reliable gum safe for your car without the frills and high cost this safe is the answer. Thick strong steel will thwart any would be thief. Great value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Morning Dave",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Great for keeping a handgun in safe storage when a vehicle is parked!",
      "text": "I use this to keep my legal concealed carry sidearm locked up when I go into a courthouse, post office or other location that prohibits weapons. Its tethered with the included cable and isn't going anywhere. Great and solid design and the key lock is nice and smooth in locking and unlocking. I highly recommend this as a cost effective alternative to anyone looking to keep their firearm secure from theft or family and friends that may not know proper gun handling and safely. Good job to GunVault!",
      "rating": 5.0,
      "verified": true,
      "author": "Seth Martin",
      "helpful_votes": 0,
      "publication_date": 20131231
    },
    {
      "title": "No keys, and a box that smells exactly like ramen noodles",
      "text": "Within the past WEEK I have returned TWO of these GunVault NV200s. It's kinda hard to use a vault that ARRIVES LOCKED, and there are NO KEYS included...TWICE!!! Plus? The second GunVault actually smelled EXACTLY like ramen noodles. Seriously, you can't make this sort of stuff up. I was really excited about GunVault after having read others' reviews and watching a YouTube video highlighting the GunVault, but after TWO go-rounds of no keys, I've ordered from SnapSafe instead--perhaps they will include keys and I will enjoy the added bonus of having saved $7.00 with this alternative SnapSafe purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "Very sturdy construction while staying compact.",
      "text": "I use this case for transporting my firearm when traveling and I have no complaints. I've read a lot of negative things on the cable that comes with the safe but I don't use it so I can't comment on that. The case feels very sturdy and the foam keeps things secure since you have to close the case with a little effort causing the foam to compress a little. I also like how compact the case is while still holding a large frame pistol.",
      "rating": 5.0,
      "verified": true,
      "author": "UMADragon",
      "helpful_votes": 0,
      "publication_date": 20140512
    },
    {
      "title": "Good, but needs a thicker cable and high security lock....",
      "text": "Decent measure for storing a fire arms for short periods of time in a car. However, I upgraded the cable to a thicker and tougher cable, as well as put a Abloy high security cam lock on it.",
      "rating": 3.0,
      "verified": true,
      "author": "JustSomeCop",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "great little safe",
      "text": "i keep this safe in my truck. the cable seems a little light weight, but it does get the job done. i bet a determined their with w medium sized bolt cutter would be happy to find it, though. it locks nice and tight, and is really easy to remove and stick in a backpack or purse. I can fit a glock 17, or a sig 226, and even a 1911 in it, but no spare mags. And if you have a tac light on your pistol, you have to take it off before storing in the safe, it just won't fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Rory",
      "helpful_votes": 0,
      "publication_date": 20140530
    },
    {
      "title": "Would buy again, but......",
      "text": "I'd give this item 5 stars if it weren't for the locking mechanism location. The lock on the inside may be able to scratch items inside. There isn't a protective barrier between the latch of the lock arm and your locked item. I'll probably coat the locking arm in plastic to fix this. Item is weighty, which is to be expected. Will work nice to store my personal items away from prying fingers. I will be purchasing another one for my second vehicle.",
      "rating": 4.0,
      "verified": true,
      "author": "Numero4",
      "helpful_votes": 10,
      "publication_date": 20140320
    },
    {
      "title": "One more key to carry.",
      "text": "This is a handy item, but I should have spent the extra money for a finger print locking/opening system. One more key to carry.",
      "rating": 4.0,
      "verified": true,
      "author": "Exhausted Elmer",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Good Product and I would buy again.",
      "text": "Use this in my SUV all the time. I valet park sometimes and take my SUV to the shop for general maintenance. Nice to have a place to secure your 45 outside of the center console or glove compartment when locked with the ignition key. 45 is a close fit. If you have room under your seats it can slide out of view. Cord or coded wire could be a snip away from it leaving your car but the thief needs to bring this with them. I would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20141013
    },
    {
      "title": "This is a great travel gun case",
      "text": "This is a great travel gun case. I carried my Rutger P95 9mm and the extra 15 round magazine in it, with no problem. The material it is made from is heavy and very solid. The inside has a foam material that protects the firearm inside. Well worth it for the price too. Especially if you are going through asinine states, with asinine gun laws requiring the gun be put away. Illinois, California I'm looking your way!",
      "rating": 5.0,
      "verified": true,
      "author": "Trenaway",
      "helpful_votes": 0,
      "publication_date": 20150615
    },
    {
      "title": "For the price an excellent buy.",
      "text": "Exactly as promised, providing a safe way to lock up a weapon inside of an auto, or checked on an airplane. It's clearly not a safe, and with enough time any diligent criminal could figure out how to open it. But it can be cabled or chained into a car, provide legal protection for areas requiring locked and inaccessible firearms, and it will probably keep most children out. Better security would cost a great deal more. For the price, an excellent buy.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert G. Heinritz, Jr.",
      "helpful_votes": 0,
      "publication_date": 20131214
    },
    {
      "title": "Perfect little lock-box",
      "text": "I read all the reviews on this vault and then ordered it for a vehicle vault. Its perfect for my purpose. I read there were issues with the cable and was prepared to order an upgrade from TufNut, but that wasnt necessarty as I think they heard all the criticisms and upgraded the cable. The hinge design has been improved and is no longer easy to push out. Its not the strongest box or cable out there but is certainly strong enough for my purposes. The metal is 18 gauge and is a strong design. The others out there in this category are much more expensive, heavier, and bulkier. A well made purpose-built design. Kudos. The Wiz",
      "rating": 5.0,
      "verified": true,
      "author": "D. Kahn",
      "helpful_votes": 0,
      "publication_date": 20130110
    },
    {
      "title": "Ok, for what it is.",
      "text": "This product is cheap yet effective for gun storage/safety. It has space constraints that become more apparent once it is filled; using the restraining cable included causes some locking issues but with a little working one can get this unit secured. Pro: Price Slim Protective Con: Quality Fitment Reliability Locking Mechanism Durability",
      "rating": 3.0,
      "verified": true,
      "author": "Brais Whirl",
      "helpful_votes": 0,
      "publication_date": 20140612
    },
    {
      "title": "Decent for its purpose",
      "text": "It's a durable lock box and good for locking things away from just general curious hands or eyes. I don't really use it to prevent theft but I have mine bolted and cabled to slow it down. For me it's just a deterrent and I believe it's right to lock up your firearms when not in use. The cable seems easy to cut but bolting it down would cost a thief a few minutes. Where I have it bolt would cost a few more mintues to pry open in place.",
      "rating": 4.0,
      "verified": true,
      "author": "VelocityTop Contributor: Camping",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "It would be very easy to break into",
      "text": "As others have stated, this is more of a deterrent than an actual gun vault. It would be very easy to break into, if someone truly wanted the contents inside. But for my current purpose, it couldn't work any better. I have a 2 year old, so this is perfect for keeping his grubby little fingers off until he gets proper firearm training, or until I have to get a high quality gun vault. Would definitely recommend for people in the same boat.",
      "rating": 5.0,
      "verified": true,
      "author": "easton shew",
      "helpful_votes": 0,
      "publication_date": 20150507
    },
    {
      "title": "GREAT DEAL",
      "text": "I was really surprised. I was expecting a small kind of cheap box. It isn't. It has a thick cable that will go around my pickup seat 'leg' and it is going to there. My SR9 fits nice with a extra magazine and more room as well. I liked it so well, I got another one as soon as I used this one for a couple of days. I am going to order a few more as gifts. These are perfect to take on a airplane and meets all of the TSA requirements. I am very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeri Holder",
      "helpful_votes": 0,
      "publication_date": 20131116
    },
    {
      "title": "Works",
      "text": "Keep it in vehicle to store gun when I must to enter a death zone AKA Gun Free Zone, to do business. I will not do business with private vendors who declare themselves gun free zones. I honor Fed, state and county gun free zones because I have to do business there. Use it when I travel / fly, have not had any problems with TSA, keep both keys on my person. It will keep a child out but given a short time an adult or teenager could get it open with a small pry bar. Not a quick access box.",
      "rating": 5.0,
      "verified": true,
      "author": "Petethehut",
      "helpful_votes": 0,
      "publication_date": 20130126
    },
    {
      "title": "It's Better Than Nothing",
      "text": "The metal vault works OK but the cable should be heavier. I was surprised that the cable only goes in at one spot on the vault, I assumed that it would go in one side of the vault and come out the other side, but not. I have seen another type that has a hardened metal wide arm clamp clear around one end that would make a gun vault harder to steal. This one will keep the kids out, but not a determined thief.",
      "rating": 3.0,
      "verified": true,
      "author": "L. Mattox",
      "helpful_votes": 0,
      "publication_date": 20141224
    },
    {
      "title": "Ok for Flights",
      "text": "Ok if you’re going to use it for TSA requirements. Other than that easy to break in.",
      "rating": 4.0,
      "verified": true,
      "author": "Gokhan Alp",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Grate Product as advertised I'am going to show every Gun Safety Person I know",
      "text": "Grate Product as advertised I'am going to show every Gun Safety Person I know",
      "rating": 5.0,
      "verified": true,
      "author": "Randall R Wahlert",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Great box.Shop around.",
      "text": "I bought this box for traveling on commercial airlines. I usually don't lock up a gun.Apparently TSA likes this box. I flew from Jacksonville Florida, connected in Charlotte then on to Las Vegas and back via same route. It was seamless, so do not hesitate to travel with a firearm. The requirements are on the TSA website. This box fit my Glock 23 and 3 magazines perfectly. However, I saw this box at Gander Mountain for $10.00 less so mabe shop around.",
      "rating": 4.0,
      "verified": true,
      "author": "Campbell",
      "helpful_votes": 0,
      "publication_date": 20130707
    },
    {
      "title": "Don't Confuse Purposes",
      "text": "As other reviewers have noted, you can pick the lock with a paperclip, cut the cable easily, and pry this thing open with hand tools. As theft prevention, it is only marginally better than nothing at all. I don't even think of it as a loss prevention device, I think of it as tragedy prevention. If you keep a loaded gun in the house, and you need it accessible (because when seconds count, help is only minutes away), but you have kids, I think this might be a useful device.",
      "rating": 3.0,
      "verified": true,
      "author": "Dorky Dad",
      "helpful_votes": 0,
      "publication_date": 20130510
    },
    {
      "title": "correctrd cable to vault.",
      "text": "This vault is really good. The cables listed in other reviews saying they were pitifully bad, this has been corrected. I have several of these now and do exactly what I wanted them for-- DELAY the thief---thief doesn't have time to defeat this vault and will move on to others. Quick and easy to deploy and use. Some have a problem with the key-- get over it --- It does what it is intended to do.I recommend this vault.",
      "rating": 5.0,
      "verified": true,
      "author": "Shadetree01",
      "helpful_votes": 0,
      "publication_date": 20150922
    },
    {
      "title": "great for Walther P99 (9mm)",
      "text": "I wanted a more secure case for my handgun and this worked just fine. I use to have just the standard lockless case it originally came with but decided I wanted to protect it. PROS: -good protection -good size for smaller guns -looks good -has a cable CONS: -the key quality seems a tad cheapy but it works -dont like the handprint on the front bc it misleads one into thinking it is a finger print safe",
      "rating": 5.0,
      "verified": true,
      "author": "JediMind88",
      "helpful_votes": 0,
      "publication_date": 20140212
    },
    {
      "title": "It does what it is made to do",
      "text": "This product is great for traveling ,and home protection from kids .A lock only keeps an honest man Honest. I bought the one 100 and the 200 , for car and house. See how to use it on gun TV then buy it on Amazon (-:",
      "rating": 5.0,
      "verified": true,
      "author": "Diane and JIM Meehan,",
      "helpful_votes": 0,
      "publication_date": 20161031
    }
  ],
  "product_meta": {
    "title": "GunVault Nanovault 200 Nano Pistol Safe NV200",
    "description": "Gun vault Nano vault handgun safes. Lock-down protection has never been so affordable. Strong, slim, and highly protective, Nano vault pistol safes fit discreetly in a bag, briefcase, desk, or under your car's seat to provide security and easy access. 3 models to choose from... each with 1 1/4\"-thick memory foam and heavy-gage steel construction. All Nano vault models meet TSA firearm guidelines, so they're perfect for the carrier who travels. Each includes a 1,500-lb. Security cable. Key lock mechanism. Exterior measures 1½\" x 6½\" x 9½\". 18 gauge steel construction.",
    "rating": 4.5,
    "feature_bullets": [
      "Easy to operate key lock system",
      "Compact size allows storage virtually anywhere",
      "The nano vault meets TSA airline firearm guidelines",
      "Interior top and bottom lined with 1/2 inch thick memory fitting foam",
      "A 1500 pounds test security cable is included",
      "Easy to operate key lock system",
      "1.25 inch thick memory foam interior",
      "18 gauge steel construction, compact size allows storage virtually anywhere"
    ],
    "specifications": {
      "Date First Available": "February 22, 2019",
      "Manufacturer": "GunVault",
      "ASIN": "B07P1BM638",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Shooting",
      "Gun & Ammunition Storage & Safes",
      "Gun Safes & Cabinets",
      "Tools & Home Improvement",
      "Sports & Fitness",
      "Gun Accessories, Maintenance & Storage",
      "Hunting & Fishing"
    ],
    "price": ""
  }
}