{
  "website_summaries": [
    {
      "verdict": "If accessibility is an important factor, this is definitely a ladder to consider. Easy to assemble, and resists corrosion and rusting for years.",
      "pros": [
        "Swim-through barrier for additional safety",
        "Slanted treads easier for older and younger users",
        "220-pound capacity",
        "All-resin construction means no rusting",
        "Assembly require minimal tools, instructions are well written"
      ],
      "cons": [
        "Some pools may require longer lag bolts (not included)",
        "Must be stabilized with sand or gravel"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Pool ladder for 27' round above ground",
      "text": "Ladder arrived in a quick prompt manner was generally easy to put together and install in the pool. Negative is that it is not as sturdy as I would like considering I have 2 kids using the ladder. It is much better than the ladder that came with the pool so that is a plus. Overall, I only used this a short time and opted to spend more money and get a sturdy ladder that I felt was a lot safer for everyone using it.",
      "rating": 3.0,
      "verified": true,
      "author": "Peter F Neurohr",
      "helpful_votes": 8,
      "publication_date": 20130821
    },
    {
      "title": "If you don't mind drilling a whole in the top of the pool it is a great buy for the price the description is just misleading",
      "text": "I don't know if I misread the description but this ladder DOES NOT connect to the deck you have to drill wholes for the bolts on top metal tail of the pool and we could not get enough water in the ladder to keep it down in the pool either so had to put a weight on it to keep it from floating. It will work seems to be more stable than the other ladder. If you don't mind drilling a whole in the top of the pool it is a great buy for the price the description is just misleading.",
      "rating": 3.0,
      "verified": true,
      "author": "Francine",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "Not a bad ladder but it floats",
      "text": "Not a bad ladder but it floats. The cover that came with the ladder was broken in half. Trying to find a replacement has proven difficult. Amazon wasnt much help",
      "rating": 2.0,
      "verified": true,
      "author": "Shawn Morford",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Fine for the average child or adult",
      "text": "Fine for the average child or adult. The upper handles are plastic and supportive of larger,older people. you have to be careful not to put full weight pulling yourself up if the legs are weak.. Fairly easy to assemble.",
      "rating": 3.0,
      "verified": true,
      "author": "WWII  son",
      "helpful_votes": 0,
      "publication_date": 20170805
    },
    {
      "title": "it worked out great. its very sturdy and the kids have no ...",
      "text": "This ladderis exactly what were looking for, for our above ground pool. Although we had to make some small adjustments, it worked out great. its very sturdy and the kids have no trouble getting on and off.",
      "rating": 5.0,
      "verified": true,
      "author": "VC1913",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Sturdy steps",
      "text": "Very sturdy steps. Handle is fine for most but if a lot of weight is put on it going down into the pool it might not hold up. I'm talking about maybe a 250 lb. unstable person using it to support their weight. I am very happy with it though.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Great sturdy ladder",
      "text": "Great sturdy ladder. We attached it to a deck for our above ground pool. Makes getting in and out so much less scary.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Reeve",
      "helpful_votes": 0,
      "publication_date": 20170708
    },
    {
      "title": "Vast improvement over the ladder than came with our pool",
      "text": "I used in this ladder in conjunction with a small deck I built to access our Intex 26' x 52\" above ground pool. It's a vast improvement over the ladder that came with the pool. It easily attached to the deck and is very stable. The steps are wide and comfortable. The pool is much more useable now.",
      "rating": 5.0,
      "verified": true,
      "author": "thp146",
      "helpful_votes": 0,
      "publication_date": 20130710
    },
    {
      "title": "Sturdy ladder",
      "text": "This ladder is very strong if you're under 300 lbs... The only thing I had problems with is that the bolts to hold the ladder to the deck were not long enough to be useful. Hope the manufacturer checks into this problem. Other than that it's wonderful. Would recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "Sandi",
      "helpful_votes": 7,
      "publication_date": 20111013
    },
    {
      "title": "Terrible quality control",
      "text": "This is missing too many pieces to be used. Terrible quality control, floats, and I just realized I can't return this garbage because it has been more than 30 days. Save your money and buy something better.",
      "rating": 1.0,
      "verified": true,
      "author": "WMH",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "Five Stars",
      "text": "was perfect for getting out of my above ground pool VERY comfortably",
      "rating": 5.0,
      "verified": true,
      "author": "M. Williams",
      "helpful_votes": 3,
      "publication_date": 20150922
    },
    {
      "title": "Disappointed in quality",
      "text": "I bought this ladder in June and it cracked in August. Disappointed in quality. It seemed heavy duty but I guess not.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica Dorsey",
      "helpful_votes": 0,
      "publication_date": 20160913
    },
    {
      "title": "Great Ladder",
      "text": "This same ladder in the pool store was over $200! Amazon, as always, provides the same quality at a lower price. Ladder fit perfectly in 18x52 round pool.",
      "rating": 5.0,
      "verified": true,
      "author": "CL3",
      "helpful_votes": 2,
      "publication_date": 20130701
    },
    {
      "title": "Arrived cracked and broken",
      "text": "The base/cover part of the ladder arrived cracked and broken. It is completely unusable and now we need to return it. Very dissatisfied.",
      "rating": 1.0,
      "verified": true,
      "author": "Rosemarie Coppola-Baldwin",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "This ladder serves it's purpose. My only complaint would be the top handles.  Could be firmer.",
      "text": "Very durable ladder. We mounted it onto our deck and the fit was perfect! We had to use longer bolts probably because of the deck. All other screws fit appropriately.",
      "rating": 4.0,
      "verified": true,
      "author": "Terri Barclay",
      "helpful_votes": 0,
      "publication_date": 20140719
    },
    {
      "title": "made a very bad choice",
      "text": "ladder is cheaply made, there is no room to secure the bolt into a wood deck and the poles are usless....made a very bad choice",
      "rating": 2.0,
      "verified": true,
      "author": "John Ferrigno",
      "helpful_votes": 0,
      "publication_date": 20150722
    },
    {
      "title": "Perfect",
      "text": "I love my new pool ladder. I am anxious to start using it, we have it attached to our deck and ready for the weather to change so the pool will warm. This ladder is a great buy and is definatly heavy duty.",
      "rating": 5.0,
      "verified": true,
      "author": "Gail",
      "helpful_votes": 3,
      "publication_date": 20130328
    },
    {
      "title": "Pool Ladder",
      "text": "Ladder was not easy to assemble and putting the ballast in the bottom section was a pain. I could not get it to line up to the lip of my pool to bolt on so I have it in my shed if anyone wants to buy one cheap.",
      "rating": 2.0,
      "verified": true,
      "author": "dramsey",
      "helpful_votes": 2,
      "publication_date": 20121219
    },
    {
      "title": "sturdy",
      "text": "Well made and sturdy for plastic, but is larger than it looks had to modify the handles to fit my pool, Full dimensions would be helpful",
      "rating": 4.0,
      "verified": true,
      "author": "Craig Wise",
      "helpful_votes": 0,
      "publication_date": 20140707
    },
    {
      "title": "Four Stars",
      "text": "Nice sturdy pool ladder. Took about a half hour to put together and has been great.",
      "rating": 4.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 0,
      "publication_date": 20160930
    },
    {
      "title": "easily installed! Supports my weight",
      "text": "easily installed! Supports my weight! Easy to enter and exit the pool! Easy to take down for winter storage!",
      "rating": 5.0,
      "verified": true,
      "author": "G. Fox",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "Five Stars",
      "text": "A thousand times better than the ladder that came with the pool. Worked perfect attached to our deck.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy D. Stelter",
      "helpful_votes": 0,
      "publication_date": 20150821
    },
    {
      "title": "Four Stars",
      "text": "Easy to put together, works very well in my 54\" height pool",
      "rating": 4.0,
      "verified": true,
      "author": "ignacio",
      "helpful_votes": 0,
      "publication_date": 20170516
    },
    {
      "title": "Good For The Price",
      "text": "Not quite as \"Heavy Duty\" as expected, but sturdy enough. Assembly was fairy easy. It looks like it will last for a long time.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Lombardo",
      "helpful_votes": 0,
      "publication_date": 20130824
    },
    {
      "title": "Wide steps and sturdy handrails. Rust free for saltwater pool",
      "text": "Exactly what I wanted. Wide steps and sturdy handrails. Rust free for saltwater pool.",
      "rating": 5.0,
      "verified": true,
      "author": "daniel lee higgins",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "Replaced Existing",
      "text": "I had this ladder when I bought my pool 5 years ago. It had finally broke beyond repair at the end of last year, and this one was the exact same. No needing to re-drill holes in my deck. Shipped ontime and product was exactly what I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Pate",
      "helpful_votes": 0,
      "publication_date": 20130607
    },
    {
      "title": "WOW - this is a FANTASTIC ladder",
      "text": "I opened the box after it was delivered and it looks great - strong sturdy with stainless steel fastenings. I own an intex ultra frame pool and this ladder is going to be a big upgrade to the original ladder. The price was great - but even more surprising its great value for money. Looks like a ladder that cost a whole lot more.",
      "rating": 5.0,
      "verified": true,
      "author": "BINGFAN",
      "helpful_votes": 3,
      "publication_date": 20130612
    },
    {
      "title": "Summer fun!!",
      "text": "Great ladder,the best one we have purchased so far.Better than expected!The treads are wider and textured for safer entrance and exit from pool.Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "larry lingerfelt",
      "helpful_votes": 0,
      "publication_date": 20140608
    },
    {
      "title": "Good pool ladder",
      "text": "The only negative I have is that you must put rocks in the bottom to keep the ladder from floating up. The cavity is not very large and if you put too many rocks in, the cover is hard to attah",
      "rating": 4.0,
      "verified": true,
      "author": "Edward R Donnenwerth",
      "helpful_votes": 0,
      "publication_date": 20130629
    },
    {
      "title": "So far so good",
      "text": "I looked at a lot of ladders, but this one looked like the best option for us. We installed it today and it is working out great. Very sturdy and easy to put together and install.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20140616
    },
    {
      "title": "Great ladder",
      "text": "went together easy, strong.Sand or gravel is needed for bottom to give it weight to hold it down. used three lunch plastic bags of sand to do the job.",
      "rating": 4.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 3,
      "publication_date": 20130730
    },
    {
      "title": "Perfect for our Pool",
      "text": "Our new Heavy Duty In-Pool Ladder works great for our pool. We had difficulties with other designs, but this one works perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "JCT_06",
      "helpful_votes": 0,
      "publication_date": 20130719
    },
    {
      "title": "One Star",
      "text": "To many area that bacteria can grow top handles to shake when climbing up",
      "rating": 1.0,
      "verified": true,
      "author": "Salley D. Hodge",
      "helpful_votes": 2,
      "publication_date": 20160829
    },
    {
      "title": "Sturdy Ladder",
      "text": "This ladder was easy to assemble and is sturdy. I put rocks in the bottom section to weigh it down. The only thing I don't like is it does not come with the flat top step. Didn't want to secure to the pool railing, so I added a 2x4 to our deck to secure it to. Otherwise I am very happy with this purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140423
    },
    {
      "title": "great",
      "text": "very sturdy, great value for the money! I had no trouble installing this ladder, took less than an hour. Love it !",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130807
    },
    {
      "title": "The in pool ladder part is great. Wide steps",
      "text": "The in pool ladder part is great. Wide steps, sturdy. The brackets also attached well to my deck though the bolts provided were not even close to being long enough to go through a deck. My only complaint is that the handles above the deck are very flimsy. They wobble when you hold them and feel like they might break if you leaned on them. Overall I would recommend the ladder.",
      "rating": 3.0,
      "verified": false,
      "author": "David Hammel",
      "helpful_votes": 0,
      "publication_date": 20140815
    }
  ],
  "product_meta": {
    "title": "Splash Pools Heavy Duty In-Pool Ladder, 48 to 54 Inch",
    "description": "Deluxe In-Pool Ladder, Fits 48-inch to 54-inch Pools. This sturdy All-Resin A-Frame ladder features include, Snap Lock Assembly, Anti swim thru barrier, Five Year Warranty, Fits pools 48-inch or 54-inch deep, Weight capacity of 220 pounds, Extra wide steps, Free Lifetime customer support.",
    "rating": 3.4,
    "feature_bullets": [
      "Deck To Pool Ladder",
      "Fits 48-Inch To 54-Inch Pools",
      "Safety Barrier Included",
      "Country Of Origin: United States"
    ],
    "specifications": {
      "Item Weight": "31.6 pounds",
      "Department": "Bedroom",
      "Manufacturer": "Splash Pools",
      "ASIN": "B003G3AWBU",
      "Item model number": "LG IP DLX",
      "Customer Reviews": "3.4 out of 5 stars49 ratings3.4 out of 5 stars",
      "Best Sellers Rank": "#294,169 in Patio, Lawn & Garden"
    },
    "categories": [
      "Pools, Hot Tubs & Supplies",
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Pool Ladders",
      "Parts & Accessories",
      "Slides, Ladders & Diving Boards"
    ],
    "price": ""
  }
}