{
  "website_summaries": [
    {
      "verdict": "A larger 42-millimeter watch with an elegant and lasting slim profile. Hamilton presents a simple yet dressy quartz timepiece.",
      "pros": [
        "Large and elegant watch that's also slim",
        "Good strap quality",
        "Features a date window"
      ],
      "cons": [
        "Illumination markings are weak",
        "Lacks a second hand"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "you probably already like the design - so I'll just add that it ...",
      "text": "Well made and handsome. I wanted a dressier watch that was thin enough to not get hung up on my shirt sleeve. If you're reading this, you probably already like the design - so I'll just add that it is a good value. PS - 1 year later. Wear it almost everyday during the work week. Working perfectly, and wearing well.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Palermo",
      "helpful_votes": 2,
      "publication_date": 20170402
    },
    {
      "title": "Very nicely built. Clean",
      "text": "Very nicely built. Clean, elegant and very classy. However I felt that the date window is very small for a watch its size (42mm) and I had a hard time reading the dates. Returned it and got the Hamilton H32411555 instead. A little small (38mm) but I felt that it was a more 'balanced' watch overall.",
      "rating": 4.0,
      "verified": true,
      "author": "GadgetGuy",
      "helpful_votes": 4,
      "publication_date": 20151017
    },
    {
      "title": "This watch is beautiful, gives an exact amount of elegance that a ...",
      "text": "This watch is beautiful, gives an exact amount of elegance that a traditionalist would adore. For someone in their early 20's or someone with modernness it gives simplicity yet flashiness that your granddad would appreciate. The house of hamilton produces prestigious watches and backs the name up. For someone as myself with a mild collection with little knowledge of watches this really brings me to a collectors level where soon my collection will be relevant to not just me but everyone. I love it. Would have given 10 stars but the 5 system's what I'm working with.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert A Gill",
      "helpful_votes": 2,
      "publication_date": 20150329
    },
    {
      "title": "It is a Hamilton!",
      "text": "Beautiful and classic... brown not black band and NO second hand which might deter some, but without it the white and silver face is clear and very subtle looking. Swiss-made.. and as nice as the Shinola out of Detroit which are hundreds of dollars more.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy V.",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "Very nice looking watch",
      "text": "Very nice looking watch. Has the 1950s or 1960s look to it, which I love. I received the watch in perfect condition and in a timely manner.",
      "rating": 5.0,
      "verified": true,
      "author": "Hot_Tamale!",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Groom's Gift",
      "text": "Got this as a gift for my buddy who was getting married. Classy and sophisticated. Cool old company from PA with a lot of history. Nothing flashy, which I think is what you want from a watch unless you're trying to look like a rapper. Class stays in style for ever, flashy fades away like former hip hop icons Coolio and Sisqo.",
      "rating": 5.0,
      "verified": true,
      "author": "Tedward Bearington",
      "helpful_votes": 0,
      "publication_date": 20140422
    },
    {
      "title": "Great look, great fit, great gift",
      "text": "Wonderful watch. Sturdy and nice looking at a reasonable price. Fit the wrist of my extra large boyfriend. He is delighted with it. Too bad he broke up with me 5 weeks after he accepted this Christmas present. He told his curious family he got it on Amazon, but said nothing of the lovely lady who made his wish for this watch come true and bought it for him. Thus, the relationship disintegrated. Lesson: Buy this great watch, but next time, find a great guy to give it to! LOL!",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia Beck",
      "helpful_votes": 18,
      "publication_date": 20140218
    },
    {
      "title": "Classy beautiful watch",
      "text": "I purchased this watch for my architect husband who likes clean lines and quality products. The face is large which is fashionable, but has enough classic items on it such as the numbers, that it is timeless. My husband misses the sweep second hand, but still likes how the watch looks and feels. Very happy with purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Karen O",
      "helpful_votes": 0,
      "publication_date": 20140118
    },
    {
      "title": "Gorgeous Watch!",
      "text": "Wonderful and stylish. As advertised. The only drawback I've found is the leather band is quite stiff. I hope it will become more \"relaxed\" with wear.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Houston",
      "helpful_votes": 0,
      "publication_date": 20150408
    },
    {
      "title": "Beautiful Watch",
      "text": "Beautiful watch, it may wear very big if you have a small wrist.",
      "rating": 5.0,
      "verified": true,
      "author": "JMN",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "love this watch",
      "text": "i bought this watch for my son at Christmas. he said that he would never wear it and it was too fancy. he gave it to me and i love it, it is so classic.",
      "rating": 5.0,
      "verified": true,
      "author": "Benny Hill",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Stylish, quality watch.",
      "text": "Saw this watch in store for over double what I paid here. Very satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20160427
    },
    {
      "title": "Great looking watch",
      "text": "I've been eyeing this watch for a while now and finally decided to order it when the price dropped to $260. The only draw back is that the band is short for my wrist. The best I can do is attach it be the last, or first depending on how you look at it, hole which doesn't leave any left to put it under the loop. I will have to look at getting a longer band. Other than that I love the looks and size of this watch!",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "Clean and classy look",
      "text": "I purchased this watch for my 23 yo son. He is extremely fussy with what he wears. When this watch arrived I wanted to keep it for myself! It is very classy looking and large enough for an average man's wrist. My son is 5'9 and 175lbs and this fits him perfectly. I myself like watches of case diameter of 44-50mm, but then again I am bigger than my son. What really struck me about this watch was the combination of case diameter and case slimness, along with swiss quartz movement and price. Very sharp and a quality watch too! Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 5,
      "publication_date": 20120112
    },
    {
      "title": "Highly recommended!",
      "text": "Extremely accurate and very comfortable to wear. Very nice dress watch at a reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160123
    },
    {
      "title": "very attractive timepiece",
      "text": "very unique piece of accessory! light and comfortable! very attractive. the unique design catches everyone's eyes. i used to get compliments all the time. one of my friends loved it so much that i had to give it away to him! :'(",
      "rating": 5.0,
      "verified": true,
      "author": "Augustine",
      "helpful_votes": 0,
      "publication_date": 20131128
    },
    {
      "title": "Great Looking Watch",
      "text": "I have only worn this watch a few times so far. I bought it to be a nicer dress watch, especially when a black or metallic band won't work. This watch is a great value in my opinion. So far I have no complaints. I just love the simple, classy look of this watch.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Haag",
      "helpful_votes": 2,
      "publication_date": 20111226
    },
    {
      "title": "Aesthetically Pleasing",
      "text": "Very sleek, modern, and simple. An outstanding watch. I wear it in professional and casual settings and always receive compliments.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Cassidy",
      "helpful_votes": 0,
      "publication_date": 20140212
    },
    {
      "title": "why this watch has the figure 530 nearby Swiss made,and ...",
      "text": "why this watch has the figure 530 nearby Swiss made,and there is some different on the back,I didnt think its the H38511553,who can tell me the reason。",
      "rating": 3.0,
      "verified": true,
      "author": "sevenchan",
      "helpful_votes": 0,
      "publication_date": 20160324
    },
    {
      "title": "Love it, great value",
      "text": "I have 3 Hamilton watches. The others are more expensive chronographs, but this one I live to wear and to me is an outstanding value. It's so sleek, simple and elegant you could wear for any occasion from moderately dressy in up. It looks way more expensive than it is and so thin you forget you're wearing it. Highly recommend to anyone. As Divinci said, simplicity is the ultimate sophistication. To me, this watch nails it.",
      "rating": 5.0,
      "verified": false,
      "author": "Glenn Byrd",
      "helpful_votes": 0,
      "publication_date": 20170219
    },
    {
      "title": "Style and quality!",
      "text": "Mine is on a black dial. It was given as a birthday present and it very elegant, good built (what can you expect from a Hamilton watch?). Happy with this one. Good quality watch without breaking tour savings if you get a mechanicak version of it.",
      "rating": 5.0,
      "verified": false,
      "author": "Cesar A Penailillo",
      "helpful_votes": 0,
      "publication_date": 20201101
    },
    {
      "title": "Simple & Elegant",
      "text": "Solid construction with an easy to read dial. Leather band is of high quaity but does run a little small. If you have a large wrist, you may need another band. It makes a great daily watch for folks who like a dressier watch than a sport/chronograph. Good value for the price.",
      "rating": 5.0,
      "verified": false,
      "author": "Richard D. Gearheart",
      "helpful_votes": 3,
      "publication_date": 20120319
    },
    {
      "title": "quality and understated classical watch",
      "text": "big hands but smaller wrists this watch is a perfect find. Hamilton is timeless and classy, well made, and looks great for a work watch which i purchased for my early thirties husband",
      "rating": 5.0,
      "verified": false,
      "author": "happy customer",
      "helpful_votes": 6,
      "publication_date": 20111008
    }
  ],
  "product_meta": {
    "title": "Hamilton Men's H38511553 Jazzmaster Thinline Silver Dial Watch",
    "description": "Hamilton is established as one of the leading watchmakers in the world with a proven reputation for creating elegant and reliable timepieces. Brushed and polished stainless steel case, Screw-in caseback, Silver dial, Silvertone applied Arabic numerals, Silvertone luminescent hands, Date at the 6 o'clock position, Brown leather strap with white stitching, Pin buckle, Sapphire crystal, Push/pull crown, Swiss quartz movement, ETA caliber 955.112, Water resistance to 5 ATM/50 meters/165 feet, Case measurements are 42 mm in diameter x 7 mm thick, Strap measurements are 22 mm wide x 8 inches long.\n\n\n\n\nPRODUCT DETAILS\n * Is Discontinued By Manufacturer :No\n * Product Dimensions :5.91 x 5.91 x 5.91 inches; 1.76 Ounces\n * Item model number :H38511553\n * Department :Mens\n * Batteries :1 Unknown batteries required.\n * Date First Available :July 16, 2010\n * Manufacturer :Hamilton\n * ASIN :B003XQF5B2\n\n * .zg_hrsr_item {list-style : none};\n * Amazon Best Sellers Rank: #718,027 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry)  *  #5715 inMen's Wrist Watches \n    *  #239645 inMen's Shops \n   \n   \n\n * Customer Reviews:4.4 out of 5 stars49 ratings Hamilton is established as one of the leading watchmakers in the world with a proven reputation for creating elegant and reliable timepieces. Brushed and polished stainless steel case, Screw-in caseback, Silver dial, Silvertone applied Arabic numerals, Silvertone luminescent hands, Date at the 6 o'clock position, Brown leather strap with white stitching, Pin buckle, Sapphire crystal, Push/pull crown, Swiss quartz movement, ETA caliber 955.112, Water resistance to 5 ATM/50 meters/165 feet, Case measurements are 42 mm in diameter x 7 mm thick, Strap measurements are 22 mm wide x 8 inches long.",
    "rating": 4.4,
    "feature_bullets": [
      "Made in USA or Imported",
      "Date",
      "Silver dial",
      "Pin buckle",
      "Luminous hands; Round case",
      "Water resistant to 165 feet (50 M): suitable for swimming and showering"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "5.91 x 5.91 x 5.91 inches; 1.76 Ounces",
      "Item model number": "H38511553",
      "Department": "Mens",
      "Batteries": "1 Unknown batteries required.",
      "Date First Available": "July 16, 2010",
      "Manufacturer": "Hamilton",
      "ASIN": "B003XQF5B2"
    },
    "categories": [
      "Wrist Watches",
      "Men",
      "Watches",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 306.7
  }
}