{
  "website_summaries": [
    {
      "verdict": "A good mat that comes at a decent price and can perform as well as more expensive versions.",
      "pros": [
        "Comes in 3 size options for your space",
        "Made with partially recycled materials and produced using 30 percent renewable energy",
        "Can be used on hard floors or low pile carpets",
        "Clear material makes mat less noticeable"
      ],
      "cons": [
        "Does not work on carpet as well as on hard surfaces"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Better deal than at the large office supply chain",
      "text": "Exactly what I needed. The mat came well packed and it was less expensive than at the nearby office supply store. Interestingly, it came with instructions on how to unroll it and flatten it; particularly useful when the package had been sitting out in the cold and practically frozen. The only drawback is the requirement to keep it at 72 degrees Fahrenheit for several hours (72+) to unroll it an flatten it. We don't keep our home that warm in February. I managed to get it (almost) flat at a much lower temperature without cracking it; there is only one curve that remains near the back edge; I trust it will disappear when the weather warms up.",
      "rating": 5.0,
      "verified": true,
      "author": "Pragmatic in CT",
      "helpful_votes": 0,
      "publication_date": 20150305
    },
    {
      "title": "Bought to protect a new laminate floor",
      "text": "Contrary to previous reviews my mat: has a \"tongue\" (the \"body\" is 35 inches wide by 37.5 inches long); was packed flat (not folded or rolled); lay flat immediately; and has no noticable odor. It is \"clear\" and transparent viewed straight on, but because of the slight dimpling on the bottom side it's \"milky\" translucent viewed at an angle. There's no telling how long it will last, but certainly longer than the floor would without it. Which is the whole point of the exercise. It's still rather a lot of money for a flat sheet of plastic (however nicely detailed), but the \"value\" is not in the item, it's in the floor it protects. That's the \"gotcha\" . . .",
      "rating": 5.0,
      "verified": true,
      "author": "Deward Hastings",
      "helpful_votes": 4,
      "publication_date": 20111105
    },
    {
      "title": "Yep - it's a mat",
      "text": "Solid, thick mat. Good size, flat for the bottom side and textured on the chair side. Does not have a lip. Arrived flat. I win this round, chair.",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 86,
      "publication_date": 20110823
    },
    {
      "title": "Still not flat yet",
      "text": "Been 8 days and it's still curly, yey! I don't get how some reviews say that it arrived flat. Seriously, if it does not arrive flat, just return it right away. I really, really hate this. Now it's just a piece of curly, wavy piece of plastic that almost makes me trip and kill my self. Oh, also, I put it on hard wood floors and it can slide freely, wooooo!! Does not even stay. I don't know, maybe because it's not flat yet? But I doubt it will get flat anyway. If you want to buy a chair mat, just make sure, really make sure that it will arrive flat.",
      "rating": 1.0,
      "verified": true,
      "author": "Ardo",
      "helpful_votes": 0,
      "publication_date": 20130820
    },
    {
      "title": "Great product, poor shipping solution",
      "text": "Product itself is fantastic and works exactly as described. Shipped flat, not rolled up, so it seems someone is learning from their mistakes in shipping. However, this is where this floor mat loses a star. It was shipped flat, sandwiched between two large pieces of cardboard that were stapled together along the edges. There were not nearly enough staples to hold the mat stable, and as a result, by the time I actually got it, my new mat was halfway out of the packaging and completely exposed to the elements as it is not even wrapped with plastic or anything.",
      "rating": 4.0,
      "verified": true,
      "author": "Gregory Johnson",
      "helpful_votes": 0,
      "publication_date": 20150204
    },
    {
      "title": "Was dangerous on hard surface",
      "text": "DO NOT USE on HARDWOOD or MANUFACTURED flooring! Bought to protect floor under the desk chair with casters. The mat slips when you step on it to get into your chair, and as such, is very dangerous. May work well on carpet, but not anything slick. Tried turning it over to try the other side, but both were slick. Husband had thrown away the BIG box so I couldn't return it. Also, note it comes rolled up and it took a few days to get it to lay flat before we could use it.",
      "rating": 1.0,
      "verified": true,
      "author": "D-and-E",
      "helpful_votes": 0,
      "publication_date": 20150518
    },
    {
      "title": "Good buy at fair price",
      "text": "We just put down hardwood flooring in our home, so we needed something to protect our floors from our computer chairs. These worked perfectly. Although I was a little worried when they first came because they were rolled up, after a few days they did start to lay down flat. Although I have had them for several weeks and one is not completely flat, I believe it was because it was rolled the opposite direction as the other one I got, so more to due with shipping issues then actual problem with the product. Otherwise they are very nice, almost too slick because the chairs now roll REALLY easy on the mats.",
      "rating": 4.0,
      "verified": true,
      "author": "Ralith",
      "helpful_votes": 0,
      "publication_date": 20130326
    },
    {
      "title": "great price",
      "text": "Same exact product as Office Max, for less than half the cost. Maybe (like me) you don't know what a \"lip\" on a mat is- I'm guessing it is the shape (more like a T- not square or rectangular). I didn't really want that shape but it works fine with plenty of space to roll my computer chair around on while protecting my wood floors.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of three",
      "helpful_votes": 52,
      "publication_date": 20110418
    },
    {
      "title": "It does the job.",
      "text": "I have hardwood floors in my bedroom/office and my rolling chair was starting to destroy the finish, so I ordered this. It was a little annoying at first because it came rolled up and I had to bend it a little to get it to lie flat. But it flattened out after about an hour under my chair. It works great (my floors are definitely happier for it) but my only complaint is that the mat slides around a bit despite being for hard wood floors. I might try out some thin non-slip pads to stick to the underside to fix that. A minor annoyance for a good product, though. Worth the buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Ai A.",
      "helpful_votes": 0,
      "publication_date": 20130510
    },
    {
      "title": "Does it's job when it stays in place",
      "text": "We got this because we just redid our kitchen/office and wanted to protect the new linoleum from our office chair. It came rolled up and took some time to flatten out, but we expected that. Our main issue with this is that it doesn't stay put. It tends to slide on the floor and then the wheels of the chair end up off the mat. I am not sure how this could be corrected because it seems to me if you make the thing sticky on the bottom it might damage the floor anyway. If I had it to do over, I might go with something heaver.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Oyler",
      "helpful_votes": 0,
      "publication_date": 20131031
    },
    {
      "title": "could be a little bigger",
      "text": "I felt this ended up a little bit on the small side (particularly wide). Other than that it is ok. I ordered two and they came \"folded\" up in a box. The folds went both ways and this made it so that I could not use it for several days. I had to take the mats out and put them under a heavy area rug for it to settle down and lie flat. I think it would have straitened out quicker had it been rolled before putting in the box. The way that it was done had sharp bends (not creased) in both directions kind of like an S but with more curves. The price was great.",
      "rating": 4.0,
      "verified": true,
      "author": "Thatcher Furgerson",
      "helpful_votes": 0,
      "publication_date": 20130411
    },
    {
      "title": "Saved my floors",
      "text": "I have an antique desk chair with metal wheels and they were starting to damage my wood floors. AdvantageMat to the rescue! This mat has a textured finish, which helps make it nonslip, but the chair glides very smoothly on it. The mat also stays in place very well, not even sliding on wood floors. I think that this mat would be good for almost any floor surface. One note is that is does ship rolled up. Just roll it the other way and lay it out and let it settle. In less that a day, you'll be good to go.",
      "rating": 4.0,
      "verified": true,
      "author": "WMassGuy",
      "helpful_votes": 0,
      "publication_date": 20130731
    },
    {
      "title": "For the price, can't beat it. I was ...",
      "text": "For the price, can't beat it. I was concerned at first after reading some reviews stating that the mat comes rolled up and it's hard to unroll and flatten it and some complained about strong odor. That didn't happen to me at all, FedEX delivered this unrolled, it was packaged in between 2 flat paper boards, and it didn't have any strong/weird odor that would bother me. The one I bought is 48 x 36 Inches, Rectangular with Lip, (129020LV), for only $18.97, Sold by: Amazon.com LLC.",
      "rating": 5.0,
      "verified": true,
      "author": "Yung Li Wang",
      "helpful_votes": 0,
      "publication_date": 20150113
    },
    {
      "title": "Slides everywhere.",
      "text": "Slide around a lot on my hardwood floor. Have to reposition it constantly . Needs to have something on the face down side to keep from sliding. Might have been better off with an area rug and a mat with teeth. Otherwise, it does it job when it is in place, and has protected my hardwood. Overall I am satisfied, but took off 2 stars due to the inconvenience.",
      "rating": 3.0,
      "verified": true,
      "author": "Wigged Out Fat GuyTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20161123
    },
    {
      "title": "Exactly what I needed!",
      "text": "This is a floor protector that is super flat which is what I wanted for the type of surface I was putting it on. It protects the floor nicely and because it is so super flat, it allows the swing-a-way door on this craft desk to open across it easily. It is the non \"teethed\" variety which is perfect for a linoleum floor. I was afraid it would slip and slide about with use but it doesn't. It stays right where I put it and doesn't shift. I recommend this to anyone who needs some floor protection from a flat and flexible mat.",
      "rating": 5.0,
      "verified": true,
      "author": "SarahCTop Contributor: Coloring",
      "helpful_votes": 0,
      "publication_date": 20130318
    },
    {
      "title": "Good price point",
      "text": "This mat has a nice stick to it and is perfect for hardwood floors. It did initially have the bad odor I had read about, but for me at least it went away fairly quickly. The big key to my purchase however is that the initial buying option of $50 is not a good deal. Fortunately, if you look closer you see that Amazon.com has an option for under $20, but it doesn't show up as the primary because it won't ship for 4-5 weeks it says. If you can wait a bit, I got mine in around 2 weeks I believe, and saved a lot vs. any comparable hardwood mat.",
      "rating": 4.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 2,
      "publication_date": 20110827
    },
    {
      "title": "Good for protecting carpet from computer chairs",
      "text": "This is a thick plastic mat that will protect your carpet from your rolling computer chair. My only complaint is i wish it was a little bit longer. I find that my computer chair rolls off the back of it quite frequently. If you dont roll around a lot in your chair then it may work perfectly for you. I have had it for about 6 months now and have not noticed any wear or defects with the mat. After you get the mat, it take a couple days/week for the mat to fully relax flat to the shape of your floor.",
      "rating": 3.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 0,
      "publication_date": 20131011
    },
    {
      "title": "Not perfect, but it's a sheet of plastic, not a rocket ship!",
      "text": "It's a sheet of plastic. It's not a complex engineered product. It lays on the floor, and it protects your floor. It ships rolled up. It does take a few weeks to flatten out. But it does flatten out. Before it does, it snags on the rollers and is annoying. But that goes away, and once flat, it works fine. It's also a decent size, bigger than most. You might not realize how big an area your chair actually uses. This isn't huge, but sufficient. All in all, good price and decent product.",
      "rating": 4.0,
      "verified": true,
      "author": "K and B",
      "helpful_votes": 0,
      "publication_date": 20130612
    },
    {
      "title": "After you get it unrolled it works really good.",
      "text": "This unit was very inexpensive. It came rolled up tight. Says to unroll and place open on the ground to flatten. It would not open enough. So I put it my bathroom with electric heater and after 4 hours was able to unroll almost flat. I put stuff on top of it as suggested and left overnight. The next day it was totally flat. Have had it now over thirty days and it is still flat and protecting my hardwood floor.",
      "rating": 5.0,
      "verified": true,
      "author": "Emma L",
      "helpful_votes": 0,
      "publication_date": 20150403
    },
    {
      "title": "Perfect - Just as described",
      "text": "First of all, the mat did NOT smell like skunk as many people have described. It seems they have fixed that problem during production or warehouse storage of this product. Secondly, my mat did come with a lip in the front just as described. Thirdly, it was delivered flat and NOT rolled up. The only drawback - and this is a really tiny one and easy to fix - is that it is somewhat slippery on my hardwood floor. But two tiny pieces of double sided tape have solved this problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Marty",
      "helpful_votes": 0,
      "publication_date": 20111213
    },
    {
      "title": "Too slippery to be safe",
      "text": "I wish I had paid more attention to the other reviewers who noted how slippery this mat is. I'm not talking about the top surface (where the chair touches it), but the bottom (the side touching the floor). Several times I nearly fell when I stepped on the mat, and it started to slide out from under me. This mat does not grip the floor at ALL - and I've tried it on both carpet and tile flooring, and had the same problems. So I just think it's too dangerous to use. Bummer!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazonaholic",
      "helpful_votes": 0,
      "publication_date": 20130718
    },
    {
      "title": "It's a mat that won't lay flat",
      "text": "It's a decent mat. Unfortunately it slides around on the hardwood floor. Double-unfortunately, the mat was delivered in a box that required the mat to be rolled-up. And it wasn't just rolled into a circle, it was a W-shape - bizarre. I'm probably sending it back because it won't lay flat, even after a few days of placing heavy objects on the curved ends. I recommend you buy from somewhere else, unless you get lucky like someone else here who received one in a flat box...",
      "rating": 2.0,
      "verified": true,
      "author": "kwt ",
      "helpful_votes": 0,
      "publication_date": 20130711
    },
    {
      "title": "1 Week and its trash!",
      "text": "I would give this item ZERO stars if I could. Packaging was good, and Amazon's shipping was fast. The product itself is another matter. First, it took about a day for it to flatten out to be installed. After installation, it took about 4 days for it to develop a tear. My former mat lasted for about 4 years, and the only reason I replaced it was it was getting dull. Glad I didn't toss it, as I am using it again. Don't buy this piece of junk!!!",
      "rating": 1.0,
      "verified": true,
      "author": "A. Mccain",
      "helpful_votes": 2,
      "publication_date": 20130515
    },
    {
      "title": "It works .",
      "text": "As stated , it's for wood , tile , or linoleum floors , it doesn't work on short nap carpet ( and it's not designed for that ) , The material is a little thin for the style casters on my desk chair and I am not what I would call heavy , (175 lbs. ) . But it is low cost and works for the limited amount of time that I need it . However if I would need it for 8 hrs a day , 5 days a week , I would buy a thicker / more expensive mat .",
      "rating": 3.0,
      "verified": true,
      "author": "Foxman",
      "helpful_votes": 0,
      "publication_date": 20131015
    },
    {
      "title": "Slips like crazy on hardwood floors",
      "text": "I ordered four of these after we had hardwood floors put in our office. Since it was advertised for hardwood, I guess I assumed that it would sit on hardwood without slipping. Unfortunately, it is just a plain, frosted/clear hard plastic mat. There is nothing on the bottom to keep it from slipping and being made of clear plastic, any non-slip stuff I put under showed through and it made high spots. I do not recommended for hardwood floors.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130813
    },
    {
      "title": "Good value",
      "text": "I work from home and my chair had been causing scratches in my hardwood floors. This mat was the perfect solution. It was cheap and it large enough that I can roll in and out without ever having the wheels of my chair touch the floors. Its not even very noticeable when I walk in the room because the floor is visible through the clear plastic. I would definitely recommend this as an option to help save your floors from scruffs or marks from chair wheels.",
      "rating": 5.0,
      "verified": true,
      "author": "MostOkayestMom",
      "helpful_votes": 0,
      "publication_date": 20130915
    },
    {
      "title": "Love the mat, not the packaging.",
      "text": "I received my mat very quickly, and it works perfectly. Except the fact that 4 days later it still isn't flat. They shipped it in a very thick box that was far too wide, allowing the mat to unroll and bend into a box shape. Now the lip sticks up and the mat is very wavy. It is getting better day after day, just a bit annoying. It is a great mat for hard floors or thin rugs, and it will be even better once it is flattened into shape.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele",
      "helpful_votes": 0,
      "publication_date": 20130924
    },
    {
      "title": "DO NOT BUY!!!",
      "text": "Very bad quality, very thin, I used it in my home office where I have carpet and I bought to protect the carpet, it made it worse and made bad marks on the carpet, the corner keeps folding and I'm unable to straight. Complete waste of money, and I'm wondering how this product is \"Best Seller\". DO NOT BUY. I got another one from OfficeMax much much better.",
      "rating": 1.0,
      "verified": true,
      "author": "TheReviewerZ",
      "helpful_votes": 0,
      "publication_date": 20150323
    },
    {
      "title": "Not for use with carpet",
      "text": "I guess the product title says its for hard wood floors and tile and that sort of thing but I looked at the picture and the measurement not the title. Silly me. Just to clarify this thing is not for use on carpet, the plastic is very soft and does not make it easier for an office chair to roll around. I am not sure it would be a good long term item for hardwood floors or anything else that it was meant to protect the plastic is simply too soft.",
      "rating": 2.0,
      "verified": true,
      "author": "Ricky_Savage",
      "helpful_votes": 0,
      "publication_date": 20130204
    },
    {
      "title": "Is it the product? or is it the way they package it?",
      "text": "We received this large mat rolled into a 9x9x40 package. It was rolled tightly and rolled OPPOSITE to the way it must lie on the floor. We tried weighting it down and warming and weighting but found it impossible to get it to lie flat. It is not safe to use as both my husband and I have tripped on it. I'm guessing that the same product in the store would not be a problem, but I don't know that for a fact. I filed a package complaint with pictures.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie Longo",
      "helpful_votes": 0,
      "publication_date": 20130328
    },
    {
      "title": "Works Perfect Excellent Quality Low Price",
      "text": "Some people have complained saying its to thin, no this is perfect, it is made for hard floors, tiles, linoleum, wood to work perfect it has to be thin , for carpets, rugs you need the thicker ones, each one is made thin and thick for a purpose, my offices use these and they are excellent and the price is the best ,the size is tailored perfect and its a quality product unless you want to pay twice for no reason. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ricanguy007.",
      "helpful_votes": 0,
      "publication_date": 20130315
    },
    {
      "title": "It's cheap for a reason",
      "text": "This mat is not of the thickness you would normally get. It takes a long time for it to settle and not cup. The edges still stick up making it a constant tripping hazard. (probably less an issue for the deep carpet models) And the first mat delivered was for carpet when I ordered it for a wood floor. Thankfully Amazon, after some begging, sent me the right one and I didn't have to send back the wrong one. Still a hassle.",
      "rating": 2.0,
      "verified": true,
      "author": "Temkin",
      "helpful_votes": 0,
      "publication_date": 20130210
    },
    {
      "title": "Just received it. Folded. Not flat",
      "text": "I took a risk ordering it knowing some people commented that they received it in folded shape and could not use it. I just received mine. It is in a box and folded. I need the mat and it is still useful for me. But I am not sure I can make it flat ever. Because it is not flat on the floor, my concern is that someone may trip over it. I placed it in a corner area only. April 29 update : After 4 days of use and frequent pressed by weights, now the mat is almost perfectly flat. It works well. Increase to three stars.",
      "rating": 3.0,
      "verified": true,
      "author": "F. C.",
      "helpful_votes": 0,
      "publication_date": 20130425
    },
    {
      "title": "Curled up and smells funny.....",
      "text": "My mat arrived rolled up in a box, and it was very difficult to lay flat on my hardwood floor. It also has a weird chemical/plastic smell that I am hoping will dissipate over time. I covered the whole mat with heavy books over night, and it did help flatten it out for the most part, but it still wants to curl up along the edges. I'm very disappointed with this item and wish I had never bought it. It's a total waste of money. :(",
      "rating": 1.0,
      "verified": true,
      "author": "unikornz24",
      "helpful_votes": 0,
      "publication_date": 20130710
    },
    {
      "title": "Good Chair Mat",
      "text": "While there's nothing in particular that sets this chair mat apart from competing chair mats, this one does the job quite well and I picked it up at half of what I'd normally spend on a mat. It came rolled in a tube in a box, but after a few hours of being rolled out and having weight sitting on it, it flattened nicely. The only downside to this chair mat (and all chair mats I've ever used) on a hardwood floor is that it slides around sometimes when you're moving around on top of it.",
      "rating": 4.0,
      "verified": true,
      "author": "Edward Winkelman",
      "helpful_votes": 0,
      "publication_date": 20130205
    },
    {
      "title": "Product as it is, is dangerous!",
      "text": "I just received the mat and I noticed it slides all over my vinyl floor in my office. I will have to buy something to stick it in place and just hope that that works. I have always had the problem with these type mats, but this one is ridiculous, especially for someone with back problems. The mat should be made to stay in place instead of me buying something to stick it in place! Plus, what do I buy that is proven to work in this application?",
      "rating": 2.0,
      "verified": true,
      "author": "The Wood Farming Baker",
      "helpful_votes": 0,
      "publication_date": 20130724
    },
    {
      "title": "It took months for it to get flat.",
      "text": "It came in a package, and its rolled in it. I spread it out on the flour and put some books in the corners to recover flat, but one day, one week, one month, and now two months passed, it is still unflat at the corners.Sometimes it kick my feet because of it. A little bit annoying. But the mat itself has pretty good quality for sure, I bought another one at costco, that one is thicker but this one looks better than that one.",
      "rating": 3.0,
      "verified": true,
      "author": "fUNe",
      "helpful_votes": 0,
      "publication_date": 20140111
    },
    {
      "title": "flat, unobtrusive, protects floors.",
      "text": "I put this under the rolling chair at my desk in my home office. It works great. It took a little time to flatten, but it now behaves well. It did smell like plastic awfulness when it arrived, but the scent dissipated with 12 hours. It is very thin and unobtrusive. It has a very fine texture and is flat and smooth on the bottom. It works great over hardwood floors.",
      "rating": 4.0,
      "verified": true,
      "author": "AMC",
      "helpful_votes": 0,
      "publication_date": 20150113
    },
    {
      "title": "Smooth rolling, no complaints",
      "text": "I was concerned at first when the mat arrived as it was rolled up like a poster and didn't want to lay flat but after a couple nights of being forced flat with heavy books on top it didn't try to re-curl. I use it to cover a section of my floor by my desk that is slightly uneven field stone and my wheelie chair glides over it with no hangups. Definitely just for hard, practically flat floors as it'd be too thin to support much weight on its own if there was a big discrepancy in level, firmness of the ground beneath.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Michalak",
      "helpful_votes": 0,
      "publication_date": 20130307
    },
    {
      "title": "Works great",
      "text": "Does what it should. Arrived in a long rectangular box, so it was folded over on itself about 4 times.. I held it vertically with one hand against a wall and hit the bendy spots with a hair dryer on high heat for about 5 minutes and it flattened out pretty quickly. Stops the chair from rolling all over the place as it does on regular hardwood, but is still easy to roll around when I want it to. Can't beat it for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert B. Harris",
      "helpful_votes": 0,
      "publication_date": 20130612
    },
    {
      "title": "This has been great for underneath our computer chair",
      "text": "This has been great for underneath our computer chair. It came in a roll and I followed the instructions to flatten the product out. By the next day it was perfectly flat. The only issue I have with it is that it slides around on the hard wood floor. I ended up tucking the edge under the desk leg so that it wouldn't move around anymore.",
      "rating": 4.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 0,
      "publication_date": 20150412
    },
    {
      "title": "Nice to finally put those expensive textbooks to good use",
      "text": "Works as advertised and on a light colored hardwood floor its not noticable. Flattened out quickly after opening with help from some college text books in each corner. Nice to finally put those expensive textbooks to good use. THis size seems to be just big enough to fit under a small desk And still guard floor from major rolling area.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth V.",
      "helpful_votes": 0,
      "publication_date": 20150414
    },
    {
      "title": "Protector of hardwood floors",
      "text": "The chair mat arrived as expected and was in a roll in a box (this was expected even though the product was advertised to arrive flat). The roll had the top side on the inside so the edges were above the floor for about a week. It would be better if the roll had the top on the outside - so that the edged bend down. The mat is a good size for 1 chair and is working quite well.",
      "rating": 4.0,
      "verified": true,
      "author": "Moke",
      "helpful_votes": 0,
      "publication_date": 20130125
    },
    {
      "title": "Exactly what I needed",
      "text": "Nice, thick, clear mat, smooth on bottom side and pebbled on top. My chair moves smoothly on it, and it is very unobtrusive. I like the \"lip\" shape, which continues a little way under my desk--and the mat exactly fits the available floor space. I just wish I had gotten it before the linoleum had ripped through--no further tearing has occurred, though, which is a testament to the efficacy of the product.",
      "rating": 5.0,
      "verified": true,
      "author": "REReader",
      "helpful_votes": 0,
      "publication_date": 20120615
    },
    {
      "title": "It does the job well",
      "text": "It came folded or rolled in a small box. I had to lay it flat out in the patio floor exposed to the sun to get to smooth out the shape. I was skeptical at first if it would be able to protect my newly installed wood flooring from scratches from my rolling computer chair but to my surprise, it does the job well. I have no problem with it so far and I've been using it for more than a month now.",
      "rating": 3.0,
      "verified": true,
      "author": "Eagle Eyes",
      "helpful_votes": 0,
      "publication_date": 20130827
    },
    {
      "title": "Durable and great price",
      "text": "After buying one for my desk chair, I wanted another for our printer cart. Didn't need the full size but to buy a smaller version would have cost more! So bought another one of these so I could cut it down to size. We just installed the hardwood floors and I needed something to protect the foors while we re-positioned the refridgerator back in place. These worked perfect for that purpose as well, without a single scratch or indentation (to the floor or the mats).",
      "rating": 5.0,
      "verified": true,
      "author": "BSD",
      "helpful_votes": 0,
      "publication_date": 20120406
    },
    {
      "title": "Great Mat",
      "text": "This is a small mat for a small area, not as large as the normal size. Be sure to measure your area well before ordering. It works for me in a small space. I love it because it lets the beauty of my floor show thru instead of covering it. It has a smooth back for floors as opposed to the dimpled back needed for carpet. My chair moves freely on it. I recommend this brand of mat.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Norris",
      "helpful_votes": 2,
      "publication_date": 20120402
    },
    {
      "title": "Good value, and protects floor.",
      "text": "Yes, it comes rolled up and it takes a couple of days to get it to stay flat if you follow the instructions. My room is not at the 72 deg. recommended, but it still flattened enough (no trip hazards). I don't find that it moves on the wood floor as others have said. Also, the rough surface on the chair side is just right for rolling the chair on.",
      "rating": 4.0,
      "verified": true,
      "author": "astrofly",
      "helpful_votes": 0,
      "publication_date": 20150307
    },
    {
      "title": "Wavy mat.  Not flat.",
      "text": "I've been trying to get the waves out of this thing since I bought it. It does not sit flat. I even left it in the sun on a hot hot day to soften the plastic without result. The mat came folded up and still has waves in it. I'm using it on hard wood so it gets a bunch of dirt underneath due to the permanent waves. I do not recommend unless they can ship without bending the product.",
      "rating": 1.0,
      "verified": true,
      "author": "MV",
      "helpful_votes": 0,
      "publication_date": 20131109
    },
    {
      "title": "Won't stay in place",
      "text": "My biggest gripe with the floor mat is the fact that it does not have any way to keep the mat in place on the floor (whether on hardwood or carpet). When I roll my computer chair across the plastic, it tends to move the floor mat with it. The plastic is also very thin so don't expect it to hold up well under heavy use, especially on carpet.",
      "rating": 3.0,
      "verified": true,
      "author": "Jon Walker",
      "helpful_votes": 0,
      "publication_date": 20150218
    },
    {
      "title": "Protects our floors, I would buy this again",
      "text": "A lot of reviews said that they had trouble laying this flat but we had none at all. We pulled it out of the box, unrolled it and left it overnight (no books or anything holding it down) and by morning, it was 99% flat. It works fantastic and is doing a wonderful job at protecting our hardwood floors.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Pullan",
      "helpful_votes": 0,
      "publication_date": 20150624
    },
    {
      "title": "Inferior quality and utility.",
      "text": "The material is much thinner than the mats available in office supply stores. I should have know better as they were half the price as in the stores. The way this was shipped made the problem worse as when it was rolled up to be shipped the mat no longer lays flat. Because of that a chair can't roll over it, so it completely defeats the purpose for which I purchased it.",
      "rating": 1.0,
      "verified": true,
      "author": "Rosieannie0",
      "helpful_votes": 0,
      "publication_date": 20140513
    },
    {
      "title": "great for hardwood floor. but be careful lifting them back up",
      "text": "I love these mats. I bough them for my home office and help protecting the office room. Once you place them on the floor from the package, they will flatten themselves and do the job as intended. The only problem comes when you want to clean the room and lift these mats. You get static electricity in very good quantity, bu only when lifted. On the floor it's perfectly safe.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Mosquera",
      "helpful_votes": 0,
      "publication_date": 20130418
    },
    {
      "title": "Not the mat for me",
      "text": "Too small and flimsy to work with my chair and floor. It slid all over the place and frequently caused peaks to form under my chair making getting around very difficult. I had to send it back which I hated to do since I need a mat in my home office. I guess it's back to Office Depot to see what they offer.",
      "rating": 2.0,
      "verified": true,
      "author": "Rilee James",
      "helpful_votes": 0,
      "publication_date": 20150308
    },
    {
      "title": "lay it in the sun for a few hours and it will be flat!!",
      "text": "all these dummies complaining about the mat being hard to flatten out....have u tried laying in the sun for a few hours????? lol... product is as described, would buy again for wood floors. it does kind of slide around kind of easy if not too much weight on it but thats to be expected.",
      "rating": 5.0,
      "verified": true,
      "author": "GJMoran",
      "helpful_votes": 0,
      "publication_date": 20150524
    },
    {
      "title": "Would order a larger size next time",
      "text": "It was an impulse purchase. The material is good quality and works as advertised. The only downside for me is that it's not quite big enough. I'd prefer something 1.5 times as big as this, and would like to be able to trim the \"knee hole notch\" piece myself, as the pre-cut one is about 8 inches too narrow for my desk, leaving unprotected gaps at each side.",
      "rating": 3.0,
      "verified": true,
      "author": "Gregory T Reid",
      "helpful_votes": 0,
      "publication_date": 20130428
    },
    {
      "title": "Good price, quick shipping",
      "text": "5 stars for the price and convenience of having it delivered straight to my door. It's a bit more \"flexible\" than I thought it would be and I don't know how long it will last. I got another one from IKEA for about $10 less that has less bend and I will compare the 2 to see which lasts longer.",
      "rating": 5.0,
      "verified": true,
      "author": "Patty Lekas",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "Saves my laminate floor",
      "text": "Fits with standard desk (file drawers on both sides) just fine. It has a tendency to shift but overall definitely worth the investment. Without this, my laminate floor looked like it was sanded down due to my desk chair rolling over it as I work. I had to have the section replaced. This will prevent that from happening anymore. Happy with the product.",
      "rating": 4.0,
      "verified": true,
      "author": "MK",
      "helpful_votes": 0,
      "publication_date": 20130714
    },
    {
      "title": "Will not flatten",
      "text": "The product arrived in a fairly small box which required it to be rolled up for shipping. After a week of it laying on the carpet with weight on it, it still is not flat. Small curls around the edges are a safety hazard as it is easy to trip over them. The material of the mat seems OK given the price, but its inability to maintain a flat on the surface shape makes it a bad buy. Too bad they can't figure out the shipping.",
      "rating": 1.0,
      "verified": true,
      "author": "James M. Simmons",
      "helpful_votes": 0,
      "publication_date": 20130603
    },
    {
      "title": "Slippery and still not flat after 4 weeks",
      "text": "Like others have written, the packaging for this item is bad. When I received it, it was not rolled up, but folded inside the package, and after 4 weeks on the floor, it still is not flat, but looks like a wave. Edges are standing up and it's easy to trip over them. Also, the mat is slippery, moving around on laminate floor when I get up from my chair. The 48x36 with lip is too small to secure it under the desk. I'm returning it.",
      "rating": 2.0,
      "verified": true,
      "author": "Carsten C.",
      "helpful_votes": 0,
      "publication_date": 20130718
    },
    {
      "title": "Great item and good price",
      "text": "I obtained this a while ago and have been using it in my office. I read other people's comments and thought it would be difficult to get it straightened. However, I had no trouble at all. It was sent to me rolled up. After I unrolled it and left it sitting there for 30 min, it was flat. No trouble at all!",
      "rating": 5.0,
      "verified": true,
      "author": "Chad",
      "helpful_votes": 0,
      "publication_date": 20140321
    },
    {
      "title": "Good product once you get it unrolled lol.",
      "text": "We had the hardest time getting this mat unrolled and had to put stuff over it to keep it flattened, but after a couple days it straightened out. That is the only downside to it. Otherwise this product is great, just like what they offer at the office store in town and cheaper than them too. This is exactly what we were looking for, size and all!",
      "rating": 4.0,
      "verified": true,
      "author": "PCavs",
      "helpful_votes": 0,
      "publication_date": 20130402
    },
    {
      "title": "good at half the price",
      "text": "seems to be very good quality. compared them to the ones office dp. sells and they are just ass good but at a much lower price. shipping was in a box designed for the product so it was in great shape from the time we took it out and placed them under our two desks .. thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 0,
      "publication_date": 20150424
    },
    {
      "title": "Still smelly",
      "text": "This mat still smells awful. It has been in my house for about a month and I can still smell it when I walk in. It was sent rolled up so it took a while for it to flatten it out but I put it in the sunlight coming in through a window and that seemed to help speed up the process. Now that it is flat, it works fine, I am just hoping that it stops smelling pretty soon.",
      "rating": 3.0,
      "verified": true,
      "author": "Alyx",
      "helpful_votes": 0,
      "publication_date": 20150226
    },
    {
      "title": "Does The Job",
      "text": "You can't wax too rhapsodic over a floor protector. It comes rolled up, so there is the minor challenge of uncurling it. But once in place it does just what it supposed to. Now my sweetie won't wear out the wooden floor rolling her computer chair around while she types.",
      "rating": 4.0,
      "verified": true,
      "author": "Quailrancher",
      "helpful_votes": 0,
      "publication_date": 20150420
    },
    {
      "title": "Working out great",
      "text": "Have tile floors in my home, and working from home wanted something so my chair didn't roll and cause problems with my flor, this was the perfect item. Only thing I had to do, due to the tile, was put some non-skid under it so it didn't slide on the floors, but that's ok, it's still working like a charm a year later.",
      "rating": 5.0,
      "verified": true,
      "author": "Katz",
      "helpful_votes": 2,
      "publication_date": 20130119
    },
    {
      "title": "Works good",
      "text": "It works good, except when they shipped it, they rolled it up. I had to lay it out in the very hot sun this summer to get it to flatten. It also traps water underneath the mat. I don't know if it's just my floor that sweats or it's like that for everyone. The mat itself does a fine job.",
      "rating": 4.0,
      "verified": true,
      "author": "Robbie R",
      "helpful_votes": 0,
      "publication_date": 20131226
    },
    {
      "title": "This was awful and both of the mats I ordered were like that.",
      "text": "This mat was shipped as a roll and came out of the box as a roll. I had to fight with it to keep it laying somewhat flat so I could put my elliptical on it to weigh it and down try to flatten it out. Let me emphasize that once it is rolled, it wants to stay in its roll. This was awful and both of the mats I ordered were like that.",
      "rating": 3.0,
      "verified": true,
      "author": "Allthings, reviews.",
      "helpful_votes": 0,
      "publication_date": 20141225
    },
    {
      "title": "in perfect condition. Already on the floor and chairs have ...",
      "text": "Just got out mats on Thursday was worried that they would be rolled up. No came flat, in perfect condition. Already on the floor and chairs have been running back and forth. Very happy, love that they're clear so you still can see the floor.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Rajeski",
      "helpful_votes": 0,
      "publication_date": 20160122
    },
    {
      "title": "Perfect for rolling chair floor protection",
      "text": "We've ordered these mats in multiple sizes to use under our rolling chairs in our newly remodelled basement. The chairs were starting to mark-up the epoxy floor, and these mats are perfect. They're so see-through too so we can enjoy our new floor's color.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori MTop Contributor: Quilting",
      "helpful_votes": 0,
      "publication_date": 20150628
    },
    {
      "title": "arrived rolled up",
      "text": "Seems like good mat, but unlike other reviewers' comments, my mat came rolled up. The instructions say to let it warm up, roll it out, weight it down and wait 3 days for it to flatten. I was hoping to actually use the mat, rather than do a bunch of work on it.",
      "rating": 2.0,
      "verified": true,
      "author": "DDC",
      "helpful_votes": 0,
      "publication_date": 20150224
    },
    {
      "title": "Dont waste your money",
      "text": "It curls up wont lay flat. You can trip over it. It also slides on the floor.It's a hazard I threw it away Sorry but the truth is the truth",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "Traveling Mat",
      "text": "I purchased this to put on a high quality vinyl floor at my desk with a chair with casters. Unfortunately the mat travels to the left and every day I have to straighten it. It is supposed to be for hard surfaces so I would think that it would be designed NOT to travel.",
      "rating": 4.0,
      "verified": true,
      "author": "Bev in Arkansas",
      "helpful_votes": 0,
      "publication_date": 20150202
    },
    {
      "title": "does not lay flat",
      "text": "The mat arrived rolled up in a large cardboard box. When removed from the box and placed on the floor, it never completely flattened out. I gave it two weeks to see if it would lay flat, but the waves in the mat never went away. They did not even get smaller. It was a tripping hazard. I returned it for this reason.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130915
    },
    {
      "title": "Slides around on hard floor",
      "text": "The mat came packaged flat and the size is nice, but it slides all over on my floor. The first time I stepped on it is slid out from underneath me and I almost fell. I've tucked the front of it under the front legs of my desk and it holds it in place nicely but I don't feel like I should have to do this.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazombie",
      "helpful_votes": 0,
      "publication_date": 20140206
    },
    {
      "title": "cannot make it flat.",
      "text": "I've got this product from amazon couple weeks ago. It came rolled in a tube and for 2 weeks no matter what I do I cannot make it flat on the floor. I already tried heating it up, leaving it compressed under heavy carpet, bending it in different direction. I also have to note that the mat is pretty small and does not have much space to move the chair. Overall: the attempt of saving $25 vs. similar product at Staples went horribly wrong.",
      "rating": 1.0,
      "verified": true,
      "author": "Alex Perematko",
      "helpful_votes": 0,
      "publication_date": 20130928
    },
    {
      "title": "Great for protecting my Hardwood floor",
      "text": "I rent a room in my house. The room has hardwood floors, a desk and office chair with wheels are in it, along with bed, etc. Needed something to protect the floor from the chair being sat and rolled back and forth in, so far this is working well! But is is light weight and I had doubts about it when first arrived. I have another one that is much thicker and works great but is very heavy!",
      "rating": 4.0,
      "verified": true,
      "author": "sunshine",
      "helpful_votes": 0,
      "publication_date": 20131031
    },
    {
      "title": "Fantastic",
      "text": "Ours didn't have the rolling problem that people described. It didn't smell weird like plastic. It rolled right out, and immediately protected our wood floors from a rolling chair. Perfect size for a normal workspace area. Wish we'd bought it sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Oakland Citizen",
      "helpful_votes": 0,
      "publication_date": 20150309
    },
    {
      "title": "Good for Hardwood Floors",
      "text": "A bit smaller than expected but that's more my fault for not confirming measurements. Works for intended use. Would have given 5 stars if it had shipped flat. It did come rolled. Followed the instructions to flatten. Actually took about a week with heavy items placed on corners and in center. Now it's fine. If climate is cold...do not attempt to flatten until it reaches room temperature.",
      "rating": 4.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20150318
    },
    {
      "title": "Keeps Floor Safe",
      "text": "This floor mat is perfectly adequate for the job. It fits under my desk and protects my wood floors. Unlike many other reviewers, I did not notice any kind of smell. It arrived in a large box rolled up and it unrolled easily. I weighed down the corners for a few hours, and they no longer roll up.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne C",
      "helpful_votes": 0,
      "publication_date": 20130124
    },
    {
      "title": "Cheap material and careless packaging",
      "text": "I bought three of these. The material is thin like a tin can and what make it worst is the packaging. Instead of should have been rolled it in a box, the mat was folded. Thus it curls up no matter what side I put it down. Since the material is thin, the curl is permanent. I just hate it. Do not buy.",
      "rating": 1.0,
      "verified": true,
      "author": "HonestOpinionOnly",
      "helpful_votes": 0,
      "publication_date": 20130423
    },
    {
      "title": "okay product",
      "text": "I think that it is helpful to have in my home office, however the one downside is that the bottom of the mat doesn't have anything on it to keep it from sliding on the floor. My carpet is not real thick, so every day I find myself having to move my chair to reposition the mat where I want it",
      "rating": 3.0,
      "verified": true,
      "author": "John K",
      "helpful_votes": 0,
      "publication_date": 20131013
    },
    {
      "title": "Pay Attention to Description",
      "text": "Mat was smaller than I expected. My own fault though, I should have noted the measurements on the description. Also, and again my own fault, I thought it would be good on carpet but it was not. No grip so mat kept sliding everywhere. So basically, the description is accurate so pay attention to it and that way you will know what you are getting.",
      "rating": 3.0,
      "verified": true,
      "author": "Rafmann",
      "helpful_votes": 0,
      "publication_date": 20150419
    },
    {
      "title": "Bought wrong mat so I'm stuck with it because soon ...",
      "text": "Bought wrong mat so I'm stuck with it because soon after buying mat we had to put down carpet....and it didn't work very well on the rug as it was made for hardwood floor and not rugs...Kept sliding all over the place so I had to roll it up and put it away.....",
      "rating": 3.0,
      "verified": true,
      "author": "S. Baker",
      "helpful_votes": 0,
      "publication_date": 20150812
    },
    {
      "title": "The roll is not good, but price is right",
      "text": "Arrived rolled as explained in description. BUt it does not like to lay flat. That part frustrates me, and is unusable.....but may flatten out if gravity does its job. I think heat might help, but I am in the basement where it is cooler.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150308
    },
    {
      "title": "Get ready to fall on your arse.",
      "text": "This thing is awful. It is definitely not made for wood, tile, linoleum as it slides around like crazy. There is no \"lip\" on it like the description says. I fell really hard by walking on this thing.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa K",
      "helpful_votes": 6,
      "publication_date": 20130711
    },
    {
      "title": "Don't buy in winter, you need heat to get it flat!",
      "text": "Old reviews say that it is delivered flat. They gave up on it and newer reviews say that it comes rolled, they gave up on that too. Now the just stuff it into the box, see attached photos. But after two days in the sun with a little weight on it it flattens out. I use it on laminate and it is very slick and slides around when you step on it the wrong way, which can even be dangerous.",
      "rating": 2.0,
      "verified": true,
      "author": "Stefan D.",
      "helpful_votes": 0,
      "publication_date": 20130805
    },
    {
      "title": "Perfect Mat for My Hardwood Floor",
      "text": "Caught this mat on one of its occasional price drops on Amazon and got a great deal, as compared to most of the mats that are out there. Took awhile to flatten out perfectly, but now it is working great.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Mitchell",
      "helpful_votes": 0,
      "publication_date": 20150214
    },
    {
      "title": "New hardwood floors",
      "text": "I recently replaced carpeting with hardwood floors. When I went to put the old office floor mats back down, I realized the mats had the \"spikes\" for carpeting, so uh-oh! Found these on Amazon: Great price that none of the locals could beat and delivered by Amazon in 48 hours. Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Sfarrow56",
      "helpful_votes": 0,
      "publication_date": 20130627
    },
    {
      "title": "Doesn't lay flat.",
      "text": "The mat came rolled up and instructions say to put in warm place to soften, then lay flat and put heavy objects on it. I did that, and the large wrinkles are still there. Otherwise the mat is the correct size and it is protecting my wood floor.",
      "rating": 3.0,
      "verified": true,
      "author": "Charlotte McGaughey",
      "helpful_votes": 0,
      "publication_date": 20150309
    },
    {
      "title": "Good Flooring Protection",
      "text": "The mat itself is perfect for hardwood floors, however it is prone to slipping. If you're trying to avoid damaging the floor beneath it, coming up with a solution to stop it from slipping is difficult and often makes the mat uneven.",
      "rating": 4.0,
      "verified": true,
      "author": "Joseph Martin",
      "helpful_votes": 0,
      "publication_date": 20150501
    },
    {
      "title": "Works great. It's really flat and hard",
      "text": "The product came flat in a big slim box. Using it to protect my new hardwood floor. Works great. It's really flat and hard. It's also very thin. Rolling the chair on this is not a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "V. Bhadra",
      "helpful_votes": 0,
      "publication_date": 20160131
    },
    {
      "title": "Great buy for < $20 (Jan 2015)",
      "text": "This is a very good floor mat. Read the directions that come with it. Let it come up to room temperature before you try and unroll it. It could be a little larger, but it works. And for $20 in Jan 2015 it's a great deal. (I wouldn't pay more than $37 for it).",
      "rating": 5.0,
      "verified": true,
      "author": "inayat2012 on youtube",
      "helpful_votes": 0,
      "publication_date": 20150126
    },
    {
      "title": "Great Mat",
      "text": "I was having problems with my computer chair peeling my floor up(linoleum) so I purchased this mat and the problem is solved. It took a little while for it to lose it's bends from being shipped in a thin box, but now it's looking great. It's very easy to clean and move as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Morbius858",
      "helpful_votes": 0,
      "publication_date": 20130728
    },
    {
      "title": "Bleh",
      "text": "I wanted to love this. I really did. I contacted Amazon after the first shipment and re-ordered but it STILL came all folded up in a small box. Totally useless packaging. I read a lot of the reviews before I ordered this and the people who had it shipped flat are the lucky ones, otherwise it's a waste.",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda Dee",
      "helpful_votes": 0,
      "publication_date": 20130706
    },
    {
      "title": "rollin', rollin', rollin'",
      "text": "It came rolled up in a box. It has been a b%tch getting the thing to lie flat. Even with a hair dryer, it still wants to stay rolled. Otherwise, it is functional. Using it under my easy chair to protect my hardwood floor.",
      "rating": 3.0,
      "verified": true,
      "author": "Marcia A.",
      "helpful_votes": 0,
      "publication_date": 20150228
    },
    {
      "title": "Very Nice Matt, but supplier needs to improve their packaging",
      "text": "The Mat does exactly what its supposed to do. It does slide around a little on wood floors but that is not as much of an upsetting issue to me as the fact that the product ships in-between two thin corrugated pieces of cardboard. When it arrived 2/4 sides were completely open and it was exposed to all of the elements from the Amazon FC to my house. Needless to say it was dirty and god knows how many times it popped out of the \"box.\" Manufacturer needs a better shipable box.",
      "rating": 3.0,
      "verified": true,
      "author": "the guru",
      "helpful_votes": 35,
      "publication_date": 20111229
    },
    {
      "title": "Not quite clear see through",
      "text": "I'm very glad I made this purchase. The mat was relatively easy to unroll & unflatten & now serves as a perfect guard for my wood floor, while still allowing a slightly occluded view of the wood grain through the mat.",
      "rating": 5.0,
      "verified": true,
      "author": "SEE",
      "helpful_votes": 0,
      "publication_date": 20150507
    },
    {
      "title": "they ruined the item",
      "text": "this is the second time i order this item. the first time it arrived in a flat box and i am still using it. this time they folded the mat few times in order to force-fit it into a box that is not designed for this item. the mat was totally ruined and i did not accept delivery of it and sent it back for replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130626
    },
    {
      "title": "To small and too flimsy",
      "text": "I purchased this to replace an older one that cracked but its way too small for a typical desk/chair opening and is extremely thin & flimsy. I will be replacing it. Spend the money buy a bigger one and heaver one. This might be okay for a small child's desk but that's about it.",
      "rating": 3.0,
      "verified": true,
      "author": "History Buff",
      "helpful_votes": 0,
      "publication_date": 20131016
    }
  ],
  "product_meta": {
    "title": "Floortex Cleartex AdvantageMat PVC Chair Mat for Hard Floors/Carpet Tiles, 48\" x 36\", Rectangular with Lip, Clear (129020LV), Model:FR129020LV",
    "description": "Floortex Advantage mats is the brand Name for transparent, clear chair mats and general floor protection mats. Affordable, long-lasting protection for home or office. Our phthalate-free range provides PVC mats that are even safer to use, while protecting hard floors from wear and tear. 100% free of the materials that have been banned from children's toys and medical instruments, Phthalate free chair mats adhere to the Floortex standard for durability and product lifespan. The mats are versatile, easy to move and clean, making them perfect for a wide variety of uses. They are ideal for all areas of the office and home. A wide range of shapes provides floor saving solutions for desk areas, reception areas, high foot traffic hallways, waste bin areas and a great deal more. Pvc mats are the clearest vinyl mats on the market, offering higher quality, less odor and higher UV protection than other vinyl mats. Combined with the mat's durability and appearance, these mats offer a flexible and long-lasting floor protection solution. Floortex products are designed to perfectly preserve the condition of every surface we cover. At home or at work, Floortex protects like no other. 48 x 36\"",
    "rating": 3.9,
    "feature_bullets": [
      "Suitable for a wide range of applications: chair mat, Computer mat, floor protector",
      "The \"lip\" extends beyond the Main Rectangular area of the mat to protect the floor under the desk",
      "Unique Floortex PVC formulation for a clearer, more durable PVC mat",
      "Smooth back for hard floors with textured top for ease of chair movement; suitable for Wood, Tile, linoleum or vinyl",
      "Mat size may vary slightly due to manufacturing process"
    ],
    "specifications": {
      "Manufacturer": "Floortex USA LLC.",
      "Brand": "Floortex",
      "Item Weight": "4.7 pounds",
      "Product Dimensions": "38 x 7.4 x 7.4 inches",
      "Item model number": "FR129020LV",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Clear",
      "Corner/Edge Style": "Straight",
      "Material Type": "PVC",
      "Number of Items": "1",
      "Size": "36\" x 48\" - with Lip",
      "Manufacturer Part Number": "FR129020LV",
      "ASIN": "B003XR7CDU",
      "Customer Reviews": "3.9 out of 5 stars579 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#122,103 in Office Products",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "June 1, 2010"
    },
    "categories": [
      "Office Products",
      "Office Furniture & Lighting",
      "Furniture Accessories",
      "Hard-Floor Chair Mats",
      "Chair Mats"
    ],
    "price": 36.1
  }
}