{
  "website_summaries": [
    {
      "verdict": "Earns first place for its secure fit and dual locking mechanism. Somewhat tricky to install, but well worth the added peace of mind.",
      "pros": [
        "Heavy-duty steel construction resists pushing, shoving, and leaning",
        "Extendable size",
        "Multidirectional door can be set to swing inward, outward, or both",
        "Optional pressure or hardware mounting",
        "Double locking mechanism is easy enough for adults to open, but effectively deters even the most experienced escape artists"
      ],
      "cons": [
        "Installation instructions are difficult to follow",
        "Extenders can compromise stability"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great product. Meets our needs!",
      "text": "Used at the top of my stairs. Also bought 24\" zip ties and put the ties in plastic tubing around my banisters for extra security. The zip ties I bought on Amazon are industrial strength. The standard banister kits are soooo expensive. Works perfectly with 2 two year olds and 2 large dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "J. B.",
      "helpful_votes": 141,
      "publication_date": 20160726
    },
    {
      "title": "Durable!",
      "text": "I have 3 boys, 3 dogs, and a pet pig. I’ve been through A LOT of baby/pet gates. This one is by far my favorite and the most durable. I own two of them! We have a fairly open floor plan so the fact that this gate can fit just over a 51” wide space right out of the box is even better! It’s fairly easy to assemble and goes up even easier. You can lock it shut at the bottom or latch it so the gate only swings open one direction.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren J.",
      "helpful_votes": 28,
      "publication_date": 20190314
    },
    {
      "title": "Not made well- don’t get for real kids",
      "text": "This product was used for an open doorway to keep the baby out. It took a few hours and two of us to install but we figured well worth it... NOT SO. The clasp broke after my 9 year old closed it and it would no longer lock. I contacted the manufacturer and they asked for photos which I sent them immediately. That was not sufficient and they asked that I dismantle, find a box and return it (they did send a label). Not even guaranteed they will send a new one until they see the damage. I guess that’s the risk of online shopping but now I know this company doesn’t produce sturdy CHILDPROOF items.",
      "rating": 1.0,
      "verified": true,
      "author": "Paula A.",
      "helpful_votes": 6,
      "publication_date": 20191005
    },
    {
      "title": "Best Gate Ever!",
      "text": "I absoultely love this gate! Its sturdy! Easy to put together. Difficult for kids to figure out. AND it has a lock system at the bottom (on both sides). You can control which way the gate opens! My 3 year old is 62lbs (the size of a 7 year old - muscle, not fat, he's a hoss) and this gate will withstand his weight, without budging. I especially love it, considering you dont have to put holes in the wall. Its a little heftier of a price tag, than a lot of other gates out there, but you get what you pay for and I would pay the price over and over again!",
      "rating": 5.0,
      "verified": true,
      "author": "Honestly Confused (dotcom)",
      "helpful_votes": 7,
      "publication_date": 20170710
    },
    {
      "title": "Defective and instructions are a joke!",
      "text": "I tried putting this together to fit a 48” doorway. Got close even though I know a part is missing but then saw that the gate was crooked and would not even close. This is junk in my opinion.",
      "rating": 1.0,
      "verified": true,
      "author": "sunshine23111",
      "helpful_votes": 9,
      "publication_date": 20181024
    },
    {
      "title": "One significant flaw, but still one of the best gates.",
      "text": "Pros/cons : This gate is pressure mount, which should be the easiest type of gate to install. Munchkin made the easiest gate as hard as possible. You need a wrench to fit it and I’d highly recommend a ratchet type since you will need lots of turns to get it tight. . Most these types of gates had a easy turn dial which does not need tools; just why 🤷‍♀️ I’d still get this gate every time since the opening is wide enough that you don’t need to slip through till you lose that baby weight (13 years and counting 😂). And you can purchase after market turners to make life easier.",
      "rating": 3.0,
      "verified": true,
      "author": "prime user",
      "helpful_votes": 3,
      "publication_date": 20181206
    },
    {
      "title": "Could use improvement",
      "text": "This gate worked perfectly for a few weeks... then the part that makes the latch close got stuck. You have to smack the top of the gate to make it pop back out again. When I’m in a hurry leaving the kitchen through the gate, I want it to close behind me. I don’t want to have to turn around and smack it to make sure it closes 🙄 But overall, I still do like the gate because it is wide enough for my abnormally wide kitchen doorway and tall enough to keep my climbing toddler out. The video I attached showed how it gets stuck and how I have to smack it to get it to work lol",
      "rating": 4.0,
      "verified": true,
      "author": "Angelica",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Best Pet Gate",
      "text": "This is why this is a superior pet gate: 1) It is not made of wood. I had a fashionable wooden date that my dogs eventually chewed on and ruined it. 2) This gate does not have a spring hinge on it. That is actually a pain at times when you need it to remain open. 3) It is higher than a normal \"dog\" gate. 4). The operation to open it is very simple, close it behind you and it latches. 5) This creates a simple buffer between the house and the garage door where dogs are usually right the door ready to run out! Definitely recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Well Conceived, Well Made, a Good Product.",
      "text": "I’ve got to say, and wholeheartedly, this gate has proven to be a completely great find and value. I bought it for my nephew who has two kids under five, and three large dogs. This gate in the doorway of his front door has allowed for keeping that door open to the front porch and yard where there is a good amount of social interaction and play. It is secure, easy to open and close, strong, easily adjustable and removable. Love it. The kids can watch the rain, their daddy barbecuing etc. when they need to remain indoors. Now I need to find the equivalent for the much wider dining room to living room arch/doorway.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark R",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Nice gate",
      "text": "Really well built, easy to install gate. I have several here herding two vey inventive small cockapoos. I have always ordered the bronze as it matches in home interior very well. This particular gate is for a sheltered area of a deck. The handrails on the deck are a jet black flat paint. This \"black\" gate is actually a charcoal black with a definite dark grey tone. Not happy but is ok. Sorta sticks out. I will eventually align my A retentive OCD with the shade. Great gate you won't be disappointed with the build or function. A great deal too with the 30% off sale price.",
      "rating": 5.0,
      "verified": true,
      "author": "1",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Good quality, terrible shipping",
      "text": "This box was shipped in terrible condition and a piece of the set up was broken and another piece missing. I had to improvise to make it fit. I won't be ordering from this seller again. The outer shipping box had massive dark shoe prints all over it, and the inner product box had already been torn open. It was clear that this was a used product. I was disappointed. The quality of of gate itself is high, and if I had received a new, in tact version, I'm sure it would have been a 5 star review. My 11lb Chihuaua mix cannot get through 👍🏾",
      "rating": 3.0,
      "verified": true,
      "author": "AnonymousCJ",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Sturdy and durable product",
      "text": "So glad I bought this product. I bought it for my dogs. So far it has withstood all of the chewing without any dents. Still looks like new. Once installed correctly it is very sturdy and the latch works extremely well. The latch is well-designed and easy to work with it's snapshut closure. would highly recommend this product if you're looking for something sturdy and durable. Love the fact that it's much higher than the normal safety gate. Can be a bit tricky to install depending on your door frame the size of your doorway and the location of your door handle or lock. Sometimes the gate can get in the way of the door handle or the lock.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Perfect!",
      "text": "I'm so happy with this purchase!! The height and weight of it are perfect! I purchased as a way to keep puppies in a certain area when they come in from the outside through our dog door. The stay on the tile and dry off before coming onto the hardwood! It's works great! easy to open/close. It's a good looking gate! The ONLY negative would be that I wish the gate would actually swing out (or in) a little further so when not in use it's not in the way and doesn't stick out.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl M.",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Trash.",
      "text": "Received the first unit and when I tried to install it it turns out that it was stripped and wouldn't tighten against the wall. Got a replacement and it was the same problem. This thing is complete garbage. Don't buy it.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim Fletcher",
      "helpful_votes": 5,
      "publication_date": 20181119
    },
    {
      "title": "Perfect for kids!",
      "text": "I love this gate, we got it to keep the kids out of the kitchen while we cooked. It has a latch on the bottom that it like a double lock for kids who can open the top part. There is a gap in it when it arrives, don’t panic. It’s suppose to be there. They send a note on that as well. I don’t know if it’s good on stairs as I don’t have stairs in my home. However, it does open both ways and thanks to the bottom latch you can make it to where it only opens one way for stairs.",
      "rating": 5.0,
      "verified": true,
      "author": "roy girrard",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "I really wanted to love it..",
      "text": "I really wanted to love this gate, but unfortunately even though my measurements are correct, this gate doesn’t fit due to the base board not being flat and my kitchen cabinet not having a flat front..? However I can describe it. I’m disappointed, now I spent money on a gate I really needed in my kitchen and will keep just as a back up for my hallway. But I’m thinking about that too...",
      "rating": 3.0,
      "verified": true,
      "author": "Benda183",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Not worth the hassle",
      "text": "The color is nice and it feels sturdy but the gate arrives in about 15 pieces, and you need your own supplies including a measuring tape to double check the length of the pieces they give you. I had to remove certain rubber slots with a screwdriver (per their instructions) and nearly snapped the screwdriver in half, the slot never moved. The instructions are confusing as well.",
      "rating": 1.0,
      "verified": true,
      "author": "Sophie Jacqueline",
      "helpful_votes": 3,
      "publication_date": 20190520
    },
    {
      "title": "Good quality",
      "text": "Overall, I really like this gate. It is heavy and good quality material. It didn’t get a perfect score because it’s not a true black, rather a dark gun metal gray, which doesn’t match my banisters. Also plastic plug was almost impossible to pull out when adding the extension. Otherwise, it’s up and it works great and was very simple to install. Gate open and close latch could be more durable but with careful use, it could last a while.",
      "rating": 4.0,
      "verified": true,
      "author": "Quyen Dinh",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Easily covers a wide opening.",
      "text": "The entrance to our stairs is pretty wide. This gate covers the entrance and we still have one extender piece left that we didn’t need. Perfect for keeping our toddler from going up the stairs. The gate is tall and sturdy. We have a different brand of gate at the top of the stairs that has a latch feature for securing. We usually need both hands to open & close that one. However, this gate is easy to open/close with one hand which is perfect when carrying a toddler.",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Don’t buy if you plan on going near the maximin span the company says it will go.",
      "text": "I knew better than to ignore the negative reviews. I needed to get this gate installed for an immediate need. The span of 51.6” is a joke. DO NOT believe it. The gate was missing two essential pieces. I read in other reviews that they had to try to fit two plastic pieces together to add an extension but was like fitting a round peg in a square hole. The same happened to me. This would likely work fine for a smaller opening, but once you get to three extensions it really is a piece of junk. Shame on your company for selling this for a span it really shouldn’t be used.",
      "rating": 1.0,
      "verified": true,
      "author": "Clark Searles",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Keeps the pups from escaping the patio.",
      "text": "Bought for apartment patio to keep dogs from escaping. Looks great, like part of the original patio railing. Plus it seems it will hold up nicely outside in the elements. Much better than the flimsy wood and wire accordion gates used by the neighbors! For some reason, though, we keep having to tighten the sides, as the gate gets loose and won’t latch.",
      "rating": 4.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 2,
      "publication_date": 20181130
    },
    {
      "title": "Absolutely Horrible Gate!",
      "text": "This gate does not work as advertised for stairs unless you have wood to attach to on both sides, then it may work but I'm not even sure about that. I thought there was a clear lack of thinking that went into the design. The package arrived and it was obvious that the box had been opened but, we decided to give it a try anyway. We should have recognized that someone else obviously attempted (to give it a try) based on the box. Bad idea, lots of wasted time and frustration not to mention after all the effort, there were parts missing.",
      "rating": 1.0,
      "verified": true,
      "author": "susan",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Be prepared to get angry installing this",
      "text": "Great and classy looking gate, I use it at the top of my deck stairs to keep my dog on the porch (he digs, so no being in the yard alone for now). He can't jump it and it opens and closes easily. Whoever wrote the instructions really did a terrible job. I did read the reviews saying that, but figured I could figure it out. 6 HOURS. Mind you, we were having cocktails, but that only started after the first hour of frustration.",
      "rating": 4.0,
      "verified": true,
      "author": "FluffyEskimo",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Easy to install, very secure",
      "text": "The Munchkin Easy Close XL baby gate protects children and dogs from accessing your stairs. Easy assembly. Installation was a little extra effort due to my handrail and trim positioning, but overall very straight forward. Tall design and vertical slats prevent climbing over. Very stable gate. The locking mechanism automatically locks the gate when closing. Can be set to swing open in either direction.",
      "rating": 5.0,
      "verified": true,
      "author": "KK",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Stay away from Used even if it has a \"good condition\"",
      "text": "I'm sure the gate is just fine. I was actually pretty excited cause it looks to be made well. But if you order it \"used\" an it say good condition. It's most likely missing parts an bent. I was missing half the gate to make it functional. An the door was bent so bad I couldn't close it at all. I don't mind blemishes or imperfection but I couldn't use it it without the few pieces that where missing unfortunately.",
      "rating": 1.0,
      "verified": true,
      "author": "Candy Huffine",
      "helpful_votes": 4,
      "publication_date": 20190423
    },
    {
      "title": "Gate Update 1.5 years later",
      "text": "Bought this for my daughter. She has three large dogs. and it works well. The only concern I had with the product is the plastic connectors. With the dogs jumping up o the gate I was afraid they would break the plastic joints. I bought a 3 foot piece of 1/2 angle aluminum and attached to the bottom of the unit with some nylon fasteners and that really beefed it up. UPDATE: This is one GREAT gate. My daughters three dogs one being just under 100lbs jumps up on the gate and it still functions as the day I installed it. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Tropiks7",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Awesome option",
      "text": "This is my second of these gates. The first I got last year to keep my Rottweiler out of the kitchen. The second was acquired to keep the Rottweiler out of the hallway this summer as the house is opened up. When we realized that we were going to need a new gate, we decided to purchase a tried and true option. My now 4 year old has had no problem operating the gate since she was 3, so it won’t keep most toddlers out. She cannot, however, climb over it (which she was doing with the old gate).",
      "rating": 5.0,
      "verified": true,
      "author": "Rabidus Matris",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "... REALLY need to watch the YouTube video titled \"Munchkin Easy Choice XL Metal Baby gate\" for installation",
      "text": "You REALLY need to watch the YouTube video titled \"Munchkin Easy Choice XL Metal Baby gate\" for installation. The gate does NOT close until it is assembles between the doorway. Took us a bit to figure that part out. The package states as wide as 51.6\"...this is not the case. It is wobbly at maximum width. We will most likely return. This is more stable at 44\" and below.",
      "rating": 3.0,
      "verified": true,
      "author": "Kevin Powell",
      "helpful_votes": 2,
      "publication_date": 20180802
    },
    {
      "title": "Great Gate",
      "text": "This gate, extra tall and wide is just what I was wanting. Picture type instructions aren't the best, but, once you realize how it all goes together it's a snap. I love the height, meaning I don't have to bend over at all to open. The easy close and being able to open the gate either direction is what has me sold. Installed it is rock solid and couldn't be easier to open and close. Maybe a little pricey, but, in my opinion worth every penny. I don't think anyone could be dissatisfied with this gate. We use it in the hallway to keep our cockapoo dog from getting into the bathroom and bedrooms.",
      "rating": 5.0,
      "verified": true,
      "author": "LoKo126",
      "helpful_votes": 0,
      "publication_date": 20161208
    },
    {
      "title": "Great height and latch is high quality",
      "text": "Great height and latch is high quality. I have it at it's maximum length and it's pretty wobbly. My kids and dog jump against it or pull on it and while it doesn't actually fall over, it wiggles back and forth a bit. It's not super sturdy, but is holding up just fine after a few months of use and don't see it breaking down at all before we are done with it (I expect to use it for about a year or so before the dogs are trained well enough to not need it anymore). Color is great and blends with my décor nicely. Would purchase again.",
      "rating": 3.0,
      "verified": true,
      "author": "jcorn427",
      "helpful_votes": 0,
      "publication_date": 20170202
    },
    {
      "title": "Excellent Baby Pug gate!!!",
      "text": "READ the INSTRUCTIONS!! LOVE the EXTRA TALL GATE!!! Pretty straightforward assembly. Love the width options included in kit. Enabled us to adapt to double French doors and an archway without a hiccup. Opens and closes easily and is visually appealing. As far as first impression, it's a little wobbly until the bottom screws are tightened into doorjamb. I did one with wood screws (open arch) and one without. Makes a great towel rack in dressing room as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Danette Young",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Perfect Gate",
      "text": "This gate originally arrived with a busted box and broken connector. We returned it easily and a new one arrived a couple of days later. Installation was fairly easy once I figured out the combination of pieces needed. I opted to not mount it with screwed-in brackets, rather just tightened it into the space. We have a large puppy bumping it, and people passing through it regularly. It's hasn't budged. The color, height, width of opening and easy of use are AMAZING! Definitely worth every cent. I'm planning to buy 2 more for other areas of the house where we still have portable gates.",
      "rating": 5.0,
      "verified": true,
      "author": "TiffanyM31",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Great gate, easy to install, sturdy and wide enough for our stairs. (We use to keep pets out)",
      "text": "I spent forever trying to find a gate that would fit the width of our stairs without spending $300. This gate is tall and wide enough. It is study and stands up to the 11 and 15 year old running into it occasionally. I bought the bannister mounting kit to allow it to connect to the bannister side(had to also use a threaded rod from Home Depot to fix the issue with the stair difference), works great. Easy to open, easy to close and stays put.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Verry happy, nice sturdy gate with the largest opening I have seen.",
      "text": "Very nice gate. I use this for my dogs to keep them away from the front door. I have a few small dogs and an 80lb Black Mouth Cur she would often knock the gate over that I bought from the pet store. Does take a while to build the instructions could be better. Large opening can walk through with groceries or trash without problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Awful to install",
      "text": "This gate looks great and is very tall, but sweet baby Jesus, it was a pain to install! I had to add and remove the extra panels several times because the instructions aren’t right. One of the pieces was impossible to remove and I ended up cutting my hand pretty badly trying to get it out. This was a couple of months ago, and I think I’m going to have a scar forever from this thing.",
      "rating": 3.0,
      "verified": true,
      "author": "E.C.A.",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "... stars only because the instructions for assembly are absolutely horrible and the \"tools\" they give you to assemble it ...",
      "text": "Giving it 4 stars only because the instructions for assembly are absolutely horrible and the \"tools\" they give you to assemble it are a joke. However, if you have a brain and are good at puzzles (or some kind of engineer that builds crap) then you'll have no problem! It took me about 45 minutes to put this thing together. I'm a woman above average mechanical skills if that helps you at all. Construction and assembly is not my specialty, but I managed and the thing works and stays put for my dogs. It looks nice enough and is fairly sturdy.",
      "rating": 4.0,
      "verified": true,
      "author": "KW",
      "helpful_votes": 0,
      "publication_date": 20160811
    },
    {
      "title": "Fantastic Support!",
      "text": "This is a great gate... Easy to use... I have 2 other types of gates and this one is by far much easier to use. The handle and buttons make it easy to open. The reason for my headline... I have a 180lb puppy (English Mastiff) we were playing catch and the gate door was open... and he was running through the gate and the door caught on him, which then closed on him and he crashed through the gate breaking the handle. I emailed support just asking if they sold that part alone and they said they do not, however, they just sent me a brand new gate! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "jb1t",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "A baby gate with...style? Sure!",
      "text": "Can a baby gate can have style? It sure can! I wanted something that would blend with the metal banisters we have around the house and these blend well. Super easy to install and very sturdy. If you are using these on stairs, pack your patience - our staircase openings have different railings, walls, trim, and different depths and took some finagling. Once you figure all that out, you’re good to go. Would still buy even with that!",
      "rating": 5.0,
      "verified": true,
      "author": "Evan C. Young",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Nice gate. Color description is wrong.",
      "text": "Love the gate however, it’s NOT black. It’s dark gray. I’m VERY disappointed. It doesn’t match my porch and that’s what I specifically bought it for. Would have gives it 5 stars but the description is not accurate. Would return but don’t have the time.",
      "rating": 3.0,
      "verified": true,
      "author": "K. Southard",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Latch isn’t strong enough to match the sturdiness of the gate",
      "text": "It is too wide for one staircase but removing a panel makes it too narrow. I had to take off the adjusting nuts to make it fit. The gate keeps popping open and I haven’t figured out a solution yet. On another staircase it popped open with a little pressure. I adjusted the nuts to tighten the closure but I don’t think the latch is sturdy enough to keep the gate from opening.",
      "rating": 2.0,
      "verified": true,
      "author": "MJF",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Lacking",
      "text": "In order to use the largest extension it required 4 connectors. It only comes with 2. The other 2 are fixed onto the small set of bars and cannot be removed I've wasted hours of my life trying to rig some thing up. Wasn't worth it. My three year old also learned to open it within days.",
      "rating": 1.0,
      "verified": true,
      "author": "shep",
      "helpful_votes": 2,
      "publication_date": 20181010
    },
    {
      "title": "This is perfect.",
      "text": "We got this to corral our two dogs and it works great. It took a minute to set up, but that's a user issue; the instructions were clear and once set up, it works flawlessly. The box even included a set of sticky-backed cups to keep the wall supports from sliding around, which was a thoughtful touch. I am confident that we'll be keeping this product around for a good long time.",
      "rating": 5.0,
      "verified": true,
      "author": "James Spell",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Durable gate for dogs",
      "text": "update 1/16/20 Still working great and seems of durable quality. We loveh having it. Excellent gate for a good price. Its sturdy and durable. The lock mechanism works well and also the gate stays in solid place and never falls down or comes apart. We have had it for a few months and it seems of high quality. It defunatly keeps arw meduim size and small size digs out and they cannot knock it down. Love it. Some what easy to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "Georgie K",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Shepard Disapproved",
      "text": "Have a 90+ pound Shepard that would love to have run of the house when I am away at work but this keep her at bay. The all medal build is very able to stand up to her putting her paws on it and will not fall apart like a wooden one. The various adapters allow you to adjust it to the size you need. Well build.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Oh, boy, those instructions...",
      "text": "We actually had this installed incorrectly (using the instructions, mind you) and the entire gate bulged loose from the wall as my husband went through. After some detailed expletives about the ridiculous nature of using tension on a gate we decided to give the instructions another look. Turns out we were using the wrong extension (very, very easy to do). The revised gate structure has now been in place for a couple months with no further incidence. Looks great and matches the stairwell. We also purchased rubber discs for the tension mounts to protect the wooden posts the gate is mounted on (hard to wrangle discs, mounts in both directions while tightening the tension). Four-hand job, at a minimum.",
      "rating": 4.0,
      "verified": true,
      "author": "Yelhsa",
      "helpful_votes": 0,
      "publication_date": 20160802
    },
    {
      "title": "His Quality, Easy To Install Gate",
      "text": "This gate is pricey, but you sometimes get what you pay for. Easy to install Latch works well. Sturdy. I had to call customer service with a question about installation (for something that was embarrassingly obvious once it was explained) and the rep was very helpful and courteous . Recommend highly.",
      "rating": 5.0,
      "verified": true,
      "author": "Kendy",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Childproof latch is not toddler proof!",
      "text": "For the price I was honestly hoping to get something sturdier with a better latch system. My 3yr old is pretty much Donnie from the Wild Thornberries. It’s really hard to find something that will keep him in. The childproof latch failed to stop him, it was too easy. Back to the drawing board!",
      "rating": 3.0,
      "verified": true,
      "author": "Marisa Songer",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Watch the video before reading directions",
      "text": "Love the gate - solidly built and latch is super EZ to use. Our wall is curved so took “him” awhile to figure out how to install. I suggested the video from the start....smile - couple hours later was very helpful! 😉 We used rubber door stops -1 large and 1 small, and filled with epoxy and waited til next day to finish (yes, it was some work but worth the effort to fit the unique curve.) Gate is tight and solid and actually looks nice, too!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimmer",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "For bottom of the stairs",
      "text": "I would not like to use it on top as i dont trust the gates that are not installed to the wall. but for bottom of the stairs it is great. we actually ordered a second one for the hallway, but returning that one back as the bottom lock is broken the first day. Amazon is pretty easy in that regard though.",
      "rating": 5.0,
      "verified": true,
      "author": "yaykan",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Perfect dog gate",
      "text": "I was uneasy leaving my athletic 2-year-old border-collie at home, but this gate is working great. He feels secure behind it - it is set up on the tile where he likes to sleep. He is a JUMPER and really could jump over this but he hasn't even tried (I have a dog camera on him while I'm at work). This is a really attractive and study gate - really glad we found this great solution to keep our pup contained while we are at work",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie R",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Open Box, Missing items",
      "text": "Product seemed sturdy, but purchased and open box that was only to have cosmetic damage. Received a box with several items missing and no way to put the extensions on. It also appeared that the screw threads were stripped. Returned item the next day. The directions are not clear and it was only a process of elimination that I realized there were missing items. So this was not just a cosmetic damage item. It was a return without all the parts. Loss $7.00 in return shipping for not a complete product.",
      "rating": 2.0,
      "verified": true,
      "author": "Val Elaine",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Sorry...need to return",
      "text": "Hi, I mistakenly bought this product...never even opened the package...all I am trying is to return it. The return code I received, I presented to UPS and they did not pick up the package (per your instructions it did not work). Please resend a regular shipping label so I can print it on my own. Thanks. BTW, I did buy two of these gates from you and we love them. Solid product. I will change the review stars once I receive the label. (I only put one in the hope you will read it and help me out. Thanks. ).",
      "rating": 1.0,
      "verified": true,
      "author": "Colorado Kid",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Great gate great price",
      "text": "The best one I've found. Update: I had already given this product 5 stars but I'm so happy with it I wanted to provide an update. This is high quality, the gate isn't plastic it's heavy duty. Another perk of this one is that all the adapters and expansions came included in the set which could add up if you have to buy seperate. Having used \"baby\" gates in the past and having minor mishaps with them. This one seems up to the task. It really is a quality product and you won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Blackjack",
      "helpful_votes": 0,
      "publication_date": 20161010
    },
    {
      "title": "Look no further this is the only gate you need!!",
      "text": "Love this gate. It is so nice looking. And easy to go thru. When you getthe gate up it will look like it is off. Dont worry when you finish tightening etc. It will all even out. It comes with 3 different extension sizes. No buying anything extra. Our space was 41\". We used the pressure mounts. I love this gate. I want to put one everywhere we had those ugly plastic or wooden gates. No more trying to climb over with my bad leg and back. Great price!! Look no further.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorrie S.",
      "helpful_votes": 4,
      "publication_date": 20160119
    },
    {
      "title": "Not a true pressure mount gate",
      "text": "If you are looking for a gate that is solely a tension mount you will not find that here. The gate still requires being screwed into the drywall and damaging walls. I was under the impression this was a dual tension mount and hardware mount gate and I do not want to mess up my walls for something I only need up temporarily. On a positive it is a nice looking gate and seems sturdy, but the misleading information prevents me from using it.",
      "rating": 2.0,
      "verified": true,
      "author": "SC",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "It's a good thing they have a great Customer Service Dept.",
      "text": "Definitely the worst directions I've ever tried to work with. I am grateful they have a great Customer Service Department. The young woman in Customer Service asked me to send photos, she called me back in 15 - 20 minutes and walked me through the install. Love the product, and the look, hate the instructions.",
      "rating": 4.0,
      "verified": true,
      "author": "Indiana Dog Lover",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "It does the job.",
      "text": "Nothing spectacular for the price. It looks good and feels fairly stable. Parts were a little bent but I was able to straighten. We're using it as a dog barricade so it doesnt need to be rock solid. Would definitely work for a baby gate too.",
      "rating": 4.0,
      "verified": true,
      "author": "Santina",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Excellent product, worth the money",
      "text": "This is being used for large dog breeds and I couldnt be happier. Its strong enough to hold a 155lbs weight without budging on the wall.",
      "rating": 5.0,
      "verified": true,
      "author": "ForeverMoore",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Purchase rubber adapters!!!",
      "text": "I love the gate itself, but how it connects to the wall causes damage. I purchased rubber adapters after the fact to eliminate further damage to my door frame. For the price of the gate, I would have expected these to be included or for the gate to not cause damage.",
      "rating": 4.0,
      "verified": true,
      "author": "Rebecca Hill",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Great quality and great at serving it's purpose!",
      "text": "These gates are fantastic! Finally found a gate our escape artist dog can't get out of. The spacing of the bars is just perfect so he can't squeeze through and the overall durability of the gate is great. I love the door aspect so we can keep the gate open during the day when we're home, and close the gate when leaving to keep our dog in the kitchen area. These gates are pricey but worth it! I bought two.",
      "rating": 5.0,
      "verified": true,
      "author": "onefastricerocket",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Sturdy, sharp looking gate",
      "text": "We got this to keep the dog out of certain rooms. It's sturdy enough for a dog or a child it looks nicer than other gates I've seen in the past. The swing door can swing in or out which is nice. The latch on the door is easy for an adult, a small child wouldn't be strong enough to open though. Great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny H.",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "ordered two gates for my twin daughters and both came ...",
      "text": "ordered two gates for my twin daughters and both came missing parts.I was able to install one but the other is missing a Tension leg. which is a game stopper. Both gates were previously gone through you can tell from the packaging",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 3,
      "publication_date": 20180620
    },
    {
      "title": "Great Gate!",
      "text": "LOVE this gate! We get compliments whenever we have guests over. it is easy to use the open function, even for grandparents who watch our kids at our house. You squeeze the gate where you would normally grab to open and it allows gate to open.My tricky three-year-old has not figured out how to open this yet. It is tall and the walk through portion is wide but sturdiness is not compromised. We have wider stairwells so we needed to find one that could fit the opening. This goes perfectly with our iron stair banisters. We bought two and I am debating buy a third for the bottom of the stairs.",
      "rating": 5.0,
      "verified": true,
      "author": "kmsdjs14",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Very impressive looking gate!",
      "text": "Very nice looking gate. Had a handyman install and he had a little trouble figuring it out but once he did, it looks great. I had this installed outside on a deck, so not sure how it will hold up. Does not say it is made for the outside. But right now, it works and looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Cattleman's",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "No hesitation needed with this one.",
      "text": "After returning two regalo crates due to poor quality out of the box, I was a bit nervous to purchase another gate online without inspecting it ahead of time. This gate is FANTASTIC. So sturdy, clean looking. Height is perfect, door is extremely convenient and I love that it's pressure mounted. It is very well made, a steal for the low cost. Fit our wide doorway very well with the extensions. This is well worth the money. Also, do not be put off if there is a gap between the door handle and closure, once installed they meet up perfectly. I would give 6 stars if I could.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20160920
    },
    {
      "title": "Easy unlocking means your child will figure it out sooner",
      "text": "I bought this because it was one of the few gates to fit an opening. My child figured out how to open it at 19 1/2 months. When I contacted the company asking for a refund (as I feel this is a design defect since many other gate have more complex locking mechanisms), they told me there was nothing they could do. The unlocking mechanism is inferior to other gates. I am replacing this with one made by Safety 1st.",
      "rating": 2.0,
      "verified": true,
      "author": "jnrcorp",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Solid construction, love the swing door",
      "text": "Well made and designed. Love the height and swing door with easy open and close. Have purchased many pet gates over the years - this is the best! (You may need a day to get used to stepping over the bottom plate when you enter/exit)",
      "rating": 4.0,
      "verified": true,
      "author": "bibi",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "NOT SAFE for 51\" width stairs! Infant/toddler fall hazzard!",
      "text": "As one reviewer had mentioned in 2017, this gate does NOT safely span 51\". At that width, only the last couple of threads on the screws are holding this thing together. One slight push and it's going down. DO NOT PUT THIS AT THE TOP OF 51\" WIDE STAIRS if you have infants and toddlers! They WILL be able to dislodge this gate!",
      "rating": 1.0,
      "verified": true,
      "author": "L.D.",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Very pleased with this gate",
      "text": "Very pleased with this gate. The instructions were a little iffy. I began putting it together as directed then realized it would be too wide. It works perfectly. Very easy to open and close. Looks good without distracting from décor. I have three small dogs. My smallest Yorkie can fit through the bars in one extension. The other two can't so she won't go through without them. But the extender bars could be closer together. Overall very pleased with the results. Would buy again",
      "rating": 4.0,
      "verified": true,
      "author": "David R. Cesko",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "Fills the bill",
      "text": "My son-in-law came over and put this up a few feet away from the stairs leading down into the basement.....we have opened the gate and walked through it many times......it's holding up aok.......good quality. I'd buy this one again.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol B.",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Exactly what we needed",
      "text": "Durable, nice looking, trustworthy. We recently bought a second-floor condo, with the stairs inside the unit. With 2 kids 2 and under we needed something we could trust and keep up for years. This is exactly what we wanted and allows adults to use the gate to get through, rather than putting up and down a non-gated protective piece.",
      "rating": 5.0,
      "verified": true,
      "author": "explainer guy",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Torturous assembly",
      "text": "The most frustrating thing I have ever had to assemble & I've put together quite a few Ikea pieces. I spent a good 2 hours on it & it still doesn't look right. I had no idea it needed to be screwed into the wall on both sides!? I never would have purchased if I knew this. The exposed screws look tacky. It's made of quality sturdy metal but I would not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "AH37",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Life Saver (literally!)",
      "text": "We have 3 of these - at the top of both staircases and at the bottom of one of them. I can rest easy knowing my son isn't going to hurl himself down the stairs at any given moment. They are nice and modern and my 4 year old can easily open and shut them while keeping the 15 month old safe.",
      "rating": 5.0,
      "verified": true,
      "author": "JWood",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Defective Product",
      "text": "I ordered this product months before I needed to use it. When the day finally came that our 10 month old started crawling, it was time to install the gate at the top of our stairs. Sadly, upon unboxing the gate, I discovered that the framing was not square which causes the door opening to not latch. The product as it was delivered is completely unusable. I'm hoping I can still return after ordering it months ago.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Riphenburg",
      "helpful_votes": 4,
      "publication_date": 20180930
    },
    {
      "title": "Good Gate for our Shelties",
      "text": "We are using this gate on the fence of our townhome to contain our two Shelties. Sturdiness is relative to what you’re using it for. For our use, the gate seems well made and study enough. As mentioned in other reviews, the directions is a worthless picture book. Nonetheless, I didn’t find it difficult to install. We like the gate.",
      "rating": 5.0,
      "verified": true,
      "author": "ken",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Very sturdy and well made.",
      "text": "Love this gate, I have a small dog and needed a way to keep him on the deck. Even when I have him in my arms it is easy to open and close with one hand. It has press on sides or screw and it is very nice looking compared to the ugly white flimsy gates. I would buy this again and am looking for one like it that is longer to replace my cheap half broken one.",
      "rating": 5.0,
      "verified": true,
      "author": "JL Freeman ",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Insanely difficult to put together/install",
      "text": "This is the most godawful thing I have ever had to put together in my life. I have baby gates from 2 other brands. I am an IKEA assembly PRO. But this thing made me want to tear my hair out. The way the extensions attach is insanely frustrating. Save yourself over an hour of your life and go with a different brand.",
      "rating": 2.0,
      "verified": true,
      "author": "Jackie Williams",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "More functional than other stairway gates.",
      "text": "Got this to block the stairway from our back deck to keep our animals in (and other critters out). Easy to install, it appears well made, and the gate function is superior to step-over or simple barriers like some of the cheaper gates. I don't think that this gate is actually designed for outside use, but sprayed the hardware with silicon protectant to prevent rust.",
      "rating": 5.0,
      "verified": true,
      "author": "AJ Squared Away",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Cheap extension attachment",
      "text": "It was cheaply made. My 3yo Can easily open it but has struggled to open other gates. Also the attachments to adjust the size are connected with a cheap piece of flimsy plastic. Don’t waste your money on this gate. Should have returned it but I don’t want to make more holes in my walls.",
      "rating": 2.0,
      "verified": true,
      "author": "Michelle Hale",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Perfect addition!",
      "text": "I bought this to keep between our kitchen and back area of the house; to keep our 2 golden retrievers sequestered while away. The directions were clear on how to extend, depending on the size of your opening. I bought a set of wall nanny's to go with to protect our newly painted wall and install was super easy! It's been very sturdy and meets our needs for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "kevin m hardy",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "GREAT PURCHASE - WORTH EVERY PENNY",
      "text": "I love, love, LOVE my gate. I initially thought the gate would NOT fit my 51 1/2 opening when I intially opened the package but it does in fact fit with the wall guards I purchased. With two dogs I have owned several wooden gates (that do not open) and instead you have to climb over them but this gate is not only aesthetically appealing, it swings open and my dogs have not yet figured out how to jump over it and my Lhaso Apso who is short is also quite the jumper. She scratches at it in attempts to open it but with that child lock up top she can't. I would DEFINITELY recommend this gate over and over.",
      "rating": 5.0,
      "verified": true,
      "author": "Shaila Sanchez",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "Not Sturdy At All",
      "text": "Although this gate looks nice, it's not sturdy at all. I've had it up now for a couple of weeks and multiple times people in my household accidentally knocked it over. It might be because I had to use all the extensions it came with which I think makes it wobbly in the middle where the gate opens. Definitely not worth the price. I recommend looking for a different gate especially if you plan on using the extensions",
      "rating": 1.0,
      "verified": true,
      "author": "Lea Cosgrove",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Not very adjustable",
      "text": "I am returning the gate. Way too many pieces, and it was not adjustable enough for my needs. I didn't see any mention on the web site that holes needed to be drilled. If I had, I wouldn't have bought it.",
      "rating": 2.0,
      "verified": true,
      "author": "Honest Guy",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Worth my money",
      "text": "Very durable helps my pugs from coming upstairs on the carpet. Did have to make some adjustment the male pug figured out a way to sneak up through the gate by the corner gap so we added the extra piece of the gate.",
      "rating": 5.0,
      "verified": true,
      "author": "yisenia",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Highly recommend",
      "text": "This is the 3rd one I’ve bought... I had 2 at my old house but they weren’t wide enough for the hallway at the new house... it the only gat my mother in law can easily open and close It’s very easy to install and adjust- I love this gate!",
      "rating": 5.0,
      "verified": true,
      "author": "Barb",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Strong and simple, well made",
      "text": "This is the third baby gate I ordered and this one is the best. Very well made, very easy to install. A huge plus is that you do not have to drill into the walls like the other gates I ordered. It comes with extensions to help match the width needed for your setup. Gate is not spring loaded so you can leave it wide open if needed. Try it out, if you dont like it you can always return it.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelbi Bertrand",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Very sturdy, well built and secure gate for both children and pets!",
      "text": "This is a wonderful gate. It's very easy to set up, the locking mechanism is easy to use (even with 1 hand) and it's tall. Gate bars are about 2.5\" apart, so even the smallest dog won't be able slip through. For my purposes our 7lb yorkie can't get past it. It's powder coated, so it's durable. Extensions are somewhat easy to install, and the side grips are non-stick so they don't slide on the wall. I would highly recommend this gate if you are needing something that looks very nice, and is also secure.",
      "rating": 5.0,
      "verified": true,
      "author": "CMfromCA",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "Ok",
      "text": "Confusing to put together. I used the pressure instead of attaching to the wall, but there is a bend in the gate. If I loosen the pressure, the gate falls. If I tighten it so it doesnt fall, there is a bend. The gate is sturdy, but is not straight.",
      "rating": 3.0,
      "verified": true,
      "author": "Rebecca Squier",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "By far my most favorite baby gate for my dogs",
      "text": "By far my most favorite baby gate for my dogs! I have 2 bull terriers and if you know the breed you know they are very strong and crazy! lol They do jump up on this from time to time but it has not come down once. I have 2 in my home and always think I have room for another one of these. Cleans easily, looks modern and great in a home. I have had many people ask me where I got these. Ive had many different gates in the bast for indoor use and This one is the best for sure. Easy to set up. and very strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Savage",
      "helpful_votes": 0,
      "publication_date": 20150118
    },
    {
      "title": "Easy to install, looks great, but left mark in wall",
      "text": "We bought these to keep cats out of the living room. Fits well in a pretty wide hallway, looks nice and decorative. It was relatively easy to install, but when we removed it to reposition, we found it left an indentation in the sheetrock after only a few weeks of being there.",
      "rating": 4.0,
      "verified": true,
      "author": "NolaGirl",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Nice gate, vague directions",
      "text": "The gait is nice. Looks nice, but the directions are not the greatest. I’m using the gate at the bottom of my stairs and the different sizes really help. Would give 5 stars if the directions were better.",
      "rating": 4.0,
      "verified": true,
      "author": "Brett",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Disappointed but satisfied",
      "text": "I love the built and material of this gate, but I had to purchase two in order to put one gate up. So I had to spend double the money for this. I was able to find another spot for the second gate so it doesn't just collect dust in a closet, and itd be a big waste. I'm happy to see that I can leave my dogs out of the crate without having to worry where they wander in the house when they are kept in their own room. I'm overall satisfied with the overall product, but there should be extra gate extensions in it.",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20160402
    },
    {
      "title": "Its definitely a gate.",
      "text": "Cheap and easy to bend metal. The price seems kinda steep for the material quality but so far its a nice gate and it seems sturdy without the extra screws and drywall fittings. Have mine outside on the back deck so ill try and report back any damages weather may take on it or just general use over time.",
      "rating": 4.0,
      "verified": true,
      "author": "Orlin Dean Nelson",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "super strong",
      "text": "Strong, nice looking, well-made, adaptable to different sized spaces. A little tricky to figure out when trying to use all the additional pieces. But great once it’s all together.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Lynch",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "2 Defective gates - permanently locked shut after a week",
      "text": "Gate was great, for the first week. It has a dual locking feature until the pin on the bottom quit retracting and made the gate permanently locked shut. Called the manufacture and they responded immediately with a replacement. Problem is, the new gate did the same thing a week after install. There is a cable running through a post to retract the locking pin, this appears to be where the break is occurring. If they fix the design, this would be a nice gate. I can NOT recommend this gate.",
      "rating": 1.0,
      "verified": true,
      "author": "BD",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "For the pets maybe, but not for kids.",
      "text": "I bought this to keep my son inside the door. My son is 2 years old and 38 inches tall, 32 pounds weight. He is not that strong considering his age. But he figured out how to open it in 2 days. Now he walked in and out of this Baby gate freely so this is not a barrier for him anymore. The building quality is very good and I totally believe the gate can block median weight animals, but as I said, not for kids over 2 or 3 years old.",
      "rating": 3.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Gate NOT Reliable",
      "text": "The bolt to use will not stay in and the threader connector doesn't hold bolt, easily slips out, very dangerous. Top thread on locking side is not secure, will eventually pull out the lock and or entire gate to fall down. Lucky we saw this prior to depending on this gate which could possible injure our twin babies",
      "rating": 1.0,
      "verified": true,
      "author": "Dwayne Kleiber",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Solid as a rock!",
      "text": "I've tried several different models and this is by far the best. Easy to install and solid. I used the baby gate wall protectors but only on the tops so no holes drilled. Both are well worth the extra bucks.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Parsons",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Very sturdy gate with flexible installation",
      "text": "Installed the gate at the top of the stairs. Installation would have been very straightforward but for the fact that the trim on the walls makes the top and bottom of quite different widths. However, I was able to use the extension parts in such a way as to make it fit and the final result was very sturdy. This is a substantial gate that should last a long time. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "cps",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "They work but not sturdily with extensions.",
      "text": "I have a 52” hallway that we needed to block our dogs off with and I had to use all the extensions to fit it. It wabbles a lot because of the extensions. Had to hammer them so they fit all the way. It is easy to install but not that sturdy with the extensions.",
      "rating": 4.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 0,
      "publication_date": 20190824
    }
  ],
  "product_meta": {
    "title": "Munchkin Easy Close XL Pressure Mounted Baby Gate for Stairs, Hallways and Doors, Walk Through with Door, 29.5\" - 51.6\" Wide, Metal, Dark Grey",
    "description": "Color:Dark Grey\n\n Munchkin Easy Close XL Metal Gate\n\n\n The Munchkin Easy Close XL Wide Baby Gate, made especially for parents seeking added peace of mind and versatility, is perfectly suited for stairways and wide openings. Made from strong steel material, this gate provides ultimate durability and strength. Safe for use anywhere in the home, this pressure or hardware mounted baby gate stands 36\" tall and fits openings 29.5\" to 51.6\" wide. The extra-wide 22\" walkthrough allows for easy in and out access. You can also choose to use an optional third lock at the base of the gate to control the direction that the gate opens. It allows you to set the door to open in either direction or locks both ways to prevent it from opening at all. This feature adds another safety measure for places like the top of the stairs. \n\n \nPlease note that this gate ships with a gap between the gate frame and the handles. This is not a defect. The gap will close once gate is properly installed. Do not use this gate at top or bottom of stairs without using all four wall cups. For maximum safety, use four wall cups with sticky pads and screws provided when installing the gate in all locations. \n\n \nWhy You'll Love It: With the extra-wide walkthrough it becomes easy for you to move in and out throughout the day and the double lock system helps in the safety of your children and pets. \n\n Features \n\n * Adjust openings between 29.5-51.6 and has a height of 36\" \n * An extra wide walk-through section with 2 way opening and easy one-handed operation \n * Includes three extensions for flexibility of use \n * Double-locking system on the handle \n * A sleek design made from durable metal \n * U-shaped steel powerframe keeps gate securely in place \n * Pressure mounting system does not damage hardware \n\n Safety Warning \n\n\nChildren have died or been seriously injured when gates are not securely installed. ALWAYS install and use gates as directed using all required parts. STOP using when a child can climb over or dislodge the gate. Use only with locking mechanism securely engaged. NEVER use a gate to keep child away from pool. Install according to manufacturer’s instructions. Intend for use with children from 6 months through 24 months. This product will not necessarily prevent all accidents. Never leave child unattended. Do not use this gate at top or bottom of stairs without using all four wall cups. For maximum safety, use four wall cups with sticky pads and screws provided when installing the gate in all locations.\n\n\n\nFROM THE MANUFACTURER\nThis gate shuts with a firm push and provides six extra inches of height versus standard gates for added peace of mind. Three extensions are included to expand the gate up to 51.5\". This pressure-mounted gate has a wide walkthrough, two-way opening, and U-shaped power frame that provides a secure fit. Dimensions: 29.5 – 51.5” W x 36”H.",
    "rating": 4.5,
    "feature_bullets": [
      "Door locks easily with a simple push to close feature",
      "Double locking system makes it easy for adults to use, but hard for a child",
      "Optional third lock at base offers added safety by limiting opening direction to one way",
      "Item number: 46765, model number: MK0009 111, suitable for children 6 to 24 months",
      "Includes (1) fully assembled Easy Close Xtra Tall and Wide Safety Gate with (1) 2.75 inches, (1) 5.5 inches and (1) 11 inches extensions to fit openings up to 51.6 inches; additional extensions are available for purchase on Amazon",
      "JPMA Certified, 1 year limited warranty",
      "Measures: 36 inches tall and 29.5 inches 51.6 inches wide with the included (1) 2.75 inches , (1) 5.5 inches and (1) 11 inches extensions (fits up to 54 inches wide with if additional extensions are purchased). Measure your desired opening prior to purchase to ensure a proper fit",
      "Pressure fit baby gate with hardware included for added safety.This gate ships with a gap between the gate frame and the handles. This is not a defect.The gap will close once gate is properly installed NEVER use a gate to keep child away from pool"
    ],
    "specifications": {
      "Item model number": "46765",
      "Is Discontinued By Manufacturer": "No",
      "Target gender": "Unisex",
      "Minimum weight recommendation": "100 Kilograms",
      "Maximum height recommendation": "36 Inches",
      "Additional product features": "Dual_lock",
      "Number Of Items": "1",
      "Batteries required": "No",
      "Item Weight": "21 pounds",
      "ASIN": "B004CLBX2M",
      "Customer Reviews": "4.5 out of 5 stars1,261 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#2,421 in Baby",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More"
    },
    "categories": [
      "Gates & Doorways",
      "Baby",
      "Baby Products",
      "Safety"
    ],
    "price": 81.59
  }
}