{
  "website_summaries": [
    {
      "verdict": "A medium to coarse texture brush that offers good durability at a reasonable price.",
      "pros": [
        "Includes two handle holes, allowing you to choose best positioning for the job",
        "Can work on concrete or decking materials",
        "Bristles are stiff",
        "Nice wide brush head at 18 inches",
        "Good quality on the brush for the price"
      ],
      "cons": [
        "This brush does not come with a handle",
        "Some users have problems with the bristles falling out"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Perfect for the goats!",
      "text": "Yep, you read that headline correctly. Ha. I bought these to attach to the barn wall at goat-head height so that they had something to rub up against and scratch the tops of their heads! The goats are quite pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Moffat",
      "helpful_votes": 52,
      "publication_date": 20180805
    },
    {
      "title": "Highly recommended- high quality strong bristled brush",
      "text": "I loved using this brush. I bought it to prep my concrete floor before acid staining (which means the floor needed to be very, very, very clean). This brush is perfect for all tough jobs. The bristles are stiff, the base is well crafted, solid wood. The brush has held up really well (there aren't any bristles falling out and being left on the floor). You do need to use your own mop/broom etc handle (anything with a twist at the end) or you could use by hand. Overall, I'm very impressed with this brush- good quality, excellent price, and holds up amazingly well.",
      "rating": 5.0,
      "verified": true,
      "author": "ALLFLUKSD",
      "helpful_votes": 10,
      "publication_date": 20170711
    },
    {
      "title": "Not one bristle lost",
      "text": "I used this on my embarrassingly filthy deck, with sodium percarbonate (oxygen bleach, like oxi-clean) and worked the heck out of it. I didn’t lose a single bristle, but there was a tad of color bleed at the very first use (probably due to the oxygen bleach). Good , tight fit on the random handle I used and cleaned up easily. It’s so nice to get “simple things” that just do what they are supposed to do, without falling apart in no time. I’ll look for this brand again.",
      "rating": 5.0,
      "verified": true,
      "author": "W.E.",
      "helpful_votes": 4,
      "publication_date": 20191103
    },
    {
      "title": "Total Waste of Money",
      "text": "Save your money. What a joke. First time I tried to use it, the bristles started falling out. And kept falling out. The bathroom floor I was scrubbing ended up nearly carpeted with bristles. My next move was to throw the brush away. Totally worthless.",
      "rating": 1.0,
      "verified": true,
      "author": "BuzzMan1969",
      "helpful_votes": 14,
      "publication_date": 20180412
    },
    {
      "title": "Great Scrub Brush...........",
      "text": "I've been looking for a brush to clean my wooden floors in my living room which will eventually need to be sanded. I had a hard time cleaning the grime which seeped into the wood. After reading the reviews which indicated that the brush could be used for a deck on a boat, I thought I would give it a try. I was able to scrub the floor, small areas at a time and remove much of the dirt. I was then able to apply a floor protector for the time being thus protecting and sealing floor.",
      "rating": 5.0,
      "verified": true,
      "author": "Stella C.",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Solid / Bristle tension seems good.",
      "text": "Use it to help get dirt from planter drip off a deck / cement. If you are a larger human you can grip this thing up pretty solid with one hand and scrub with out a handle attached. (Which is actually what i was hoping I could do, I never intended to buy a handle for it.) It is NOT that the brush head itself is small it's that the wood is a good shape for gripping if you have a bigger hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Hollenbach",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "A Stretch to call it a Brush",
      "text": "I'm not sure how to rate the \"stretch\" feature or what it means with regard to a scrub brush. This particular brush is more suited for brushing hair, then serving as a scrub brush for floors and the like. For the \"easy to hold\" feature I can only add that the riveted hole does not support most brush handles and the alternate \"smooth\" hole seems to serve no purpose.",
      "rating": 1.0,
      "verified": true,
      "author": "OldSchool",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Stain comes off when wet",
      "text": "The stain on this wooden brush came off when I got it wet to clean the floors turning everything a mucky brown color. After using it once it's going in the trash.",
      "rating": 1.0,
      "verified": true,
      "author": "dmsuter",
      "helpful_votes": 6,
      "publication_date": 20170826
    },
    {
      "title": "Best scrub broom I have ever had",
      "text": "This does exactly what I hoped it would. Scrub the roof dirt that settles on my lanai. It got the lanai SO clean. It rains daily here in the summer and the crud just bakes on the lanai floor. Scrubbed right after a rain then rinsed with a hose and it is 95% perfect. Thank you for a product that actually works.",
      "rating": 5.0,
      "verified": true,
      "author": "ILoveVeggies",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Great deck brushes.",
      "text": "Bought a pair of these and attached them to a piece of pine to make a boot cleaner for my house in S. TX, it has been a rainy winter and we get mud. For about $12 in materials it was a great solution. The brush bristles are nice and stiff and bonded into the solid wood block.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward O'Neill",
      "helpful_votes": 13,
      "publication_date": 20150222
    },
    {
      "title": "Soft brush",
      "text": "Bristles are soft and not stiff like I thought they would be",
      "rating": 2.0,
      "verified": true,
      "author": "E T Hollis",
      "helpful_votes": 3,
      "publication_date": 20190531
    },
    {
      "title": "longevity",
      "text": "this is a good brush for use when the cleaning solution you use is not too strong . ok for use with household cleaning products , would not recommend use for strong outdoor cleaning products like acid based products . use with the wrong cleaning product the bristles will quickly fall apart .",
      "rating": 4.0,
      "verified": true,
      "author": "Norman in Boca",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Works just fine.",
      "text": "Bought this brush to clean the porches on our cabin on our 40 acre ranch. The porches get pretty dirty. Hosed them down and scrubbed away. Worked just as you would expect. I see that some reviews complained about loosing bristles... lost maybe four as I would expect considering the scrubbing I did. Porches came clean quickly and easily.",
      "rating": 4.0,
      "verified": true,
      "author": "M.L.C.",
      "helpful_votes": 2,
      "publication_date": 20190705
    },
    {
      "title": "looks like a very good brush",
      "text": "Unfortunately, I probably won't use it. We clean our desk with a power sprayer. I bought it thinking it would be good for cleaning a tiled shower. I think it's much too big for that. But I like the way it's made, with very stiff, albeit long, bristles, the wood block, and two threaded holes. Looks like a well made product.",
      "rating": 4.0,
      "verified": true,
      "author": "meLoveToBake",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Great product, very good quality",
      "text": "I use this to keep ashes off the floor of a pizza oven. Hasn't failed me even on a 800° cooking stone!",
      "rating": 5.0,
      "verified": true,
      "author": "Maurizio",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Don’t use to clean before painting",
      "text": "Used it to clean stained cedar siding before painting. Unfortunately ended up picking out dozens of bristles that came off the brush. Guess I should have used leaf blower before painting to remove bristles stick to the wall.",
      "rating": 1.0,
      "verified": true,
      "author": "zman",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Very sturdy, strong scrub brush",
      "text": "Have not used it yet, but the bristles are very stiff and the block is very solid. I expect great scrubbing performance. First use will be to scrub oxidized paint to prepare repainting. I also plan to use it for scrubbing the garage floor, cement front porch, and decks. Will update to tell you how that worked. My last good scrub (polyethylene bristle) brush was used by a handyman and that was the last I saw of it. (He probably loved it). The bristles are a little stiffer, of course it is new.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Seda",
      "helpful_votes": 0,
      "publication_date": 20170702
    },
    {
      "title": "Great deck brush",
      "text": "This is a great deck brush. Took me back to the Navy days of pointlessly scrubbing decks, and the best part is that you don't have to pay government price for this deck brush, it's a fraction of the cost the government gets these for! Fits any push broom handle perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "SilentValor",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "This is a real scrub brush",
      "text": "This brush can take a lot of hard work and still keep on scrubbing. It was perfect for my deck made of 2x6 redwood prior to staining. The deck cleaner I used didn't phase it. A strong handle is needed to get the most out of it because of its size. A smaller brush may be better for light weight operators to get good results. The bristles are long enough to get into the cracks of the deck a bit but still remain stiff enough to do the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Ancient DIY'er",
      "helpful_votes": 9,
      "publication_date": 20131111
    },
    {
      "title": "Don't but, garbage. Falls apart within 30 seconds of scrubbing",
      "text": "If I could give it negative stars I would. As a previous customer states, I used it today for the first time in my garage on new concrete that's 4 months old to get dirt spots up. A few gentle scrubs and all the bristles fell out and my garage floor was covered in bristles. My dollar store broom works better then this! What a cheap pos!!",
      "rating": 1.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Good for carpets",
      "text": "Using this the brush to brush carpet cleaner into my carpets. Brushes well, not too hard or soft. Using it by hand, not super uncomfortable to hold.",
      "rating": 5.0,
      "verified": true,
      "author": "Lin",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Not good for scrubbing concrete",
      "text": "Bristles fell out and the stain from the wood turned everything brown!",
      "rating": 1.0,
      "verified": true,
      "author": "Phillip",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Scrubadubdub",
      "text": "Just what I need to clean the roof on my RV",
      "rating": 5.0,
      "verified": true,
      "author": "Michael King",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Great Product",
      "text": "This brush scrubs so well, like, concrete and my dimpled vinyl flooring. I was scrubbing by hand before, this is much easier and faster.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele Wyngarden",
      "helpful_votes": 25,
      "publication_date": 20131029
    },
    {
      "title": "perfect for my purpose",
      "text": "I use this to sweep off and hose off my cement patio, it is perfect for the job. Well made and easily attached to my old wood handle.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Great Goat Brush!",
      "text": "We've tried several animal brushes and this one is our goats favorite. It's huge and very hard - they love it and fight over who gets brushed next! :-)",
      "rating": 5.0,
      "verified": true,
      "author": "jules6728",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Weiler makes a great deck brush.",
      "text": "This is a nIce well made brush that's sturdy and long lasting. I use it to scrub my wood deck and concrete porch. The bristles are just right, not to firm and not to soft. My existing handle screwed right in and held tightly.",
      "rating": 5.0,
      "verified": true,
      "author": "rshaddTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Versatile",
      "text": "This is great, very sturdy. I've used it for scrubbing and sweeping concrete porch, in and extension pole to get debris off the top of my gutter guards.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherry P Gardiner",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Good, hard, stiff bristles",
      "text": "Got this for concrete for acid (etc) washing, and so far so good. Very stiff, scrubs well. Time will tell how it holds up to use, but in the first couple times it seems a good value and works nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Linwood",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Great Brush for wood decks, tile, and stone.",
      "text": "Great brush for decks, concrete walks, tile and stone. The bristles have the right amount of stiffness and give to make it an easy brush to use. I put it on a stiff, standard thread, telescoping pole and it is a good combination, especially for scrubbing my painted deck after leafs cover and stain it over fall and winter.",
      "rating": 5.0,
      "verified": true,
      "author": "M.G.",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "Rigid. Durable. Effective.",
      "text": "This is a fantastic brush. It is very rigid and durable. I use this to scrub the natural stone in my kitchen and to brush through short-knit throw rugs and it has been very effective for both purposes. We have two shedding dogs and the brush does a great job to loosen hair from the carpet fibers. I'm sure that this would be equally effective for deck cleaning or cleaning of any appropriate surface. I would buy this brush again,",
      "rating": 5.0,
      "verified": true,
      "author": "Pete O'Brien",
      "helpful_votes": 2,
      "publication_date": 20150404
    },
    {
      "title": "Potential shedding problem",
      "text": "I bought two before settling on the product. If working around wood stain, this brush would likely be a nuisance. I suggest trying another brand.",
      "rating": 3.0,
      "verified": true,
      "author": "Pacbell",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "scrubber scrubs",
      "text": "I have been using these for over two months in our stable, barn, and mud room areas of our farm. It has held up wonderfully. Now what is the best way to fill in for a few more words. Well it cleaned up after we killed a deer and pig sweeping the blood out of the barn and easy clean up when we cleaned up the brush took to it's b; beach soaked for 20 minutes in lightly bleached water.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel and Robin Machado",
      "helpful_votes": 4,
      "publication_date": 20141029
    },
    {
      "title": "It is exactly what you see. You need to ...",
      "text": "It is exactly what you see. You need to have a stick to screw into the hole. If you are getting rid of an old broom you can just keep the stick or you can switch sticks back and forth from other brooms. It is cheaper to buy without the stick. If you do not have a stick you should buy one that includes it.",
      "rating": 4.0,
      "verified": true,
      "author": "Debra Layton",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "I Am Pleased With What I Received",
      "text": "This brush is used with a screw in stick handle. It is very versatile. The bressles are stiff and are ready to scrub my wooden porch deck. I am very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy Clark",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Good for goats",
      "text": "Bought these as scratchers for our goats. I screwed them to the loafing shed, reels, and pallets in their pens. They love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Heard ",
      "helpful_votes": 2,
      "publication_date": 20190310
    },
    {
      "title": "Only the robot is happy",
      "text": "Original order and replacement sent a wrong brush with a correct label! Can't seem to order the brush head I want! If only the warehouse robot could \"see\" the brush and not just the label.",
      "rating": 1.0,
      "verified": true,
      "author": "Margaret P. Travell",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Excellent quality and great value!",
      "text": "This is perfect for my pizza oven to sweep ashes out of the way before cooking, love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy P.",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Donkeys Give These 4 Hoofs UP!",
      "text": "Nice to be able to purchase without the handle, as I use these in the pasture and barn as 'scratching stations' for my donkeys. The bristles hold up very well to repeated full force scratching and rubbing by a 600lb donkey!",
      "rating": 4.0,
      "verified": true,
      "author": "Scots-Irish Lass (terri)",
      "helpful_votes": 5,
      "publication_date": 20151007
    },
    {
      "title": "fell apart",
      "text": "I put this brush in my garage for about a month and a half and when i went to use it the strands literally broke off and the whole brush lost all the bristles :(",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer Poppe",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "I have \"Gutter Stuff\" in my gutters and, contrary ...",
      "text": "I have \"Gutter Stuff\" in my gutters and, contrary to what I was told by the installer, it must be cleaned after the leaves come down or it will clog up with the leaf debris as it breaks down. I have found that this stiff bristle brush helps in keeping the gutter stuff unclogged and I can add a pole to it to brush the leaves out of the valley's of the roof.",
      "rating": 4.0,
      "verified": true,
      "author": "Carol M. Rogers",
      "helpful_votes": 3,
      "publication_date": 20141111
    },
    {
      "title": "Okay",
      "text": "Used to clean shower walls, but noticed some bristles came off.",
      "rating": 3.0,
      "verified": true,
      "author": "Just me",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Worked well to chemically scrub a TREX deck",
      "text": "Used this brush to chemically scrub my TREX deck, and it worked very well and seemed to hold up fine. Very reasonable price too.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth J. Gilbert",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Good product!",
      "text": "Used this on a broom handle with oxiclean to clean my vinyl siding, works great!",
      "rating": 5.0,
      "verified": true,
      "author": "TMarie21",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "ok for the price",
      "text": "would have gave it four star but used it to brush a flat smooth metal roof the brush lost bristle in one hole so maybe they forgot to glue it in used less then 5 mins before they fell out fast shipping tho got by using it",
      "rating": 3.0,
      "verified": true,
      "author": "TeamTNT",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Lost many bristles",
      "text": "This only did an okay job at cleaning the light mineral deposits on deck tile grout. It only removed about half the mineral, but then it also lost many bristles during brushing, causing a new mess.",
      "rating": 3.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Worked and cheap enough to dispose of rather than fully clean.",
      "text": "Worked well at spreading Beane-doo mastic remover (soybean oil) and didn't get all gunked up in between each coat. Cheap enough to be disposed of after the job. Unlike the floor squeegee that continually fell off the handle - this brush had a threaded hole and was very secure.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 0,
      "publication_date": 20170113
    },
    {
      "title": "This came a bit broken",
      "text": "This product came cracked. The overall quality is not very good.",
      "rating": 2.0,
      "verified": true,
      "author": "JVV",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Great product, better value then other sites.",
      "text": "Great little broom head for driveway and sidewalk use. Pushes pea gravel mounds like magic, very stiff and brawny. Just what I needed and ordered.",
      "rating": 5.0,
      "verified": true,
      "author": "REV. L",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Good for the price",
      "text": "Using the deck brush to clean the bathroom/bath tub. The brown in the bristles bleed when using a cleaning agent, and bristles break off and are similar to that of a broom. For the price, it’s not bad and it did the trick. I don’t expect this to last forever, but for the price it should be easy to replace if needed.",
      "rating": 3.0,
      "verified": true,
      "author": "Austin",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Compare cost and use to most scrub brushes!",
      "text": "The bristles are VERY sturdy which makes cleaning easy. Also the brush is much bigger than most scrub brushes which means you spend less time on your knees when cleaning floors. Yes, it holds handles, but they are far from needed",
      "rating": 5.0,
      "verified": true,
      "author": "M. FALINA",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Good value for the money.",
      "text": "It's a deck brush and brushes as a good brush should. It fit the existing wooden brush handle and seems sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Coffee Tim",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Great value!",
      "text": "Worked great on the end of my shop broom handle! Restored our textured tile to an almost new look!",
      "rating": 5.0,
      "verified": true,
      "author": "ronandjenw",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Great tool for deck refinishing",
      "text": "Used this to finish my deck. Great tool for the job of applying cleaner and then brightener.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie B-B",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Pretty soft bristles...",
      "text": "This is a very nice brush attachment. I screwed it onto a long broom handle and it was very secure. I was hoping for a stiffer bristle though. I'd recommend this for lighter use.",
      "rating": 4.0,
      "verified": true,
      "author": "JE",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "the bristles started coming out on the first sweep across the deck.",
      "text": "I had hoped this was going to be durable as a push broom for cleaning my deck surface but it is already falling apart ... a brush without bristles is of no use to me. Oh well",
      "rating": 3.0,
      "verified": true,
      "author": "NancyLiz",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Great brush",
      "text": "This brush both worked great and held up good from scrubbing oil off my driveway. Mine did not lose many bristles only a couple from hard scrubbing.",
      "rating": 5.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 17,
      "publication_date": 20140305
    },
    {
      "title": "Small but we'll made",
      "text": "I was expecting a full size brush. This is not. It is very well made and quite sturdy, just small.",
      "rating": 4.0,
      "verified": true,
      "author": "Ross Bishop",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Good scrub brush",
      "text": "I just used this to clean my balcony. I can say a few things: it takes any threaded pole which you'll want when you use this and it really scrubs. I was treating my balcony floors and used this to scrub in between the cracks and the floor in general. The brush held up to my abuse without loosing any bristles or flattening out.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele J.",
      "helpful_votes": 0,
      "publication_date": 20150829
    },
    {
      "title": "nice and sturdy",
      "text": "nice and sturdy.. I had some difficulty putting the handle in it, - you have to get it at a right angle for few twists/rounds, But once you get the holder in, it is a great brush for outdoor scrubbing .",
      "rating": 4.0,
      "verified": true,
      "author": "Victoria V.",
      "helpful_votes": 3,
      "publication_date": 20160403
    },
    {
      "title": "Solid choice - scrub brush",
      "text": "What can I say? It's just as described and exactly what I needed. I have several outdoor tasks which require some scrubbing - this brush was just firm enough without being a wire brush.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Great help",
      "text": "It is a great help after I added a long stick to it I was able to scrub up,up on the outside wall and roof with it🤗",
      "rating": 5.0,
      "verified": true,
      "author": "Jellybean",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Great for deck cleaning",
      "text": "We used 2 on a 500 sq ft deck. First with Oxy-clean then with oxalic acid, brushes look new.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Use this brush as a hand-held brush only.  Don't bother using a handle.",
      "text": "The broom handle threads are inadequate. I bought a medal tipped handle, and to screw into the brush. It worked initially, but with just a small amount of scrubbing a patio, the wood threads in the broom gave way. Don't bother getting this product. I purchased a more robust, non-wood product...I threw this one away.",
      "rating": 1.0,
      "verified": true,
      "author": "roselie buonauro",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Sturdy",
      "text": "Sturdy and strong brush but it bleeds brown and loses bristles",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Great product. I used the Weiler 44026 Palmyra Fill ...",
      "text": "Great product. I used the Weiler 44026 Palmyra Fill Deck Scrub Brush & the Rubbermaid Commercial FG636100LAC Lacquered Wood Handle with Threaded Tip, 60-Inch to scrub some sulfur stains off my wooden picket fence. The Handle & Brush worked perfectly. The Handle did NOT break when force was applied & the wooden threads in both the Handle & Brush maintained a secure connection while exposed to water & dish soap. The bristles on the Brush stayed upright & retained their integrity during use. It took me about 30 minutes to scrub the affected areas of my fence. So my review is for 30 minutes of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard J.",
      "helpful_votes": 0,
      "publication_date": 20160930
    },
    {
      "title": "I used the handle from our mop and it screwed in easily and didn't budge while scrubbing",
      "text": "Exactly what I needed to scrub the concrete patio at our apartment. I used the handle from our mop and it screwed in easily and didn't budge while scrubbing. Bristles are very sturdy and didn't shed during use, and I liked how it was more narrow so I could dip it into a bucket since we don't have access to a hose.",
      "rating": 5.0,
      "verified": true,
      "author": "S Reichelt",
      "helpful_votes": 0,
      "publication_date": 20160412
    },
    {
      "title": "I used this brush to clean up our wooden sidewalk ...",
      "text": "I used this brush to clean up our wooden sidewalk boards. It was the right choice after looking at several others. This one was stiff enough and when using a long handle it made the job less back breaking.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Loken",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Excellent item!",
      "text": "Very sturdy! holds up well. Would definitely purchase again. Bristles are tough.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve W.",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "It is awesome.",
      "text": "I love this product. I have purchased other items from this co. and they are awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary S Compton",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Very nice",
      "text": "These are awesome brushes. They are super stiff and seem like the entire thing will Be compostable",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine Catherine",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Bristles not strong enough for deep scrub",
      "text": "Bristles not strong enough for deep scrub - they give too much and flatten out after repeated use.",
      "rating": 2.0,
      "verified": true,
      "author": "charles musick",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Good deal.",
      "text": "Did the job. Happy with it. I would buy it again if I was ever crazy enough to do the staining concrete again. I used this brush to rub the acid stain on the concrete. Held up nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Son and Mom",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "dont use it with muriatic acid like i did",
      "text": "dont use it with muriatic acid like i did, all the bristles fell out after a week \\But i did get one cleaning out of it and the brush worked well nice and stiff",
      "rating": 2.0,
      "verified": true,
      "author": "bulldoglevin",
      "helpful_votes": 2,
      "publication_date": 20160911
    },
    {
      "title": "Don't trust this company",
      "text": "This product is no value. I used it for about 5 maybe 10 minutes before the bristles started falling out and ended up all over my floor and I had to clean them up as well as the regular job I was doing. What a mess!",
      "rating": 1.0,
      "verified": true,
      "author": "KAREN STEVENS",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Good",
      "text": "Works good. Haven’t noticed any shedding after 2 uses scrubbing the boat deck",
      "rating": 5.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "good brush",
      "text": "It screws onto my paint roller handle easily and firmly. Just used it to clean the patio with simple green, worked very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Best Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Old style quality at an excellent price",
      "text": "This brush is built like they used to make them. Rugged and stiff. Makes cleaning easy, even deep cleaning on hard surfaces.",
      "rating": 5.0,
      "verified": true,
      "author": "tdooley",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Works great",
      "text": "Works as stated and held up to heavy deck scrubbing.",
      "rating": 5.0,
      "verified": true,
      "author": "227 ENG",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Desk Brush",
      "text": "It's a brush and it brushes. What more can I say.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Corso",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Very good",
      "text": "Used on regular broom stick to clean our shutters with cleaner",
      "rating": 5.0,
      "verified": true,
      "author": "John Kelley",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Durability beat my expectations",
      "text": "I'm really pleased with the durability of this. I used it to scrub a deck and I was worried it would crumble into bits before the job was done. Quite the opposite. After the entire job was complete, it still looked brand new. Very good brush.",
      "rating": 5.0,
      "verified": true,
      "author": "computernut236",
      "helpful_votes": 0,
      "publication_date": 20161015
    },
    {
      "title": "Cheap",
      "text": "Bristles keep falling and mashing down. I didn’t even scrub much.",
      "rating": 3.0,
      "verified": true,
      "author": "Bryan",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Excellent Brush For Driveways and Walks",
      "text": "This brush works great to scrub driveways and walkways. I used it with some Bleach Water to clean the mold and mildew between my driveway and walkway pavers. It did a great job and I believe will hold up well for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Schmidt",
      "helpful_votes": 8,
      "publication_date": 20130402
    },
    {
      "title": "Do not like it at all",
      "text": "This was a big mistake. Do not like it at all. Every time I use it, bristles go everywhere. It was cheap and it works cheaply. Just makes a huge mess. You have to clean up all the bristles. It should not last long. All the bristles will be gone.",
      "rating": 2.0,
      "verified": true,
      "author": "Venita C. Copeland",
      "helpful_votes": 0,
      "publication_date": 20160501
    },
    {
      "title": "Love it!",
      "text": "Worked amazing to scrub down my deck and patio. Loved that I could buy just the head and use my universal handle so cheaper and less to store!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Rieckens",
      "helpful_votes": 0,
      "publication_date": 20170305
    },
    {
      "title": "It was the most fun and best exercise I've ever had washing my floor",
      "text": "I was inspired by Pipi Longstocking and modified two of these brushes to fit on my shoes so I could dance my way through scrubbing my travertine floor. It was the most fun and best exercise I've ever had washing my floor. I weigh 130 lbs and the brushes compressed somewhat under me, but using a set of crutches as stabilizers was the key to my success. That and great music.",
      "rating": 4.0,
      "verified": true,
      "author": "Marinela Roe Farris",
      "helpful_votes": 0,
      "publication_date": 20150915
    },
    {
      "title": "Great multi purpose brush!",
      "text": "Using this to clean the siding and decking on my house. Works great! Haven't lost any bristles yet (usually what happens). Screws onto your handle.",
      "rating": 5.0,
      "verified": true,
      "author": "Solerider",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Doesn't quiet get into the cracks of the large tiles ...",
      "text": "Doesn't quiet get into the cracks of the large tiles that we have in the bathroom. Also the bristles seems to break off fairily easly making it a bit more work to clean the bathroom floor. We'll have to utilize this outside or in the basement.",
      "rating": 3.0,
      "verified": true,
      "author": "Alisia Tostanoski",
      "helpful_votes": 2,
      "publication_date": 20141020
    },
    {
      "title": "Good srub brush",
      "text": "I needed something to cean my patio deck. This brusg did the job very well",
      "rating": 5.0,
      "verified": true,
      "author": "Doug",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "The bristles are very hard witch is GREAT for tough spots I had a big ink spill ...",
      "text": "The bristles are very hard witch is GREAT for tough spots I had a big ink spill in my dorm room and this is one of the things i used to clean it... This Saved me a lot of room charges",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160123
    },
    {
      "title": "Good to scrup up dog doo",
      "text": "I use this to scrub the dog-doo off the patio. Works good with soapy water and this handle-",
      "rating": 5.0,
      "verified": true,
      "author": "Spinner",
      "helpful_votes": 0,
      "publication_date": 20160312
    },
    {
      "title": "Makes a great boot cleaner!",
      "text": "I bought this, turned it upside down and screwed it to our deck for wiping your feet on the way in the door. Has held up very well and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amatek",
      "helpful_votes": 0,
      "publication_date": 20171006
    },
    {
      "title": "a classic broom from my youth",
      "text": "My deck is cleaner with little effort. I liked this broom more than the plastic brooms I've used in the past",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "More expensive too purchase from here",
      "text": "I lost quite a bit of the bristles while cleaning my deck the first time. But it's cheap so I can't expect too much. Works well enough, but found out too late that Lowes and Home Depot have these for several dollars less.",
      "rating": 3.0,
      "verified": true,
      "author": "ash",
      "helpful_votes": 0,
      "publication_date": 20150827
    },
    {
      "title": "The end of the handle that screws into the brush ...",
      "text": "The end of the handle that screws into the brush bike off after 3 uses. The broken piece stayed in the hole in the brush which meant a new handle was not enough. I need to replace the entire thing.",
      "rating": 2.0,
      "verified": true,
      "author": "Christina Tomlinson",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Good width and stiffness for scrubbing deck boards.",
      "text": "Bought this brush to clean and prep my deck before stain/seal project. Attached it to an extension handle and it worked as expected. Good size (not too wide) for scrubbing deck boards. Highly recommend this product",
      "rating": 4.0,
      "verified": true,
      "author": "Deal Pilgrim",
      "helpful_votes": 0,
      "publication_date": 20160509
    },
    {
      "title": "Very  sturdy",
      "text": "Was exactly what I needed. Have entryway sculpted tiles that are hard to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth E. Spaulding",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Nice, stiff bristles",
      "text": "Handy size for dipping into a bucket. I bought it to scrub my deck, and it was just what I was looking for.",
      "rating": 4.0,
      "verified": true,
      "author": "rainsquirrel",
      "helpful_votes": 15,
      "publication_date": 20130817
    },
    {
      "title": "The bristles are extremely stiff!! But that,  Is what I wanted.",
      "text": "Bravo!!! Bravo!!! Bravo!!! Absolutely outstanding brush! This will easily last me the rest of my life.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Sessions III",
      "helpful_votes": 0,
      "publication_date": 20180315
    }
  ],
  "product_meta": {
    "title": "Weiler 44026 10\" Block Size, 6 X 18 No. Of Rows, Palmyra Fill, Wood Block, Deck Scrub Brush",
    "description": "Size:10\"| Style:Palmyra\n\nThe Weiler 44026 Palmyra fill deck scrub brush is a push broom head that has brown Palmyra fiber bristles in a wood block, and can be used with a Weiler 44018 or 44020 broom handle (sold separately) for scrubbing decks or other rough surfaces. The Palmyra fiber bristles can be used indoors or outdoors to remove heavy dirt and debris from rough surfaces. The bristles are arranged in six rows, with 18 sets of bristles per row, to facilitate scrubbing. The wood block is heavier than typical plastic blocks and is better suited for moderate to heavy cleaning. The block has two handle holes, a threaded one that accepts a Weiler 44018 broom handle and a tapered one that accepts a Weiler 44020 handle (handles sold separately). The brush measures 10\" long. The bristles are 2\" long.\n\nBrooms are cleaning tools used to sweep floors as well as porches, decks, driveways, sidewalks, and other outdoor surfaces. They typically consist of a long handle attached to a broom head with natural or synthetic bristles to trap dirt, dust, or debris. Certain brooms can be used indoors or outdoors or both, or on rough or smooth surfaces, depending on the type of bristles they have and other factors. Some brooms are color-coded to prevent cross-contamination and help facilitate workplace organization. Brooms are used by janitors, housekeepers, and other professionals in a wide variety of commercial and industrial environments, including airports, hospitals, hotels, offices, schools, and stadiums.\n\nWeiler manufactures precision brushes, abrasives, and maintenance products. The company, founded in 1898 in Germany and headquartered in Cresco, PA, meets International Organization for Standardization (ISO) standard 9001.",
    "rating": 4.5,
    "feature_bullets": [
      "Deck scrub brush can be used with a broom handle (sold separately) for scrubbing decks or other rough surfaces",
      "Palmyra fiber bristles can be used indoors or outdoors to remove heavy dirt and debris",
      "Wood block is heavier than typical plastic blocks and is better suited for moderate to heavy cleaning",
      "Two handle holes, one threaded and one tapered, accept a Weiler 44018 or 44020 broom handle (sold separately)",
      "Brush measures 10\" long; bristles are 2\" long"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "18 x 10 x 7 inches; 0.01 Ounces",
      "Item model number": "44026",
      "Date First Available": "April 22, 2009",
      "Manufacturer": "Weiler Corporation",
      "ASIN": "B004FTPT62",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}",
      "GTIN": "885834624703 , 885868783094 , 012382440268"
    },
    "categories": [
      "Brushes",
      "Household Supplies",
      "Health & Household",
      "Cleaning Tools",
      "Industrial & Scientific"
    ],
    "price": 9.3
  }
}