{
  "website_summaries": [
    {
      "verdict": "This zero-gravity bungee chair is the perfect choice for those wanting an outdoor sitting area.",
      "pros": [
        "Fabric is suspended from flexible bungee system",
        "Chair folds up for traveling",
        "Holds up to 300 pounds",
        "Works with anti-gravity technology for ultimate comfort"
      ],
      "cons": [
        "Does not have a cup holder, as other zero-gravity chairs do"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "SEE PICTURES BEFORE BUYING",
      "text": "My husband sat in the chair twice and the chair is now on the floor. See pics. No info provided to contact the company.",
      "rating": 1.0,
      "verified": true,
      "author": "Heather Hamlin",
      "helpful_votes": 532,
      "publication_date": 20160521
    },
    {
      "title": "Not a quality product.",
      "text": "The seat says it supports 300 pounds. I weigh substantially less than 300 pounds. I've had it for less than a week, and the entire front leg assembly bent trapping my foot in the process. I would certainly not recommend this chair to anybody.",
      "rating": 1.0,
      "verified": true,
      "author": "David R. Roth",
      "helpful_votes": 202,
      "publication_date": 20151231
    },
    {
      "title": "Chair broke within 2 months of purchase.",
      "text": "While no doubt a comfortable chair, it seems to be made from cheap materials as the front support beams bent within 2 months of purchase. I weigh around 180lbs (this chair is supposed to support up to 300lbs) and have used the chair primarily indoors, mostly to sit and relax. What's more worrying is that of the 2 months, I have spent 3 weeks away on vacation - so, in effect, the \"real\" usage of this chair was barely over a month. I mean, yes, this didn't cost me an arm and a leg... but you get what you paid for.",
      "rating": 1.0,
      "verified": true,
      "author": "Yong Ik Lee",
      "helpful_votes": 217,
      "publication_date": 20150831
    },
    {
      "title": "OMG this thing is great!!",
      "text": "OMG this thing is great!!!!! I have continuous ankle and knee dull aches. When I used this chair this w/e for first time, I leaned back and it immediately took the pressure of my ankle and knee by supporting my body with the weight distribution balanced around my butt. Furthermore, I believe it was very therapeutic for my ankle and knees because they were positioned slightly higher them my heart. this allowed any swelling to drain away for these areas. Long story short both ankles and knees felt a lot better after resting on this chair. My only issue is the other posts about the frame failing which I will repost if this happens. Hope it does not!!",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 12,
      "publication_date": 20170410
    },
    {
      "title": "Broke after 3 weeks :-(",
      "text": "Broke after 3 weeks. My wife and I bought these for gaming. I'm around 130lbs, my wife around 180lbs. After 3 months of inside, normal use, for only 3 or so hours every few days my wife's chair buckled on the front support. The fabric and everything else about the chair is still fine, however we can no long fold the chair back up, and she now is basically sitting on the floor about 4 inches off of the ground. For $35 they seemed nice, but during reclining where the foot bar, 3rd leg support, is not touching the ground at all times you probably won't get the full weight support that is needed with just 2 legs in use.",
      "rating": 1.0,
      "verified": true,
      "author": "Capt4",
      "helpful_votes": 15,
      "publication_date": 20170609
    },
    {
      "title": "Comfortable but very fragile",
      "text": "Very fragile structure.. Frontal support frame gave away in 4th month with light / moderate use.",
      "rating": 2.0,
      "verified": true,
      "author": "Vinit",
      "helpful_votes": 298,
      "publication_date": 20150418
    },
    {
      "title": "Uncomfortable, unstable and dangerous!",
      "text": "I bought this to meditate in. It seemed comfortable at first but started pinching my neck nerves if I lied down in it for an hour for meditation. It has not been easy to get in and out when fully stretched (I'm a small person). Last night I lied down to meditate and it fell to the back off-balance, and I hit my head on the granite top and had a head injury that I had to ice for an hour. I'm throwing this away.",
      "rating": 1.0,
      "verified": true,
      "author": "EP",
      "helpful_votes": 5,
      "publication_date": 20190102
    },
    {
      "title": "Good in every way!",
      "text": "No assembly, easy to move, easy to open and use, easy to fold up and slide into a small crevice, between the wall and something large (fridge, freezer, table, washer, etc). It feels solid and it's very comfortable. I almost fell asleep in it. You could go to a home store and buy a folding chair that does less, isn't all that comfortable (by comparison) and likely won't even last at long as this well built chair. It's a true innovation!",
      "rating": 5.0,
      "verified": true,
      "author": "Digitalis",
      "helpful_votes": 8,
      "publication_date": 20170417
    },
    {
      "title": "Get What You Pay For",
      "text": "1. Extremely hard to push back. 2. Back legs look like they would bend if a heavier person sat on this. I believe specs state it okay for up to 300 lbs. I weigh 130. I can see the legs starting to kind of bend. Okay for me, not anyone heavier. 3. Mesh is hot. 4. Much shorter than expected. I think they saved a few inches on materials. 5. Plastic used for handles is kind of cheesy. 6. Bought this for price but I guess it's true, You do get what you pay for. 7. Zero Gravity may be something I have to see and try in person rather than purchasing online UNLESS one knows exactly what they're purchasing.",
      "rating": 2.0,
      "verified": true,
      "author": "JustMe",
      "helpful_votes": 2,
      "publication_date": 20180815
    },
    {
      "title": "Comfortable chair",
      "text": "We purchased Zero Gravity Chairs in Costco about 4 years ago. They we very good. We paid about the same price as the Caravan. It was time to replace the Costco chairs, the webbing became loose, they began to rust, and the adjustment mechanism was worn. We are very happy with these chairs, the webbing seems to be a bit stronger than our Costco purchase. The arm rests are a bit wider and the adjustment mechanism is more user friendly (larger finger holes). The Caravan comes with pillows, as did the Costco chairs, but the Caravan pillows and straps are stronger. A very comfortable chair.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 5,
      "publication_date": 20161224
    },
    {
      "title": "Very nice well made chair for the price - Happy with purchase",
      "text": "Not much to add about this chair besides what is shown and described in the product description, but I can say I am pleased with it, have used it for a few months, and believe it's worth every penny. I also bought a Sport-Brella Versa-Brella All Position Umbrella  to shield my face and upper body from the sun when lounging in my backyard. (The umbrella does clamp onto this chair without problem - it can be clamped over the fabric on the upper back tubing, or onto the vertical side tubing.) I do recommend this chair.",
      "rating": 5.0,
      "verified": true,
      "author": "BizzyEnufTop Contributor: Pets",
      "helpful_votes": 2,
      "publication_date": 20181012
    },
    {
      "title": "Too good to be true",
      "text": "Chair broke first time using it; one minute I’m relaxing under the nice sun the next thing my legs shot up in the air like a rocket 🚀 while the blood rushed to my head trying to figure out how to get out. I should have listened to all the other reviews about how fast it breaks. Buyer beware price is too good it is worth the extra money to buy one that will not collapse while sitting in it. So glad I was alone when this whole ordeal went down it considering the situation.",
      "rating": 1.0,
      "verified": true,
      "author": "Callie",
      "helpful_votes": 4,
      "publication_date": 20180524
    },
    {
      "title": "They Broke from light duty",
      "text": "These seemed ok, until they broke. Twice. I'd bought another one earlier and thought that when they broke it was a fluke. Since they were not expensive I tried again. The second one broke in about the same place. Not going to try a trird time.",
      "rating": 2.0,
      "verified": true,
      "author": "EnthusiasticReader",
      "helpful_votes": 3,
      "publication_date": 20200513
    },
    {
      "title": "Perfect for Relaxing",
      "text": "Got this chair for my new balcony so I could relax after work and I love it! It can lean you back nearly horizontal so it feels like you're laying in bed. The included pillow is very firm and not very comfortable so I bought an extra pillow for comfort. I find it easy to get into/out of, unlike some other reviewers. I am 5' 3\" and about 96lbs so I had no issues with the recommended size limitation for the chair. It was easy to unfold as it comes already assembled. I even napped in it the other day after work it's that comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 7,
      "publication_date": 20160705
    },
    {
      "title": "This one seems a good one.",
      "text": "This one opens as it should... I purchased another brand, there was a review that said it wouldn't open, I guess I got one of the same, 20 minutes later I printed the return label. This one opens as it should, easily reclines to comfortable positions, has a firm feel but not hard as a board. I like how the head/neck cushion is held secure with an elastic band which also has a velcro fastener My last 0-gravity chairs elastic band stretched beyond usefulness Only negative, the recline locks are rather tight making them difficult to use. I'm finding the use of just one is strong enough to hold my fat body in place...",
      "rating": 5.0,
      "verified": true,
      "author": "John Van Walsum",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Comfy",
      "text": "This chair was a replacement for a high end, sturdy ZG chair that I had for years. The only reason I replaced that was because I moved, it was still going strong. It is a little difficult to compare the two, but at the price-point, this is perfect. If I had nothing to compare to, I would say it is sturdy and does the trick for relaxing, but it is a little sketchy on the locking feature and isn't as smooth as I would like. That said, I would still recommend if you get a good price. Color is very nice and it looks better than many of the cheaper brands found in stores.",
      "rating": 4.0,
      "verified": true,
      "author": "Vdub",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Excellent quality chair.  My husband is forced to sleep in a recliner at night due to health issues, so we were looking at",
      "text": "Excellent quality chair. My husband is forced to sleep in a recliner at night due to health issues, so we were looking at options for when we travel. We decided to try this chair. It is light weight enough to use when we travel. We just took it with us last weekend to a hotel. It works great for him to sleep in and he found it very comfortable. He has started sleeping in this now instead of the recliner. We even purchased a second chair for a backup. The only complaint I have is that I wish the lock mechanism was easier to reach, especially when reclined. I would recommend to others.",
      "rating": 4.0,
      "verified": true,
      "author": "WVReviewer",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Very comfortable. Worth the price.",
      "text": "I love it. Very comfortable, easy to recline. I havent had any issues with the locking mechanism, but I'm not hard on my things either...I tend to take the negative reviews with a grain of salt for that reason. It isnt made for sleeping on and the locking device IS plastic...respect that. Its sturdy and doesn't feel cheap at all. My neighbor likes it too & plans to get one!",
      "rating": 5.0,
      "verified": true,
      "author": "Priscilla Crockett",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "excellent heavy duty chair, no wonder price went up $20",
      "text": "heavy duty super strong material, medium light weight, i wish they add a handle so you can transported it like a carry on when you fold it , it is easy to recline and you lock it with 2 saftey push botton on each side. if you are 5.7 or taller you leg back heel end up resting on the metal bar only when recline all the way to sleeping position",
      "rating": 5.0,
      "verified": true,
      "author": "Torres",
      "helpful_votes": 11,
      "publication_date": 20150930
    },
    {
      "title": "Comfortable in the lounge position, every thing else I find questionable",
      "text": "Pro's, nice once in the lounge position Con's, difficult for me getting out of the chair, not for short legged people since you have to straddle the leg lift portion of the chair while leaning far forward, seems awkward, The back of the chair does not come up far enough too provide any support while getting out or off chair. Controlling the fall of the chair assuming the lounge position seems to fall quickly. This chair is a little tricky and will take some getting use to. .",
      "rating": 1.0,
      "verified": true,
      "author": "Yme",
      "helpful_votes": 2,
      "publication_date": 20180113
    },
    {
      "title": "Elastic in headrest wont hold up to weather",
      "text": "ETA: After just a couple of months putside the elastic that is used to keep the headrest in position has broken down utterly failed. The fabric has held up (so far) but now the headrest won't stay in position. You'll have to bring it inside. ORIGINAL REVIEW: Surprisingly comfortable and it looks very nice (got the gray fabric). I like that the head rest is easily adjustable. I didn't give it all 5 stars because the design of the front \"foot rest\" can be a tripping hazard because it sticks out away from the base of the chair even when pushed down as far as possible. I also got the 13-9003 utility tray and it fits perfectly on the chair.",
      "rating": 2.0,
      "verified": true,
      "author": "Jerry Doherty",
      "helpful_votes": 3,
      "publication_date": 20170422
    },
    {
      "title": "Comfortable Chair",
      "text": "This a comfortable chair, and I like the included headrest. Although I use it as lumbar support and it works great. Lol. The chair folds easily and is easy to set up. However, the description says the chair color is \"beige\". It's not anywhere close to a true beige. It's more the color of taupe with a greenish-brown tint. I do not like the color at all. But overall the chair does what it says it will do. I've only had it a few days, but so far the locking feature seems to work better than other zero gravity chairs I've tried.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Run past these rusting chairs!",
      "text": "Bought 2 in June. By August they were rusting. This color is impossible to clean. See all pictures. Have you ever sat on a rusting chair in light colored clothes? They will be in the trash along with 2 brown ones. Amazon won't take them back. Probably work great as long as they don't get out of air conditioning. Seller should say indoor use only!",
      "rating": 1.0,
      "verified": true,
      "author": "M. Kelley",
      "helpful_votes": 8,
      "publication_date": 20160918
    },
    {
      "title": "Won't stay locked in position",
      "text": "I like these chairs, if it would stay locked in position, it would be amazing. It could also stand to have some attachment options such as a good out platform for a drink and snack, an umbrella attachment for beach sun, etc. It is frustrating when relaxing in it and then it just collapses on you because the lock doesn't really work.",
      "rating": 2.0,
      "verified": true,
      "author": "Eric R. Caron",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "BEWARE!!! THIS CHAIR HAS CHEMICALS THAT CAUSE CANCER!!!",
      "text": "I was totally diggin this chair until I read the warning label on the back that said it has chemicals that cause cancer... what the...? Um, I kinda like being healthy, so I am returning it. I’m glad there is a label warning about this... These chairs need to be sent far away to the back side of the moon where aliens can safely disintegrate them.",
      "rating": 1.0,
      "verified": true,
      "author": "Rich Quitevis",
      "helpful_votes": 4,
      "publication_date": 20180101
    },
    {
      "title": "Not a good chair for reading",
      "text": "I returned this chair because I was unable to sit with my legs out and read a book. When you engage the recline on this zero gravity chair, you are leaned back, and then you are looking up at the sky. I couldn't get it to allow me to sit up with my legs out so I could read. I returned it and bought \"Kozyard Cozy Aluminum Beach Yard Pool Folding Reclining Adjustable Chaise Lounge Chair (Beige) \" from Amazon, which is fantastic, and allows me to sit outside and read in comfort.",
      "rating": 2.0,
      "verified": true,
      "author": "Flossygirl",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Very comfortable, excellent customer service for defects",
      "text": "Very comfortable I love it! This initial purchase broke some time AFTER the warranty expired. I emailed the company and they promptly sent me a new one with no hassles; i'm very grateful that they stood by their product and their service to their customers. I'll never buy anything other than gravity chairs from now on. My only complaint is this brand of gravity chair doesn't seem to recline smoothly/seamlessly. I often have to bang my back against it to recline back. Minor flaw, other than that I love it and would recommend it for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Roordaboy",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "We use them for star gazing with a sleeping bag. Sweet.",
      "text": "They are difficult to start them reclining, I guess there's a trick to getting them to slide. Once they start it's pretty easy to get them to adjust. They aren't very comfy in intermediate positions, but layed down or upright, find them very comfortable. We use them for star gazing with a sleeping bag. Sweet.",
      "rating": 3.0,
      "verified": true,
      "author": "P. Grace",
      "helpful_votes": 2,
      "publication_date": 20180922
    },
    {
      "title": "The product was indeed sturdy. So sturdy that I had to exert extreme ...",
      "text": "The product was indeed sturdy. So sturdy that I had to exert extreme force to make it tilt back into the zero gravity position. I thought it was designed as a safety measure to require extreme force to operate so I did not return the product as defective until I sat on my brother's. His was very easy to tilt back into the zero gravity position (i.e. without much force). My bad, I should have returned the product on slightest suspicion of defect instead of waiting for more than 60 days when the warranty expired. This type of product should have a longer warranty period, definitely not 60 days.",
      "rating": 1.0,
      "verified": true,
      "author": "DavidW",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Comfortable but each chair seems to be different",
      "text": "I bought one for myself and the comfort is great and its easy locking. The only complaint I have is that it takes a lot of effort to make it go back and I have had 3 spinal surgeries so I have to be very careful. My husband liked it so much we bought one for him and his is just the opposite. HIs flies back to fast and one side doesn’t lock well and when you do it get locked, it’s just as difficult to unlock it. They are comfortable but it appears there is no consistency. It’s a roll of the dice when you order in what type of “issues” you may have.",
      "rating": 3.0,
      "verified": true,
      "author": "DHL",
      "helpful_votes": 2,
      "publication_date": 20171025
    },
    {
      "title": "Cheap & Dangerous Chair. DO NOT BUY.",
      "text": "DO NOT BUY! this chair was for my wife (5'9 150lbs). This was the second time using the chair when it broke. When you lean back there are plastic stops under the arm rest. They stop the chair from leaning to far back....well our chair failed (see pics). Luckily my wife was able to grab the arm rest before falling on her back. Oh yea their was a rock behind her. If she had hit her head on that and injured herself i'm sure the legal ramifications against the manufacture would have been huge. i'm going to try to return the chair and get my money back. I'll update this comment on my experience with the manufacture's customer service.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 5,
      "publication_date": 20170619
    },
    {
      "title": "Still great after almost 5 years",
      "text": "I bought two of these in November 2014. They are always on a covered (but not enclosed) patio, so they do get wet. They do not get saturated. So far, so good. No rust. The chairs still hold their shape, and the locking mechanisms work fine. The original bungee lacing is still intact. The persons who usually use these chairs are: male 5'10\" at 165 lbs, female 5'6\" at 140 lbs, and female 5'3\" at 165 lbs. So, I just ordered two more for our seasonal camp, hoping the quality is consistent.",
      "rating": 5.0,
      "verified": true,
      "author": "K. S.",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Great product",
      "text": "I love this chair. The breathability of it means you will never overheat laying on it. Being able to elevate my feet to the proper pitch helped reduce swelling in the ankles, improve circulation, and help my brain get a much-needed boost of oxygenated blood for a lunchtime nap. The only thing I would do to improve it is to add a mechanism on one side that allows you to lock it in place otherwise you can slip into full tilt without intending to. I usually set it up close to a counter to help me maintain and even keel.",
      "rating": 5.0,
      "verified": true,
      "author": "Therese",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Fell asleep in it the first time I used it!",
      "text": "The first time I was able to use this I fell asleep in it, so clearly it was comfortable. I am on the larger side so I wanted to make sure I got something that could support my weight. It is harder for me to get it to lean back but I think that is because I am short and heavier... Perhaps for lighter people it would be easier. Nevertheless, I feel safe and like using it!",
      "rating": 4.0,
      "verified": true,
      "author": "obxfan",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Terrible product and bad service",
      "text": "Terrible quality and terrible customer service. Bought for my boyfriend for Christmas so of course he didnt take it out of the box until the weather got warmer a few months later. He set it up in his house to try it out. Chair broke 2nd time it was sat in and it never even made it outdoors. Contacted the company and they said I was past 60 day warranty even though the chair was literally brand new. They said I could buy another one if I wanted. Yeah, right.",
      "rating": 1.0,
      "verified": true,
      "author": "Beth Legel",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "This chair is junk.",
      "text": "This chair is junk. I’m so disappointed because I thought I did my research. It is so hard to adjust. It wants to either sit straight up or lay back with your head lower than your body. It’s so hard to set it in between and when you finally do, it slips. It’s very embarrassing if you’re in front of anyone because it makes you look like a fool. Now that I've had it for a couple months, the plastic cracked and it won't lock into place at all. It was not made well. This is such a disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa Malone",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Wish they had a lock",
      "text": "We love these chairs for camping. They store nicely in our trailer also. The only thing I wish they would improve on is having a strap or something to lock them closed for carrying. My husband doesn't like them for this reason, they are a pain when you carry them and they come open if you aren't holding them tightly. I am going to make something to resolve this, but it would be nice to have it included.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Schaad",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Great chair!",
      "text": "I love my chair!! I bought it to keep in my trunk and use during my lunch breaks so I can lounge outside. I didn't even know there is a lock feature and dont see why I'd even need it. I'd definitely buy another one of these. Great value and very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190516
    },
    {
      "title": "Comfortable chairs",
      "text": "These chairs are a steal! They are usually more expensive elsewhere, so I was ecstatic to find them for this price online. I love them! They have multiple options for seating: sitting, laying down, and anywhere in between, and the little pillow that comes with them supports the neck perfectly. They are made of a good material that seems like it would be able to withstand some inclement weather, although I take mine inside after each use. The blue is a sharp color. Also, there was no damage during shipment and no assembly required.",
      "rating": 5.0,
      "verified": true,
      "author": "AllieN",
      "helpful_votes": 2,
      "publication_date": 20181014
    },
    {
      "title": "Perfectly met my need",
      "text": "For the money, can’t be beat. I originally bought this to take to Easter picnic because I recently had total knee replaced and had to elevate leg often due to swelling. Worked like a charm. It’s going to be great for outdoors/ beach too. I’ll need to have someone carry it for me though.",
      "rating": 5.0,
      "verified": true,
      "author": "Redsender",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Light, compacted, and good price",
      "text": "The frame feels sturdy, and the mesh felt strong. It's pretty light and compact. I was using it indoor as a spare recliner. The only negatives I have is the locking mechanism did not feel very reliable and did not offer enough resistance to changing positions. I tried another zero gravity chair where the resistance and lock was solid. This chair felt like the lock was going break if I kept it locked into a midway position. After a few hours my back started hurting from the curved reclined position. I would recommend this chair if the locking mechanism felt a bit sturdier or if I only like to stay in the sit up or curved reclined positions.",
      "rating": 3.0,
      "verified": true,
      "author": "Alex C",
      "helpful_votes": 3,
      "publication_date": 20150911
    },
    {
      "title": "Nice for what I paid - $44",
      "text": "It’s a decent chair for under $50. I sometimes have trouble getting it to recline and I don’t trust it too far back because it doesn’t lock well. But I was shocked to see that they are asking over $100 now! Definitely not worth that.",
      "rating": 3.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Useful and Comfortable and A Great Addition",
      "text": "I had ordered a similar chair several years ago, but when I wanted to repeat the purchase it wasn't available. I ordered a similar design from the same company - heavier than the previous edition, but very sturdy, still easy to carry, and very comfortable. It gives great comfort for outside seating, and easy to carry inside so I don't have to worry about weather or it being \"bothered.\" Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "John R. Sheehan",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Weak positional locking system.",
      "text": "The chair is as described but has an unexpected flaw. The locking mechanism does not really lock the chair so that if one is sitting in the upright position and leans back, the chair will tilt back despite the two knobs being set on \"lock\". Not a very good thing when taking a sip out of a glass on an adjoining table. My weight is 180 and I am 6' tall. That should not be enough weight to defeat the locking system.",
      "rating": 3.0,
      "verified": true,
      "author": "diaman",
      "helpful_votes": 7,
      "publication_date": 20150608
    },
    {
      "title": "Mixed results",
      "text": "I bought 2 as gifts for relatives who tailgate a lot. I have a similar chair and I love it especially when the tailgating goes on for hours. One chair was great-no problems at all. The other one broke when the first person—who was within the weight limit- crashed hard to the ground. Embarrassing in front of everyone, but could have caused a serious injury. All the plastic casing on one side just blew out. I will say that Amazon very promptly refunded our money because I didn’t want to risk the replacement chair doing the same. Amazon is always upstanding in regards to customer service.",
      "rating": 1.0,
      "verified": true,
      "author": "BE of ohio",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "Broke After First Use",
      "text": "My husband who is 220lbs (within the 300lb limit) sat on the chair for an hour, leaned his arm back and the whole chair fell back. Chair collapsed, he fell. Thank goodness he was fine; unfortunately the chair was not. I would not recommend this chair to anyone. We have another anti-gravity lounger that I purchased 2 years ago and it is still in great condition. I will just purchase another of that brand. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "DHS",
      "helpful_votes": 2,
      "publication_date": 20170624
    },
    {
      "title": "Super fantastic...compared to big name zero gravity chair",
      "text": "❤️Love it!! I have a leather recliner like this but it's bigger and doesn't fold up(we have a tiny house) so it takes up half the living room floor so I thought I would buy this zero gravity chair and test it compared to the big name brand zero gravity chair I now have in storage for now. And YES IT IS AWESOME! I have a bad back an can't sit on a couch or chair. This little canvas foldable recliner is a lifesaver. I can read or watch tv or lay back and take a nap. There are locks on each chair arm to keep it in the position you want the chair to stay in.",
      "rating": 5.0,
      "verified": true,
      "author": "Pupawheelie",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "Terrible",
      "text": "Bought one similar to this a few moths ago and wanted another one. Found this and it said it was in great condition. Came in a box that had 2 large holes it which probably came from the delivery service. But when I opened up the box pulled it out and there was a giant peice of duck tape on the arm. Not to mention when I sat in it it didnt lay back I really had to force it to go back. It felt cheap and broken. Ik because I have one I love that works great. I will be deturning this item and getti g my $ back!",
      "rating": 1.0,
      "verified": true,
      "author": "Tara Boorsma",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "This is wonderful!  Kind of funny usage",
      "text": "I use this for a funny thing. I live in an open home, where only bathrooms have closed doors. I also have 7 cats. So when I started needing to do my own Hypnosis having a cat jump on my lap didn't exactly help (ha). So I got this to put it in my upstairs bathroom so that I can go through Hypnosis there. It not only is easy to use but is very comfortable!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Jackson",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Is this chair Aluminum or Steel.???",
      "text": "We ordered these chairs because they were supposedly Aluminum. We are at the beach and very similar chairs had rusted. As soon as we opened the box we realized they weren't aluminum. They are O.K at this price but I don't expect them to last. Interestingly this website does not have a details part that the Android App did and says steel. The App, as of today, is still listing the material as Aluminum. I'm sure that will be corrected shortly.",
      "rating": 4.0,
      "verified": true,
      "author": "Judith H.",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Buying this product has definitely been the biggest waste of money",
      "text": "Buying this product has definitely been the biggest waste of money. I haven't had it more than 3 to 4 weeks and it already has broke. Within the first 2 weeks the locks broke on it that kept it from leaning back all the way to the ground, and I could no longer lean back at all. Now the front leg is broke on it; it just broke today. This chair is very cheaply made.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 69,
      "publication_date": 20160918
    },
    {
      "title": "Very comfortable",
      "text": "I found this chair to be very comfortable. I did not have any issues with breakage, as other reviewers did. (I weigh 140 pounds. Maybe that's why.) I did not have issues with the locking mechanism because I did not know it existed. Easy to swing backwards and forwards. It does require a bit of caution when getting in and out of it. Only drawback is that you can't flatten it out to tan your stomach. But for what it is, I can recommend it. Neighbors liked it so much that they stole it when they moved. So I got another one.",
      "rating": 5.0,
      "verified": true,
      "author": "DisneyDenizen",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Sturdy and good value for the price",
      "text": "I am very please with this chair. It seems to be well made, especially for the price. I've used it for almost 3 months now, and the only wear has been a slight stretching of the canvas seat (I weight 145 lbs.) I see the stretching as inevitable for a cloth seat. It has kept it's color well in the sun. The locking mechanism does seem to slip once in a while, but its not a big deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Rabbit",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Beware: blue is not the same blue from listing photo",
      "text": "The chair is okay. It's comfortable but often difficult to get it to move, either up or down, especially after you've engaged the locking mechanism and then unlocked it again. Sometimes you simply get stuck wiggling around trying to get the thing to start moving. But, here's my BIG ISSUE: The picture shows this beautiful bold blue chair. We ordered two for our upstairs deck off the master bedroom and were excited when the first arrived (they shipped them separately for some strange reason, and the 2nd hasn't arrived yet...but that's another story). We eagerly pulled it out of the box only to discover that it's this dull, dark blue color. WTF? Not happy about that at all.",
      "rating": 1.0,
      "verified": true,
      "author": "worthyking",
      "helpful_votes": 3,
      "publication_date": 20150107
    },
    {
      "title": "Cant say enough great things about this chair!",
      "text": "Ordered this for my elderly father as he has many aches and pains causing lawn chairs to be very uncomfortable for him to sit in or unfold. This has been amazing for him! Not only is it easy for him to unfold and put away but it also causes him no pain since as the sero gravity function works so well. The locks lock easily and safely hold position even for my 209 lb father.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Chair broke when leaning back too far.",
      "text": "Poor quality. The chair was fine until one day I lost a little balance and the chair leaned backwards too far too fast. Something snapped and I was never able to get it back to working again. This is my 2nd attempt and one of these chairs and while this was a different brand, I am just not impressed with the quality. These are too pricey for cheap disposable chairs.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul S Thomas",
      "helpful_votes": 2,
      "publication_date": 20170916
    },
    {
      "title": "Comfortable",
      "text": "Love this chair. My one complaint about it is the locking mechanism to keep the chair in recliner position, it’s very stiff and must be pressed on hard. Otherwise it very comfortable. I presently have a cast on my leg and it’s one of the few outdoor pieces of furniture that is sturdy. I go outside read a book or enjoy my garden from a comfy chair.",
      "rating": 4.0,
      "verified": true,
      "author": "Nancy Mack",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "and would have nothing bad to say about them than this",
      "text": "I have owned a pair of these for almost a year now, and would have nothing bad to say about them than this: we left our beige chairs out in the hot sun of eastern Washington, and the fabric discolored on the headrests as though they had been held close to a flame. Had I known, I might have treated them with Scotchguard, or some other suitable spray coating. Just a heads-up: you might want to do this yourself with your new chairs.",
      "rating": 4.0,
      "verified": true,
      "author": "Everett Bigwood",
      "helpful_votes": 4,
      "publication_date": 20160608
    },
    {
      "title": "Not for a heavy person.  It says 300, but that is false.",
      "text": "It was the first time I had a chance to use it since I purchased it. It has a weight limit of 300 I weight around 285. It crumbled and I lay on my back and head. Don't believe the 300 pound sticker it was a waste of money. I will try and get a refund, but I'm afraid this is not going to happen.",
      "rating": 1.0,
      "verified": true,
      "author": "Chali Lama",
      "helpful_votes": 5,
      "publication_date": 20170310
    },
    {
      "title": "Looks nice but don’t trust the chair to support me, so it’s useless!",
      "text": "The chair is rated for 300lbs but I wouldn’t trust it much beyond my 250lbs. I discovered the plastic arms support your entire weight. They are very flimsy and tilt inward the few times I’ve tried using the chair. I felt like they were going to give way at any moment. It is also very difficult to recline the chair once seated which is the chair’s entire purpose. Also with the footrest being longer than the front legs of the chair, you have to straddle the footrest to seat yourself; not a pretty or easy feat for a larger person. I wouldn’t recommend this chair to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Best yet",
      "text": "This is my 3rd “zero gravity” folding chair. I didn’t like the other two, so I almost passed on this one. I like to sit and read. Was uncomfortable in the other chairs. Practically had to hold the book straight above me to see it. Not an option. This chair has several comfortable positions and a lock feature to keep you there. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "PJ Whitehall",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "So far I LOVE LOVE LOVE this chair",
      "text": "So far I LOVE LOVE LOVE this chair. So easy to assemble (just open the box and done!). Super comfortable. And from what I am told by people who know these things the price is actually really good. I am not sure how long it will last etc but honestly this is one of my fav purchases. Sometimes we even use it at night in the apartment during movie watching since we don't have reclining couches. 😬",
      "rating": 5.0,
      "verified": true,
      "author": "LawGirl2009",
      "helpful_votes": 2,
      "publication_date": 20170324
    },
    {
      "title": "Great, comfortable chair. But getting it here in the correct color and in one piece was a challenge.",
      "text": "Third time was the charm. Ordered two chairs in black, but one black and one red chair arrived. Both extremely comfortable, but one quite noticeably red. Amazon was kind enough to ship a replacement black chair and have UPS pick up the red chair. Unfortunately the replacement chair was apparently dragged for miles behind the delivery truck; the box was mangled and the chair didn't fare much better. Back it went. And today a new, properly colored black chair arrived and it's perfect. Comfortable, moves easily, could sit in it all day long. Just wish it didn't take three tries to get it right.",
      "rating": 4.0,
      "verified": true,
      "author": "R. M. Handel",
      "helpful_votes": 3,
      "publication_date": 20150916
    },
    {
      "title": "I LOVE THIS CHAIR!",
      "text": "I was wanting the most comfortable folding chair to keep in our RV and I found it! Everyone loves this chair... even my husband who wouldn't admit it because that would mean I would have to get rid of his SF Giants chair. If your on the fence, order it! I don't leave mine outside year round and it looks good as new a year later. Would totally buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "MinimalistMomma",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Fine, durable, comfortable, though not amazing in any way",
      "text": "Definitely hold up well under various weather conditions -- should last for a few years at least, summer and winter. The headrest thing doesn't really stay in place, though: the material stretches over time, so you have to frequently readjust it. Small price to pay for such a decent outdoor lounge chair experience.",
      "rating": 4.0,
      "verified": true,
      "author": "Teh Arbitrageur",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Does Not last",
      "text": "All handles on both chairs broke. The silver bolt the holds the arm loose eventually come loose and there is no way to tighten it back. Had high hopes that this would be a good purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Hardy",
      "helpful_votes": 4,
      "publication_date": 20170522
    },
    {
      "title": "These do not hold up to specified weight. I am 220 lbs. Chair frame bent beyond repair!",
      "text": "I only used this chair a dozen or so times. Now it is broken beyond repair from just leaning back. As I was leaning back the frame just gave way and I fell all the way back so that my head was on the ground and feet were straight up in the air. Frame is badly bent now. Totally unusuable now.",
      "rating": 2.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Lifesaver after back surgery!",
      "text": "This chair saved me after I had back surgery and couldn't sit in a regular chair or stand for long. This really helped my recovery and enabled me to get some things done on my laptop without causing pain or stress on my back. I was able to read and work on my laptop by using a pillow on my lap. I often iced my back while I read and I even moved it into our family room so I could watch a movie comfortably with my family. It's lightweight, very sturdy and folds up small, so it's very easy to move and use anywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "LMG",
      "helpful_votes": 2,
      "publication_date": 20160727
    },
    {
      "title": "Decent chair but not very sturdy",
      "text": "The chair worked as I expected but was not as soomth of a glide as some other brands i have used before. Also, the locking mechanisim can come unlocked and strip the lock... this made it rather difficult to keep it locekd for long periods of time with slight above normal movement while in the chair.",
      "rating": 3.0,
      "verified": true,
      "author": "Myles L.",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Not what I expected but all good :-)",
      "text": "My bad - did not realize that these do not recline like a reclining lawn chair, but still really enjoy them.Quality seems good. Like other reviewers, I did not like the lower bar directly aligned with the heels of my feet; so here is my hack - went to Lowes and snagged a hunk of one inch pipe insulation (looks like a swimming pool noodle), took it home, and cut to length for each of our two chairs. Then, secured them with tie-wraps ( 3 evenly spaced between ends and middle). Now our heels rest on a cushion and not a piece of pipe!",
      "rating": 4.0,
      "verified": true,
      "author": "Red-Badger",
      "helpful_votes": 2,
      "publication_date": 20160421
    },
    {
      "title": "Highly Recommend",
      "text": "Came right out of the box with no setup involved. I am facing back fusion and disk decompression surgery. Once I found the right angle, I am very happy with the chair. For you back pain sufferers, I discovered another great use for the head rest. I was needing something to support my back in my car seat. Tried rolled up towels without much success. Looking at the headrest, I thought that it was molded perfectly and just the right thickness. Tried it and it is absolutely perfect. You can even used the velcro on the back to stretch it around your driver's seat so it stays put. Loved making this discovery.",
      "rating": 5.0,
      "verified": true,
      "author": "bmbutler",
      "helpful_votes": 8,
      "publication_date": 20130513
    },
    {
      "title": "Don't listen to the bad reviews",
      "text": "I work 12 hours a day as a security guard. Sometimes we have to sit for a couple hours and the pain will start to hurt your lower back. I brought this zero gravity chair and it's done good works. This one in particular is a great buy. Sometimes you have to tighten the screw when they get loose but it's still worth every penny. Especially if you don't want to spend $100 on the big ones that are built better. I weigh 210 Lbs and so far I've had no problems. I use it everyday and it's great.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Larimore",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Little small for me.",
      "text": "I purchased this chair based on price. I wanted a camp chair that I could nap in. I weigh around 240 and my shoulders press on the bars and hurt after a short while. I think if your 5' 10\" and under 200 lbs. This would be a great choice. If your bigger, get a bigger chair.",
      "rating": 4.0,
      "verified": true,
      "author": "Reece Fam",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Dangerous Chair",
      "text": "Purchased this chair in November 26, 2016. Up until today, I really like how comfortable and relaxing it was. Had it for 7 months and when I went to recline the chair today, the next thing you know I went flying backwards to the floor. Tweaked my neck a little bit. If my neck doesn't get any better in the next few days, I will be thinking about getting a lawyer. The parts that control this are all made of plastic and are not reinforced. This is a poorly designed product and I hope Amazon removes it from their inventory.",
      "rating": 1.0,
      "verified": true,
      "author": "Steph",
      "helpful_votes": 3,
      "publication_date": 20161210
    },
    {
      "title": "Won’t last forever",
      "text": "This product is kind of boggling. My chair like many other reviewer’s also broke but it took four years so not bad...I don’t use it that often... However I don’t understand how It gets such a great overall review when there’s a cavalcade of one star reviews in the beginning. Also I bought my chair at a fraction of the cost it is listed for now literally 25% of the full price so I don’t get it. take your chances",
      "rating": 2.0,
      "verified": true,
      "author": "Quincy",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Pretty good",
      "text": "Very comfortable. When I first set it up, it looked like it would be uncomfortable, but after sitting in it, love it. It’s great comfort-wise, but to be honest, doesn’t seem super durable. The surface feels plasticy so I imagine when I am lounging on it in hot weather I will need to put a beach towel down to make it more comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "C2",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Would recommend purchasing other chairs",
      "text": "Purchased two of these chairs less than ten months ago. Both chairs were used infrequently, and both have completely fallen apart. Would recommend purchasing other chairs. Caravan Canopy offered zero assistance and refused to stand behind their product.",
      "rating": 1.0,
      "verified": true,
      "author": "Bishop L Toups",
      "helpful_votes": 17,
      "publication_date": 20150304
    },
    {
      "title": "Great",
      "text": "The first time I used it, it hurt my back worse than it was already hurting. And I thought I was going to topple over backwards. The second time I used the head pillow as a back pillow and another pillow for my head and as long as I stayed in a certain position, I have no pain! I took it to work so I can use it on my lunch breaks to get some pain relief.",
      "rating": 5.0,
      "verified": true,
      "author": "Michaela Fetterolf",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "This is my 3rd gravity chair.",
      "text": "This is the 3rd gravity chair I have purchased over the last few years. I like them. The first one lasted a fair amount of time before weather damage eventually got to it (left outside all the time). The second one I have had for over a year and just purchased another so I have a set.",
      "rating": 5.0,
      "verified": true,
      "author": "BB",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Comfortable A+",
      "text": "Quality brand portable recliner with adjustable neck/head rest and extremely comfortable. It is wide enough but not for people over 300 or the fabric will sag- looking at my neighbors. Handles intense sun and rain. I have used this every day to read or watch and listen to the churping birds in my yard and elsewhere. The crimson color does not fade. I enjoy sleeping in this more than a cot or foam pad camping, too. Great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Barky",
      "helpful_votes": 0,
      "publication_date": 20170823
    },
    {
      "title": "First zero gravity chairs we have purchased",
      "text": "Ours arrived broken, and we returned it without problem. Unfortunately, to have a new one sent we would have had to pay shipping. So we purchased it elsewhere. We love them and have bought 4 of them so far. It would be nice to have both a neck pillow and a second lumbar support pillow.",
      "rating": 4.0,
      "verified": true,
      "author": "Tim Robinson",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "I tell you hwat.",
      "text": "This chair is the equivalent of 12pk of Haterade. Your inexperienced camping “friends” will be drooling at the sight of you entering the next dimension. It’s not light, but that keeps you closer to the earth when the spins hit from that Knob Creek Cheerwine mix and headys.",
      "rating": 5.0,
      "verified": true,
      "author": "Brando Commando",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Spiders!!!",
      "text": "It was beautiful at first. Sitting in it comfortably can be a little tricky. When I want to lay, the chair gets high in the air. Also . . . it became a house of spiders and their webs. So much place to hide for them. I'm no longer using it. No matter how often I clean, spiders just love it too much.",
      "rating": 3.0,
      "verified": true,
      "author": "mm",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Great chair, zero problems.",
      "text": "I purchased two: burgundy and blue. This chair is pretty comfortable as far as lawn chairs go. It's no jet puffed cushioned recliner, but it's better than a $10 lawn chair by far. I haven't had any issues that other reviewers have complained about. I thought one broke because it was moving despite being locked in place, but it turned out my S.O. only had one of the locks in place. Just wish it came with a cupholder of it's own that fits better than the aftermarket ones you have to buy if you want a cupholder.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Zero lumbar support",
      "text": "I actually bought this to try and achieve \"zero gravity\" and relieve my back while computer programming. The chair does neither. Why? It doesn't achieve true zero gravity unless you prop up the front to tilt back a bit further. And the canvas doesn't support your lower back, even when fully reclined. If you're putting this out on a patio for limited use, sure, why not. But if you're trying to get some back relief, look elsewhere.",
      "rating": 2.0,
      "verified": true,
      "author": "Smooth",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Chair collapsed - bad customer service",
      "text": "We purchased two of these chairs two years ago. We have taken great care of them. Bring them inside in the winter and use them on our deck in the summer. One of the chairs collapsed recently (see attached photo). The legs gave out and bent. I called Caravan and they said since the 60 day warranty has passed, there is nothing they can do. I think this is a safety issue with their product or we have a defective chair. Had something been under the chair at the time, there could have been a big injury. We love these chairs and are disappointed with the customer service and that the chair is no longer useable.",
      "rating": 2.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Made of Plastic",
      "text": "No instructions were included. It has a weight tolerance of 300 lbs. I weigh 180 and when I sat in the chair ( all plastic ) something cracked and I didn’t feel safe in the chair at all. Later I found a small piece of plastic that had broken off from somewhere. Piece of junk!",
      "rating": 2.0,
      "verified": true,
      "author": "Moonsong",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Zero gravity = great comfort!",
      "text": "Just received our inexpensive gravity chair in the mail a few days ago so I can't speak to the lasting quality of this chair, but it is very comfy, seems to be good quality. We got one from Costco for $50 last year and this year they were 60 at Costco so we looked at Amazon and found this one. It doesn't have the drink table attachment, and the chair doesn't lock into position like the Costco chair does, if those things are important to you. I like it just fine, now my husband and I each have our own chair for the few nice days we get in WI.",
      "rating": 5.0,
      "verified": true,
      "author": "jujubean",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "Disappointed- poor quality chair",
      "text": "The frame of this chair is completely connected to the arms - which makes it extremely difficult to get into a reclining position. We purchased one from Sam’s Club for my husband when they were in stock that was the same brand as this one. However, this chair is much more cheaply made and no where near the quality of the one purchased elsewhere. Super disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "MT",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "Woo-hoo WOOT Cool Beans - MY Chair!",
      "text": "Whoa - this is my chair now! Took it out of the box, said how does this work, sat down pushed back with my feet on the rest and wow. Nice nice nice. I can push a little or go all the way back. It seems sturdy. I will update if I have probs. But wow. I had thought and thought on this. Finally I bought and boy am I happy. I am 5' 5\" and wear a 10-12 [oh, yes that is a ladies size - I am a woman] and it is perfect for me.",
      "rating": 5.0,
      "verified": true,
      "author": "sas",
      "helpful_votes": 2,
      "publication_date": 20160630
    },
    {
      "title": "metal parts rusted with one month",
      "text": "metal parts rusted within one month seller offered credit but did not reply to my emails as to how to obtain credit",
      "rating": 2.0,
      "verified": true,
      "author": "cornelia harris",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "LOVE this chair. SO comfortable.",
      "text": "I LOVE this chair. Can't say enough about how comfortable it is. I have pretty serious back and neck issues and it is the only chair in my house (well, my property, since it's on the porch!) that I can sit in comfortably for any length of time. Wish it came in a a style that looked indoor. :) HIGHLY recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "MB Reviews",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Sturdy and comfortable",
      "text": "Very sturdy and comfortable. I’ve bought 3 of these already and would buy more! And of course we love camo, so this chair is perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "hawaiianrsch",
      "helpful_votes": 2,
      "publication_date": 20181010
    },
    {
      "title": "An easy in & out chair with analog recliner mechanism that ...",
      "text": "Exceeds expectation. An easy in & out chair with analog recliner mechanism that can be locked @ desired reclined angle ONCE you get use to it. Weathers very well, dries quickly if wet. Folds up compactly for quick storage out of the weather. Takes up small storage space. Seems to handle UV quite well. We are aged & not particularly mobile with severe back issues. This chair works well & relieves that aching back. It is more functional than others & has become popular @ gatherings.",
      "rating": 5.0,
      "verified": true,
      "author": "Dale M Williams",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "Defect of front legs",
      "text": "We just took out of package for our first camping trip and chair will not fold flat, and is hard to get out of.. This chair will not fold down and we compared to other chair and front legs are put on backwards. It is a defected and we can't even get our money back. Nobody will even contact us to exchange the chair. I just want a chair that is not unusable. Exchange would be preferred. Please someone she call or email me immediately",
      "rating": 1.0,
      "verified": true,
      "author": "Jeffrey",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "Amazing chairs!!",
      "text": "These are absolutely wonderful. They're so comfortable to sit and lie back in. We have them on our patio, and they're perfect for relaxing. We've had them for a few weeks and my kids still fight over them. We brought them to the beach, and everyone fought over them. I can imagine how great these feel if your back is hurting and there's lots of pressure. When you tilt back all the way, you really can feel your back release. There is also a lock under each armrest so you can freeze it in whatever recline angle you like. The brand is really good quality and feels durable. I'm sure we'll get more!!",
      "rating": 5.0,
      "verified": true,
      "author": "ZMomUtah",
      "helpful_votes": 0,
      "publication_date": 20160807
    },
    {
      "title": "most comfortable chair",
      "text": "I looked at several of these zero gravity chairs, but could not easily find one to try before buying. For the price, I decided that this chair was a low risk. I am glad I went ahead and bought it. It is a delight to sit and lean back on the patio. It fits me perfectly. It if one of the most comfortable chairs I have had. The price was certainly right.",
      "rating": 5.0,
      "verified": true,
      "author": "David Herr",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Ready Set Nap",
      "text": "This chair is a bit heavy to bring to soccer games, etc on a regular basis unfortunately but it is SO comfortable. I thought about actually using it as a recliner in the house but that didn't go over too well with the girlfriend. Easy to take a nap on this chair. Perfect for camping. Everyone will be jealous. It could use a cup holder though. Very high quality which is why it is a bit heavier than most portable sport chairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg A.",
      "helpful_votes": 0,
      "publication_date": 20170701
    },
    {
      "title": "Perfect for a tan",
      "text": "Perfect for the summer. Comfortable. Easy to move. Water resistant if left out in the rain. Perfect to get a tan. The lock feature is the only downfall, you can push right past the lock when you move the chair.... but then again I don’t think this setting is really needed as your body weight is what balances the chair. Highly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan M",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "These chairs perfectly match our decor and are comfortable to boot",
      "text": "These chairs perfectly match our decor and are comfortable to boot! We plan to use them indoors over the winter and outdoors on the boat in the summer. With a great price and superior quality, I would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Jones",
      "helpful_votes": 5,
      "publication_date": 20171018
    }
  ],
  "product_meta": {
    "title": "Caravan Sports Infinity Zero Gravity Chair, Black",
    "description": "Color:BlackThe Caravan Sports Infinity Zero Gravity Chair offers the ultimate portable comfort. The new and improved locking system allows you to lock the chair in any position and an adjustable headrest is provided for additional comfort or use as lumbar support. Perfect for backyard, beach or sporting event. Folded dimensions: 38.6\" length X 26.4\" width X 6.3\" high . Open dimensions: 25.5\" length X 45\" width X 64.5\" height . Supports up to 300 lbs. This product can expose you to chemicals including Diethylhexyl Phthalate, which is known to the State of California to cause cancer, birth defects, or other reproductive harm. For more information, go to www.P65Warnings.ca.gov.",
    "rating": 4.4,
    "feature_bullets": [
      "Durable textaline fabric suspended by double bungee system",
      "Relax with the smooth recline function that locks in any position, adjustable headrest/lumbar support",
      "Dual finger tip locking system",
      "Folds down to only 6.3 inches wide",
      "Supports up to 300 lbs.",
      "Strong steel frame",
      "Multiple recline position",
      "Made with durable textilene",
      "Adjustable headrest",
      "Dual finger tip locking system"
    ],
    "specifications": {
      "Product Dimensions": "25 x 4 x 37 inches",
      "Item Weight": "18 pounds",
      "Manufacturer": "Caravan Canopy",
      "ASIN": "B004KWBP1W",
      "Item model number": "80009000050",
      "Customer Reviews": "4.4 out of 5 stars5,625 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#7,285 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Lounge Chairs",
      "Patio, Lawn & Garden",
      "Chairs",
      "Garden & Outdoor",
      "Patio Seating",
      "Patio Furniture & Accessories"
    ],
    "price": 102.99
  }
}