{
  "website_summaries": [
    {
      "verdict": "The best radiator testing kit with the most convenience and compatibility.",
      "pros": [
        "Allows you to easily test for leakage in radiator",
        "Radiator caps come color-coded to easily find the right adapter for your particular model",
        "Includes several options for older and imported car models"
      ],
      "cons": [
        "Several of the adapters are not compatible with American-made automotive brands"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I bought this for many vehicles but mainly for GM ...",
      "text": "I bought this for many vehicles but mainly for GM and it does not include the parts for a 2000-2005 radiator over flow! I feel ripped off.Why would this kit not have a very common vehicle fitting?? Why can't I contact the company? Why does it only let me leave feedback instead of giving me the info to contact the seller? I just spent 200.00 and it won't help me without spending more money? What a waist of money. I think I am returning it",
      "rating": 1.0,
      "verified": true,
      "author": "Erik W.",
      "helpful_votes": 35,
      "publication_date": 20180620
    },
    {
      "title": "Very useful tool, almost every thing you need for radiator service.",
      "text": "A very good radiator service kit. I will probably never use every cap they provided, but the system works excellent. I have serviced 7 radiators with this kit since I bought it and I a certain it has prevented me from two come-back issues because I was able to find the root problem, not just the customer reported symptom. I did have to buy an adapter to service 1 inch deep filler necks and caps.",
      "rating": 5.0,
      "verified": true,
      "author": "Mashka",
      "helpful_votes": 7,
      "publication_date": 20180703
    },
    {
      "title": "Best pressure testi kit I've ever used!",
      "text": "I own a repair shop and we have been searching for a good pressure testing kit for a long time. We have tried out several different brands over the years and never had much luck. They were either hard to use, didn't work well or didn't have the adapter we needed. So far this kit has been excellent. We bought the few extra adapters that don't come in the kit. So far we have used it on multiple years and models of Jaguar, Land Rover, Audi, BMW, Mercedes, VW, MINI, Lexus, Acura, Bentley, Volvo, and Porsche. Has worked perfect everytime. Couldn't be happier with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Lilly",
      "helpful_votes": 2,
      "publication_date": 20200207
    },
    {
      "title": "Wish it worked like everyone else's",
      "text": "I love astros equipment but I just cannot get this thing to fill a system without introducing air. It pulls a vacuum fine and flattens the hoses but filling is a different story. The pressure tester works great and all the caps seem to be air tight as far as I can tell. I'm going to re teflon all my fittings and maybe retry it but I've gone back to my lisle no spill funnel for filling and bleeding for the meantime.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Must for mechanics",
      "text": "I use it all the time to fill and check for leaks. Haven't had a car it won't fit. Nothing has given me a problem or a head ache since I got this set. A must for mechanics who like to save money on tools. Or go to snap on and buy just the pump with regular adapter and no more. For the same price",
      "rating": 5.0,
      "verified": true,
      "author": "Paul s",
      "helpful_votes": 4,
      "publication_date": 20170315
    },
    {
      "title": "Poor instructions for those unfamiliar with tools of this type.",
      "text": "Fairly complete kit although it seems to lack a couple of adapters for late model Ford and GM products which are are available as \"accessories\". Instructions are poorly translated into English and overall limited if you don't have experience with this type of tool you may struggle a bit, not so much with pressure testing, which is pretty self-explanatory, but using the system to purge and refill cooling systems. The build quality seems pretty good for an imported tool so I'll give it 5 stars for now.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 3,
      "publication_date": 20180319
    },
    {
      "title": "Excellence",
      "text": "This kit has not let me down. I read some bad reviews on here but my kit has performed perfectly. Im a master tech and for the money what you get really cant be beat. Matco wanted over 600 bucks for a master type kit and it doesnt even come with a refill / purge tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeramy Peterson",
      "helpful_votes": 2,
      "publication_date": 20190209
    },
    {
      "title": "Awesome quality, this thing is sweet",
      "text": "Awesome quality, this thing is sweet! Better product than most of the stuff on the tool trucks. Used in a busy commercial setting. Only down side is everyone in the shop wants to borrow it! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 3,
      "publication_date": 20170430
    },
    {
      "title": "Already saved me more than it costs to buy it",
      "text": "I used this tool to find a leak on a Subaru Forester. It took less than 10 minutes to find the leak. The longest part was removing the bottom engine cover to pinpoint the spot where the leak was.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark G",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Great kit",
      "text": "Excellent kit, it fits all the equipment that I own. Great service excellent price.",
      "rating": 5.0,
      "verified": true,
      "author": "Allen Cutler",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Complete set of adaptors",
      "text": "Astro78585 cooling system test kitis the most complete kit i ever had. Good quality, many accessories for a complete cooling system test.",
      "rating": 5.0,
      "verified": true,
      "author": "frank",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "A",
      "text": "No problems. Ran into a few vehicles the instructions didnt specify. No problems with actual product",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Cowtails",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Comprehensive and well made",
      "text": "Great tool set. It has worked on every application that I have needed it on. Well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan K",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "I've been using this daily in an auto repair shop ...",
      "text": "I've been using this daily in an auto repair shop. It's a real time saver with the vacuum fill. It's holding up well to frequent use.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Thompson",
      "helpful_votes": 3,
      "publication_date": 20160819
    },
    {
      "title": "Recommended",
      "text": "I haven't used it yet , but it looks like a good quality, feels like good quality, but i was shocked by how big it is , item as described, snd it has been received with no damage as far as i know from what i've seen so far , but only time and usage will tell",
      "rating": 5.0,
      "verified": true,
      "author": "Mustafa saghah",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Great kit.",
      "text": "Have not had a chance to use the suction unit of on this kit but over all has all the parts you could need. Sturdy kit doesn’t feel cheap and is worth the money when it comes to test equipment (you get what you pay for)",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Professional level quality",
      "text": "The quality and coverage of this kit is unmatched. I'm a professional technician and I'm confident I will never have to buy another pressure test or vacuum fill kit the rest of my career.",
      "rating": 5.0,
      "verified": true,
      "author": "james",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "All inclusive",
      "text": "Great all inclusive radiator/coolant pressure test and vacuum fill kit. Exactly what was needed. Covers every car ive encountered so far and ive been using this for 2 years. Havent tried on 2017 and up vehicles tho",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Great set",
      "text": "Worked great, although I thought these were the aluminum ones. Even though these aren't aluminum they seem solid.",
      "rating": 5.0,
      "verified": true,
      "author": "Devin",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Repackaged junk",
      "text": "The item I received was not an actuall Astro pneumatic product but installed a repacked knock off. I’ve ordered a replacement and as long as this next one is right I’ll change my review but at this point I would say pick a different one.",
      "rating": 1.0,
      "verified": true,
      "author": "Dalton C.",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Nice!!!!",
      "text": "Nice set. Not for sure why they don’t just include the other 3 caps in the kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Weibrecht",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "A lot of applications",
      "text": "I have only used this a few times, but this helps find coolant leaks fast. I think the pump should have been made of metal, but I think it will hold up if it isn't thrown around and abused.",
      "rating": 5.0,
      "verified": true,
      "author": "Leonard D. H",
      "helpful_votes": 5,
      "publication_date": 20130831
    },
    {
      "title": "Very good value for money",
      "text": "For the amount of money you are paying for this kit its worth its weight in gold. The only issue I had was a leaking fitting with vacuum coolant evacuator. A simple fibre washer and a couple wrenches fixed this problem. All fittings are nicely coloured, and made of high quality plastic. Would recommend to any technician who is sick of worn out shop tools.",
      "rating": 4.0,
      "verified": true,
      "author": "Dylan",
      "helpful_votes": 4,
      "publication_date": 20130920
    },
    {
      "title": "Astro coolant kit",
      "text": "This package is huge you have been warned and I love the contents in it!!! Very diverse, but I have not used it yet. Well further update!!",
      "rating": 5.0,
      "verified": true,
      "author": "stone yang",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Great Tool",
      "text": "Great Kit. I did have to replace one of the hose clamps with a different style hose clamp from my drawer (due to a small leak). Other than that, the adapters, vacuum drain/fill, and pressure testers all worked very well right out of the box. The kit seems to be well made and well worth the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Smith",
      "helpful_votes": 4,
      "publication_date": 20130119
    },
    {
      "title": "Used it the first day I received and worked perfect.",
      "text": "Everything was just starting as described. Used it the first day I received and worked perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "David J",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Great tool",
      "text": "I work at a dealership. I us this tester every day I have had it about a month and it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Graham",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Great tool!",
      "text": "I was looking for a radiator pressure tester and Vacuum filler kit and I almost purchased the Mityvac tool and then I found this one which has just about every adapter you could imagine for about the same price. I have used this tool a few times now and it works awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 5,
      "publication_date": 20121206
    },
    {
      "title": "Tools for the Mechanically Minded.",
      "text": "Ordered by a man for a mechanical man. Great tool kit for those that want the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "Complete Set!",
      "text": "This is a very comprehensive tool kit for servicing cooling systems. It works very well and is easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave E",
      "helpful_votes": 0,
      "publication_date": 20130528
    },
    {
      "title": "This set of tools is perfect for all the vehicles we work on",
      "text": "This set of tools is perfect for all the vehicles we work on. Highly recommend this product to any auto repair shop",
      "rating": 5.0,
      "verified": true,
      "author": "Cyrus Martinez",
      "helpful_votes": 0,
      "publication_date": 20151107
    },
    {
      "title": "Very comprehensive kit!",
      "text": "I borrowed a smaller version of this kit for a recent cooling system repair, I was sold on the tool. I spent the extra on this kit to get the vacuum purger and the cap testers, as well as many more adapters. I'll check back once I e had a chance to use the kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim N",
      "helpful_votes": 3,
      "publication_date": 20160320
    },
    {
      "title": "Great kit!",
      "text": "This kit has paid for itself many times over. I use it in a professional shop and it has garnered me many jobs by quickly finding leaks. have yet to use the filling portion of the kit as I think its sort of silly. The pressure side of the kit is well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Leesan",
      "helpful_votes": 3,
      "publication_date": 20150527
    },
    {
      "title": "Excellent Kit",
      "text": "This kit is well made and has just about every adapter you will ever need. I work as a professional mechanic and it's very nice to not worry about what's coming in the door, I know I can pressure test it.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Davies",
      "helpful_votes": 3,
      "publication_date": 20151114
    },
    {
      "title": "Astro Pnuematic Tool Customer Service is EXCEPTIONAL!",
      "text": "CPO was easy to work with and I spoke to a customer service professional at Astro Pnuematic Tool about a small concern and was extremely please with their willingness to listen and provide a perfect solution. I have owned many of their products over the years and have been well pleased. Their Customer Service is exceptional! I use my tools professionally in my business to maintain a small fleet of cars and trucks.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 2,
      "publication_date": 20160221
    },
    {
      "title": "professional mechanic",
      "text": "I work in general automotive and have used this kit for 2 years now. You can always find a way to connect. The best part of this kit is the refiling system which cost 200 dollars alone from other manufacturers. The refilling system is a tad slower due to the 3/8 line they use, instead of the 3/4 line I have seen but it still works really fast, when compared to funnel filling. The kit has held up well considering that the other mechanics in my shop have stopped using their own equipment to use mine. I would recommend this kit to anyone, and if anything happens to mine I would not hesitate to order another.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd R.",
      "helpful_votes": 13,
      "publication_date": 20140405
    },
    {
      "title": "bmw tech",
      "text": "it is a awsome kit, high quality has everything you could possiably need for most domestic and foreign vehicles, beats snap ons kit any day",
      "rating": 5.0,
      "verified": true,
      "author": "J. Gorglione",
      "helpful_votes": 12,
      "publication_date": 20110412
    },
    {
      "title": "Product Good, but Too Many Useless Adpaters in the Kit for North American Cars",
      "text": "The good is that it works. It rarely leaks unless you move the connector too much so it is fairly reliable at providing leak results. The vacuum filler work impressively, too. While I recommend the product and brand, I don't recommend the kit. The reason is that 3 of the adapters do almost all the cars in North America. The remaining dozen or so adapter are for car manufacturers I have never heard of. Perhaps there are utility vehicles and trucks that these can work with, but most automobiles only use the 3 main sizes. All the adapters are there but I did have to make one with a pipe in order to do one test.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Grimes",
      "helpful_votes": 10,
      "publication_date": 20150929
    },
    {
      "title": "Very pleased",
      "text": "Recipient pleased (purchased as a xmas gift). He's an auto mechanic. He hasn't used it yet, but says looks like high quality.",
      "rating": 4.0,
      "verified": true,
      "author": "David Ranalli",
      "helpful_votes": 0,
      "publication_date": 20150112
    },
    {
      "title": "received faster than expected",
      "text": "Have not used the system as of yet but have been using this same companies tools for the past 5 years, actually wore out one adapter.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin B.",
      "helpful_votes": 0,
      "publication_date": 20140213
    },
    {
      "title": "Works great, buy from Astro and skip Subprime",
      "text": "I use this product several times weekly, and it meets or exceeds all of my expectations for the price. The vacuum fill system supplied with this kit is some what slower than one with a larger hose, but it is actually a good thing. This slightly longer fill time allows you to make sure you don't run out of coolant! The only reason this product does not get 5 stars is due customer service issues that have been developing with Amazon. I am a professional mechanic that has purchased many items from Amazon, but those times look to be coming to a close. This item can be bought directly from Astro, skip Subprime.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristen Wright",
      "helpful_votes": 3,
      "publication_date": 20160712
    },
    {
      "title": "Test every radiator known to man !",
      "text": "This set does seem to have an adapter for every occasion. It also has some weird vacuum adapter thingy for flushing or purging or ?? Never have figured out what it is supposed to do, but the basic pressure tester works very well, made of quality stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Laryh",
      "helpful_votes": 2,
      "publication_date": 20150320
    },
    {
      "title": "Five Stars",
      "text": "Works great for our shop and a great price. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160304
    },
    {
      "title": "not so hot",
      "text": "I bought this item cause it had all the attachments I repair cars for a living the first one I USED ON was an infinity pretty simple just one of the steel round caps had a leak on pipe in the rear of head tore it down replaced steel gaskets and then pressure tested again would not hold pressure looked all over could not find a leak 20 minutes later sprayed soapy water on quick connect at cap and could not beileve all the bubbles would not recomend if you need to hold pressure cause is doesn't.",
      "rating": 1.0,
      "verified": true,
      "author": "scotty rwc. ca",
      "helpful_votes": 7,
      "publication_date": 20121017
    },
    {
      "title": "junk set for the price you pay. i was ...",
      "text": "junk set for the price you pay. i was bouncing between this and a matco set for around the same price. i should have went with the matco all day long. the box this thing comes in is huge. the blow molded case barely fits on my self. spend about the same or a little more and get a quality tool. mine seems to leak down even on vehicles i know for a fact don't have cooling issues. JUNK!!",
      "rating": 1.0,
      "verified": true,
      "author": "Tom692",
      "helpful_votes": 4,
      "publication_date": 20160822
    },
    {
      "title": "Five Stars",
      "text": "Excellent product. Must tool to have for late model cars, especially the Fords.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "The most complete tester around",
      "text": "I personally have not used it .I did look one over locally I bought it for my son in Reno he has used it and all the guys where he works want one too . It has an awesome variety of adapters for every car so far that's come in he really was happy to get it and is very please at the quality of construction of the tester. He works in a automotive shop with other 10 guys so there is a lot of work coming thru and it really dose the job. Worth every dollar spent that's Andy's story and he is sticking to it. !!",
      "rating": 5.0,
      "verified": true,
      "author": "David A. Jacob",
      "helpful_votes": 0,
      "publication_date": 20140127
    }
  ],
  "product_meta": {
    "title": "Astro Pneumatic Tool 78585 Universal Radiator Pressure Tester & Vacuum Type Cooling System Kit",
    "description": "This “Radiator Pressure Tester And Vacuum Type Cooling System Kit” allows easy testing for leakage in radiator system and quick change of coolant. Its color coded radiator test caps make it easy to choose the suitable test cap for the job. The set includes: pressure testing pump with hose, quick coupler with pressure release, and gauge: test range 0 - 35 psi (0 - 2.5 bar), (1) blue and (1) black radiator cap test adapters to test for original radiator cap leakage, (17) test caps for testing cooling systems on most domestic and import vehicles, vacuum type cooling system purge and refill tool kit for quick change of coolant, universal adapter and temperature gauge.\n\nFROM THE MANUFACTURER\nThe Astro Pneumatic 78585 - Radiator Pressure Tester & Vacuum Type Cooling System Kit with 78581 Adapter allows easy testing for leakage in radiator system and quick change of coolant. Color coded radiator test caps make it easy to choose the suitable test cap for the job and special design of vacuum purge & refill tool connection fits nearly all types of radiator opening. Unit is suitable for domestic and import vehicles. Set includes: Pressure Testing Pump with Hose, Quick Coupler with Pressure Release, and Gauge - Test Range 0 - 35 psi (0 - 2.5 bar); 1-Piece. Blue and 1-Piece. Black Radiator Cap Test Adapters to test for original radiator cap leakage; 17-Pieces. Test Caps for testing cooling systems on most domestic and import vehicles; Vacuum Type Cooling System Purge and Refill Tool Kit for quick change of coolant; Universal Adapter; Temperature Gauge and Blow Molded Case.",
    "rating": 4.5,
    "feature_bullets": [
      "Unit is suitable for domestic and import vehicles",
      "Special design of vacuum purge and refill tool connection fits nearly all types of radiator openings",
      "Blow molded case"
    ],
    "specifications": {
      "Manufacturer": "Astro Pneumatic Tool Co",
      "Part Number": "78585",
      "Item Weight": "12.5 pounds",
      "Item model number": "78585",
      "Is Discontinued By Manufacturer": "No",
      "Material": "Metal, plastic",
      "Power Source": "Corded-electric",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "1 Year",
      "ASIN": "B0042KOK28",
      "Customer Reviews": "4.5 out of 5 stars118 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#68,698 in Automotive",
      "Date First Available": "September 9, 2010"
    },
    "categories": [
      "Pressure & Vacuum Testers",
      "Tools & Home Improvement",
      "Tools & Equipment",
      "Diagnostic, Test & Measurement Tools",
      "Automotive"
    ],
    "price": 206.95
  }
}