{
  "website_summaries": [
    {
      "verdict": "One of the most popular hobby boomerangs ever, the Yanaki has great hover for easy catches. It's not a great pick for beginners, though.",
      "pros": [
        "Handcrafted wooden design",
        "Made from airplane-grade plywood",
        "Very visible paint job",
        "Floats",
        "Best for throwing in open fields",
        "Travels pretty far and does return, once you get the hang of it"
      ],
      "cons": [
        "This boomerang can break if it hits hard surfaces with too much force, so it's recommended you use it in open grassy fields",
        "For right-handed throwers only"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Light,Sturdy,Returns!",
      "text": "Returns well to you! I'm no expert on throwing technique, but it repeatedly comes close to you! Just throw hard at about an 75 degree angle. Just came in today, took it out over lunch break along with some others that I bought on here and this one flew the best! I included a video to show you. That was the second throw of the boomerang :D",
      "rating": 5.0,
      "verified": true,
      "author": "Michael H. Pettit",
      "helpful_votes": 4,
      "publication_date": 20180627
    },
    {
      "title": "Best ever!",
      "text": "This is awesome! It came with info on how to’s, and it’s survived my husband and his younger cousins practicing on it (it even went through a barn and only had a minor little scratch). Quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "No Hard Surfaces",
      "text": "Pros: Fairly easy to learn for a frisbee player. Travels far and looks really cool. Cons: A few small scrapes when it landed in a track (throwing on a football field) and some noticeable chips when it collided with a telephone wire at a high speed.",
      "rating": 3.0,
      "verified": true,
      "author": "MLG2",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Fun, but only if you have an area with a lot of space",
      "text": "We couldn't get it to return to us, but that was probably user error. It still worked out okay because the kids chased wherever it landed. We had hours of fun with this in the field behind our house. The kids didn't even notice they were exercising. You definitely need a lot of space. This is made from wood and definitely flies very far. If we weren't in a field I am sure this would've broke a window or ended up on a roof.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Pasquale",
      "helpful_votes": 0,
      "publication_date": 20161023
    },
    {
      "title": "Ahh the simple pleasure of throwing something.",
      "text": "Way too much fun for 20 bucks. Give yourself some room in a big field away from trees because after some practice it makes a bigger loop than you might think. I can't quite get it to return to me but it's because I don't understand using the wind and I'm new to this, but I get better every time I go out and throw.",
      "rating": 4.0,
      "verified": true,
      "author": "Arthur",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Worth the money",
      "text": "My husband and 9 yr old son have a blast with this boomerang! I’m so glad I bought it. You do need a very large area and it takes practice but that’s part of the fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeh ",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Pretty good little beginner boomerang",
      "text": "Pretty good little beginner boomerang. Works fine and come back like it's supposed to. The rainbow colors on this one are pretty cool while it's flying.",
      "rating": 5.0,
      "verified": true,
      "author": "D.Fortier",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "GREAT BOOMERAND .. good quality and it flies far.",
      "text": "My son got to throw it only once and lost it :/ this tells me that this is a good boomerang. It goes far .. he was happy with it. It was a good purchase. Perfect size , nice colors , very light , I would say is great for kids and adults .",
      "rating": 5.0,
      "verified": true,
      "author": "Ghassan S.",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "Awesome first-timer boomerang",
      "text": "Awesome first-timer boomerang. It takes a few days of practice to get better at it. It does return to you if you throw it right. It also can fly up to 50+ feet. Would definitely get another one if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Frederick",
      "helpful_votes": 0,
      "publication_date": 20150321
    },
    {
      "title": "Really works!",
      "text": "Got this as a gift for a friend who was wanting to learn how to throw a boomerang. This was the first boomerang I've ever used, and I cannot believe how well it works. It really does swing around and come back to you! Very cool indeed.",
      "rating": 5.0,
      "verified": true,
      "author": "Dirtt Coyote",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "Thought it would be a cool gift, but the kids really expect this boomerang ...",
      "text": "Thought it would be a cool gift, but the kids really expect this boomerang to come back and it just doesn't!!! You have the throw it the right way and it kind of arches back towards you, but nowhere close!",
      "rating": 1.0,
      "verified": true,
      "author": "Whynotaskjane",
      "helpful_votes": 0,
      "publication_date": 20150807
    },
    {
      "title": "Cool purchase!",
      "text": "I loved this boomerang and thought it was relatively easy to pickup. Just make sure to play with it in a wide open space and it should be fine!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "best xmas present ever ..",
      "text": "those were my son's words upon receiving this item from Santa ! It does fly very well and once you get the technique down it does come back to you. My son likes to throw it toward the ground and then watch it curve back up into the sky. Excellent quality item.",
      "rating": 5.0,
      "verified": true,
      "author": "Carole Meeter",
      "helpful_votes": 0,
      "publication_date": 20140114
    },
    {
      "title": "Great buy",
      "text": "My son is still learning how to use it, but loves it so far.",
      "rating": 5.0,
      "verified": true,
      "author": "hlmccull",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "Great Boomerang",
      "text": "If you love to Rang then this is a great Rang to enjoy. My son loved mine so much I got him his own when he left home!",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel W. Boren",
      "helpful_votes": 0,
      "publication_date": 20170715
    },
    {
      "title": "We have spent a good bit of time getting it out of different trees ...",
      "text": "You need a wide open space to play with this, it really goes a long way. We have spent a good bit of time getting it out of different trees but that's our fault. Nice boomerang.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Smith",
      "helpful_votes": 0,
      "publication_date": 20160920
    },
    {
      "title": "Cool product",
      "text": "My 11 year old son purchased this boomerang. He loves it. We went to a wide open area to practice. It took about 15 throws before he caught one. The booklet is very helpful. He is hooked on his boomerang!",
      "rating": 4.0,
      "verified": true,
      "author": "Alissa K",
      "helpful_votes": 3,
      "publication_date": 20131017
    },
    {
      "title": "Durable and fun",
      "text": "Tricky to get used to but once you start to understand how it works, it starts to work pretty well. Lots of fun.",
      "rating": 4.0,
      "verified": true,
      "author": "TRAPHYK",
      "helpful_votes": 0,
      "publication_date": 20160305
    },
    {
      "title": "Broke in 2 after 30 minutes.",
      "text": "My daughter and I took this to a field to learn how to throw it. Within 30 minutes it had broken in 2 pieces. It is made out of poor quality laminate plywood, and literally started falling apart after the 2nd throw. Unless you already know how to throw a boomerang, this is NOT the one to learn on, it is far too fragile.",
      "rating": 1.0,
      "verified": true,
      "author": "ML Richards",
      "helpful_votes": 8,
      "publication_date": 20140703
    },
    {
      "title": "Lots of fun",
      "text": "This is as much fun as I've ever had with a boomerang. I don't know what the varied design does for flight but I'm well pleased with this one. I'd buy another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Eman",
      "helpful_votes": 2,
      "publication_date": 20130902
    },
    {
      "title": "Great boomerang, bad luck :(",
      "text": "Loved this boomerang butttttttt got it stuck in a tree after about two weeks of play. It was great while it lasted, strong sturdy build and excellent flight and control for a beginner I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Jonezy",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Wonderful",
      "text": "Colorful and arrived as described. Cannot wait to give this for a Christmas gift.",
      "rating": 5.0,
      "verified": true,
      "author": "AMF",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "Great Fun",
      "text": "Watching it fly is fun in its self! The shape is strange but it started me on a quest of different style boomerangs. This boomerang is a good flyer and great for person getting started.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy",
      "helpful_votes": 0,
      "publication_date": 20131026
    },
    {
      "title": "hours of healthy fun",
      "text": "another great boomerang from colorado- heftier than the eagle, likes mild to moderate wind, up to 50yd range",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas J. Farruggella",
      "helpful_votes": 2,
      "publication_date": 20150504
    },
    {
      "title": "Very Nice. Works wonderfully and very sturdy",
      "text": "Very Nice. Works wonderfully and very sturdy. On a day with the proper wind conditions it comes right back to you. Got this for my 12 year old and she enjoys it. I often take some turns in throwing it with her.",
      "rating": 5.0,
      "verified": true,
      "author": "Soumitra Mukherji",
      "helpful_votes": 0,
      "publication_date": 20160530
    },
    {
      "title": "Five Stars",
      "text": "made a 9 year old boy very happy on his birthday, just what he wanted!!",
      "rating": 5.0,
      "verified": true,
      "author": "pcefrk80",
      "helpful_votes": 0,
      "publication_date": 20160819
    },
    {
      "title": "fun toy",
      "text": "After watching some youtube videos on how to throw, I took this baby out. Works pretty well on slightly winded days. Good price for just play time.",
      "rating": 5.0,
      "verified": true,
      "author": "SpudLime",
      "helpful_votes": 2,
      "publication_date": 20120425
    },
    {
      "title": "Bike the first day",
      "text": "Broke the first day my grandson used it. The day after Christmas.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "very good quality",
      "text": "Very nice and well made would buy again.. Having fun with it hit trees a couple of times but did not brake.",
      "rating": 5.0,
      "verified": true,
      "author": "enyo",
      "helpful_votes": 0,
      "publication_date": 20140416
    },
    {
      "title": "It flies well and is easy to throw",
      "text": "My stepson loves this boomerang! It flies well and is easy to throw.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie Napolitano",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "It's OK.",
      "text": "I advise anyone buying this boomerang to only use it in a grass field. Its made of wood and is roughly 6mm (.236 in. ) thick. I don't think this boomerang could withstand to many rough landings on concrete or asphalt. As far as that goes, it probably wouldn't take to many hits against a tree. For someone who knows how to use a boomerang it may be alright, but for the beginner I would recommend one made of a more durable material (maybe polymer, if they make them out it). For a beginner I wouldn't recommend this one.",
      "rating": 3.0,
      "verified": true,
      "author": "Desperado",
      "helpful_votes": 2,
      "publication_date": 20140603
    },
    {
      "title": "Not for little kids",
      "text": "I bought this for my 13 year old grandson who was studying about Australia in school. He loves it. Just know that you need a great big area to throw it so you don't accidentally hit someone, break a window, or damage a parked car.",
      "rating": 5.0,
      "verified": true,
      "author": "Marjorie M. Strebe",
      "helpful_votes": 3,
      "publication_date": 20131019
    },
    {
      "title": "Really Comes Back",
      "text": "First boomerang I have ever purchased and it has exceeded my expectations. Takes a little to learn how to play and very beginner friendly. Everybody is amazed when they see this thing fly. Made from wood so avoid playing near concrete or building. Will definitely buy from colorado boomerang again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 11,
      "publication_date": 20130906
    },
    {
      "title": "Great quality. You can definitely get some distance with ...",
      "text": "Great quality. You can definitely get some distance with this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "AverageConsumer",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "One Star",
      "text": "I've had numerous boomerangs but this one just didn't work.",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan D. Howard",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "But it is really lightweight and easy to throw",
      "text": "My 5 year old asked for a boomerang and picked this one. I was worried it would be hard for him to use. But it is really lightweight and easy to throw. We are enjoying it.",
      "rating": 5.0,
      "verified": true,
      "author": "kriggert",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "Good quality.",
      "text": "I tried this with my son and it was challenging. The quality of the product is great. Well done. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "ELVIN REYES",
      "helpful_votes": 0,
      "publication_date": 20140114
    },
    {
      "title": "Really great",
      "text": "I highly recommend you get this boomerang if interested it is worth the money...though you need a lot of space for it to work properly. I've gotten it stuck in multiple 40 ft tall trees 6 times now and just retrieved it from a neighbors tree this evening I am happy to still have it though it is a great outdoors time passer",
      "rating": 5.0,
      "verified": true,
      "author": "Rossie Bratten",
      "helpful_votes": 0,
      "publication_date": 20130822
    },
    {
      "title": "Colorado boomerang is too fragile",
      "text": "the Colorado boomerang threw nicely, but it is too fragile. it broke upon hitting a hard surface. not the best for junior high students",
      "rating": 2.0,
      "verified": true,
      "author": "calsnowcdsnow",
      "helpful_votes": 0,
      "publication_date": 20141014
    },
    {
      "title": "Awesome product.",
      "text": "Awesome product.. never had a real boomerang before, there is definitely an art to throwing it. But it is very cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160722
    },
    {
      "title": "Five Stars",
      "text": "Very quick to learn took a little trial and error but was catching it within 20minutes",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick H.",
      "helpful_votes": 0,
      "publication_date": 20141223
    },
    {
      "title": "It broke after 10 minutes",
      "text": "It is nice, it works, but it just got broken after 10 minutes... I understand it could be only in my case",
      "rating": 2.0,
      "verified": true,
      "author": "Carlos Luis Mora Salguero",
      "helpful_votes": 2,
      "publication_date": 20140421
    },
    {
      "title": "Fast shipping & Fun",
      "text": "Fast shipping. Fun activity with good directions. If you have lots of room, this is awesome. Christmas gift for my 10 year old son.",
      "rating": 5.0,
      "verified": true,
      "author": "waltersupnorth",
      "helpful_votes": 0,
      "publication_date": 20140121
    },
    {
      "title": "It really works",
      "text": "It goes a LONG way. It is a little tuff for an 11 year old to master, but it can be done.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20140316
    },
    {
      "title": "Very good it goes very far amd high I love it",
      "text": "Very good it goes very far amd high I love it. The wood does come off it it lands on a hard surface.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle B.",
      "helpful_votes": 0,
      "publication_date": 20160324
    },
    {
      "title": "Great Rang!",
      "text": "Im really happy with this boomerang, absolutely great for beginners, sturdy and and the ideal wrang to open up the door for a more advanced one such as the delicate arch.",
      "rating": 5.0,
      "verified": true,
      "author": "Karl Marvil",
      "helpful_votes": 0,
      "publication_date": 20140218
    },
    {
      "title": "Great purchase",
      "text": "This is definitely high quality! My son loves it and this was a great purchase! The color looks to be spray-painted on and then sealed, so it won't rub off. The boomerang itself is thick quality, not anything you'd pick up in a cheap toy store.",
      "rating": 5.0,
      "verified": true,
      "author": "FamilyOf4",
      "helpful_votes": 0,
      "publication_date": 20150120
    },
    {
      "title": "It's good, however I am left handy",
      "text": "It's good, however I am left handy.lol... So don't forget to see whether it can be used by both hands!",
      "rating": 4.0,
      "verified": true,
      "author": "Zhu Tianming",
      "helpful_votes": 0,
      "publication_date": 20150208
    },
    {
      "title": "Awesome",
      "text": "I'm very happy with my new Colorado Yanaki sports boomerang, it fly's perfect in the lighter winds and I recommend it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "N B",
      "helpful_votes": 6,
      "publication_date": 20131008
    },
    {
      "title": "Colorado Boomerangs are awesome",
      "text": "Colorado Boomerangs are top notch in service and with their products. I am grateful I purchased this product for a multitude of reasons.",
      "rating": 5.0,
      "verified": true,
      "author": "Mph",
      "helpful_votes": 0,
      "publication_date": 20140103
    },
    {
      "title": "Tons of fun",
      "text": "I had some difficult time to master it and learn how to read the wind, but once I got familiar with stuff like lay over and wind direction, IT IS WAY AWESOME",
      "rating": 5.0,
      "verified": true,
      "author": "Abe BG",
      "helpful_votes": 14,
      "publication_date": 20131010
    },
    {
      "title": "Cool Toy",
      "text": "Had fun trying to catch this thing. Trying to throw it in windy oklahoma was a bit of a challenge.",
      "rating": 5.0,
      "verified": true,
      "author": "mrtony7",
      "helpful_votes": 0,
      "publication_date": 20130610
    },
    {
      "title": "Loved it.",
      "text": "Loved it. Got it stuck in the only tree in the park. I'll never forget you mr boomerang. I want another.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 4,
      "publication_date": 20130501
    },
    {
      "title": "Yes, it really comes back",
      "text": "It took me awhile to get it down, but with the right wind conditions I can throw it and actually catch it about half the time. It's definitely entertaining watching it fly far away and loop back to me. I'd recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20130825
    },
    {
      "title": "Boomerang That Works",
      "text": "My teenaged son loves it. He and his friends spend hours playing with it. Need a very large field to use it though.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan J Hartman",
      "helpful_votes": 0,
      "publication_date": 20140623
    },
    {
      "title": "A",
      "text": "Works great. Need a lot of space. Great colors making it easier to find. Wish I could put more time into mastering technique!",
      "rating": 4.0,
      "verified": true,
      "author": "Gregory Lewis",
      "helpful_votes": 0,
      "publication_date": 20140403
    },
    {
      "title": "Nice",
      "text": "I bought this as a gift to one of my closest friends and I must say that he absolutely loved it! I'm sure that there are better ones out there, but this one is definitely a great buy. I even had a few chances to throw it and I had a lot of fun! This would be great for anyone just starting out!",
      "rating": 5.0,
      "verified": true,
      "author": "EmanBandy",
      "helpful_votes": 13,
      "publication_date": 20121027
    },
    {
      "title": "Five Stars",
      "text": "dont know how to get it to come back to you always got to chase it",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth Lee Robison Jr",
      "helpful_votes": 0,
      "publication_date": 20140804
    },
    {
      "title": "Great product",
      "text": "Favorite for a beginning use. Absolutely love it. Durable and hold up well. Make sure you know what you are doing before you throw it.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Arends",
      "helpful_votes": 0,
      "publication_date": 20131211
    },
    {
      "title": "USA Made Boomerang",
      "text": "Very pretty, good craftsmanship and made in the USA. It kept me coming back to use -- essentially what boomerang's do.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Carmichael",
      "helpful_votes": 16,
      "publication_date": 20111121
    },
    {
      "title": "Amazing!",
      "text": "Ive taken it out three or four times now and I love it. I managed to catch it a half a dozen times the first time I took it out. My only complaint is that it already has a small chip on it and some of the paint has scratched off. Other than that though I would highly recommend it for other beginners.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 6,
      "publication_date": 20120712
    },
    {
      "title": "Bad to the bone",
      "text": "Really flies. A lot of fun to watch my hubby throw it. Go by the book, and don't give up. It's well worth the practice. Very well-made by a great company! We also have the Zebra colored boomerang, which works great as well. Awesome aerodynamics. It's a fun way to get exercise as well. Believe on the Lord Jesus Christ and you will be saved - Acts 16:31.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Miller",
      "helpful_votes": 0,
      "publication_date": 20140420
    },
    {
      "title": "Won't fly",
      "text": "The boomerang is very pretty but it won't fly for me. I put it up on my wall and took out my other boomerang. I use it on the beach but it should still cut the wind and turn. Maybe I just have a bad one I am buying another model.",
      "rating": 1.0,
      "verified": true,
      "author": "eagle",
      "helpful_votes": 0,
      "publication_date": 20130905
    },
    {
      "title": "Great toy!",
      "text": "I purchased this boomerang for my son and he and all his friends have really enjoyed it. It is extremely well made and appears that the quality material will make it last a long time - if we can keep it out of the trees! Great toy!",
      "rating": 5.0,
      "verified": true,
      "author": "R. McElroy",
      "helpful_votes": 26,
      "publication_date": 20110616
    },
    {
      "title": "not good for kids",
      "text": "i brought for my daughter, she can't do that, its kind of big and heavy for her.i don;t know it will be good for other people.",
      "rating": 3.0,
      "verified": true,
      "author": "mure",
      "helpful_votes": 2,
      "publication_date": 20120831
    }
  ],
  "product_meta": {
    "title": "Yanaki Boomerang",
    "rating": 4.1,
    "feature_bullets": [
      "Includes our \"How to Throw Boomerangs\" Instructions for Free!"
    ],
    "specifications": {
      "Product Dimensions": "14 x 0.5 x 9 inches",
      "Item Weight": "2.39 ounces",
      "ASIN": "B004IG5WIC",
      "Item model number": "Yanaki",
      "Manufacturer recommended age": "9 - 10 years",
      "Best Sellers Rank": "#144,587 in Sports & Outdoors",
      "Customer Reviews": "4.1 out of 5 stars127 ratings4.1 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "9 - 10 years",
      "Manufacturer": "Colorado Boomerangs"
    },
    "categories": [
      "Toys & Games",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Boomerangs",
      "Outdoor Games & Activities",
      "Leisure Sports & Game Room"
    ],
    "price": 24.95
  }
}