{
  "website_summaries": [
    {
      "verdict": "Clearly the best Casio out there right now, and one of the best graphing calculators period.",
      "pros": [
        "Plenty of functions, good color display, USB connectivity, and a handy joystick for navigation"
      ],
      "cons": [
        "Drains batteries quickly",
        "it would be wise to also buy a power adapter or rechargeable batteries"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Always better and more intuitive than TI.",
      "text": "Despite my instructor only teaching with Texas Instruments, I can always figure out how to use casio. I especially love their scientific calculators where I am able to solve algebraic equations and determining true/false equation. Even some simple distribution problems and the layout...its too much. ABSOLUTELY better than TI i do not know why Casio is not the standard...",
      "rating": 5.0,
      "verified": true,
      "author": "Russ Rissman",
      "helpful_votes": 2,
      "publication_date": 20170501
    },
    {
      "title": "It is so easy to use",
      "text": "I'm working my way through college mathematics (currently in Statistics and Calculus), and this calculator has never let me down. It is so easy to use, that it usually takes me less than a minute to figure out (or research) how to perform an operation while the rest of the class struggles with their ancient TI calculators. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Jon B",
      "helpful_votes": 5,
      "publication_date": 20151215
    },
    {
      "title": "It’s a must have",
      "text": "This is my primary calculator now. I have a ti84 ce plus but I’ve found this to be easier to locate programs for my calculations The numbered keys are difficult to view but after a few weeks on non stop calculus You’ll eventually find everything you need with ease And the password feature is the best option on this device",
      "rating": 5.0,
      "verified": true,
      "author": "Watson",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "it works well, and there are youtube tutorials to ...",
      "text": "it works well, and there are youtube tutorials to get familiarized with, but mine came in different from what i ordered. Namely, its blue. obnoxiously blue, and most importantly, it has SCHOOL PROPERTY printed right into the screen in a non removable way. it was new in the box, so at least its legit, i just hope it isnt an issue in the future",
      "rating": 4.0,
      "verified": true,
      "author": "Paul C",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Very nice graphing calculator",
      "text": "I love this calculator. I have not had this very long but there are two things I really like. One is that I can enter fractions and radical symbols exactly like I do on paper which is much easier for me to read and keep track of. The other thing that I like is that when graphing multiple functions, they are drawn in different colors so I can compare them to each other... very nice. 8/4/2018 - I've had this calculator for two years now and it is still my favorite. I've used it through two calculus classes and it has been great. The latest firmware update gave it some 3D capability which was cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Donnie A.",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "Meh",
      "text": "It's in color and it looks like it can do everything I need BUT I have zero knowledge on how to use it. Youtube is no help either. Might have to buy another calculator.",
      "rating": 3.0,
      "verified": true,
      "author": "Peacekeeper76",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Meh...",
      "text": "The first one I received was dead on arrival. The calculator is definitely pretty, with the black and brushed aluminum, but the curved key rows don't make it easy to enter data quickly. Also, I'm not a fan of everything being printed on the key faces. That's likely to cause problems (fading) under heavy usage. I ended up trading this one for a Model FX-9860GII. I'm really glad I did. The Model FX-9860GII is the best calculator I've ever used.",
      "rating": 3.0,
      "verified": true,
      "author": "SirPags",
      "helpful_votes": 5,
      "publication_date": 20150109
    },
    {
      "title": "It is good for financing only",
      "text": "This is a very high end calculator. It is good for financing only. A great brand specialize in this field, The quality it self for the product is fantastic.. Very easy to carried it around. I am okay with the product result.",
      "rating": 4.0,
      "verified": true,
      "author": "drivas909",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "I love this calculator infinitely more than any TI I've come ...",
      "text": "I love this calculator infinitely more than any TI I've come across. The interface is very intuitive though overwhelming at first. The simplification on trigonometric and algebraic functions is bar none. The bright backlight is great for a midnight crammer, and it's extremely versatile and open functionality is amazing. I haven't fully dug through this thing yet, but I have a feeling this one will still be with me when I'm writing out my dissertation.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan A.",
      "helpful_votes": 0,
      "publication_date": 20160517
    },
    {
      "title": "Perfect calculator...",
      "text": "For me this is the best Casio calculator, looks are amazing and the capabilities are the same as the Casio Fx CG50. The latter doesn't look as good and it has a bit more cpu speed. Function wise they are the same...",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Azcué",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Best calculator I've owned",
      "text": "Best calculator I've owned, extremely user-friendly. It may look confusing at first but it gets really easy to use once you get the hang of it. Two of my favorite features is that it factors and can solve imaginary numbers (a+bi). UPDATE: After using this in school and playing around with it I've noticed this thing is an absolute monster. It does conversions (like time, mass, energy, etc.) and also easily input programs either yourself or via computer, regardless this is an absolute life saver and highly recommend over any TI product on the market. It is very, very easy to use, it just requires a bit of exploration throughout its features.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20160922
    },
    {
      "title": "This is my favorite graphing calculator",
      "text": "This is my favorite graphing calculator. The print is easy to read. The keyboard is fairly easy to read (good color scheme), and can easily be memorized. I understand it has 3000+ functions, which would be plenty for most math needs. Most of them can be intuitively found. It doesn't have CAS or 3D graphing. It's brother the CP 400 has those two functions (but as near as I can tell, the print on the CP 400 is quite small; and the cost for one is quite a bit more than for a Prizm).",
      "rating": 5.0,
      "verified": true,
      "author": "ted hessel",
      "helpful_votes": 0,
      "publication_date": 20151017
    },
    {
      "title": "CASIO fx-CG10 Calculator",
      "text": "I needed a calculator like the students that I tutor. I ordered this Casio fx-CG10 like they use. It works perfectly and is easy to use. It has contrasting colors to show different lines, etc. that are graphed simultaneously. It has many functions that are useful and easy to see.",
      "rating": 5.0,
      "verified": true,
      "author": "gcb",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Make sure to update.",
      "text": "This is a powerhouse calculator. It has an awesome color display, and it performs calculations fast. The only thing I don't like is that the keys are not backlit. One thing to note though, the calculator I got had version 1.02 of the operating system. Go to the Casio education website and update the calculator to the latest os version.That way you can use the more advanced add on.",
      "rating": 5.0,
      "verified": true,
      "author": "Cary",
      "helpful_votes": 0,
      "publication_date": 20150612
    },
    {
      "title": "Near Excellent",
      "text": "Basically got myself a tiny machine here. I absolutely love this calculator, it's easy to navigate, long lasting battery life and very practical color display. It also doesn't lag except for the annoying graph mode where navigating seems kinda like it's re-plotting the whole graph again as you move around. That's the only drawback here. All in all, it's a wonderful machine",
      "rating": 5.0,
      "verified": true,
      "author": "Ik",
      "helpful_votes": 0,
      "publication_date": 20140708
    },
    {
      "title": "Great!",
      "text": "Product arrived earlier than expected and in excellent packaging. It looks like it's in brand new condition. Takes a little bit of time to learn all the functions but once you do it makes all your equations a breeze to graph. This is the first calculator I have bought for college and I'm pretty sure it'll be the last.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Barnes",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Best calculator I've ever owned",
      "text": "This thing is amazing for my classes. Very easy to learn and use. The color display is wonderful for telling different functions apart. Though I would highly recommend downloading Eigenmath from Cemetech, it's very useful if you're taking a calculus course or a calculus based course.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Sepulveda",
      "helpful_votes": 0,
      "publication_date": 20171004
    },
    {
      "title": "Fast, reliable, colorful, easy to use",
      "text": "This calculator is much better than its TI contestants. The display is bright, large and the colors really help visualize graphs efficiently. The buttons are a joy - large and comfortable. I have got two of them so far - one for line input and another one for math input. I love it. I really do. I hope CASIO develops a product that does 3D graphing. PRIZM 3D? I don't want to use a TI-89. Thank you CASIO.",
      "rating": 5.0,
      "verified": true,
      "author": "Red Panda",
      "helpful_votes": 0,
      "publication_date": 20120429
    },
    {
      "title": "Meets needs of high school freshman",
      "text": "Grandaughter, high school freshman, required by math teacher to get this model. She is finding it easy to use and adequate after one week of of ownership.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert R. Dimock",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Nice calculator and really powerful",
      "text": "This is a classical CASIO tool with all the functionality you need for school and college",
      "rating": 5.0,
      "verified": true,
      "author": "Jgutierrez",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "This is my all time favorite calculator. It's so universal and IT HAS COLOR",
      "text": "This is my all time favorite calculator. It's so universal and IT HAS COLOR! Only downside is now I forgot how to do mental math lol.",
      "rating": 5.0,
      "verified": true,
      "author": "ammaresh venkataramappa",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "So easy to use, best interface",
      "text": "This calculator is a killer, super fast, very easy to use, I have owned a lot of graphic calculator, voyage 200, ti-82,84,85,92, nspire cas, HP39,48G,48GII,49. this casio can do anything except cas. it can plot things like y>x+3 and make it so clear on the screen, big help to my high school kid.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140923
    },
    {
      "title": "The calculator's already broken after only a few times use ...",
      "text": "The calculator's already broken after only a few times use. I found out that it could be because the batteries provided with the calculator was expired and we didn't notice it before we put them in the calculator. When we opened the batteries cover, there was fluid from the batteries.",
      "rating": 1.0,
      "verified": true,
      "author": "Tung",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Awesome calculator",
      "text": "My favorite feature is being able to store notes. The periodic table is awesome too. It takes a minute to get used to the calculator, and I’m still learning. Everyday I discover a new feature that makes my classes a little easier",
      "rating": 5.0,
      "verified": true,
      "author": "Shaina",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Five Stars",
      "text": "One of the best calculator for SAT. The good value for money!",
      "rating": 5.0,
      "verified": true,
      "author": "Yury",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "Very nice graphing calculator",
      "text": "Very nice graphing calculator. Color screen is great. Font size is easy on the eyes. Much faster than TI 83 and 84 calculators. Lots of functions available on same page makes is very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Easy to use and easy to learn",
      "text": "This calculator is absolutely easy to use. At first, I had some difficulty because I previously owned a TI-83. However, I am so happy I made the switch because the Prizm is more convenient and helpful. I used it on the SAT only a month after getting it and I had no problems. I take AP Calculus so this calculator is perfect. It looks intimidating but if you are willing to learn, you will learn. It just takes practice. The colored graphs are so pretty too!",
      "rating": 5.0,
      "verified": true,
      "author": "Besarta Lekperaj",
      "helpful_votes": 0,
      "publication_date": 20141012
    },
    {
      "title": "Good calculator",
      "text": "This graphing calculator is working great, But the screen is sensitive of scratches so be careful. I gave this product 4 stars because i bought this for 100 bucks, A colored graphing calculator at this price should have a high quality screen. Overall i'm OK with it because the scratches didn't affect the display at all.",
      "rating": 4.0,
      "verified": true,
      "author": "Azoz",
      "helpful_votes": 0,
      "publication_date": 20140330
    },
    {
      "title": "I love this calculator!",
      "text": "I legit live by this calculator! I totally love it! I recommend for all algebra, calculus, trigonometry, and all higher math courses! It will definitely come in handy!",
      "rating": 5.0,
      "verified": true,
      "author": "W Jones",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "Do not waste your money",
      "text": "Do not buy it, its so complicated to use. I just bought it to solve for me 4 unknowns and it didnt ... it was all the time invalid. Also it didnt make me a table of functions",
      "rating": 1.0,
      "verified": true,
      "author": "Algadair, B.",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Amazing !",
      "text": "The calculator arrived in really good shape and really quickly . It has been an essential tool for my academic life making it 1000x easier. The graphs are really neatly drawn",
      "rating": 5.0,
      "verified": true,
      "author": "Erin ",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Best.  Calculator.  Ever.",
      "text": "I've had this calculator for quite a long time now, and I'm still figuring out new functions. It really is amazing though. It's a step away from your old TI-83 and towards using a tablet as a calculator. The LCD screen is super crisp, and it's a lot easier to edit mistypes and the like. This calculator has been my best investment thus far throughout Calculus/Trig.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20121026
    },
    {
      "title": "I love the calculator but unfortunately the display was a bit ...",
      "text": "I love the calculator but unfortunately the display was a bit scratched when it arrived. It was a pity because the item is great. I do not know when it happened. I sent it to a hotel in Vancouver and it could have been at customs, or in the hotel. Be careful when you ask for a fragile item.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "Was really impressed with how intuitive this calculator is. ...",
      "text": "Was really impressed with how intuitive this calculator is. And the color screen makes it so much easier to differentiate what is being graphed when you're working with more than one function.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Linke",
      "helpful_votes": 0,
      "publication_date": 20150904
    },
    {
      "title": "Great!",
      "text": "This calculator is allowed by all U.S schools (college included) I checked with my college director and yes they are allowed and they perform better than anything I have ever seen! Just read the description for details!",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20140528
    },
    {
      "title": "Awesome calculator!",
      "text": "Nothing to dislike actually. Only thing I don't like is that when you graph functions like f(x)=log(x), the line gets cut. It doesn't \"tend\" to infinite, it just stops due to the screen don't having enough resolution. Otherwise, great gadget!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sebas",
      "helpful_votes": 0,
      "publication_date": 20130911
    },
    {
      "title": "Excellent So Far",
      "text": "I'm a Computer Science student which requires many math courses and so far this calculator has done everything I've needed it to do. The color is really nice and the buttons are well-placed. Most other students and instructors use the Texas Instrument calculators but I'm proud of mine because I can come up with correct answers faster than they can and I paid less. No regrets on my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20140105
    },
    {
      "title": "High quality product, packed with features!",
      "text": "Amazingly good product. My son loves it. His Math teacher also loved it! Packed with features, and easy to use, and looks very good too.",
      "rating": 5.0,
      "verified": true,
      "author": "SI",
      "helpful_votes": 0,
      "publication_date": 20151204
    },
    {
      "title": "Great, simple to use calculator!",
      "text": "Great calculator! I used this throughout high school and plan on using through college. I'm not very big into math (or very good at it) so this simple to use calculator was a life saver!",
      "rating": 5.0,
      "verified": true,
      "author": "Kam",
      "helpful_votes": 0,
      "publication_date": 20150714
    },
    {
      "title": "Amazing calculator. I would recommend this to any high ...",
      "text": "The calculator works perfectly. Amazing calculator. I would recommend this to any high school or college student",
      "rating": 5.0,
      "verified": true,
      "author": "firdous",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "Great Calculator",
      "text": "If you're looking for something a bit cheaper then a TI color model this is the thing you're looking for! It's a bit harder to follow along in class as the teachers usually use the TI models; but if you're in a class that requires a calculator like this you're probably smart enough to figure it out.",
      "rating": 5.0,
      "verified": true,
      "author": "Isaac",
      "helpful_votes": 2,
      "publication_date": 20141110
    },
    {
      "title": "Good product",
      "text": "This calculator is great for Pre Calculus, and Calc class, and it is great for statistics class, great for Physics. Teachers told me to get a TI calculator because that's what they know how to use and they could help me learn it, but the Casio Prizm is so intuitive that no teaching is necessary. It is good for all of standardized tests (AP, ACT, SAT, SAT II) I have used it on them and it is great. But I never have owned a TI calculator so I can't say for sure that this one is better. Only con is that it doesn't do 3D graphing..",
      "rating": 5.0,
      "verified": true,
      "author": "Terrence Burkhalter",
      "helpful_votes": 0,
      "publication_date": 20121208
    },
    {
      "title": "Great graphing calculator, as an engineering major, I chose wisely.",
      "text": "Excellent calculator, I am an engineering major. I am entering my senior year at university and can say with absolute certainty that this calculator has improved my GPA. I am able to save formulas into this calculator if I am having trouble memorizing them. Some of my professors say that graphing calculators are not allowed, but have not given me trouble for using this (so long as I am quiet about it). If need be, you can put this into test mode in order to limit its capabilities, and any teacher/professor should be satisfied by this, as you cannot simply switch back and forth.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanner Morgan",
      "helpful_votes": 2,
      "publication_date": 20170521
    },
    {
      "title": "Amazing product, has a lot of additional functionality",
      "text": "Is a great product, the screen is good and nice. You can download add ins for CAS, games and other utilities. Is really nice and kind of easy to understand if you read the manual.",
      "rating": 5.0,
      "verified": true,
      "author": "Roberto astudillo",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "Extremely useful",
      "text": "Seriously an amazing calculator, it can do all you could ever ask in a calculator and more.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Very helpful",
      "text": "I purchased this calculator for my high school senior daughter who is currently taking AP Calculus. she loves it and said that the students are getting much higher grades on their exams, thanks to this calculator.",
      "rating": 5.0,
      "verified": true,
      "author": "Alina Platonova",
      "helpful_votes": 0,
      "publication_date": 20130111
    },
    {
      "title": "Works great",
      "text": "The Casio Prizm FX-CG10 color graphing Calculator is very user friendly. Battery life not so good. Small price to pay for such a good product. Of all the choice's to pick from, Casio's the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Brett Gendreau",
      "helpful_votes": 0,
      "publication_date": 20121014
    },
    {
      "title": "Big Help for College Level Math Student",
      "text": "Although I purchased this device 'used' it was in excellent condition. Casio has lots of printable instructions and tutorials to help you get full function of every feature.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms Love Blue",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "I love the screen",
      "text": "This is the calculator brand to get. I love the screen, ease of use and the battery life. My wife has all TI calculators and there are sometimes three times the amount of steps to perform when doing calculations or equations or functions.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20150928
    },
    {
      "title": "Four Stars",
      "text": "Good product! Easy to use and vary adaptable. Esecially like the ability to graph implicit relasti0ns",
      "rating": 4.0,
      "verified": true,
      "author": "Paul Foerster",
      "helpful_votes": 0,
      "publication_date": 20140907
    },
    {
      "title": "great calculator",
      "text": "just what he needed for ACTs! and it arrived in 2 days.",
      "rating": 5.0,
      "verified": true,
      "author": "Tightwadmom",
      "helpful_votes": 0,
      "publication_date": 20160609
    },
    {
      "title": "Best Calculator",
      "text": "I think most of the people buying this calculator have already used it before, so there's not a lot to say. From a college student's view, this is a perfect calculator, with colorful graphs and very useful equation and polynomial solver.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Olko",
      "helpful_votes": 0,
      "publication_date": 20121125
    },
    {
      "title": "Prizm FX-CG10 Color Graphing Calculator",
      "text": "Have had several different calculators and I liked the design on this because of the color screen. I have a TI-89 Titanium that is a great calculator but very small display. I think Casio has done a nice job overall. My only complaints would be that the keys are soft to the touch and there is essentially no user's manual only an insert with minimal information. You can go to the website and download a manual but printing 100+ pages is expensive.",
      "rating": 4.0,
      "verified": true,
      "author": "radpnp",
      "helpful_votes": 2,
      "publication_date": 20110922
    },
    {
      "title": "Four Stars",
      "text": "Reason of giving it 4 start is that I received it with leaking batteries.",
      "rating": 4.0,
      "verified": true,
      "author": "Fz",
      "helpful_votes": 0,
      "publication_date": 20141115
    },
    {
      "title": "Excellent product.",
      "text": "I ordered this calculator as it was on my son's school supplies list. Its a good product and met the expectations we had. No complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Anj",
      "helpful_votes": 0,
      "publication_date": 20130907
    },
    {
      "title": "I bought this for my grandson, a junior in ...",
      "text": "I bought this for my grandson, a junior in high school. He raves about it. He says it does everthing he expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Kelly",
      "helpful_votes": 0,
      "publication_date": 20141021
    },
    {
      "title": "Strongly recommend it: go for it",
      "text": "The product was perfect. Very useful calculator, I strongly recommend it. You can download calculator's manual for free on internet (as well some functions)",
      "rating": 5.0,
      "verified": true,
      "author": "Renzo Adriano",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "Very useful. It is worth my money (*≧∇≦*)",
      "text": "Very useful. It is worth my money (*≧∇≦*). I'm not surprising because Casio always bring the best product to custumers. Highly recommed !!! If only every school in America commonly use Casio calculator instead of Texas Intrument... (>_<)",
      "rating": 5.0,
      "verified": true,
      "author": "Bui Ngoc Thanh  Nguyen",
      "helpful_votes": 0,
      "publication_date": 20150204
    },
    {
      "title": "it is the most useful calculation for the Math section on the",
      "text": "This calculator is a must have for anyone taking higher math classes. Also, it is the most useful calculation for the Math section on the ACT/SAT",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "Love it",
      "text": "The best Calculator I have ever owned. It does everything. And the things it doesn't do people have made programs for which are available to download online!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "great",
      "text": "I'm new to using this. Still learning how to use it.great product",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas V",
      "helpful_votes": 0,
      "publication_date": 20150519
    },
    {
      "title": "works fine",
      "text": "my son needed it for his calculus class, no problems or complaints. from a teen that is a rave review!",
      "rating": 5.0,
      "verified": true,
      "author": "grump",
      "helpful_votes": 0,
      "publication_date": 20131113
    },
    {
      "title": "Five Stars",
      "text": "What a great Calculator. I fall in love with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Great Calculator But Disappointing Color",
      "text": "Really good functioning calculator, but its blue and I asked for black and now all my math teachers think I stole their calculators!",
      "rating": 4.0,
      "verified": true,
      "author": "Jagan Medicherla",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "jwessner",
      "text": "I bought this for my high school daughter. She had a Texas Instrument brand the year before and it just quit working. This was a quite a bit different than the other one, but she caught on quit to it. Very easy to use. She loves this calculator; wouldn't trade it. Great for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "jwessner",
      "helpful_votes": 4,
      "publication_date": 20111116
    },
    {
      "title": "Samsung Prizm Calculator",
      "text": "The item was delivered in excelent condition in a very timely manner. As far as function, my daughter hasn't gotten to the point of needing it yet, but when she does, I expect it to work as intended. It was highly recommended by her teacher.",
      "rating": 5.0,
      "verified": true,
      "author": "TC-Countryboy",
      "helpful_votes": 0,
      "publication_date": 20130918
    },
    {
      "title": "... as my last one (got stolen with my backpack) great product all I need now is a new backpack",
      "text": "Exactly the same as my last one (got stolen with my backpack) great product all I need now is a new backpack LOL",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick H.",
      "helpful_votes": 0,
      "publication_date": 20150301
    },
    {
      "title": "Five Stars",
      "text": "This is just what I wanted. Fast delivery even charged a lot but it's worth.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay Chang",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "15 year old loves it",
      "text": "I'm not really a math person so I wouldn't begin to know how to use this calculator but let me tell you,,,,,,,my 15 year old son told me this one was recommended by his Algebra teacher. His teacher told them if they could to go out and buy this that it would help them in school and for their regents exam. My son has been using this since October and he absolutely loves it. He tells me it's amazing and he hopes it lasts him through college. I definitely recommend this calculator.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20131206
    },
    {
      "title": "Better Than TI",
      "text": "This calculator is better than ti. It is able to go sooooo much faster and doesn't take forever to graph a function. Also I love the fact that it is able to able to solve inequalities without imputing it into matrices and using Cramer's Rule.",
      "rating": 5.0,
      "verified": true,
      "author": "Yuhui W.",
      "helpful_votes": 0,
      "publication_date": 20141009
    },
    {
      "title": "i love",
      "text": "This Calculator is a monster. It is very clear and it can solve a lot .i love it",
      "rating": 5.0,
      "verified": true,
      "author": "ali",
      "helpful_votes": 0,
      "publication_date": 20140924
    },
    {
      "title": "Excellent calculator very good.",
      "text": "This is a very good calculator has really been helpful recommend very good product quality and operation and performance and very good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Hugo",
      "helpful_votes": 0,
      "publication_date": 20131119
    },
    {
      "title": "the best",
      "text": "i love this calculator!!!!!! it does everything for you in math.if your bad at math and good at math you should get this.",
      "rating": 5.0,
      "verified": true,
      "author": "Karo",
      "helpful_votes": 0,
      "publication_date": 20131002
    },
    {
      "title": "Five Stars",
      "text": "MY son found it very useful for his SAT exam preparation.",
      "rating": 5.0,
      "verified": true,
      "author": "abdelmohsen",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "This calculator is absoluely amazing! I like this a whole lot better than ...",
      "text": "This calculator is absoluely amazing! I like this a whole lot better than the TI-84. You don't have to press any many buttons to complete the same operation. 5 out of 5 from me.",
      "rating": 5.0,
      "verified": true,
      "author": "Latrelle W. B. ",
      "helpful_votes": 2,
      "publication_date": 20150315
    },
    {
      "title": "don't hesitate",
      "text": "casio calculators are easier to use at a more affordable price. Well worth the investment",
      "rating": 5.0,
      "verified": true,
      "author": "Karl Dahlke",
      "helpful_votes": 0,
      "publication_date": 20141023
    },
    {
      "title": "Casio is the Best",
      "text": "Casios are fast, beautiful, incredibly easy to use, and have the most efficient UI to ever exist in any graphing calculator. HPs are horrible, with an archaic UI that requires 2 or more steps to do exactly what the Casio can do. It's faster, the screen is excellent, math is displayed exactly how you would write it out on paper ... what's not to love?",
      "rating": 5.0,
      "verified": true,
      "author": "Donabed C. Kopoian",
      "helpful_votes": 0,
      "publication_date": 20140513
    },
    {
      "title": "Product was described corectly",
      "text": "The product was described correctly, also was shipped fast, but it had a little scratch, so that i think is not important, so i relly recomended",
      "rating": 5.0,
      "verified": true,
      "author": "Dfsd_22",
      "helpful_votes": 0,
      "publication_date": 20130318
    },
    {
      "title": "Excellent Calculator",
      "text": "The calculator does everything it says it does. The colours are excellent. Unfortunately it is just slightly slower than the Casio-fxGII, a black and white calculator with the same UI. Overall I am very happy.",
      "rating": 4.0,
      "verified": true,
      "author": "Frederi",
      "helpful_votes": 0,
      "publication_date": 20121018
    },
    {
      "title": "Awesome!",
      "text": "This amazing calculator is strongly recommended for high school or college students who are taking math courses. Yes, I also like TI or HP calculators but this affordable calculator is very easy to use and it is powerful and easy on the eyes with the color screen.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Lee",
      "helpful_votes": 0,
      "publication_date": 20111203
    },
    {
      "title": "new style of calculator",
      "text": "The new pixma is brilliant to use. The layout has been well thought out and very easy to work with. Using the graphing function makes a huge difference as the colour screen makes it a pleasure to use especially when more than one function is graphed at the same time. You can also use the supplied cable to show these graphs on a computer screen. I would like Casio to have included CAS to bring the calculator up to the level of the top TEXAS and HP calculators. Also, the calculator does not seem as quick as the fx-9860G11.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul Mallon",
      "helpful_votes": 5,
      "publication_date": 20110402
    },
    {
      "title": "Four Stars",
      "text": "Great calculator although it freezes up sometimes... it shouldn't do that.",
      "rating": 4.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 0,
      "publication_date": 20151003
    },
    {
      "title": "Grandson loves it",
      "text": "I bought it for my grandson as he is graduating this year and taking advanced classes, and he says it really does the job. He will use it all through college, well worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Edith Palmer",
      "helpful_votes": 0,
      "publication_date": 20131006
    },
    {
      "title": "Best calculator I ever had.",
      "text": "It surpassed my expectations. I mean it does everything that I want it to do and even more. It simply leaves TI back in the dust.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20131114
    },
    {
      "title": "Prizm fx cg10 color graphing calculator.",
      "text": "I like this calculator. It is easy to use. Nice for plotting graphs. I use it to solve math problems. Highly recommended.",
      "rating": 4.0,
      "verified": true,
      "author": "sansoble",
      "helpful_votes": 2,
      "publication_date": 20131101
    },
    {
      "title": "Five Stars",
      "text": "Just as described. Very Quick Shipping! Thank you for a quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Poole",
      "helpful_votes": 0,
      "publication_date": 20150722
    },
    {
      "title": "AMAZING!",
      "text": "The package arrived in time and in perfect conditions! I had an awesome feed back, I completely recomend to buy with this guy!",
      "rating": 5.0,
      "verified": true,
      "author": "German",
      "helpful_votes": 0,
      "publication_date": 20130222
    },
    {
      "title": "Great calculator!",
      "text": "I bought two , one for each of my children, as they were taking the ACT . It was easy to learn , and it was very helpful for the test . So glad I invested in it.",
      "rating": 5.0,
      "verified": true,
      "author": "me",
      "helpful_votes": 0,
      "publication_date": 20121216
    },
    {
      "title": "Five Stars",
      "text": "great calculator - superior features to most of the TI series calculators, and less expensive too!",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20151027
    },
    {
      "title": "Love it",
      "text": "Great calculator for courses that involve graphing and basic algebra",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160208
    },
    {
      "title": "Excellent product",
      "text": "Just what I wanted for university. Top of the range product not available in NZ when I purchased it for cheaper than NZ offers when available.",
      "rating": 5.0,
      "verified": true,
      "author": "M. J. Simpson",
      "helpful_votes": 0,
      "publication_date": 20130107
    },
    {
      "title": "Get it, got it Great!",
      "text": "Lowest cost and came right when they promised brand new still in factory sealed container, cheaper than the used ones too! Get it, got it Great!",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Winegarner",
      "helpful_votes": 0,
      "publication_date": 20140328
    },
    {
      "title": "Best Calculator!",
      "text": "I ordered this for my Alg2/Trig class. It saved my life! Easy to use, great product. It helped me a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20130514
    },
    {
      "title": "great deal, product is everything it said it",
      "text": "fast delivery, great deal, product is everything it said it was",
      "rating": 5.0,
      "verified": true,
      "author": "Dark Hadou",
      "helpful_votes": 0,
      "publication_date": 20150302
    },
    {
      "title": "quite impressive",
      "text": "i totally recommend this calculator for IB and University students. It is a very useful tool, with many capabilities, it is an example of the latest technology!!",
      "rating": 4.0,
      "verified": true,
      "author": "Ion",
      "helpful_votes": 0,
      "publication_date": 20131029
    },
    {
      "title": "Powerful learning tool",
      "text": "I bought this for my 10th son for use in HS Algebra. What an amazing tool. It allows the student to get instant feedback via the graphing feature on changes to mathematical equations. For the student it helps them to understand what an equation means visually with the graphing feature. The ability to graph multiple equations at once allows for better understanding of what some simple changes to slope, y intercept of other components of an equation can do. The \"calculator\" is on the pricey side so only buy it if you intend to use its functionality.",
      "rating": 4.0,
      "verified": true,
      "author": "Wheels",
      "helpful_votes": 2,
      "publication_date": 20111020
    },
    {
      "title": "Great Display",
      "text": "Considering my vision is not as good as it used to be, the color display really helps reading the numbers, graphs, etc. Even though the programming capability is limited, the other functions (e.g., spreadsheet, lists) work well; although, they are also limited, such as the lack of standard deviation in the spreadsheet. Overall, however, I use this calculator more than the numerous others (mostly HP) that I own because of the display visibility.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas R. Scott",
      "helpful_votes": 27,
      "publication_date": 20110204
    },
    {
      "title": "Lovely",
      "text": "I loved it ,it is a great calculator for a good prize and useful ,amazing design for students that makes my job easy!Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Derya",
      "helpful_votes": 0,
      "publication_date": 20140214
    },
    {
      "title": "Five Stars",
      "text": "The Prism is much better than my last TI calculator and will follow me through college.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Geelhood",
      "helpful_votes": 0,
      "publication_date": 20150115
    },
    {
      "title": "It's good",
      "text": "the caculatir is Fast shipped and good for use. It can be a bit complex when first use, but convinient after getting used to it",
      "rating": 5.0,
      "verified": true,
      "author": "Yukito",
      "helpful_votes": 0,
      "publication_date": 20130320
    }
  ],
  "product_meta": {
    "title": "Casio FX-CG10 PRIZM Color Graphing Calculator (Black)",
    "description": "Color:Black| Style:Standard\n\nCASIO FX-CG10 PRIZM GRAPHING CALCULATOR\nMove beyond black and white to see math in full color! The PRIZM is a revolutionary graphing calculator with patent-pending features that will enhance understanding of even the most complex mathematics. PRIZM allows for a new way to learn math by enabling students to experiment with concepts utilizing real-life images. This leads to the creation of their own mathematical understanding relationships by creating graphs on their own. \n\nSUGGESTED COURSES\nThe fx-CG10 PRIZM is designed to support all users in the following courses:\n\n * Pre-Algebra\n * Algebra I & II\n * Geometry\n * Trigonometry \n * AP Calculus\n * AP Statistics\n * Biology\n * Chemistry\n * Physics\n * Business & Finance\n\nEXAM ALLOWANCE\n The CASIO fx-CG10 PRIZM graphing calculator is permitted for use on the PSAT/NMSQT, SAT and ACT college entrance exams and AP tests.\n\nHARDWARE FEATURES\nCasio’s user-oriented hardware design comes loaded with all the powerful classroom functionality you need in an intuitive, easy-to-use interface that is quick and simple for students to master. \n\nHIGH RESOLUTION LCD\n The fx-CG10 PRIZM features a sharp, crisp high-resolution LCD display with over 65,000 colors assuring larger and even sharper images of graphs, formulas and graphics. \n\nHIGH-SPEED CPU\n The fx-CG10 PRIZM accelerated processing speed is approximately three to five times faster than conventional models. Lengthy calculations and complex graphics are produced with immediate ease. This greatly increases the efficiency of both its operation and student learning. \n\nUSB CONNECTIVITY\nThe fx-CG10 PRIZM comes with a USB cable, unit-to-unit cable and Program-Link Software for high-speed data communication between a PC and the unit, or unit-to-unit data communication so program exchange can be performed immediately when you turn the unit on. \n\nSOFTWARE FEATURES\nCasio’s intuitive software design facilitates a student’s grasp of mathematical concepts by encouraging student engagement with mathematics rather than memorization of keys to effectively promote student success.\n\nFUNCTIONALITY & KEY FEATURES\nSome of the functionality you will find in the fx-CG10 PRIZM includes: \n\n * Easy to use, Icon-Based Menu System\n * Dynamic Graphing\n * Dual Graph & Table Display\n * Natural Input and output of Inequalitiy graphs \n * Natural Display allows entry and output of mathematics just like in a textbook\n * Built-in spreadsheet application\n * In-Depth Conics application\n * Pre-loaded Geometry application\n * USB connectivity\n * 1.5MB of flash memory / 62KB RAM\n * 140 hours of battery life (AAA x 4)\n * Pre-loaded Geometry Application\n * Downloadable Quick Reference Guide\n\nAnd much more!",
    "rating": 4.7,
    "feature_bullets": [
      "Full-color LCD screen - bursting with over 65,000 brilliant colors with a spacious 3.7\" LCD Screen - over 82,000 pixels (384 x 216)",
      "Users can create graphs over pictures of real-life scenes to better understand mathematical functions",
      "Color-Link and conditional formatting for graphs, charts and spreadsheet formatting",
      "Casio \"Picture Plot\" Technology - infusing real images into math",
      "16MB maximum storage memory capacity and Requires 4 AAA batteries",
      "Color graphs",
      "PC link port",
      "3.7 inch color display",
      "Fraction key",
      "Complex number calc"
    ],
    "specifications": {
      "Product Dimensions": "11.18 x 7.21 x 2.05 inches",
      "Item Weight": "8 ounces",
      "Manufacturer": "CASIO",
      "ASIN": "B00481K4KS",
      "Item model number": "FX-CG10",
      "Batteries": "4 AAA batteries required.",
      "Customer Reviews": "4.7 out of 5 stars274 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#113,975 in Office Products",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 7, 2010"
    },
    "categories": [
      "Office Products",
      "Calculators",
      "Graphing",
      "Office Electronics"
    ],
    "price": ""
  }
}