{
  "website_summaries": [
    {
      "verdict": "An affordable set of aluminum pans for those who want nonstick quality and don't mind the smaller sizes.",
      "pros": [
        "Made of quality anodized aluminum",
        "Two types of finish for two types of cooking",
        "Easy to clean"
      ],
      "cons": [
        "These pans are smaller than some other contenders",
        "The usual Teflon-related precautions must be taken"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Confusing description",
      "text": "In the description it was difficult to determine if the two finishes - slide or sear - were combined in these pans or if you were ordering one slide and one sear. Neither of these things are true. Each of these pans have the slide finish. The Calphalon packaging for this double set makes it sound as if you are getting one of each, so I can understand why the Amazon description is confusing. The quality of the pans is excellent and the sear feature isn't a top priority for me. The four stars instead of five is because of the confusion created by the description.",
      "rating": 4.0,
      "verified": true,
      "author": "Retired Teacher",
      "helpful_votes": 5,
      "publication_date": 20170326
    },
    {
      "title": "Has withstood high heat cooking.",
      "text": "My elderly mother lives with my family. She always abuses pans by heating them up at a super high heat and sometimes leaving them on too long. I'm constantly buying pots and pans. This is a heavy duty pan and my second purchase. The non stick surface has held up to her abuse and is now her go to pan Tomane eggs.",
      "rating": 5.0,
      "verified": true,
      "author": "Claude",
      "helpful_votes": 8,
      "publication_date": 20160524
    },
    {
      "title": "Excellent nonstick pans that LAST",
      "text": "I've had these for nearly 5 years and absolutely love them to this day! They are just as nonstick as when I first bought them. I use them only for foods I want to not stick to the pan (aka I never try to sear anything in these pans) like eggs. They are super easy to clean, have a solid weight but aren't too heavy, and have lasted well. They have some small scratches in the pan from times when I have foolishly used a metal tool to get something out, but that's on me. You should stick to silicone spatulas or wooden tools with these pans. 10/10 would reccomend!",
      "rating": 5.0,
      "verified": true,
      "author": "Eliza Schreibman",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "Pans themselves great, but...",
      "text": "I purchased the 8 and 10 inch set. The pans themselves are great. The only thing I disliked was the lids from my other Calphalon stainless (Accucore series) fry pans don't fit these pans, and they don't come with their own lids either. Seems like the same size pan from the same company would have interchangeable lids.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180101
    },
    {
      "title": "EXCELLENT PRODUCT",
      "text": "I've owed this EXACT product set for about 5 years... and just re-purchased it. Obviously, the surfaces of non-stick skillet-pans can't continue as perfect forever ( I cook with them almost every day). This Calphalon Unison is the best and longest-lasting NONSTICK I've used to date - which is why I looked to replace with the exact same thing. THANKS VERY MUCH TO AMAZON THAT IT'S AVAILABLE.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane M.",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Happy going back to Calphalon",
      "text": "So I tried the whole cast iron and carbon steel thing, but both my wife and I didn't like the extra weight in the kitchen, especially in the 12 inch size. So after reluctantly returning some De Buyer pans, I decided on the Unison line. I had previously owned the contemporary line, and can definitely tell the difference in quality. I wanted the carbon steel thing to work, but it just wasn't practical for my family.",
      "rating": 5.0,
      "verified": true,
      "author": "ryanweid",
      "helpful_votes": 5,
      "publication_date": 20160830
    },
    {
      "title": "Silicone Only",
      "text": "I have owned this set for 2 years. Up until last night they were outstanding pans. I have always used only silicone utensils and have had no problems. Last night I used a plastic spoon. Today, my wife and I noticed scratches across the bottom of the 12\" skillet. All my silicone and plastic utensils are high quality Kitchenaid. The coating seems to be very soft. If you buy Calphalon only use silicone and they are great pans.",
      "rating": 3.0,
      "verified": true,
      "author": "Charles Brown",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Started out great, but quickly degraded",
      "text": "The pans were great when they were brand new, but the performance deteriorated rather quickly. My pans lasted 2.5 years before the non stick coating became completely ineffective. I never used metal utensils to cook with either, which these pans can supposedly handle. I'm now trying to figure out how to send them back to Calphalon to see if there warranty will replace them. Of course shipping is at my own expense..",
      "rating": 1.0,
      "verified": true,
      "author": "SK",
      "helpful_votes": 3,
      "publication_date": 20161105
    },
    {
      "title": "Excellent pans! I bought these to replace my previous ...",
      "text": "Excellent pans! I bought these to replace my previous Unison set. I had the first set for a few years and over time the 10” pan lost it’s non stick coating and started to look questionable. The whole outside bottom also looked cracked like dried out desert land... never seen anything like it. I forgot to register my product otherwise I would have tried to claim the warranty. For the price, I highly recommend this set. They are awesome. I can sear my steaks perfectly without them sticking, the 8” cooks my eggs beautifully and both pans clean up with zero effort.",
      "rating": 5.0,
      "verified": true,
      "author": "K.Marie",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "About as good as it gets",
      "text": "Just buy these. I have been cooking for 30+ years and have gone through dozens of frying pans. These are just about perfect. Here is what I mean. They are the perfect weight. Just heavy enough to convect the heat well. The handles are just right. The right length to give you the right leverage to pick up the pan and they don't heat up. The cooking surface is wonderful. Cook, rinse, light wipe and they are clean, over and over and over again. I haven't ever seen pans better than these and for the price on Amazon it really is a no brainer.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Smith",
      "helpful_votes": 2,
      "publication_date": 20140404
    },
    {
      "title": "Good qualtiy frying pans make cooking much easier",
      "text": "These frying pans can be wiped clean with the touch of a paper towel or cloth. They prevent burning and can be used with little or no oil. Heat them on low settings and they quickly become very hot. Calphalon pans hold the heat extremely well and you will find it easy to cook with them. My impression is that they cook food at lower heat settings than other types of frying pans. As with all nonstick pans, it is best to use only nylon or wooden utensils or they will become scratched. These pans can quickly become indispensable. They are fairly heavy, but lighter than cast iron. I hang mine on hooks near the stove.",
      "rating": 5.0,
      "verified": true,
      "author": "Max Lubach",
      "helpful_votes": 0,
      "publication_date": 20151004
    },
    {
      "title": "Disappointed.",
      "text": "After less than a year I am editing this review. Great weight and non-stick surfaces have worked well. Excellent heat distribution. HOWEVER, the non stick surface scratches and actually gouges even though I use only Calphalon implements and hand wash individually. I really baby these pans and I live alone. The latest gouge is deep enough that I am confident it will eventually compromise the integrity of the entire surface. I'm 70 and figured I'd buy the best at last. Now I think I'll outlast these.",
      "rating": 3.0,
      "verified": true,
      "author": "Salguod",
      "helpful_votes": 0,
      "publication_date": 20160611
    },
    {
      "title": "DO NOT USE NON-STICK COOKING SPRAY IN THESE!!",
      "text": "These pans are fabulous! I have had calphalon pans in the past, but i always used non-stick cooking spray in them. The coating in all my former pans eventually disintegrated and i blamed the pans. Then I read a recent article that said the propellant chemicals used in non-stick sprays was corrosive and eventually breaks down and destroys the surface of even the best pans. So, not the pans fault! Now i use a spray bottle that is made for oil and nicely adds that bit of lubrication i like when I cook. And no chemicals! I love these small skillets with confidence now. And they go through the dishwasher just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "sueshire",
      "helpful_votes": 0,
      "publication_date": 20140821
    },
    {
      "title": "Just buy them",
      "text": "These are amazing. I read about them in an article about the 10 best kitchen items and have not been disappointed. They are COMPLETELY non-stick. No matter what you cook in them, just wipe it out and you're good to go. Nice weight. Great handles. 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Ross G.",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "and clean very easily by hand",
      "text": "My husband ordered these along with the Dutch Oven Calphalon pot. He uses them all the time! The are dishwasher safe, oven safe, study, and clean very easily by hand, as well. No way he would send these back. He's been a Calphalon fan for many years. The warranty can be beat either. If there's a problem, you send it back and they replace the product.... for life.",
      "rating": 5.0,
      "verified": true,
      "author": "Belm",
      "helpful_votes": 0,
      "publication_date": 20170602
    },
    {
      "title": "Muscle building weight",
      "text": "The 10\" pan is very heavy in comparison to the Calphalon pan I've used in the past. Although this may not seem like a big deal, it is cumbersome to flip food over in such a heavy pan. Curiously, the larger pan is comparable in weight to other pans it's size. These are great pans with easy clean up, but think twice about purchasing unless you're trying to build muscles as you cook.",
      "rating": 3.0,
      "verified": true,
      "author": "OD",
      "helpful_votes": 0,
      "publication_date": 20171020
    },
    {
      "title": "Great value for quality cookware",
      "text": "These are great heavy weight pans. Although I'm not typically a big fan of non-stick (that's what butter is for...) I do like these for the ease of clean up and the overall cooking ability. Sometimes you just want to be able to swish the pan out with a little soapy water and with these that's easily done. Because they're heavy, they will take a bit longer to heat but it's well worth the wait. They cook evenly and brown well. Omelets are a breeze. The price will fluctuate on Amazon. I paid less than $50 and feel I got a great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "PrimoCat",
      "helpful_votes": 0,
      "publication_date": 20151013
    },
    {
      "title": "Short lasting coating",
      "text": "I've never been so disappointed in a coating on a baking pan as I was this. I have a set of Calphalon that is used everyday since 2001 and still releases great. I bought this set to replace the most used ones after 13 years. The 8\" pan coating failed quickly like I've never seen. The 10\"' still works fine. The pan is sturdy, but I wouldn't but they tried pulling a fast one with a poor coating",
      "rating": 1.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 4,
      "publication_date": 20150516
    },
    {
      "title": "Coating chipped on first use in 8 inch pan",
      "text": "Regrettably, the nonstick coating chipped in 1/8\" to 3/16\" on the inside of the 8\" pan upon first use. Pan was not overheated or abused. I would have preferred to send it back to amazon but since it arrived as a 2-pan set, this was a hassle to send both. Overall, the pans are very strong mechanically, have very thick bottoms which will not warp and do indeed provide very even heat distribution for cooking. Clean up is very easy as expected. Too bad about the single defect.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael R. Haley",
      "helpful_votes": 3,
      "publication_date": 20130807
    },
    {
      "title": "Expected Better",
      "text": "The 10\" fry pan had a chip in the interior coating when I received it So far it has not spread, however the 8\" has lost coating that is about 1/4\" wide and 2\" long allowing food to stick. For the cost of these I had expected better.",
      "rating": 2.0,
      "verified": true,
      "author": "Ralph Ewing",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "The 10 inch pan was not non-stick. We cooked ...",
      "text": "The 10 inch pan was not non-stick. We cooked a steak at medium high heat, the steak stuck to the pan and left a black residue that won't come off. I've used Calphalon pans for years and have never had a problem.",
      "rating": 1.0,
      "verified": true,
      "author": "minna42",
      "helpful_votes": 2,
      "publication_date": 20180301
    },
    {
      "title": "Great Pans, double check for dents",
      "text": "I ordered these pans and they came quick. However, the first set of pans had a huge scratch mark on the inside. I returned it and asked for a replacement. The second set of pans have a dent on the outside. Since the inside of the pans are not damaged, I decided to just keep them. They work really well and cooking is much better, however I can't help but feel that we're getting 2nd tier pans? I have no idea. Just make sure you check carefully after you order.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael D. Lee",
      "helpful_votes": 0,
      "publication_date": 20151013
    },
    {
      "title": "Great pans",
      "text": "My son specifically wanted these as a Christmas gift and I got it for him. He is a great cook and only likes the best type of pans. He uses these pretty much on a daily basis.",
      "rating": 5.0,
      "verified": true,
      "author": "Renata",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "I am disappointed by the lack of staying power with these pans",
      "text": "Similar to others, I am disappointed by the lack of staying power with these pans. Great performance for THREE months. Then peeling problems began. Three months just isn't enough.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Bridge",
      "helpful_votes": 4,
      "publication_date": 20170319
    },
    {
      "title": "Good Heavy pans but not indestructible",
      "text": "These are good, heavy pans and much better the the cheaper Calphalon offerings. Still, the nonstick property of them can't be overheated. I used my 10 inch pan to warm up corn tortillas by putting pan on medium high heat without any oil in it. I soaked the tortilla in water for a minute and put it in the hot pan. The pan didn't warp or anything but after using it that way I notice the nonstick properties have gone down. The pan wasn't blazing hot either. My experience is that these pans do not like being heated without anything in them. That's how i ruined my last one.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Rogers",
      "helpful_votes": 0,
      "publication_date": 20140103
    },
    {
      "title": "Surface has cracks after one month's use",
      "text": "I use the 8\" inch pan every other day for morning sausage and eggs. I was careful to use plastic utensils and let the pan cool before putting in the sink. One month later there are cracks in the surface. These are not scratch marks put deeper cracks in the bottom of the pan. Very disappointed!!!!!!",
      "rating": 2.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 8,
      "publication_date": 20140212
    },
    {
      "title": "Packaging Issues",
      "text": "I had to return the original order due to the fact the pans had scratches on the upper interior portion. The second shipping had the same distinct damage marks but I missed my 30 day window to return. Quite frankly, would have paid the extra $20 at Bed Bath and Beyond for a non-marred package of pans. They will still work for cooking, but I would rather have had them without distinguishing damage marks.",
      "rating": 3.0,
      "verified": true,
      "author": "Lou Lou Louella",
      "helpful_votes": 3,
      "publication_date": 20140619
    },
    {
      "title": "Terrific Nonstick pans!",
      "text": "Searched and searched to find something to replace my All-Clad nonstick frying pan which was well beyond its non-stick use. I was nervous because these are so cheap in comparison to the All-Clad pans, BUT! Oh my goodness, we LOVE these pans. They clean up BEAUTIFULLY, EASILY and I actually like them better than the All-Clad nonstick. Hard to believe, but true. I read the Amazon reviews before I purchased my set...took a leap of faith...and am so pleased that I did.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20141008
    },
    {
      "title": "So happy with these skillets - best non stick ever",
      "text": "I stepped up to these non stick pans and they are working very well for us. Have been using for about a month. I allow them to preheat on medium heat as recommended (even though I'm impatient) and even fried eggs and melted-on cheese release from the pan as I plate the food. This happens with or without any cooking fat. I have not tried them with non stick spray (and don't plan to), I don't want to take any chance of ruining the superb non stick finish.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20151025
    },
    {
      "title": "I absolutely LOVE these pans",
      "text": "I absolutely LOVE these pans! I've been a fan of Calphalon for a long time, but my previous set was not dishwasher safe. I started replacing my old set with these newer dishwasher safe pans and could not be happier! I don't have to use sprays or butter in the pan and they come clean very easily. They have held up well int eh dishwasher and with hand washing. I will absolutely be purchasing more from this line of cookware.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Emry",
      "helpful_votes": 0,
      "publication_date": 20160108
    },
    {
      "title": "Looks like this manufacturer is terrible in QC",
      "text": "I had to ask for a replacement as it came with a 1/8\" wide hole on the surface of the smaller pan. A few days later when the replacement came, there was a visible scratch on the larger pan. I had to return the whole thing and call if off. Looks like this manufacturer is terrible in QC. One star to credit Amazon's fast replacement process.",
      "rating": 1.0,
      "verified": true,
      "author": "Li-chen Lin",
      "helpful_votes": 5,
      "publication_date": 20150127
    },
    {
      "title": "Best I've ever used",
      "text": "Awesome pans. Have used Stainless, Teflon, Aluminum, Cast Iron, all of different grades and costs. This material and pan design makes for fantastic daily use. Now looking for saucepans of the same material.",
      "rating": 5.0,
      "verified": true,
      "author": "Woody",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "Calphalon is the best!",
      "text": "I have owned Calphalon pans for years,and loved them,but never had a small or medium omelette pan. I always bought other non-stick brands,such as TeFal,and Rachael Ray,and I always have to replace them after a year or so,due to wear. I finally bought this Calphalon set, and I am so pleased!! Great weight and stability,even heating,super omelettes....even great for sauteing...and they can go in the oven too...they are my new go-to pans! Why did I wait so long? Never again....if you want the best buy Calphalon...I highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Connell",
      "helpful_votes": 0,
      "publication_date": 20130821
    },
    {
      "title": "Five Stars",
      "text": "Easy to clean. Very even heat distribution. Handle remains cool even when the pan is quite hot. My omelets are perfection and pancakes are easy to flip. This has been a staple in my kitchen for 8 months now and not one complaint after almost daily use.",
      "rating": 5.0,
      "verified": true,
      "author": "Hareem",
      "helpful_votes": 0,
      "publication_date": 20160820
    },
    {
      "title": "Four Stars",
      "text": "These work great but they only last about a year under heavy use... Otherwise it would be five stars.",
      "rating": 4.0,
      "verified": true,
      "author": "angulas",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Great set of pans",
      "text": "Updated a couple of our 20 year old Calphalon frypans. Never used non-stick pans. Really enjoy using these. Eggs slide right off. Meat does not stick. Great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "pgator",
      "helpful_votes": 2,
      "publication_date": 20160824
    },
    {
      "title": "Can't go wrong with Calphalon.",
      "text": "I've always had confidence in Calphalon products. Received both items quickly. The 10 inch pan was perfect however the 12 inch pan looked as if it had been used, two small scorch marks and some dings on the rim. I'm keeping them both as they have always performed very well.",
      "rating": 4.0,
      "verified": true,
      "author": "franklin d. fletcher",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Best pans I've ever owned",
      "text": "Best pans I've ever owned. Very sturdy build without being excessively heavy, and has excellent heat distribution across the surface especially compared to the ceramic coated ones I was using before. My only complaint is that the 8\" and 10\" is measured across the top, while the actual working surface area is only about 6\" and 8\", which is somewhat limiting. The performance is exceptional, though, and I intend to buy a 12\" separately.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20151025
    },
    {
      "title": "Ive never been the kind to drop any kind of ...",
      "text": "Ive never been the kind to drop any kind of decent money on pots and pans (kinda crazy since i cook a lot every day). Well these are INCREDIBLE pans! I genuinely cant see myself going to another brand. I had my concerns when i first opened them, as they looked porous and as if food would get stuck, but nope, a must buy for your kitchen arsenal.",
      "rating": 5.0,
      "verified": true,
      "author": "SF176",
      "helpful_votes": 0,
      "publication_date": 20161005
    },
    {
      "title": "Great quality frying pans!",
      "text": "Awesome quality pans. Very heavy and well made. Some have complained of how heavy these pans are, but I hate cheap, flimsy lightweight pans. My only complaint is that Amazon ships these in a HUGE box without much packing and the first pair of pans were badly scratched.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele M.",
      "helpful_votes": 0,
      "publication_date": 20170126
    },
    {
      "title": "These nonstick skillets are wonderful! I accidently left the smaller one on the ...",
      "text": "These nonstick skillets are wonderful! I accidently left the smaller one on the stove on medium heat for 30 minutes before realizing what I had done. I waited for the pan to cool down and then washed it out like normal and the nonstick coating was fine! I've used these almost daily for a month now and they look just like new! I would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "penguinsdontfly",
      "helpful_votes": 0,
      "publication_date": 20160810
    },
    {
      "title": "Color washing off outside of pan.",
      "text": "I purchased these for hubby as a Christmas gift. They cook well but the color is coming off the bottom/outside of the smaller pan. Each wash more and more comes off. ??? I don't think this is suppose to happen.",
      "rating": 3.0,
      "verified": true,
      "author": "heather",
      "helpful_votes": 3,
      "publication_date": 20170211
    },
    {
      "title": "So much better than the cheap aluminium pans",
      "text": "So much better than the cheap aluminium pans. I do not like spending a lot of money on my cookware overall and these skillets are really a nice and affordable option. While there are less expensive pans, they are also noticeably cheaper in construction and subject to warping. Do yourself a favor, skip the real cheap pans and get something substantial and that will last. These will do just that. As always with coated pans, use nylon spatulas and wood stirs to avoid scratching the Teflon.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorhaiden",
      "helpful_votes": 0,
      "publication_date": 20150414
    },
    {
      "title": "Non-Stick Bottom Corroded in Less than 3 Years",
      "text": "Pans did not even last 3 years. The non-stick bottoms corroded and emit a foul odor onto the food. I never used any abrasive cleaners or pads on the pans.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicole A.",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Great price useful sizes",
      "text": "Great price $39, much cheaper than department stores. Eggs slide out. I'm choosing to not be lazy with these and hand wash them and use no metal tools in them to keep them longer. I scraped up a large unison using metal and tossing it in the dishwasher which made the nonstick less slippery. Learned my lesson. Hand washing is easy enough.",
      "rating": 5.0,
      "verified": true,
      "author": "SensibleSam",
      "helpful_votes": 0,
      "publication_date": 20140103
    },
    {
      "title": "good quality to start with so bought the 8\" also",
      "text": "Started using them about 4 months ago, good quality to start with so bought the 8\" also. The 12\" has started warping to a point that it's now useless. We have a large selection cookware, all quality ranges and now to take care of it... it has not been misused. Did not expect a pan that would last a decade but a few months is not acceptable.",
      "rating": 2.0,
      "verified": true,
      "author": "Alexandra Roux",
      "helpful_votes": 2,
      "publication_date": 20170416
    },
    {
      "title": "Great pans - they cook evenly and clean up super ...",
      "text": "Great pans - they cook evenly and clean up super fast. I have several different pots and pans from Calphalon and really like them. These are the safe \"non-stick\" pans that don't leech harmful substances into your food.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Ward",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "I do enjoy these non-stick pans",
      "text": "I do enjoy these non-stick pans. They cook evenly and are heavy enough for my gas top stove. Be careful not to use kitchen tools that will scratch the surface.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Hall",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "but that's easy since they're non-stick",
      "text": "I use at least one of these almost daily, and haven't had any issues. I hand wash them, but that's easy since they're non-stick...even with eggs. Highly recommend these pans. Sturdy, non-stick is great, sizes are very useful, and the weight feels good to my grip.",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor S",
      "helpful_votes": 0,
      "publication_date": 20150428
    },
    {
      "title": "Then get off the couch and order up a set of these bad boys. Let's face it",
      "text": "Hey, Man Cavers! Tired of cardboard TV dinners? Then get off the couch and order up a set of these bad boys. Let's face it, ever since divorce court our diets could surely improve some, so wipe off the dust on the stove top and heat up a nice, healthy dinner in the Unison frying pan. And who knows, if the female gender didn't work out, well, you can always switch. Just say'n.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert C.",
      "helpful_votes": 0,
      "publication_date": 20150514
    },
    {
      "title": "Very nice",
      "text": "These are not light pans. I have had them only two months, but they are high quality, just wipe clean. I haven't managed to burn anything yet (its inevitable for me). They look like they are going to hold up. I really like them for eggs, Its so cool to just slide them out of the pan without breaking the yolk. I just wish they weren't quite so heavy to lift.",
      "rating": 5.0,
      "verified": true,
      "author": "Paradise",
      "helpful_votes": 0,
      "publication_date": 20140204
    },
    {
      "title": "Wonderful skillets. Also bought because I'm in my 70's ...",
      "text": "Had used one of these at another person's house. Wonderful skillets. Also bought because I'm in my 70's and need lighter weight cookware than my dependably great cast iron items.",
      "rating": 5.0,
      "verified": true,
      "author": "penelope pitstop",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "excellent nonstick pan(s)",
      "text": "MY wife and I use primarily the Calphalon Unison 8\" omelet pan. It is perfect for flipping 2 eggs without a spatula, (I couldn't do it with my previous nonstick pan, the lip curvature was wrong for it.) The pan has gone through the dishwasher several times now, and so far the nonstick surface is as good as new. The bottom is thick enough that it rests flat on the stovetop surface, and does don't bow even with the heat turned on high.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert D. Stringer II",
      "helpful_votes": 0,
      "publication_date": 20130629
    },
    {
      "title": "Perfect!",
      "text": "These are the best pans ever for eggs or any delicate dish. Food just slides off them. Nice and heavy, so even heat, and the handles are conveniently sized and shaped. I don't put these in the dishwasher -- they're incredibly easy to wash and why subject the wonderful finish to harsh treatment. I do hide them from my husband, who thinks everything has to be cooked at the surface temperature of the Sun.",
      "rating": 5.0,
      "verified": true,
      "author": "jca360",
      "helpful_votes": 0,
      "publication_date": 20120824
    },
    {
      "title": "great pans best I've ever had",
      "text": "great pans best I've ever had! I've had 3 different cookware sets in my lifetime and a plethora of individual pans. Raising a family as a single mother didn't leave much room in the budget for good cookware. My nest is empty now and I feel these will be with me til the end!",
      "rating": 5.0,
      "verified": true,
      "author": "sparky47",
      "helpful_votes": 0,
      "publication_date": 20160922
    },
    {
      "title": "These pans are just what I wanted. I seasoned ...",
      "text": "These pans are just what I wanted. I seasoned them on the first use with a little oil, and they are serving up non stick items ever since.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim C.",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "I'll never get rid of my cast iron but as ...",
      "text": "I'll never get rid of my cast iron but as I replace my nonstick pots and pans it's going to be Calphalon all the way",
      "rating": 5.0,
      "verified": true,
      "author": "M Wolfe",
      "helpful_votes": 0,
      "publication_date": 20170319
    },
    {
      "title": "These are great non-stick pans",
      "text": "I have now used these pans for about a month and they are very high quality, with even heating and great non-stick coating. While a month is not a terribly long time to test the surface's staying power, the early indications are very good. I do like the heft to them which keeps food evenly cooking but without being as difficult to manage as cast iron (which I also still use).",
      "rating": 5.0,
      "verified": true,
      "author": "Randy Lopez",
      "helpful_votes": 0,
      "publication_date": 20140204
    },
    {
      "title": "Wonderful",
      "text": "Had to purchase new range. Got the ceramic top. Quickly found out that my very old cookware did not sit flat on the burner. Found this set of pans at a great price. Received them in record time. Used them the first day. Didn't realize how good my food would taste without having to spray pan (which is a no no for this cookware) and using very little oil. Love it! Since the entire set of this cookware is too expensive for me to order all at once, I am putting this into my budget each month to add an additional piece.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Blythe",
      "helpful_votes": 0,
      "publication_date": 20130805
    },
    {
      "title": "Five Stars",
      "text": "These are THE BEST OMELETTE PANS EVER!!!! Nothing sticks to this pan - not even burnt cheese.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J Taylor",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "Value related to price based on past experience.",
      "text": "These pots are for the long haul. They are never going to win a price contest. They are the best of the best at the different four of five levels Calphalon has in their lineup. Nothing sticks to them. I've had these before. Would not consider other brand names.",
      "rating": 5.0,
      "verified": true,
      "author": "Mariano A. Arguelo",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "One of the Best brands out there.",
      "text": "Well made, very easy to clean and good heat distribution. I recommend never over heating or placing in the dishwasher. However they hold up well for that also, I replaced the set I did that to for years and prefer not to do that anymore, they work better that way. I suggest you get the Calphalon glass lids for all of them.",
      "rating": 5.0,
      "verified": true,
      "author": "BVG",
      "helpful_votes": 0,
      "publication_date": 20140116
    },
    {
      "title": "It's good. But 8-inch is too small",
      "text": "It's good. But 8-inch is too small, so I seldom use it. And their weight are heavier than I expected.",
      "rating": 4.0,
      "verified": true,
      "author": "SEOK",
      "helpful_votes": 2,
      "publication_date": 20160713
    },
    {
      "title": "Wonderful Pans",
      "text": "I bought a Calphalon set from Costco several years ago and I needed to replace the 8\" and 10\" pans (the non-stick has worn out). I was pleasantly surprised to find that the lids from that set perfectly fit these new pans (as was my hope!) and the pan quality was just as good as the others. Great pans for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Raine",
      "helpful_votes": 0,
      "publication_date": 20141003
    },
    {
      "title": "Love these pans",
      "text": "Love these pans. If you're looking for an extremely high quality nonstick that you can use for everything, even searing, this is your huckleberry. Pretty much the only pans I use in the kitchen. No cleanup, solid construction, good to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Honored1",
      "helpful_votes": 0,
      "publication_date": 20160811
    },
    {
      "title": "Why did I wait so long to get one",
      "text": "These pans are heavy but strong, and has a clean look. I tried cooking breaded chicken cutlets with about 3 tablespoons of oil. They came out just as good, if not better, than deep fried, and slid right out. Never stuck to bottom. I also tried hamburgers which came out great. Washes easily with sponge and dish detergent (use Dawn). Can't wait to do eggs this weekend.",
      "rating": 5.0,
      "verified": true,
      "author": "The Good Wife",
      "helpful_votes": 0,
      "publication_date": 20130307
    },
    {
      "title": "Ain't What They Used To Be",
      "text": "I'm in my sixties, and I've used Calphalon pots and pans all my adult life. I recently bought two more, and I am disappointed with their quality. They have incurred slight scratches and stains in very little time. I am using the proper cooking utensils, so it appears I have to blame Calphalon for reduced quality.",
      "rating": 3.0,
      "verified": true,
      "author": "JOHN DOE",
      "helpful_votes": 2,
      "publication_date": 20150609
    },
    {
      "title": "Totally love these pans",
      "text": "Totally love these pans. I feel like I got a VERY good deal. I purchased an open box item at a discount and now have two heavy, high quality pans for a fraction of the retail cost. The handle remains cool and the nonstick surface is fabulous. Eggs? No problem. Omelet? No problem. Delicate crepe? Again, no problem. These pans live up the the hype of the brand name.",
      "rating": 5.0,
      "verified": true,
      "author": "xyz",
      "helpful_votes": 0,
      "publication_date": 20150825
    },
    {
      "title": "Fantastic pans and not like the Calphalon you would buy ...",
      "text": "Fantastic pans and not like the Calphalon you would buy in say Walmart. These are heavy, non stick, clean easily and heat evenly. You really need these pans. I also ordered the glass tops which make it great for reducing splatter and seeing what's going on.",
      "rating": 5.0,
      "verified": true,
      "author": "skipy",
      "helpful_votes": 0,
      "publication_date": 20160316
    },
    {
      "title": "Expensive for what they Offer.",
      "text": "Items cooked in these pans do not stick to bottom of pans --- BUT REALLY ARE HARD TO CLEAN AROUND RIVETS!! Very disappointed with this purchase. I have had others of same brand for years that never stuck anywhere.",
      "rating": 2.0,
      "verified": true,
      "author": "June Montgomery",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Incredible quality.",
      "text": "I always buy this brand, supper high quality. But I do change them every 3 years give or take. its something that I have to do always, I cant find better quality with a non-stick.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Tapia",
      "helpful_votes": 0,
      "publication_date": 20161115
    },
    {
      "title": "Good Product - Well Made",
      "text": "Just tried it once so far but seems like a very good product - made with metal handles so you can put it in the oven. Well made.",
      "rating": 5.0,
      "verified": true,
      "author": "DenD",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "We've been using these pans for years. They are ...",
      "text": "We've been using these pans for years. They are quite durable, but in heavy use they do scratch, at that point we replace them.",
      "rating": 5.0,
      "verified": true,
      "author": "ShelterIslandJoe",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "the best pans I ever purchased",
      "text": "I love this set of pans, It is so good to have quality pans, non sticking, easy to clean and very good with heat. The cost os a little higher but you get what you pay for it.",
      "rating": 5.0,
      "verified": true,
      "author": "ikan rene yang",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "It was a gift and our daughter loved it. She says the pans are well made ...",
      "text": "This item shipped quickly, was priced right. It was a gift and our daughter loved it. She says the pans are well made and very durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 0,
      "publication_date": 20170404
    },
    {
      "title": "So I decided to keep them but I would not recommend to my friends",
      "text": "The pair was deformed but still usable. So I decided to keep them but I would not recommend to my friends.",
      "rating": 3.0,
      "verified": true,
      "author": "Prot Eng",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Amazing nonstick pans!",
      "text": "Love these! I have since ignored all my other pans and make everything in these. You really need to use just a tad bit of oil - take a paper towel and just wipe a thin layer of oil and it makes all the difference. I don't need to add anymore oil after that, the're truly nonstick throughout cooking. Just use healthy fats - no spray oils, those will kill your pans and they're not even really zero calories! My scrambled eggs and omelets come out perfect every time and cleaning is beyond easy!",
      "rating": 5.0,
      "verified": true,
      "author": "Marianne",
      "helpful_votes": 0,
      "publication_date": 20140908
    },
    {
      "title": "Frying pans",
      "text": "Two months, the pans are still working well. I don't put them in the washer and use minimum abrasion material to wash. Also I try to keep them seasoned. Though well used they both still look new. Am thinking of getting the 12 inch pan.",
      "rating": 4.0,
      "verified": true,
      "author": "wmass25",
      "helpful_votes": 3,
      "publication_date": 20130822
    },
    {
      "title": "Best egg pans, Hands down",
      "text": "Calphalon has different investment levels of cookware. These is professional quality pans. Check the riveting, the actual weight of the individual pans, and the quality of the handle says it all.",
      "rating": 5.0,
      "verified": true,
      "author": "jeremy roth",
      "helpful_votes": 0,
      "publication_date": 20151119
    },
    {
      "title": "Five Stars",
      "text": "Purchased as gift for son and his wife - each has their personnel pan",
      "rating": 5.0,
      "verified": true,
      "author": "Grandma Butler",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Great Set",
      "text": "I've always been a fan of Calphalon and this set continues that tradition. Love the glass lid, love the searing capability, love the nonstick surface, love the relaxed speed of cooking. I've used other brands, even more expensive stainless steel, and they heat up too fast for my taste. This one is just perfect. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "The Writing Chef",
      "helpful_votes": 0,
      "publication_date": 20130523
    },
    {
      "title": "love the pans",
      "text": "love cooking with these bad boys. Super easy to clean and you can cook just about anything you can think of with them",
      "rating": 5.0,
      "verified": true,
      "author": "Hunter",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Pricey Pan -Not a very good Coating",
      "text": "I purchases these pans in November of 2016 (5-1/2 months ago). We use the large pan about once a week or so and it seems fine. The 8 inch pan is use 2-4 time a week and the non-stick surface show small cracks starting along the bottom outside edge. The pans do have nice weight and cook evenly but so do many other pans that don't cost near what these pans cost.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20170327
    },
    {
      "title": "The non stick sticks and the pans are very poor quality",
      "text": "These are cheap Dollar Mart pans. The non stick sticks and the pans are very poor quality",
      "rating": 1.0,
      "verified": true,
      "author": "Ruben D. Silva",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Great non-stick pans, perfect for flipping an omelet!",
      "text": "Best omelet pan I have ever had. super non-stick. i have ruined every non-stick pan that i have ever had so this time I bought plastic non-stick friendly utensils to go with it. Good price and two nice pans!",
      "rating": 5.0,
      "verified": true,
      "author": "DCguy",
      "helpful_votes": 0,
      "publication_date": 20171119
    },
    {
      "title": "Perfect pans",
      "text": "We've been using these pans just about every day for the last month or so. I can't seem to find a single problem with them yet. I read some reviews were people had problems with the finish but from what I can tell, these will be long lasting pans. They are exceptional quality. I am so glad we went with the Unison.",
      "rating": 5.0,
      "verified": true,
      "author": "kackmo28",
      "helpful_votes": 0,
      "publication_date": 20131009
    },
    {
      "title": "Perfect Unison",
      "text": "Calphalon Unison is such good cookware that I don't know why anyone would buy the more expensive brands. I have their largest frying pan with lid and two 8\" and one 10\". Worth every penny. Be sure to get the UNISON category because Calphalon does make cheaper pans that are not as good.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20140917
    },
    {
      "title": "have these for over six months now. i can ...",
      "text": "have these for over six months now. i can only hope they last the rest of my life b/c i don't want them to ever leave me. i used them for everything. i've used cheap cookware and even expensive french stuff, but this are my go-to pans",
      "rating": 5.0,
      "verified": true,
      "author": "Mindy Bloom",
      "helpful_votes": 0,
      "publication_date": 20160130
    },
    {
      "title": "The long handles are great and the non stick appears to be good quality",
      "text": "I think these a lot. The long handles are great and the non stick appears to be good quality. No issues so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Storyteller",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Pans work great so far",
      "text": "Pans work great so far. This is our second set of Calphalon, first set lasted about 4/5 years but the non-stick was ruined. Has been so nice using these and not having to scrub every meal off them while cleaning.",
      "rating": 5.0,
      "verified": true,
      "author": "B Johnst",
      "helpful_votes": 0,
      "publication_date": 20160114
    },
    {
      "title": "Go with the Unison.",
      "text": "Great skillets. Calphalon Unison is my favorite because of their quality,versatility and service-life.",
      "rating": 5.0,
      "verified": true,
      "author": "franklin d. fletcher",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Calphalon nonstick pan set",
      "text": "I have had Calphalon cookware for some time and I like them very much but I wanted to add to the set. These pans fit well with my other pans but are MUCH heavier. I still like them but you might want to lift a few weights to lift them!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy J.",
      "helpful_votes": 0,
      "publication_date": 20140430
    },
    {
      "title": "Quality thats made in the U.S.A.",
      "text": "I love Calphalon because of its performance and because it's a American made product. Its a must have set in every kitchen. Be sure to use non stick cooking utensils when cooking with these pans to prolong the life of them.",
      "rating": 5.0,
      "verified": true,
      "author": "L&O",
      "helpful_votes": 0,
      "publication_date": 20150629
    },
    {
      "title": "The best non-stick pan I've used to date",
      "text": "The best non-stick pan I've used to date. Cooking sugar cured bacon may take a one minute warm water soak but what the? Cons: I can't find a lid to fit these pans correctly so as of now I'm forced to use aluminum foil in a pinch. Jim K.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim K",
      "helpful_votes": 0,
      "publication_date": 20150704
    },
    {
      "title": "so good over a period of two months - sturdy and ...",
      "text": "So far, so good over a period of two months - sturdy and slick. Not sure about longevity. You can ask me about that later, if you wish.",
      "rating": 5.0,
      "verified": true,
      "author": "JW",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Nice Skillet",
      "text": "Nice skillets. I have been using these for a few weeks and really like them. They clean up easily and transfer heat evenly. I haven't tried using them in the oven yet, but like the fact that I can.",
      "rating": 5.0,
      "verified": true,
      "author": "Charmed I'm Sure",
      "helpful_votes": 0,
      "publication_date": 20160412
    },
    {
      "title": "Great pan for the $$",
      "text": "Great pan for the $$. Been using them for a few months now and no issues. Non stick is great.",
      "rating": 4.0,
      "verified": true,
      "author": "Random Person",
      "helpful_votes": 0,
      "publication_date": 20160822
    },
    {
      "title": "Amazing Quality, Great Price!",
      "text": "These are great non-stick pans. They are heavy in weight and are the high quality you would expect from Calphalon...and I am usually an All-Clad/Cusinart girl! Exactly what we needed so I could stop scraping eggs off my other pans!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer L Piazza",
      "helpful_votes": 0,
      "publication_date": 20150529
    },
    {
      "title": "Four Stars",
      "text": "I like them a lot. Reasonably even heating, pretty good non-stick surface, and easy to clean.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael B.",
      "helpful_votes": 0,
      "publication_date": 20160605
    },
    {
      "title": "Great durable non-stick pans",
      "text": "Pros: Great non stick pans. Non cancer inducing non stick material. Handles high heat without damaging the non stick material. Supposedly durable even though I haven't had it long enough to verify this yet. Cons: One of the pans was slightly scratched when I got it, but it was quickly replaced with a new one so no harm, no foul.",
      "rating": 5.0,
      "verified": true,
      "author": "Mauritz",
      "helpful_votes": 0,
      "publication_date": 20130103
    }
  ],
  "product_meta": {
    "title": "Calphalon Unison Nonstick 8-Inch and 10-Inch Omelette Pan Set,Black",
    "description": "Size:8-inch and 10-inch Set| Color:BlackAt last, nonstick cookware that lets you cook like a professional. Two surfaces make the difference. Unison cookware is built with 2 different nonstick surfaces for different cooking tasks, so you can use healthy, easy-to-clean nonstick to cook with professional precision. Ultra-smooth Slide pans release foods effortlessly for tender omelettes and delicate sauces. Specially-textured Sear pans seal in flavor and provide perfect browning of meats, fish, and vegetables. Flat, wide bottoms heat evenly and provide plenty of room for cooking. The sloped sides are designed for easy tossing and rolling. Long, quadruple-riveted stainless steel handles stay cool on the stovetop. All cookware is dishwasher-safe and carries Calphalon's full lifetime warranty.",
    "rating": 4.5,
    "feature_bullets": [
      "Unison cookware is built with 2 different nonstick surfaces for different cooking tasks, so you can use healthy, easy-to-clean nonstick to cook with professional precision.",
      "Ultra-smooth Slide pans release foods effortlessly for tender omelettes and delicate sauces. Specially-textured Sear pans seal in flavor and provide perfect browning of meats, fish, and vegetables.",
      "Flat, wide bottoms heat evenly and provide plenty of room for cooking. The sloped sides are designed for easy tossing and rolling.",
      "Long, quadruple-riveted stainless steel handles stay cool on the stovetop. All cookware is dishwasher-safe and carries Calphalon's full lifetime warranty.",
      "The flat, heavy-bottom pan has a wide surface to provide even heat",
      "Cook with little or no oils, butter or fats; The revolutionary, ultra-smooth slide nonstick surface releases foods effortlessly",
      "Ideal for omelet's, crepes; frying breaded fish, meat and poultry and croque-monsieur, cheese sandwiches and crab cakes",
      "100-Percent dishwasher safe; Oven safe to 500-Degree F / 260-Degree C; Utensils: nylon, coated and wooden",
      "Heavy-gauge, hard anodized aluminum; Slide nonstick interiors; Handles stay comfortably cool on the stovetop"
    ],
    "specifications": {
      "Product Dimensions": "10.25 x 6 x 19.75 inches",
      "Item Weight": "1 pounds",
      "Manufacturer": "Calphalon",
      "ASIN": "B004RIY4J4",
      "Item model number": "1788581",
      "Customer Reviews": "4.5 out of 5 stars1,118 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#129,473 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 5, 2003"
    },
    "categories": [
      "Omelet Pans",
      "Home & Kitchen",
      "Cookware",
      "Pots & Pans",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}