{
  "website_summaries": [
    {
      "verdict": "A no-frills unit that renders delicious results at an affordable price.",
      "pros": [
        "Inexpensive and simple",
        "Nice stoneware insert",
        "It has a dial control, which may be \"old fashioned,\" but some prefer it",
        "Makes good food"
      ],
      "cons": [
        "Round shape takes up significant space on the counter",
        "Loose-fitting lid may give way to leaks or spills"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I received my product in good condition, however the lid does not cover the ...",
      "text": "I received my product in good condition, however the lid does not cover the top entirely so whatever I am cooking, does not cook the same as in other slow cookers. 8 hours after putting a 2 pound roast in, it was still tough. I had to cover the slow cooker with a towel to keep the steam in. It took a total of 10 hours before it was tender enough to eat! I would not recommend this product. I would purchase a Crock Pot or Hamilton Beach slow cooker as I have not had any problems with these brands. This purchase was a disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 36,
      "publication_date": 20161115
    },
    {
      "title": "Bad sulfur taste is real",
      "text": "Before buying a crock pot I read most of the reviews on it, when I read someone saying the food taste like sulfur I didn't believe it and bought it any ways. Now I have wasted my time and money on something that has a bad taste in the food, specially if you cook something with tomatoes. I read that if the pot is cheaply made it leaches the chemical in the food when it reacts with the tomatoes, that theory might be true. Since I have tried to cook several dishes and all turned out to have that same bad after taste.",
      "rating": 1.0,
      "verified": true,
      "author": "Ukb",
      "helpful_votes": 25,
      "publication_date": 20160322
    },
    {
      "title": "A great buy if you're looking for a no-frills slow cooker at a low price!",
      "text": "FINALLY I have found a new slow cooker that doesn't cook too fast or too hot! The size is perfect for my husband and I, with leftovers. Tried it for the first time today with a recipe that called for boneless chicken thighs. After 5 hours on low, turned to the warm setting while I cooked rice and made a salad. It was so tender and delicious! I'm looking forward to try a sausage and peppers recipe later this week. Great buy at $14.39 on Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "ADK lady",
      "helpful_votes": 7,
      "publication_date": 20161218
    },
    {
      "title": "Cracked on first use, no seller response.",
      "text": "The crock part cracked after the second use. I reached out to the seller with no response. I read that sometimes in shipping if these are banged around too much it can cause a weakness in the ceramic that heat will magnify and cause them to crack. So I will stick with buying slow cookers at my local stores instead of having them shipped. The one star is for a) faulty product and b) lack of response from seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Mrs FantTop Contributor: Pets",
      "helpful_votes": 5,
      "publication_date": 20180110
    },
    {
      "title": "Perfect size for most recipes, easy to clean",
      "text": "I can not stress enough how much I love this crockpot. I have an abuncance of recipes that can be cooked in it and love how easy to clean and compact it is. If you want to start crock pot cooking with out spendin a fortune , Invest in this item!",
      "rating": 5.0,
      "verified": true,
      "author": "Miss R3d",
      "helpful_votes": 30,
      "publication_date": 20160114
    },
    {
      "title": "Great for Single Pringles",
      "text": "I'm a single male with a full time job and full time school. I am always tired. However, this crockpot made it so I can still have great hot food with almost no effort. Great price. Great size (it can easily make like 3 days of food or 1 day of food). Easy to clean and operate. If you live by yourself or with one other person and need a crockpot, buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Elisha Lo",
      "helpful_votes": 3,
      "publication_date": 20180904
    },
    {
      "title": "Very basic, very simple, very effective",
      "text": "This is just a simple slow cooker, and it does exactly what it should. It is bigger than I expected, because some people were saying it is barely enough for dinner for two. Are you kidding me? My wife and I get a nice hot dinner, and two to three days of leftovers for lunches. It holds a GALLON, folks. Nice product.",
      "rating": 5.0,
      "verified": true,
      "author": "Mojave Bob",
      "helpful_votes": 3,
      "publication_date": 20181022
    },
    {
      "title": "This works well BUT I didn't notice until after I ...",
      "text": "This works well BUT I didn't notice until after I had used it that the interior pot is damaged. So I expect it won't last very long. Learn from my mistake and inspect it very carefully if you buy this item.",
      "rating": 2.0,
      "verified": true,
      "author": "T.Smith",
      "helpful_votes": 10,
      "publication_date": 20170318
    },
    {
      "title": "Slow Cooker or No Cooker?",
      "text": "I have an ancient cooker that I decided to retire solely because I wanted to be able to separate the pot from the cooker for washing up, and because the pot itself was white and it was easier to see when things were clean. Put on a pot of tomato sauce (40oz) and sausage. After almost three hours, the sauce is finally hot enough to start cooking the sausage. Good thing I didn't throw out by 30 yr old Rival. PIA to clean up or not, the Rival beats this POS.",
      "rating": 2.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Works exactly as advertised, not disfunctional as some report",
      "text": "Came here to help dispel any notion that this product doesn't work. Some reviewers have showed that this slow cooker doesn't keep in heat well or heat up food to adequate temperatures, but as you can see in the attached picture, it does. I'm guessing those users either aren't using it correctly or they received a dud. I got this slow cooker back in 2016. It's basic, but it works as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Acesonnall",
      "helpful_votes": 2,
      "publication_date": 20190520
    },
    {
      "title": "Another Slower Cooker",
      "text": "My mom had a smaller Proctor Silex slow cooker for 10 years. It finally gave up a couple months ago. She asked for a larger one. So I bought this for her. Because the control knob on the new unit is exactly the same as the old one, it eliminates the learning curve, which is a big plus for her. She loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Love this Slow Cooker!!",
      "text": "Arrived quickly and in perfect condition. Have used it several times and found it to be an excellent slow cooker! Low is definitely low and high is high. The stone crock is thicker and heavier and the \"other brand\" cooker that I have used in past few years. Allows me to put a meal in it in the morning before going to work and come home to dinner that was perfectly cooked. I am definitely going to be using this slow cooker often and will be eating healthier meals! Thanks Proctor-Silex for an excellent product and Amazon for a great price and great shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "ladybutterfly102",
      "helpful_votes": 0,
      "publication_date": 20170408
    },
    {
      "title": "Met my expectations and then some.",
      "text": "I never used a crockpot before but this turned out to be easier than I expected and produce better results. I don't know what you would get with a more expensive one... I would not buy liners, this thing is really easy to clean. Not sure why I would use the slow setting unless I needed to kill time.",
      "rating": 4.0,
      "verified": true,
      "author": "Philiboy",
      "helpful_votes": 5,
      "publication_date": 20170727
    },
    {
      "title": "Works well, good quality",
      "text": "Really works well and is the right size for cooking 2-6 serving recipes. The unit is compact and not very heavy. The controls are simple and straightforward. The heating performance is as expected, the high setting provides a nice simmering heat without getting everything vigorously boiling. The top sits on the cooker vey well, without any bubbles coming out and rattling the lid. Looks good on the countertop. Not cheaply made or flimsy in any way. A good value and totally satisfying performance.",
      "rating": 5.0,
      "verified": true,
      "author": "LXXV",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Great affordable slow cooker!",
      "text": "My friend had never owned a slow cooker before so I decided to change that. I shopped around before deciding to get this one for her birthday. So far she loves it! She uses it every week to make meals. She also said it's one of the best presents she could have received. The best part is she invites me over for meals. : ) If I ever needed to replace my slow cooker this would be the one I buy. It's really worth it for the price. ------- UPDATE: My mom ended up dropping my other slow cooker and breaking it... So guess what we bought? That's right, this. Works great and use at least once a week!",
      "rating": 5.0,
      "verified": true,
      "author": "Clover",
      "helpful_votes": 2,
      "publication_date": 20160529
    },
    {
      "title": "but it does work and it's a good price.",
      "text": "works ok. the center pot got a bit stained/scuffed after some use. It also doesn't get quite hot enough for me, it wont boil water. but it does work and it's a good price.",
      "rating": 3.0,
      "verified": true,
      "author": "college student from CA",
      "helpful_votes": 2,
      "publication_date": 20180103
    },
    {
      "title": "You can do better!",
      "text": "Purchased this for my daughter for her first apartment. It's a nice little slow cooker but the lid doesn't fit correctly. I returned the first one and asked for a replacement and it arrived with the same issues. Very disappointed. I guess you get what you pay for. Price is cheap for a reason.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20161202
    },
    {
      "title": "I generally hesitate to leave negative feedback, but this ...",
      "text": "I generally hesitate to leave negative feedback, but this was a completely defective product. Perhaps it's not the norm, given others' positive experiences, but our slow cooker barely heated our soup. After four hours on high, the temperature registered at 133 F, as you can see from the picture. I checked again half an hour later to make sure it wasn't a fluke, and the soup was still lukewarm.",
      "rating": 1.0,
      "verified": true,
      "author": "Jocelyn",
      "helpful_votes": 196,
      "publication_date": 20160107
    },
    {
      "title": "It does the job.",
      "text": "The slow cooker works (I have now used several times), but I was not impressed with the quality. I have used mostly Crock-pot items in the past, and I am not sure how well the ceramic interior pot will last. It seems much thinner than those that I have used in the past and the enamel seems to scratch easier.",
      "rating": 3.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 2,
      "publication_date": 20171222
    },
    {
      "title": "For the money it is a very good product. I use it often",
      "text": "For the money it is a very good product. I use it often. Just one caution - it has three settings: 'Keep Warm', 'Low' and 'High'. The 'keep warm' will not elevate food temperature higher that 117 degrees Fahrenheit. That is great if your goal is to grow bacteria. But for food preparation, it is not nearly hot enough. Be sure to use a meat thermometer so you know the temperatures that the three settings can generate. For mine - on the high setting, the temperature gets up to about 170 degrees - which is satisfactory.",
      "rating": 5.0,
      "verified": true,
      "author": "inquiringmind",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "I love this slow cooker",
      "text": "We have only used this machine once, but when we did we cooked buffalo chicken pasta. This is a smaller unit so if you're trying to feed more than 4 it could be a problem. Its only me and my girlfriend so she starts the meal before she leaves for work and i let it stay on warm when i get off till she gets off. I love this slow cooker.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen skinner",
      "helpful_votes": 2,
      "publication_date": 20160619
    },
    {
      "title": "Excellent slow cooker!",
      "text": "This slow cooker is phenomenal and at a low price too. It heats up quickly, and I haven’t had any problem with it during the past 3-4 months I’ve owned it. I use it about twice a week for all kinds of recipes. Some reviewers are saying it holds enough for a family of 4, but my boyfriend and I find it just big enough for 2, with just a few leftovers. I’d go up a size if I had another person or two to feed.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen B.",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "No power indicator light, but heats up quicly.",
      "text": "Heats up quicly to the touch, but not enough to burn you. meats bubble and produce steam , but never over flows. ceramic insert needs some scrubbing afterwards--definitely not a non-stick surface. painting on the insert is holding up perfectly. cord is fairly short--24 inches, and is barely long enough to reach around my microwave towards the outlet.",
      "rating": 4.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "DO NOT BUY - LID BREAKS IMMEDIATELY",
      "text": "DO NOT buy this product! I buy tons of stuff on Amazon and I can only think of two things I have ever returned. This is one of them. The lid broke after my first use and glass got everywhere. I understand this is not expensive, but I would have figured it would have lasted a little longer than one slow cooking session.",
      "rating": 1.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 2,
      "publication_date": 20190327
    },
    {
      "title": "After 5 hours of cooking on high the stew came out perfect, like the ones we eat in restaurants",
      "text": "I got the slow cooker today and immediately made a beef stew. After 5 hours of cooking on high the stew came out perfect, like the ones we eat in restaurants. For 15 $ the slow cooker is just perfect. Would recommend everyone not to spend money on expensive ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 5,
      "publication_date": 20160822
    },
    {
      "title": "if it wasn't for what is mentioned in my comment, I would give it 5 stars",
      "text": "I believe this slow cooker is good, but I think they sent me a used or refurbished slow cooker. There are scratch marks on the lid. The lid itself won't close completely all the way around. In fact, the lid rocks back and forth leaving gaps. If you are cooking, a lot of heat will escape from the crack pot. Personally, I think the lid is not for the slow cooker but for something else. Also, there are scratch marks on the ceramic pot itself. However, it may look and sound like this slow cooker is small but it has a lot of room in that ceramic pot.",
      "rating": 3.0,
      "verified": true,
      "author": "T. N.",
      "helpful_votes": 4,
      "publication_date": 20160213
    },
    {
      "title": "It does not hold four quarts of liquid. It holds only three.",
      "text": "Good slow cooker but it only fits 3 quarts of liquid, not 4 like is stated. The outer heating shell fits 4 quarts but the actual inner container in which you put your food is only 3 quarts. This is a big deal to me because I make homemade yogurt and I needed the larger capacity. The other functions though of the cooker are completely fine. It works and keeps a consistent temperature.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristen S",
      "helpful_votes": 2,
      "publication_date": 20170728
    },
    {
      "title": "Price and size are TERRIFIC",
      "text": "Love this post except for one little problem 😳. Because there is no vent hope (at least I think that might be the problem). it splatters steam water all over the counter. Yesterday I had gone shopping, 4 hours later when I got home, water was all over and the pot was almost dry inside. Good thing I wasn't gone any longer😲. Aside from that, I absolutely love it. Temperatures are very good and it was very easy to clean. yes, I would suggestion this to everyone. AND the price is excellent considering the size and everything it offers. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "ANTOINETTE",
      "helpful_votes": 0,
      "publication_date": 20161125
    },
    {
      "title": "Other reviews are correct.",
      "text": "As others have mentioned, IT IS A 3-QUART, NOT 4. And THE LID DOES WOBBLE DUE TO UNEVEN CERAMIC SURFACE. I will try it first before sending it back. Maybe I 'll like it, and won't have to go through the hassle of re-packing and shipping it back. ***EDIT *** I just used it, and I'm keeping it due to it's true slow-cooker temperature. It seems like most (crock-pot brand) over boil even on low, but this one is a true slow-cooker. The wobbly lid didn't matter. No real moisture loss. I still keep it at 3 stars due to it's 3 quart, not 4, and the lid.",
      "rating": 3.0,
      "verified": true,
      "author": "deadbugs",
      "helpful_votes": 4,
      "publication_date": 20140226
    },
    {
      "title": "WORTH MORE THAN I PAID FOR IT!",
      "text": "This was the best $18 Ive ever spent on a kitchen item. It cooks dried bean dishes in just a few hours on high. Its not a large crock, I would say its a medium, but I still can put a whole good size chicken in it and is enough for my little family of 3. The lid doesn't fit snuggly so I just throw a hand towel over the top and it cooks even faster.",
      "rating": 5.0,
      "verified": true,
      "author": "Dixie",
      "helpful_votes": 3,
      "publication_date": 20170615
    },
    {
      "title": "A great product for smaller meals!",
      "text": "I have a much larger crock pot that I use when the family comes over. Since it’s now just hubby and myself, I decided to buy the 4 qt. It’s perfect for smaller meals, heat settings are on point and easily cleaned. Only drawback is the lid on this doesn’t seal like my larger one, yet it still cooks great!",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "works like a charm--something every oldie who is involved in too ...",
      "text": "Inexpensive, time-saving, works like a charm--something every oldie who is involved in too many volunteer activities needs to simply their life. I had one years ago and never replaced until now. Love this super easy method of cooking beans, stews, and tough cuts of meat for old folks on a budget.",
      "rating": 5.0,
      "verified": true,
      "author": "Juliet Waldron",
      "helpful_votes": 3,
      "publication_date": 20160521
    },
    {
      "title": "Wonderful",
      "text": "Perfect size for a single person. I imagine it would also be a great size for 2 people. So far I've made soup in the slow cooker and also a wonderful pot roast. Matter of fact I'm making another pot roast tomorrow. It couldn't be easier. Just put all the ingredients in the pot and magically the meat is falling apart tender but the carrots and potatoes aren't overcooked.",
      "rating": 5.0,
      "verified": true,
      "author": "ButtonsTop Contributor: Eye Makeup",
      "helpful_votes": 2,
      "publication_date": 20161229
    },
    {
      "title": "Proctor-Silex 33043 4-Quart Slow Cooler",
      "text": "I chose this model after searching all the slow cookers Amazon offers. I wanted a small size so as not to have to freeze the left overs. I have used it and am very pleased. The keep warm feature is very helpful and very few smaller models have this feature. It is easy to store and it's very convenient for a small family. It's also of a convenient size to use for melting chocolate to dip strawberries or other items.",
      "rating": 5.0,
      "verified": true,
      "author": "r. thomas",
      "helpful_votes": 5,
      "publication_date": 20130902
    },
    {
      "title": "A good crock",
      "text": "I bought this crock because it was said to have no lead in it. Unlike my last crock, everything is cooked well without a giant burn right around the inside of the crock. The temperature is fantastic, and everything works perfectly. I have had it for several months now with no problems. If you are in the market for a new crock pot, I would absolutely recommend this one.",
      "rating": 5.0,
      "verified": true,
      "author": "X",
      "helpful_votes": 3,
      "publication_date": 20160524
    },
    {
      "title": "An utterly reliable slow cooker",
      "text": "I don't know about easy to clean because I followed my daughter's advice and use slow cooker bags, but the temperature is accurate and I like the ease of a crock pot dinner.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "This Slow Cooker is big enough to handle a good volume of food and cook it thoroughly.",
      "text": "Proctor-Silex makes great cooking products and this 4 quart Slow Cooker is no exception. The container size is big enough to cook a meal for 3-4 people and the Slow Cooker cooks the food long enough for it to be tender and moist. Great Slow Cooker.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian G. Oliver",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Small slow cooker",
      "text": "For the money this slow cooker is great. It's the perf ct size for cooking for two, which I needed. The crock is easy to clean, and the appliance is easy to operate. No bells and whistles, which I don't need or want. Just an easy to use small appliance.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Ahnemann",
      "helpful_votes": 3,
      "publication_date": 20160614
    },
    {
      "title": "can't use on Hi, cheap junk...",
      "text": "If you do use Hi, it makes the lid bounce up and down, and leaks moisture down the sides of the heating element. Very cheap, poor design....Wish I had tried using it before the return period expired, would be long gone by now...",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Perfect size for 2! Amazing cheap product!",
      "text": "My trusty crockpot! I have had more expensive and bigger crockpots, but this one is definitely my favorite! There are only two people in my household and it's the perfect size for us! (If you have more than two people it's probably be too small for you). It works perfectly, is easy to clean, and is my little kitchen helper. Would definitely buy again and buy it as a gift!",
      "rating": 5.0,
      "verified": true,
      "author": "Torie",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Love it!",
      "text": "I live this crockpot. It's the perfect size for a family of two to four. It's simple to use, simple to clean and doesn't take up alot if space. Very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ekat",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Used it for the first time and I love it. Perfect size for 2 adults and a ...",
      "text": "Used it for the first time and I love it. Perfect size for 2 adults and a child. I liked that the sides didn't get hot so it feels safer to use and the crock pot wasn't boiling the food just simmering as a slow cooker should! I also bought this because Proctor Silex is the only cheaper brand I could find that clearly stated that they don't use lead. Great deal!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20151110
    },
    {
      "title": "Best Value for under $20!",
      "text": "I bought this for hot process soap making and it's perfect! The lid sits on perfectly level and it evenly heats on the sides! Rather than buy used one at the thrift store I decided to purchase a new one and after a lot of research I picked this one and am glad I did!",
      "rating": 5.0,
      "verified": true,
      "author": "mfm420",
      "helpful_votes": 5,
      "publication_date": 20160327
    },
    {
      "title": "Perfect",
      "text": "I love this slow cooker. I have a Proctor Silex 8qt to make up freezer meals, but it's just too heavy to use often. So I got this one. It's much more manageable, and I still can make up a few meals for the freezer.",
      "rating": 5.0,
      "verified": true,
      "author": "TammyK",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "Good",
      "text": "I have used this slow cooker twice since purchased. Seems to work well so far! I did notice the outer shell gets a bit hotter than my last crock pot, but not hot enough to burn anything. It is easy to clean and for the price, it is a good product.",
      "rating": 5.0,
      "verified": true,
      "author": "lmerk",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Small - might hold a small chicken",
      "text": "Was a little disappointed in the actual size of this cooker (it is on the small size - you could put a small whole chicken in it and not much else but some liquid), but the price was way cheep so I kept it as a back up, and ended up just ordering a crock replacement for my 6 QT.",
      "rating": 3.0,
      "verified": true,
      "author": "T. Brown",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Perfect and well worth the money",
      "text": "Love this! Have used it a few times. The lid is plastic and the crock is very lightweight. I'm guessing that's why it is so inexpensive. I don't consider either a negative. It is easier to lift! Works PERFECTLY.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy Rosella Edwards",
      "helpful_votes": 2,
      "publication_date": 20171029
    },
    {
      "title": "It smells like home",
      "text": "This is a nice slow cooker with a ceramic insert that is very easy to clean. Cooks evenly with no hot spots. Great for a smaller family. The wonderful aroma when you walk into the house after a long day at work is what slow cookers are all about. It smells like home.",
      "rating": 5.0,
      "verified": true,
      "author": "endcrownsall",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Hey even I can cook with it",
      "text": "Not much for cooking but a slow cooking is just my speed. Best 4 cheese mac and cheese I've ever had. Trying slow cook ziti this weekend, with Italian sausage, ricotta cheese and 2 other cheeses, and a few meats, with a perfectly seasoned sauce, and I'll bet it'll be good.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Dyer",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Great deal. For $12 it works amazing and does ...",
      "text": "Great deal. For $12 it works amazing and does not take up a huge amount of space, which I appreciate as an apartment dwellers. It's only 4 quarts but you can definitely make a meal to feed up to 4 people.",
      "rating": 5.0,
      "verified": true,
      "author": "Marta Gonzales",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "Excellent!!",
      "text": "This a very nice crock pot that I bought for a Christmas present and if I needed another one I would keep it. Easy to operate and of course it is a Hamilton Beach so how much better could it get.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Witzig",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "Perfect size,excellent cooking!",
      "text": "Perfect size for our family of seven for a chulent!I'm always throwing away leftovers if i use a bigger crockpot...am glad the size is just right.it cooked amazingly and kept the food pooping hot without burning it.the chulent came out amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Rosenblum",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "It'll do, pig, it'll do.",
      "text": "I'm a fan of crock pots, and this one is fine, two minor criticisms: the crock doesn't clean as nicely as I would like, it almost always needs two washings -- maybe it's just because everything shows up on black. AND, I've heard this is common amongst newer crocks, it cooks much hotter than my old crockpot. On high, things BOIL, and that just too hot for a slow cooker. I usually jumpstart cooking on high for an hour or two, then switch to low. (which seems too hot for low)",
      "rating": 4.0,
      "verified": true,
      "author": "A. Sisk",
      "helpful_votes": 0,
      "publication_date": 20140330
    },
    {
      "title": "Perfect Value",
      "text": "Cannot beat the value you get with this slow cooker for $15. Ive had it two weeks and have made pulled pork and barbacoa. Both came out perfect!!!! We made the pulled pork with a Campbells Soup pre made sauce and the barbacoa with a Whole Foods sauce pack. The 4 quart is a perfect size for my wife and I, we end up eating about half for dinner and then have a bunch of left overs for lunch. Highly recommend for the price and ease of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Zack",
      "helpful_votes": 0,
      "publication_date": 20161010
    },
    {
      "title": "0/10",
      "text": "This thing was like a bad microwave. It over cooked some parts and undercooked others. A 0/10 for temperature evenness and control",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Temperature control is very poor. The \"Keep warm\" setting barely gets warm",
      "text": "Temperature control is very poor. The \"Keep warm\" setting barely gets warm. \"Low\" boils everything and is too hot. I'd hate to try the \"hot\" setting. I bought this for steel cut oatmeal and like the size but there is not a temp setting that does it right. Plus the coating is coming off the ceramic bowl already (likely because the temp was too hot). This is after only 3 uses. I guess you get what you pay for.",
      "rating": 2.0,
      "verified": true,
      "author": "Tamara M.",
      "helpful_votes": 0,
      "publication_date": 20161001
    },
    {
      "title": "Good value for the price, and it is pretty too and does a good job",
      "text": "I like the look, I like the size, love the black insert, pretty to take out and bring to the table, for a buffet it can be set on warm for the crowd, love it, good value for the cook who uses it not on a daily basis, but like once a week or so. I will try a bunch of new recipes it is fun to experiment, I am curious to see if I can make bread in it and some sweet treats have not yet tried those. So far I have done soup and casseroles...... Pulled pork will be my next... Edith - Chicago",
      "rating": 4.0,
      "verified": true,
      "author": "Edith George Jasser",
      "helpful_votes": 0,
      "publication_date": 20131119
    },
    {
      "title": "but it does a fine job with the food",
      "text": "This one cooks slower than my last one, and I have to get used to it, but it does a fine job with the food. The top doesn't quite go edge-to-edge, which is maybe why it cooks slower, but I've come to realize the food actually is tastier the longer it cooks, without drying out the meats.",
      "rating": 4.0,
      "verified": true,
      "author": "mp935",
      "helpful_votes": 0,
      "publication_date": 20170422
    },
    {
      "title": "I was a bit concerned cause my niece said her 4 quart didn't cook her food - it warmed it but didn't cook - this one cooked it perfectly - and it was boiling hot - I could't be happier with the size",
      "text": "I just used this after buying it last month. I was a bit concerned cause my niece said her 4 quart didn't cook her food - it warmed it but didn't cook - this one cooked it perfectly - and it was boiling hot - I could't be happier with the size, style and functions - can't beat the price",
      "rating": 5.0,
      "verified": true,
      "author": "Mary E. Butterfield",
      "helpful_votes": 2,
      "publication_date": 20171009
    },
    {
      "title": "Love it! I have a 6 or 8 quart ...",
      "text": "Love it! I have a 6 or 8 quart oval and have wanted something smaller. This is great for soups, smaller meals, desserts, large dips, etc. It's deep, the lid fits well. Easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer LJ",
      "helpful_votes": 0,
      "publication_date": 20160920
    },
    {
      "title": "LOVE, LOVE, LOVE IT!!",
      "text": "This is exactly what I was looking for. I have a very large crockpot but with only two of us around most of the time, I found I rarely used it because it seemed to be almost too hot for cooking smaller amounts. This new crockpot works absolutely great!! It's very easy to clean and cooks just like it should. So glad I invested in this. Now that big one can go down in the basement for use when the kids are coming to visit.",
      "rating": 5.0,
      "verified": true,
      "author": "Butterfly",
      "helpful_votes": 0,
      "publication_date": 20140822
    },
    {
      "title": "Fantastic gift",
      "text": "Fantastic gift for adult kids living on their own & learning how to cook. Easy to use & clean. Wished it came with small cooking book.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole-AM",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "One Star",
      "text": "The lid wont even fit entirely over and wont fully enclose/seal the food for proper cooking!",
      "rating": 1.0,
      "verified": true,
      "author": "Clayton Barton",
      "helpful_votes": 3,
      "publication_date": 20171025
    },
    {
      "title": "defects in bowl surface bumps and a 1/6\" deep pit.  Doesn't seem to be a real Proctor Silex.",
      "text": "Unfortunately the surface inside the bowl has a few defects: bumps and pit 1/16\" deep. There should be no visible or tactile defects. I don't believe it is a legitimate Proctor-Silex product.",
      "rating": 1.0,
      "verified": true,
      "author": "Sacramento Pine",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Wonderful Crock pot, great price!",
      "text": "This Crock Pot is so much nicer than the other one in the same price range here. I bought a Rival Crock Pot at Walmart, that overheated, had a bad fitting lid and low was a boil. This little baby arrived yesterday and I couldn't be happier. It has a warm setting, doesn't leak or spit like the other one did, and heated right up to right temperature right away. It even has a Warm setting so I can leave my soup on all day without overcooking. Buy this Crock Pot, you will be glad you did!",
      "rating": 5.0,
      "verified": true,
      "author": "Not a Vine member",
      "helpful_votes": 270,
      "publication_date": 20121130
    },
    {
      "title": "Decent slow cooker",
      "text": "No complaints! Good price for a slow cooker, but if you're down to spend another $5 you can find a 5 or 6 quart with a timer setting",
      "rating": 4.0,
      "verified": true,
      "author": "Shay2813",
      "helpful_votes": 0,
      "publication_date": 20161225
    },
    {
      "title": "Perfect temperatures unlike other slow cookers!",
      "text": "Like other reviewers said, this is a real crock pot - my last one on low was a rolling boil (a Rival). As a result, I avoided using it for meat dishes. This one is like the first ones that came out years ago. Highly recommend. The one I ordered was pictured as multi-colored black and white, but I got a black one, which is better. I didn't like the pattern as shown, but the price was too good to pass up.",
      "rating": 5.0,
      "verified": true,
      "author": "Annabanana",
      "helpful_votes": 0,
      "publication_date": 20151119
    },
    {
      "title": "Excellent Value",
      "text": "This crockpot is an excellent value for its price. It works well with an even temperature and produces perfectly cooked meals. It can be left on for the number of hours required with no issues. Often crockpots in this price range do not have removeable crocks, nor ceramic crocks. This does and these are essential features. The crock cleans easily and does not discolor from heat. It is well made. I prefer this size for one or two people, as it gives you another meal to heat later. It can feed four. I give it the highest rating.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat O",
      "helpful_votes": 0,
      "publication_date": 20121228
    },
    {
      "title": "Lid doesn't fit",
      "text": "Lid did not fit snug. A1/4-1/2\" gap. Sent it back.",
      "rating": 1.0,
      "verified": true,
      "author": "nancy ober",
      "helpful_votes": 10,
      "publication_date": 20150731
    },
    {
      "title": "Very disappointed in this product",
      "text": "arrived with small dents,on the bottom of the inside. After washing the lift out pot after cooking, chips , what was thought of scratches, is black paint comingoff the sides of the pot. This crock pot came only in black. Variety of cheery colors would have been nicer. Very disappointed in this product, and quality is poor. I will probably never buy a proctor-silex brand again",
      "rating": 2.0,
      "verified": true,
      "author": "trinity t",
      "helpful_votes": 2,
      "publication_date": 20151122
    },
    {
      "title": "Its a good cooker",
      "text": "This is a great little cooker. It does take a bit to get the temperature up if its full, because its larger. Once it does it stays a steady temperature. Hot setting is very hot!",
      "rating": 5.0,
      "verified": true,
      "author": "ali",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Perfect little crockpot",
      "text": "Works as advertised. I needed a smaller crockpot since it’s just my husband and I now. It doesn’t have all the bells and whistles, hence the great price.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Lackey",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "This product is a great price and very reliable",
      "text": "I absolutely love this product!! It’s so easy to throw together a meal in here. It is fire safe and I am not afraid to leave the house with it plugged in. AND it’s so cheap and great quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Joanna",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "... first plugged in this product it smoked and smelled like burnt rubber",
      "text": "When I first plugged in this product it smoked and smelled like burnt rubber. I probably should have unplugged it and returned it but I didn't. I continued it use it; and I'm glad I did because it has been a good little crock pot for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Hope",
      "helpful_votes": 0,
      "publication_date": 20170310
    },
    {
      "title": "\"Steady, And Slow, Wins\"",
      "text": "Great little slow cooker, well worth the price paid, \"No Complaints\" !",
      "rating": 5.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "It’s ok",
      "text": "I think it should heat up faster. It seems to take forever. If you got the time it does it’s job",
      "rating": 3.0,
      "verified": true,
      "author": "lynn",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "A Nice Medium",
      "text": "A nice medium-size slow cooker, this has a 'keep warm' setting as well as the usual Low and High. I anticipate using this quite a lot in the coming years.",
      "rating": 5.0,
      "verified": true,
      "author": "Brett Bydairk",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "So am very happy with new purchase as it is close to the ...",
      "text": "Just the right size, not too big or too small. And it is not overly heavy to handle. Had a larger one and I couldn't lift the crock pot out to serve.....was way too heavy. So only used once...and gave it away. So am very happy with new purchase as it is close to the old one I had used for years.",
      "rating": 4.0,
      "verified": true,
      "author": "J. A. Sims",
      "helpful_votes": 4,
      "publication_date": 20140727
    },
    {
      "title": "Great little crock pot!",
      "text": "Great little mini crock pot for making fudge and a butternut squash/apple dish -- a new holiday favorite!",
      "rating": 5.0,
      "verified": true,
      "author": "Sal",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Smell very bad",
      "text": "First time using it with the instruction, but it smells like burn. I have to turn it off directly, my housemate was complaining about it. I followed the instruction, but it still smell for my second try. It smell like burned plastic.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Great for treat for the price",
      "text": "Don't pay more for a 4-quart with the same features as this one. Get's the job done very well. Feeds 4 people generously. Great for stews and pulled pork/chicken. I left it on the counter for now, use it a lot. Indian stews way easier here. So convenient!",
      "rating": 5.0,
      "verified": true,
      "author": "GML",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "So Far So Good",
      "text": "Haven't used it a lot yet but when I have it has been great. Travels well.",
      "rating": 5.0,
      "verified": true,
      "author": "CAS",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "very nice pot",
      "text": "just what I needed right size for my wax bath for my bike chains",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Stacy",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Created a Tender Pot Roast",
      "text": "This crockpot produced one of the tenderest pot roasts I have ever eaten. The low settings on my previous two crockpots cooked the meat too quickly, which resulted in tougher beef.",
      "rating": 5.0,
      "verified": true,
      "author": "Cassandra R. Kemp",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "Takes longer to cook than my old one, but chicken comes out perfect.",
      "text": "On the high setting, I found that it takes about 6 hours for an entire bag of defrosted chicken to cook thoroughly. But the chicken (I've used different brands) always comes out super moist and tender. This fact doesn't really matter if you are just going to throw something in for dinner before leaving for work. It had been kind of a bummer though on the weekend when I don't think about making dinner until early afternoon.",
      "rating": 4.0,
      "verified": true,
      "author": "JLS",
      "helpful_votes": 3,
      "publication_date": 20130404
    },
    {
      "title": "Great slow cooker",
      "text": "Easy to prepare meals in advance, while not at home.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Hancock",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Five Star",
      "text": "This was a great gift for a college kid. Basic and straightforward. This is sized well for a couple or a single person who doesn't mind leftovers. You can fit a little oven stuffed chicken, couple Cornish hens, pot roast or a half rack of lamb for sizing reference.",
      "rating": 5.0,
      "verified": true,
      "author": "Kia H",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Yes crock pot",
      "text": "Have used product over 1 year and it is easy to clean and works perfectly just as it should. Totally satisfied with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "A simple but versatile crockpots for parties",
      "text": "An ideal sized crockpot for tailgates and potlucks. Especially good for soups, chilies, hot drinks (hot cocoa, mulled cider,etc). SImple, no frills, and reliable. Can't beat the value.",
      "rating": 5.0,
      "verified": true,
      "author": "M from VA",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "great price point",
      "text": "Bargain. Takes a while to warm up (but it is a slow cooker for a reason). Works well, great price point.",
      "rating": 4.0,
      "verified": true,
      "author": "Anita Campbell",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Perfect crock pot in my opinion.",
      "text": "I love this crock pot. I bought a much bigger and more expensive one with a temp probe and digital timer and the food from it comes out like leather. This simple crock works great for our small family of 2 and the food tastes GREAT!",
      "rating": 5.0,
      "verified": true,
      "author": "JaneTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20170706
    },
    {
      "title": "Keeps Cookin",
      "text": "I actually used this little guy to strip paint off of antique door hardware. I ran it daily for about a month without a hiccup. It's a quality little cooker and can't be best for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Curth",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Great Slow Cooker",
      "text": "I love this slow cooker. I'm glad I purchased it. I also love how it is deep as opposed to wide like others I have had of the same size.",
      "rating": 5.0,
      "verified": true,
      "author": "SciFiFan",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "Proctor Silex 33043 4-Quart Slow Cooker",
      "text": "I am loving this cooker. Winter is approaching so I wanted to enjoy some warm slow cooked meals. I have so far cooked homemade chicken noodle soup and a nice slow cooked pot of nicely seasoned beans. Next up will be homemade chili and then some stew. The quality of the cooker is good and it is of the right size for me. I am happy with the purchase and would recommend this slow cooker.",
      "rating": 5.0,
      "verified": true,
      "author": "south777seas",
      "helpful_votes": 0,
      "publication_date": 20131107
    },
    {
      "title": "Cooking for one crockpot",
      "text": "I love the size because basically I cook for myself and a normal crockpot is just too cumbersome so thank you for making the smaller one. Maureen Wild",
      "rating": 5.0,
      "verified": true,
      "author": "Maureen McCormack wild",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Works great. Great price!",
      "text": "I love it and it works great! Even though it came slightly dented in the side I was worried it would affect how it worked. But it's still works the same and I don't mind the dent as long as it cooks the food like it's supposed to, LOL! And it does!",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine M",
      "helpful_votes": 0,
      "publication_date": 20160731
    },
    {
      "title": "A Real Slow Cooker!",
      "text": "The Five Stars have it! This is the perfect crock pot for cooking the really slow cooking way. Low will get the contents of the pot to 185 degrees F in a couple of hours without boiling. At the same time, the outside temperature of the pot is about 145 degrees which is warm enough to let you know it is on, but not to seriously burn your hand. Our top fit the pot well. Perfect size for two people in an RV.",
      "rating": 5.0,
      "verified": true,
      "author": "Lyle Anderson",
      "helpful_votes": 0,
      "publication_date": 20141224
    },
    {
      "title": "Five Stars",
      "text": "works great, read reviews before purchase, and this one really Slow cooks !!",
      "rating": 5.0,
      "verified": true,
      "author": "Lynne K.",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "Perfect for downsizing!",
      "text": "A simple, straight forward, no frills product. Now that we have an empty nest and I'm cooking for 2 instead of 7, this works beautifully for us. I really appreciate the simple control knob instead of a digital panel control, as my husband feels unchallenged in adjusting the cooking temperature for me. The white crock insert is easy to clean, with no spots missed by our aging eyes. The price cannot be beat.",
      "rating": 5.0,
      "verified": true,
      "author": "Merry Mom",
      "helpful_votes": 2,
      "publication_date": 20130417
    },
    {
      "title": "this was a gift so I know nothing about it ...",
      "text": "this was a gift so I know nothing about it. Their house didn't burn down so I guess it worked",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Heinemann",
      "helpful_votes": 2,
      "publication_date": 20170406
    }
  ],
  "product_meta": {
    "title": "Proctor-Silex 33043 4-Quart Slow Cooker",
    "description": "Color:BlackThe Proctor Silex 4 Quart Portable Slow Cooker has a Keep Warm setting. The removable stoneware is dishwasher safe for easy cleanup.",
    "rating": 4.5,
    "feature_bullets": [
      "Fabric Type: Metal, Glass, Stoneware"
    ],
    "specifications": {
      "Product Dimensions": "11.8 x 11.8 x 9.5 inches",
      "Item Weight": "8.15 pounds",
      "Manufacturer": "Hamilton Beach",
      "ASIN": "B004O07LRC",
      "Item model number": "33043",
      "Customer Reviews": "4.5 out of 5 stars1,713 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#53,041 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 3, 2011"
    },
    "categories": [
      "Home & Kitchen",
      "Slow Cookers",
      "Small Appliances",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}