{
  "website_summaries": [
    {
      "verdict": "Textbook-perfect\" waffles, but at a high price.",
      "pros": [
        "Heats up quickly",
        "Rotary feature assists with browning",
        "Triple non-stick surface"
      ],
      "cons": [
        "A high-priced appliance that takes up a lot of room in your kitchen"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not impressed",
      "text": "Loved this waffle maker when we first received it! Have only had it for 3 months and it is now overheating and burning the waffles. Waring will not return my emails.",
      "rating": 1.0,
      "verified": true,
      "author": "HHC",
      "helpful_votes": 7,
      "publication_date": 20180615
    },
    {
      "title": "Very good product",
      "text": "I had a problem but was fix right after I contact them",
      "rating": 5.0,
      "verified": true,
      "author": "orlandogarcia",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "worke great",
      "text": "this unit heats up in less than 3 minute's. Waffles in about 1 min 30 sec each, easy to use with a browning control set around 3 to 4",
      "rating": 5.0,
      "verified": true,
      "author": "Henry Crockett",
      "helpful_votes": 7,
      "publication_date": 20140615
    },
    {
      "title": "DURABLE",
      "text": "Been using it for over 7 months and is still running like a champ at my restaurant",
      "rating": 5.0,
      "verified": true,
      "author": "Esteban Ledesma",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "the product started to have issues after being used for ...",
      "text": "the product started to have issues after being used for 2 weeks. It is supposed to be a commercial grade but it is unsuable at this point, the waffle keeps burnt, it seems that there is something wrong with the thermostat. I missed the window of return (Nov 9) although I started to use it on Nov 21.",
      "rating": 2.0,
      "verified": true,
      "author": "Albert Caamic",
      "helpful_votes": 5,
      "publication_date": 20161213
    },
    {
      "title": "Five Stars",
      "text": "Awesome waffle maker! Worth the expense if you like a great waffle cooked perfect every time!",
      "rating": 5.0,
      "verified": true,
      "author": "shannon",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "Poor quality teflen coating",
      "text": "Poor quality teflen coating. Cooking waffles was easy with their older products. Not so with this newer commercial supposed heavy duty model. Unfortunate....",
      "rating": 2.0,
      "verified": true,
      "author": "John R. Wilcox",
      "helpful_votes": 2,
      "publication_date": 20170625
    },
    {
      "title": "It works just great.",
      "text": "After working with other different brands, Waring is just above all. It works just great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "It is getting burn and burn again after I used ...",
      "text": "It is getting burn and burn again after I used it for a couple months later. Is there any warranty for the machine ?",
      "rating": 1.0,
      "verified": true,
      "author": "konglingjing",
      "helpful_votes": 4,
      "publication_date": 20161229
    },
    {
      "title": "Waffle is now a verb in our household!",
      "text": "Absolutely fantastic!!!! Cooks quickly!!!! I look forward to experimenting and \"waffling\" other food items/batters/doughs soon. Waffle is no longer just a noun but also a verb in our household! =)",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Martinez",
      "helpful_votes": 0,
      "publication_date": 20150921
    },
    {
      "title": "Awesome waffle maker!",
      "text": "Awesome waffle maker! Probably will not ever have to buy another one. Unit is well made, arrived on time in very sturdy packaging. My family love's it!",
      "rating": 5.0,
      "verified": true,
      "author": "David Lunceford",
      "helpful_votes": 0,
      "publication_date": 20150627
    },
    {
      "title": "Buy this waffle maker",
      "text": "Awesome machine!!! Make thick, fluffy waffles. Warms up and cooks quickly. I only wish I had purchased the double waffle maker",
      "rating": 5.0,
      "verified": true,
      "author": "Michael A Boiteau",
      "helpful_votes": 0,
      "publication_date": 20150411
    },
    {
      "title": "... ready maybe 5 mins and waffle cook time is super",
      "text": "Fastest from cold to ready maybe 5 mins and waffle cook time is super quick",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Hemann",
      "helpful_votes": 0,
      "publication_date": 20150916
    },
    {
      "title": "Waring WW180 Belgian waffle maker",
      "text": "This review is limited to my initial use of the product. It arrived well packaged and in perfect condition. The instruction booklet was easy to understand, and repeated important seasoning instructions. The waffle maker seems solidly built. I found no flaws in appearance. Performance was great. The Belgian waffles were wonderful. It heated up and was ready in under 3 minutes. It turned out waffles faster. The waffles lifted out cleanly and cleanup was a breeze. Based on this limited use I can say I'm completely satisfied. Hopefully it will last and be the last waffle maker I buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160426
    },
    {
      "title": "Great waffles, Fast.",
      "text": "I got this for my Local American Legion Post to use for our monthly fundraising breakfast. It is actually a replacement for an older Waring Pro Belgium waffle maker. It makes the same size waffle and seems to work faster than the older model. The only issue I have had is condensation buildup in the handle end of the frame.",
      "rating": 5.0,
      "verified": true,
      "author": "James Duddleston",
      "helpful_votes": 0,
      "publication_date": 20160309
    },
    {
      "title": "I purchased this COMMERCIAL waffle iron last July 2017 to ...",
      "text": "I purchased this COMMERCIAL waffle iron last July 2017 to use in my small café. I had been buying household waffle irons for $40.00 every three months when they burn out. So I thought this $311 COMMERCIAL one would last longer than three months. It lasted 6 months, heating element burn out. It has a years warranty on it so I guess I will be shipping it back to them every 6 months!! So frustrating!",
      "rating": 1.0,
      "verified": true,
      "author": "grandma9",
      "helpful_votes": 6,
      "publication_date": 20180109
    },
    {
      "title": "LUV IT!!!!!!!!",
      "text": "I absolutely love this Waffle Maker. You pay for for what you get absolutely applies here. This is so much better than the Waring Pro, that there is really no comparison. This one makes much much better waffles and never overflows. I like this so much that I bought one for my daughter and another for my girl friend. Just an update. I have now bought 5 of these. The last one was as a gift for my grand daughter's wedding!",
      "rating": 5.0,
      "verified": true,
      "author": "Lowrider",
      "helpful_votes": 0,
      "publication_date": 20160822
    },
    {
      "title": "!!!BUYER BEWARE!!!",
      "text": "An absolute waste of money. I had one of the previous versions of this product and it worked great until I finally wore it out but there seems to have been a design change (product in box doesn't even match picture on box) and now they are cheap pieces of junk. Parts that ought to be sturdy and made from metal are now just made from flimsy plastic that fractures easily. DO NOT BUY!",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas J Schumacher",
      "helpful_votes": 4,
      "publication_date": 20160720
    },
    {
      "title": "Get this one",
      "text": "Works absolutely fantastic.My husband makes waffles for me every Sunday (yes, I am very spoiled), the last one of this brand that we bought lasted about 3 years. When the other one finally died we knew that we needed a really good one, not a cheap option. This waffle iron heats quickly and consistently, has a timer that is easily heard and cleans easily. I would definitely buy it again!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather B.",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "stopped working in about a week.",
      "text": "stopped working in about a week. first it just wouldn't time out properly so we would time it separately and then it would turn off and on all the time till it just stopped working all together",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick Higgins",
      "helpful_votes": 2,
      "publication_date": 20171114
    },
    {
      "title": "but disappointed in the quality",
      "text": "Bought in September and by January it no longer works - the thermostat won't turn off the heating element and so it gets hotter and hotter until it burns all of the waffles. The price is decent for a commercial product, but disappointed in the quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160120
    },
    {
      "title": "Will it .....last?",
      "text": "Love it! Just hope the anti-sticking material will last!! The adjustment botton seem to be a little wobbly but for now its ok... Make awesome waffle ... Will gain weigh for sure lol",
      "rating": 5.0,
      "verified": true,
      "author": "Dany Grondin",
      "helpful_votes": 0,
      "publication_date": 20140103
    },
    {
      "title": "Great Product, Great Price",
      "text": "Great Price Fast Delivery, I love this waffle maker, it make awesome waffles!!",
      "rating": 5.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 0,
      "publication_date": 20150809
    },
    {
      "title": "Five Stars",
      "text": "This is a great heavy duty waffle iron. The measuring cup is handy",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160720
    },
    {
      "title": "great waffles",
      "text": "Overtime we have a number of waffle makers and this one is by far the best ever. It heats up fast and does a great job of evenly cooking the waffle.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard L. Quillin",
      "helpful_votes": 0,
      "publication_date": 20140928
    },
    {
      "title": "Five Stars",
      "text": "seems to be working well in my first several uses. Time will tell!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy D.",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Great waffles but has timer problems.",
      "text": "Makes great waffles but the timer feature that beeps when they are ready is not working correctly.",
      "rating": 3.0,
      "verified": true,
      "author": "S. Carlile",
      "helpful_votes": 3,
      "publication_date": 20150420
    },
    {
      "title": "I love this waffle maker",
      "text": "The reason I love this waffle maker so is because it is a well constructed commercial grade product with durable components and little to no plastic! It does take up a lot of counter space but because it is lightweight can be easily moved from storage to counter when needed. The all metal construction is such a pleasure and a breath of fresh air compared to the junk appliances so ubiquitous on the market.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Scalia",
      "helpful_votes": 13,
      "publication_date": 20120906
    },
    {
      "title": "LOVE LOVE LOVE THIS",
      "text": "LOVE LOVE LOVE THIS! We have spent A LOT of money on many different Belgium waffle makers! This one is pricey but not compared to the money wasted on inferior models! Crisp, light and fluffy waffles every time! Quick baking time makes is perfect for our family of 6! Would definitely recommend this one!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160605
    },
    {
      "title": "Commercial grade?",
      "text": "I would hate to use this in a commercial setting. But what's a person to do? I can't spend a grand for a real one. The hinges are loose and it is not all that rugged. I suppose it is better than the $50.00 \"residential\" units. I does work and it makes pretty nifty thick waffles. I recommend some belgium pearl sugar for those decadent crispy super sweet true belgian delights. When it quits, I will update this post.",
      "rating": 3.0,
      "verified": true,
      "author": "David Johnson",
      "helpful_votes": 2,
      "publication_date": 20140311
    },
    {
      "title": "Breaks down easily with heavy use and the company won't help fixing ...",
      "text": "Disapointment ! Breaks down easily with heavy use and the company won't help fixing it . Not to mention the bad users manual and website where there's no electrical scheme .",
      "rating": 1.0,
      "verified": true,
      "author": "Walter M Junior",
      "helpful_votes": 9,
      "publication_date": 20140704
    },
    {
      "title": "It's not what you think",
      "text": "Total crap. Plugged it in, turned it on, warmed up once... Never made a single waffle. Now beeps uncontrollably. Nothing in the manual and you'd think spending $300 on a waffle maker would be a bullet proof way to get the best manufactured machine. Don't waste your money. I read every review and was scared away by the cheaper units but, you'll be very disappointed by the quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Bencro",
      "helpful_votes": 12,
      "publication_date": 20130914
    },
    {
      "title": "Hinge failure leading to disintegration of entire waffle iron",
      "text": "The two phillips head screws holding the hinge together and the entire upper segment to the lower segment, stripped out of PLASTIC female receivers, which were broken. My recommendation to Waring is to make the screw \"receivers\" metal, not plastic (a guaranteed failure waiting to happen)....DO NOT BUY THIS WAFFLE IRON if longevity of the waffle iron is important....",
      "rating": 1.0,
      "verified": false,
      "author": "Dr. Barry Simmons",
      "helpful_votes": 3,
      "publication_date": 20190914
    },
    {
      "title": "Broke after a couple years - no warranty or repair",
      "text": "We only use ours on special occasions, and it still broke after three years. It just stopped turning on. When I called customer service they said the warranty is only one year and they are not reparable, so we just have to buy another one. Sounded like this is a common thing they deal with. Really poor value for the money.",
      "rating": 1.0,
      "verified": false,
      "author": "W_C_Co",
      "helpful_votes": 3,
      "publication_date": 20191112
    },
    {
      "title": "Loved it Til Crap Design Caused Hinge-Side to Fall Apart",
      "text": "Use 6 or 7 times per year and have had for a few years. really liked it... easy to use and felt solid until the two screws on the hinge side popped (stripped) out of the plastic female wholes they screw into yesterday. What a shame.What a crappy design. Should have been so easy to have a more secure base for those screws to anchor into. Crap design flaw that others have also run into.",
      "rating": 2.0,
      "verified": false,
      "author": "Randy R",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Works like a pro",
      "text": "The waffle maker itself works great, however the words started peeling off shortly after I bought it (2006) and started using it. BTW: I paid $80 for this very same waffle maker on QVC. Secondly, QVC sales a Waring double decker waffle maker for around $80.",
      "rating": 1.0,
      "verified": false,
      "author": "Ms Cali Cooker",
      "helpful_votes": 2,
      "publication_date": 20180614
    }
  ],
  "product_meta": {
    "title": "Waring (WW180) 25 Waffle/Hr Single Belgian Waffle Maker",
    "description": "This single Belgian waffle maker features heavy-duty commercial construction for durability. Designed with triple-coated nonstick plates that allows for easy removal of waffles and quick cleanup. Heating elements are embedded into plates for precise temperature control and even heat distribution, for a consistent golden-brown result. Includes power on and ready-to-bake LED indicators. Ready lights and audio beep signal when the unit is ready to cook and when the waffle is ready to serve. It contains adjustable temperature control that allows you to handle the thinnest and thickest waffle batters. Heavy-duty die-cast housing is durable and easy to clean. Rotary feature for even baking and browning. Removable, dishwasher-safe drip tray makes cleanup quick and easy. Available with 1 year limited warranty. Produces up to 35 1-1/4-inch thick waffles per hour. Requires 120 volts, 10 amps, 1200 watts, 60 hertz and is cULus and NSF approved. Measures 9-1/4-inch height by 10-1/4-inch width 20-inch depth.",
    "rating": 3.9,
    "feature_bullets": [
      "Single Belgian waffle maker features heavy-duty commercial construction for durability",
      "Designed with triple-coated nonstick plates that allows for easy removal of waffles and quick cleanup",
      "Heating elements are embedded into plates for precise temperature control and even heat distribution, for a consistent golden-brown result",
      "Includes power on and ready-to-bake LED indicators, audio beep signal when the unit is ready to cook and when the waffle is ready to serve",
      "Removable, dishwasher-safe drip tray makes cleanup quick and easy"
    ],
    "specifications": {
      "Product Dimensions": "20 x 10.25 x 9.25 inches",
      "Item Weight": "13.6 pounds",
      "Manufacturer": "Waring Commercial Inc.",
      "ASIN": "B004O2JW36",
      "Item model number": "WW180",
      "Customer Reviews": "3.9 out of 5 stars60 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#375,053 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 16, 2011"
    },
    "categories": [
      "Home & Kitchen",
      "Small Appliances",
      "Kitchen & Dining"
    ],
    "price": 379.0
  }
}