{
  "website_summaries": [
    {
      "verdict": "This undermount product is a great choice for those wanting a smaller hand sink at a cheaper price.",
      "pros": [
        "Sink features a sound deadening pad",
        "Available in 3 style options",
        "Rounded construction offers an easy-to-clean design",
        "Great depth"
      ],
      "cons": [
        "A few customers complained that the online measurements were incorrect"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Worked for me in a drop in mounting application. Looks and feel great!",
      "text": "Used in drop in mounting with adhesive holding it to my counter top. The quality of this sink in terms of thickness, finish and sound insulation sprayed on the underside is comparable to much more expensive sinks. I bought one which was an open box so I saved even more than the already low price. If you shop around at the big box stores you will find the special application sinks are much more expensive so this was a good buy. I bought the 2\" bar sink drain/strainer separately at a local large chain store for under $10. Highly recommend this sink.",
      "rating": 5.0,
      "verified": true,
      "author": "Kev",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "We love this sink",
      "text": "This was the perfect sink for our kitchen remodel, wide and deep but not too wide and deep. It's so nice to be able to put large pots or baking sheets all the way into the sink. It is also very lightweight.",
      "rating": 5.0,
      "verified": true,
      "author": "jbs1969",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Good sized Bar Sink",
      "text": "I like the look and size for a bar sink. But seems to have some kinda film on the bowl that keeps coming off when wiped with a paper towel. I hope that the finish is not coming off. Or could be just the oilish protection that the Chinese manufacturer puts on that we will find later causes some sort of cancer. Aside from the cancer scare, the bowl seems to do its job. Was a bit temperamental installing a drain, had to use more putty than expected to keep it from leaking. All is fine now.",
      "rating": 4.0,
      "verified": true,
      "author": "Utah Dan",
      "helpful_votes": 0,
      "publication_date": 20150630
    },
    {
      "title": "Very impressed!",
      "text": "Bought this to replace the nasty sink which was in the house we recently purchased. Lovely deep sink, great for washing pots and pans. I have only had dual sinks in the past and was worried about going to a single sink, but I'm very happy with this - plus the price beat our local hardware stores bu quite a bit! Can't beat amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "Busyworkingmom",
      "helpful_votes": 5,
      "publication_date": 20140221
    },
    {
      "title": "This sink is super deep! That took a bit to get used ...",
      "text": "This sink is super deep! That took a bit to get used to since my hubby and I are tall, but overall I'm pretty happy with it! The only time I notice the thinner stainless steel is when I pour hot water into the sink to drain noodles (or whatever). The sink will buckle/warp and make a loud \"Pop\" every time due to the heat transfer ... not a major problem, no long-term issues but it is annoying. Great sink for the price, though :-)",
      "rating": 4.0,
      "verified": true,
      "author": "Nikki",
      "helpful_votes": 0,
      "publication_date": 20160406
    },
    {
      "title": "Nice.",
      "text": "Nicely made, heavy duty. Template mostly worked so installation was fairly easy. Didn't get the use of the included clamps at all based on the instructions plus they are way too big. Tossed them and used another method for installation.",
      "rating": 4.0,
      "verified": true,
      "author": "C_Kritter",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Look for others....",
      "text": "Meh.....It looks okay, but after the sink drains, a puddle of water sits in the bottom...forever. It's not sloped enough on the bottom to fully drain. That part kind of sucks, because water spots on stainless, stink to remove.",
      "rating": 3.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 4,
      "publication_date": 20150719
    },
    {
      "title": "The sink is excellent quality material",
      "text": "The sink is excellent quality material. My only issue is the sink came with a small dent in one of the corners and from what I can tell it was not from poor shipping. For the sake of time on my counter tops being installed I was unable to exchange it. I would recommend the product to anyone but allow for more time than I did in order to exchange if need be.",
      "rating": 3.0,
      "verified": true,
      "author": "Bryan C",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Nice",
      "text": "Heavy duty. Seems well made/good quality. Price was reasonable. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian M",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Measurements are incorrect!",
      "text": "Their measurements on this are not correct. Ordered to finish a job and there was no way it was big enough. I ordered it because their stated measurements were what I needed. But that is not what I got.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Installed in basement bar, looks great",
      "text": "This product was installed underneath a granite counter top for a basement bar, it looks great and has functioned as a sink should... Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "C.T.",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Beautiful Large Sink!",
      "text": "This sink is exactly what I wanted. It is absolutely fabulous for the price. We also purchased a pull-down faucet. I would definitely recommend the pull down faucet or some sort of flexible spray hose - because this sink is so wide, sometimes food can be difficult to get to the drain. Having the spray hose helps wash stuff into the drain.",
      "rating": 5.0,
      "verified": true,
      "author": "Alyssa Stutz",
      "helpful_votes": 5,
      "publication_date": 20140102
    },
    {
      "title": "Beautiful sink",
      "text": "I installed this into my sprinter van's kitchen, and it's beautiful. Only bummer is I can't find a decent sink protector for the bottom.",
      "rating": 5.0,
      "verified": true,
      "author": "Poppins",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Big enough to swim in!",
      "text": "This sink is PERFECT! It's durable and beautiful. I could't wait for my kitchen to be remodeled to put it in. I did need to have the drain moved to accommodate the depth especially with a garbage disposal attached. It was worth the additional cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Theknowerofstuff",
      "helpful_votes": 2,
      "publication_date": 20160715
    },
    {
      "title": "Value, looks, and function",
      "text": "Very deep and looks great, nice thick walls with good sound \"insulation\". Deep enough to wash a small dog easily!! Only drawback is it does stain somewhat easily. Somehow got a white ring already. Not sure what caused it. You'll save a ton vs retail and vey good quality for the price. Comes with a template for your cutout and support tabs",
      "rating": 4.0,
      "verified": true,
      "author": "mims",
      "helpful_votes": 0,
      "publication_date": 20150618
    },
    {
      "title": "perfect size",
      "text": "perfect size and dimensions for a kitchen sink in my camper. any small er would be an issue with dishes fitting, any larger would be an issue with counter space",
      "rating": 5.0,
      "verified": true,
      "author": "Rick N.",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "Used in a modified Singer Sewing Machine Stand",
      "text": "High Quality sink. Very deep and have had no issues. I took an old Singer Sewing machine stand and modified it so my wife could use it for her guests when they come over. She places ice and then drinks inside which is really different.",
      "rating": 5.0,
      "verified": true,
      "author": "🎄 GrandpaJake 🎄",
      "helpful_votes": 0,
      "publication_date": 20160930
    },
    {
      "title": "Fantastic",
      "text": "Fantastic sink at a good price. Almost like a small bathtub compared to my old sink. I love the size, I love that it's a single basin rather than a double basin.",
      "rating": 5.0,
      "verified": true,
      "author": "MW LM",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Love it",
      "text": "Just put in new countertops. This sink is awesome! Will never go back to a dual basin sink again.",
      "rating": 5.0,
      "verified": true,
      "author": "John Helm",
      "helpful_votes": 0,
      "publication_date": 20151217
    },
    {
      "title": "Five Stars",
      "text": "looks good and deep for a basement man cave sink.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn S.",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Nice little sink.",
      "text": "Very nice little sink for the money. Used it in a laundry room I built on the house. No complaints. It does use a bar sized drain so be aware of that.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward Billings ",
      "helpful_votes": 0,
      "publication_date": 20160329
    },
    {
      "title": "Great value/Great Look!!",
      "text": "Love this sink. Just installed it. Construction is great. Very roomy and looks great. The only draw back is , the sink is very deep and if you are a tall person, standing for a long time over this sink, could cause a backache.",
      "rating": 4.0,
      "verified": true,
      "author": "patti marconi",
      "helpful_votes": 0,
      "publication_date": 20160623
    },
    {
      "title": "Five Stars",
      "text": "Been using this for quite a few months. Don't know how I ever did without it!",
      "rating": 5.0,
      "verified": true,
      "author": "Liz Sumter",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Perfect and high quality sink",
      "text": "Beautiful, well-made and heavy sink. It's the perfect size for our outdoor kitchen, with the sink deep enough to put bar glasses and rinse of cutting boards. Very nicely finished with a matte and not shiny, cheap polish.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151010
    },
    {
      "title": "nice. What I expected",
      "text": "Nice sink. Deep Looks modern. The picture makes it look shinier that how it is. Like more light silver than it actually is",
      "rating": 5.0,
      "verified": true,
      "author": "Dominika",
      "helpful_votes": 0,
      "publication_date": 20150420
    },
    {
      "title": "Kingston Brass sink",
      "text": "Good value. The finish could be smoother for ease of cleaning. It is very large and deep allowsing the washing of many items that don't fit in a typical two bowl sink.",
      "rating": 4.0,
      "verified": true,
      "author": "Gary G.",
      "helpful_votes": 0,
      "publication_date": 20140331
    },
    {
      "title": "Love my sink",
      "text": "Love my sink. Was worried i might regret getting a single basin but so far it's been perfect for our needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa a.m.s.",
      "helpful_votes": 0,
      "publication_date": 20150519
    },
    {
      "title": "Five Stars",
      "text": "Great value! Sound-proof coating ALL the way around (not just at the bottom). Saved about $80 from retail.",
      "rating": 5.0,
      "verified": true,
      "author": "DWiGuy",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "Best small sink ever!",
      "text": "What a great sink this is!! Hope it lasts a long time as a better replacement sink would be hard to find in any price range.",
      "rating": 5.0,
      "verified": true,
      "author": "HCEMT",
      "helpful_votes": 0,
      "publication_date": 20141228
    },
    {
      "title": "Deep sink",
      "text": "Nice deep sink and installed easily under our concrete countertops.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin L. Carsner",
      "helpful_votes": 0,
      "publication_date": 20160714
    },
    {
      "title": "Perfect",
      "text": "Perfect, had a double sink before and am very happy with this sink. Had no trouble installing it",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Peretson",
      "helpful_votes": 0,
      "publication_date": 20160723
    },
    {
      "title": "Five Stars",
      "text": "This is an awesome sink. Very large and easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "sunnydd",
      "helpful_votes": 0,
      "publication_date": 20150310
    },
    {
      "title": "I love this sink",
      "text": "I love this sink! It is deep enough for even my canning pot to be washed in. Very nice looking as well. First one they shipped had been damaged in transit and they had me a new one in 2 days.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "Great bar, prep or small sink",
      "text": "excellent small sink nice and deep good quality very reasonably priced",
      "rating": 5.0,
      "verified": true,
      "author": "robert rickman",
      "helpful_votes": 0,
      "publication_date": 20150218
    },
    {
      "title": "Big, Deep and Lovely Stainless Steel Sink",
      "text": "Love this sink it is a great value and so much nicer then anything i could find in the big box hardware stores.",
      "rating": 5.0,
      "verified": true,
      "author": "pegsta",
      "helpful_votes": 0,
      "publication_date": 20150806
    },
    {
      "title": "Sink looked ok but template on box was for a ...",
      "text": "Sink looked ok but template on box was for a different sink which caused wrong size hole cut in new granite countertop",
      "rating": 1.0,
      "verified": true,
      "author": "Vicky Lefler",
      "helpful_votes": 2,
      "publication_date": 20150827
    },
    {
      "title": "Love this sink",
      "text": "OMG! Love this sink! The bad part is you can put lots of dirty dishes and not even know it! Highly recommended!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Seashells",
      "helpful_votes": 0,
      "publication_date": 20150424
    },
    {
      "title": "in love",
      "text": "It installed so easily and its so big! I love this sink",
      "rating": 5.0,
      "verified": true,
      "author": "TherZ",
      "helpful_votes": 2,
      "publication_date": 20140728
    },
    {
      "title": "Perfect for 30 inch sink base!",
      "text": "Excellent quality! It was difficult finding a sink to fit our 30 inch sink base. I didn't want a 25 inch sink, but couldn't find many options that would fill the whole space. This sink fits like a glove and looks great! I love the depth as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Zerbs",
      "helpful_votes": 5,
      "publication_date": 20151209
    },
    {
      "title": "Great price, great quality",
      "text": "Looks great! Can't wait to see it complete our kitchen remodel.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 0,
      "publication_date": 20150609
    },
    {
      "title": "Great Value!!",
      "text": "Excellent value...looks way more expensive than it was, and super deep!!!",
      "rating": 5.0,
      "verified": true,
      "author": "puppydog",
      "helpful_votes": 0,
      "publication_date": 20150208
    },
    {
      "title": "ss sink w solid surface",
      "text": "We are a full cabinet & counter top shop, this was installed undermount under solid surface materal ..... look great and realy like the extra deep",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 3,
      "publication_date": 20131015
    },
    {
      "title": "Five Stars",
      "text": "Love this sink. I get so many compliments on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150520
    },
    {
      "title": "Five Stars",
      "text": "Love it. Fits perfectly in our new kitchen. It is very deep too.",
      "rating": 5.0,
      "verified": true,
      "author": "le petit pablo",
      "helpful_votes": 0,
      "publication_date": 20150429
    },
    {
      "title": "Fabulous sink, very deep",
      "text": "I LOVE the sink. Very deep, great for large pots and pans. Great deal too!! One of my favorite fixtures in my new home.",
      "rating": 5.0,
      "verified": true,
      "author": "Jobie W.",
      "helpful_votes": 2,
      "publication_date": 20130621
    },
    {
      "title": "Five Stars",
      "text": "Very nice stainless steel sink and the depth is perfect. I would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20150912
    },
    {
      "title": "Overall good sink. Only reason I did not give it ...",
      "text": "Overall good sink. Only reason I did not give it 5 stars is because the sink hole was directly in the center of the sink. It is advertised on amazon and the picture indicates that the sink hole was placed at the center back part of the sink.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20150330
    },
    {
      "title": "... each side of my new sink cabinet but fiS BEAUTIFULLY with my new",
      "text": "Had to put a notch on each side of my new sink cabinet but fiS BEAUTIFULLY with my new countertop",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Lucas",
      "helpful_votes": 0,
      "publication_date": 20150310
    },
    {
      "title": "Sink is nice and deep and seems like good quality",
      "text": "Sink is nice and deep and seems like good quality. Has sound deadening on the backside. However the picture shows the drain hole in the back of the sink and this is not what I received. The sink I received had the drain hole in the middle which actually worked out better for the plumbing of my disposal.",
      "rating": 4.0,
      "verified": true,
      "author": "Curmudgeon",
      "helpful_votes": 0,
      "publication_date": 20150227
    },
    {
      "title": "Sink",
      "text": "The sink was just as promised and works well for our needs. Also, it cleans up well. We did need to purchase a drain for it.",
      "rating": 4.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 2,
      "publication_date": 20140526
    },
    {
      "title": "C& M",
      "text": "great product, used in a new island we put in our kitchen. Our plumber said it was of good quality.",
      "rating": 5.0,
      "verified": true,
      "author": "carol hicks",
      "helpful_votes": 3,
      "publication_date": 20140103
    },
    {
      "title": "beautiful deep sink!",
      "text": "We have just installed the kingston new sink with granite countertops--we shall see how it goes. So far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "mabulloc",
      "helpful_votes": 0,
      "publication_date": 20131004
    },
    {
      "title": "the quality o this product is ok.",
      "text": "the quality o this product is ok. Be careful, if you use the paper template to help you open a hole on your counter top.",
      "rating": 3.0,
      "verified": true,
      "author": "Allen&Alice",
      "helpful_votes": 0,
      "publication_date": 20140222
    }
  ],
  "product_meta": {
    "title": "Kingston Brass Gourmetier GKUS16168 Undermount Single Bowl Bar Sink 16x16x8 (LxWxD) Brushed Stainless Steel",
    "description": "Style:GKUS16168| Size:16-Inch-Length by 16-Inch-Width by 8-Inch-Depth, 18 GaugeThe single-bowl undermount kitchen sink features a long square-shaped basin measured 16-Inch in length and width. The basin contains more than enough space for washing kitchen appliances, preparing food and is made of high quality stainless steel for reliance and durability. The sink is also fully protected by a heavy-duty sound deadening pad to minimize noise while washing appliances in the sink.\n\nFROM THE MANUFACTURER\nThe single-bowl undermount kitchen sink features a long square-shaped basin measured 16-Inch in length and width. The basin contains more than enough space for washing kitchen appliances, preparing food and is made of high quality stainless steel for reliance and durability. The sink is also fully protected by a heavy-duty sound deadening pad to minimize noise while washing appliances in the sink.",
    "rating": 4.5,
    "feature_bullets": [
      "Long-lasting and easy to clean",
      "Includes a sound-deadening pad and full undercoating for sound absorption.",
      "18-Gauge thickness with no pre-drilled faucet hole. 2.06 inches drain",
      "Exposed surfaces are hand-polished to a lustrous brushed nickel finish",
      "Single bowl undermount design"
    ],
    "specifications": {
      "Manufacturer": "Kingston Brass",
      "Part Number": "GKUS16168",
      "Item Weight": "5.86 pounds",
      "Product Dimensions": "16 x 16 x 8 inches",
      "Item model number": "GKUS16168",
      "Is Discontinued By Manufacturer": "No",
      "Size": "16-Inch-Length by 16-Inch-Width by 8-Inch-Depth, 18 Gauge",
      "Color": "Brushed Nickel",
      "Style": "GKUS16168",
      "Finish": "Polished",
      "Material": "Stainless Steel",
      "Shape": "Square",
      "Installation Method": "Undermount",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "One Year Limited Warranty",
      "ASIN": "B004Q9D940",
      "Customer Reviews": "4.5 out of 5 stars103 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#99,131 in Tools & Home Improvement",
      "Date First Available": "November 3, 2010"
    },
    "categories": [
      "Kitchen Sinks",
      "Kitchen & Bath Fixtures",
      "Kitchen Fixtures",
      "Single Bowl",
      "Tools & Home Improvement",
      "Kitchen & Bar Sinks"
    ],
    "price": 81.22
  }
}