{
  "website_summaries": [
    {
      "verdict": "A great alternative to our top pick if you are looking for something a little smaller.",
      "pros": [
        "Foam padding around the perimeter",
        "Flexible fabric ladder included",
        "Easy to set up",
        "Large size",
        "Durable construction"
      ],
      "cons": [
        "Some users have complained that there is not much bounce to this trampoline"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not a happy customer.",
      "text": "We bought this Hopper as a Christmas present for our grandchildren. We were very excited about our purchase until this weekend when we put it in the water.. Along the folded crease there were small holes which caused the thing to leak air. I had to inflate this thing 4 times during the day. When I called the customer service number to complain I was told that the warranty does not cover HOLES! The float had not even been used 6 hours! And I have had to patch up holes before the kids could even use it. We paid too much for a defective product. Not a happy customer.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 21,
      "publication_date": 20160531
    },
    {
      "title": "it is not a trampoline and the bouncing part of it is almost useless. If you are looking for a high-quality floating ...",
      "text": "This is a high-quality product and is very well made. However, it is not a trampoline and the bouncing part of it is almost useless. If you are looking for a high-quality floating island that the kids can jump-off and have a good time, this is a good one to get. If you are looking to \"get some air\" and launch into the water, do not buy this, as you will get very little bounce from it.",
      "rating": 3.0,
      "verified": true,
      "author": "jgarch",
      "helpful_votes": 11,
      "publication_date": 20160623
    },
    {
      "title": "Does not bounce",
      "text": "They should really change the name of this thing bc, as others have said, this thing really does not allow for bouncing. My kids enjoy it as a swim platform on our lake, but there is absolutely no bouncy-ness to it. The black surface area sinks in as you walk or jump, and does not spring back up. That has nothing to do with how tight you blow it up. Ours is tight; the design just doesn’t allow for a tout spring.",
      "rating": 3.0,
      "verified": true,
      "author": "AMT",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "If you leave it in the water it is fine but if you have to bring it out of ...",
      "text": "Blow up took only minutes with a small pump. If you leave it in the water it is fine but if you have to bring it out of the water to store it every time pay attention to the weight of it. My husband did it not have a problem but there is no way I could have. Over all great quality. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "the rider",
      "helpful_votes": 2,
      "publication_date": 20180701
    },
    {
      "title": "Easy set up",
      "text": "Delivered on time with no problems. Easy set up. I used a shop vac to inflate it. Took about 15 minutes. I use it extensively on our lake with the grandchildren and their friends. Best recommendation is from my granddaughter, \"I love it grandpa\".",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Spindt",
      "helpful_votes": 3,
      "publication_date": 20170815
    },
    {
      "title": "Don’t waste your money on the slide.",
      "text": "The Island Hopper itself was OK. The kids played on it the first day and haven’t returned to it. They were expecting a trampoline on the water. Not even close. I ordered the accompanying slide for an extra $300. It is a complete waste of money. Poor design. This slide is air filled tubes connected by a fabric overlay. Not sturdy enough to support even a 5 year old child. Our neighbors have a different brand. Their slide has an enclosed, air filled, chamber. Theirs works great",
      "rating": 3.0,
      "verified": true,
      "author": "Tony M.",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Swimming fun for all this summewr!",
      "text": "We purchased this for a lake like swimming pool. It is large enough to hold several kids and will be a feature at the pool this summer! It is replacing a Wibit water trampoline and is a better price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190531
    },
    {
      "title": "Returning it an overpriced float",
      "text": "we live on the water could not wait to get this and followed instruction easy however this thing has NO bounce you cannot jump on it it is instead an overprice FLOAT Returning it",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160831
    },
    {
      "title": "No pump or adapter to inflate",
      "text": "The valve to blow up the float is a special size, and no pump was provided whereas the tan and green model (not available for purchase on Prime) says it comes with a pump. I expected this one too as well, but it doesn’t, so now I am scrambling to try to find a way to blow it up.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Great purchase",
      "text": "Our kids love the island hopper. We are so happy with the purchase. It is easy to blow up and deflate. Great investment!",
      "rating": 5.0,
      "verified": true,
      "author": "Andy L. Trotter",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Lasted 2 years",
      "text": "Simple review... ours lasted 2 years. You can decide if that's worth the cost. I won't be being another.",
      "rating": 2.0,
      "verified": true,
      "author": "Derek Drury",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "This is a bouncer, not a trampoline",
      "text": "Kids liked the bouncer, not a trampoline. Encourage purchasing a high rate inflator to save time.",
      "rating": 3.0,
      "verified": true,
      "author": "Mort",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Kids had a great time on it at the lake",
      "text": "Item is everything it was advertised to be. Kids had a great time on it at the lake.",
      "rating": 5.0,
      "verified": true,
      "author": "Tri-City Properties",
      "helpful_votes": 0,
      "publication_date": 20150824
    },
    {
      "title": "Five Stars",
      "text": "Very easy to set up ! Kids enjoy it for hours on end.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Webb",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "trampoline is perfect..",
      "text": "trampoline is perfect...4 step ladder as promised in product description did not come with trampoline. a flimsy rope ladder did, and this floats under the trampoline when stepped on. trampoline is now not accessible to get up on!!! and no on at amazon is responding to my emails to send the correct ladder!?!! very disappointing.",
      "rating": 5.0,
      "verified": true,
      "author": "barry w",
      "helpful_votes": 4,
      "publication_date": 20140804
    },
    {
      "title": "Not really a trampoline!",
      "text": "It's built well but I didn't realize it doesn't haven any springs. It hardly bounces and shouldn't really be called a trampoline. Very expensive item for not really being what it states. You are better off just getting a lounger than this, because that's all it's really good for.",
      "rating": 1.0,
      "verified": true,
      "author": "Jacob Dockendorf",
      "helpful_votes": 7,
      "publication_date": 20150710
    },
    {
      "title": "Hugely Disappointed",
      "text": "This raft arrived with a hole in the netting which wasn't found until two hours of prep and set up. Very disappointed because I purchased the raft for my grandkids for the 4th of July at my lake home - they were displaced earlier in the week by a fire in their home and were so very much looking forward to playing on the raft yesterday.",
      "rating": 1.0,
      "verified": true,
      "author": "Kathleen Francke",
      "helpful_votes": 3,
      "publication_date": 20150705
    },
    {
      "title": "fun fun fun",
      "text": "this a lot of fun but need a few peole to help clean it we had one that was a little smaller easier to clean but not as much room to flip around on",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria S.",
      "helpful_votes": 9,
      "publication_date": 20130104
    },
    {
      "title": "Durability",
      "text": "Bought the Bouncer in 2012 as a Christmas present for the grandchildren. Placed it in the bay off of Long Island in 2013. Our 7 Grandchildren love it. In 2015 I added the Alligator Head and tail. While it does require some effort to store the bouncer every winter it comes with living in the Northeast. As the children get older the number of users increase. The occasional pin hole which results from use is easily repaired over the winter months.",
      "rating": 5.0,
      "verified": false,
      "author": "Paul Dujardin",
      "helpful_votes": 3,
      "publication_date": 20190814
    },
    {
      "title": "The company that handles is wonderful to deal with regarding your order",
      "text": "The company that handles is wonderful to deal with regarding your order. This is my second bouncer for the lake. The one I replaced was still in great condition. So much so, that someone decided they needed more than I did. After a year of lake without it, my grands decided we needed another. You will not be sorry In this investment. I just regret that I am too old to bounce, too! Recommend to any one looking for hours of lake fun for kids.",
      "rating": 5.0,
      "verified": false,
      "author": "fan",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Excellent product!",
      "text": "Love this trampoline. Easy to set up and anchor. We take it out of the water during the week and it is easy to lift onto the dock with 2 people. I had some questions and they were excellent at responding and helping. I definitely recommend this!!! Fun for all ages.",
      "rating": 5.0,
      "verified": false,
      "author": "Elaine S.",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "My personal island",
      "text": "Our family loves our water bouncer. The whole family can use it at once and have a great time. Bought it knowing it wouldn't bounce much but still works great as a floating island. Seems to be super durable. We have had no problems with it and we have had it up for 2 summers.",
      "rating": 5.0,
      "verified": false,
      "author": "Kenny Giacomini",
      "helpful_votes": 0,
      "publication_date": 20170222
    },
    {
      "title": "Great buy",
      "text": "We only use this for holiday weekends and the WHOLE FAMILY uses it and absolutely loves it. We have a bunch of adults who like to use it as a drinking and lounging platform and it works great.",
      "rating": 5.0,
      "verified": false,
      "author": "Michelle Denisse",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "Longevity is worth the price",
      "text": "We anchor our bouncer on our lake every summer. This will be our 5th year with it and its still holding up great. Everyone on the lake loves using it. Longevity is worth the price.",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170302
    }
  ],
  "product_meta": {
    "title": "Island Hopper 13' Bounce N Splash Padded Water Bouncer",
    "description": "This manageable 13′ size was designed for hard use and longevity. The spring-less, interlaced nylon webbing “bouncer” design uses tube flex features to give the user an enjoyable “bouncer” lift with a sturdy trampoline feel. This bouncer inflates and deflates in 10 mins and is very portable compared to a water trampolines. Aqua Sports Technology stands behind this quality claim with the best warranty in the industry.",
    "rating": 3.3,
    "feature_bullets": [
      "13 ft Water Bouncer ONLY. 5 year seam “No Blow-Out” Limited warranty",
      "Exclusive ½” foam perimeter padding for comfort and safety. Heavy commercial construction using 1000 denier PVC material.",
      "Spring-less, interlaced nylon webbing “bouncer” design.",
      "Bouncer dimensions: 10' jump surface & 26” tall tube up off the water.",
      "10 swimming assisted handles, 6 anchor secure D-rings, 4 step easy access soft ladder."
    ],
    "specifications": {
      "Product Dimensions": "156 x 156 x 30 inches",
      "Item Weight": "77 pounds",
      "ASIN": "B004YC7P8A",
      "Item model number": "13'BSPLASH",
      "Manufacturer recommended age": "36 months - 3 years",
      "Best Sellers Rank": "#298,124 in Toys & Games",
      "Customer Reviews": "3.3 out of 5 stars35 ratings3.3 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "36 months - 3 years",
      "Department": "Unisex-adult",
      "Manufacturer": "Aqua Sport Technology"
    },
    "categories": [
      "Toys & Games",
      "Sports & Outdoor Play",
      "Inflatable Bouncers"
    ],
    "price": 1049.99
  }
}