{
  "website_summaries": [
    {
      "verdict": "The best starter bow for kids on the market, this is ready to use right away, with no tuning needed.",
      "pros": [
        "Comes tuned and ready to use right out of the box",
        "Lightweight with a 20-lb",
        "draw that is easy for children to handle",
        "Draw weight can be adjusted if necessary"
      ],
      "cons": [
        "Nock point may be set too high initially, requiring adjustment",
        "No sight included"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Does not have a let-off!",
      "text": "This bow does not have a let-off! The whole point of the cam/pulley system in a compound bow is so that all the pull weight lets off at full draw. Meaning a 10 pound pull weight (normal for this bow) drops to only 2-3 pounds at the end of the pull. This lets the archer hold steady, aim, and release accurately and consistently. Learning how to shoot on this bow will force a shooter to learn recurve bow mechanics - which isn’t a bad thing, but is for the wrong kind of bow.",
      "rating": 3.0,
      "verified": true,
      "author": "John Wei",
      "helpful_votes": 11,
      "publication_date": 20191109
    },
    {
      "title": "Perfect!",
      "text": "This bow is perfect for my 9 year old daughter! She got it for Christmas (thanks for shipping a replacement one so quickly as the first arrived damaged) and was able to go out and start shooting immediately! The bow was accurate and set where she could start shooting right away. I love that Genesis makes an affordable bow for left handed people. I also love that this bow will grow with her. She and I were both able to take turns shooting her bow while teaching her how to properly stand, aim, and fire. Great bow! Thank you Genesis for making such a great bow at such a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie Dempster",
      "helpful_votes": 2,
      "publication_date": 20191227
    },
    {
      "title": "It will allow two keyed padlocks (as required by archery rules) and has nice straps to secure the bow as well as arrow ...",
      "text": "This is the approved competition bow for our son's middle school archery club. It is EXACTLY what the school offers the students to shoot with. He LOVES his bow; do NOT skimp on a cheap case... the plastic case with yellow hinges is also what the majority of archers carry. It will allow two keyed padlocks (as required by archery rules) and has nice straps to secure the bow as well as arrow holders. He even tosses his forearm guard and glove in. BEFORE YOU INVEST, MAKE SURE YOU KNOW WHICH HAND YOUR CHILD SHOOTS WITH!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20180611
    },
    {
      "title": "Five Stars",
      "text": "Terrific bow for the beginner my son is using it in school for archery competitions",
      "rating": 5.0,
      "verified": true,
      "author": "JCrane",
      "helpful_votes": 15,
      "publication_date": 20161105
    },
    {
      "title": "My Daughter loves it!",
      "text": "Bought this for my 10yr old daughter, who recently made the archery team & she loves it! We paired it with a case, also purchased on Amazon & its a perfect setup. She initially complained that the strings hurt her fingers when she drew back, but a week or so later she must have gotten use to it, because she said it \"wasn't that bad now\". I suspect that any bow would likely have the same issue for a child. Anyhow, she loves the bow & is doing well with it (except for the part where she set her target up on my adirondack chair for practice...grrr! lol!)",
      "rating": 5.0,
      "verified": true,
      "author": "Karen from NC",
      "helpful_votes": 3,
      "publication_date": 20151102
    },
    {
      "title": "Great looking bow!",
      "text": "Nice looking bow. My soon was really pleased to get this. It looks very nice, especially for a start out bow for my 16 year old. It shoots far for practicing, but by the specs, it's not good for actual hunting.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "No let off or accessories",
      "text": "Didn't like the fact that it had no let off. Yes, it's only 20lbs, but a smaller person has difficulty holding that weight while aiming. I got a 30-70lb bow with a 75% let off, so at 30lbs, you're only holding 8lbs while aiming. The 30lb bow is stronger and there's lots of room for growth.",
      "rating": 3.0,
      "verified": true,
      "author": "Glock",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Great niece loves it.",
      "text": "Got this for my great niece who is taking archery in school. It arrived on time. She loves it. I think the bow was set at 20 lbs but the one she uses at school is set at 15. She said it was easy to follow the included directions to set her bow tension.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Can't beat a Genesis!",
      "text": "We bought these to give away as door prizes at our youth Pheasants Forever event. We have been familiar with and used Genesis bows for years and they are great for beginners to learn on. The extra bonus is that if they choose to get involved in NASP down the road, they have their bow for that too!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave R. ",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Great bow",
      "text": "I am a NASP coach, so of course this is the only bow for my 8yr old son! It is the 3rd one we own now (plus one 'Pro'). Never had a single problem with any of them except having to re-glue 1 nock. Really haven't serviced them aside from an occassiinal waxing of strings and cable. Great all around buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Filograsso",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Archery girls!",
      "text": "I actually ordered 2 of these for my girls. 1 of them was not the correct color but a simple phone call and they expedited a new one to me no charge (as long as I returned the incorrect one within 30 days) it was correct and arrived in 2 days. Very happy with quality fit and finish",
      "rating": 5.0,
      "verified": true,
      "author": "John Taylor",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Great bow for the money.",
      "text": "Great starter bow. Excellent craftsmanship. My son, daughter and I used this one together. My son is 14 and earned his Archery merit badge using this bow. It's easy to pull back, yet has power to send the arrows where they should be hitting. My daughter tried it. She's 11. You can adjust it to lower the draw weight. I took this bow to a Boy Scout camp and most of the boys participating in Archery, used this bow and loved it. Great investment without having to pay over a 1,000.00 on a high performance bow. I would say this one is just fine for beginner to intermediate.",
      "rating": 5.0,
      "verified": true,
      "author": "TRFBTop Contributor: Drums",
      "helpful_votes": 2,
      "publication_date": 20140704
    },
    {
      "title": "Perfect Equipment for Beginning Archers",
      "text": "My son loves this bow. This is his first year in archery in 7th grade and he used this at the National competition! Maybe it's the bow, maybe it's his sheer talent. It could be both. I like to think that this bow has helped him become more confident in his skills since it has performed well and he has not any any issues with it. I would highly recommend this for beginning archers.",
      "rating": 5.0,
      "verified": true,
      "author": "Kari",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "Good bow for great price for NASP",
      "text": "Bow is great. Good looking and functions well. Took my son to archery nationals this year! My only complaint is the center rest and string and cable don’t last very long. I would definitely buy a higher quality string and cable if buying for NASP program.",
      "rating": 5.0,
      "verified": true,
      "author": "Ty6897",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Well satisfied.",
      "text": "For it's purpose in the school archery program, exactly what we needed. Did need to adjust it's strength down for our 9 year old granddaughter, but works fine. And the color choice was hers. And Amazon had the best price by far. Well satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Ohioan",
      "helpful_votes": 0,
      "publication_date": 20170324
    },
    {
      "title": "Great bow for competing.",
      "text": "Love this bow! We bought this for our son to have his own bow instead of using the schools and it has made a big difference in his accuracy. He loves it. For state competition they will tape the back with the camo lines. Just be aware of that.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Wade",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Doesn't meet competition requirements",
      "text": "We purchased this bow for my son for use on his high school competition team. Unfortunately, the camo does not meet competition requirements. We had to paint it. Also, the metal nock is also not allowed. We found these two things out too late - so he wasn't able to use this bow in his first two meets, and wound up with a lower score. It would be helpful it this non-compliance was disclosed in the description.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Sliwicki",
      "helpful_votes": 0,
      "publication_date": 20160201
    },
    {
      "title": "I love this bow for teaching because I can take it ...",
      "text": "I am a certified 4-H archery instructor. I love this bow for teaching because I can take it up and down for a range of students. I am a petite lady and so this bow at it's highest is perfect for me.... but I can take my nephews who are just learning and they can have a go on it too. It doesn't have the bells and whistles, those you can add if you want. But if you want a solid, hearty, bow for youth, campers, beginners... THIS",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica B",
      "helpful_votes": 2,
      "publication_date": 20140710
    },
    {
      "title": "bow",
      "text": "We ordered this for our daughter for Christmas, and it came promptly. For clarification this bow is not purple, but rather a kind of \"hot/dark pink\" color. I do not think boys would be into this color. We knew what color it was before ordering it, my daughter did not care for the pale pink and white bow. The bow pull weight is easily adjustable, and we like the bow. My daughter had already used a bow of this brand in her 4H club. Even small adults, or people with weak arms would be able to use this bow.",
      "rating": 5.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 0,
      "publication_date": 20140303
    },
    {
      "title": "Great Bow - Fun",
      "text": "I am a traditional archer but I got my NASP cert so I could start a program at my school. This bow is great, easy to adjust draw for any shooter. Lots of fun to shoot, I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris S",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Very nice bow",
      "text": "Our twelve year old used a bow when she was at camp and wanted one for Christmas. I contacted the staff and the recommended this one as many different ages may use it. It’s exactly what she wanted. Don’t forget to order the arrows and a target!",
      "rating": 5.0,
      "verified": true,
      "author": "Rostie",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Got this for My 9 yr old she is in ...",
      "text": "Got this for My 9 yr old she is in archery at school and this is the only brand and type they can have to use in the archery club and for competition but couldn't find a girl color around here anywhere ! So when I saw this one on here I was so excited! But even more so when I saw my daughters face it was priceless! So worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "James & Jennifer Champion",
      "helpful_votes": 0,
      "publication_date": 20160209
    },
    {
      "title": "Great quality bow",
      "text": "Great quality bow. My son uses it on a daily basis and it has held up great after 11 months of use. It is the official NASP bow, so if your child is on his/her school archery team it can be used.",
      "rating": 5.0,
      "verified": true,
      "author": "J Haynes",
      "helpful_votes": 2,
      "publication_date": 20151112
    },
    {
      "title": "they both love their bow",
      "text": "my 2 sons are in the NASP league, they both love their bow. the white camo finish is very nice, favorite of most people out at the competitions.",
      "rating": 5.0,
      "verified": true,
      "author": "al",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "I purchased this for my son to be used with ...",
      "text": "I purchased this for my son to be used with his archery team. He was a brand new archer and after a few back and forth issues with receiving the correct item we finally got the right one and it works perfectly. My son is able to shoot well and it fits his frame and arm length as it is supposed to (15 year old boy).",
      "rating": 4.0,
      "verified": true,
      "author": "Mika Mosier",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "Great bow.",
      "text": "No issues, works great. My son used it in the NASP state competition. Since the bow is camouflage, for competition we did have to put tape on the site window so he couldn't use the pattern for a site reference.",
      "rating": 5.0,
      "verified": true,
      "author": "Woobird",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "Perfectly",
      "text": "Daughter shoot archery in school, this is the exact bow used is school just better color choices. These bows are quality",
      "rating": 5.0,
      "verified": true,
      "author": "Marshall Clark",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Nice bow",
      "text": "I love this bow. I'm able to shoot accurately with it and doesn't take a lot of strength to draw it. My mom can draw this bow and she's in her 70's. I'm sure it would be a great bow for young learners too. It's easy to adjust the pull. I highly recommend this bow for young and old alike.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim H.",
      "helpful_votes": 2,
      "publication_date": 20150526
    },
    {
      "title": "His favorite Birthday Present!",
      "text": "My son received it as a birthday gift. He used the same Bow at Boy Scout Summer Camp. He won the Camp Competition for the 2nd year in a row.",
      "rating": 5.0,
      "verified": true,
      "author": "PVR",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Great for new archers",
      "text": "Bought this for my niece who is on a school archery team. She absolutely loves it. Great way for kids to get into the sport",
      "rating": 5.0,
      "verified": true,
      "author": "Jonny84",
      "helpful_votes": 0,
      "publication_date": 20170704
    },
    {
      "title": "Solid, and adjustable weight!",
      "text": "Excellent first bow for my nine year old! Great american company! and they offer maintenance kits and accessories like fishing reals and mounts on their web site!",
      "rating": 5.0,
      "verified": true,
      "author": "sonyman",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Great bow",
      "text": "Great bow. Bought it for my daughter a few years ago. She's in a Genesis archery league. Been using it for four or five leagues now with no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "Very Nice Bow!",
      "text": "I purchased this bow for my son, he is interested in Archery. Great Bow, great for beginners. I would recommend to anyone who is just starting out.",
      "rating": 5.0,
      "verified": true,
      "author": "Bella",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Great starter compound bow",
      "text": "I bought this bow for my 12-year-old stepson as his first starter bow. He loves it. The pull weight is perfect for him and the draw length is just right. Now if only he can dial in his aim...",
      "rating": 5.0,
      "verified": true,
      "author": "Steve B.",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Zombies beware",
      "text": "Picked up this bow as a beginning for me with intention to pass it to my daughter when she is able to pull it. It's a solid performer an adjustable 10-20# draw weight (no-letoff). The riser has all the connection points for arrow rest, sight, stabilizers, etc. As an entry-level bow I love it and expect that it will be good for me as I build my skills and be a great hand-down to my daughter in a few years.",
      "rating": 5.0,
      "verified": true,
      "author": "P. B. Terry",
      "helpful_votes": 0,
      "publication_date": 20140109
    },
    {
      "title": "... this for my 10yr old and it fits her great. It's a well built bow that will grow ...",
      "text": "Got this for my 10yr old and it fits her great. It's a well built bow that will grow her and lets her stick an arrow at more than 10yrds.",
      "rating": 5.0,
      "verified": true,
      "author": "gerryv",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Great item",
      "text": "My son really loves it. The only bow allowed to be used at his school and for competition.",
      "rating": 5.0,
      "verified": true,
      "author": "Ferdi",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Great for beginner youth",
      "text": "Great beginner bow for my 9 yr old. Very adjustable. Wish I knew there was no place for a stabilizer though as I bought a small one for it as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Super beginning bow.",
      "text": "I purchased this bow for my daughter's birthday. According to her: \"I love it, it's great\". Upon asking what there is to love about this bow, she replied that the draw is a good amount of weight for beginners and the weight of the bow is perfect. With that, I am satisfied that this was a very good purchase. As my daughter increases her experience I am sure we will be back to look at bows for advanced and expert level archers. thanks,",
      "rating": 5.0,
      "verified": true,
      "author": "Walt Nalli",
      "helpful_votes": 0,
      "publication_date": 20140822
    },
    {
      "title": "Nice bow, great for kids",
      "text": "This bow is used in the school archery program. It's well made and shoots like a dream, It can be dialed up or down for power and can be set crazy light for smaller kids. The really neat thing is that I can shoot it too. NOTE: if you've got a very small child they now make a mini version...(I can't remember the name) that is physically lighter to hold up. This bow is kind of heavy for smaller kids.",
      "rating": 5.0,
      "verified": true,
      "author": "ILoveWood",
      "helpful_votes": 0,
      "publication_date": 20140115
    },
    {
      "title": "Great product!!!",
      "text": "Bow came in on time for Christmas for my daughter. Bow is beautiful and very accurate. My daughter shoots competitively and her scores have gone up since having her own bow.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Presnell",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Great bow",
      "text": "The produce itself was great, however it did not come with a key to adjust it.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley Bryant",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "I love it for me as well though",
      "text": "Heavy for my 9-year old, but she can control this nonetheless. For smaller children, you will need something to protect their inner arm...the arm guards don't cut it, so even an old tube sock will do (once you cut off the toes, as the arrows rub on my daughter's inside slow (guards wouldn't allow her to bend her arm). I love it for me as well though...love the fact that one bow works for everyone in the family!",
      "rating": 5.0,
      "verified": true,
      "author": "Nan",
      "helpful_votes": 0,
      "publication_date": 20150119
    },
    {
      "title": "Nicely Constructed Bow",
      "text": "My 12YO granddaughter wanted this for Christmas. Quality is good. Too cold to try it out yet. She picked this one because she has shot the same make of bow.",
      "rating": 5.0,
      "verified": true,
      "author": "gbnpp05",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Great Bow; Purchased for my son's School Archery Team",
      "text": "Great buy! My 12 year-old son, who is the height of most 10 year-olds, has no problem with this bow. He is on a traveling archery team and we had to specifically purchase a Genesis Original for his school's team. He loves the white camo, because he stands out, so he says. :)",
      "rating": 5.0,
      "verified": true,
      "author": "TFM",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "good for the price",
      "text": "The Genesis bow is the official bow for NASP. Affordable and is a decent product, but you get what you pay for (quality)",
      "rating": 3.0,
      "verified": true,
      "author": "Jeepgirl5900",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Very good product",
      "text": "Excellent bow for cost! Looks very good & truly great quality for price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "This bow hits the target with value and quality!",
      "text": "This bow is a great value for the money compared to other bows made for beginners! My son found it easy to use and he’s improving his scores in competition matches!",
      "rating": 5.0,
      "verified": true,
      "author": "Raleigh ",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Awesome",
      "text": "Bought for my son for Christmas and he loves it. Super easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Austin",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Bullseye",
      "text": "Great for a first time student of archery. My 12 year old son has no issues using it, and loves the orange color.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsey ",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Good quality",
      "text": "Very nice bow, got a left hand one for my 10 year old daughter, she loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Blackmore ",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Great bow but for price should come with at least starter arrows",
      "text": "Wish it came with arrows case and bow are great durability",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Herrod",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Nice , easy.",
      "text": "Son took second place with this bow out of the box with only a couple hours of handling at the local bowhunters festival.",
      "rating": 5.0,
      "verified": true,
      "author": "eloise chrobak",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Have fun. Be safe. Play outdoors",
      "text": "My son is in 7th grade and on archery team I bought him a used bow same brand and he and his team won state championship this year. Next month we travel to Kentucky for national title so all his hard work needed a reward so I bought him this new Guinness bow he loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Cory Moore",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Great starting bow.",
      "text": "My 9 year old is very happy with this bow. Easy to adjust and ready to shoot out of the box.",
      "rating": 5.0,
      "verified": true,
      "author": "shawn s",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Works great she loves it",
      "text": "I got this for my daughter's archery team. Works great she loves it! Meets all requirements of the competitions.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Nephew love it!",
      "text": "My nephew uses it for his Archery Team at school. Very high quality.",
      "rating": 5.0,
      "verified": true,
      "author": "D.",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Good bow",
      "text": "Good now. Purchased as a gift. He will grow into it",
      "rating": 4.0,
      "verified": true,
      "author": "LA",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Light weight and easy use",
      "text": "I love this bow!! I am a 27 year old female who doesn't have much strength. This bow is easy to use and light enough to hold for long periods of time.",
      "rating": 5.0,
      "verified": true,
      "author": "Miccia",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "The bow is great",
      "text": "The bow is great however ordered LH Lemon and Amazon mailed RH Pink Lemonade. Got a replacement and the second bow was correct but took two weeks to get a bow.",
      "rating": 4.0,
      "verified": true,
      "author": "CHARLES R.",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "Decent starter or camp bow",
      "text": "Pretty good \"camp\" bow. I put a sight on it to help my daughter's shooting, and it did help at the beginner level, but this bow will never be part of any competition shoots she enters. The only reason I give it 4 stars (vs. 5) is that she progressed out of this bow's capabilities within the first season of shooting.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20141104
    },
    {
      "title": "Very Satisfied",
      "text": "I wanted my son to have his own bow for the NASP program. These are surprisingly nice bows. I can understand why the NASP program adopted them as the standard. If your child is in this program, I recommend getting them their own. It's all about consistency. Practicing and competing with the same equipment is a good thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Turner",
      "helpful_votes": 0,
      "publication_date": 20150526
    },
    {
      "title": "Archery bow",
      "text": "High quality bow, perfect for my granddaughter who is 9.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce R. Ledoux",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "The Standard for youth bows",
      "text": "The standard bow used for youth competitions. Maybe a bit pricier than other bows, but it will last longer and have higher resale, making it a less costly bow than other less expensive bows.",
      "rating": 5.0,
      "verified": true,
      "author": "SadieRocks",
      "helpful_votes": 0,
      "publication_date": 20160219
    },
    {
      "title": "Perfect bow for my wife",
      "text": "I bought this as a gift for my wife. She has become very accurate very quickly shooting it.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "A Great Bow",
      "text": "My son loves this bow. It's a great beginner's bow with room to expand.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Griffin",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "NASP bow, great program for schools.",
      "text": "Students that use their own bows tend to work harder and focus more in practice. Great investment for your child or grandchild.",
      "rating": 5.0,
      "verified": true,
      "author": "Rand",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "great for all ages",
      "text": "These bows are fantastic. Easy to adjust strength for different users. My kids love them and I can use them too",
      "rating": 5.0,
      "verified": true,
      "author": "Trago Wallace",
      "helpful_votes": 0,
      "publication_date": 20170222
    },
    {
      "title": "Great bow!",
      "text": "This was the brand my grandson needed for archery in school. Well made, accurate, and well built! Very happy with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Great bow for having fun",
      "text": "Great bow for having fun. Kids enjoy shooting it and it works well for adults as well without having to make any adjustments. Teaches the fundamentals without the stress of a stronger hunting bow.",
      "rating": 4.0,
      "verified": true,
      "author": "AJO",
      "helpful_votes": 2,
      "publication_date": 20150217
    },
    {
      "title": "Best youth bow available at any price",
      "text": "The folks at Mathews make great products, and this youth bow is no exception to that rule. My 13 year old son shoots 50 to 100 arrows per day, and just LOVES this bow. The quality of construction are superb, and the bow is easily adjusted and maintained. This is an excellent purchase for any youth archer, or a woman who is just beginning to enjoy the sport.",
      "rating": 5.0,
      "verified": true,
      "author": "LCR",
      "helpful_votes": 0,
      "publication_date": 20131215
    },
    {
      "title": "Fantastic Product at a low price!",
      "text": "I love the bow. I got one because I wanted to shoot with my oldest daughter. The price for the bow on Amazon is very hard to beat. The prices are easily $175 and up everywhere else. Also you can't out grow one of these bows. My daughter has had one for a couple years now and has made it to Worlds through the NASP program in the schools.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 0,
      "publication_date": 20150622
    },
    {
      "title": "this is a great recreational bow",
      "text": "Don't know what to add that hasn't already been said, but the whole family can shoot this bow, and actually quite well. The ease of draw weight adjustment, as well as well documented tuning techniques, this is a great recreational bow.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Sevier",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "Easily adjustable, and perfectly comfortable",
      "text": "Perfect for my 10 year old daughter. The cam is simple to adjust, and the grip is comfortable. The bolt rest is a bit fragile, but with some care, I think it will last. The frame is obviously well made, and I can assume that we will get a lifetime of use out of this bow.",
      "rating": 5.0,
      "verified": true,
      "author": "CH",
      "helpful_votes": 0,
      "publication_date": 20150311
    },
    {
      "title": "Good Quality Bow",
      "text": "Bought for my 9yr old daughter. She loves it! Easy for any beginner or good quality Bow",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Duffy",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "High quality, easy to use fits everyone.",
      "text": "This is a great bow for target archery. Easily generates interest for the whole family. We are having a great time with it and highly recommend this to anyone interested in learning archery or just having fun.",
      "rating": 5.0,
      "verified": true,
      "author": "karlen",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Great Bow for archery",
      "text": "This is a great bow for youth or an adult. It can be used for competition and just shooting in the back yard by the family. This is the fifth Genesis bow our family has purchased. They come ready to use, but can be upgraded with sights, stabilizers and custom rests. Great product for the money!",
      "rating": 5.0,
      "verified": true,
      "author": "C Tynch",
      "helpful_votes": 0,
      "publication_date": 20151001
    },
    {
      "title": "Perfect for beginners",
      "text": "I'm just starting out and this is the perfect bow for beginners. I tried looking for one like this in stores and they were all for children. Being an adult woman it was tough to find a bow to start out with that I was able to pull back. Trust me its worth every penny. I was at a sporting goods store shortly after I purchased this bow and it was $30 more in the store!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Williams",
      "helpful_votes": 0,
      "publication_date": 20141103
    },
    {
      "title": "We love the quality and color of this bow",
      "text": "We love the quality and color of this bow. We did however return it and get the Genesis Mini bow. This one was too big and had too heavy of a draw for our 6 year old girl!",
      "rating": 5.0,
      "verified": true,
      "author": "hslice57",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "My bow didn’t come with a cable slide",
      "text": "When I was shooting, it caused the string to wear. Overall it’s a great bow.",
      "rating": 4.0,
      "verified": true,
      "author": "charlie ",
      "helpful_votes": 3,
      "publication_date": 20181009
    },
    {
      "title": "Great archery bow",
      "text": "My daughter got this for school archery. Great bow. She loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "JoannieM",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Five Stars",
      "text": "This was purchased for my son. He uses it constantly and likes it. No complaints here",
      "rating": 5.0,
      "verified": true,
      "author": "Franhp",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "Perfect  bow for NASP!!!",
      "text": "Perfect bow for NASP. Arrived just as promised. My kid loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "ABE",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "The bow is of great quality. Very happy about this purchase",
      "text": "This was very impressive. The bow is of great quality. Very happy about this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer G",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Shoots straight and steady",
      "text": "My son moved to number one in his age group, thanks to having his own bow that shoots straight and steady. Great for school age archery team.",
      "rating": 5.0,
      "verified": true,
      "author": "john WL",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "great product",
      "text": "fantastic bow. A lot of fun and very durable. Friends of mine bought their own after watching me demonstrate how accurate this bow can shoot. It allowed me to practice the fundamentals that I have used on other bows. Even though I have since started shooting a (at my full draw) 55 pound recurve bow, I still pick up my genesis bow and shoot it.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerard Pichette",
      "helpful_votes": 0,
      "publication_date": 20140802
    },
    {
      "title": "My kids love it",
      "text": "My sons absolutely fell in love with it. We did some research and decided to buy this bow. I am happy to say that it meets our expectations. Very good quality and performance. I am writing this review after they have used it for some time and rate it as five star.",
      "rating": 5.0,
      "verified": true,
      "author": "Anbar",
      "helpful_votes": 2,
      "publication_date": 20130607
    },
    {
      "title": "It's comfortable in hand",
      "text": "I bought this bow for myself. It's comfortable in hand, adjustable draw weight, not heavy. For me, as a beginner, has been great for getting the feel and technique without too much craziness going on.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika Ruthstrom",
      "helpful_votes": 0,
      "publication_date": 20150622
    },
    {
      "title": "perfect for my 14 year-old son, and the whole family",
      "text": "Bought this for our son for Christmas. He's really into archery. Easy to use for all of us... different sizes and ages. Although it was a bit expensive, we'd get it again. The yellow also turned out to be very cool.",
      "rating": 5.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20140607
    },
    {
      "title": "Great boy that will last for years.",
      "text": "A great item for beginners or seasoned youth archers an is compliant for all school sanctioned archery programs. The price was also much better than the big box sports stores.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael W Hendrix",
      "helpful_votes": 0,
      "publication_date": 20160105
    },
    {
      "title": "Good for beginner.",
      "text": "I’m 65 and find this bow easy to use and helpful for upper body exercise.",
      "rating": 5.0,
      "verified": true,
      "author": "Fayegene",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Love it",
      "text": "Bought it for daughter for her archery class. Love it. Easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "J. J. ",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Great bow for new young shooters.",
      "text": "Genesis bow is easily adjustable for not so strong grandkids. After adjustment is made you can sneak a turn on the 2 limb screws so your kid has to work harder and get stronger and doesn't know it. Am having fun using it. Installed new arrow rest and sight to match my larger compound bow. Did take some modifications. Bow shoots well at 10 yards that's all the room I have in the basement for learning before going out in the spring. The kid has put 6 arrows in a 2 inch circle. He feels good and that is what it is all about. Self esteem.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Nelson",
      "helpful_votes": 0,
      "publication_date": 20140119
    },
    {
      "title": "Great value",
      "text": "My son bought this bow for an archery group at school. Nice little bow. He will be able to use it for quite a while. Good value for the price. He really likes it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bingewatcher",
      "helpful_votes": 0,
      "publication_date": 20150421
    },
    {
      "title": "NASP approved",
      "text": "Great bow, my son just started shooting NASP archery for his school. This bow will could last him years.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Roberts",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Great bow!",
      "text": "This is a perfect bow for kids. I bought this for a 10year girl, the draw weight is very adjustable and the price on Amazon is much lower than anywhere else. I've seen the bow's go for $225, I paid $149 for this one.",
      "rating": 5.0,
      "verified": true,
      "author": "DaveWGentry",
      "helpful_votes": 0,
      "publication_date": 20140109
    },
    {
      "title": "Bowie",
      "text": "My son is shooting better already. Top notch bow for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "William A. Robles",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "It's the bomdiggity.",
      "text": "I ordered this for a neighbor girl, senior in high school taking archery. She is well pleased with this bow. She said it's the bomdiggity.",
      "rating": 5.0,
      "verified": true,
      "author": "Old Texan",
      "helpful_votes": 0,
      "publication_date": 20160327
    },
    {
      "title": "Perfect",
      "text": "My 5th grader is in archery club and this how is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Shells",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Great bow for sport. Can't go wrong with this.",
      "text": "Works great for learning to shoot the bow. A lot of fun for my wife and 11yr old daughter. Really easy to use. No hassles. No complications. It just works! Really a lot of fun and a quality bow. Maybe not the best \"hunting\" bow due to lower power but that's not why we bought this.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Dye",
      "helpful_votes": 0,
      "publication_date": 20140319
    }
  ],
  "product_meta": {
    "title": "Genesis Original Bow",
    "description": "Genesis bows are the first compound bows designed to eliminate let-off and specific draw length requirements, making it the perfect choice for beginner and intermediate archers of all ages, sizes and athletic abilities. They're a great introduction to the sport of archery because beginners won't develop bad habits caused by an ill-fitting bow. The Original bow can be adjusted as the archer grows and develops their skills. Details: Zero let-off design; Light draw weight comes standard at 20 lbs and can be safely lowered to 10 lbs - all you need is a 3/16\" hex wrench (provided) to adjust draw weight; Covers all standard draw lengths ranging between 15\"-30\"; Machined 6061-T6 aluminum riser, aluminum cam and idler wheel; Composite limbs; Cable guard; Molded competition grip; Riser is drilled and tapped for standard accessories; 0% let-off; 35 1/2\" axle-to-axle; 7 5/8\" brace height.",
    "rating": 4.9,
    "feature_bullets": [
      "Official bow of the National Archery in the Schools Program (NASP).",
      "Great starter bow for archers of all ages, sizes and athletic abilities.",
      "With no specific draw length requirement, kids can't outgrow this bow.",
      "Includes a machined 6061-T6 aluminum riser, aluminum cam and idler wheel, sturdy composite limbs and high-strength bowstrings – all made in the USA.",
      "Built with single-cam technology, there are no tuning issues, less recoil, less noise and more accurate shooting."
    ],
    "specifications": {
      "Date First Available": "June 10, 2016",
      "ASIN": "B01GVCVN7O",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Archery",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Compound Bows",
      "Hunting & Fishing",
      "Bows"
    ],
    "price": 152.49
  }
}