{
  "website_summaries": [
    {
      "verdict": "It's hard to find a more solid bag in this price range. No doubt the best bang for your buck.",
      "pros": [
        "Garners praise for its hefty build – not to mention the generous workout kit that comes with it",
        "Very affordable"
      ],
      "cons": [
        "The elastic cord that users can attach to increase resistance is a bit flimsy"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Love this bag",
      "text": "POW! Right in the kisser! POW!! Right in the kisser! Love this bag!!!!! I ended up mounting this to a tree as I'm simply renting the house I'm staying at. So far it has taken the elements well. Bad day? Hit the bag. Need exercise? Hit the bag. Want to kill someone? Well...get professional help...then hit the bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Jarvis",
      "helpful_votes": 294,
      "publication_date": 20150901
    },
    {
      "title": "Recommended",
      "text": "I bought this for my wife she seems to be angry these days. I hung it in the garage, she goes in there.. hits the bag instead of me and it's all good. It's well made and heavy. The gloves are cheap but you should invest in good gloves if you wanna box or hit the bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon buyer",
      "helpful_votes": 179,
      "publication_date": 20151107
    },
    {
      "title": "Straps broke at 3 months!",
      "text": "It was great until the strap broke. We have had it three months (to the day) and the strap broke with just normal use (and it is just one 12 y/o that uses it). We are very disappointed. The pictures on the website look like the stitching section is far larger that it is.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Jarrett",
      "helpful_votes": 62,
      "publication_date": 20170822
    },
    {
      "title": "False advertising",
      "text": "First time ever I haven't been happy with purchase. This product is advertised by picture and product description as being sold as a whole kit with 70 lb bag, chain, gloves, hand wraps and bungee. I only got the bag and chain. There is no packaging slip or way to correct. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "sheil poisson",
      "helpful_votes": 41,
      "publication_date": 20171121
    },
    {
      "title": "disappointed",
      "text": "2 of the 4 straps on the bag have already broken in 4 months... pretty disappointed in the stiching.",
      "rating": 2.0,
      "verified": true,
      "author": "natalie",
      "helpful_votes": 303,
      "publication_date": 20150118
    },
    {
      "title": "Very Well Made Punching Bag! Great Deal!",
      "text": "Bought this bag for my son and it was delivered without a flaw, Have checked out many bags and this one was one of the best choice. Very well made bag and great filling. Should stand up to time very well. You would be surprised how many bags are for sale and have no filling at all. The other thing that makes this a good choice is that it comes with the starter gloves, also nicely made. Would recommenced to anyone! Just remember to purchase a hanging kit for how you plan to hang the bag!",
      "rating": 5.0,
      "verified": true,
      "author": "James Guadgnola",
      "helpful_votes": 8,
      "publication_date": 20180209
    },
    {
      "title": "Heavy Duty Punching Bag",
      "text": "This Everlast 70-Pound punching bag is hanging on our porch. Our teenage children use it to practice their Tae Kwon Do punching and kicking. It's been handling the medium/light abuse it has been getting just fine. Our bag came with open ended gloves which the children tried once and really didn't care for. Overall a quality bag punching bag with some nice accessories. I will say that when you hang the bag make sure the flat side of the metal hangers are situated facing the bag straps. Somehow one of our metal hangers got turned and it started to cut one of the bag straps. Other than that we've not had any problems.",
      "rating": 4.0,
      "verified": true,
      "author": "William Struse",
      "helpful_votes": 8,
      "publication_date": 20171014
    },
    {
      "title": "Punching bag",
      "text": "I bought this for my Grandson for Christmas. He is ecstatic that he has his own punching bag! However it didn't last long before three straps broke. How disappointing! The sad thing was this was the replacement bag to the first one because it came damaged in the shipment. It had a hole in it!",
      "rating": 5.0,
      "verified": true,
      "author": "justgalee",
      "helpful_votes": 10,
      "publication_date": 20180218
    },
    {
      "title": "Fun for the whole family",
      "text": "So far, so good. I decided to hang mine outside. I don't notice any weather damage so far. Oh, it's definitely heavy! I had to have my giant 13 year-old son help me hoist it up to hang it. It's very therapeutic to beat up on this bag. I've discovered I really like kicking it! I know nothing about these things, as this is the first bag I've ever owned or messed with.",
      "rating": 5.0,
      "verified": true,
      "author": "rocknmomx5",
      "helpful_votes": 5,
      "publication_date": 20180326
    },
    {
      "title": "OMG so much fun for a $100",
      "text": "OMG so much fun !! One of the best purchases I ever made on Amazon . I purchased the wood beam ceiling hanger and double end heavy bag anchor at the same time. This package is AMAZING !!!, and the fact that something weighing over 70 pounds shipped UPS ground for free with my Prime membership was great. I am 50+ and this heavy bag is such a fun workout. Some days I'm Rocky and some days I'm Iron Mike....and best of all, nobody punches back.",
      "rating": 5.0,
      "verified": true,
      "author": "Bdawg ",
      "helpful_votes": 7,
      "publication_date": 20170910
    },
    {
      "title": "Nice bag, should lower the price and not include ...",
      "text": "Nice bag, should lower the price and not include the poor quality gloves which are useless. I would suggest the manufactures add straps at the bottom of the bag, so that you may turn the bag after several months use. The stuffing tends to migrate down to the lower part of the bag and if you could turn the bag in reverse, bottom to top, this would help to shift the stuffing.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill--San Antonio",
      "helpful_votes": 4,
      "publication_date": 20180108
    },
    {
      "title": "Ordered \"kit\" got just the bag",
      "text": "Like a few others, I did not receive the gloves, wrap or cord...just the bag. Was a real disappointment for us on Christmas morning. I wish I had inspected contents when it arrived. Seems this is a \"pattern failure\". BEWARE",
      "rating": 1.0,
      "verified": true,
      "author": "Trindaddy",
      "helpful_votes": 4,
      "publication_date": 20190103
    },
    {
      "title": "great for the price",
      "text": "At first when buying this i was kind of nervous because of the reviews but when I opened the box the bag had no tears, it came with everything it says it supposed to come with and ive had it since July. I personally didnt think the gloves were \"too thin\" people are just wimps. Im a 21 year old female and this was an amazing product! highly recommend espeically if you have teenagers who want to start boxing!",
      "rating": 5.0,
      "verified": true,
      "author": "Mallory Adkins",
      "helpful_votes": 3,
      "publication_date": 20191226
    },
    {
      "title": "Quality product",
      "text": "Good quality product for the price ($75 at the time). Perfect for my 14yr old son to start out on. It's durable for the average user. Comes with everything we needed to put it up in our garage with no drilling, but I have exposed beams to hang it on. Gloves are great for beginners, had wraps for his wrists. Great starter product for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott B",
      "helpful_votes": 2,
      "publication_date": 20190705
    },
    {
      "title": "Great set right our of the box",
      "text": "Purchased for my 15 year olds birthday. Everything he needed to knock out his teenage aggression without getting into trouble. Seems sturdy and came with appropriate protection for his hands to start. We will upgrade to better gloves but this came ready to go right out of the box. Happy momma, happy kid.",
      "rating": 5.0,
      "verified": true,
      "author": "blog, drink, beach, repeat",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Good bag and worth every penny.",
      "text": "I have boxed for years and I ordered this bag worried that it would be bad but actually the thing is durable and worth the money. ALSO it doesn't come with the chains to put it up on the ceiling so make sure to get that before you get excited to punch the bag. The wraps were actually nicer meaning they have velcrow to keep them on your hands. Do not punch the bag without gloves, it WILL cause damage to the bag overtime.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Was too hard and the zipper broke.",
      "text": "It was so hard that it hurt my wrists even when using wraps and gloves. That isn't that big of a deal. I was just going to take some of the stuffing and sand bags out. The zipper broke as I tried to unzip it. The top piece is now detached from the bag with no way to reattach it. I ended up with duct tape holding the top of the bag together. It doesn't look good. If feels way better now but my brand new bag looks like crap. If the zipper had worked, I am sure I would be happy with it.",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Thick Cushion for Hard, but Safe Contact!",
      "text": "This is a worthy purchase and even better that it was under 100 bucks. The gloves are a little tight, but that's because I've got big hands. Plus, I'm not concerned since the cushion within the gloves is very thick and supportive in contact against the bag or a wall. I've yet to try the wraps or to hook the bag to a frame but the bag is very thick and absorbing of contact. I'd highly recommend this for minor training (stress relief, too). Thank you, Everlast.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis Vasqez",
      "helpful_votes": 3,
      "publication_date": 20161220
    },
    {
      "title": "This is a very nice heavy bag",
      "text": "This is a very nice heavy bag. I've had it for about a couple of weeks and it's holding up nicely. The gloves are a nice addition. I am happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie W.",
      "helpful_votes": 19,
      "publication_date": 20170105
    },
    {
      "title": "Its a punching bag",
      "text": "Ordered this kit as a beginner before investing in more expensive stuff. The bungee cord, didnt arrive. The bag I got was red, the marketplace reseller I dealt with marked it up and dropshipped from WalMart after 2 weeks of me asking them where my item was. all in all. I should have just gone to Dicks and picked it up in person.",
      "rating": 3.0,
      "verified": true,
      "author": "TheSpacePope",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "whole family uses it",
      "text": "Bought this for my son for his birthday. He's been doing Jiu-Jitsu for about a year and has been wanting a bag to workout at home with. Sent him this for his birthday and he loves it. Get to great workout at home and the kids seem to enjoy it too",
      "rating": 5.0,
      "verified": true,
      "author": "beach_girl",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Good but could be better",
      "text": "The carabiners it comes with are very cheap and not durable at all. 3 of them broke after only 5 times of use. Had to buy heavy duty locking carabiners to even be able to use it (13 dollars a piece)... so assume you'll need to spend probably 30 bucks on decent ones or this won't last long... not a bad bag though",
      "rating": 3.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Just buy it!",
      "text": "This is great. I have a gym in my home. I needed something that I could take my anger out on. It's great. Now I'm not such an ass. Plus my arms and body looks great!",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa Fochtman",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Solid bag love it",
      "text": "Strong bag made great. Bag maybe is lil over stuffed. I use it but my son nearly broke his wrist. He's lil shorter so punching at the bottom of the bag especially for beginner big no-no.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "It is heavy.",
      "text": "Overall it’s a great bag. My son is a beginner and he loves it. The only fault so far is that some of the stitching had pulled out before we received it. I think it happened in shipping. The box was a crumpled mess. The bag is too heavy for the box it comes in. And the bag is squished into the box. I had to stitch the bag up where the stitches came out",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon Britt",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Great Bag - Torn Packaging, Missing Bungee Cord",
      "text": "The bag itself was exactly as described. The only issue was that the packaging was torn open in a couple spaces and the bungee cord was inside.. Just as had been mentioned by other reviewers. I have not tried to contact Everlast about it because I didn't think it was worth my time. Other reviewers have mentioned that their customer service is sub-par. If i need a bungee cord i'm sure i can find on in my garage.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Everlast does not last.",
      "text": "The top of the bag is secured by a zipper. The zipper broke and the bag basically blew it's top on the bags fourth use. Luckily Amazon gave us a full refund plus shipping. Bought an Outslayer 100 pound bag after and have been using it three to four times a week for the past five months and it's still awesome. I recommend going with one of those instead.",
      "rating": 1.0,
      "verified": true,
      "author": "pjm1989",
      "helpful_votes": 11,
      "publication_date": 20160428
    },
    {
      "title": "Great buy",
      "text": "This is perfect for just starting out. It comes with wraps, gloves and a bungee cord as well. It took me less than 5 mins to hang up. After a good 30 minute workout i was beat. It felt good. Also, a little tip...i used 4 cinderblocks to hold the bag in place with an extra bungee cord and now the bag doesn't swing.",
      "rating": 5.0,
      "verified": true,
      "author": "wayne",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Great purchase for the price",
      "text": "This is a very good beginner/intermediate heavy bag. The construction of the bag itself is very good. Feels solid and not cheap. Very easy to set up. The only place this purchase lacks is in the accessories. The gloves are not great but they will protect your hands. The wraps are not long enough for most males to properly wrap your hands but 180 inch wraps aren't that expensive so it's not a huge problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Terry Donat",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Buyer Beware - Not Actually a “Kit”",
      "text": "I received the bag, which was smaller than I expected but seems fine. However, the other items (gloves, wrist tape, bungee) were not in the box. The question is: do I want to deal with returning a 70 pound bag with the hope that reordering it will go better?",
      "rating": 1.0,
      "verified": true,
      "author": "njw",
      "helpful_votes": 3,
      "publication_date": 20190208
    },
    {
      "title": "Great starter kit",
      "text": "I've been using this bag 5 days a week, 1-2 hrs a day for about a month now, and so far all of the stitching and strapping has held up perfectly. And I'm a 6'2 200 lb dude, so I'm not exactly throwing cupcakes either lol. The wraps are a little short but they get the job done, the gloves are comfortable and I havent tried the bungee cord yet. All in all great for someone looking to dip their toes in boxing or who's bored of running for cardio like me and wants to shake things up a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Lugo",
      "helpful_votes": 2,
      "publication_date": 20171003
    },
    {
      "title": "Great buy for the price!",
      "text": "Great bag for the price. I like the gloves too. They're a good \"in the middle\" kind of size. My husband has rather large hands and they fit him (barely) and I have very small hands and they still fit me comfortably. I bought the heavy bag mounting kit because I hung it from the ceiling. I like that it gives you a way to tie it off at the bottom so it doesn't swing so badly. Because we attached it to a low ceiling we were able to use the included bungee cord and chain to attach it to two 25 lb dumbbells we have rather than buying the weighted bag holder.",
      "rating": 5.0,
      "verified": true,
      "author": "Singleton",
      "helpful_votes": 0,
      "publication_date": 20160120
    },
    {
      "title": "Bag zipper is broken, and was unzipped upon arrival.",
      "text": "Opened the box to fin the top of the bag unzipped, zipper pull broken and stuffing falling out all over the inside of the box....thankful we opened it prior to Christmas morning or my son would have been very disappointed. We were able to reverse the zipper with a paper clip and rezip it minus a grocery bag full of stuffing. VERY DISAPPOINTED.",
      "rating": 1.0,
      "verified": true,
      "author": "allison stucky",
      "helpful_votes": 6,
      "publication_date": 20171221
    },
    {
      "title": "Holes dont align and bolts dont fit.",
      "text": "-10 stars. Where do I even begin.. the package was late by 4 days, but I just assumed it was slow because it was a big package. When we did get it, we spent 5 hours trying to insert a bolt that was not going to work at all because obviously the holes weren't aligned. We broke a screwdriver in the process of trying to force the alignment, and even tried rocking the thing back and forth so that the bolt would fit. Nope, it never did, and we just gave up.",
      "rating": 1.0,
      "verified": true,
      "author": "Beth Vang",
      "helpful_votes": 2,
      "publication_date": 20180808
    },
    {
      "title": "Overall Good Starter Kit",
      "text": "I've had this for a few months now and it's held up nicely. I had to upgrade the gloves and definitely the wraps but was overall pleased with what it came with. It got me started and allowed me to mess around with it and learn the basics. Would recommend this purchase for those looking to get started in boxing but not wanting to spend too much.",
      "rating": 5.0,
      "verified": true,
      "author": "Ons Olivier ",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "The kit is worth it & amazing!",
      "text": "It brought exactly what was advertised. Unfortunately, I feel bad for the man who delivered this, as I live in an apartment without an elevator, so he had to walk all the way up the stairs carrying my 70 pound punching bag. Haha. Anyway, the gloves are perfect for punching the bag, and I have pretty large hands, but they fit perfectly. I would recommend this for anyone who’s looking forward to boxing, mma, or just to punch the bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Franco",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "I would highly recommend this bag for beginners",
      "text": "This bag is little smaller than I would have thought, but it looks durable and comes with the chain to hang it. I bought the bottom anchor to go with it which I think will be needed since it is relatively light. I would highly recommend this bag for beginners. Getting this thing shipped to my door with Amazon Prime was awesome. Saved me from buying a comparable item at a store and then be faced with lugging the thing to my car and from my car into my house. Great product and even better shipping thanks to Amazon. A++",
      "rating": 5.0,
      "verified": true,
      "author": "Slewis",
      "helpful_votes": 0,
      "publication_date": 20151016
    },
    {
      "title": "Seems like good quality but when I received the product the ...",
      "text": "Seems like good quality but when I received the product the top 1/4 of the box was torn almost completely off and taped back together (the tape did not hold). I'm not sure if it left the wear house like that or if it happened in the mail.",
      "rating": 3.0,
      "verified": true,
      "author": "Kbucks",
      "helpful_votes": 6,
      "publication_date": 20161223
    },
    {
      "title": "My wife got this for me for my birthday. ...",
      "text": "My wife got this for me for my birthday. I haven't gotten to hang it up since I need to weld a stand for it, but I've beat on it against the wall. Solid, heavy, strong. These are the adjectives I'd use to describe this bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Kseniya Thompson",
      "helpful_votes": 2,
      "publication_date": 20170723
    },
    {
      "title": "Wow",
      "text": "I've used this for a few months now & it helps me with stress so well. Also the price was worth it 100%",
      "rating": 5.0,
      "verified": true,
      "author": "Alexander Black",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Please buy it!",
      "text": "First time buying a punching bag I did a lot of research and I have to say I love this set is great for beginners durable well made. Even my wife is into it now",
      "rating": 5.0,
      "verified": true,
      "author": "JASSED SADER",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Good product, suited our needs (kiddo wanted to have ...",
      "text": "Good product, suited our needs (kiddo wanted to have one), came fully stuffed - do note the gloves it comes with aren't the most comfy... but not sure really what to expect from gloves. We bought separate gloves that were much more comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Nicholas",
      "helpful_votes": 2,
      "publication_date": 20170323
    },
    {
      "title": "Great product. It does exactly what it should",
      "text": "Second purchase of one of these. Great product. It does exactly what it should. Everyone in the family and often friends visiting love to take a few swings at it. The gloves it comes with are fine, but I replaced with mine with a set of lighter, half finger MMA style gloves which make it even better.",
      "rating": 5.0,
      "verified": true,
      "author": "JimmyG",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Durability isn't the best.",
      "text": "Nice small bag, after setting the bag up and my 15 year old hitting for a few days I noticed the seam where the zipper is coming apart. Not sure about the durability of this bag after 4 days of use.",
      "rating": 3.0,
      "verified": true,
      "author": "Frank Neubert",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Works",
      "text": "You can punch and kick it. Ended up buying a Century floor stand for this as we didn't have anywhere great to mount a hanging mount in our basement.",
      "rating": 5.0,
      "verified": true,
      "author": "nstrom",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Defect and bad customer experience.",
      "text": "The item has a defect. Reached out to customer service. They response and asked for a bunch of information and disappeared.... Bed experience. I cannot return it, because it is super heavy...",
      "rating": 1.0,
      "verified": true,
      "author": "Chen",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Exactly as advertised, great deal",
      "text": "Fast shipping, everything included as advertised. Good set up for the price. Update...I freaking love this bag. Gloves are a beginner set but if you wrap well they work good but hard hitters will need to upgrade and they wont work for larger hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicki",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "MISSING PARTS",
      "text": "I am missing the gloves , 2 bolts , 2 nuts , and 4 washes",
      "rating": 1.0,
      "verified": true,
      "author": "DAN C.",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Heavy Bag weighed less than 70 pounds",
      "text": "Seemed like a well made bag, however I had to return this product. It was advertised as a 70 Pound Bag, but when the entire box (including chain, gloves, bag) was weighed by UPS for return shipping the total weight was only 64 pounds.",
      "rating": 3.0,
      "verified": true,
      "author": "Irish Mom",
      "helpful_votes": 2,
      "publication_date": 20170306
    },
    {
      "title": "great bag",
      "text": "Something to be very careful about is the bag will be damn near solid at the bottom slowly getting softer at the top, so until you soften the entire bag up or even out the weight distribution somehow, be VREY careful punching or kicking/kneeing full force in the middle/bottom of the bag, it can easily damage your wrists and cause serious injury. As a tip keep good form and never let your muscles in your wrists relax when hitting the bag. Aside from that it is a very good bag, no bad smell, looks well-constructed, and takes a good beating 7 days a week!",
      "rating": 4.0,
      "verified": true,
      "author": "404UserNotFound",
      "helpful_votes": 0,
      "publication_date": 20130211
    },
    {
      "title": "Great bag, just what I expected.",
      "text": "The punching bag arrived, and I set it up easily with the Everlast Heavy Bag Ceiling Mount. It is solid, and comes with chains to attach it to a mount. The included gloves work fine for punching the bag, but I would not suggest using them in a boxing match. The included hand wraps are alright, they are inelastic, and a bit small. They also feel somewhat uncomfortable. The bag is a good workout, and feels good to punch. Overall I would say buy this item if you are looking for a good heavy bag.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew D.",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Id buy again",
      "text": "Im very impressed, readon being is i bought this for my son who is 19, he left this exposed outside in the rain, sun, and snow and its held up. Ohio winter was brutal this year and how this product held up is beyond me......",
      "rating": 5.0,
      "verified": true,
      "author": "David a Stewart Jr",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "... To get it directly shipped to her which was nice cause The bag is heavy",
      "text": "Bought this as a bridal shower gift on my friends registry and was able To get it directly shipped to her which was nice cause The bag is heavy. I was told it was a very easy set up and looks great in their home gym",
      "rating": 5.0,
      "verified": true,
      "author": "roxanne pacitti",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "Excellent Product",
      "text": "Love it. My training partners and I have been using it quite heavily for 6 months, punching and kicking, and it doesn't seem to have degraded in any way. This is great for the serious trainer who can't get to the gym all the time, or for the casual trainer who thinks punching something would be a great motivator to get/stay in shape. ALWAYS use gloves on this thing. My hands hurt a tiny bit at first, but I haven't had a problem in months. I haven't ever had a problem with my wrists but I always wrap them when using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20131128
    },
    {
      "title": "Great workout and stress reliever!",
      "text": "I’ve done kickboxing before and wanted something for home. This is great for my basement. It’s a little harder toward the bottom of the bag then I would like but overall it’s a great product.",
      "rating": 4.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Happy with my purchase.",
      "text": "We've had this bag for a few months now, and I have been really pleased with the quality of it. It was pretty easy to install. It has not had any issues with seems or material problems. My husband and I both use it, and it is a great addition to our house!",
      "rating": 5.0,
      "verified": true,
      "author": "Shawna",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Good all around bag",
      "text": "Received all contents advertised. I see some reviews that indicate they didn't receive everything, but mine was complete. It is a nice bag - not too heavy and not too light for me. Gloves are pretty decent and seem to be holding up well.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Grandinetti",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Arrived damaged",
      "text": "Arrived damaged but probably can still use. Will be contacting company regarding this issue. Otherwise nice bag for the price",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Great kit for the $$",
      "text": "While there just doesn't seem to be a great way of shipping this product (including mine being delivered and left outside in the rain while I was at work), this really is an excellent value. Kit includes a couple of D-rings to make removal of the bag (when the bag is hanging in your garage or guest-room) easier. Bad traffic? Tough day at work? Kid crying all the way home? Take a few swings at this bag and feel right as rain. Plus, when passers-by see you swinging punches at this thing, they'll think you're a badass. I'd imagine the same goes for would-be petty thieves...",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Urban",
      "helpful_votes": 0,
      "publication_date": 20130702
    },
    {
      "title": "Easty to mountil it",
      "text": "It was really easy to mount it? My son uses very often? The only thing is that the bag came with a little scratch, other than that very good",
      "rating": 4.0,
      "verified": true,
      "author": "Tannia Lisseth",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Punchline",
      "text": "My son is just starting jujitsu-the bag was a hit-I think I’m funny. The gloves are very light weight.",
      "rating": 5.0,
      "verified": true,
      "author": "jam",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Nice bag, junk gloves.",
      "text": "Nice bag. Seems well made. The gloves they send are a joke but the bag seems very nice for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Splitter",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Good price",
      "text": "Not heavy duty but perfect for the garage or basement gym. Can't beat the price, considering that it's more money at the sports store",
      "rating": 5.0,
      "verified": true,
      "author": "Geo",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Awesome purchase!",
      "text": "Bought this for my hubby for Christmas and it's perfect! Comes with everything needed for someone who is looking to get a good workout without spending a ton of $$. It was easy to hang and the quality of the product is wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "christopher sylvester",
      "helpful_votes": 2,
      "publication_date": 20170110
    },
    {
      "title": "Decent bag, short lifespan",
      "text": "After having this bag for 1 year, with 2-3x per week use for 30 minutes, the straps have torn through, and the bag is now useless. It was an okay bag, but certainly not high quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Tricia",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Durability",
      "text": "I got this for my nephew and he loves it. 6’ teenager with a heavy hand and he really enjoys this",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren P",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "It's a great 70lb bag. Cant ask for much more.",
      "text": "Recieved today. I checked it all out and seems pretty solid. The stitching looks pretty strong. Came with the chain to hang it on something. I got both gloves and wrist straps. All in all this was a great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Take my money ",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Appears durable and a quality product",
      "text": "Appears durable and a quality product. Arrived with everything in the box as advertized.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark D.Top Contributor: Photography",
      "helpful_votes": 3,
      "publication_date": 20170101
    },
    {
      "title": "Great work out",
      "text": "Very sturdy, I love the boxing gloves that it came with. My son plays with this all the time and has a great time, and gets a lot of energy out",
      "rating": 5.0,
      "verified": true,
      "author": "Lane R. ",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Be careful",
      "text": "The bag is exactly what you would expect it to be but be careful. If you use the gloves and hand wraps that come with this you will almost certainly injure yourself. They are not padded enough to hit a heavy bag. You only get one pair of hands - treat them right and use at least 12 oz training gloves and get 180 inch hand wraps.",
      "rating": 4.0,
      "verified": true,
      "author": "WBS",
      "helpful_votes": 13,
      "publication_date": 20150815
    },
    {
      "title": "3+ Months of Daily Beatings & it's holding up very well!",
      "text": "I gave this to my brother for Christmas, and he loves it! He beats on this thing every day, and the bag and gloves both have held up very well so far! Packaging was pretty beat up when it arrived, but I couldn't only imagine how hard it is to move around something this heavy without damaging the box. Everything inside was in good shape though! I would buy again, I am very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20150304
    },
    {
      "title": "Great bag to smack around",
      "text": "My first session with the bag felt great. It definitely has some weight to it, but not too much where it doesn’t move. Great for beginner and intermediate level to help work on technique and stance. Get a nice hit on the bag and it’ll move around, which I actually prefer for target practice.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Thumbs up",
      "text": "Solid choice for starting out. Gloves are of mediocre quality but sufficient",
      "rating": 5.0,
      "verified": true,
      "author": "Sealy",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Product",
      "text": "Just have to be motivated but it a good purchase",
      "rating": 4.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Medium setup  process. Nice and sturdy",
      "text": "Great quality, also easy setup. The gloves fit great and the punching bag isn't too hard, so it's good for beginners",
      "rating": 5.0,
      "verified": true,
      "author": "courtney",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Good sturdy bag with broke zipper",
      "text": "The bag seems to be very well made. I've used it a few times and really happy with it. Only complaint was upon receiving it the zipper was broke. It was zipped up, closed, but not sure how I'll open or close it again if I ever needed to add filling.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan Schaer",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "False advertising to me",
      "text": "The bag was a different color than expected and the gloves were supposed to be different as well.",
      "rating": 2.0,
      "verified": true,
      "author": "Shonda",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Heavy bag",
      "text": "I need a stand or hanging mechanism. But it’s a big bag and will take a lot of hits. I can’t wait to really use it",
      "rating": 5.0,
      "verified": true,
      "author": "Keeks",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Excellent",
      "text": "Excellent nothing was damaged bag hung just right for me",
      "rating": 5.0,
      "verified": true,
      "author": "ELECTRONIC PROS ",
      "helpful_votes": 3,
      "publication_date": 20170719
    },
    {
      "title": "Awesome with one exception",
      "text": "Bag and gloves are good. Straps are good as well. The mounting hardware was garbage though. I just took a heavy duty carabiner clip and used that instead",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn C. Gross",
      "helpful_votes": 2,
      "publication_date": 20161005
    },
    {
      "title": "Nice product",
      "text": "Held up and is quite heavy but does not include a connecting piece to connect it to a ceiling or beam.",
      "rating": 5.0,
      "verified": true,
      "author": "JH",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Great set, a win win!",
      "text": "I bought this for my husband for fathers day. This was something he's always wanted. I surprised him with this beautiful kit. The punching bag is heavy, and hard- exactly like it's suppose to be. The matching gloves are perfect fit. The cloth wrap thing is only for one hand. The material for the bag is leather. It's a great set and I'd recommend this to first time boxers.",
      "rating": 5.0,
      "verified": true,
      "author": "Mommy D",
      "helpful_votes": 0,
      "publication_date": 20150625
    },
    {
      "title": "Compact and Durable",
      "text": "Great compact punching bag. i was expecting this one to be fabric like my larger red one but its a smoother slick material that is a little hard to grip when making contact. I already had mma everlast gloves and found the seam in the included set to be very annoying but the hand wraps were a great addition.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy in AZ",
      "helpful_votes": 0,
      "publication_date": 20160316
    },
    {
      "title": "This is a great addition to my garage gym",
      "text": "This is a great addition to my garage gym. I use it for martial arts practice as well as a heavy bag for carrying or dragging when I teach BOOTCAMP.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Rogers",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Relieve stress and/or shape up",
      "text": "Hangs nice, comes with gloves, appears quality stitching and construction-whole family loves taking punches at it. Good stress reliever. But do not punch without gloves!",
      "rating": 5.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 0,
      "publication_date": 20170315
    },
    {
      "title": "Very nicely made bag",
      "text": "Very nicely made bag. Also, the included accessories are enough to get you started. You will likely need some extra chain, but almost everything else is included. Overall, a great price for a well made product.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Hollis",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "Great deal!",
      "text": "5 Star rating is based on the below only. I will update as I use it. Shipping Time: Arrived on time. Box contents: All items where included as described. Overall condition: All items arrived in new condition (although the box was slightly damaged on one side). I punched for a few minutes and for the price, looks like it will do the job. Let's see how long it lasts.",
      "rating": 5.0,
      "verified": true,
      "author": "arnold luzbet",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "Good beginner bag",
      "text": "Not a super high end bag but definitely serves it's purpose",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "A good purchase",
      "text": "This bag was delivered in torn wrinkled cardboard with barely enough packing tape to hold it together. A roll of wrist tape was missing and the zipper top was broken, however the overall durability and size made it a perfect gift. When I noted the missing tape & broken zipper to the recipient, and offered to return it~ he adamantly assurred me that the value of the bag was not in its packing format and was just what he needed.",
      "rating": 4.0,
      "verified": true,
      "author": "Horsewoman57",
      "helpful_votes": 0,
      "publication_date": 20140109
    },
    {
      "title": "Just what I needed to kick some..,Lol",
      "text": "Great quality product at a great price, skip the store! Everything is in this bundle!",
      "rating": 5.0,
      "verified": true,
      "author": "PeachLadyBug",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Investigate",
      "text": "Weight was too much for my son just starting out.",
      "rating": 3.0,
      "verified": true,
      "author": "twintwin1b",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Good value for the money",
      "text": "It’s took a few days to get here but no complaints the quality is great with gloves.",
      "rating": 5.0,
      "verified": true,
      "author": "Adan",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Love",
      "text": "We bought this to help have family workout time. My husband, con, two daughter's and myself use this all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Malinda Rackley",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Make room for this",
      "text": "Make sure you have a lot of space to use this. The stand which is sold separately is larger than expected. The bag itself is firm and is well made. This is a nice set which includes a pair of gloves.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy Day",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "A pretty cheap price for good workout",
      "text": "I got this to go along with the stand and this bag really works you out good cardio I do Had over year no problems whatsoever",
      "rating": 5.0,
      "verified": true,
      "author": "Blb",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Sweet",
      "text": "The bags been hanging since April outside, now mid-July in Ct. No issues to report",
      "rating": 5.0,
      "verified": true,
      "author": "R. Van Zandt",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "mamma got it for our 9 year old Ninja in ...",
      "text": "mamma got it for our 9 year old Ninja in training that weighs 78 lbs..... 1st punch,jammed his arm up...1st roundhouse kick didn't budge it..... he then realized his opponent was a worthy adversary...!!!!!! he's training harder for the next match!!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tim McCreary",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Comes with everthing you need",
      "text": "Haven't had it very long. So far it's exactly what I wanted with everthing I needed to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "blkhorv",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Heavy duty, made good.",
      "text": "Ordered for friend of my son's who has anger management issues. She loves it. When she gets mad she takes it out on this Everlast 70-pound Heavy duty bag. It comes with gloves too. Made good.",
      "rating": 5.0,
      "verified": true,
      "author": "Debrina Maria",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "I had this thing for a few months before the ...",
      "text": "I had this thing for a few months before the support strap broke while I was working it. Cheap material I guess.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181009
    }
  ],
  "product_meta": {
    "title": "Everlast 70-Pound MMA Heavy-Bag Kit",
    "description": "FEATURES\n * 70 lb heavy bag constructed from super tough and rugged polycanvas material.\n * Specially blended filler provides resilient shock absorbency.\n * MMA heavy bag gloves made of high quality syntehtic leather with a supportive hook-and-loop wrist strap.\n * Ideal for heavy bag workouts.\n\nWarranty:\n\nEverlast warrants its products to be free from defects in materials and workmanship for a period of 120 days from date of purchase, provided they have not been subjected to obvious abuse, neglect or misuse. Everlast's sole liability is limited to repairing or replacing products that are returned within this 120-day period, unless specific product literature specifies otherwise.",
    "rating": 4.5,
    "feature_bullets": [
      "Kit includes 70-Pound heavy bag, heavy bag gloves, 108-Inch hand wraps and bungee cord",
      "Heavy bag stuffed with a custom filling of natural and synthetic fibers blended with sifted sand",
      "Heavy Bag gloves and wraps for protecting your hands against the abrasion of the bag",
      "Customizable height with adjustable chain",
      "Bungee cord for adding greater resistance to the bag"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "41 x 12 x 12 inches; 70 Pounds",
      "Item model number": "SG70",
      "Department": "Unisex-adult",
      "Date First Available": "November 18, 2010",
      "Manufacturer": "Everlast",
      "ASIN": "B004CY3HHI",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Other Sports",
      "Boxing",
      "Punching Bags",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Heavy Bags"
    ],
    "price": ""
  }
}